[
    {
        "id": "8197ed476af14e4fa6a4e65f32793885",
        "word": "believe",
        "pos": "verb",
        "level": "a1",
        "phonetic": {
            "uk": "/bɪˈliːv/",
            "us": "/bɪˈliːv/"
        },
        "nearby": [
            {
                "word": "belief",
                "pos": "noun"
            },
            {
                "word": "believable",
                "pos": "adjective"
            },
            {
                "word": "believe",
                "pos": "verb"
            },
            {
                "word": "believe in",
                "pos": "phrasal verb"
            },
            {
                "word": "believe of",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to feel certain that something is true or that somebody is telling you the truth",
                    "vi": "để cảm thấy chắc chắn rằng điều gì đó là sự thật hoặc ai đó đang nói với bạn sự thật"
                },
                "examples": [
                    {
                        "en": "believe somebody I don't believe you!",
                        "vi": "tin ai đó Tôi không tin bạn!"
                    },
                    {
                        "en": "The man claimed to be a social worker and she believed him.",
                        "vi": "Người đàn ông tự nhận là một nhân viên xã hội và cô tin anh ta."
                    },
                    {
                        "en": "Do you really believe her?",
                        "vi": "Bạn có thực sự tin cô ấy?"
                    },
                    {
                        "en": "Believe me, she's not right for you.",
                        "vi": "Tin tôi đi, cô ấy không phù hợp với bạn."
                    },
                    {
                        "en": "believe something I believed his lies for years.",
                        "vi": "tin điều gì đó mà tôi đã tin những lời nói dối của anh ấy trong nhiều năm."
                    },
                    {
                        "en": "I find that hard to believe.",
                        "vi": "Tôi thấy khó tin."
                    },
                    {
                        "en": "Don't believe a word of it (= don't believe any part of what somebody is saying).",
                        "vi": "Đừng tin một lời nào của nó (= không tin bất kỳ phần nào của những gì ai đó đang nói)."
                    },
                    {
                        "en": "believe (that)… People used to believe (that) the earth was flat.",
                        "vi": "tin (điều đó)… Mọi người từng tin (rằng) trái đất phẳng."
                    },
                    {
                        "en": "He refused to believe (that) his son was involved in drugs.",
                        "vi": "Ông không chịu tin (rằng) con trai mình dính líu đến ma tuý."
                    },
                    {
                        "en": "I do believe you’re right (= I think something is true, even though it is surprising).",
                        "vi": "Tôi tin rằng bạn đúng (= Tôi nghĩ điều gì đó là đúng, mặc dù điều đó thật đáng ngạc nhiên)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to think that something is true or possible, although you are not completely certain",
                    "vi": "để nghĩ rằng điều gì đó là đúng hoặc có thể, mặc dù bạn không hoàn toàn chắc chắn"
                },
                "examples": [
                    {
                        "en": "‘Where does she come from?’ ‘Spain, I believe.’",
                        "vi": "Cô ấy đến từ đâu?' 'Tây Ban Nha, tôi tin.'"
                    },
                    {
                        "en": "‘Does he still work there?’ ‘I believe so/not.’",
                        "vi": "Anh ấy vẫn làm việc ở đó chứ? 'Tôi tin là như vậy / không.'"
                    },
                    {
                        "en": "believe (that)… Police believe (that) the man may be armed.",
                        "vi": "tin (điều đó)… Cảnh sát tin rằng (điều đó) người đàn ông có thể được trang bị vũ khí."
                    },
                    {
                        "en": "Experts believe that the diamond is the only one of its kind.",
                        "vi": "Các chuyên gia tin rằng viên kim cương là viên duy nhất thuộc loại này."
                    },
                    {
                        "en": "l firmly believe that she is still alive.",
                        "vi": "Tôi tin chắc rằng cô ấy vẫn còn sống."
                    },
                    {
                        "en": "There is no reason to believe he is dangerous.",
                        "vi": "Không có lý do gì để tin rằng anh ta nguy hiểm."
                    },
                    {
                        "en": "it is believed (that)… It is believed that the couple have left the country.",
                        "vi": "Nó được tin (rằng)… Người ta tin rằng cặp đôi đã rời khỏi đất nước."
                    },
                    {
                        "en": "It is widely believed that he was forced to resign.",
                        "vi": "Nhiều người tin rằng ông đã buộc phải từ chức."
                    },
                    {
                        "en": "believe something Few people believe the claim that the cost of living has not risen since last year.",
                        "vi": "tin điều gì đó Ít người tin vào tuyên bố rằng chi phí sinh hoạt đã không tăng kể từ năm ngoái."
                    },
                    {
                        "en": "be believed to be, have, etc. something The vases are believed to be worth over $20 000 each.",
                        "vi": "được tin là có, có, v.v ... gì đó Những chiếc bình được cho là trị giá trên 20.000 đô la mỗi chiếc."
                    },
                    {
                        "en": "be believed + adj. Three sailors are missing, believed drowned.",
                        "vi": "được tin + adj. Ba thủy thủ mất tích, được cho là đã chết đuối."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have the opinion that something is right or true",
                    "vi": "để có ý kiến rằng điều gì đó đúng hay đúng"
                },
                "examples": [
                    {
                        "en": "The party believes (that) education is the most important issue facing the government.",
                        "vi": "Đảng tin rằng (rằng) giáo dục là vấn đề quan trọng nhất mà chính phủ phải đối mặt."
                    },
                    {
                        "en": "She believes that killing animals for food or fur is completely immoral.",
                        "vi": "Cô ấy tin rằng giết động vật để lấy thức ăn hoặc lông thú là hoàn toàn trái đạo đức."
                    },
                    {
                        "en": "I strongly believe that competition is a good thing.",
                        "vi": "Tôi thực sự tin rằng cạnh tranh là một điều tốt."
                    },
                    {
                        "en": "She truly believes that love can change the world.",
                        "vi": "Cô ấy thực sự tin rằng tình yêu có thể thay đổi thế giới."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that you are surprised or annoyed at something",
                    "vi": "được sử dụng để nói rằng bạn ngạc nhiên hoặc khó chịu về điều gì đó"
                },
                "examples": [
                    {
                        "en": "believe (that)… She couldn’t believe (that) it was all happening again.",
                        "vi": "tin (điều đó)… Cô ấy không thể tin (điều đó) tất cả lại xảy ra."
                    },
                    {
                        "en": "I don't believe I'm doing this!",
                        "vi": "Tôi không tin là tôi đang làm điều này!"
                    },
                    {
                        "en": "believe how, what, etc… I can't believe how much better I feel.",
                        "vi": "tin như thế nào, điều gì, v.v.… Tôi không thể tin rằng mình cảm thấy tốt hơn thế nào."
                    },
                    {
                        "en": "I couldn't believe what I was hearing.",
                        "vi": "Tôi không thể tin được những gì tôi đang nghe."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have a religious faith",
                    "vi": "có một đức tin tôn giáo"
                },
                "examples": [
                    {
                        "en": "The god appears only to those who believe.",
                        "vi": "Thần chỉ xuất hiện cho những ai tin tưởng."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to introduce information that is true but that may surprise people",
                    "vi": "được sử dụng để giới thiệu thông tin đúng sự thật nhưng điều đó có thể khiến mọi người ngạc nhiên"
                },
                "examples": [
                    {
                        "en": "Believe it or not, he asked me to marry him!",
                        "vi": "Tin hay không thì tùy anh, anh đã hỏi cưới em!"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to emphasize that you strongly believe what you are saying",
                    "vi": "được sử dụng để nhấn mạnh rằng bạn thực sự tin tưởng những gì bạn đang nói"
                },
                "examples": [
                    {
                        "en": "You haven't heard the last of this, believe you me!",
                        "vi": "Bạn chưa nghe lần cuối cùng về điều này, tin bạn đi!"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to tell somebody that something is definitely not true",
                    "vi": "được sử dụng để nói với ai đó rằng điều gì đó chắc chắn không phải là sự thật"
                },
                "examples": [
                    {
                        "en": "‘She wouldn’t do a thing like that.’ ‘Don’t you believe it!’",
                        "vi": "Cô ấy sẽ không làm một điều như vậy. 'Bạn không tin!'"
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody believe/understand something",
                    "vi": "để làm cho ai đó tin / hiểu điều gì đó"
                },
                "examples": [
                    {
                        "en": "I was given to understand that she had resigned.",
                        "vi": "Tôi được cho để hiểu rằng cô ấy đã từ chức."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that you are surprised or annoyed about something",
                    "vi": "từng nói rằng bạn ngạc nhiên hoặc khó chịu về điều gì đó"
                },
                "examples": [
                    {
                        "en": "I don't believe it! What are you doing here?",
                        "vi": "Tôi không tin điều đó! Cậu đang làm gì ở đây?"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that you think somebody is stupid if they believe that something is true",
                    "vi": "từng nói rằng bạn nghĩ ai đó thật ngu ngốc nếu họ tin rằng điều gì đó là sự thật"
                },
                "examples": [
                    {
                        "en": "‘He promised not to do it again.’ ‘Sure, and if you believe that, you’ll believe anything.’",
                        "vi": "Anh ấy đã hứa sẽ không tái phạm.' 'Chắc chắn rồi, và nếu bạn tin điều đó, bạn sẽ tin bất cứ điều gì.'"
                    }
                ]
            },
            {
                "define": {
                    "en": "to pretend that something is true",
                    "vi": "giả vờ rằng một cái gì đó là sự thật"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be very surprised at something you hear/see",
                    "vi": "rất ngạc nhiên về điều gì đó bạn nghe / thấy"
                },
                "examples": [
                    {
                        "en": "I couldn't believe my eyes when she walked in.",
                        "vi": "Tôi không thể tin vào mắt mình khi cô ấy bước vào."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that somebody will have to believe that something is true when they see it, although they do not think it is true now",
                    "vi": "từng nói rằng ai đó sẽ phải tin rằng điều gì đó là sự thật khi họ nhìn thấy nó, mặc dù bây giờ họ không nghĩ nó là sự thật"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to show that you are surprised and annoyed about something",
                    "vi": "được sử dụng để cho thấy rằng bạn đang ngạc nhiên và khó chịu về điều gì đó"
                },
                "examples": [
                    {
                        "en": "And, would you believe, he didn't even apologize!",
                        "vi": "Và, bạn có tin không, anh ấy thậm chí còn không xin lỗi!"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to tell somebody that something is definitely true",
                    "vi": "được sử dụng để nói với ai đó rằng điều gì đó chắc chắn là sự thật"
                },
                "examples": [
                    {
                        "en": "‘He’s not a bad player, is he?’ ‘You’d better believe it!’",
                        "vi": "Anh ấy không phải là một cầu thủ tồi, phải không?' 'Tốt hơn hết bạn nên tin vào điều đó!'"
                    }
                ]
            }
        ]
    },
    {
        "id": "38d42317d2214752a71537690fb412a7",
        "word": "belief",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/bɪˈliːf/",
            "us": "/bɪˈliːf/"
        },
        "nearby": [
            {
                "word": "Belgravia",
                "pos": ""
            },
            {
                "word": "belie",
                "pos": "verb"
            },
            {
                "word": "belief",
                "pos": "noun"
            },
            {
                "word": "believable",
                "pos": "adjective"
            },
            {
                "word": "believe",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a strong feeling that something/somebody exists or is true; confidence that something/somebody is good or right",
                    "vi": "một cảm giác mạnh mẽ rằng một cái gì đó / ai đó tồn tại hoặc là sự thật; tự tin rằng điều gì đó / ai đó là tốt hoặc đúng"
                },
                "examples": [
                    {
                        "en": "belief in something/somebody I admire his passionate belief in what he is doing.",
                        "vi": "niềm tin vào điều gì đó / ai đó Tôi ngưỡng mộ niềm tin cuồng nhiệt của anh ấy vào những gì anh ấy đang làm."
                    },
                    {
                        "en": "belief in God/democracy",
                        "vi": "niềm tin vào Chúa / dân chủ"
                    },
                    {
                        "en": "The incident has shaken my belief (= made me have less confidence) in the police.",
                        "vi": "Vụ việc đã làm lung lay niềm tin của tôi (= khiến tôi ít tin tưởng hơn) vào cảnh sát."
                    },
                    {
                        "en": "belief that… They share a belief that there is life after death.",
                        "vi": "niềm tin rằng… Họ có chung một niềm tin rằng có sự sống sau cái chết."
                    }
                ]
            },
            {
                "define": {
                    "en": "an opinion about something; something that you think is true",
                    "vi": "một ý kiến về một cái gì đó; một cái gì đó mà bạn nghĩ là đúng"
                },
                "examples": [
                    {
                        "en": "belief that… There is a general belief that things will soon get better.",
                        "vi": "niềm tin rằng… Có một niềm tin chung rằng mọi thứ sẽ sớm trở nên tốt đẹp hơn."
                    },
                    {
                        "en": "There is a widespread belief that multinationals have too much power.",
                        "vi": "Có một niềm tin rộng rãi rằng các công ty đa quốc gia có quá nhiều quyền lực."
                    },
                    {
                        "en": "a widely/commonly held belief",
                        "vi": "một niềm tin rộng rãi / phổ biến"
                    },
                    {
                        "en": "in the belief that… She acted in the belief that she was doing good.",
                        "vi": "với niềm tin rằng… Cô ấy đã hành động với niềm tin rằng cô ấy đang làm tốt."
                    },
                    {
                        "en": "I took the job in the mistaken belief that I would be able to stay in London.",
                        "vi": "Tôi nhận công việc với niềm tin sai lầm rằng tôi sẽ có thể ở lại London."
                    },
                    {
                        "en": "Contrary to popular belief (= in spite of what people may think), he was not responsible for the tragedy.",
                        "vi": "Trái với suy nghĩ của nhiều người (= bất chấp những gì mọi người có thể nghĩ), anh ta không chịu trách nhiệm về thảm kịch."
                    }
                ]
            },
            {
                "define": {
                    "en": "something that you believe, especially as part of your religion",
                    "vi": "điều gì đó mà bạn tin tưởng, đặc biệt là một phần của tôn giáo của bạn"
                },
                "examples": [
                    {
                        "en": "religious/political beliefs",
                        "vi": "niềm tin tôn giáo / chính trị"
                    },
                    {
                        "en": "A society should be judged on its beliefs and values.",
                        "vi": "Một xã hội nên được đánh giá dựa trên niềm tin và giá trị của nó."
                    },
                    {
                        "en": "belief about something Some people hold beliefs about the world that are not supported by science.",
                        "vi": "niềm tin về điều gì đó Một số người giữ niềm tin về thế giới không được khoa học ủng hộ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be too extreme, horrible, etc. to believe/describe",
                    "vi": "quá cực đoan, khủng khiếp, v.v. để tin / mô tả"
                },
                "examples": [
                    {
                        "en": "It beggars belief how things could have got this bad.",
                        "vi": "Những người ăn xin tin rằng làm thế nào mọi thứ có thể trở nên tồi tệ như thế này."
                    }
                ]
            },
            {
                "define": {
                    "en": "(in a way that is) too great, difficult, etc. to be believed",
                    "vi": "(theo một cách nào đó) quá tuyệt vời, khó tin, v.v."
                },
                "examples": [
                    {
                        "en": "Dissatisfaction with the government has grown beyond belief.",
                        "vi": "Sự bất mãn với chính phủ đã lớn hơn niềm tin."
                    },
                    {
                        "en": "icy air that was cold beyond belief",
                        "vi": "không khí băng giá lạnh ngoài niềm tin"
                    },
                    {
                        "en": "It is beyond belief that anyone could commit such a crime.",
                        "vi": "Thật không thể tin được rằng bất cứ ai cũng có thể phạm một tội ác như vậy."
                    }
                ]
            },
            {
                "define": {
                    "en": "as far as you know",
                    "vi": "theo như bạn biết"
                },
                "examples": [
                    {
                        "en": "He never made a will, to the best of my knowledge.",
                        "vi": "Anh ấy không bao giờ lập di chúc, theo sự hiểu biết tốt nhất của tôi."
                    }
                ]
            }
        ]
    },
    {
        "id": "de75d0df0ca94fbb9eacd7364b917acf",
        "word": "religion",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/rɪˈlɪdʒən/",
            "us": "/rɪˈlɪdʒən/"
        },
        "nearby": [
            {
                "word": "relieve of",
                "pos": "phrasal verb"
            },
            {
                "word": "reliever",
                "pos": "noun"
            },
            {
                "word": "religion",
                "pos": "noun"
            },
            {
                "word": "religiosity",
                "pos": "noun"
            },
            {
                "word": "religious",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the belief in the existence of a god or gods, and the activities that are connected with the worship of them, or in the teachings of a spiritual leader",
                    "vi": "niềm tin vào sự tồn tại của một vị thần hoặc các vị thần, và các hoạt động liên quan đến việc thờ cúng chúng, hoặc vào những lời dạy của một vị lãnh đạo tinh thần"
                },
                "examples": [
                    {
                        "en": "Is there always a conflict between science and religion?",
                        "vi": "Có phải luôn luôn có xung đột giữa khoa học và tôn giáo?"
                    },
                    {
                        "en": "He believed in God but had no interest in organized religion.",
                        "vi": "Ông tin vào Chúa nhưng không quan tâm đến tôn giáo có tổ chức."
                    },
                    {
                        "en": "by religion They are Jewish by religion.",
                        "vi": "theo tôn giáo Họ là người Do Thái theo tôn giáo."
                    }
                ]
            },
            {
                "define": {
                    "en": "one of the systems of faith that are based on the belief in the existence of a particular god or gods, or in the teachings of a spiritual leader",
                    "vi": "một trong những hệ thống đức tin dựa trên niềm tin vào sự tồn tại của một vị thần cụ thể hoặc các vị thần, hoặc vào lời dạy của một nhà lãnh đạo tinh thần"
                },
                "examples": [
                    {
                        "en": "the Jewish religion",
                        "vi": "tôn giáo Do Thái"
                    },
                    {
                        "en": "Christianity, Islam and other world religions",
                        "vi": "Cơ đốc giáo, Hồi giáo và các tôn giáo thế giới khác"
                    },
                    {
                        "en": "The law states that everyone has the right to practise their own religion.",
                        "vi": "Luật pháp quy định rằng mọi người có quyền thực hành tôn giáo của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "a particular interest or influence that is very important in your life",
                    "vi": "một mối quan tâm hoặc ảnh hưởng cụ thể rất quan trọng trong cuộc sống của bạn"
                },
                "examples": [
                    {
                        "en": "For him, football is an absolute religion.",
                        "vi": "Đối với anh, bóng đá là một tôn giáo tuyệt đối."
                    },
                    {
                        "en": "Football has become an alternative religion for many people.",
                        "vi": "Bóng đá đã trở thành một tôn giáo thay thế cho nhiều người."
                    }
                ]
            },
            {
                "define": {
                    "en": "to suddenly start believing in a religion",
                    "vi": "đột nhiên bắt đầu tin vào một tôn giáo"
                },
                "examples": [
                    {
                        "en": "We're waiting for the company to get religion on recycling.",
                        "vi": "Chúng tôi đang chờ đợi công ty có được tôn giáo về tái chế."
                    }
                ]
            }
        ]
    },
    {
        "id": "0942d392cc8a45489b0dd2dfc487e074",
        "word": "religious",
        "pos": "adjective",
        "level": "b1",
        "phonetic": {
            "uk": "/rɪˈlɪdʒəs/",
            "us": "/rɪˈlɪdʒəs/"
        },
        "nearby": [
            {
                "word": "religion",
                "pos": "noun"
            },
            {
                "word": "religiosity",
                "pos": "noun"
            },
            {
                "word": "religious",
                "pos": "adjective"
            },
            {
                "word": "religiously",
                "pos": "adverb"
            },
            {
                "word": "religiousness",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "connected with religion or with a particular religion",
                    "vi": "kết nối với tôn giáo hoặc với một tôn giáo cụ thể"
                },
                "examples": [
                    {
                        "en": "religious beliefs/convictions/faith",
                        "vi": "niềm tin tôn giáo / niềm tin / đức tin"
                    },
                    {
                        "en": "religious freedom/liberty",
                        "vi": "tự do tôn giáo / tự do"
                    },
                    {
                        "en": "religious traditions/practices/ceremonies",
                        "vi": "truyền thống / thực hành / nghi lễ tôn giáo"
                    },
                    {
                        "en": "religious institutions/organizations",
                        "vi": "các cơ sở / tổ chức tôn giáo"
                    },
                    {
                        "en": "religious education (= education about religion)",
                        "vi": "giáo dục tôn giáo (= giáo dục về tôn giáo)"
                    },
                    {
                        "en": "religious instruction (= instruction in a particular religion)",
                        "vi": "hướng dẫn tôn giáo (= hướng dẫn trong một tôn giáo cụ thể)"
                    },
                    {
                        "en": "a religious order (= group of people living in a religious community)",
                        "vi": "một dòng tu (= một nhóm người sống trong một cộng đồng tôn giáo)"
                    },
                    {
                        "en": "a religious minority/community",
                        "vi": "một cộng đồng / thiểu số tôn giáo"
                    },
                    {
                        "en": "The situation for many ethnic and religious minorities remains dangerous.",
                        "vi": "Tình hình đối với nhiều dân tộc thiểu số và tôn giáo vẫn còn nguy hiểm."
                    },
                    {
                        "en": "religious groups/leaders",
                        "vi": "các nhóm / lãnh đạo tôn giáo"
                    },
                    {
                        "en": "religious conservatives",
                        "vi": "những người bảo thủ tôn giáo"
                    },
                    {
                        "en": "In 2000, the Greek government eliminated religious affiliation from citizens' identity cards.",
                        "vi": "Năm 2000, chính phủ Hy Lạp loại bỏ tôn giáo khỏi thẻ căn cước công dân."
                    },
                    {
                        "en": "objects which have a religious significance",
                        "vi": "những đồ vật có ý nghĩa tôn giáo"
                    },
                    {
                        "en": "a religious house (= a monastery or convent)",
                        "vi": "một nhà tôn giáo (= tu viện hoặc tu viện)"
                    }
                ]
            },
            {
                "define": {
                    "en": "believing strongly in a particular religion and obeying its laws and practices",
                    "vi": "tin tưởng mạnh mẽ vào một tôn giáo cụ thể và tuân theo luật pháp và thông lệ của tôn giáo đó"
                },
                "examples": [
                    {
                        "en": "His wife is very religious.",
                        "vi": "Vợ anh rất sùng đạo."
                    },
                    {
                        "en": "a deeply religious man",
                        "vi": "một người đàn ông tôn giáo sâu sắc"
                    },
                    {
                        "en": "Although I'm not particularly religious, I whispered a few words of prayer.",
                        "vi": "Mặc dù tôi không đặc biệt sùng đạo, nhưng tôi thì thầm vài lời cầu nguyện."
                    },
                    {
                        "en": "His mother noticed that he had become more religious.",
                        "vi": "Mẹ anh nhận thấy rằng anh đã trở nên sùng đạo hơn."
                    }
                ]
            }
        ]
    },
    {
        "id": "9900f04d767b49ed9b59548d6fad4f58",
        "word": "Christian",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈkrɪstʃən/",
            "us": "/ˈkrɪstʃən/"
        },
        "nearby": [
            {
                "word": "Christendom",
                "pos": "noun"
            },
            {
                "word": "christening",
                "pos": "noun"
            },
            {
                "word": "Christian",
                "pos": "adjective"
            },
            {
                "word": "Christian",
                "pos": "noun"
            },
            {
                "word": "Fletcher Christian",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "based on or believing the teachings of Jesus Christ",
                    "vi": "dựa trên hoặc tin vào những lời dạy của Chúa Giê Su Ky Tô"
                },
                "examples": [
                    {
                        "en": "the Christian Church/faith/religion",
                        "vi": "Nhà thờ Thiên chúa giáo / đức tin / tôn giáo"
                    },
                    {
                        "en": "She had a Christian upbringing.",
                        "vi": "Cô đã có một nền giáo dục Cơ đốc giáo."
                    },
                    {
                        "en": "a Christian country",
                        "vi": "một đất nước theo đạo thiên chúa"
                    }
                ]
            },
            {
                "define": {
                    "en": "connected with Christians",
                    "vi": "kết nối với những người theo đạo thiên chúa"
                },
                "examples": [
                    {
                        "en": "the Christian sector of the city",
                        "vi": "khu vực Cơ đốc của thành phố"
                    }
                ]
            },
            {
                "define": {
                    "en": "showing the qualities that are thought of as typical of a Christian; good and kind",
                    "vi": "thể hiện những phẩm chất được cho là điển hình của một Cơ đốc nhân; tốt và tốt bụng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "23ba2e01621b4691b089775fc393b982",
        "word": "Christianity",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˌkrɪstiˈænəti/",
            "us": "/ˌkrɪstiˈænəti/"
        },
        "nearby": [
            {
                "word": "Christian Coalition of America",
                "pos": ""
            },
            {
                "word": "the Christian era",
                "pos": "noun"
            },
            {
                "word": "Christianity",
                "pos": "noun"
            },
            {
                "word": "Christian name",
                "pos": "noun"
            },
            {
                "word": "Christian Science",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the religion that is based on the teachings of Jesus Christ and the belief that he was the son of God",
                    "vi": "tôn giáo dựa trên những lời dạy của Chúa Giê Su Ky Tô và niềm tin rằng ngài là con của Đức Chúa Trời"
                },
                "examples": [
                    {
                        "en": "Christianity spread rapidly in the first century.",
                        "vi": "Cơ đốc giáo lan rộng nhanh chóng trong thế kỷ đầu tiên."
                    }
                ]
            }
        ]
    },
    {
        "id": "1fae5b2eec8e47efabe71e8886df2a7a",
        "word": "civil",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈsɪvl/",
            "us": "/ˈsɪvl/"
        },
        "nearby": [
            {
                "word": "civics",
                "pos": "noun"
            },
            {
                "word": "the Civic Trust",
                "pos": ""
            },
            {
                "word": "civil",
                "pos": "adjective"
            },
            {
                "word": "the Civil Aviation Authority",
                "pos": ""
            },
            {
                "word": "civil defence",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "connected with the people who live in a country",
                    "vi": "kết nối với những người sống trong một đất nước"
                },
                "examples": [
                    {
                        "en": "civil unrest (= that is caused by groups of people within a country)",
                        "vi": "bất ổn dân sự (= do các nhóm người trong một quốc gia gây ra)"
                    },
                    {
                        "en": "civil strife/conflict",
                        "vi": "xung đột / xung đột dân sự"
                    },
                    {
                        "en": "There were concerns that the economic reforms might lead to civil unrest.",
                        "vi": "Có những lo ngại rằng những cải cách kinh tế có thể dẫn đến bất ổn dân sự."
                    }
                ]
            },
            {
                "define": {
                    "en": "connected with the state rather than with religion or with the armed forces",
                    "vi": "kết nối với nhà nước hơn là với tôn giáo hoặc với các lực lượng vũ trang"
                },
                "examples": [
                    {
                        "en": "the recognition of civil unions for same-sex couples",
                        "vi": "sự công nhận của các kết hợp dân sự cho các cặp đồng tính"
                    },
                    {
                        "en": "They were married in a civil ceremony.",
                        "vi": "Họ đã kết hôn trong một buổi lễ dân sự."
                    },
                    {
                        "en": "civil aviation",
                        "vi": "hàng không dân dụng"
                    },
                    {
                        "en": "We have called in the army to assist the civil authorities in rescue operations.",
                        "vi": "Chúng tôi đã kêu gọi quân đội hỗ trợ chính quyền dân sự trong các hoạt động cứu hộ."
                    }
                ]
            },
            {
                "define": {
                    "en": "involving personal legal matters and not criminal law",
                    "vi": "liên quan đến các vấn đề pháp lý cá nhân chứ không phải luật hình sự"
                },
                "examples": [
                    {
                        "en": "a civil court",
                        "vi": "một tòa án dân sự"
                    }
                ]
            },
            {
                "define": {
                    "en": "polite in a formal way but possibly not friendly",
                    "vi": "lịch sự một cách trang trọng nhưng có thể không thân thiện"
                },
                "examples": [
                    {
                        "en": "The less time I have to spend being civil to him the better!",
                        "vi": "Tôi càng ít thời gian để cư xử với anh ta thì càng tốt!"
                    }
                ]
            }
        ]
    },
    {
        "id": "6f16187045a741ab865b51b541a792c5",
        "word": "convert",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/kənˈvɜːt/",
            "us": "/kənˈvɜːrt/"
        },
        "nearby": [
            {
                "word": "conversion",
                "pos": "noun"
            },
            {
                "word": "conversion van",
                "pos": "noun"
            },
            {
                "word": "convert",
                "pos": "verb"
            },
            {
                "word": "convert",
                "pos": "noun"
            },
            {
                "word": "converter",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to change or make something change from one form, purpose, system, etc. to another",
                    "vi": "để thay đổi hoặc thực hiện một cái gì đó thay đổi từ một hình thức, mục đích, hệ thống, v.v. sang hình thức khác"
                },
                "examples": [
                    {
                        "en": "convert something They took just nine months to convert the building.",
                        "vi": "chuyển đổi thứ gì đó Họ chỉ mất chín tháng để chuyển đổi tòa nhà."
                    },
                    {
                        "en": "You need to ensure that you've converted the data properly.",
                        "vi": "Bạn cần đảm bảo rằng bạn đã chuyển đổi dữ liệu đúng cách."
                    },
                    {
                        "en": "The pub is a converted warehouse.",
                        "vi": "Quán rượu là một nhà kho đã được chuyển đổi."
                    },
                    {
                        "en": "convert something into something The hotel is going to be converted into a nursing home.",
                        "vi": "chuyển đổi một cái gì đó thành một cái gì đó Khách sạn sẽ được chuyển đổi thành một viện dưỡng lão."
                    },
                    {
                        "en": "What rate will I get if I convert my dollars into euros?",
                        "vi": "Tôi sẽ nhận được tỷ giá bao nhiêu nếu chuyển đô la của mình sang euro?"
                    },
                    {
                        "en": "convert something to something The system is eco-friendly because the waste heat is converted to electricity.",
                        "vi": "chuyển đổi thứ gì đó thành thứ gì đó Hệ thống thân thiện với môi trường vì nhiệt thải được chuyển hóa thành điện năng."
                    },
                    {
                        "en": "convert from something Japan was at the time still converting from an agricultural economy.",
                        "vi": "chuyển đổi từ một thứ mà Nhật Bản lúc đó vẫn đang chuyển đổi từ nền kinh tế nông nghiệp."
                    },
                    {
                        "en": "convert into/to something A lot of conventional farmers have converted to organic production.",
                        "vi": "Chuyển đổi thành / sang thứ gì đó Rất nhiều nông dân thông thường đã chuyển đổi sang sản xuất hữu cơ."
                    },
                    {
                        "en": "convert from something to something We've converted from oil to gas central heating.",
                        "vi": "chuyển đổi từ một cái gì đó thành một cái gì đó Chúng tôi đã chuyển đổi từ dầu sang khí đốt sưởi ấm trung tâm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be able to be changed from one form, purpose, or system to another",
                    "vi": "để có thể được thay đổi từ hình thức, mục đích hoặc hệ thống này sang hình thức, mục đích hoặc hệ thống khác"
                },
                "examples": [
                    {
                        "en": "a sofa that converts into a bed",
                        "vi": "ghế sofa có thể chuyển đổi thành giường ngủ"
                    },
                    {
                        "en": "In fruits, starch converts into sugar.",
                        "vi": "Trong trái cây, tinh bột chuyển hóa thành đường."
                    }
                ]
            },
            {
                "define": {
                    "en": "to change your religion or beliefs; to make somebody change their religion or beliefs",
                    "vi": "để thay đổi tôn giáo hoặc tín ngưỡng của bạn; để khiến ai đó thay đổi tôn giáo hoặc tín ngưỡng của họ"
                },
                "examples": [
                    {
                        "en": "convert from something He converted from Catholicism 20 years ago.",
                        "vi": "chuyển đổi từ một cái gì đó Ông đã cải đạo từ Công giáo 20 năm trước."
                    },
                    {
                        "en": "convert to something She converted to Judaism to marry him.",
                        "vi": "Cô cải sang đạo Do Thái để cưới anh."
                    },
                    {
                        "en": "convert from something to something He converted from Christianity to Islam.",
                        "vi": "chuyển đổi từ một cái gì đó sang một cái gì đó Ông đã chuyển đổi từ Cơ đốc giáo sang Hồi giáo."
                    },
                    {
                        "en": "convert somebody from something Evangelical Christian groups tried to convert local people from their indigenous religions.",
                        "vi": "chuyển đổi ai đó từ một cái gì đó Các nhóm Cơ đốc giáo Tin lành đã cố gắng chuyển đổi người dân địa phương khỏi các tôn giáo bản địa của họ."
                    },
                    {
                        "en": "convert somebody to something She was soon converted to the socialist cause.",
                        "vi": "chuyển đổi ai đó thành một cái gì đó Cô ấy đã sớm được chuyển đổi sang sự nghiệp xã hội chủ nghĩa."
                    },
                    {
                        "en": "convert somebody from something to something Mongolia was converted from shamanism to Buddhism in the late 16th century.",
                        "vi": "Chuyển đổi ai đó từ một cái gì đó sang một cái gì đó Mông Cổ đã được chuyển đổi từ Shaman giáo sang Phật giáo vào cuối thế kỷ 16."
                    }
                ]
            },
            {
                "define": {
                    "en": "to change an opinion, a habit, etc.",
                    "vi": "để thay đổi một quan điểm, một thói quen, v.v."
                },
                "examples": [
                    {
                        "en": "convert (from something) to something I've converted to organic food.",
                        "vi": "chuyển đổi (từ một cái gì đó) sang một cái gì đó mà tôi đã chuyển đổi thành thực phẩm hữu cơ."
                    },
                    {
                        "en": "convert somebody (from something) (to something) I didn't use to like opera but my husband has converted me.",
                        "vi": "chuyển đổi ai đó (từ cái gì đó) (thành cái gì đó) Tôi không thích opera nhưng chồng tôi đã chuyển đổi tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to score extra points after a try or a touchdown",
                    "vi": "để ghi thêm điểm sau một lần thử hoặc một lần chạm xuống"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to speak to people in support of views that they already hold",
                    "vi": "nói chuyện với những người ủng hộ các quan điểm mà họ đã có"
                },
                "examples": [
                    {
                        "en": "I realize I may be preaching to the converted, but I think he's gorgeous.",
                        "vi": "Tôi nhận ra rằng tôi có thể đang giảng cho những người đã cải đạo, nhưng tôi nghĩ anh ấy thật tuyệt."
                    }
                ]
            }
        ]
    },
    {
        "id": "7a0a5e34dba74214a9c4347eaa3a8052",
        "word": "faith",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/feɪθ/",
            "us": "/feɪθ/"
        },
        "nearby": [
            {
                "word": "fairy-tale",
                "pos": "adjective"
            },
            {
                "word": "fait accompli",
                "pos": "noun"
            },
            {
                "word": "faith",
                "pos": "noun"
            },
            {
                "word": "Faith",
                "pos": ""
            },
            {
                "word": "faithful",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "trust in somebody’s ability or knowledge; trust that somebody/something will do what has been promised",
                    "vi": "tin tưởng vào khả năng hoặc kiến thức của ai đó; tin tưởng rằng ai đó / điều gì đó sẽ làm những gì đã hứa"
                },
                "examples": [
                    {
                        "en": "If the company can retain its customers' faith, it could become the market leader.",
                        "vi": "Nếu công ty có thể giữ được niềm tin của khách hàng, công ty có thể trở thành công ty dẫn đầu thị trường."
                    },
                    {
                        "en": "faith in somebody/something I have faith in you—I know you'll do well.",
                        "vi": "niềm tin vào ai đó / điều gì đó tôi có niềm tin vào bạn — tôi biết bạn sẽ làm tốt."
                    },
                    {
                        "en": "We've lost faith in the government's promises.",
                        "vi": "Chúng tôi đã mất niềm tin vào những lời hứa của chính phủ."
                    },
                    {
                        "en": "Her friend's kindness has restored her faith in human nature.",
                        "vi": "Lòng tốt của bạn cô đã khôi phục niềm tin của cô vào bản chất con người."
                    },
                    {
                        "en": "I wouldn't put too much faith in what she says.",
                        "vi": "Tôi sẽ không đặt quá nhiều niềm tin vào những gì cô ấy nói."
                    },
                    {
                        "en": "He has blind faith (= unreasonable trust) in doctors' ability to find a cure.",
                        "vi": "Anh ta có niềm tin mù quáng (= sự tin tưởng vô lý) vào khả năng tìm ra phương pháp chữa trị của các bác sĩ."
                    }
                ]
            },
            {
                "define": {
                    "en": "strong religious belief",
                    "vi": "niềm tin tôn giáo mạnh mẽ"
                },
                "examples": [
                    {
                        "en": "to have faith",
                        "vi": "có niềm tin"
                    },
                    {
                        "en": "to lose your faith",
                        "vi": "đánh mất niềm tin của bạn"
                    },
                    {
                        "en": "Faith is stronger than reason.",
                        "vi": "Niềm tin mạnh hơn lý trí."
                    },
                    {
                        "en": "a woman of strong religious faith",
                        "vi": "một phụ nữ có đức tin tôn giáo mạnh mẽ"
                    },
                    {
                        "en": "faith in somebody/something He started questioning his faith in God.",
                        "vi": "đức tin vào ai đó / điều gì đó Anh ấy bắt đầu đặt câu hỏi về niềm tin của mình vào Chúa."
                    }
                ]
            },
            {
                "define": {
                    "en": "a particular religion",
                    "vi": "một tôn giáo cụ thể"
                },
                "examples": [
                    {
                        "en": "the Christian/Catholic/Islamic/Muslim/Jewish faith",
                        "vi": "đức tin Cơ đốc / Công giáo / Hồi giáo / Hồi giáo / Do Thái"
                    },
                    {
                        "en": "The children are learning to understand people of different faiths.",
                        "vi": "Những đứa trẻ đang học cách hiểu những người thuộc các tín ngưỡng khác nhau."
                    },
                    {
                        "en": "people of all faiths and none",
                        "vi": "mọi người của tất cả các tín ngưỡng và không có"
                    }
                ]
            },
            {
                "define": {
                    "en": "the intention to do something right/wrong",
                    "vi": "ý định làm điều gì đó đúng / sai"
                },
                "examples": [
                    {
                        "en": "They handed over the weapons as a gesture of good faith.",
                        "vi": "Họ giao nộp vũ khí như một cử chỉ thiện chí."
                    },
                    {
                        "en": "The judge did not find any bad faith on the part of the defendants.",
                        "vi": "Thẩm phán không tìm thấy bất kỳ niềm tin xấu nào từ phía các bị cáo."
                    }
                ]
            },
            {
                "define": {
                    "en": "to break/keep a promise that you have made to somebody; to stop/continue supporting somebody",
                    "vi": "để phá vỡ / giữ lời hứa mà bạn đã hứa với ai đó; dừng / tiếp tục hỗ trợ ai đó"
                },
                "examples": [
                    {
                        "en": "As club manager he was not prepared to keep faith with the players who had failed him.",
                        "vi": "Với tư cách là người quản lý câu lạc bộ, ông đã không chuẩn bị để giữ niềm tin với những cầu thủ đã thất bại với mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "knowing that what you are doing is wrong",
                    "vi": "biết rằng những gì bạn đang làm là sai"
                },
                "examples": [
                    {
                        "en": "They had entered into the contract in bad faith.",
                        "vi": "Họ đã tham gia vào hợp đồng với đức tin xấu."
                    }
                ]
            },
            {
                "define": {
                    "en": "believing that what you are doing is right; believing that something is correct",
                    "vi": "tin rằng những gì bạn đang làm là đúng; tin rằng điều gì đó là đúng"
                },
                "examples": [
                    {
                        "en": "We printed the report in good faith but have now learnt that it was incorrect.",
                        "vi": "Chúng tôi đã in báo cáo một cách thiện chí nhưng bây giờ mới biết rằng báo cáo đó không chính xác."
                    },
                    {
                        "en": "He bought the painting in good faith (= he did not know that it had been stolen).",
                        "vi": "Anh ta mua bức tranh một cách thiện chí (= anh ta không biết rằng nó đã bị đánh cắp)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a belief in something that is not known or has not been done before",
                    "vi": "niềm tin vào điều gì đó chưa được biết đến hoặc chưa được thực hiện trước đây"
                },
                "examples": [
                    {
                        "en": "These reforms are totally untested and will require a leap of faith on the part of teachers.",
                        "vi": "Những cải cách này hoàn toàn chưa được thử nghiệm và sẽ đòi hỏi một bước nhảy vọt về niềm tin từ phía các giáo viên."
                    }
                ]
            },
            {
                "define": {
                    "en": "to rely on somebody/something completely for success or help",
                    "vi": "dựa hoàn toàn vào ai đó / điều gì đó để đạt được thành công hoặc sự giúp đỡ"
                },
                "examples": [
                    {
                        "en": "She did not pin much faith on their chances of success.",
                        "vi": "Cô không đặt nhiều niềm tin vào cơ hội thành công của họ."
                    }
                ]
            }
        ]
    },
    {
        "id": "bd74cc4832634ef8861dff5c64e53300",
        "word": "heaven",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈhevn/",
            "us": "/ˈhevn/"
        },
        "nearby": [
            {
                "word": "heave",
                "pos": "noun"
            },
            {
                "word": "heave-ho",
                "pos": "noun"
            },
            {
                "word": "heaven",
                "pos": "noun"
            },
            {
                "word": "heavenly",
                "pos": "adjective"
            },
            {
                "word": "heaven-sent",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the place believed to be the home of God where good people go when they die, sometimes imagined to be in the sky",
                    "vi": "nơi được cho là nhà của Chúa, nơi những người tốt sẽ đến khi họ chết, đôi khi được tưởng tượng là ở trên bầu trời"
                },
                "examples": [
                    {
                        "en": "the kingdom of heaven",
                        "vi": "vương quốc thiên đàng"
                    },
                    {
                        "en": "I feel like I've died and gone to heaven.",
                        "vi": "Tôi cảm thấy như mình đã chết và lên thiên đường."
                    },
                    {
                        "en": "in heaven I told her Daddy was in heaven with God.",
                        "vi": "ở trên thiên đường, tôi nói với cô ấy rằng bố ở trên thiên đường với Chúa."
                    },
                    {
                        "en": "Our child seemed a gift from heaven.",
                        "vi": "Con của chúng tôi dường như là một món quà từ thiên đường."
                    }
                ]
            },
            {
                "define": {
                    "en": "a place or situation in which you are very happy",
                    "vi": "một địa điểm hoặc hoàn cảnh mà bạn rất hạnh phúc"
                },
                "examples": [
                    {
                        "en": "This isn't exactly my idea of heaven!",
                        "vi": "Đây không chính xác là ý tưởng của tôi về thiên đường!"
                    },
                    {
                        "en": "in heaven Shopping is my favourite pastime, so I was in heaven.",
                        "vi": "trên thiên đường Mua sắm là thú tiêu khiển yêu thích của tôi, vì vậy tôi đã ở trên thiên đường."
                    },
                    {
                        "en": "it is heaven doing something It was heaven being away from the office for a week.",
                        "vi": "Đó là thiên đường đang làm một cái gì đó Đó là thiên đường khi phải xa văn phòng trong một tuần."
                    },
                    {
                        "en": "The island is truly a heaven on earth.",
                        "vi": "Hòn đảo thực sự là một thiên đường trên trái đất."
                    },
                    {
                        "en": "heaven for somebody Tasmania is heaven for hikers and campers.",
                        "vi": "thiên đường cho ai đó Tasmania là thiên đường cho những người đi bộ đường dài và cắm trại."
                    }
                ]
            },
            {
                "define": {
                    "en": "the sky",
                    "vi": "bầu trời"
                },
                "examples": [
                    {
                        "en": "Four tall trees stretched up to the heavens.",
                        "vi": "Bốn cây cao vươn lên tận trời cao."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to emphasize what you are saying when you are surprised, shocked or annoyed",
                    "vi": "được sử dụng để nhấn mạnh những gì bạn đang nói khi bạn ngạc nhiên, sốc hoặc khó chịu"
                },
                "examples": [
                    {
                        "en": "God, what a stupid thing to do!",
                        "vi": "Chúa ơi, làm một việc ngu ngốc làm sao!"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that you hope that something will not happen",
                    "vi": "từng nói rằng bạn hy vọng rằng điều gì đó sẽ không xảy ra"
                },
                "examples": [
                    {
                        "en": "‘Maybe you'll end up as a lawyer, like me.’ ‘God forbid!’",
                        "vi": "Có lẽ bạn sẽ trở thành một luật sư, giống như tôi.' 'Chúa cấm!'"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that you are afraid somebody will be in danger or that something bad will happen to them",
                    "vi": "từng nói rằng bạn sợ ai đó gặp nguy hiểm hoặc điều gì đó tồi tệ sẽ xảy ra với họ"
                },
                "examples": [
                    {
                        "en": "God help us if this doesn't work.",
                        "vi": "Chúa giúp chúng tôi nếu điều này không hiệu quả."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to emphasize that you do not know something",
                    "vi": "được sử dụng để nhấn mạnh rằng bạn không biết điều gì đó"
                },
                "examples": [
                    {
                        "en": "God knows what else they might find.",
                        "vi": "Chúa biết những gì khác họ có thể tìm thấy."
                    },
                    {
                        "en": "‘Where are they?’ ‘Goodness knows.’",
                        "vi": "Họ ở đâu?' 'Lòng tốt biết.'"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to emphasize the truth of what you are saying",
                    "vi": "được sử dụng để nhấn mạnh sự thật của những gì bạn đang nói"
                },
                "examples": [
                    {
                        "en": "She ought to pass the exam—goodness knows she's been working hard enough.",
                        "vi": "Cô ấy phải vượt qua kỳ thi — trời cho biết cô ấy đã làm việc đủ chăm chỉ."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that you are frightened of the idea of something happening",
                    "vi": "từng nói rằng bạn sợ hãi về ý tưởng có điều gì đó xảy ra"
                },
                "examples": [
                    {
                        "en": "Heaven forfend that students are encouraged to think!",
                        "vi": "Thiên đường cho rằng học sinh được khuyến khích suy nghĩ!"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to show that you are surprised or annoyed",
                    "vi": "được sử dụng để cho thấy rằng bạn ngạc nhiên hoặc khó chịu"
                },
                "examples": [
                    {
                        "en": "Good heavens, what are you doing?",
                        "vi": "Chúa ơi, anh đang làm gì vậy?"
                    }
                ]
            },
            {
                "define": {
                    "en": "it begins to rain heavily",
                    "vi": "trời bắt đầu mưa to"
                },
                "examples": [
                    {
                        "en": "All at once the heavens opened and everyone rushed for cover.",
                        "vi": "Tất cả cùng một lúc, bầu trời mở ra và mọi người vội vã tìm chỗ ẩn nấp."
                    }
                ]
            },
            {
                "define": {
                    "en": "used especially in questions to show that you are angry, surprised or shocked",
                    "vi": "được sử dụng đặc biệt trong các câu hỏi để thể hiện rằng bạn đang tức giận, ngạc nhiên hoặc bị sốc"
                },
                "examples": [
                    {
                        "en": "What in God's name was that noise?",
                        "vi": "Tiếng ồn đó nhân danh Chúa là gì?"
                    },
                    {
                        "en": "Where in the name of Heaven have you been?",
                        "vi": "Bạn đã ở đâu nhân danh Thiên đường?"
                    }
                ]
            },
            {
                "define": {
                    "en": "extremely happy",
                    "vi": "vô cùng hạnh phúc"
                },
                "examples": [
                    {
                        "en": "Now that he's been promoted he's in seventh heaven.",
                        "vi": "Bây giờ anh ấy đã được thăng chức, anh ấy đang ở trên thiên đường thứ bảy."
                    }
                ]
            },
            {
                "define": {
                    "en": "seeming to be perfect",
                    "vi": "dường như là hoàn hảo"
                },
                "examples": [
                    {
                        "en": "Everyone thought that theirs was a marriage made in heaven.",
                        "vi": "Ai cũng nghĩ rằng cuộc hôn nhân của họ là do trời định."
                    }
                ]
            },
            {
                "define": {
                    "en": "to do everything you possibly can in order to achieve something",
                    "vi": "làm mọi thứ bạn có thể để đạt được điều gì đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to have a strong unpleasant smell",
                    "vi": "có một mùi khó chịu mạnh"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to seem to be very dishonest or morally unacceptable",
                    "vi": "dường như rất không trung thực hoặc không thể chấp nhận được về mặt đạo đức"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to say that you are pleased about something",
                    "vi": "từng nói rằng bạn hài lòng về điều gì đó"
                },
                "examples": [
                    {
                        "en": "Thank God you're safe!",
                        "vi": "Cảm ơn Chúa, bạn đã an toàn!"
                    },
                    {
                        "en": "‘Thank goodness for that!’ she said with a sigh of relief.",
                        "vi": "Cảm ơn chúa vì điều đó!' cô ấy nói với một hơi thở nhẹ nhõm."
                    },
                    {
                        "en": "Thank heavens I've found my keys.",
                        "vi": "Cảm ơn trời, tôi đã tìm thấy chìa khóa của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "used after a verb to emphasize a particular hope, wish, etc.",
                    "vi": "được sử dụng sau động từ để nhấn mạnh một hy vọng, mong muốn cụ thể, v.v."
                },
                "examples": [
                    {
                        "en": "I wish to God you'd learn to pay attention!",
                        "vi": "Tôi ước Chúa bạn sẽ học được cách chú ý!"
                    }
                ]
            }
        ]
    },
    {
        "id": "faf7187b174647f380a818d012027c03",
        "word": "hell",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/hel/",
            "us": "/hel/"
        },
        "nearby": [
            {
                "word": "helium",
                "pos": "noun"
            },
            {
                "word": "helix",
                "pos": "noun"
            },
            {
                "word": "hell",
                "pos": "noun"
            },
            {
                "word": "he'll",
                "pos": "short form"
            },
            {
                "word": "hellacious",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the place believed to be the home of devils and where bad people go after death",
                    "vi": "nơi được cho là nhà của ma quỷ và nơi những người xấu đi sau khi chết"
                },
                "examples": [
                    {
                        "en": "He was terrified of going to hell when he died.",
                        "vi": "Anh ta sợ hãi sẽ xuống địa ngục khi chết."
                    },
                    {
                        "en": "in hell They were threatened with spending eternity in hell.",
                        "vi": "trong địa ngục Họ bị đe dọa sẽ sống vĩnh viễn trong địa ngục."
                    }
                ]
            },
            {
                "define": {
                    "en": "a very unpleasant experience or situation in which people suffer very much",
                    "vi": "một trải nghiệm hoặc tình huống rất khó chịu mà mọi người phải chịu đựng rất nhiều"
                },
                "examples": [
                    {
                        "en": "The last three months have been hell.",
                        "vi": "Ba tháng qua thật là địa ngục."
                    },
                    {
                        "en": "He went through hell during the trial.",
                        "vi": "Anh ấy đã trải qua địa ngục trong thời gian thử thách."
                    },
                    {
                        "en": "Her parents made her life hell.",
                        "vi": "Cha mẹ cô đã biến cuộc sống của cô thành địa ngục."
                    },
                    {
                        "en": "Being totally alone is my idea of hell on earth.",
                        "vi": "Hoàn toàn cô đơn là ý tưởng của tôi về địa ngục trần gian."
                    },
                    {
                        "en": "He was in a hell of his own making.",
                        "vi": "Anh ấy đang ở trong một địa ngục của chính mình tạo ra."
                    },
                    {
                        "en": "in hell For the last few weeks my whole family has been in hell because of this.",
                        "vi": "trong địa ngục Trong vài tuần qua, cả gia đình tôi đã ở trong địa ngục vì điều này."
                    },
                    {
                        "en": "hell for somebody Since she moved in, life has been hell for the other residents.",
                        "vi": "địa ngục cho ai đó Kể từ khi cô ấy chuyển đến, cuộc sống của những cư dân khác đã trở thành địa ngục."
                    },
                    {
                        "en": "it is hell doing something It was hell getting through airport security.",
                        "vi": "Nó là địa ngục làm một cái gì đó Nó là địa ngục để thông qua an ninh sân bay."
                    }
                ]
            },
            {
                "define": {
                    "en": "a swear word that some people use when they are annoyed or surprised or to emphasize something. Its use is offensive to some people.",
                    "vi": "một từ chửi thề mà một số người sử dụng khi họ khó chịu hoặc ngạc nhiên hoặc để nhấn mạnh điều gì đó. Việc sử dụng nó gây khó chịu cho một số người."
                },
                "examples": [
                    {
                        "en": "Oh hell, I've burned the pan.",
                        "vi": "Ôi trời, tôi đã làm cháy cái chảo rồi."
                    },
                    {
                        "en": "What the hell do you think you are doing?",
                        "vi": "Bạn nghĩ bạn đang làm cái quái gì vậy?"
                    },
                    {
                        "en": "Go to hell!",
                        "vi": "Đi chết đi!"
                    },
                    {
                        "en": "I can't really afford it, but, what the hell (= it doesn't matter), I'll get it anyway.",
                        "vi": "Tôi thực sự không đủ tiền mua nó, nhưng, cái quái gì (= nó không quan trọng), tôi sẽ lấy nó."
                    },
                    {
                        "en": "He's as guilty as hell.",
                        "vi": "Anh ta tội lỗi như địa ngục."
                    },
                    {
                        "en": "(North American English) ‘Do you understand?’ ‘Hell, no. I don't.’",
                        "vi": "(Tiếng Anh Bắc Mỹ) 'Bạn có hiểu không?' 'Trời ơi không. Tôi không.'"
                    }
                ]
            },
            {
                "define": {
                    "en": "suddenly there was a lot of noise, arguing, fighting, etc.",
                    "vi": "đột nhiên có nhiều tiếng ồn ào, tranh cãi, đánh nhau, v.v."
                },
                "examples": [
                    {
                        "en": "There was a loud bang and then all hell broke loose.",
                        "vi": "Có một tiếng nổ lớn và sau đó tất cả địa ngục tan rã."
                    }
                ]
            },
            {
                "define": {
                    "en": "to hit somebody/something very hard",
                    "vi": "đánh ai đó / cái gì đó rất khó"
                },
                "examples": [
                    {
                        "en": "He was a dirty player and loved to kick hell out of the opposition.",
                        "vi": "Anh ta là một cầu thủ bẩn thỉu và thích đá văng khỏi địa ngục của phe đối lập."
                    }
                ]
            },
            {
                "define": {
                    "en": "to annoy somebody very much",
                    "vi": "làm phiền ai đó rất nhiều"
                },
                "examples": [
                    {
                        "en": "The song just bugs the hell out of me.",
                        "vi": "Bài hát chỉ làm tôi khó chịu."
                    },
                    {
                        "en": "Those two idiots bug the shit out of me.",
                        "vi": "Hai tên ngu ngốc đó làm hỏng chuyện của tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be punished or spoken to angrily about something",
                    "vi": "bị trừng phạt hoặc nói chuyện giận dữ về điều gì đó"
                },
                "examples": [
                    {
                        "en": "If your dad finds out you'll really catch hell!",
                        "vi": "Nếu bố của bạn phát hiện ra, bạn sẽ thực sự bị sa thải!"
                    }
                ]
            },
            {
                "define": {
                    "en": "a lot of trouble",
                    "vi": "rất nhiều rắc rối"
                },
                "examples": [
                    {
                        "en": "There'll be hell to pay when he finds out.",
                        "vi": "Sẽ có địa ngục phải trả khi anh ta phát hiện ra."
                    }
                ]
            },
            {
                "define": {
                    "en": "just for fun; for no real reason",
                    "vi": "chỉ để cho vui; không có lý do thực sự"
                },
                "examples": [
                    {
                        "en": "They stole the car just for the hell of it.",
                        "vi": "Họ đã đánh cắp chiếc xe chỉ vì cái quái quỷ của nó."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to describe a very unpleasant person or thing; the worst that you can imagine",
                    "vi": "được sử dụng để mô tả một người hoặc vật rất khó chịu; điều tồi tệ nhất mà bạn có thể tưởng tượng"
                },
                "examples": [
                    {
                        "en": "They are the neighbours from hell.",
                        "vi": "Họ là những người hàng xóm đến từ địa ngục."
                    }
                ]
            },
            {
                "define": {
                    "en": "to leave a place very quickly",
                    "vi": "rời khỏi một nơi rất nhanh chóng"
                },
                "examples": [
                    {
                        "en": "Let's get the hell out of here.",
                        "vi": "Hãy đi khỏi đây."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make life unpleasant for somebody",
                    "vi": "làm cho cuộc sống khó chịu cho ai đó"
                },
                "examples": [
                    {
                        "en": "He used to give his mother hell when he was a teenager.",
                        "vi": "Anh đã từng cho mẹ mình địa ngục khi còn là một thiếu niên."
                    },
                    {
                        "en": "My new shoes are giving me hell (= are hurting me).",
                        "vi": "Đôi giày mới của tôi đang mang lại cho tôi địa ngục (= đang làm tổn thương tôi)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to shout at or speak angrily to somebody",
                    "vi": "hét vào mặt hoặc nói chuyện giận dữ với ai đó"
                },
                "examples": [
                    {
                        "en": "Dad will give us hell when he sees that mess.",
                        "vi": "Bố sẽ cho chúng tôi địa ngục khi nhìn thấy đống hỗn độn đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "to get into a very bad state",
                    "vi": "rơi vào trạng thái rất tồi tệ"
                },
                "examples": [
                    {
                        "en": "This firm's gone to hell in a handbasket since the new management took over.",
                        "vi": "Công ty này đã sụp đổ trong gang tấc kể từ khi ban quản lý mới tiếp quản."
                    }
                ]
            },
            {
                "define": {
                    "en": "as quickly as possible",
                    "vi": "càng nhanh càng tốt"
                },
                "examples": [
                    {
                        "en": "to ride hell for leather",
                        "vi": "đi xe địa ngục vì đồ da"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to refer to somebody, usually a woman, who has reacted very angrily to something, especially the fact that her husband or partner has been unfaithful",
                    "vi": "được sử dụng để chỉ một người nào đó, thường là phụ nữ, người đã phản ứng rất tức giận với điều gì đó, đặc biệt là việc chồng hoặc bạn đời của cô ấy không chung thủy"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to give emphasis to what a person is saying",
                    "vi": "được sử dụng để nhấn mạnh những gì một người đang nói"
                },
                "examples": [
                    {
                        "en": "The firm was in a hell of a mess when he took over.",
                        "vi": "Công ty rơi vào tình trạng hỗn loạn khi ông tiếp quản."
                    },
                    {
                        "en": "This holiday is going to cost a hell of a lot of money.",
                        "vi": "Kỳ nghỉ này sẽ tiêu tốn rất nhiều tiền."
                    },
                    {
                        "en": "It must have been one hell of a party.",
                        "vi": "Đó hẳn là một bữa tiệc quái đản."
                    },
                    {
                        "en": "It’s taken him a hell of a long time to get here.",
                        "vi": "Anh ấy đã mất một thời gian dài để đến được đây."
                    },
                    {
                        "en": "That's one helluva big house you've got.",
                        "vi": "Đó là một ngôi nhà lớn mà bạn có."
                    }
                ]
            },
            {
                "define": {
                    "en": "despite any difficulties",
                    "vi": "bất chấp khó khăn"
                },
                "examples": [
                    {
                        "en": "I was determined to go, come hell or high water.",
                        "vi": "Tôi đã quyết tâm đi, đến địa ngục hoặc nước cao."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to express anger or surprise",
                    "vi": "được sử dụng để bày tỏ sự tức giận hoặc ngạc nhiên"
                },
                "examples": [
                    {
                        "en": "Hell’s teeth, I promised I’d be back by two.",
                        "vi": "Răng quỷ, tôi đã hứa là tôi sẽ quay lại trước hai giờ."
                    }
                ]
            },
            {
                "define": {
                    "en": "very fast",
                    "vi": "rất nhanh"
                },
                "examples": [
                    {
                        "en": "She was driving like a bat out of hell.",
                        "vi": "Cô ấy đang lái xe như một con dơi ra khỏi địa ngục."
                    }
                ]
            },
            {
                "define": {
                    "en": "used for emphasis",
                    "vi": "được sử dụng để nhấn mạnh"
                },
                "examples": [
                    {
                        "en": "She worked like hell for her exams.",
                        "vi": "Cô ấy đã làm việc như địa ngục cho các kỳ thi của mình."
                    },
                    {
                        "en": "My broken finger hurt like hell.",
                        "vi": "Ngón tay gãy của tôi đau như búa bổ."
                    }
                ]
            },
            {
                "define": {
                    "en": "used when you are refusing permission or saying that something is not true",
                    "vi": "được sử dụng khi bạn đang từ chối sự cho phép hoặc nói rằng điều gì đó không đúng sự thật"
                },
                "examples": [
                    {
                        "en": "‘I'm coming with you.’ ‘Like hell you are (= you certainly are not).’",
                        "vi": "Tôi đang đến với bạn.' 'Giống như bạn vậy (= bạn chắc chắn không phải vậy).'"
                    }
                ]
            },
            {
                "define": {
                    "en": "to have no chance at all",
                    "vi": "không có cơ hội nào cả"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to have no chance at all",
                    "vi": "không có cơ hội nào cả"
                },
                "examples": [
                    {
                        "en": "She doesn't have a hope of winning.",
                        "vi": "Cô ấy không có hy vọng chiến thắng."
                    },
                    {
                        "en": "You don't have a hope in hell of finding a job.",
                        "vi": "Bạn không có hy vọng tìm được việc làm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have no chance at all",
                    "vi": "không có cơ hội nào cả"
                },
                "examples": [
                    {
                        "en": "There isn't a snowball's chance in hell that I'll wear that thing!",
                        "vi": "Không có chuyện quả cầu tuyết mà tôi sẽ mặc thứ đó!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to affect something/somebody badly",
                    "vi": "ảnh hưởng xấu đến một cái gì đó / ai đó"
                },
                "examples": [
                    {
                        "en": "Driving on these rough roads has played hell with my tyres.",
                        "vi": "Lái xe trên những con đường gồ ghề này đã chơi với lốp xe của tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to protest angrily, especially in a way that causes trouble for somebody",
                    "vi": "phản đối một cách giận dữ, đặc biệt là theo cách gây rắc rối cho ai đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "it is not enough to intend to do good things; you must actually do them",
                    "vi": "ý định làm điều tốt thôi là chưa đủ; bạn thực sự phải làm chúng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to frighten, annoy, etc. somebody very much",
                    "vi": "sợ hãi, khó chịu, v.v. ai đó rất nhiều"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to say that somebody has been through a difficult situation",
                    "vi": "từng nói rằng ai đó đã trải qua một tình huống khó khăn"
                },
                "examples": [
                    {
                        "en": "We'd been to hell and back together and we were still good friends.",
                        "vi": "Chúng tôi đã từng đến địa ngục và trở lại cùng nhau và chúng tôi vẫn là bạn tốt của nhau."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to express anger or dislike and to say that you no longer care about somebody/something and will take no notice of them",
                    "vi": "được sử dụng để bày tỏ sự tức giận hoặc không thích và để nói rằng bạn không còn quan tâm đến ai đó / điều gì đó và sẽ không để ý đến họ"
                },
                "examples": [
                    {
                        "en": "‘To hell with him,’ she thought, ‘I'm leaving.’",
                        "vi": "Chết tiệt với anh ta, cô nghĩ, \"Mình đi đây.\""
                    }
                ]
            }
        ]
    },
    {
        "id": "19a4a7129f1a496a9e7325e9ca257e9d",
        "word": "Hindu",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈhɪnduː/",
            "us": "/ˈhɪnduː/"
        },
        "nearby": [
            {
                "word": "hindrance",
                "pos": "noun"
            },
            {
                "word": "hindsight",
                "pos": "noun"
            },
            {
                "word": "Hindu",
                "pos": "adjective"
            },
            {
                "word": "Hindu",
                "pos": "noun"
            },
            {
                "word": "Hinduism",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "connected with Hinduism or people who are Hindus",
                    "vi": "kết nối với Ấn Độ giáo hoặc những người theo đạo Hindu"
                },
                "examples": [
                    {
                        "en": "a Hindu temple",
                        "vi": "một ngôi đền Hindu"
                    }
                ]
            }
        ]
    },
    {
        "id": "0ca60d2c14f74d54bb74bad072c5efa6",
        "word": "Hinduism",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈhɪnduːɪzəm/",
            "us": "/ˈhɪnduːɪzəm/"
        },
        "nearby": [
            {
                "word": "Hindu",
                "pos": "adjective"
            },
            {
                "word": "Hindu",
                "pos": "noun"
            },
            {
                "word": "Hinduism",
                "pos": "noun"
            },
            {
                "word": "Hindutva",
                "pos": "noun"
            },
            {
                "word": "hinge",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the main religion of India and Nepal which includes the worship of one or more gods and belief in reincarnation",
                    "vi": "tôn giáo chính của Ấn Độ và Nepal bao gồm việc thờ cúng một hoặc nhiều vị thần và niềm tin vào luân hồi"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "e002819a5818487caaa50de37988e8b3",
        "word": "holy",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈhəʊli/",
            "us": "/ˈhəʊli/"
        },
        "nearby": [
            {
                "word": "holster",
                "pos": "verb"
            },
            {
                "word": "Victoria Holt",
                "pos": ""
            },
            {
                "word": "holy",
                "pos": "adjective"
            },
            {
                "word": "Holy Communion",
                "pos": "noun"
            },
            {
                "word": "the Holy Father",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "connected with God or a particular religion",
                    "vi": "kết nối với Chúa hoặc một tôn giáo cụ thể"
                },
                "examples": [
                    {
                        "en": "the Holy Bible",
                        "vi": "kinh Thánh"
                    },
                    {
                        "en": "holy books/scriptures",
                        "vi": "sách thánh / kinh sách"
                    },
                    {
                        "en": "the holy city of Mecca",
                        "vi": "thánh địa Mecca"
                    },
                    {
                        "en": "Islam’s holiest shrine",
                        "vi": "Đền thờ linh thiêng nhất của đạo Hồi"
                    },
                    {
                        "en": "a holy day/month",
                        "vi": "một ngày thánh / tháng"
                    },
                    {
                        "en": "a holy war (= one fought to defend the beliefs of a particular religion)",
                        "vi": "một cuộc thánh chiến (= một người đã chiến đấu để bảo vệ niềm tin của một tôn giáo cụ thể)"
                    },
                    {
                        "en": "holy ground",
                        "vi": "vùng đất thiêng"
                    }
                ]
            },
            {
                "define": {
                    "en": "good in a moral and religious way",
                    "vi": "tốt theo cách đạo đức và tôn giáo"
                },
                "examples": [
                    {
                        "en": "a holy life/man",
                        "vi": "một cuộc sống thánh thiện / người đàn ông"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to emphasize that you are surprised, afraid, etc.",
                    "vi": "được sử dụng để nhấn mạnh rằng bạn ngạc nhiên, sợ hãi, v.v."
                },
                "examples": [
                    {
                        "en": "Holy cow! What was that?",
                        "vi": "Chúa ơi! Đó là gì?"
                    }
                ]
            }
        ]
    },
    {
        "id": "80403965cbe946159dae32a9ab20c946",
        "word": "Islam",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈɪzlɑːm/",
            "us": "/ˈɪzlɑːm/"
        },
        "nearby": [
            {
                "word": "isiZulu",
                "pos": "noun"
            },
            {
                "word": "Isla",
                "pos": ""
            },
            {
                "word": "Islam",
                "pos": "noun"
            },
            {
                "word": "Islamic",
                "pos": "adjective"
            },
            {
                "word": "Islamism",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the Muslim religion, based on belief in one God and revealed through Muhammad as the Prophet of Allah",
                    "vi": "tôn giáo Hồi giáo, dựa trên niềm tin vào một Thượng đế và được tiết lộ thông qua Muhammad là Nhà tiên tri của Allah"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "all Muslims and Muslim countries in the world",
                    "vi": "tất cả người Hồi giáo và các quốc gia Hồi giáo trên thế giới"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "43e2bfe19592463d9170fab80dcee6b1",
        "word": "Jewish",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈdʒuːɪʃ/",
            "us": "/ˈdʒuːɪʃ/"
        },
        "nearby": [
            {
                "word": "jewellery",
                "pos": "noun"
            },
            {
                "word": "Jewess",
                "pos": "noun"
            },
            {
                "word": "Jewish",
                "pos": "adjective"
            },
            {
                "word": "Jewishness",
                "pos": "noun"
            },
            {
                "word": "Jewry",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "connected with Jews or Judaism; believing in and practising Judaism",
                    "vi": "kết nối với người Do Thái giáo hoặc Do Thái giáo; tin vào và thực hành đạo Do Thái"
                },
                "examples": [
                    {
                        "en": "We're Jewish.",
                        "vi": "Chúng tôi là người Do Thái."
                    },
                    {
                        "en": "the local Jewish community",
                        "vi": "cộng đồng Do Thái địa phương"
                    }
                ]
            }
        ]
    },
    {
        "id": "cd1fe3bd7175412f85183cdf9c9b4749",
        "word": "Judaism",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈdʒuːdeɪɪzəm/",
            "us": "/ˈdʒuːdiɪzəm/"
        },
        "nearby": [
            {
                "word": "jubilee",
                "pos": "noun"
            },
            {
                "word": "Judaic",
                "pos": "adjective"
            },
            {
                "word": "Judaism",
                "pos": "noun"
            },
            {
                "word": "Judas",
                "pos": "noun"
            },
            {
                "word": "judder",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the religion of the Jewish people, based mainly on the first five books of the Bible and the Talmud",
                    "vi": "tôn giáo của người Do Thái, chủ yếu dựa trên năm cuốn sách đầu tiên của Kinh thánh và Talmud"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "ff2be073b959463ea39a05cce14266c0",
        "word": "Muslim",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈmʊzlɪm/",
            "us": "/ˈmʊzlɪm/"
        },
        "nearby": [
            {
                "word": "musk rose",
                "pos": "noun"
            },
            {
                "word": "musky",
                "pos": "adjective"
            },
            {
                "word": "Muslim",
                "pos": "adjective"
            },
            {
                "word": "Muslim",
                "pos": "noun"
            },
            {
                "word": "muslin",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "believing in and practising Islam; connected with the religion of Islam",
                    "vi": "tin theo và thực hành đạo Hồi; kết nối với tôn giáo của đạo Hồi"
                },
                "examples": [
                    {
                        "en": "a Muslim family",
                        "vi": "một gia đình Hồi giáo"
                    },
                    {
                        "en": "a Muslim name",
                        "vi": "một tên Hồi giáo"
                    }
                ]
            }
        ]
    },
    {
        "id": "c067dd96987b4ab1b63d245910e7da45",
        "word": "soul",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/səʊl/",
            "us": "/səʊl/"
        },
        "nearby": [
            {
                "word": "sought after",
                "pos": "adjective"
            },
            {
                "word": "souk",
                "pos": "noun"
            },
            {
                "word": "soul",
                "pos": "noun"
            },
            {
                "word": "soul-destroying",
                "pos": "adjective"
            },
            {
                "word": "soul food",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the spiritual part of a person, believed to exist after death",
                    "vi": "phần tinh thần của một người, được cho là tồn tại sau khi chết"
                },
                "examples": [
                    {
                        "en": "He believed his immortal soul was in peril.",
                        "vi": "Anh tin rằng linh hồn bất tử của mình đang gặp nguy hiểm."
                    },
                    {
                        "en": "The howling wind sounded like the wailing of lost souls (= the spirits of dead people who are not in heaven).",
                        "vi": "Tiếng gió hú nghe như tiếng khóc than của những linh hồn đã mất (= vong hồn của những người đã chết không ở trên trời)."
                    },
                    {
                        "en": "'Repent now if you want to save your soul,' he cried.",
                        "vi": "“Hãy ăn năn ngay bây giờ nếu bạn muốn cứu linh hồn mình,” anh ta khóc."
                    },
                    {
                        "en": "soul of somebody a prayer for the soul of the deceased",
                        "vi": "linh hồn của ai đó một lời cầu nguyện cho linh hồn của người đã khuất"
                    },
                    {
                        "en": "They believe that ghosts are the wandering souls of the departed.",
                        "vi": "Họ tin rằng hồn ma là linh hồn lang thang của những người đã khuất."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person’s inner character, containing their true thoughts and feelings",
                    "vi": "nhân vật bên trong của một người, chứa đựng những suy nghĩ và cảm xúc thực sự của họ"
                },
                "examples": [
                    {
                        "en": "music that soothes your soul",
                        "vi": "âm nhạc xoa dịu tâm hồn bạn"
                    },
                    {
                        "en": "The eyes are the windows to the soul.",
                        "vi": "Đôi mắt là cửa sổ tâm hồn."
                    },
                    {
                        "en": "in somebody's soul There was a feeling of restlessness deep in her soul.",
                        "vi": "trong tâm hồn ai đó Có một cảm giác bồn chồn sâu thẳm trong tâm hồn cô ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "the spiritual and moral qualities of humans in general",
                    "vi": "phẩm chất tinh thần và đạo đức của con người nói chung"
                },
                "examples": [
                    {
                        "en": "the dark side of the human soul",
                        "vi": "mặt tối của tâm hồn con người"
                    },
                    {
                        "en": "In my view, fine art feeds the mind and soul.",
                        "vi": "Theo quan điểm của tôi, mỹ thuật nuôi sống trí óc và tâm hồn."
                    }
                ]
            },
            {
                "define": {
                    "en": "strong and good human feeling, especially that gives a work of art its quality or enables somebody to recognize and enjoy that quality",
                    "vi": "cảm giác mạnh mẽ và tốt của con người, đặc biệt là điều đó mang lại cho một tác phẩm nghệ thuật chất lượng của nó hoặc cho phép ai đó nhận ra và thưởng thức chất lượng đó"
                },
                "examples": [
                    {
                        "en": "It was a very polished performance, but it lacked soul.",
                        "vi": "Đó là một màn trình diễn rất bóng bẩy, nhưng nó thiếu linh hồn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a perfect example of a good quality",
                    "vi": "một ví dụ hoàn hảo về phẩm chất tốt"
                },
                "examples": [
                    {
                        "en": "He is the soul of discretion.",
                        "vi": "Anh ấy là linh hồn của sự tùy nghi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person of a particular type",
                    "vi": "một người thuộc một loại cụ thể"
                },
                "examples": [
                    {
                        "en": "She's lost all her money, poor soul.",
                        "vi": "Cô ấy mất hết tiền rồi, tâm hồn tội nghiệp."
                    },
                    {
                        "en": "You're a brave soul.",
                        "vi": "Bạn là một linh hồn dũng cảm."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person",
                    "vi": "một người"
                },
                "examples": [
                    {
                        "en": "There wasn't a soul in sight (= nobody was in sight).",
                        "vi": "Không có linh hồn trong tầm nhìn (= không ai ở trong tầm nhìn)."
                    },
                    {
                        "en": "Don't tell a soul (= do not tell anyone).",
                        "vi": "Don't tell a soul (= đừng nói với ai)."
                    },
                    {
                        "en": "(literary) a village of 300 souls (= with 300 people living there)",
                        "vi": "(văn học) một ngôi làng 300 linh hồn (= với 300 người sống ở đó)"
                    }
                ]
            },
            {
                "define": {
                    "en": "a type of music that expresses strong emotions, made popular by African American musicians",
                    "vi": "một loại nhạc thể hiện cảm xúc mạnh mẽ, được phổ biến bởi các nhạc sĩ người Mỹ gốc Phi"
                },
                "examples": [
                    {
                        "en": "a soul singer",
                        "vi": "một ca sĩ tâm hồn"
                    }
                ]
            },
            {
                "define": {
                    "en": "to tell somebody your deepest and most private feelings",
                    "vi": "để nói với ai đó những cảm xúc sâu sắc và riêng tư nhất của bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "with all your energy",
                    "vi": "với tất cả năng lượng của bạn"
                },
                "examples": [
                    {
                        "en": "She committed herself body and soul to fighting for the cause.",
                        "vi": "Cô ấy đã cam kết cả thể xác và linh hồn để chiến đấu vì chính nghĩa."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to show respect when you are talking about somebody who is dead",
                    "vi": "được sử dụng để thể hiện sự tôn trọng khi bạn đang nói về một người nào đó đã chết"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "good for you, even if it seems unpleasant",
                    "vi": "tốt cho bạn, ngay cả khi nó có vẻ khó chịu"
                },
                "examples": [
                    {
                        "en": "‘Want a ride?’ ‘No thanks. Walking is good for the soul.’",
                        "vi": "Muốn có phương tiện?' 'Không, cám ơn. Đi bộ rất tốt cho tâm hồn. '"
                    }
                ]
            },
            {
                "define": {
                    "en": "with a lot of energy and enthusiasm",
                    "vi": "với rất nhiều năng lượng và nhiệt huyết"
                },
                "examples": [
                    {
                        "en": "They threw themselves heart and soul into the project.",
                        "vi": "Họ đã ném hết trái tim và tâm hồn vào dự án."
                    }
                ]
            },
            {
                "define": {
                    "en": "to stay alive with just enough of the food, clothing, etc. that you need",
                    "vi": "sống sót chỉ với đủ thức ăn, quần áo, v.v. mà bạn cần"
                },
                "examples": [
                    {
                        "en": "They barely have enough money to keep body and soul together.",
                        "vi": "Họ hầu như không có đủ tiền để giữ thể xác và linh hồn bên nhau."
                    }
                ]
            },
            {
                "define": {
                    "en": "the liveliest and funniest person at a party, etc.",
                    "vi": "người sống động và vui vẻ nhất trong một bữa tiệc, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to do anything, even something really bad or dishonest, in return for money, success or power",
                    "vi": "làm bất cứ điều gì, ngay cả điều gì đó thực sự tồi tệ hoặc không trung thực, để đổi lấy tiền bạc, thành công hoặc quyền lực"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "492f639120514037a4658a05022f6b8a",
        "word": "spirit",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈspɪrɪt/",
            "us": "/ˈspɪrɪt/"
        },
        "nearby": [
            {
                "word": "spirant",
                "pos": "adjective"
            },
            {
                "word": "spire",
                "pos": "noun"
            },
            {
                "word": "spirit",
                "pos": "noun"
            },
            {
                "word": "spirit",
                "pos": "verb"
            },
            {
                "word": "Spirit",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the part of a person that includes their mind, feelings and character rather than their body",
                    "vi": "phần của một người bao gồm tâm trí, cảm xúc và tính cách của họ hơn là cơ thể của họ"
                },
                "examples": [
                    {
                        "en": "You are underestimating the power of the human spirit to overcome difficulties.",
                        "vi": "Bạn đang đánh giá thấp sức mạnh của tinh thần vượt khó của con người."
                    },
                    {
                        "en": "Yoga is meant to unite the body, mind and spirit.",
                        "vi": "Yoga có nghĩa là để hợp nhất cơ thể, tâm trí và tinh thần."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person’s feelings or state of mind",
                    "vi": "cảm xúc hoặc trạng thái tâm trí của một người"
                },
                "examples": [
                    {
                        "en": "to be in high/low spirits",
                        "vi": "có tinh thần cao / thấp"
                    },
                    {
                        "en": "They were all in good spirits as they set out.",
                        "vi": "Họ đều có tinh thần tốt khi lên đường."
                    },
                    {
                        "en": "You must try and keep your spirits up (= stay cheerful).",
                        "vi": "Bạn phải cố gắng và giữ tinh thần phấn chấn (= luôn vui vẻ)."
                    },
                    {
                        "en": "a song that never fails to lift my spirits",
                        "vi": "một bài hát không bao giờ lỗi thời để vực dậy tinh thần của tôi"
                    },
                    {
                        "en": "My spirits sank at the prospect of starting all over again.",
                        "vi": "Tinh thần của tôi chìm nghỉm trước viễn cảnh bắt đầu lại từ đầu."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person of the type mentioned",
                    "vi": "một người thuộc loại được đề cập"
                },
                "examples": [
                    {
                        "en": "a brave spirit",
                        "vi": "một tinh thần dũng cảm"
                    },
                    {
                        "en": "kindred spirits (= people who like the same things as you)",
                        "vi": "tinh thần tốt bụng (= những người thích những thứ giống bạn)"
                    }
                ]
            },
            {
                "define": {
                    "en": "courage, energy or determination",
                    "vi": "lòng dũng cảm, nghị lực hoặc quyết tâm"
                },
                "examples": [
                    {
                        "en": "Peter had a good game and showed his true spirit.",
                        "vi": "Peter đã có một trận đấu hay và thể hiện đúng bản lĩnh của mình."
                    },
                    {
                        "en": "They took away his freedom and broke his spirit.",
                        "vi": "Họ đã lấy đi tự do của anh ấy và làm suy sụp tinh thần của anh ấy."
                    },
                    {
                        "en": "with spirit Although the team lost, they played with tremendous spirit.",
                        "vi": "với tinh thần Dù đội thua nhưng họ đã thi đấu với tinh thần vô cùng tuyệt vời."
                    }
                ]
            },
            {
                "define": {
                    "en": "feelings of support towards a group, team or society",
                    "vi": "cảm giác hỗ trợ đối với một nhóm, đội hoặc xã hội"
                },
                "examples": [
                    {
                        "en": "There's not much community spirit around here.",
                        "vi": "Không có nhiều tinh thần cộng đồng xung quanh đây."
                    },
                    {
                        "en": "spirit of something Officials have praised the cooperative spirit of the joint task force.",
                        "vi": "tinh thần của điều gì đó Các quan chức đã ca ngợi tinh thần hợp tác của lực lượng đặc nhiệm chung."
                    }
                ]
            },
            {
                "define": {
                    "en": "the typical or most important quality or mood of something",
                    "vi": "phẩm chất hoặc tâm trạng điển hình hoặc quan trọng nhất của một thứ gì đó"
                },
                "examples": [
                    {
                        "en": "spirit of something The exhibition captures the spirit of the age/times.",
                        "vi": "tinh thần của cái gì đó Triển lãm nắm bắt được tinh thần của thời đại / thời đại."
                    }
                ]
            },
            {
                "define": {
                    "en": "a state of mind or mood; an attitude",
                    "vi": "một trạng thái của tâm trí hoặc tâm trạng; một thái độ"
                },
                "examples": [
                    {
                        "en": "We approached the situation in the wrong spirit.",
                        "vi": "Chúng tôi đã tiếp cận tình huống với tinh thần sai lầm."
                    },
                    {
                        "en": "‘OK, I'll try’. ‘That's the spirit (= the right attitude).’",
                        "vi": "Được rồi, tôi sẽ thử'. 'Đó là tinh thần (= thái độ đúng đắn).'"
                    },
                    {
                        "en": "The party went well because everyone entered into the spirit of things.",
                        "vi": "Buổi tiệc diễn ra tốt đẹp vì mọi người đều nhập tâm làm việc."
                    },
                    {
                        "en": "I'm trying to get into the spirit of the holiday season.",
                        "vi": "Tôi đang cố gắng lên tinh thần cho kỳ nghỉ lễ."
                    }
                ]
            },
            {
                "define": {
                    "en": "the real or intended meaning or purpose of something",
                    "vi": "ý nghĩa hoặc mục đích thực sự hoặc dự định của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "Obey the spirit, not the letter (= the narrow meaning of the words) of the law.",
                        "vi": "Tuân theo tinh thần, không tuân theo chữ (= nghĩa hẹp của từ ngữ) của luật pháp."
                    }
                ]
            },
            {
                "define": {
                    "en": "the soul thought of as separate from the body and believed to live on after death; a ghost",
                    "vi": "linh hồn được cho là tách biệt khỏi thể xác và được cho là sẽ sống tiếp sau khi chết; một con ma"
                },
                "examples": [
                    {
                        "en": "He is dead, but his spirit lives on.",
                        "vi": "Anh ấy đã chết, nhưng linh hồn của anh ấy vẫn sống."
                    },
                    {
                        "en": "It was believed that people could be possessed by evil spirits.",
                        "vi": "Người ta tin rằng con người có thể bị quỷ ám."
                    },
                    {
                        "en": "a message from the spirit world",
                        "vi": "một thông điệp từ thế giới linh hồn"
                    }
                ]
            },
            {
                "define": {
                    "en": "an imaginary creature with magic powers, for example, a fairy or an elf",
                    "vi": "một sinh vật tưởng tượng có sức mạnh ma thuật, ví dụ, một nàng tiên hoặc một yêu tinh"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a strong alcoholic drink",
                    "vi": "đồ uống có cồn mạnh"
                },
                "examples": [
                    {
                        "en": "I don't drink whisky or brandy or any other spirits.",
                        "vi": "Tôi không uống rượu whisky, rượu mạnh hay bất kỳ loại rượu mạnh nào khác."
                    }
                ]
            },
            {
                "define": {
                    "en": "a special type of alcohol used in industry or medicine",
                    "vi": "một loại rượu đặc biệt được sử dụng trong công nghiệp hoặc y học"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "as/when/if you feel like it",
                    "vi": "như / khi nào / nếu bạn cảm thấy thích nó"
                },
                "examples": [
                    {
                        "en": "I'll go for a run this evening, if the spirit moves me.",
                        "vi": "Tôi sẽ chạy bộ vào tối nay, nếu tinh thần làm tôi cảm động."
                    },
                    {
                        "en": "Make a donation to the charity if the spirit moves you.",
                        "vi": "Hãy quyên góp cho tổ chức từ thiện nếu tinh thần đó khiến bạn cảm động."
                    }
                ]
            },
            {
                "define": {
                    "en": "a feeling that you are ready to fight very hard for something or to try something difficult",
                    "vi": "cảm giác rằng bạn đã sẵn sàng chiến đấu hết mình cho một điều gì đó hoặc thử một điều gì đó khó khăn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "in your thoughts",
                    "vi": "trong suy nghĩ của bạn"
                },
                "examples": [
                    {
                        "en": "I shall be with you in spirit (= thinking about you though not with you physically).",
                        "vi": "Tôi sẽ ở bên bạn bằng tinh thần (= nghĩ về bạn mặc dù không ở bên bạn về mặt thể xác)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody feel more cheerful or brave",
                    "vi": "để làm cho ai đó cảm thấy vui vẻ hoặc dũng cảm hơn"
                },
                "examples": [
                    {
                        "en": "The sunny weather raised my spirits a little.",
                        "vi": "Thời tiết nắng đẹp làm tinh thần tôi phấn chấn hơn một chút."
                    }
                ]
            },
            {
                "define": {
                    "en": "you intend to do good things but you are too lazy, weak or busy to actually do them",
                    "vi": "bạn có ý định làm những điều tốt nhưng bạn quá lười biếng, yếu đuối hoặc bận rộn để thực sự làm chúng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "3f5c6bc3f3a34c37accc03e96a02a744",
        "word": "spiritual",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈspɪrɪtʃuəl/",
            "us": "/ˈspɪrɪtʃuəl/"
        },
        "nearby": [
            {
                "word": "spirit level",
                "pos": "noun"
            },
            {
                "word": "the Spirit of St Louis",
                "pos": ""
            },
            {
                "word": "spiritual",
                "pos": "adjective"
            },
            {
                "word": "spiritual",
                "pos": "noun"
            },
            {
                "word": "spiritualism",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "connected with the human spirit, rather than the body or physical things",
                    "vi": "kết nối với tinh thần con người, thay vì cơ thể hoặc vật chất"
                },
                "examples": [
                    {
                        "en": "a spiritual experience",
                        "vi": "một kinh nghiệm tâm linh"
                    },
                    {
                        "en": "spiritual development",
                        "vi": "phát triển tinh thần"
                    },
                    {
                        "en": "His music leads us on a spiritual journey.",
                        "vi": "Âm nhạc của anh ấy dẫn dắt chúng ta vào một cuộc hành trình tâm linh."
                    },
                    {
                        "en": "the human capacity for spiritual growth",
                        "vi": "năng lực con người để phát triển tâm linh"
                    },
                    {
                        "en": "a lack of spiritual values in the modern world",
                        "vi": "thiếu các giá trị tinh thần trong thế giới hiện đại"
                    },
                    {
                        "en": "We're concerned about your spiritual welfare.",
                        "vi": "Chúng tôi quan tâm đến phúc lợi tinh thần của bạn."
                    },
                    {
                        "en": "I consider myself to have deep moral and spiritual values.",
                        "vi": "Tôi tự nhận mình là người có giá trị đạo đức và tinh thần sâu sắc."
                    }
                ]
            },
            {
                "define": {
                    "en": "connected with religion",
                    "vi": "kết nối với tôn giáo"
                },
                "examples": [
                    {
                        "en": "a spiritual leader",
                        "vi": "một nhà lãnh đạo tinh thần"
                    },
                    {
                        "en": "Father Joubert was their spiritual adviser.",
                        "vi": "Cha Joubert là cố vấn tinh thần của họ."
                    },
                    {
                        "en": "Buddhist spiritual practice",
                        "vi": "Thực hành tâm linh Phật giáo"
                    },
                    {
                        "en": "For Martin Luther, this is the essence of the spiritual life.",
                        "vi": "Đối với Martin Luther, đây là bản chất của đời sống tinh thần."
                    }
                ]
            },
            {
                "define": {
                    "en": "the place where you are happiest, especially a country where you feel you belong more than in your own country because you share the ideas and attitudes of the people who live there",
                    "vi": "nơi mà bạn hạnh phúc nhất, đặc biệt là một đất nước mà bạn cảm thấy mình thuộc về hơn đất nước của mình vì bạn chia sẻ ý tưởng và thái độ của những người sống ở đó"
                },
                "examples": [
                    {
                        "en": "When she moved to Italy, she knew she'd found her true spiritual home.",
                        "vi": "Khi chuyển đến Ý, cô biết mình đã tìm thấy ngôi nhà tinh thần thực sự của mình."
                    },
                    {
                        "en": "The first time he visited New Orleans he knew he had found his spiritual home.",
                        "vi": "Lần đầu tiên đến thăm New Orleans, anh biết mình đã tìm thấy ngôi nhà thiêng liêng của mình."
                    },
                    {
                        "en": "I had always thought of India as my spiritual home.",
                        "vi": "Tôi đã luôn nghĩ về Ấn Độ là quê hương tinh thần của mình."
                    }
                ]
            }
        ]
    },
    {
        "id": "4368f04d63ee4ac88a1c650324603045",
        "word": "vision",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈvɪʒn/",
            "us": "/ˈvɪʒn/"
        },
        "nearby": [
            {
                "word": "visible minority",
                "pos": "noun"
            },
            {
                "word": "visibly",
                "pos": "adverb"
            },
            {
                "word": "vision",
                "pos": "noun"
            },
            {
                "word": "visionary",
                "pos": "adjective"
            },
            {
                "word": "visionary",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the ability to see; the area that you can see from a particular position",
                    "vi": "khả năng nhìn thấy; khu vực mà bạn có thể nhìn thấy từ một vị trí cụ thể"
                },
                "examples": [
                    {
                        "en": "to have good/perfect/poor/blurred/normal vision",
                        "vi": "để có thị lực tốt / hoàn hảo / kém / mờ / bình thường"
                    },
                    {
                        "en": "Cats have good night vision.",
                        "vi": "Mèo có thị lực ban đêm tốt."
                    },
                    {
                        "en": "Her vision was still blurry.",
                        "vi": "Tầm nhìn của cô vẫn còn mờ mịt."
                    },
                    {
                        "en": "The disease causes a gradual loss of peripheral vision.",
                        "vi": "Bệnh làm mất dần thị lực ngoại vi."
                    },
                    {
                        "en": "He glimpsed something on the edge of his vision.",
                        "vi": "Anh thoáng nhìn thấy thứ gì đó ngoài rìa tầm nhìn của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "an idea or a picture in your imagination",
                    "vi": "một ý tưởng hoặc một bức tranh trong trí tưởng tượng của bạn"
                },
                "examples": [
                    {
                        "en": "Our job is to guide a client and develop a strategic vision.",
                        "vi": "Công việc của chúng tôi là hướng dẫn khách hàng và phát triển tầm nhìn chiến lược."
                    },
                    {
                        "en": "vision of somebody/something He had a vision of a world in which there would be no wars.",
                        "vi": "tầm nhìn của ai đó / cái gì đó Anh ấy có tầm nhìn về một thế giới mà ở đó sẽ không có chiến tranh."
                    },
                    {
                        "en": "The word conjures up visions of home and family.",
                        "vi": "Từ này gợi lên những hình dung về quê hương và gia đình."
                    },
                    {
                        "en": "The film's vision of the future is bleak.",
                        "vi": "Tầm nhìn của bộ phim về tương lai thật ảm đạm."
                    },
                    {
                        "en": "vision of doing something He harboured visions of becoming party leader some day.",
                        "vi": "tầm nhìn của việc làm một cái gì đó Ông ấp ủ tầm nhìn trở thành lãnh đạo đảng vào một ngày nào đó."
                    },
                    {
                        "en": "vision of somebody/something doing something I had visions of us getting hopelessly lost.",
                        "vi": "hình ảnh về ai đó / điều gì đó đang làm điều gì đó mà tôi đã có những hình dung về việc chúng ta bị lạc một cách vô vọng."
                    },
                    {
                        "en": "vision for somebody/something These two men share a similar vision for the country.",
                        "vi": "tầm nhìn cho ai đó / cái gì Hai người đàn ông này có chung tầm nhìn về đất nước."
                    },
                    {
                        "en": "He had a very specific vision for the future.",
                        "vi": "Anh ấy đã có một tầm nhìn rất cụ thể cho tương lai."
                    }
                ]
            },
            {
                "define": {
                    "en": "a dream or similar experience, especially of a religious kind",
                    "vi": "một giấc mơ hoặc trải nghiệm tương tự, đặc biệt là thuộc loại tôn giáo"
                },
                "examples": [
                    {
                        "en": "in a vision The idea came to her in a vision.",
                        "vi": "trong một tầm nhìn Ý tưởng đến với cô ấy trong một tầm nhìn."
                    },
                    {
                        "en": "He had visions regularly.",
                        "vi": "Anh ta thường xuyên có tầm nhìn."
                    },
                    {
                        "en": "vision of somebody/something She claimed she saw a vision of the Virgin Mary.",
                        "vi": "tầm nhìn của ai đó / cái gì đó Cô ấy tuyên bố cô ấy đã nhìn thấy hình ảnh của Đức Trinh Nữ Maria."
                    }
                ]
            },
            {
                "define": {
                    "en": "the ability to think about or plan the future with great imagination and intelligence",
                    "vi": "khả năng suy nghĩ hoặc hoạch định tương lai với trí tưởng tượng và trí thông minh tuyệt vời"
                },
                "examples": [
                    {
                        "en": "She had vision and determination.",
                        "vi": "Cô ấy có tầm nhìn xa và sự quyết tâm."
                    },
                    {
                        "en": "a leader of vision",
                        "vi": "một nhà lãnh đạo có tầm nhìn"
                    },
                    {
                        "en": "He's a competent politician, but he lacks vision.",
                        "vi": "Anh ấy là một chính trị gia có năng lực, nhưng anh ấy thiếu tầm nhìn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person of great beauty or who shows the quality mentioned",
                    "vi": "một người có vẻ đẹp tuyệt vời hoặc người thể hiện phẩm chất được đề cập"
                },
                "examples": [
                    {
                        "en": "She was a vision in white lace.",
                        "vi": "Cô ấy là một viễn tượng trong trang phục ren trắng."
                    },
                    {
                        "en": "a vision of loveliness",
                        "vi": "tầm nhìn về sự đáng yêu"
                    }
                ]
            },
            {
                "define": {
                    "en": "the picture on a television or cinema screen",
                    "vi": "hình ảnh trên màn hình tivi hoặc rạp chiếu phim"
                },
                "examples": [
                    {
                        "en": "We apologize for the loss of vision.",
                        "vi": "Chúng tôi xin lỗi vì mất thị lực."
                    }
                ]
            }
        ]
    },
    {
        "id": "ef1687fbc2024d2fb2ebaaea521b99dd",
        "word": "blessing",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈblesɪŋ/",
            "us": "/ˈblesɪŋ/"
        },
        "nearby": [
            {
                "word": "blessedness",
                "pos": "noun"
            },
            {
                "word": "blesser",
                "pos": "noun"
            },
            {
                "word": "blessing",
                "pos": "noun"
            },
            {
                "word": "blether",
                "pos": "verb"
            },
            {
                "word": "blether",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "God’s help and protection, or a prayer asking for this",
                    "vi": "Sự giúp đỡ và bảo vệ của Chúa, hoặc một lời cầu nguyện yêu cầu điều này"
                },
                "examples": [
                    {
                        "en": "to pray for God’s blessing",
                        "vi": "cầu nguyện cho phước lành của Chúa"
                    },
                    {
                        "en": "The bishop said the blessing.",
                        "vi": "Đức cha nói lời chúc lành."
                    }
                ]
            },
            {
                "define": {
                    "en": "approval of or permission for something",
                    "vi": "chấp thuận hoặc cho phép một cái gì đó"
                },
                "examples": [
                    {
                        "en": "The government gave its blessing to the new plans.",
                        "vi": "Chính phủ đã ban phước cho các kế hoạch mới."
                    },
                    {
                        "en": "He went with his parents' blessing.",
                        "vi": "Anh đi với sự chúc phúc của bố mẹ."
                    }
                ]
            },
            {
                "define": {
                    "en": "something that is good or helpful",
                    "vi": "cái gì đó tốt hoặc hữu ích"
                },
                "examples": [
                    {
                        "en": "Lack of traffic is one of the blessings of country life.",
                        "vi": "Thiếu giao thông là một trong những điều may mắn của cuộc sống đất nước."
                    },
                    {
                        "en": "It's a blessing that nobody was in the house at the time.",
                        "vi": "Thật là may mắn khi không có ai trong nhà vào thời điểm đó."
                    },
                    {
                        "en": "Her looks turned out to be more of a curse than a blessing.",
                        "vi": "Vẻ ngoài của cô ấy hóa ra là một lời nguyền hơn là một lời chúc phúc."
                    }
                ]
            },
            {
                "define": {
                    "en": "something that seems to be a problem at first, but that has good results in the end",
                    "vi": "một cái gì đó thoạt đầu có vẻ là một vấn đề, nhưng cuối cùng điều đó đã có kết quả tốt"
                },
                "examples": [
                    {
                        "en": "Losing your job might turn out to be a blessing in disguise.",
                        "vi": "Mất việc có thể là một điều may mắn được ngụy trang."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be grateful for the good things in your life",
                    "vi": "biết ơn những điều tốt đẹp trong cuộc sống của bạn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "dbc8b72551484ce99486b2786c7b776c",
        "word": "Buddhism",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈbʊdɪzəm/",
            "us": "/ˈbuːdɪzəm/"
        },
        "nearby": [
            {
                "word": "Bud",
                "pos": ""
            },
            {
                "word": "Buddha",
                "pos": "noun"
            },
            {
                "word": "Buddhism",
                "pos": "noun"
            },
            {
                "word": "Buddhist",
                "pos": "adjective"
            },
            {
                "word": "Buddhist",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an Indian religion widely followed in Asia, based on the teaching of Siddhartha Gautama (or Buddha)",
                    "vi": "một tôn giáo Ấn Độ được theo rộng rãi ở Châu Á, dựa trên lời dạy của Siddhartha Gautama (hay Đức Phật)"
                },
                "examples": [
                    {
                        "en": "She became interested in Zen Buddhism.",
                        "vi": "Cô bắt đầu quan tâm đến Phật giáo Thiền tông."
                    }
                ]
            }
        ]
    },
    {
        "id": "ae7704b8a2d54ce29acc2268d3d05ff0",
        "word": "Buddhist",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈbʊdɪst/",
            "us": "/ˈbuːdɪst/"
        },
        "nearby": [
            {
                "word": "Buddha",
                "pos": "noun"
            },
            {
                "word": "Buddhism",
                "pos": "noun"
            },
            {
                "word": "Buddhist",
                "pos": "adjective"
            },
            {
                "word": "Buddhist",
                "pos": "noun"
            },
            {
                "word": "buddhu",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "following or connected with the religion of Buddhism",
                    "vi": "theo hoặc kết nối với tôn giáo của Phật giáo"
                },
                "examples": [
                    {
                        "en": "a Buddhist monk/temple",
                        "vi": "một nhà sư Phật giáo / chùa"
                    }
                ]
            }
        ]
    },
    {
        "id": "ead50e9288864d9b9271fc4f2336ad53",
        "word": "catholic",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈkæθlɪk/",
            "us": "/ˈkæθlɪk/"
        },
        "nearby": [
            {
                "word": "cathode",
                "pos": "noun"
            },
            {
                "word": "cathode ray tube",
                "pos": "noun"
            },
            {
                "word": "catholic",
                "pos": "adjective"
            },
            {
                "word": "Catholic",
                "pos": "noun"
            },
            {
                "word": "the Catholic Agency for Overseas Development",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "belonging to or connected with the part of the Christian Church that has the Pope as its leader",
                    "vi": "thuộc về hoặc liên kết với một phần của Giáo hội Cơ đốc có Giáo hoàng là người lãnh đạo"
                },
                "examples": [
                    {
                        "en": "Are they Catholic or Protestant?",
                        "vi": "Họ là Công giáo hay Tin lành?"
                    },
                    {
                        "en": "a Catholic church",
                        "vi": "một nhà thờ Công giáo"
                    }
                ]
            },
            {
                "define": {
                    "en": "connected with all Christians or the whole Christian Church",
                    "vi": "được kết nối với tất cả các Cơ đốc nhân hoặc toàn thể Giáo hội Cơ đốc"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "including many or most things",
                    "vi": "bao gồm nhiều hoặc hầu hết mọi thứ"
                },
                "examples": [
                    {
                        "en": "to have catholic tastes (= to like many different things)",
                        "vi": "có thị hiếu công giáo (= thích nhiều thứ khác nhau)"
                    }
                ]
            }
        ]
    },
    {
        "id": "39b9ad99ca4147c9be6688d5ff09a8e2",
        "word": "Catholicism",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/kəˈθɒləsɪzəm/",
            "us": "/kəˈθɑːləsɪzəm/"
        },
        "nearby": [
            {
                "word": "the Catholic Agency for Overseas Development",
                "pos": ""
            },
            {
                "word": "Catholic Herald",
                "pos": ""
            },
            {
                "word": "Catholicism",
                "pos": "noun"
            },
            {
                "word": "The Catholic Universe",
                "pos": ""
            },
            {
                "word": "Cathy",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the beliefs and principles of the part of the Christian Church that has the pope as its leader",
                    "vi": "các niềm tin và nguyên tắc của một phần của Giáo hội Cơ đốc có giáo hoàng là người lãnh đạo"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "7c90ad0b95484ebd9679cc247d579c26",
        "word": "conversion",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/kənˈvɜːʃn/",
            "us": "/kənˈvɜːrʒn/"
        },
        "nearby": [
            {
                "word": "converse2",
                "pos": "noun"
            },
            {
                "word": "conversely",
                "pos": "adverb"
            },
            {
                "word": "conversion",
                "pos": "noun"
            },
            {
                "word": "conversion van",
                "pos": "noun"
            },
            {
                "word": "convert",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act or process of changing something from one form, use or system to another",
                    "vi": "hành động hoặc quá trình thay đổi thứ gì đó từ một dạng, cách sử dụng hoặc hệ thống sang dạng khác"
                },
                "examples": [
                    {
                        "en": "Their main business is the conversion of farm buildings into family homes.",
                        "vi": "Hoạt động kinh doanh chính của họ là chuyển đổi các tòa nhà nông trại thành nhà ở gia đình."
                    },
                    {
                        "en": "Conversion to gas central heating will save you a lot of money.",
                        "vi": "Việc chuyển đổi sang hệ thống sưởi trung tâm bằng gas sẽ giúp bạn tiết kiệm rất nhiều tiền."
                    },
                    {
                        "en": "No conversion from analogue to digital data is needed.",
                        "vi": "Không cần chuyển đổi từ dữ liệu tương tự sang dữ liệu kỹ thuật số."
                    },
                    {
                        "en": "a metric conversion table (= showing how to change metric amounts into or out of another system)",
                        "vi": "bảng chuyển đổi số liệu (= hiển thị cách thay đổi số lượng chỉ số vào hoặc ra khỏi hệ thống khác)"
                    },
                    {
                        "en": "a firm which specializes in house conversions (= turning large houses into several smaller flats)",
                        "vi": "một công ty chuyên về chuyển đổi nhà (= chuyển những ngôi nhà lớn thành một số căn hộ nhỏ hơn)"
                    }
                ]
            },
            {
                "define": {
                    "en": "the process or experience of changing somebody's or your own religion or beliefs",
                    "vi": "quá trình hoặc kinh nghiệm thay đổi tôn giáo hoặc tín ngưỡng của ai đó hoặc của riêng bạn"
                },
                "examples": [
                    {
                        "en": "the conversion of the Anglo-Saxons by Christian missionaries",
                        "vi": "sự cải đạo của người Anglo-Saxon bởi các nhà truyền giáo Cơ đốc"
                    },
                    {
                        "en": "his conversion from Judaism to Christianity",
                        "vi": "sự chuyển đổi của anh ấy từ Do Thái giáo sang Cơ đốc giáo"
                    },
                    {
                        "en": "Late in life she experienced a religious conversion.",
                        "vi": "Cuối đời, cô đã trải qua một cuộc cải đạo."
                    },
                    {
                        "en": "She began by supporting monetarist economics, but later underwent quite a conversion when she saw how it increased unemployment.",
                        "vi": "Cô ấy bắt đầu bằng việc ủng hộ kinh tế học tiền tệ, nhưng sau đó đã trải qua một cuộc chuyển đổi khá lớn khi cô ấy chứng kiến tỷ lệ thất nghiệp gia tăng như thế nào."
                    }
                ]
            },
            {
                "define": {
                    "en": "a way of scoring extra points after scoring a try or a touchdown",
                    "vi": "một cách ghi thêm điểm sau khi ghi một lần thử hoặc một lần chạm"
                },
                "examples": [
                    {
                        "en": "The try came in the third minute and Jon Bland added the conversion.",
                        "vi": "Lần thử đến ở phút thứ ba và Jon Bland đã thêm chuyển đổi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a building or room that has been changed so that it can be used for a different purpose, especially for living in",
                    "vi": "một tòa nhà hoặc căn phòng đã được thay đổi để có thể được sử dụng cho một mục đích khác, đặc biệt là để ở"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "8e4ab12d0def45918a592419949406e4",
        "word": "conviction",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/kənˈvɪkʃn/",
            "us": "/kənˈvɪkʃn/"
        },
        "nearby": [
            {
                "word": "convict",
                "pos": "verb"
            },
            {
                "word": "convict",
                "pos": "noun"
            },
            {
                "word": "conviction",
                "pos": "noun"
            },
            {
                "word": "convince",
                "pos": "verb"
            },
            {
                "word": "convinced",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act of finding somebody guilty of a crime in court; the fact of having been found guilty",
                    "vi": "hành động tìm ai đó phạm tội trước tòa; thực tế là đã bị kết tội"
                },
                "examples": [
                    {
                        "en": "He plans to appeal against his conviction.",
                        "vi": "Anh ta dự định sẽ kháng cáo lại bản án của mình."
                    },
                    {
                        "en": "conviction for something She has six previous convictions for theft.",
                        "vi": "tiền án Cô ấy có sáu tiền án về tội trộm cắp."
                    },
                    {
                        "en": "on conviction an offence that carries, on conviction, a sentence of not more than five years’ imprisonment",
                        "vi": "về tội danh mà bị kết án, thì bị phạt tù không quá năm năm."
                    }
                ]
            },
            {
                "define": {
                    "en": "a strong opinion or belief",
                    "vi": "một quan điểm hoặc niềm tin mạnh mẽ"
                },
                "examples": [
                    {
                        "en": "strong political/moral convictions",
                        "vi": "niềm tin chính trị / đạo đức mạnh mẽ"
                    },
                    {
                        "en": "She was motivated by deep religious conviction.",
                        "vi": "Cô được thúc đẩy bởi niềm tin tôn giáo sâu sắc."
                    },
                    {
                        "en": "conviction that… We were sustained by the conviction that all would be well in the end.",
                        "vi": "tin chắc rằng… Chúng tôi đã được duy trì bởi niềm tin rằng cuối cùng tất cả sẽ tốt đẹp."
                    }
                ]
            },
            {
                "define": {
                    "en": "the quality of showing that you believe strongly in what you are saying",
                    "vi": "chất lượng của việc thể hiện rằng bạn tin tưởng mạnh mẽ vào những gì bạn đang nói"
                },
                "examples": [
                    {
                        "en": "‘Not true!’ she said with conviction.",
                        "vi": "Không đúng!' cô ấy nói với niềm tin."
                    },
                    {
                        "en": "He said he agreed but his voice lacked conviction.",
                        "vi": "Anh ấy nói anh ấy đồng ý nhưng giọng thiếu thuyết phục."
                    },
                    {
                        "en": "The leader's speech in defence of the policy didn't carry much conviction.",
                        "vi": "Bài phát biểu của nhà lãnh đạo để bảo vệ chính sách không có nhiều thuyết phục."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be/not be brave enough to do what you feel to be right",
                    "vi": "trở thành / không đủ can đảm để làm những gì bạn cảm thấy là đúng"
                },
                "examples": [
                    {
                        "en": "You need to have the courage of your convictions.",
                        "vi": "Bạn cần phải có can đảm về niềm tin của mình."
                    }
                ]
            }
        ]
    },
    {
        "id": "01ca9cbdcbe1411ca670f1700394e3d4",
        "word": "creation",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/kriˈeɪʃn/",
            "us": "/kriˈeɪʃn/"
        },
        "nearby": [
            {
                "word": "crease up",
                "pos": "phrasal verb"
            },
            {
                "word": "create",
                "pos": "verb"
            },
            {
                "word": "creation",
                "pos": "noun"
            },
            {
                "word": "creationism",
                "pos": "noun"
            },
            {
                "word": "creationist",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act or process of making something that is new, or of causing something to exist that did not exist before",
                    "vi": "hành động hoặc quá trình tạo ra một cái gì đó mới hoặc làm cho một cái gì đó tồn tại mà trước đó không tồn tại"
                },
                "examples": [
                    {
                        "en": "Job creation needs to be the top priority.",
                        "vi": "Giải quyết việc làm cần được đặt lên hàng đầu."
                    },
                    {
                        "en": "a period of economic growth and wealth creation",
                        "vi": "thời kỳ tăng trưởng kinh tế và tạo ra của cải"
                    },
                    {
                        "en": "content creation software",
                        "vi": "phần mềm tạo nội dung"
                    },
                    {
                        "en": "creation of something the creation of an independent state",
                        "vi": "tạo ra một cái gì đó, tạo ra một nhà nước độc lập"
                    },
                    {
                        "en": "The reforms led to the creation of 220 jobs.",
                        "vi": "Các cuộc cải cách đã dẫn đến việc tạo ra 220 việc làm."
                    },
                    {
                        "en": "The committee proposed the creation of a new Chair of Portuguese for the university.",
                        "vi": "Ủy ban đã đề xuất thành lập một Chủ tịch mới bằng tiếng Bồ Đào Nha cho trường đại học."
                    },
                    {
                        "en": "He had been with the company since its creation in 1989.",
                        "vi": "Ông đã gắn bó với công ty kể từ khi thành lập vào năm 1989."
                    }
                ]
            },
            {
                "define": {
                    "en": "a thing that somebody has made, especially something that shows ability or imagination",
                    "vi": "một thứ mà ai đó đã làm, đặc biệt là một thứ thể hiện khả năng hoặc trí tưởng tượng"
                },
                "examples": [
                    {
                        "en": "a literary creation",
                        "vi": "một sáng tạo văn học"
                    },
                    {
                        "en": "The cake was a delicious creation of sponge, cream and fruit.",
                        "vi": "Chiếc bánh là sự sáng tạo thơm ngon của bọt biển, kem và trái cây."
                    },
                    {
                        "en": "The bright murals in the children’s ward were the creations of the nurses.",
                        "vi": "Những bức tranh tường tươi sáng ở khu trẻ em là sáng tạo của các y tá."
                    },
                    {
                        "en": "What an amazing creation (= a very unusual and new piece of clothing) you’re wearing!",
                        "vi": "Thật là một sự sáng tạo tuyệt vời (= một bộ quần áo mới và rất lạ) mà bạn đang mặc!"
                    }
                ]
            },
            {
                "define": {
                    "en": "the making of the world, especially by God as described in the Bible",
                    "vi": "sự tạo thành thế giới, đặc biệt là bởi Đức Chúa Trời như được mô tả trong Kinh thánh"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the world and all the living things in it",
                    "vi": "thế giới và tất cả những sinh vật sống trong đó"
                },
                "examples": [
                    {
                        "en": "We need to consider how we care for all creation.",
                        "vi": "Chúng ta cần xem xét cách chúng ta quan tâm đến mọi tạo vật."
                    }
                ]
            }
        ]
    },
    {
        "id": "7d63c06314444e538881cdc3c54b0fb5",
        "word": "cult",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/kʌlt/",
            "us": "/kʌlt/"
        },
        "nearby": [
            {
                "word": "culpably",
                "pos": "adverb"
            },
            {
                "word": "culprit",
                "pos": "noun"
            },
            {
                "word": "cult",
                "pos": "noun"
            },
            {
                "word": "cult",
                "pos": "adjective"
            },
            {
                "word": "cultivable",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a way of life, an attitude, an idea, etc. that has become very popular",
                    "vi": "một cách sống, một thái độ, một ý tưởng, v.v. đã trở nên rất phổ biến"
                },
                "examples": [
                    {
                        "en": "the cult of physical fitness",
                        "vi": "sùng bái thể chất"
                    },
                    {
                        "en": "the cult of youth",
                        "vi": "sự sùng bái của tuổi trẻ"
                    }
                ]
            },
            {
                "define": {
                    "en": "a small group of people who have extreme religious beliefs and who are not part of any established religion",
                    "vi": "một nhóm nhỏ những người có niềm tin tôn giáo cực đoan và không thuộc bất kỳ tôn giáo lâu đời nào"
                },
                "examples": [
                    {
                        "en": "Their son ran away from home and joined a cult.",
                        "vi": "Con trai của họ đã bỏ nhà ra đi và gia nhập một giáo phái."
                    },
                    {
                        "en": "the members of a religious cult",
                        "vi": "các thành viên của một giáo phái tôn giáo"
                    }
                ]
            },
            {
                "define": {
                    "en": "a system of religious beliefs and practices",
                    "vi": "một hệ thống tín ngưỡng và thực hành tôn giáo"
                },
                "examples": [
                    {
                        "en": "the Chinese cult of ancestor worship",
                        "vi": "tín ngưỡng thờ cúng tổ tiên của người Trung Quốc"
                    }
                ]
            }
        ]
    },
    {
        "id": "eb85e80948a24afd8d747435d2fa4650",
        "word": "enlightenment",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ɪnˈlaɪtnmənt/",
            "us": "/ɪnˈlaɪtnmənt/"
        },
        "nearby": [
            {
                "word": "enlightened",
                "pos": "adjective"
            },
            {
                "word": "enlightening",
                "pos": "adjective"
            },
            {
                "word": "enlightenment",
                "pos": "noun"
            },
            {
                "word": "enlist",
                "pos": "verb"
            },
            {
                "word": "enlisted",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "knowledge about and understanding of something; the process of understanding something or making somebody understand it",
                    "vi": "kiến thức về và hiểu biết về một cái gì đó; quá trình hiểu điều gì đó hoặc làm cho ai đó hiểu nó"
                },
                "examples": [
                    {
                        "en": "The newspapers provided little enlightenment about the cause of the accident.",
                        "vi": "Các tờ báo cung cấp rất ít thông tin về nguyên nhân của vụ tai nạn."
                    },
                    {
                        "en": "spiritual enlightenment",
                        "vi": "giác ngộ tâm linh"
                    }
                ]
            },
            {
                "define": {
                    "en": "the period in the 18th century in Europe when many writers and scientists began to argue that science and reason were more important than religion and tradition",
                    "vi": "thời kỳ vào thế kỷ 18 ở Châu Âu khi nhiều nhà văn và nhà khoa học bắt đầu tranh luận rằng khoa học và lý trí quan trọng hơn tôn giáo và truyền thống."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "ceafabb9bc404792905a691808c14a42",
        "word": "fate",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/feɪt/",
            "us": "/feɪt/"
        },
        "nearby": [
            {
                "word": "fat camp",
                "pos": "noun"
            },
            {
                "word": "fat cat",
                "pos": "noun"
            },
            {
                "word": "fate",
                "pos": "noun"
            },
            {
                "word": "fated",
                "pos": "adjective"
            },
            {
                "word": "fateful",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the things, especially bad things, that will happen or have happened to somebody/something",
                    "vi": "những điều, đặc biệt là những điều tồi tệ, sẽ xảy ra hoặc đã xảy ra với ai đó / điều gì đó"
                },
                "examples": [
                    {
                        "en": "The fate of the three men is unknown.",
                        "vi": "Hiện chưa rõ số phận của ba người đàn ông."
                    },
                    {
                        "en": "She sat outside, waiting to find out her fate.",
                        "vi": "Cô ngồi bên ngoài, chờ đợi để tìm ra số phận của mình."
                    },
                    {
                        "en": "The court will decide our fate/fates.",
                        "vi": "Tòa án sẽ quyết định số phận / số phận của chúng tôi."
                    },
                    {
                        "en": "Each of the managers suffered the same fate.",
                        "vi": "Mỗi người trong số các nhà quản lý đều chịu chung số phận."
                    },
                    {
                        "en": "He warned about the scam so others could avoid a similar fate.",
                        "vi": "Anh đã cảnh báo về vụ lừa đảo để những người khác có thể tránh được số phận tương tự."
                    },
                    {
                        "en": "Inhabitants of war-torn areas have been abandoned to their fate.",
                        "vi": "Cư dân của các khu vực bị chiến tranh tàn phá đã bị phó mặc cho số phận của họ."
                    },
                    {
                        "en": "From that moment our fate was sealed (= our future was decided).",
                        "vi": "Kể từ thời điểm đó, số phận của chúng tôi đã được định đoạt (= tương lai của chúng tôi đã được định đoạt)."
                    }
                ]
            },
            {
                "define": {
                    "en": "the power that is believed to control everything that happens and that cannot be stopped or changed",
                    "vi": "sức mạnh được cho là có thể kiểm soát mọi thứ xảy ra và không thể bị dừng lại hoặc thay đổi"
                },
                "examples": [
                    {
                        "en": "Fate was kind to me that day.",
                        "vi": "Số phận đã tốt với tôi ngày hôm đó."
                    },
                    {
                        "en": "By a strange twist of fate, Andy and I were on the same plane.",
                        "vi": "Bởi một sự xoay vần kỳ lạ của số phận, Andy và tôi đã ở trên cùng một chiếc máy bay."
                    }
                ]
            },
            {
                "define": {
                    "en": "a terrible thing that could happen",
                    "vi": "một điều khủng khiếp có thể xảy ra"
                },
                "examples": [
                    {
                        "en": "At the last minute the hero saves her from a fate worse than death.",
                        "vi": "Vào phút cuối, người hùng cứu cô khỏi số phận còn hơn cả cái chết."
                    }
                ]
            },
            {
                "define": {
                    "en": "to do something too confidently in a way that might mean that your good luck will come to an end",
                    "vi": "làm điều gì đó quá tự tin theo cách có thể có nghĩa là may mắn của bạn sẽ kết thúc"
                },
                "examples": [
                    {
                        "en": "She felt it would be tempting fate to try the difficult climb a second time.",
                        "vi": "Cô cảm thấy số phận sẽ thật cám dỗ nếu thử leo lên lần thứ hai."
                    },
                    {
                        "en": "It would be tempting fate to say that we will definitely win the game.",
                        "vi": "Sẽ thật là cám dỗ khi nói rằng chúng tôi chắc chắn sẽ giành chiến thắng trong trò chơi."
                    }
                ]
            }
        ]
    },
    {
        "id": "0df55d7638a14cbda54579d2a2369401",
        "word": "Islamic",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ɪzˈlæmɪk/",
            "us": "/ɪzˈlæmɪk/"
        },
        "nearby": [
            {
                "word": "Isla",
                "pos": ""
            },
            {
                "word": "Islam",
                "pos": "noun"
            },
            {
                "word": "Islamic",
                "pos": "adjective"
            },
            {
                "word": "Islamism",
                "pos": "noun"
            },
            {
                "word": "Islamist",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "connected with the Muslim religion",
                    "vi": "kết nối với tôn giáo Hồi giáo"
                },
                "examples": [
                    {
                        "en": "Islamic law",
                        "vi": "Luật Hồi giáo"
                    }
                ]
            }
        ]
    },
    {
        "id": "060a3832a74b46539e2b5aff4c24df0e",
        "word": "miracle",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈmɪrəkl/",
            "us": "/ˈmɪrəkl/"
        },
        "nearby": [
            {
                "word": "MIPS",
                "pos": "abbreviation"
            },
            {
                "word": "miraa",
                "pos": "noun"
            },
            {
                "word": "miracle",
                "pos": "noun"
            },
            {
                "word": "miracle play",
                "pos": "noun"
            },
            {
                "word": "miraculous",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an act or event that does not follow the laws of nature and is believed to be caused by God",
                    "vi": "một hành động hoặc sự kiện không tuân theo quy luật tự nhiên và được cho là do Đức Chúa Trời gây ra"
                },
                "examples": [
                    {
                        "en": "the miracle of rising from the grave",
                        "vi": "phép màu trỗi dậy từ nấm mồ"
                    }
                ]
            },
            {
                "define": {
                    "en": "a lucky thing that happens that you did not expect or think was possible",
                    "vi": "một điều may mắn xảy ra mà bạn không ngờ tới hoặc nghĩ là có thể"
                },
                "examples": [
                    {
                        "en": "an economic miracle",
                        "vi": "một phép lạ kinh tế"
                    },
                    {
                        "en": "a miracle cure/drug",
                        "vi": "một phương pháp chữa bệnh / thuốc kỳ diệu"
                    },
                    {
                        "en": "it is a miracle (that)… It's a miracle (that) nobody was killed in the crash.",
                        "vi": "nó là một phép lạ (điều đó)… Đó là một phép lạ (rằng) không ai thiệt mạng trong vụ tai nạn."
                    },
                    {
                        "en": "It would take a miracle to make this business profitable.",
                        "vi": "Sẽ cần một phép màu để làm cho công việc kinh doanh này có lãi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a very good example or product of something",
                    "vi": "một ví dụ rất tốt hoặc sản phẩm của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "The car is a miracle of engineering.",
                        "vi": "Chiếc xe là một điều kỳ diệu của kỹ thuật."
                    },
                    {
                        "en": "A colony of bees is a miracle of organization.",
                        "vi": "Một đàn ong là một điều kỳ diệu của tổ chức."
                    }
                ]
            },
            {
                "define": {
                    "en": "to achieve very good results",
                    "vi": "để đạt được kết quả rất tốt"
                },
                "examples": [
                    {
                        "en": "Her exercise programme has worked miracles for her.",
                        "vi": "Chương trình tập thể dục của cô ấy đã mang lại những điều kỳ diệu cho cô ấy."
                    },
                    {
                        "en": "You can work miracles with very little money if you follow our home decoration tips.",
                        "vi": "Bạn có thể làm nên những điều kỳ diệu với rất ít tiền nếu làm theo các mẹo trang trí nhà cửa của chúng tôi."
                    },
                    {
                        "en": "He performed miracles to get everything ready in time.",
                        "vi": "Anh ấy đã thực hiện phép màu để mọi thứ sẵn sàng kịp thời."
                    }
                ]
            }
        ]
    },
    {
        "id": "9edf240d008149ba8e6fbc492645a284",
        "word": "Mohammed",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/məˈhæmɪd/",
            "us": "/məʊˈhɑːmɪd/"
        },
        "nearby": [
            {
                "word": "mohair",
                "pos": "noun"
            },
            {
                "word": "mohalla",
                "pos": "noun"
            },
            {
                "word": "Mohammed",
                "pos": "noun"
            },
            {
                "word": "Mohawk",
                "pos": "noun"
            },
            {
                "word": "Mohican",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the Arab Prophet through whom the Koran was revealed and the religion of Islam established and completed",
                    "vi": "Nhà tiên tri Ả Rập mà qua đó Kinh Koran đã được tiết lộ và tôn giáo của Hồi giáo được thiết lập và hoàn thiện"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a first name for boys",
                    "vi": "tên đầu tiên cho con trai"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "75a87d9e1bcf4d4cb045c13ef19d173d",
        "word": "multi-faith",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌmʌlti ˈfeɪθ/",
            "us": "/ˌmʌlti ˈfeɪθ/"
        },
        "nearby": [
            {
                "word": "multi-ethnic",
                "pos": "adjective"
            },
            {
                "word": "multifaceted",
                "pos": "adjective"
            },
            {
                "word": "multi-faith",
                "pos": "adjective"
            },
            {
                "word": "multifarious",
                "pos": "adjective"
            },
            {
                "word": "multifunctional",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "involving two or more religions",
                    "vi": "liên quan đến hai hoặc nhiều tôn giáo"
                },
                "examples": [
                    {
                        "en": "Multi-faith ceremonies will be held to mark the occasion.",
                        "vi": "Các nghi lễ đa tín ngưỡng sẽ được tổ chức để đánh dấu dịp này."
                    }
                ]
            }
        ]
    },
    {
        "id": "8b87f793672a4b249de8a07ff874ff2f",
        "word": "Protestant",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈprɒtɪstənt/",
            "us": "/ˈprɑːtɪstənt/"
        },
        "nearby": [
            {
                "word": "protest",
                "pos": "noun"
            },
            {
                "word": "protest",
                "pos": "verb"
            },
            {
                "word": "Protestant",
                "pos": "adjective"
            },
            {
                "word": "Protestant",
                "pos": "noun"
            },
            {
                "word": "the Protestant Episcopal Church",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "belonging to or connected with the part of the Western Christian Church that separated from the Roman Catholic Church in the 16th century",
                    "vi": "thuộc về hoặc kết nối với một phần của Giáo hội Cơ đốc phương Tây tách khỏi Giáo hội Công giáo La Mã vào thế kỷ 16"
                },
                "examples": [
                    {
                        "en": "The majority of the population is Protestant.",
                        "vi": "Phần lớn dân số theo đạo Tin lành."
                    },
                    {
                        "en": "a Protestant church/country",
                        "vi": "một nhà thờ Tin lành / quốc gia"
                    }
                ]
            }
        ]
    },
    {
        "id": "c9b16b37e1b7495883a267611d9f855c",
        "word": "Protestantism",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈprɒtɪstəntɪzəm/",
            "us": "/ˈprɑːtɪstəntɪzəm/"
        },
        "nearby": [
            {
                "word": "the Protestant Episcopal Church",
                "pos": ""
            },
            {
                "word": "Protestant ethic",
                "pos": "noun"
            },
            {
                "word": "Protestantism",
                "pos": "noun"
            },
            {
                "word": "protestation",
                "pos": "noun"
            },
            {
                "word": "protester",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the beliefs and principles of the part of the Western Christian Church that separated from the Roman Catholic Church in the 16th century",
                    "vi": "niềm tin và nguyên tắc của một phần của Giáo hội Cơ đốc phương Tây tách khỏi Giáo hội Công giáo La mã vào thế kỷ 16"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "d6f2042e1623446b821725d62ba28641",
        "word": "sacred",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈseɪkrɪd/",
            "us": "/ˈseɪkrɪd/"
        },
        "nearby": [
            {
                "word": "sacramental",
                "pos": "adjective"
            },
            {
                "word": "Sacramento",
                "pos": ""
            },
            {
                "word": "sacred",
                "pos": "adjective"
            },
            {
                "word": "sacred cow",
                "pos": "noun"
            },
            {
                "word": "sacredness",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "connected with God or a god; considered to be holy",
                    "vi": "kết nối với Chúa hoặc một vị thần; được coi là thánh"
                },
                "examples": [
                    {
                        "en": "a sacred image/shrine/temple",
                        "vi": "một hình ảnh linh thiêng / đền thờ / đền thờ"
                    },
                    {
                        "en": "sacred music",
                        "vi": "Âm nhạc thiêng liêng"
                    },
                    {
                        "en": "Cows are sacred to Hindus.",
                        "vi": "Bò rất linh thiêng đối với người theo đạo Hindu."
                    }
                ]
            },
            {
                "define": {
                    "en": "very important and treated with great respect; that must not be changed or challenged",
                    "vi": "rất quan trọng và được đối xử hết sức tôn trọng; điều đó không được thay đổi hoặc thách thức"
                },
                "examples": [
                    {
                        "en": "Human life must always be sacred.",
                        "vi": "Đời người luôn phải thiêng liêng."
                    },
                    {
                        "en": "For journalists nothing is sacred (= they write about anything).",
                        "vi": "Đối với các nhà báo không có gì là thiêng liêng (= họ viết về bất cứ điều gì)."
                    },
                    {
                        "en": "Some companies offer five-year plans but there is nothing sacred about this length of time (= it can be changed).",
                        "vi": "Một số công ty đưa ra kế hoạch 5 năm nhưng không có gì thiêng liêng về khoảng thời gian này (= nó có thể được thay đổi)."
                    }
                ]
            }
        ]
    },
    {
        "id": "f5f889f3ef844e84a99f1b4b6d10f0e2",
        "word": "theological",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌθiːəˈlɒdʒɪkl/",
            "us": "/ˌθiːəˈlɑːdʒɪkl/"
        },
        "nearby": [
            {
                "word": "Theodore",
                "pos": ""
            },
            {
                "word": "theologian",
                "pos": "noun"
            },
            {
                "word": "theological",
                "pos": "adjective"
            },
            {
                "word": "theologically",
                "pos": "adverb"
            },
            {
                "word": "theology",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "connected with the study of religion and beliefs",
                    "vi": "kết nối với việc nghiên cứu tôn giáo và tín ngưỡng"
                },
                "examples": [
                    {
                        "en": "(British English) a theological college",
                        "vi": "(Tiếng Anh Anh) một trường cao đẳng thần học"
                    },
                    {
                        "en": "(North American English) a theological seminary",
                        "vi": "(Tiếng Anh Bắc Mỹ) một chủng viện thần học"
                    }
                ]
            }
        ]
    },
    {
        "id": "33aa93dfe52641bb8da5ac1457fdc553",
        "word": "theologically",
        "pos": "adverb",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌθiːəˈlɒdʒɪkli/",
            "us": "/ˌθiːəˈlɑːdʒɪkli/"
        },
        "nearby": [
            {
                "word": "theologian",
                "pos": "noun"
            },
            {
                "word": "theological",
                "pos": "adjective"
            },
            {
                "word": "theologically",
                "pos": "adverb"
            },
            {
                "word": "theology",
                "pos": "noun"
            },
            {
                "word": "theorem",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "in a way that is connected with the study of religion and beliefs",
                    "vi": "theo cách có liên quan đến việc nghiên cứu tôn giáo và tín ngưỡng"
                },
                "examples": [
                    {
                        "en": "As a church, it is both politically and theologically conservative.",
                        "vi": "Là một nhà thờ, nó bảo thủ cả về mặt chính trị và thần học."
                    }
                ]
            }
        ]
    },
    {
        "id": "d7d0636b561643b894c09a338b19344b",
        "word": "theology",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/θiˈɒlədʒi/",
            "us": "/θiˈɑːlədʒi/"
        },
        "nearby": [
            {
                "word": "theological",
                "pos": "adjective"
            },
            {
                "word": "theologically",
                "pos": "adverb"
            },
            {
                "word": "theology",
                "pos": "noun"
            },
            {
                "word": "theorem",
                "pos": "noun"
            },
            {
                "word": "theoretical",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the study of religion and beliefs",
                    "vi": "nghiên cứu về tôn giáo và tín ngưỡng"
                },
                "examples": [
                    {
                        "en": "a degree in theology",
                        "vi": "bằng thần học"
                    },
                    {
                        "en": "a theology student",
                        "vi": "một sinh viên thần học"
                    },
                    {
                        "en": "the rarefied world of academic theology",
                        "vi": "thế giới hiếm hoi của thần học hàn lâm"
                    }
                ]
            },
            {
                "define": {
                    "en": "a set of religious beliefs",
                    "vi": "một tập hợp các niềm tin tôn giáo"
                },
                "examples": [
                    {
                        "en": "the theologies of the East",
                        "vi": "thần học phương Đông"
                    }
                ]
            }
        ]
    },
    {
        "id": "790a17464ca84ac9aee19c87e2c7e736",
        "word": "absolutism",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈæbsəluːtɪzəm/",
            "us": "/ˈæbsəluːtɪzəm/"
        },
        "nearby": [
            {
                "word": "absolute zero",
                "pos": "noun"
            },
            {
                "word": "absolution",
                "pos": "noun"
            },
            {
                "word": "absolutism",
                "pos": "noun"
            },
            {
                "word": "absolutist",
                "pos": "noun"
            },
            {
                "word": "absolutist",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a political system in which a leader or government has total power at all times",
                    "vi": "một hệ thống chính trị trong đó một nhà lãnh đạo hoặc chính phủ luôn có toàn quyền"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "belief in a political, religious or moral principle that is thought to be true in all circumstances",
                    "vi": "niềm tin vào một nguyên tắc chính trị, tôn giáo hoặc đạo đức được cho là đúng trong mọi hoàn cảnh"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "f1c326e339a14f728e10a1842c8c464c",
        "word": "afterlife",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɑːftəlaɪf/",
            "us": "/ˈæftərlaɪf/"
        },
        "nearby": [
            {
                "word": "after-hours",
                "pos": "adjective"
            },
            {
                "word": "after-image",
                "pos": "noun"
            },
            {
                "word": "afterlife",
                "pos": "noun"
            },
            {
                "word": "aftermarket",
                "pos": "noun"
            },
            {
                "word": "aftermath",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a life that some people believe exists after death",
                    "vi": "một cuộc sống mà một số người tin rằng tồn tại sau khi chết"
                },
                "examples": [
                    {
                        "en": "Most Christians believe in an afterlife of some sort, often referred to as heaven.",
                        "vi": "Hầu hết các Cơ đốc nhân tin vào một thế giới bên kia, thường được gọi là thiên đường."
                    }
                ]
            }
        ]
    },
    {
        "id": "93fc7fcb2018432d98866bb0c37ee130",
        "word": "agnostic",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/æɡˈnɒstɪk/",
            "us": "/æɡˈnɑːstɪk/"
        },
        "nearby": [
            {
                "word": "agnosia",
                "pos": "noun"
            },
            {
                "word": "agnostic",
                "pos": "noun"
            },
            {
                "word": "agnostic",
                "pos": "adjective"
            },
            {
                "word": "agnosticism",
                "pos": "noun"
            },
            {
                "word": "ago",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "holding or showing the belief that it is not possible to know whether God exists or not",
                    "vi": "giữ hoặc thể hiện niềm tin rằng không thể biết liệu Chúa có tồn tại hay không"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "not having a strong opinion about an activity or topic",
                    "vi": "không có quan điểm chính xác về một hoạt động hoặc chủ đề"
                },
                "examples": [
                    {
                        "en": "I’m largely agnostic on this issue as I know so little about it.",
                        "vi": "Tôi phần lớn không có khả năng về vấn đề này vì tôi biết quá ít về nó."
                    }
                ]
            },
            {
                "define": {
                    "en": "(used about computer hardware or software) able to be used with many different types of computer systems, software or operating systems",
                    "vi": "(được sử dụng về phần cứng hoặc phần mềm máy tính) có thể được sử dụng với nhiều loại hệ thống máy tính, phần mềm hoặc hệ điều hành khác nhau"
                },
                "examples": [
                    {
                        "en": "Now that the services are platform-agnostic, they can be accessed by far more users.",
                        "vi": "Giờ đây, các dịch vụ này không có tính nền tảng, chúng có thể được nhiều người dùng hơn rất nhiều truy cập."
                    }
                ]
            }
        ]
    },
    {
        "id": "cacd2f582e3f46e6a45983cde03df455",
        "word": "agnosticism",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/æɡˈnɒstɪsɪzəm/",
            "us": "/æɡˈnɑːstɪsɪzəm/"
        },
        "nearby": [
            {
                "word": "agnostic",
                "pos": "noun"
            },
            {
                "word": "agnostic",
                "pos": "adjective"
            },
            {
                "word": "agnosticism",
                "pos": "noun"
            },
            {
                "word": "ago",
                "pos": "adverb"
            },
            {
                "word": "agog",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the belief that it is not possible to know whether God exists or not",
                    "vi": "niềm tin rằng không thể biết liệu Chúa có tồn tại hay không"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "b63dd38b50a74231a076dabb962bbb34",
        "word": "Anglican",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈæŋɡlɪkən/",
            "us": "/ˈæŋɡlɪkən/"
        },
        "nearby": [
            {
                "word": "Anglesey",
                "pos": ""
            },
            {
                "word": "Anglican",
                "pos": "noun"
            },
            {
                "word": "Anglican",
                "pos": "adjective"
            },
            {
                "word": "the Anglican Communion",
                "pos": ""
            },
            {
                "word": "Anglicism",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "of or connected with the Church of England or another Church connected with it in a different country",
                    "vi": "của hoặc được kết nối với Nhà thờ Anh hoặc một Nhà thờ khác được kết nối với Nhà thờ ở một quốc gia khác"
                },
                "examples": [
                    {
                        "en": "the Anglican Church",
                        "vi": "Nhà thờ Anh giáo"
                    }
                ]
            }
        ]
    },
    {
        "id": "724959fcdf444ece83261ef8e69d8a63",
        "word": "the Anglican Communion",
        "pos": "",
        "level": "c2",
        "phonetic": {
            "uk": "/ði ˌæŋɡlɪkən kəˈmjuːniən/",
            "us": "/ði ˌæŋɡlɪkən kəˈmjuːniən/"
        },
        "nearby": [
            {
                "word": "Anglican",
                "pos": "noun"
            },
            {
                "word": "Anglican",
                "pos": "adjective"
            },
            {
                "word": "the Anglican Communion",
                "pos": ""
            },
            {
                "word": "Anglicism",
                "pos": "noun"
            },
            {
                "word": "anglicize",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an organization consisting of the Church of England and other churches in Britain and abroad that have historical links with the Church of England. Its leader is the Archbishop of Canterbury. The Scottish Episcopal Church, the Church of Ireland, the Church in Wales and the Episcopal Church in the US are all part of the Anglican Communion. There are also a number of large Anglican churches in Africa. There has been disagreement between members of the Anglican community in recent years especially about attitudes to same-sex marriage and gay priests. Every ten years all the bishops of the Anglican Communion attend the Lambeth Conference.",
                    "vi": "một tổ chức bao gồm Nhà thờ Anh và các nhà thờ khác ở Anh và nước ngoài có liên hệ lịch sử với Nhà thờ Anh. Lãnh đạo của nó là Tổng giám mục Canterbury. Nhà thờ Episcopal Scotland, Nhà thờ Ireland, Nhà thờ ở Wales và Nhà thờ Episcopal ở Hoa Kỳ đều là một phần của Hiệp thông Anh giáo. Ngoài ra còn có một số nhà thờ Anh giáo lớn ở Châu Phi. Đã có sự bất đồng giữa các thành viên của cộng đồng Anh giáo trong những năm gần đây, đặc biệt là về thái độ đối với hôn nhân đồng tính và các linh mục đồng tính. Cứ mười năm một lần, tất cả các giám mục của Anh giáo đều tham dự Hội nghị Lambeth."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "4133f44d1837447ea3cbd2c78736fe29",
        "word": "animism",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈænɪmɪzəm/",
            "us": "/ˈænɪmɪzəm/"
        },
        "nearby": [
            {
                "word": "animatronics",
                "pos": "noun"
            },
            {
                "word": "anime",
                "pos": "noun"
            },
            {
                "word": "animism",
                "pos": "noun"
            },
            {
                "word": "animist",
                "pos": "noun"
            },
            {
                "word": "animistic",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the belief that plants, objects and natural things such as the weather have a living soul",
                    "vi": "niềm tin rằng thực vật, đồ vật và những thứ tự nhiên như thời tiết có một linh hồn sống"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "belief in a power that organizes and controls the universe",
                    "vi": "niềm tin vào một sức mạnh tổ chức và kiểm soát vũ trụ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "278e5beea3924d2db6ddacbf0e84f592",
        "word": "animist",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈænɪmɪst/",
            "us": "/ˈænɪmɪst/"
        },
        "nearby": [
            {
                "word": "anime",
                "pos": "noun"
            },
            {
                "word": "animism",
                "pos": "noun"
            },
            {
                "word": "animist",
                "pos": "noun"
            },
            {
                "word": "animistic",
                "pos": "adjective"
            },
            {
                "word": "animosity",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who believes that plants, objects and natural things such as the weather have a living soul",
                    "vi": "một người tin rằng thực vật, đồ vật và những thứ tự nhiên như thời tiết có linh hồn sống"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a person who believes in a power that organizes and controls the universe",
                    "vi": "một người tin vào sức mạnh tổ chức và điều khiển vũ trụ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "e5750ed197c14f1fbe9ca05d9f9d24ea",
        "word": "ascension",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/əˈsenʃn/",
            "us": "/əˈsenʃn/"
        },
        "nearby": [
            {
                "word": "ascendancy",
                "pos": "noun"
            },
            {
                "word": "ascendant",
                "pos": "noun"
            },
            {
                "word": "ascension",
                "pos": "noun"
            },
            {
                "word": "Ascension Day",
                "pos": "noun"
            },
            {
                "word": "ascent",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the journey of Jesus from the earth into heaven",
                    "vi": "cuộc hành trình của Chúa Giê-xu từ đất lên trời"
                },
                "examples": [
                    {
                        "en": "the death, resurrection and ascension of Jesus Christ",
                        "vi": "cái chết, sự phục sinh và sự thăng thiên của Chúa Giê Su Ky Tô"
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of moving up or of reaching a high position",
                    "vi": "hành động di chuyển lên hoặc đạt đến một vị trí cao"
                },
                "examples": [
                    {
                        "en": "her ascension to the throne",
                        "vi": "sự lên ngôi của cô ấy"
                    }
                ]
            }
        ]
    },
    {
        "id": "dc875a729447444f984e554b5462141d",
        "word": "ascetic",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/əˈsetɪk/",
            "us": "/əˈsetɪk/"
        },
        "nearby": [
            {
                "word": "ascertainment",
                "pos": "noun"
            },
            {
                "word": "ascetic",
                "pos": "noun"
            },
            {
                "word": "ascetic",
                "pos": "adjective"
            },
            {
                "word": "asceticism",
                "pos": "noun"
            },
            {
                "word": "ASCII",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "not allowing yourself physical pleasures, especially for religious reasons; related to a simple and strict way of living",
                    "vi": "không cho phép mình có những thú vui thể xác, đặc biệt là vì lý do tôn giáo; liên quan đến cách sống đơn giản và nghiêm khắc"
                },
                "examples": [
                    {
                        "en": "The monks lived a very ascetic life.",
                        "vi": "Các nhà sư đã sống một cuộc đời rất khổ hạnh."
                    },
                    {
                        "en": "Living hidden away in the mountains suited his ascetic character.",
                        "vi": "Sống ẩn mình trong núi phù hợp với tính cách khổ hạnh của ông."
                    }
                ]
            }
        ]
    },
    {
        "id": "7c5b3b81d38146ca9e0b80c00b5df39e",
        "word": "asceticism",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/əˈsetɪsɪzəm/",
            "us": "/əˈsetɪsɪzəm/"
        },
        "nearby": [
            {
                "word": "ascetic",
                "pos": "noun"
            },
            {
                "word": "ascetic",
                "pos": "adjective"
            },
            {
                "word": "asceticism",
                "pos": "noun"
            },
            {
                "word": "ASCII",
                "pos": "noun"
            },
            {
                "word": "ascorbic acid",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the practice of living in a simple and strict way, without physical pleasures, especially for religious reasons",
                    "vi": "Thực hành sống một cách đơn giản và nghiêm ngặt, không có thú vui thể xác, đặc biệt là vì lý do tôn giáo"
                },
                "examples": [
                    {
                        "en": "a life of private prayer and asceticism",
                        "vi": "một cuộc sống cầu nguyện riêng tư và khổ hạnh"
                    }
                ]
            }
        ]
    },
    {
        "id": "ffb7509146624c8580a6bc04d2686cac",
        "word": "atheism",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈeɪθiɪzəm/",
            "us": "/ˈeɪθiɪzəm/"
        },
        "nearby": [
            {
                "word": "atemporal",
                "pos": "adjective"
            },
            {
                "word": "ATF",
                "pos": ""
            },
            {
                "word": "atheism",
                "pos": "noun"
            },
            {
                "word": "atheist",
                "pos": "noun"
            },
            {
                "word": "atheistic",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "lack of belief in the existence of God or gods",
                    "vi": "thiếu niềm tin vào sự tồn tại của Chúa hoặc các vị thần"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "446de366d6fe4b9b84991d86ffb0030c",
        "word": "atheistic",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌeɪθiˈɪstɪk/",
            "us": "/ˌeɪθiˈɪstɪk/"
        },
        "nearby": [
            {
                "word": "atheism",
                "pos": "noun"
            },
            {
                "word": "atheist",
                "pos": "noun"
            },
            {
                "word": "atheistic",
                "pos": "adjective"
            },
            {
                "word": "the Athenaeum",
                "pos": ""
            },
            {
                "word": "athleisure",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "connected with the belief that God does not exist",
                    "vi": "kết nối với niềm tin rằng Chúa không tồn tại"
                },
                "examples": [
                    {
                        "en": "an atheistic philosophy",
                        "vi": "một triết học vô thần"
                    }
                ]
            }
        ]
    },
    {
        "id": "931369bf21c54902abb88594b8fe12c5",
        "word": "Baha’i",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/bəˈhaɪ/",
            "us": "/bəˈhaɪ/"
        },
        "nearby": [
            {
                "word": "bah",
                "pos": "exclamation"
            },
            {
                "word": "bahadur",
                "pos": "noun"
            },
            {
                "word": "Baha'i",
                "pos": "noun"
            },
            {
                "word": "the Bahamas",
                "pos": ""
            },
            {
                "word": "Bahamian",
                "pos": "noun, adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a religion that teaches that all people and religions are the same, and that there should be peace",
                    "vi": "một tôn giáo dạy rằng tất cả mọi người và tôn giáo đều giống nhau, và cần phải có hòa bình"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "57dfbef5999c406e8885b930e074be27",
        "word": "Baptist",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbæptɪst/",
            "us": "/ˈbæptɪst/"
        },
        "nearby": [
            {
                "word": "baptism",
                "pos": "noun"
            },
            {
                "word": "baptismal",
                "pos": "adjective"
            },
            {
                "word": "Baptist",
                "pos": "adjective"
            },
            {
                "word": "Baptist",
                "pos": "noun"
            },
            {
                "word": "baptize",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "being a Baptist; connected with Baptists",
                    "vi": "là một Baptist; kết nối với Baptists"
                },
                "examples": [
                    {
                        "en": "a Baptist church",
                        "vi": "một nhà thờ Baptist"
                    }
                ]
            }
        ]
    },
    {
        "id": "6871e4c556834b5496308b4d74e0354a",
        "word": "beatification",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/biˌætɪfɪˈkeɪʃn/",
            "us": "/biˌætɪfɪˈkeɪʃn/"
        },
        "nearby": [
            {
                "word": "the beat generation",
                "pos": "noun"
            },
            {
                "word": "beatific",
                "pos": "adjective"
            },
            {
                "word": "beatification",
                "pos": "noun"
            },
            {
                "word": "beatify",
                "pos": "verb"
            },
            {
                "word": "beating",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act by the Pope of beatifying somebody; the process of somebody being beatified by the Pope",
                    "vi": "hành động của Giáo hoàng trong việc phong chân phước cho ai đó; quá trình một người nào đó được phong chân phước bởi Giáo hoàng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "b8d88625d3a64b5598ae051ee3230b22",
        "word": "beatify",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/biˈætɪfaɪ/",
            "us": "/biˈætɪfaɪ/"
        },
        "nearby": [
            {
                "word": "beatific",
                "pos": "adjective"
            },
            {
                "word": "beatification",
                "pos": "noun"
            },
            {
                "word": "beatify",
                "pos": "verb"
            },
            {
                "word": "beating",
                "pos": "noun"
            },
            {
                "word": "beating the bounds",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to give a dead person a special honour by stating officially that he/she is very holy",
                    "vi": "trao cho một người đã chết một vinh dự đặc biệt bằng cách chính thức tuyên bố rằng anh ấy / cô ấy rất thánh"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "ad7aa2e981064e08b8fa8ac019cf7f98",
        "word": "Benedictine",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌbenɪˈdɪktɪn/",
            "us": "/ˌbenɪˈdɪktɪn/"
        },
        "nearby": [
            {
                "word": "Benedict",
                "pos": ""
            },
            {
                "word": "Benedictine",
                "pos": "noun"
            },
            {
                "word": "Benedictine",
                "pos": "adjective"
            },
            {
                "word": "benediction",
                "pos": "noun"
            },
            {
                "word": "benefaction",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "connected with a Christian group of monks or nuns who follow the rules of St Benedict",
                    "vi": "được kết nối với một nhóm tu sĩ hoặc nữ tu Cơ đốc tuân theo các quy tắc của Thánh Benedict"
                },
                "examples": [
                    {
                        "en": "a Benedictine monastery",
                        "vi": "một tu viện Benedictine"
                    }
                ]
            }
        ]
    },
    {
        "id": "1a6c511c1b9545d785e282934164e1c1",
        "word": "born-again",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌbɔːn əˈɡen/",
            "us": "/ˌbɔːrn əˈɡen/"
        },
        "nearby": [
            {
                "word": "born",
                "pos": "verb"
            },
            {
                "word": "born",
                "pos": "adjective"
            },
            {
                "word": "born-again",
                "pos": "adjective"
            },
            {
                "word": "borne",
                "pos": "verb"
            },
            {
                "word": "boron",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "having come to have a strong belief in a particular religion (especially evangelical Christianity) or idea, and wanting other people to have the same belief",
                    "vi": "bắt đầu có một niềm tin mạnh mẽ vào một tôn giáo cụ thể (đặc biệt là Cơ đốc giáo truyền giáo) hoặc ý tưởng và muốn người khác có cùng niềm tin"
                },
                "examples": [
                    {
                        "en": "a born-again Christian",
                        "vi": "một Cơ đốc nhân tái sinh"
                    },
                    {
                        "en": "a born-again vegetarian",
                        "vi": "một người ăn chay tái sinh"
                    }
                ]
            }
        ]
    },
    {
        "id": "3885eac72ff44677a7823b3685a0df10",
        "word": "cabalistic",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌkæbəˈlɪstɪk/",
            "us": "/ˌkæbəˈlɪstɪk/"
        },
        "nearby": [
            {
                "word": "cabal",
                "pos": "noun"
            },
            {
                "word": "Cabala",
                "pos": "noun"
            },
            {
                "word": "cabalistic",
                "pos": "adjective"
            },
            {
                "word": "cabana",
                "pos": "noun"
            },
            {
                "word": "cabaret",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "relating to secret or mystical beliefs",
                    "vi": "liên quan đến niềm tin bí mật hoặc thần bí"
                },
                "examples": [
                    {
                        "en": "It was a world of cabalistic doctrines and revelations, populated with saints, magicians and teachers.",
                        "vi": "Đó là một thế giới của những học thuyết và tiết lộ mang tính cabalistic, với những vị thánh, pháp sư và giáo viên."
                    }
                ]
            }
        ]
    },
    {
        "id": "e17edfc8f6bf446f9174d90a953c266b",
        "word": "Calvinism",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkælvɪnɪzəm/",
            "us": "/ˈkælvɪnɪzəm/"
        },
        "nearby": [
            {
                "word": "calve",
                "pos": "verb"
            },
            {
                "word": "calves",
                "pos": "noun"
            },
            {
                "word": "Calvinism",
                "pos": "noun"
            },
            {
                "word": "Calvinist",
                "pos": "noun"
            },
            {
                "word": "Calvinist",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the set of beliefs based on the teachings of the French Protestant, John Calvin",
                    "vi": "tập hợp các niềm tin dựa trên những lời dạy của người Pháp theo đạo Tin lành, John Calvin"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "4cc79d1137ae4a47bdfa0998af4d78f3",
        "word": "Calvinist",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkælvɪnɪst/",
            "us": "/ˈkælvɪnɪst/"
        },
        "nearby": [
            {
                "word": "Calvinism",
                "pos": "noun"
            },
            {
                "word": "Calvinist",
                "pos": "noun"
            },
            {
                "word": "Calvinist",
                "pos": "adjective"
            },
            {
                "word": "calypso",
                "pos": "noun"
            },
            {
                "word": "calyx",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "connected with a Church that follows the teachings of the French Protestant, John Calvin",
                    "vi": "được kết nối với một Giáo hội theo lời dạy của người Pháp theo đạo Tin lành, John Calvin"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "having very strict moral attitudes",
                    "vi": "có thái độ đạo đức rất nghiêm khắc"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "bad3458104fc472d8846ba96ebe093d4",
        "word": "canonic",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/kəˈnɒnɪk/",
            "us": "/kəˈnɑːnɪk/"
        },
        "nearby": [
            {
                "word": "canola",
                "pos": "noun"
            },
            {
                "word": "canon",
                "pos": "noun"
            },
            {
                "word": "canonic",
                "pos": "adjective"
            },
            {
                "word": "canonical",
                "pos": "adjective"
            },
            {
                "word": "canonical form",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "in the form of a canon",
                    "vi": "dưới hình thức kinh điển"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "included in a list of holy books that are accepted as what they are claimed to be",
                    "vi": "được đưa vào danh sách các sách thánh được chấp nhận như những gì chúng được tuyên bố là"
                },
                "examples": [
                    {
                        "en": "the canonic Gospels of the New Testament",
                        "vi": "các sách Phúc âm kinh điển của Tân Ước"
                    }
                ]
            },
            {
                "define": {
                    "en": "according to the law of the Christian Church",
                    "vi": "theo luật của Giáo hội Thiên chúa giáo"
                },
                "examples": [
                    {
                        "en": "canonic law",
                        "vi": "luật kinh điển"
                    }
                ]
            },
            {
                "define": {
                    "en": "accepted as belonging to the group of writers or works of literature that must be highly respected",
                    "vi": "được chấp nhận là thuộc nhóm nhà văn hoặc tác phẩm văn học cần được tôn trọng"
                },
                "examples": [
                    {
                        "en": "canonic writers like Jane Austen",
                        "vi": "các nhà văn kinh điển như Jane Austen"
                    }
                ]
            },
            {
                "define": {
                    "en": "accepted as being true, correct and established",
                    "vi": "được chấp nhận là đúng, đúng và được thiết lập"
                },
                "examples": [
                    {
                        "en": "the canonic methods of science as taught in the classroom",
                        "vi": "các phương pháp khoa học kinh điển được dạy trong lớp học"
                    }
                ]
            },
            {
                "define": {
                    "en": "in the simplest accepted form in mathematics",
                    "vi": "ở dạng toán học được chấp nhận đơn giản nhất"
                },
                "examples": [
                    {
                        "en": "the standard canonic form for a matrix",
                        "vi": "dạng chuẩn cho ma trận"
                    }
                ]
            }
        ]
    },
    {
        "id": "ab5acce059d74bb7bb9536819f02eba7",
        "word": "canon law",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌkænən ˈlɔː/",
            "us": "/ˌkænən ˈlɔː/"
        },
        "nearby": [
            {
                "word": "canonization",
                "pos": "noun"
            },
            {
                "word": "canonize",
                "pos": "verb"
            },
            {
                "word": "canon law",
                "pos": "noun"
            },
            {
                "word": "canoodle",
                "pos": "verb"
            },
            {
                "word": "can opener",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the law of the Christian church",
                    "vi": "luật của nhà thờ thiên chúa giáo"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "25a04573a8654964a873c3ebf7b199f8",
        "word": "Chasidic",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/xæˈsɪdɪk/",
            "us": "/xɑːˈsɪdɪk/"
        },
        "nearby": [
            {
                "word": "chase up",
                "pos": "phrasal verb"
            },
            {
                "word": "Chasid",
                "pos": "noun"
            },
            {
                "word": "Chasidic",
                "pos": "adjective"
            },
            {
                "word": "Chasidism",
                "pos": "noun"
            },
            {
                "word": "chasm",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "connected with Chasidism (= a form of the Jewish religion that has very strict beliefs)",
                    "vi": "kết nối với Chasidism (= một hình thức tôn giáo của người Do Thái có tín ngưỡng rất nghiêm ngặt)"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a2dcd312bb6d4e8b9fee877eba409743",
        "word": "Christian Science",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌkrɪstʃən ˈsaɪəns/",
            "us": "/ˌkrɪstʃən ˈsaɪəns/"
        },
        "nearby": [
            {
                "word": "Christianity",
                "pos": "noun"
            },
            {
                "word": "Christian name",
                "pos": "noun"
            },
            {
                "word": "Christian Science",
                "pos": "noun"
            },
            {
                "word": "Christian Science Monitor",
                "pos": ""
            },
            {
                "word": "Christian Scientist",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the beliefs of a religious group called the Church of Christ, Scientist, which include the belief that the physical world is not real and that you can cure illness by prayer",
                    "vi": "niềm tin của một nhóm tôn giáo được gọi là Nhà thờ Chúa Kitô, Nhà khoa học, bao gồm niềm tin rằng thế giới vật chất là không có thật và bạn có thể chữa khỏi bệnh tật bằng cách cầu nguyện"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "1830efdf5bf7435d9c2cf6dc00a531de",
        "word": "the Church in Wales",
        "pos": "",
        "level": "c2",
        "phonetic": {
            "uk": "/ðə ˌtʃɜːtʃ ɪn ˈweɪlz/",
            "us": "/ðə ˌtʃɜːrtʃ ɪn ˈweɪlz/"
        },
        "nearby": [
            {
                "word": "churchgoing",
                "pos": "noun"
            },
            {
                "word": "Winston Churchill",
                "pos": ""
            },
            {
                "word": "the Church in Wales",
                "pos": ""
            },
            {
                "word": "churchman",
                "pos": "noun"
            },
            {
                "word": "the Church Mission Society",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the Welsh branch of the Anglican Church and part of the Anglican Communion. It became the main Welsh Church in the 16th century, although in the 18th and 19th centuries the majority of people in Wales left it and joined Nonconformist Churches such as the Baptists and the Methodists. The Church in Wales is now a ' disestablished' church, i.e. the British king or queen is no longer its Supreme Governor and it has no connections with the British State.",
                    "vi": "chi nhánh xứ Wales của Nhà thờ Anh giáo và một phần của Hiệp thông Anh giáo. Nó trở thành Nhà thờ chính của xứ Wales vào thế kỷ 16, mặc dù trong thế kỷ 18 và 19, phần lớn người dân ở Wales đã rời bỏ nó và gia nhập các Giáo hội Không theo chủ nghĩa như Baptists và Methodists. Nhà thờ ở Wales bây giờ là một nhà thờ 'đã bị hủy diệt', tức là nhà vua hoặc nữ hoàng Anh không còn là Thống đốc tối cao của nó và nó không có mối liên hệ nào với Nhà nước Anh."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "0e7bf636dcc14b0183457d71d4280927",
        "word": "the Church of England",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ðə ˌtʃɜːtʃ əv ˈɪŋɡlənd/",
            "us": "/ðə ˌtʃɜːrtʃ əv ˈɪŋɡlənd/"
        },
        "nearby": [
            {
                "word": "churchman",
                "pos": "noun"
            },
            {
                "word": "the Church Mission Society",
                "pos": ""
            },
            {
                "word": "the Church of England",
                "pos": "noun"
            },
            {
                "word": "the Church of Jesus Christ of Latter-Day Saints",
                "pos": ""
            },
            {
                "word": "the Church of Scotland",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the official Church in England, whose leader is the Queen or King",
                    "vi": "Nhà thờ chính thức ở Anh, có người lãnh đạo là Nữ hoàng hoặc Vua"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "953c6f4352e44ba2aae705432962a50e",
        "word": "the Church of Jesus Christ of Latter-Day Saints",
        "pos": "",
        "level": "c2",
        "phonetic": {
            "uk": "/ðə ˌtʃɜːtʃ əv ˌdʒiːzəs ˌkraɪst əv ˌlætə deɪ ˈseɪnts/",
            "us": "/ðə ˌtʃɜːrtʃ əv ˌdʒiːzəs ˌkraɪst əv ˌlætər deɪ ˈseɪnts/"
        },
        "nearby": [
            {
                "word": "the Church Mission Society",
                "pos": ""
            },
            {
                "word": "the Church of England",
                "pos": "noun"
            },
            {
                "word": "the Church of Jesus Christ of Latter-Day Saints",
                "pos": ""
            },
            {
                "word": "the Church of Scotland",
                "pos": "noun"
            },
            {
                "word": "church school",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the official name of the Church to which Mormons belong. It is more correct to call Mormons 'latter-day saints'. 'Latter-day' means 'recent' or 'modern', because Mormons believe that the Church did not survive in the form that Jesus intended and was started again by Joseph Smith in 1830. 'Saint' here means, as in the Bible, 'a member of Jesus Christ's church'.",
                    "vi": "tên chính thức của Giáo hội mà người Mormons thuộc về. Gọi Mormons là 'những vị thánh thời sau' thì đúng hơn. 'Ngày sau' có nghĩa là 'gần đây' hoặc 'hiện đại', bởi vì người Mormons tin rằng Giáo hội đã không tồn tại theo hình thức mà Chúa Giê-su dự định và được bắt đầu lại bởi Joseph Smith vào năm 1830. 'Thánh' ở đây có nghĩa là, như trong Kinh thánh, 'một thành viên của nhà thờ Chúa Giê-xu Christ'."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "3298818277c84b47857a56e1396c1c80",
        "word": "the Church of Scotland",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ðə ˌtʃɜːtʃ əv ˈskɒtlənd/",
            "us": "/ðə ˌtʃɜːrtʃ əv ˈskɑːtlənd/"
        },
        "nearby": [
            {
                "word": "the Church of England",
                "pos": "noun"
            },
            {
                "word": "the Church of Jesus Christ of Latter-Day Saints",
                "pos": ""
            },
            {
                "word": "the Church of Scotland",
                "pos": "noun"
            },
            {
                "word": "church school",
                "pos": "noun"
            },
            {
                "word": "churchwarden",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the official (Presbyterian) Church in Scotland",
                    "vi": "Nhà thờ chính thức (Trưởng lão) ở Scotland"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "d8ac4e34582046d8b053bc96f1a899e2",
        "word": "C of E",
        "pos": "abbreviation",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌsiː əv ˈiː/",
            "us": "/ˌsiː əv ˈiː/"
        },
        "nearby": [
            {
                "word": "coexist",
                "pos": "verb"
            },
            {
                "word": "coexistence",
                "pos": "noun"
            },
            {
                "word": "C of E",
                "pos": "abbreviation"
            },
            {
                "word": "coffee",
                "pos": "noun"
            },
            {
                "word": "coffee bar",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "Church of England",
                    "vi": "Nhà thờ nước Anh"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "8da67d334cec44e79857231153f3f01d",
        "word": "commandment",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/kəˈmɑːndmənt/",
            "us": "/kəˈmændmənt/"
        },
        "nearby": [
            {
                "word": "command language",
                "pos": "noun"
            },
            {
                "word": "command line",
                "pos": "noun"
            },
            {
                "word": "commandment",
                "pos": "noun"
            },
            {
                "word": "command module",
                "pos": "noun"
            },
            {
                "word": "commando",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a law given by God, especially any of the Ten Commandments given to the Jews in the Bible",
                    "vi": "một luật do Đức Chúa Trời ban, đặc biệt là bất kỳ điều nào trong Mười Điều Răn được ban cho người Do Thái trong Kinh Thánh"
                },
                "examples": [
                    {
                        "en": "to keep the Ten Commandments",
                        "vi": "tuân giữ Mười Điều Răn"
                    },
                    {
                        "en": "Someone brought to his notice the fifth commandment: honour thy father and mother.",
                        "vi": "Một người nào đó đã thông báo cho anh ta điều răn thứ năm: hãy hiếu kính cha mẹ ngươi."
                    },
                    {
                        "en": "You shall keep the commandments of the Lord your God.",
                        "vi": "Bạn sẽ tuân giữ các điều răn của Chúa, Đức Chúa Trời của bạn."
                    }
                ]
            }
        ]
    },
    {
        "id": "131fc6becbb049c3a3c2c114a700770b",
        "word": "Congregational",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌkɒŋɡrɪˈɡeɪʃənəl/",
            "us": "/ˌkɑːŋɡrɪˈɡeɪʃənəl/"
        },
        "nearby": [
            {
                "word": "congregation",
                "pos": "noun"
            },
            {
                "word": "congregational",
                "pos": "adjective"
            },
            {
                "word": "Congregational",
                "pos": "adjective"
            },
            {
                "word": "Congregationalism",
                "pos": "noun"
            },
            {
                "word": "Congregationalist",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "connected with the type of Christianity known as Congregationalism",
                    "vi": "kết nối với loại Cơ đốc giáo được gọi là Chủ nghĩa cộng đồng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "9e8f1ec520514e0a9e544473eba7dbad",
        "word": "Congregationalism",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌkɒŋɡrɪˈɡeɪʃənəlɪzəm/",
            "us": "/ˌkɑːŋɡrɪˈɡeɪʃənəlɪzəm/"
        },
        "nearby": [
            {
                "word": "congregational",
                "pos": "adjective"
            },
            {
                "word": "Congregational",
                "pos": "adjective"
            },
            {
                "word": "Congregationalism",
                "pos": "noun"
            },
            {
                "word": "Congregationalist",
                "pos": "noun"
            },
            {
                "word": "congress",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a type of Christianity in which the congregation of each church is responsible for its own affairs",
                    "vi": "một loại hình Cơ đốc giáo trong đó giáo đoàn của mỗi nhà thờ chịu trách nhiệm về các công việc của riêng mình"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "986b61e05cf944f58f58348efd1bb9d8",
        "word": "creationism",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/kriˈeɪʃənɪzəm/",
            "us": "/kriˈeɪʃənɪzəm/"
        },
        "nearby": [
            {
                "word": "create",
                "pos": "verb"
            },
            {
                "word": "creation",
                "pos": "noun"
            },
            {
                "word": "creationism",
                "pos": "noun"
            },
            {
                "word": "creationist",
                "pos": "adjective"
            },
            {
                "word": "creationist",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the belief that the universe was made by God exactly as described in the Bible",
                    "vi": "niềm tin rằng vũ trụ được tạo ra bởi Chúa chính xác như được mô tả trong Kinh thánh"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "4ca5d6c11bd843a4ac9e180a7cb9e897",
        "word": "creed",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/kriːd/",
            "us": "/kriːd/"
        },
        "nearby": [
            {
                "word": "credulous",
                "pos": "adjective"
            },
            {
                "word": "Cree",
                "pos": "noun"
            },
            {
                "word": "creed",
                "pos": "noun"
            },
            {
                "word": "creek",
                "pos": "noun"
            },
            {
                "word": "Creek",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a set of principles or religious beliefs",
                    "vi": "một tập hợp các nguyên tắc hoặc niềm tin tôn giáo"
                },
                "examples": [
                    {
                        "en": "We welcome people of all races, colours and creeds.",
                        "vi": "Chúng tôi chào đón mọi người thuộc mọi chủng tộc, màu da và tín ngưỡng."
                    },
                    {
                        "en": "discrimination on the basis of race, colour or creed",
                        "vi": "phân biệt đối xử dựa trên chủng tộc, màu da hoặc tín ngưỡng"
                    },
                    {
                        "en": "What is his political creed?",
                        "vi": "Tín điều chính trị của anh ta là gì?"
                    }
                ]
            },
            {
                "define": {
                    "en": "a statement of Christian belief that is spoken as part of some church services",
                    "vi": "một tuyên bố về niềm tin Cơ đốc được nói như một phần của một số buổi lễ của nhà thờ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "d50df9089b2f425fbe36ead2888a6b57",
        "word": "crucifixion",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌkruːsəˈfɪkʃn/",
            "us": "/ˌkruːsəˈfɪkʃn/"
        },
        "nearby": [
            {
                "word": "the Crucible Theatre",
                "pos": ""
            },
            {
                "word": "crucifix",
                "pos": "noun"
            },
            {
                "word": "crucifixion",
                "pos": "noun"
            },
            {
                "word": "cruciform",
                "pos": "adjective"
            },
            {
                "word": "crucify",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act of killing somebody by fastening them to a cross",
                    "vi": "hành động giết ai đó bằng cách buộc chặt họ vào cây thánh giá"
                },
                "examples": [
                    {
                        "en": "the Crucifixion (= of Jesus)",
                        "vi": "Sự đóng đinh (= của Chúa Giêsu)"
                    }
                ]
            },
            {
                "define": {
                    "en": "a painting or other work of art representing the crucifixion of Jesus Christ",
                    "vi": "một bức tranh hoặc tác phẩm nghệ thuật khác đại diện cho sự đóng đinh của Chúa Giêsu Kitô"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "0955b6b2183945aa8c86e2eda35acb3f",
        "word": "deadly sin",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌdedli ˈsɪn/",
            "us": "/ˌdedli ˈsɪn/"
        },
        "nearby": [
            {
                "word": "deadly",
                "pos": "adverb"
            },
            {
                "word": "deadly nightshade",
                "pos": "noun"
            },
            {
                "word": "deadly sin",
                "pos": "noun"
            },
            {
                "word": "deadpan",
                "pos": "adjective"
            },
            {
                "word": "the dead parrot sketch",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "one of the seven actions for which you can go to hell, in Christian tradition",
                    "vi": "một trong bảy hành động mà bạn có thể xuống địa ngục, theo truyền thống Cơ đốc"
                },
                "examples": [
                    {
                        "en": "Greed is one of the seven deadly sins.",
                        "vi": "Tham lam là một trong bảy tội lỗi chết người."
                    }
                ]
            }
        ]
    },
    {
        "id": "0f37e1063dd64011886b56530b283ef3",
        "word": "deism",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈdeɪɪzəm/",
            "us": "/ˈdeɪɪzəm/"
        },
        "nearby": [
            {
                "word": "deign",
                "pos": "verb"
            },
            {
                "word": "Deirdre",
                "pos": ""
            },
            {
                "word": "deism",
                "pos": "noun"
            },
            {
                "word": "deist",
                "pos": "noun"
            },
            {
                "word": "deistic",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "belief in God, especially a God that created the universe but does not take part in it",
                    "vi": "niềm tin vào Thượng đế, đặc biệt là Thượng đế đã tạo ra vũ trụ nhưng không tham gia vào nó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "5e3e4012dc964170988928696ebbeb0f",
        "word": "deistic",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/deɪˈɪstɪk/",
            "us": "/deɪˈɪstɪk/"
        },
        "nearby": [
            {
                "word": "deism",
                "pos": "noun"
            },
            {
                "word": "deist",
                "pos": "noun"
            },
            {
                "word": "deistic",
                "pos": "adjective"
            },
            {
                "word": "deity",
                "pos": "noun"
            },
            {
                "word": "deixis",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "connected with belief in God, especially a God that created the universe but does not take part in it",
                    "vi": "kết nối với niềm tin vào Chúa, đặc biệt là một Chúa đã tạo ra vũ trụ nhưng không tham gia vào nó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "e03a11a6e2f84f3ba1bf52b0c8ea0efa",
        "word": "deity",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈdeɪəti/",
            "us": "/ˈdeɪəti/"
        },
        "nearby": [
            {
                "word": "deist",
                "pos": "noun"
            },
            {
                "word": "deistic",
                "pos": "adjective"
            },
            {
                "word": "deity",
                "pos": "noun"
            },
            {
                "word": "deixis",
                "pos": "noun"
            },
            {
                "word": "déjà vu",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a god or goddess",
                    "vi": "một vị thần hoặc nữ thần"
                },
                "examples": [
                    {
                        "en": "Greek/Roman/Hindu deities",
                        "vi": "Các vị thần Hy Lạp / La Mã / Hindu"
                    }
                ]
            },
            {
                "define": {
                    "en": "God",
                    "vi": "Chúa Trời"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "59dab78be7524267b51b712204bc63b1",
        "word": "denomination",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/dɪˌnɒmɪˈneɪʃn/",
            "us": "/dɪˌnɑːmɪˈneɪʃn/"
        },
        "nearby": [
            {
                "word": "Denny's",
                "pos": ""
            },
            {
                "word": "denominate",
                "pos": "verb"
            },
            {
                "word": "denomination",
                "pos": "noun"
            },
            {
                "word": "denominational",
                "pos": "adjective"
            },
            {
                "word": "denominator",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a branch of the Christian Church",
                    "vi": "một nhánh của nhà thờ Thiên chúa giáo"
                },
                "examples": [
                    {
                        "en": "Christians of all denominations attended the conference.",
                        "vi": "Những người theo đạo Thiên Chúa thuộc tất cả các hệ phái đã tham dự đại hội."
                    }
                ]
            },
            {
                "define": {
                    "en": "a unit of value, especially of money",
                    "vi": "một đơn vị giá trị, đặc biệt là tiền"
                },
                "examples": [
                    {
                        "en": "coins and banknotes of various denominations",
                        "vi": "tiền xu và tiền giấy có nhiều mệnh giá khác nhau"
                    }
                ]
            }
        ]
    },
    {
        "id": "03101c67fe4b4aac9c6a0df6b21bb996",
        "word": "destiny",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈdestəni/",
            "us": "/ˈdestəni/"
        },
        "nearby": [
            {
                "word": "destination wedding",
                "pos": "noun"
            },
            {
                "word": "destined",
                "pos": "adjective"
            },
            {
                "word": "destiny",
                "pos": "noun"
            },
            {
                "word": "destitute",
                "pos": "adjective"
            },
            {
                "word": "destitution",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "what happens to somebody or what will happen to them in the future, especially things that they cannot change or avoid",
                    "vi": "điều gì xảy ra với ai đó hoặc điều gì sẽ xảy ra với họ trong tương lai, đặc biệt là những điều mà họ không thể thay đổi hoặc tránh được"
                },
                "examples": [
                    {
                        "en": "The destinies of five nations were decided at the peace conference.",
                        "vi": "Vận mệnh của năm quốc gia đã được quyết định tại hội nghị hòa bình."
                    },
                    {
                        "en": "He wants to be in control of his own destiny.",
                        "vi": "Anh ta muốn kiểm soát vận mệnh của chính mình."
                    },
                    {
                        "en": "The contemporary hero is one who stands out against the crowd to fulfil a personal destiny.",
                        "vi": "Người anh hùng đương thời là người đứng ra chống lại đám đông để thực hiện một số phận cá nhân."
                    }
                ]
            },
            {
                "define": {
                    "en": "the power believed to control events",
                    "vi": "sức mạnh được cho là để kiểm soát các sự kiện"
                },
                "examples": [
                    {
                        "en": "I believe there's some force guiding us—call it God, destiny or fate.",
                        "vi": "Tôi tin rằng có một thế lực nào đó đang hướng dẫn chúng ta - gọi đó là Chúa, định mệnh hay định mệnh."
                    },
                    {
                        "en": "He was driven on by a strong sense of destiny.",
                        "vi": "Anh ấy được thúc đẩy bởi một cảm giác mạnh mẽ về số phận."
                    }
                ]
            }
        ]
    },
    {
        "id": "d41e72ce591d46038de1703e7320d680",
        "word": "determinism",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/dɪˈtɜːmɪnɪzəm/",
            "us": "/dɪˈtɜːrmɪnɪzəm/"
        },
        "nearby": [
            {
                "word": "determinedly",
                "pos": "adverb"
            },
            {
                "word": "determiner",
                "pos": "noun"
            },
            {
                "word": "determinism",
                "pos": "noun"
            },
            {
                "word": "deterministic",
                "pos": "adjective"
            },
            {
                "word": "deterrence",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the belief that people are not free to choose what they are like or how they behave, because these things are decided by their environment and other things over which they have no control",
                    "vi": "niềm tin rằng mọi người không được tự do lựa chọn những gì họ thích hoặc cách họ cư xử, bởi vì những điều này được quyết định bởi môi trường của họ và những thứ khác mà họ không kiểm soát được"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "f9fc369c3b2b4ecba9bcc152ee4344ab",
        "word": "deterministic",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/dɪˌtɜːmɪˈnɪstɪk/",
            "us": "/dɪˌtɜːrmɪˈnɪstɪk/"
        },
        "nearby": [
            {
                "word": "determiner",
                "pos": "noun"
            },
            {
                "word": "determinism",
                "pos": "noun"
            },
            {
                "word": "deterministic",
                "pos": "adjective"
            },
            {
                "word": "deterrence",
                "pos": "noun"
            },
            {
                "word": "deterrent",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "connected with the belief that people are not free to choose what they are like or how they behave, because these things are decided by their environment and other things over which they have no control",
                    "vi": "kết nối với niềm tin rằng mọi người không được tự do lựa chọn những gì họ thích hoặc cách họ cư xử, bởi vì những điều này được quyết định bởi môi trường của họ và những thứ khác mà họ không kiểm soát được"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "76db123623d3485eb8d5d3e44177c0e7",
        "word": "devotion",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/dɪˈvəʊʃn/",
            "us": "/dɪˈvəʊʃn/"
        },
        "nearby": [
            {
                "word": "devote to",
                "pos": "phrasal verb"
            },
            {
                "word": "devote yourself to",
                "pos": "phrasal verb"
            },
            {
                "word": "devotion",
                "pos": "noun"
            },
            {
                "word": "devotional",
                "pos": "adjective"
            },
            {
                "word": "devour",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "great love, care and support for somebody/something",
                    "vi": "tình yêu lớn, sự quan tâm và hỗ trợ cho ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "His devotion to his wife and family is touching.",
                        "vi": "Sự tận tâm của anh ấy dành cho vợ và gia đình thật cảm động."
                    }
                ]
            },
            {
                "define": {
                    "en": "the action of spending a lot of time or energy on something",
                    "vi": "hành động dành nhiều thời gian hoặc năng lượng cho việc gì đó"
                },
                "examples": [
                    {
                        "en": "her devotion to duty",
                        "vi": "sự tận tâm của cô ấy đối với nghĩa vụ"
                    },
                    {
                        "en": "Her devotion to the job left her with very little free time.",
                        "vi": "Sự tận tâm với công việc khiến cô có rất ít thời gian rảnh rỗi."
                    }
                ]
            },
            {
                "define": {
                    "en": "religious worship",
                    "vi": "tôn thờ tôn giáo"
                },
                "examples": [
                    {
                        "en": "The statue of the emperor became an object of devotion.",
                        "vi": "Bức tượng của hoàng đế trở thành một đối tượng của sự sùng kính."
                    },
                    {
                        "en": "He was a man of deep religious devotion.",
                        "vi": "Ông là một người có lòng sùng kính tôn giáo sâu sắc."
                    }
                ]
            },
            {
                "define": {
                    "en": "prayers and other religious practices",
                    "vi": "cầu nguyện và các thực hành tôn giáo khác"
                },
                "examples": [
                    {
                        "en": "She went to her devotions.",
                        "vi": "Cô ấy đã đi theo sự tận tâm của mình."
                    }
                ]
            }
        ]
    },
    {
        "id": "924a9e79f9f744a5abec4c8db07050f0",
        "word": "devout",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/dɪˈvaʊt/",
            "us": "/dɪˈvaʊt/"
        },
        "nearby": [
            {
                "word": "devotional",
                "pos": "adjective"
            },
            {
                "word": "devour",
                "pos": "verb"
            },
            {
                "word": "devout",
                "pos": "adjective"
            },
            {
                "word": "devoutly",
                "pos": "adverb"
            },
            {
                "word": "dew",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "believing strongly in a particular religion and obeying its laws and practices",
                    "vi": "tin tưởng mạnh mẽ vào một tôn giáo cụ thể và tuân theo luật pháp và thông lệ của tôn giáo đó"
                },
                "examples": [
                    {
                        "en": "a devout Christian/Muslim",
                        "vi": "một người sùng đạo Cơ đốc / Hồi giáo"
                    }
                ]
            }
        ]
    },
    {
        "id": "d602bdd9aef44e058713829f2d658f0b",
        "word": "Dominican",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/dəˈmɪnɪkən/",
            "us": "/dəˈmɪnɪkən/"
        },
        "nearby": [
            {
                "word": "Dominic",
                "pos": ""
            },
            {
                "word": "Dominica",
                "pos": ""
            },
            {
                "word": "Dominican",
                "pos": "adjective"
            },
            {
                "word": "Dominican",
                "pos": "noun"
            },
            {
                "word": "Dominican",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "belonging to or connected with the Christian group of friars or nuns following the rules of St Dominic",
                    "vi": "thuộc về hoặc có liên hệ với nhóm tu sĩ hoặc nữ tu Cơ đốc theo các quy tắc của Thánh Đa Minh"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "from or connected with the Dominican Republic",
                    "vi": "từ hoặc kết nối với Cộng hòa Dominica"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "from or connected with the island of Dominica",
                    "vi": "từ hoặc kết nối với đảo Dominica"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "43fc333ff1bc4a279ce55e5d1cb7a8de",
        "word": "doomsday",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈduːmzdeɪ/",
            "us": "/ˈduːmzdeɪ/"
        },
        "nearby": [
            {
                "word": "doom-laden",
                "pos": "adjective"
            },
            {
                "word": "doomsayer",
                "pos": "noun"
            },
            {
                "word": "doomsday",
                "pos": "noun"
            },
            {
                "word": "doomy",
                "pos": "adjective"
            },
            {
                "word": "Doona",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the last day of the world when Christians believe that everyone will be judged by God",
                    "vi": "ngày cuối cùng của thế giới khi Cơ đốc nhân tin rằng mọi người sẽ bị Đức Chúa Trời phán xét"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a very long time; forever",
                    "vi": "một thời gian rất dài; mãi mãi"
                },
                "examples": [
                    {
                        "en": "This job's going to take me till doomsday.",
                        "vi": "Công việc này sẽ đưa tôi đến ngày tận thế."
                    }
                ]
            }
        ]
    },
    {
        "id": "ec34f25971c848d7a3dc71be7499b351",
        "word": "the Eastern Orthodox Church",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ði ˌiːstən ˌɔːθədɒks ˈtʃɜːtʃ/",
            "us": "/ði ˌiːstərn ˌɔːrθədɑːks ˈtʃɜːrtʃ/"
        },
        "nearby": [
            {
                "word": "Eastern Eye",
                "pos": ""
            },
            {
                "word": "easternmost",
                "pos": "adjective"
            },
            {
                "word": "the Eastern Orthodox Church",
                "pos": "noun"
            },
            {
                "word": "Eastern Standard Time",
                "pos": "noun"
            },
            {
                "word": "Eastern time",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a branch of the Christian Church in eastern Europe and Greece",
                    "vi": "một nhánh của Nhà thờ Thiên chúa giáo ở Đông Âu và Hy Lạp"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "fdefd1d5b89e4f5391ed6c926cd3e111",
        "word": "the Episcopal Church",
        "pos": "",
        "level": "c2",
        "phonetic": {
            "uk": "/ði ɪˌpɪskəpl ˈtʃɜːtʃ/",
            "us": "/ði ɪˌpɪskəpl ˈtʃɜːrtʃ/"
        },
        "nearby": [
            {
                "word": "episcopacy",
                "pos": "noun"
            },
            {
                "word": "episcopal",
                "pos": "adjective"
            },
            {
                "word": "the Episcopal Church",
                "pos": ""
            },
            {
                "word": "Episcopalian",
                "pos": "noun"
            },
            {
                "word": "episcopate",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the US Church that is part of the Anglican Communion. It separated from the Church of England during the American Revolution. It has the reputation of having many rich and socially important people as members. A member of the church is called an Episcopalian.",
                    "vi": "Giáo hội Hoa Kỳ là một phần của Hiệp thông Anh giáo. Nó tách ra khỏi Nhà thờ Anh trong cuộc Cách mạng Hoa Kỳ. Nó nổi tiếng là có nhiều người giàu có và quan trọng trong xã hội là thành viên. Một thành viên của nhà thờ được gọi là Episcopalian."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "82244b50afb14c308f5b9f2afc2a8d35",
        "word": "evangelical",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌiːvænˈdʒelɪkl/",
            "us": "/ˌiːvænˈdʒelɪkl/"
        },
        "nearby": [
            {
                "word": "evanescence",
                "pos": "noun"
            },
            {
                "word": "evanescent",
                "pos": "adjective"
            },
            {
                "word": "evangelical",
                "pos": "adjective"
            },
            {
                "word": "evangelical",
                "pos": "noun"
            },
            {
                "word": "evangelicalism",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "of or belonging to a Christian group that emphasizes the authority of the Bible and the importance of people being saved through faith",
                    "vi": "thuộc về hoặc thuộc một nhóm Cơ đốc nhân nhấn mạnh thẩm quyền của Kinh thánh và tầm quan trọng của việc mọi người được cứu nhờ đức tin"
                },
                "examples": [
                    {
                        "en": "They're evangelical Christians.",
                        "vi": "Họ là những Cơ đốc nhân theo đạo Tin lành."
                    }
                ]
            },
            {
                "define": {
                    "en": "wanting very much to persuade people to accept your views and opinions",
                    "vi": "rất muốn thuyết phục mọi người chấp nhận quan điểm và ý kiến của bạn"
                },
                "examples": [
                    {
                        "en": "He delivered his speech with evangelical fervour.",
                        "vi": "Ông đã đọc bài phát biểu của mình với lòng nhiệt thành truyền giáo."
                    }
                ]
            }
        ]
    },
    {
        "id": "5cefdb30d16f41d483991ffb1a3b76de",
        "word": "evangelicalism",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌiːvænˈdʒelɪkəlɪzəm/",
            "us": "/ˌiːvænˈdʒelɪkəlɪzəm/"
        },
        "nearby": [
            {
                "word": "evangelical",
                "pos": "adjective"
            },
            {
                "word": "evangelical",
                "pos": "noun"
            },
            {
                "word": "evangelicalism",
                "pos": "noun"
            },
            {
                "word": "evangelism",
                "pos": "noun"
            },
            {
                "word": "evangelist",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the strong belief of some Christian groups in the authority of the Bible and the importance of people being saved through faith",
                    "vi": "niềm tin mạnh mẽ của một số nhóm Cơ đốc nhân vào thẩm quyền của Kinh thánh và tầm quan trọng của việc mọi người được cứu nhờ đức tin"
                },
                "examples": [
                    {
                        "en": "At school she became a convert to evangelicalism.",
                        "vi": "Ở trường, cô ấy đã trở thành một người chuyển đổi sang truyền giáo."
                    }
                ]
            },
            {
                "define": {
                    "en": "actions or words that you use to try to persuade people to accept views or opinions that you strongly believe are correct",
                    "vi": "hành động hoặc lời nói mà bạn sử dụng để cố gắng thuyết phục mọi người chấp nhận quan điểm hoặc ý kiến mà bạn thực sự tin là đúng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "091485a0277c49fb9f8988348b160cdf",
        "word": "faithful",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈfeɪθfl/",
            "us": "/ˈfeɪθfl/"
        },
        "nearby": [
            {
                "word": "faith",
                "pos": "noun"
            },
            {
                "word": "Faith",
                "pos": ""
            },
            {
                "word": "faithful",
                "pos": "adjective"
            },
            {
                "word": "faithfully",
                "pos": "adverb"
            },
            {
                "word": "faithfulness",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "staying with or supporting a particular person, organization or belief",
                    "vi": "ở với hoặc ủng hộ một cá nhân, tổ chức hoặc tín ngưỡng cụ thể"
                },
                "examples": [
                    {
                        "en": "a faithful servant/friend/dog",
                        "vi": "một người hầu / người bạn / con chó trung thành"
                    },
                    {
                        "en": "She was rewarded for her 40 years' faithful service with the company.",
                        "vi": "Cô đã được khen thưởng cho 40 năm trung thành với công ty."
                    },
                    {
                        "en": "I have been a faithful reader of your newspaper for many years.",
                        "vi": "Tôi đã là một độc giả trung thành của tờ báo của bạn trong nhiều năm."
                    },
                    {
                        "en": "faithful to somebody/something He remained faithful to the ideals of the party.",
                        "vi": "trung thành với ai đó / cái gì đó Anh ấy vẫn trung thành với lý tưởng của đảng."
                    }
                ]
            },
            {
                "define": {
                    "en": "people who believe in a religion; strong supporters of a political party who will not change their views",
                    "vi": "những người tin vào một tôn giáo; những người ủng hộ mạnh mẽ một đảng chính trị sẽ không thay đổi quan điểm của họ"
                },
                "examples": [
                    {
                        "en": "The president will keep the support of the party faithful.",
                        "vi": "Tổng thống sẽ giữ sự ủng hộ của các đảng viên trung thành."
                    }
                ]
            },
            {
                "define": {
                    "en": "not having a sexual relationship with anyone else",
                    "vi": "không có quan hệ tình dục với bất kỳ ai khác"
                },
                "examples": [
                    {
                        "en": "He had remained entirely faithful to his wife.",
                        "vi": "Anh vẫn hoàn toàn chung thủy với vợ mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "true and accurate; not changing anything",
                    "vi": "đúng và chính xác; không thay đổi bất cứ điều gì"
                },
                "examples": [
                    {
                        "en": "a faithful copy/account/description",
                        "vi": "một bản sao / tài khoản / mô tả trung thực"
                    },
                    {
                        "en": "faithful to something His translation manages to be faithful to the spirit of the original.",
                        "vi": "trung thành với điều gì đó Bản dịch của ông quản lý để trung thành với tinh thần của bản gốc."
                    }
                ]
            },
            {
                "define": {
                    "en": "able to be trusted; that you can rely on",
                    "vi": "có thể được tin cậy; mà bạn có thể dựa vào"
                },
                "examples": [
                    {
                        "en": "my faithful old car",
                        "vi": "chiếc xe cũ trung thành của tôi"
                    }
                ]
            }
        ]
    },
    {
        "id": "c56fc4852aa24112885aee30ac1188b0",
        "word": "fanaticism",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/fəˈnætɪsɪzəm/",
            "us": "/fəˈnætɪsɪzəm/"
        },
        "nearby": [
            {
                "word": "fanatical",
                "pos": "adjective"
            },
            {
                "word": "fanatically",
                "pos": "adverb"
            },
            {
                "word": "fanaticism",
                "pos": "noun"
            },
            {
                "word": "fan base",
                "pos": "noun"
            },
            {
                "word": "fan belt",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "extreme beliefs or behaviour, especially in connection with religion or politics",
                    "vi": "niềm tin hoặc hành vi cực đoan, đặc biệt là liên quan đến tôn giáo hoặc chính trị"
                },
                "examples": [
                    {
                        "en": "driven by religious fanaticism",
                        "vi": "được thúc đẩy bởi sự cuồng tín tôn giáo"
                    },
                    {
                        "en": "the fanaticism of football supporters",
                        "vi": "sự cuồng tín của những người ủng hộ bóng đá"
                    }
                ]
            }
        ]
    },
    {
        "id": "87da9431bece47f0970b5a7b5bbbde02",
        "word": "fatalism",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈfeɪtəlɪzəm/",
            "us": "/ˈfeɪtəlɪzəm/"
        },
        "nearby": [
            {
                "word": "fat",
                "pos": "noun"
            },
            {
                "word": "fatal",
                "pos": "adjective"
            },
            {
                "word": "fatalism",
                "pos": "noun"
            },
            {
                "word": "fatalist",
                "pos": "noun"
            },
            {
                "word": "fatalistic",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the belief that events are decided by fate and that you cannot control them; the fact of accepting that you cannot prevent something from happening",
                    "vi": "niềm tin rằng các sự kiện được quyết định bởi số phận và bạn không thể kiểm soát chúng; thực tế là chấp nhận rằng bạn không thể ngăn điều gì đó xảy ra"
                },
                "examples": [
                    {
                        "en": "There is a mood of profound fatalism amongst party members.",
                        "vi": "Có một tâm trạng chủ nghĩa tử vong sâu sắc trong các đảng viên."
                    }
                ]
            }
        ]
    },
    {
        "id": "9e4c2380631441d1a2761e7ecc37df8b",
        "word": "fatalist",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈfeɪtəlɪst/",
            "us": "/ˈfeɪtəlɪst/"
        },
        "nearby": [
            {
                "word": "fatal",
                "pos": "adjective"
            },
            {
                "word": "fatalism",
                "pos": "noun"
            },
            {
                "word": "fatalist",
                "pos": "noun"
            },
            {
                "word": "fatalistic",
                "pos": "adjective"
            },
            {
                "word": "fatalistically",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who believes that events are decided by fate and cannot be controlled; a person who accepts that they cannot prevent something from happening",
                    "vi": "một người tin rằng các sự kiện do số phận quyết định và không thể kiểm soát được; một người chấp nhận rằng họ không thể ngăn điều gì đó xảy ra"
                },
                "examples": [
                    {
                        "en": "I'm a fatalist.",
                        "vi": "Tôi là một người theo thuyết định mệnh."
                    }
                ]
            }
        ]
    }
]