[
    {
        "id": "a05478f937fb4bdf881a607626d02e8b",
        "word": "favourite",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/ˈfeɪvərɪt/",
            "us": "/ˈfeɪvərɪt/"
        },
        "nearby": [
            {
                "word": "favourite",
                "pos": "verb"
            },
            {
                "word": "favourite",
                "pos": "adjective"
            },
            {
                "word": "favourite",
                "pos": "noun"
            },
            {
                "word": "favouritism",
                "pos": "noun"
            },
            {
                "word": "Guy Fawkes",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person or thing that you like more than the others of the same type",
                    "vi": "một người hoặc vật mà bạn thích hơn những người khác cùng loại"
                },
                "examples": [
                    {
                        "en": "Which one's your favourite?",
                        "vi": "Bạn yêu thích cái nào?"
                    },
                    {
                        "en": "The band played all my old favourites.",
                        "vi": "Ban nhạc đã chơi tất cả các bài yêu thích cũ của tôi."
                    },
                    {
                        "en": "One of my personal favourites is a movie that should please every age group.",
                        "vi": "Một trong những mục yêu thích của cá nhân tôi là một bộ phim làm hài lòng mọi lứa tuổi."
                    },
                    {
                        "en": "favourite of somebody's This song is a particular favourite of mine.",
                        "vi": "yêu thích của ai đó Bài hát này là một yêu thích đặc biệt của tôi."
                    },
                    {
                        "en": "favourite with somebody The programme has become a firm favourite with young people.",
                        "vi": "yêu thích với ai đó Chương trình đã trở thành một chương trình yêu thích của những người trẻ tuổi."
                    },
                    {
                        "en": "These biscuits are great favourites with the children.",
                        "vi": "Những chiếc bánh quy này rất được trẻ em yêu thích."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who is liked better by somebody and receives better treatment than others",
                    "vi": "một người được ai đó thích hơn và được đối xử tốt hơn những người khác"
                },
                "examples": [
                    {
                        "en": "She loved all her grandchildren but Ann was her favourite.",
                        "vi": "Bà yêu tất cả các cháu của mình nhưng Ann là người bà yêu thích nhất."
                    },
                    {
                        "en": "Parents should never have favourites.",
                        "vi": "Cha mẹ không bao giờ nên yêu thích."
                    },
                    {
                        "en": "favourite with somebody She was an extremely good student and a great favourite with the nuns.",
                        "vi": "yêu thích với ai đó Cô ấy là một học sinh cực kỳ giỏi và rất được các nữ tu yêu thích."
                    },
                    {
                        "en": "favourite among somebody He is a favourite among his teammates.",
                        "vi": "yêu thích của ai đó Anh ấy là người được yêu thích trong số các đồng đội của anh ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "a record of a section of an app or the address of a website that enables you to find it quickly",
                    "vi": "bản ghi về một phần của ứng dụng hoặc địa chỉ của một trang web cho phép bạn tìm thấy nó một cách nhanh chóng"
                },
                "examples": [
                    {
                        "en": "Add the website as a favourite.",
                        "vi": "Thêm trang web làm mục yêu thích."
                    },
                    {
                        "en": "Have you added this website to your favourites list?",
                        "vi": "Bạn đã thêm trang web này vào danh sách yêu thích của mình chưa?"
                    },
                    {
                        "en": "I've added the sports section to my favourites.",
                        "vi": "Tôi đã thêm phần thể thao vào mục yêu thích của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "the horse, runner, team, etc. that is expected to win",
                    "vi": "ngựa, người chạy, đội, v.v. được mong đợi sẽ giành chiến thắng"
                },
                "examples": [
                    {
                        "en": "The favourite came third.",
                        "vi": "Yêu thích đứng thứ ba."
                    },
                    {
                        "en": "favourite for something Her horse is the hot favourite for the race.",
                        "vi": "yêu thích cho một cái gì đó Con ngựa của cô ấy là yêu thích nóng cho cuộc đua."
                    },
                    {
                        "en": "favourite to do something The Brazilians still look firm favourites to take the title.",
                        "vi": "yêu thích làm điều gì đó Người Brazil vẫn có vẻ là những người yêu thích nhất để có được danh hiệu."
                    }
                ]
            },
            {
                "define": {
                    "en": "the person who is expected by most people to get a particular job or position",
                    "vi": "người được hầu hết mọi người mong đợi để có được một công việc hoặc vị trí cụ thể"
                },
                "examples": [
                    {
                        "en": "favourite for something She's the favourite for the job.",
                        "vi": "yêu thích cho một cái gì đó Cô ấy là người yêu thích công việc."
                    },
                    {
                        "en": "favourite to do something She's the favourite to succeed him as leader.",
                        "vi": "yêu thích làm điều gì đó Cô ấy là người yêu thích để kế nhiệm anh ta với tư cách là nhà lãnh đạo."
                    }
                ]
            }
        ]
    },
    {
        "id": "4582c6f09e2a440cab1a5707ae65b09a",
        "word": "internet",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/ˈɪntənet/",
            "us": "/ˈɪntərnet/"
        },
        "nearby": [
            {
                "word": "internecine",
                "pos": "adjective"
            },
            {
                "word": "internee",
                "pos": "noun"
            },
            {
                "word": "internet",
                "pos": "noun"
            },
            {
                "word": "internet dating",
                "pos": "noun"
            },
            {
                "word": "internet of things",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an international computer network connecting other networks and computers that allows people to share information around the world",
                    "vi": "một mạng máy tính quốc tế kết nối các mạng và máy tính khác cho phép mọi người chia sẻ thông tin trên khắp thế giới"
                },
                "examples": [
                    {
                        "en": "to surf/browse/access the internet",
                        "vi": "để lướt / duyệt / truy cập internet"
                    },
                    {
                        "en": "on the internet I looked it up on the internet.",
                        "vi": "trên internet, tôi đã tra cứu nó trên internet."
                    },
                    {
                        "en": "She likes to go on the internet in the evenings.",
                        "vi": "Cô ấy thích truy cập internet vào buổi tối."
                    },
                    {
                        "en": "via the internet We have kept in touch via the internet.",
                        "vi": "qua internet Chúng tôi đã giữ liên lạc qua internet."
                    },
                    {
                        "en": "over the internet You can view the video feed over the internet.",
                        "vi": "qua internet Bạn có thể xem nguồn cấp video qua internet."
                    },
                    {
                        "en": "All the rooms have access to the internet/internet access.",
                        "vi": "Tất cả các phòng đều có truy cập internet / truy cập internet."
                    },
                    {
                        "en": "I couldn't get an internet connection.",
                        "vi": "Tôi không thể kết nối Internet."
                    },
                    {
                        "en": "internet users",
                        "vi": "những người sử dụng mạng"
                    },
                    {
                        "en": "an internet cafe (= a cafe where you pay to use a computer to access the internet)",
                        "vi": "quán cà phê internet (= quán cà phê nơi bạn trả tiền để sử dụng máy tính để truy cập internet)"
                    },
                    {
                        "en": "The payment can be made through internet banking.",
                        "vi": "Thanh toán có thể được thực hiện thông qua ngân hàng trực tuyến."
                    }
                ]
            }
        ]
    },
    {
        "id": "b12c737c89d24d38b1f2eb75a072249a",
        "word": "online",
        "pos": "adjective",
        "level": "a1",
        "phonetic": {
            "uk": "/ˌɒnˈlaɪn/",
            "us": "/ˌɑːnˈlaɪn/"
        },
        "nearby": [
            {
                "word": "onion ring",
                "pos": "noun"
            },
            {
                "word": "onion-skin paper",
                "pos": "noun"
            },
            {
                "word": "online",
                "pos": "adjective"
            },
            {
                "word": "online",
                "pos": "adverb"
            },
            {
                "word": "online dating",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "available on or done using the internet or other computer network",
                    "vi": "có sẵn trên hoặc được thực hiện bằng cách sử dụng internet hoặc mạng máy tính khác"
                },
                "examples": [
                    {
                        "en": "Online shopping is both cheap and convenient.",
                        "vi": "Mua hàng trực tuyến vừa rẻ vừa tiện lợi."
                    },
                    {
                        "en": "online stores/services/retailers",
                        "vi": "cửa hàng / dịch vụ / nhà bán lẻ trực tuyến"
                    },
                    {
                        "en": "online dating/gaming/banking",
                        "vi": "hẹn hò / chơi game / ngân hàng trực tuyến"
                    },
                    {
                        "en": "He spends hours playing online games.",
                        "vi": "Anh ấy dành hàng giờ để chơi game trực tuyến."
                    },
                    {
                        "en": "The online community is a place where customers with similar interests meet to interact.",
                        "vi": "Cộng đồng trực tuyến là nơi những khách hàng có cùng sở thích gặp gỡ để giao lưu."
                    },
                    {
                        "en": "All this information is now online.",
                        "vi": "Tất cả thông tin này bây giờ là trực tuyến."
                    }
                ]
            },
            {
                "define": {
                    "en": "connected to the internet; able to connect to the internet",
                    "vi": "Đa kêt nôi internet; có thể kết nối với internet"
                },
                "examples": [
                    {
                        "en": "You can see which of your friends are online and send them messages.",
                        "vi": "Bạn có thể xem bạn bè nào của mình đang trực tuyến và gửi tin nhắn cho họ."
                    },
                    {
                        "en": "It's estimated that five billion users are now online.",
                        "vi": "Người ta ước tính rằng năm tỷ người dùng hiện đang trực tuyến."
                    }
                ]
            }
        ]
    },
    {
        "id": "8f8df213c2294bd887d651ec75c94d34",
        "word": "visit",
        "pos": "verb",
        "level": "a1",
        "phonetic": {
            "uk": "/ˈvɪzɪt/",
            "us": "/ˈvɪzɪt/"
        },
        "nearby": [
            {
                "word": "visionary",
                "pos": "noun"
            },
            {
                "word": "vision mixer",
                "pos": "noun"
            },
            {
                "word": "visit",
                "pos": "verb"
            },
            {
                "word": "visit",
                "pos": "noun"
            },
            {
                "word": "visitation",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to go to see a person or a place for a period of time",
                    "vi": "để đi gặp một người hoặc một địa điểm trong một khoảng thời gian"
                },
                "examples": [
                    {
                        "en": "My parents are coming to visit me next week.",
                        "vi": "Bố mẹ tôi sẽ đến thăm tôi vào tuần tới."
                    },
                    {
                        "en": "to visit friends/family",
                        "vi": "đến thăm bạn bè / gia đình"
                    },
                    {
                        "en": "It looks like a lovely place to visit.",
                        "vi": "Nó trông giống như một nơi đáng yêu để ghé thăm."
                    },
                    {
                        "en": "to visit a country/city/town",
                        "vi": "đến thăm một quốc gia / thành phố / thị trấn"
                    },
                    {
                        "en": "to visit a museum/shrine",
                        "vi": "đến thăm một viện bảo tàng / đền thờ"
                    },
                    {
                        "en": "to visit a hospital/an office",
                        "vi": "đến thăm bệnh viện / văn phòng"
                    },
                    {
                        "en": "to visit a home/house",
                        "vi": "đến thăm một ngôi nhà / ngôi nhà"
                    },
                    {
                        "en": "She went to visit relatives in Wales.",
                        "vi": "Cô đi thăm họ hàng ở xứ Wales."
                    },
                    {
                        "en": "The Prime Minister is visiting Japan at the moment.",
                        "vi": "Thủ tướng đang thăm Nhật Bản vào thời điểm này."
                    },
                    {
                        "en": "You should visit your dentist at least twice a year.",
                        "vi": "Bạn nên đến gặp nha sĩ ít nhất hai lần một năm."
                    },
                    {
                        "en": "This is an area rarely visited by Europeans.",
                        "vi": "Đây là một khu vực hiếm khi được người châu Âu đến thăm."
                    },
                    {
                        "en": "I first visited New York in 1991.",
                        "vi": "Tôi đến thăm New York lần đầu tiên vào năm 1991."
                    },
                    {
                        "en": "He is planning to visit China later this month.",
                        "vi": "Anh ấy dự định đến thăm Trung Quốc vào cuối tháng này."
                    },
                    {
                        "en": "The best time to visit is during the winter dry season.",
                        "vi": "Thời gian tốt nhất để ghé thăm là trong mùa khô mùa đông."
                    }
                ]
            },
            {
                "define": {
                    "en": "to go to a website on the internet",
                    "vi": "để truy cập một trang web trên internet"
                },
                "examples": [
                    {
                        "en": "For more information, visit our website.",
                        "vi": "Để biết thêm thông tin truy cập trang web của chúng tôi."
                    },
                    {
                        "en": "to visit a site/page",
                        "vi": "để truy cập một trang / trang"
                    }
                ]
            },
            {
                "define": {
                    "en": "to stay somewhere for a short time",
                    "vi": "ở lại một nơi nào đó trong một thời gian ngắn"
                },
                "examples": [
                    {
                        "en": "We don't live here. We're just visiting.",
                        "vi": "Chúng tôi không sống ở đây. Chúng tôi chỉ đến thăm."
                    },
                    {
                        "en": "visit something Ships visit the island occasionally.",
                        "vi": "thăm một cái gì đó Tàu thỉnh thoảng ghé thăm hòn đảo."
                    },
                    {
                        "en": "The lake is also visited by seals in the summer.",
                        "vi": "Hồ cũng được hải cẩu ghé thăm vào mùa hè."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make an official visit to somebody, for example to perform checks or give advice",
                    "vi": "để thực hiện một chuyến thăm chính thức đến ai đó, chẳng hạn như để thực hiện kiểm tra hoặc đưa ra lời khuyên"
                },
                "examples": [
                    {
                        "en": "Government inspectors are visiting schools in the area.",
                        "vi": "Thanh tra chính phủ đang đến thăm các trường học trong khu vực."
                    },
                    {
                        "en": "Council officers will be visiting premises to inspect safety arrangements.",
                        "vi": "Các viên chức của hội đồng sẽ đến thăm cơ sở để kiểm tra việc sắp xếp an toàn."
                    }
                ]
            }
        ]
    },
    {
        "id": "896e339c3fa347ad8073d5161a46f593",
        "word": "visit",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/ˈvɪzɪt/",
            "us": "/ˈvɪzɪt/"
        },
        "nearby": [
            {
                "word": "vision mixer",
                "pos": "noun"
            },
            {
                "word": "visit",
                "pos": "verb"
            },
            {
                "word": "visit",
                "pos": "noun"
            },
            {
                "word": "visitation",
                "pos": "noun"
            },
            {
                "word": "VisitBritain",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an occasion or a period of time when somebody goes to see a place or person and spends time there",
                    "vi": "một dịp hoặc một khoảng thời gian khi ai đó đi xem một địa điểm hoặc một người và dành thời gian ở đó"
                },
                "examples": [
                    {
                        "en": "a two-day/three-day visit",
                        "vi": "một chuyến thăm hai ngày / ba ngày"
                    },
                    {
                        "en": "the prime minister's surprise visit to the troops",
                        "vi": "chuyến thăm bất ngờ của thủ tướng tới quân đội"
                    },
                    {
                        "en": "an official/state visit",
                        "vi": "một chuyến thăm chính thức / nhà nước"
                    },
                    {
                        "en": "visit to somebody/something It's my first visit to New York.",
                        "vi": "thăm ai đó / cái gì đó Đây là chuyến thăm đầu tiên của tôi đến New York."
                    },
                    {
                        "en": "If you have time, pay a visit to the local museum.",
                        "vi": "Nếu bạn có thời gian, hãy ghé thăm bảo tàng địa phương."
                    },
                    {
                        "en": "The family made a visit to England in the summer of 1923.",
                        "vi": "Gia đình đã đến thăm Anh vào mùa hè năm 1923."
                    },
                    {
                        "en": "a visit to the doctor",
                        "vi": "một chuyến thăm bác sĩ"
                    },
                    {
                        "en": "His visits home were limited to Christmas.",
                        "vi": "Những chuyến thăm nhà của anh ấy chỉ giới hạn trong dịp Giáng sinh."
                    },
                    {
                        "en": "visit from somebody We had a visit from the police last night.",
                        "vi": "chuyến thăm từ ai đó Chúng tôi đã có một cuộc viếng thăm từ cảnh sát đêm qua."
                    },
                    {
                        "en": "visit by somebody Arranegments are being made for a visit by a member of the royal family.",
                        "vi": "chuyến thăm của ai đó Các mảnh ghép đang được thực hiện cho chuyến thăm của một thành viên trong gia đình hoàng gia."
                    },
                    {
                        "en": "(British English) a home visit (= when your doctor visits you)",
                        "vi": "(Tiếng Anh Anh) một chuyến thăm nhà (= khi bác sĩ của bạn đến thăm bạn)"
                    },
                    {
                        "en": "a brief/recent visit",
                        "vi": "một chuyến thăm ngắn / gần đây"
                    },
                    {
                        "en": "on/during a visit The team reported on deficiencies found during the site visit.",
                        "vi": "vào / trong chuyến thăm Nhóm đã báo cáo về những thiếu sót được tìm thấy trong chuyến thăm hiện trường."
                    },
                    {
                        "en": "Regular visits to the dentist are important.",
                        "vi": "Thăm khám nha sĩ thường xuyên là rất quan trọng."
                    },
                    {
                        "en": "Is this a social visit, or is it business?",
                        "vi": "Đây là một chuyến thăm xã giao hay là một công việc kinh doanh?"
                    },
                    {
                        "en": "They're on an exchange visit to France.",
                        "vi": "Họ đang có chuyến thăm trao đổi tới Pháp."
                    },
                    {
                        "en": "Following this initial visit, she will return to Montserrat in June.",
                        "vi": "Sau chuyến thăm đầu tiên này, nó sẽ trở lại Montserrat vào tháng 6."
                    }
                ]
            },
            {
                "define": {
                    "en": "an occasion when somebody looks at a website on the internet",
                    "vi": "một dịp khi ai đó xem một trang web trên internet"
                },
                "examples": [
                    {
                        "en": "visit to something Visits to our website have doubled in a year.",
                        "vi": "truy cập vào một cái gì đó Số lượt truy cập vào trang web của chúng tôi đã tăng gấp đôi trong một năm."
                    },
                    {
                        "en": "The site now gets about 600,000 visits a day.",
                        "vi": "Trang web hiện có khoảng 600.000 lượt truy cập mỗi ngày."
                    }
                ]
            },
            {
                "define": {
                    "en": "an occasion when two or more people meet to talk in an informal way",
                    "vi": "một dịp khi hai hoặc nhiều người gặp nhau để nói chuyện một cách thân mật"
                },
                "examples": [
                    {
                        "en": "He thought back to his visit with the doctor.",
                        "vi": "Anh nghĩ lại chuyến thăm của mình với bác sĩ."
                    }
                ]
            }
        ]
    },
    {
        "id": "b662873a505e4d4bafdcb84ecaa39e78",
        "word": "chat",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/tʃæt/",
            "us": "/tʃæt/"
        },
        "nearby": [
            {
                "word": "chasuble",
                "pos": "noun"
            },
            {
                "word": "chat",
                "pos": "verb"
            },
            {
                "word": "chat",
                "pos": "noun"
            },
            {
                "word": "chatbot",
                "pos": "noun"
            },
            {
                "word": "chateau",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a friendly informal conversation",
                    "vi": "một cuộc trò chuyện thân mật thân thiện"
                },
                "examples": [
                    {
                        "en": "I just called in for a chat.",
                        "vi": "Tôi vừa gọi để trò chuyện."
                    },
                    {
                        "en": "chat with somebody I had a long chat with her.",
                        "vi": "trò chuyện với ai đó Tôi đã có một cuộc trò chuyện dài với cô ấy."
                    },
                    {
                        "en": "chat about somebody/something He always enjoyed a chat about the old days.",
                        "vi": "trò chuyện về ai đó / điều gì đó Anh ấy luôn thích trò chuyện về những ngày xưa."
                    }
                ]
            },
            {
                "define": {
                    "en": "talking, especially informal conversation",
                    "vi": "nói chuyện, đặc biệt là trò chuyện thân mật"
                },
                "examples": [
                    {
                        "en": "After a few more minutes of chat, she left.",
                        "vi": "Sau vài phút trò chuyện, cô ấy rời đi."
                    },
                    {
                        "en": "That's enough chat from me—on with the music!",
                        "vi": "Trò chuyện với tôi thế là đủ rồi — với âm nhạc!"
                    },
                    {
                        "en": "They say he's already married, but it's just idle chat.",
                        "vi": "Họ nói rằng anh ấy đã kết hôn, nhưng đó chỉ là trò chuyện nhàn rỗi."
                    },
                    {
                        "en": "chat with somebody He would never engage in chat with the servants.",
                        "vi": "trò chuyện với ai đó Anh ấy sẽ không bao giờ tham gia trò chuyện với những người hầu."
                    },
                    {
                        "en": "chat about somebody/something There was some general chat about the weather before the interview started.",
                        "vi": "trò chuyện về ai đó / điều gì đó Có một số cuộc trò chuyện chung về thời tiết trước khi cuộc phỏng vấn bắt đầu."
                    }
                ]
            },
            {
                "define": {
                    "en": "communication between people on the internet in which they see and reply to messages immediately and have a written conversation",
                    "vi": "giao tiếp giữa mọi người trên internet, trong đó họ nhìn thấy và trả lời tin nhắn ngay lập tức và có một cuộc trò chuyện bằng văn bản"
                },
                "examples": [
                    {
                        "en": "Fans are invited to an online chat.",
                        "vi": "Người hâm mộ được mời tham gia một cuộc trò chuyện trực tuyến."
                    },
                    {
                        "en": "a guide to internet chat safety for children",
                        "vi": "hướng dẫn về an toàn khi trò chuyện trên Internet cho trẻ em"
                    },
                    {
                        "en": "chat with somebody You can take part in a live chat with the movie's director this afternoon.",
                        "vi": "trò chuyện với ai đó Bạn có thể tham gia trò chuyện trực tiếp với đạo diễn của bộ phim vào chiều nay."
                    },
                    {
                        "en": "chat about somebody/something There was much chat about it on internet message boards.",
                        "vi": "trò chuyện về ai đó / điều gì đó Có rất nhiều cuộc trò chuyện về nó trên các bảng tin trên internet."
                    },
                    {
                        "en": "chat software",
                        "vi": "phần mềm trò chuyện"
                    },
                    {
                        "en": "internet chat services",
                        "vi": "dịch vụ trò chuyện internet"
                    }
                ]
            }
        ]
    },
    {
        "id": "8eeb1d09802d478f8f571525ff8a797a",
        "word": "connect",
        "pos": "verb",
        "level": "a2",
        "phonetic": {
            "uk": "/kəˈnekt/",
            "us": "/kəˈnekt/"
        },
        "nearby": [
            {
                "word": "conman",
                "pos": "noun"
            },
            {
                "word": "con moto",
                "pos": "adverb"
            },
            {
                "word": "connect",
                "pos": "verb"
            },
            {
                "word": "connected",
                "pos": "adjective"
            },
            {
                "word": "connectedness",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to join together two or more things; to be joined together",
                    "vi": "để kết hợp với nhau hai hoặc nhiều thứ; được tham gia cùng nhau"
                },
                "examples": [
                    {
                        "en": "connect A and B The towns are connected by train and bus services.",
                        "vi": "kết nối A và B Các thị trấn được kết nối bằng dịch vụ xe lửa và xe buýt."
                    },
                    {
                        "en": "connect A to B The island is connected to the mainland by a bridge.",
                        "vi": "nối A với B Hòn đảo được nối với đất liền bằng một cây cầu."
                    },
                    {
                        "en": "connect A with B The canal was built to connect Sheffield with the Humber estuary.",
                        "vi": "nối A với B Con kênh được xây dựng để nối Sheffield với cửa sông Humber."
                    },
                    {
                        "en": "The rooms on this floor connect.",
                        "vi": "Các phòng trên tầng này thông nhau."
                    },
                    {
                        "en": "a connecting door (= one that connects two rooms)",
                        "vi": "một cửa thông nhau (= một cửa nối hai phòng)"
                    }
                ]
            },
            {
                "define": {
                    "en": "to join something to the main supply of electricity, gas, water, etc. or to another piece of equipment",
                    "vi": "để kết nối một cái gì đó với nguồn cung cấp chính điện, khí đốt, nước, v.v. hoặc với một phần thiết bị khác"
                },
                "examples": [
                    {
                        "en": "connect something We're waiting for the broadband to be connected.",
                        "vi": "kết nối một cái gì đó Chúng tôi đang chờ kết nối băng thông rộng."
                    },
                    {
                        "en": "connect something to something First connect the printer to the computer.",
                        "vi": "kết nối một cái gì đó với một cái gì đó Đầu tiên hãy kết nối máy in với máy tính."
                    }
                ]
            },
            {
                "define": {
                    "en": "to join a computer or a mobile device to the internet or to a computer network",
                    "vi": "để kết nối máy tính hoặc thiết bị di động với internet hoặc vào mạng máy tính"
                },
                "examples": [
                    {
                        "en": "The device can be hooked up to a mobile phone to connect wirelessly.",
                        "vi": "Thiết bị có thể được kết nối với điện thoại di động để kết nối không dây."
                    },
                    {
                        "en": "connect to something Click ‘Continue’ to connect to the internet.",
                        "vi": "kết nối với thứ gì đó Nhấp vào 'Tiếp tục' để kết nối với internet."
                    },
                    {
                        "en": "laptops that connect wirelessly to the Net",
                        "vi": "máy tính xách tay kết nối không dây với Mạng"
                    },
                    {
                        "en": "connect something The system harnesses the processing power of many computers connected by a high-speed network.",
                        "vi": "kết nối một cái gì đó Hệ thống khai thác sức mạnh xử lý của nhiều máy tính được kết nối bằng mạng tốc độ cao."
                    },
                    {
                        "en": "connect something to something Simply connect your device to the camera's Wi-Fi signal.",
                        "vi": "kết nối một cái gì đó với một cái gì đó Chỉ cần kết nối thiết bị của bạn với tín hiệu Wi-Fi của máy ảnh."
                    },
                    {
                        "en": "Many guests leave their laptops connected to the hotel network when they're not in their rooms.",
                        "vi": "Nhiều khách để máy tính xách tay của họ kết nối với mạng khách sạn khi họ không ở trong phòng của họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to notice or make a link between people, things, events, etc.",
                    "vi": "để chú ý hoặc tạo liên kết giữa mọi người, mọi thứ, sự kiện, v.v."
                },
                "examples": [
                    {
                        "en": "connect A and B I was surprised to hear them mentioned together: I had never connected them before.",
                        "vi": "kết nối A và BI đã rất ngạc nhiên khi nghe họ đề cập cùng nhau: Tôi chưa bao giờ kết nối họ trước đây."
                    },
                    {
                        "en": "connect A with/to B There was nothing to connect him with the crime.",
                        "vi": "kết nối A với / với B Không có gì để kết nối anh ta với tội phạm."
                    },
                    {
                        "en": "He made a statement connecting the terrorist group to the attack.",
                        "vi": "Ông đã đưa ra tuyên bố kết nối nhóm khủng bố với vụ tấn công."
                    }
                ]
            },
            {
                "define": {
                    "en": "to arrive just before another one leaves so that passengers can change from one to the other",
                    "vi": "đến ngay trước khi một chiếc khác rời đi để hành khách có thể thay đổi từ chiếc này sang chiếc khác"
                },
                "examples": [
                    {
                        "en": "His flight to Amsterdam connects with an afternoon flight to New York.",
                        "vi": "Chuyến bay của anh ấy đến Amsterdam kết nối với một chuyến bay chiều đến New York."
                    },
                    {
                        "en": "There's a connecting flight at noon.",
                        "vi": "Có một chuyến bay nối chuyến vào buổi trưa."
                    }
                ]
            },
            {
                "define": {
                    "en": "to put somebody in contact by phone",
                    "vi": "để liên lạc với ai đó qua điện thoại"
                },
                "examples": [
                    {
                        "en": "After a long wait I was connected to customer services.",
                        "vi": "Sau một thời gian dài chờ đợi, tôi đã được kết nối với các dịch vụ khách hàng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to form a good relationship with somebody so that you like and understand each other",
                    "vi": "để hình thành một mối quan hệ tốt với ai đó để các bạn thích và hiểu nhau"
                },
                "examples": [
                    {
                        "en": "They met a couple of times but they didn't really connect.",
                        "vi": "Họ đã gặp nhau một vài lần nhưng họ không thực sự kết nối."
                    }
                ]
            },
            {
                "define": {
                    "en": "to hit somebody/something",
                    "vi": "đánh ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "The blow connected and she felt a surge of pain.",
                        "vi": "Cú đánh kết nối và cô cảm thấy đau đớn dâng trào."
                    }
                ]
            }
        ]
    },
    {
        "id": "5ce1e67bcffe4b54bc1e9ab6350ddc69",
        "word": "Google™",
        "pos": "",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈɡuːɡl/",
            "us": "/ˈɡuːɡl/"
        },
        "nearby": [
            {
                "word": "goog",
                "pos": "noun"
            },
            {
                "word": "google",
                "pos": "verb"
            },
            {
                "word": "Google",
                "pos": ""
            },
            {
                "word": "googly",
                "pos": "noun"
            },
            {
                "word": "googly eyes",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a very popular internet search engine (= a website that helps you to search for information on the internet)",
                    "vi": "một công cụ tìm kiếm trên internet rất phổ biến (= một trang web giúp bạn tìm kiếm thông tin trên internet)"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "5aaecf2711df46ba95d79215654005ef",
        "word": "connection",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/kəˈnekʃn/",
            "us": "/kəˈnekʃn/"
        },
        "nearby": [
            {
                "word": "connectedness",
                "pos": "noun"
            },
            {
                "word": "Connecticut",
                "pos": ""
            },
            {
                "word": "connection",
                "pos": "noun"
            },
            {
                "word": "connective",
                "pos": "adjective"
            },
            {
                "word": "connective",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "something that connects two facts, ideas, etc.",
                    "vi": "thứ gì đó kết nối hai sự thật, ý tưởng, v.v."
                },
                "examples": [
                    {
                        "en": "connection between A and B Scientists have established a connection between cholesterol levels and heart disease.",
                        "vi": "kết nối giữa A và B Các nhà khoa học đã thiết lập mối liên hệ giữa mức cholesterol và bệnh tim."
                    },
                    {
                        "en": "connection with something a direct/close/strong connection with something",
                        "vi": "kết nối với một cái gì đó một kết nối trực tiếp / gần / mạnh với một cái gì đó"
                    },
                    {
                        "en": "His resignation must have some connection with the recent scandal.",
                        "vi": "Việc từ chức của ông phải có một số liên quan đến vụ bê bối gần đây."
                    },
                    {
                        "en": "connection to something Consumers are more likely to buy something from a person or shop they feel a personal connection to.",
                        "vi": "kết nối với thứ gì đó Người tiêu dùng có nhiều khả năng mua thứ gì đó từ một người hoặc cửa hàng mà họ cảm thấy có mối liên hệ cá nhân."
                    },
                    {
                        "en": "How did you make the connection (= realize that there was a connection between two facts that did not seem to be related)?",
                        "vi": "Bạn đã tạo mối liên hệ như thế nào (= nhận ra rằng có mối liên hệ giữa hai sự kiện dường như không liên quan)?"
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of connecting or the state of being connected",
                    "vi": "hành động kết nối hoặc trạng thái được kết nối"
                },
                "examples": [
                    {
                        "en": "a broadband/wireless/Wi-Fi/network connection",
                        "vi": "kết nối băng thông rộng / không dây / Wi-Fi / mạng"
                    },
                    {
                        "en": "I'm having problems with my internet connection.",
                        "vi": "Tôi đang gặp sự cố với kết nối Internet của mình."
                    },
                    {
                        "en": "connection to something Connection to the gas supply was delayed for three days.",
                        "vi": "kết nối với một cái gì đó Kết nối với nguồn cung cấp khí đốt đã bị trì hoãn trong ba ngày."
                    }
                ]
            },
            {
                "define": {
                    "en": "a point, especially in an electrical system, where two parts connect",
                    "vi": "một điểm, đặc biệt là trong hệ thống điện, nơi hai phần kết nối"
                },
                "examples": [
                    {
                        "en": "A faulty connection caused the machine to stop.",
                        "vi": "Kết nối bị lỗi khiến máy dừng."
                    },
                    {
                        "en": "If you break the connection, the light won't come on.",
                        "vi": "Nếu bạn ngắt kết nối, đèn sẽ không sáng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a train, bus or plane at a station or an airport that a passenger can take soon after getting off another in order to continue their journey",
                    "vi": "xe lửa, xe buýt hoặc máy bay tại nhà ga hoặc sân bay mà hành khách có thể bắt ngay sau khi xuống xe khác để tiếp tục hành trình của họ"
                },
                "examples": [
                    {
                        "en": "I missed the connection by five minutes.",
                        "vi": "Tôi đã bỏ lỡ kết nối năm phút."
                    },
                    {
                        "en": "We'll be lucky if we make our connection.",
                        "vi": "Chúng tôi sẽ may mắn nếu chúng tôi kết nối."
                    },
                    {
                        "en": "connection to… We arrived in good time for the connection to Paris.",
                        "vi": "kết nối với… Chúng tôi đã đến vào thời điểm thuận lợi để kết nối đến Paris."
                    }
                ]
            },
            {
                "define": {
                    "en": "a means of travelling to another place",
                    "vi": "một phương tiện đi du lịch đến một nơi khác"
                },
                "examples": [
                    {
                        "en": "There are good bus and train connections between the resort and major cities.",
                        "vi": "Có kết nối xe buýt và xe lửa tốt giữa khu nghỉ mát và các thành phố lớn."
                    },
                    {
                        "en": "good connections with New York",
                        "vi": "kết nối tốt với New York"
                    }
                ]
            },
            {
                "define": {
                    "en": "a person or an organization that you know and that can help or advise you in your social or professional life",
                    "vi": "một người hoặc một tổ chức mà bạn biết và có thể giúp đỡ hoặc tư vấn cho bạn trong cuộc sống xã hội hoặc nghề nghiệp của bạn"
                },
                "examples": [
                    {
                        "en": "One of my business connections gave them my name.",
                        "vi": "Một trong những mối quan hệ kinh doanh của tôi đã cho họ tên của tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "people who are your relatives, but not members of your close family",
                    "vi": "những người là họ hàng của bạn, nhưng không phải là thành viên của gia đình thân thiết của bạn"
                },
                "examples": [
                    {
                        "en": "She is British but also has German connections.",
                        "vi": "Cô ấy là người Anh nhưng cũng có mối liên hệ với người Đức."
                    },
                    {
                        "en": "a network of family connections in Italy",
                        "vi": "một mạng lưới kết nối gia đình ở Ý"
                    }
                ]
            },
            {
                "define": {
                    "en": "for reasons connected with somebody/something",
                    "vi": "vì lý do kết nối với ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "A man has been arrested in connection with the murder of the teenager.",
                        "vi": "Một người đàn ông đã bị bắt vì liên quan đến vụ sát hại cậu thiếu niên."
                    },
                    {
                        "en": "I am writing to you in connection with your recent job application.",
                        "vi": "Tôi viết thư cho bạn liên quan đến đơn xin việc gần đây của bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "for reasons connected with something recently mentioned",
                    "vi": "vì lý do được kết nối với một cái gì đó được đề cập gần đây"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "d4bfb7e4ccdd4efdb23465b0c2f0f04a",
        "word": "google",
        "pos": "verb",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈɡuːɡl/",
            "us": "/ˈɡuːɡl/"
        },
        "nearby": [
            {
                "word": "goofy",
                "pos": "adjective"
            },
            {
                "word": "goog",
                "pos": "noun"
            },
            {
                "word": "google",
                "pos": "verb"
            },
            {
                "word": "Google",
                "pos": ""
            },
            {
                "word": "googly",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to type words into the search engine Google™ in order to find information about somebody/something",
                    "vi": "nhập các từ vào công cụ tìm kiếm Google ™ để tìm thông tin về ai đó / điều gì đó"
                },
                "examples": [
                    {
                        "en": "I just googled her and found her blog.",
                        "vi": "Tôi vừa tìm kiếm cô ấy và tìm thấy blog của cô ấy."
                    },
                    {
                        "en": "I tried googling but couldn't find anything relevant.",
                        "vi": "Tôi đã thử googling nhưng không thể tìm thấy bất kỳ điều gì có liên quan."
                    }
                ]
            }
        ]
    },
    {
        "id": "b745dc6d6af1468cb9ccf75c56b8274b",
        "word": "message",
        "pos": "verb",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈmesɪdʒ/",
            "us": "/ˈmesɪdʒ/"
        },
        "nearby": [
            {
                "word": "mess about",
                "pos": "phrasal verb"
            },
            {
                "word": "message",
                "pos": "noun"
            },
            {
                "word": "message",
                "pos": "verb"
            },
            {
                "word": "message board",
                "pos": "noun"
            },
            {
                "word": "messaging",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to send a text message, or a message through an instant messaging service, etc. to somebody",
                    "vi": "để gửi một tin nhắn văn bản hoặc một tin nhắn qua dịch vụ nhắn tin tức thời, v.v. cho ai đó"
                },
                "examples": [
                    {
                        "en": "message somebody Fiona just messaged me.",
                        "vi": "nhắn tin cho ai đó Fiona vừa nhắn tin cho tôi."
                    },
                    {
                        "en": "message somebody something Brian messaged me the news.",
                        "vi": "nhắn tin cho ai đó điều gì đó Brian đã nhắn tin cho tôi."
                    }
                ]
            }
        ]
    },
    {
        "id": "131edfa9bcf4490d9656e19b1e2ccddc",
        "word": "surf",
        "pos": "verb",
        "level": "b1",
        "phonetic": {
            "uk": "/sɜːf/",
            "us": "/sɜːrf/"
        },
        "nearby": [
            {
                "word": "surety",
                "pos": "noun"
            },
            {
                "word": "surf",
                "pos": "noun"
            },
            {
                "word": "surf",
                "pos": "verb"
            },
            {
                "word": "surface",
                "pos": "noun"
            },
            {
                "word": "surface",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to take part in the sport of riding on waves on a surfboard",
                    "vi": "tham gia môn thể thao cưỡi sóng trên ván lướt sóng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to use the internet",
                    "vi": "sử dụng internet"
                },
                "examples": [
                    {
                        "en": "I was surfing the Net looking for information on Indian music.",
                        "vi": "Tôi đang lướt mạng để tìm kiếm thông tin về âm nhạc Ấn Độ."
                    }
                ]
            }
        ]
    },
    {
        "id": "8094976c3def4a0fbcac50112cb4a6ea",
        "word": "user group",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈjuːzə ɡruːp/",
            "us": "/ˈjuːzər ɡruːp/"
        },
        "nearby": [
            {
                "word": "user-friendly",
                "pos": "adjective"
            },
            {
                "word": "user-generated",
                "pos": "adjective"
            },
            {
                "word": "user group",
                "pos": "noun"
            },
            {
                "word": "user ID",
                "pos": "noun"
            },
            {
                "word": "user interface",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a group of people who use a particular thing and who share information about it, especially people who share information about computers on the internet",
                    "vi": "một nhóm người sử dụng một thứ cụ thể và chia sẻ thông tin về nó, đặc biệt là những người chia sẻ thông tin về máy tính trên internet"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "1aaf8e1f93bc4933826be3aa7efc664e",
        "word": "account",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/əˈkaʊnt/",
            "us": "/əˈkaʊnt/"
        },
        "nearby": [
            {
                "word": "accord with",
                "pos": "phrasal verb"
            },
            {
                "word": "accost",
                "pos": "verb"
            },
            {
                "word": "account",
                "pos": "noun"
            },
            {
                "word": "account",
                "pos": "verb"
            },
            {
                "word": "accountability",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an arrangement that somebody has with a bank, etc. to keep money there, take some out, etc.",
                    "vi": "một thỏa thuận mà ai đó có với ngân hàng, v.v. để giữ tiền ở đó, lấy một ít ra, v.v."
                },
                "examples": [
                    {
                        "en": "I don't have a bank account.",
                        "vi": "Tôi không có tài khoản ngân hàng."
                    },
                    {
                        "en": "I paid the money into my savings account.",
                        "vi": "Tôi đã trả tiền vào tài khoản tiết kiệm của mình."
                    },
                    {
                        "en": "a joint account (= one in the name of more than one person)",
                        "vi": "một tài khoản chung (= một tài khoản dưới tên của nhiều người)"
                    },
                    {
                        "en": "With internet banking you can manage your account online.",
                        "vi": "Với ngân hàng trực tuyến, bạn có thể quản lý tài khoản của mình trực tuyến."
                    },
                    {
                        "en": "account with somebody/something Do you have an account with us?",
                        "vi": "tài khoản với ai đó / cái gì đó Bạn có tài khoản với chúng tôi không?"
                    },
                    {
                        "en": "account at something He opened an account at a bank in Germany.",
                        "vi": "tài khoản tại một cái gì đó Anh ấy đã mở một tài khoản tại một ngân hàng ở Đức."
                    },
                    {
                        "en": "Interest will be paid monthly into the account holder's current account.",
                        "vi": "Tiền lãi sẽ được trả hàng tháng vào tài khoản vãng lai của chủ tài khoản."
                    },
                    {
                        "en": "What's your account number please?",
                        "vi": "Vui lòng cho biết số tài khoản của bạn là gì?"
                    }
                ]
            },
            {
                "define": {
                    "en": "an arrangement that somebody has with a company that allows them to use the internet, send and receive messages by email, social media, etc.",
                    "vi": "một thỏa thuận mà ai đó có với một công ty cho phép họ sử dụng internet, gửi và nhận tin nhắn qua email, mạng xã hội, v.v."
                },
                "examples": [
                    {
                        "en": "an email/a Twitter account",
                        "vi": "một email / một tài khoản Twitter"
                    },
                    {
                        "en": "Millions of accounts have been hacked.",
                        "vi": "Hàng triệu tài khoản đã bị tấn công."
                    }
                ]
            },
            {
                "define": {
                    "en": "a written or spoken description of something that has happened",
                    "vi": "một mô tả bằng văn bản hoặc bằng giọng nói về điều gì đó đã xảy ra"
                },
                "examples": [
                    {
                        "en": "an eyewitness account (= a description given by somebody who saw what happened)",
                        "vi": "một tài khoản nhân chứng (= mô tả do ai đó đã nhìn thấy những gì đã xảy ra)"
                    },
                    {
                        "en": "a first-hand/personal/first-person account",
                        "vi": "tài khoản đầu tay / cá nhân / người đầu tiên"
                    },
                    {
                        "en": "account of something Can you give us an account of what happened?",
                        "vi": "tài khoản của một cái gì đó Bạn có thể cho chúng tôi một tài khoản của những gì đã xảy ra?"
                    },
                    {
                        "en": "The diaries contained a detailed account of the writer's experiences in China.",
                        "vi": "Nhật ký có tường thuật chi tiết về những trải nghiệm của nhà văn ở Trung Quốc."
                    }
                ]
            },
            {
                "define": {
                    "en": "an explanation or a description of an idea, a theory or a process",
                    "vi": "giải thích hoặc mô tả một ý tưởng, một lý thuyết hoặc một quá trình"
                },
                "examples": [
                    {
                        "en": "the Biblical account of the creation of the world",
                        "vi": "lời tường thuật trong Kinh thánh về việc tạo ra thế giới"
                    }
                ]
            },
            {
                "define": {
                    "en": "a written record of money that is owed to a business and of money that has been paid by it",
                    "vi": "một biên bản ghi lại số tiền nợ cho một doanh nghiệp và số tiền đã được trả cho doanh nghiệp đó"
                },
                "examples": [
                    {
                        "en": "to do the accounts",
                        "vi": "để làm các tài khoản"
                    },
                    {
                        "en": "to keep the accounts up to date",
                        "vi": "để giữ cho các tài khoản được cập nhật"
                    },
                    {
                        "en": "the accounts department",
                        "vi": "bộ phận tài khoản"
                    },
                    {
                        "en": "She works in Accounts (= the accounts department).",
                        "vi": "Cô ấy làm việc trong Accounts (= bộ phận tài khoản)."
                    }
                ]
            },
            {
                "define": {
                    "en": "an arrangement with a shop or business to pay bills for goods or services at a later time, for example in regular amounts every month",
                    "vi": "thỏa thuận với một cửa hàng hoặc doanh nghiệp để thanh toán hóa đơn hàng hóa hoặc dịch vụ vào thời điểm sau đó, ví dụ: với số tiền đều đặn hàng tháng"
                },
                "examples": [
                    {
                        "en": "Put it on my account please.",
                        "vi": "Vui lòng đưa nó vào tài khoản của tôi."
                    },
                    {
                        "en": "We have accounts with most of our suppliers.",
                        "vi": "Chúng tôi có tài khoản với hầu hết các nhà cung cấp của chúng tôi."
                    },
                    {
                        "en": "Log in to your account to see how much you have spent.",
                        "vi": "Đăng nhập vào tài khoản của bạn để xem bạn đã chi bao nhiêu."
                    }
                ]
            },
            {
                "define": {
                    "en": "a bill for goods or services provided over a period",
                    "vi": "hóa đơn cho hàng hóa hoặc dịch vụ được cung cấp trong một khoảng thời gian"
                },
                "examples": [
                    {
                        "en": "Departing guests should settle their accounts at the office.",
                        "vi": "Khách khởi hành nên tất toán tại văn phòng."
                    },
                    {
                        "en": "It is best to settle the account each month.",
                        "vi": "Tốt nhất là tất toán mỗi tháng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a regular customer",
                    "vi": "một khách hàng thường xuyên"
                },
                "examples": [
                    {
                        "en": "The agency has lost several of its most important accounts.",
                        "vi": "Cơ quan đã mất một số tài khoản quan trọng nhất của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "a description of an event that gives you all the details in the order in which they happen",
                    "vi": "mô tả về một sự kiện cung cấp cho bạn tất cả các chi tiết theo thứ tự mà chúng xảy ra"
                },
                "examples": [
                    {
                        "en": "He insisted on giving us a blow-by-blow account of what had happened.",
                        "vi": "Anh ta khăng khăng đòi chúng tôi tường thuật chi tiết về những gì đã xảy ra."
                    }
                ]
            },
            {
                "define": {
                    "en": "according to what other people say",
                    "vi": "theo những gì người khác nói"
                },
                "examples": [
                    {
                        "en": "I've never been there, but it's a lovely place, by all accounts.",
                        "vi": "Tôi chưa bao giờ đến đó, nhưng đó là một nơi đáng yêu, bởi tất cả các tài khoản."
                    }
                ]
            },
            {
                "define": {
                    "en": "according to what you say yourself",
                    "vi": "theo những gì bạn nói"
                },
                "examples": [
                    {
                        "en": "By his own account he had an unhappy childhood.",
                        "vi": "Theo lời kể của chính mình, anh ấy đã có một tuổi thơ bất hạnh."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody explain a mistake, etc. because they are responsible for it",
                    "vi": "để khiến ai đó giải thích sai lầm, v.v. bởi vì họ phải chịu trách nhiệm về điều đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to do something or perform well, especially in a contest",
                    "vi": "để làm điều gì đó hoặc hoạt động tốt, đặc biệt là trong một cuộc thi"
                },
                "examples": [
                    {
                        "en": "The team gave a good account of themselves in the match.",
                        "vi": "Đội đã đánh giá tốt về bản thân trong trận đấu."
                    }
                ]
            },
            {
                "define": {
                    "en": "not important",
                    "vi": "không quan trọng"
                },
                "examples": [
                    {
                        "en": "Emotional matters were of no account to them during the war.",
                        "vi": "Các vấn đề tình cảm không được giải quyết đối với họ trong chiến tranh."
                    }
                ]
            },
            {
                "define": {
                    "en": "if you buy something or pay on account, you pay nothing or only a small amount immediately and the rest later",
                    "vi": "nếu bạn mua thứ gì đó hoặc thanh toán trên tài khoản, bạn không phải trả gì hoặc chỉ trả một khoản nhỏ ngay lập tức và phần còn lại sau đó"
                },
                "examples": [
                    {
                        "en": "Call a cab on account.",
                        "vi": "Gọi taxi về tài khoản."
                    },
                    {
                        "en": "Ring for a cab on account.",
                        "vi": "Đổ chuông cho một chiếc taxi vào tài khoản."
                    },
                    {
                        "en": "She bought the furniture she wanted on account.",
                        "vi": "Cô ấy đã mua đồ nội thất mà cô ấy muốn trên tài khoản."
                    }
                ]
            },
            {
                "define": {
                    "en": "because of what you think somebody wants",
                    "vi": "bởi vì những gì bạn nghĩ ai đó muốn"
                },
                "examples": [
                    {
                        "en": "Please don't change your plans on my account.",
                        "vi": "Vui lòng không thay đổi kế hoạch của bạn trên tài khoản của tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "because of somebody/something",
                    "vi": "vì ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "She retired early on account of ill health.",
                        "vi": "Cô ấy nghỉ hưu sớm vì sức khỏe yếu."
                    },
                    {
                        "en": "The marsh is an area of great scientific interest on account of its wild flowers.",
                        "vi": "Đầm lầy là một khu vực được giới khoa học quan tâm nhiều nhờ các loài hoa dại của nó."
                    }
                ]
            },
            {
                "define": {
                    "en": "not for any reason",
                    "vi": "không vì bất kỳ lý do gì"
                },
                "examples": [
                    {
                        "en": "On no account should the house be left unlocked.",
                        "vi": "Ngôi nhà không được mở khóa."
                    }
                ]
            },
            {
                "define": {
                    "en": "for yourself",
                    "vi": "cho bản thân"
                },
                "examples": [
                    {
                        "en": "In 2012 Smith set up in business on his own account.",
                        "vi": "Năm 2012, Smith thành lập công việc kinh doanh trên chính tài khoản của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "because you want to and you have decided, not somebody else",
                    "vi": "bởi vì bạn muốn và bạn đã quyết định, không phải ai khác"
                },
                "examples": [
                    {
                        "en": "No one sent me. I am here on my own account.",
                        "vi": "Không ai gửi cho tôi. Tôi đang ở đây trên tài khoản của riêng tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "because of the particular thing that has been mentioned",
                    "vi": "bởi vì điều cụ thể đã được đề cập"
                },
                "examples": [
                    {
                        "en": "Weather conditions were poor, but he did not delay his departure on that account.",
                        "vi": "Điều kiện thời tiết không tốt, nhưng anh ấy đã không trì hoãn việc khởi hành của mình vì lý do đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "to use something in a good or helpful way",
                    "vi": "để sử dụng một cái gì đó theo cách tốt hoặc hữu ích"
                },
                "examples": [
                    {
                        "en": "He turned his artistic talents to good account by becoming a sculptor.",
                        "vi": "Anh ấy đã biến tài năng nghệ thuật của mình thành một tài năng tốt khi trở thành một nhà điêu khắc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to hurt or punish somebody who has harmed or cheated you in the past",
                    "vi": "để làm tổn thương hoặc trừng phạt ai đó đã làm hại hoặc lừa dối bạn trong quá khứ"
                },
                "examples": [
                    {
                        "en": "‘Who would do such a thing?’ ‘Maybe someone with an old score to settle.’",
                        "vi": "Ai sẽ làm một điều như vậy?' 'Có lẽ ai đó có số điểm cũ để giải quyết.'"
                    },
                    {
                        "en": "An embittered Charlotte is determined to settle accounts with Elizabeth.",
                        "vi": "Charlotte chán nản quyết tâm thanh toán các khoản với Elizabeth."
                    }
                ]
            },
            {
                "define": {
                    "en": "to consider particular facts, circumstances, etc. when making a decision about something",
                    "vi": "để xem xét các sự kiện, hoàn cảnh cụ thể, v.v. khi đưa ra quyết định về điều gì đó"
                },
                "examples": [
                    {
                        "en": "The company takes account of environmental issues wherever possible.",
                        "vi": "Công ty sẽ xem xét các vấn đề môi trường bất cứ khi nào có thể."
                    },
                    {
                        "en": "Coursework is taken into account as well as exam results.",
                        "vi": "Bài tập được tính đến cũng như kết quả kỳ thi."
                    }
                ]
            }
        ]
    },
    {
        "id": "e4ff0b7423de47d6a4f733d1f94ed608",
        "word": "cyber-",
        "pos": "combining form",
        "level": "b2",
        "phonetic": {
            "uk": "/saɪbə(r)/",
            "us": "/saɪbər/"
        },
        "nearby": [
            {
                "word": "cyan",
                "pos": "noun"
            },
            {
                "word": "cyanide",
                "pos": "noun"
            },
            {
                "word": "cyber-",
                "pos": "combining form"
            },
            {
                "word": "cyberattack",
                "pos": "noun"
            },
            {
                "word": "cyberbully",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "connected with electronic communication networks, especially the internet",
                    "vi": "kết nối với các mạng liên lạc điện tử, đặc biệt là internet"
                },
                "examples": [
                    {
                        "en": "cybernetics",
                        "vi": "điều khiển học"
                    },
                    {
                        "en": "cybercafe",
                        "vi": "quán cà phê Internet"
                    }
                ]
            }
        ]
    },
    {
        "id": "a6388f0bb711407397b8a4b64149159e",
        "word": "cybercafe",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈsaɪbəkæfeɪ/",
            "us": "/ˈsaɪbərkæfeɪ/"
        },
        "nearby": [
            {
                "word": "cyberbully",
                "pos": "noun"
            },
            {
                "word": "cyberbullying",
                "pos": "noun"
            },
            {
                "word": "cybercafe",
                "pos": "noun"
            },
            {
                "word": "cybercrime",
                "pos": "noun"
            },
            {
                "word": "the Cybermen",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a cafe with computers on which customers can use the internet, send emails, etc.",
                    "vi": "một quán cà phê có máy tính để khách hàng có thể sử dụng Internet, gửi email, v.v."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "5ce341c05fa14363be4ea5a69da44f8d",
        "word": "history",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈhɪstri/",
            "us": "/ˈhɪstri/"
        },
        "nearby": [
            {
                "word": "historiographical",
                "pos": "adjective"
            },
            {
                "word": "historiography",
                "pos": "noun"
            },
            {
                "word": "history",
                "pos": "noun"
            },
            {
                "word": "history-sheeter",
                "pos": "noun"
            },
            {
                "word": "histrionic",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "all the events that happened in the past",
                    "vi": "tất cả các sự kiện đã xảy ra trong quá khứ"
                },
                "examples": [
                    {
                        "en": "in history The battle was a turning point in human history.",
                        "vi": "trong lịch sử Trận chiến là một bước ngoặt trong lịch sử nhân loại."
                    },
                    {
                        "en": "one of the worst disasters in recent history",
                        "vi": "một trong những thảm họa tồi tệ nhất trong lịch sử gần đây"
                    },
                    {
                        "en": "throughout history Many people throughout history have dreamt of a world without war.",
                        "vi": "Trong suốt lịch sử Nhiều người trong suốt lịch sử đã mơ về một thế giới không có chiến tranh."
                    },
                    {
                        "en": "a people with no sense of history",
                        "vi": "một dân tộc không có cảm giác về lịch sử"
                    },
                    {
                        "en": "The area was inhabited long before the dawn of recorded history (= before people wrote about events).",
                        "vi": "Khu vực này đã có người sinh sống từ rất lâu trước buổi bình minh của lịch sử được ghi lại (= trước khi mọi người viết về các sự kiện)."
                    },
                    {
                        "en": "These events changed the course of history.",
                        "vi": "Những sự kiện này đã thay đổi tiến trình lịch sử."
                    },
                    {
                        "en": "This was her attempt to rewrite history with herself in the role of heroine.",
                        "vi": "Đây là nỗ lực của cô để viết lại lịch sử với chính mình trong vai trò nữ anh hùng."
                    }
                ]
            },
            {
                "define": {
                    "en": "the past events connected with the development of a particular place, subject, etc.",
                    "vi": "các sự kiện trong quá khứ kết nối với sự phát triển của một địa điểm, chủ đề cụ thể, v.v."
                },
                "examples": [
                    {
                        "en": "the history of science/music/philosophy",
                        "vi": "lịch sử khoa học / âm nhạc / triết học"
                    },
                    {
                        "en": "She is an expert in the history of the United States.",
                        "vi": "Cô ấy là một chuyên gia về lịch sử của Hoa Kỳ."
                    },
                    {
                        "en": "The local history of the area is fascinating.",
                        "vi": "Lịch sử địa phương của khu vực này thật hấp dẫn."
                    },
                    {
                        "en": "The museum traces the history of the slave trade.",
                        "vi": "Bảo tàng lưu lại lịch sử buôn bán nô lệ."
                    }
                ]
            },
            {
                "define": {
                    "en": "the study of past events, especially as a subject at school or university",
                    "vi": "nghiên cứu các sự kiện trong quá khứ, đặc biệt là một môn học ở trường học hoặc trường đại học"
                },
                "examples": [
                    {
                        "en": "a history professor/teacher",
                        "vi": "một giáo sư / giáo viên lịch sử"
                    },
                    {
                        "en": "a history lesson/textbook",
                        "vi": "một bài học lịch sử / sách giáo khoa"
                    },
                    {
                        "en": "a degree in History",
                        "vi": "bằng Lịch sử"
                    },
                    {
                        "en": "cultural/social/economic/political history",
                        "vi": "lịch sử văn hóa / xã hội / kinh tế / chính trị"
                    },
                    {
                        "en": "modern/ancient history",
                        "vi": "lịch sử hiện đại / cổ đại"
                    },
                    {
                        "en": "She's studying art history.",
                        "vi": "Cô ấy đang học lịch sử nghệ thuật."
                    },
                    {
                        "en": "She studies history of art.",
                        "vi": "Cô ấy nghiên cứu lịch sử nghệ thuật."
                    }
                ]
            },
            {
                "define": {
                    "en": "a written or spoken account of real past events",
                    "vi": "một tài khoản viết hoặc nói về các sự kiện thực trong quá khứ"
                },
                "examples": [
                    {
                        "en": "She's writing a new history of Europe.",
                        "vi": "Cô ấy đang viết một trang sử mới của Châu Âu."
                    },
                    {
                        "en": "She went on to catalogue a long history of disasters.",
                        "vi": "Cô tiếp tục liệt kê một lịch sử lâu dài về các thảm họa."
                    },
                    {
                        "en": "the oral histories of ordinary people",
                        "vi": "lịch sử truyền miệng của những người bình thường"
                    }
                ]
            },
            {
                "define": {
                    "en": "the set of facts that are known about somebody/something's past",
                    "vi": "tập hợp các sự kiện đã biết về quá khứ của ai đó / điều gì đó"
                },
                "examples": [
                    {
                        "en": "I know nothing about his personal history.",
                        "vi": "Tôi không biết gì về lịch sử cá nhân của anh ấy."
                    },
                    {
                        "en": "The group has quite a history.",
                        "vi": "Nhóm có lịch sử khá lâu đời."
                    },
                    {
                        "en": "The doctor will need some details of your medical history.",
                        "vi": "Bác sĩ sẽ cần một số chi tiết về bệnh sử của bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a record of something happening frequently in the past life of a person, family or place",
                    "vi": "bản ghi về điều gì đó xảy ra thường xuyên trong tiền kiếp của một người, gia đình hoặc địa điểm"
                },
                "examples": [
                    {
                        "en": "He has a history of violent crime.",
                        "vi": "Anh ta có tiền sử tội phạm bạo lực."
                    },
                    {
                        "en": "She has a long history of mental illness.",
                        "vi": "Cô có tiền sử bệnh tâm thần lâu năm."
                    },
                    {
                        "en": "There is a history of heart disease in my family.",
                        "vi": "Có tiền sử bệnh tim trong gia đình tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a record kept by a web browser of the web pages and other files it has been used to access",
                    "vi": "một bản ghi được lưu giữ bởi trình duyệt web về các trang web và các tệp khác mà nó đã được sử dụng để truy cập"
                },
                "examples": [
                    {
                        "en": "Clearing your browser history prevents websites from following and tracking your actions.",
                        "vi": "Xóa lịch sử trình duyệt của bạn ngăn các trang web theo dõi và theo dõi hành động của bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a relationship between two people, groups, companies, etc. that started in the past and continued for a period of time, especially one involving bad or complicated feelings",
                    "vi": "mối quan hệ giữa hai người, nhóm, công ty, v.v. đã bắt đầu trong quá khứ và tiếp tục trong một khoảng thời gian, đặc biệt là mối quan hệ liên quan đến cảm xúc tồi tệ hoặc phức tạp"
                },
                "examples": [
                    {
                        "en": "Sure there's history between Anna Mae and me, like you said.",
                        "vi": "Chắc chắn có lịch sử giữa Anna Mae và tôi, như bạn đã nói."
                    }
                ]
            },
            {
                "define": {
                    "en": "a historical play",
                    "vi": "một vở kịch lịch sử"
                },
                "examples": [
                    {
                        "en": "Shakespeare's comedies, histories and tragedies",
                        "vi": "Phim hài, lịch sử và bi kịch của Shakespeare"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be dead or no longer important",
                    "vi": "chết hoặc không còn quan trọng"
                },
                "examples": [
                    {
                        "en": "Another mistake like that and you're history.",
                        "vi": "Một sai lầm khác như thế và bạn là lịch sử."
                    },
                    {
                        "en": "We won't talk about that—that's history.",
                        "vi": "Chúng ta sẽ không nói về điều đó - đó là lịch sử."
                    },
                    {
                        "en": "That's past history now.",
                        "vi": "Đó là lịch sử quá khứ bây giờ."
                    },
                    {
                        "en": "They had an affair once, but that's past history now.",
                        "vi": "Họ đã ngoại tình một lần, nhưng đó là lịch sử đã qua."
                    }
                ]
            },
            {
                "define": {
                    "en": "the record of great achievements in history",
                    "vi": "kỷ lục của những thành tựu vĩ đại trong lịch sử"
                },
                "examples": [
                    {
                        "en": "She has earned her place in the history books.",
                        "vi": "Cô ấy đã giành được vị trí của mình trong sử sách."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that things often happen later in the same way as before",
                    "vi": "được sử dụng để nói rằng mọi thứ thường xảy ra sau đó giống như trước đây"
                },
                "examples": [
                    {
                        "en": "Years later family history repeated itself with Eve’s daughters.",
                        "vi": "Nhiều năm sau, lịch sử gia đình lặp lại với các cô con gái của Eve."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be or do something so important that it will be recorded in history",
                    "vi": "trở thành hoặc làm điều gì đó quan trọng đến mức nó sẽ được ghi vào lịch sử"
                },
                "examples": [
                    {
                        "en": "a discovery that made medical history",
                        "vi": "một khám phá làm nên lịch sử y học"
                    }
                ]
            },
            {
                "define": {
                    "en": "used when you are telling a story to say that you do not need to tell the end of it, because everyone knows it already",
                    "vi": "được sử dụng khi bạn đang kể một câu chuyện để nói rằng bạn không cần phải kể phần cuối của nó, vì mọi người đều biết điều đó rồi"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "86dde83b38634617aad12e8982cabd57",
        "word": "instant message",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˌɪnstənt ˈmesɪdʒ/",
            "us": "/ˌɪnstənt ˈmesɪdʒ/"
        },
        "nearby": [
            {
                "word": "instantaneously",
                "pos": "adverb"
            },
            {
                "word": "instantly",
                "pos": "adverb"
            },
            {
                "word": "instant message",
                "pos": "noun"
            },
            {
                "word": "instant-message",
                "pos": "verb"
            },
            {
                "word": "instant messaging",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a written message sent using a system on the internet that allows people to communicate with each other very quickly",
                    "vi": "một tin nhắn bằng văn bản được gửi bằng một hệ thống trên internet cho phép mọi người liên lạc với nhau rất nhanh chóng"
                },
                "examples": [
                    {
                        "en": "to send an instant message",
                        "vi": "để gửi một tin nhắn tức thì"
                    },
                    {
                        "en": "Word spreads by email and instant message.",
                        "vi": "Lời lan truyền qua email và tin nhắn tức thì."
                    }
                ]
            }
        ]
    },
    {
        "id": "98d502fbfcbd42edb8f85d9d61abb152",
        "word": "instant-message",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/ˌɪnstənt ˈmesɪdʒ/",
            "us": "/ˌɪnstənt ˈmesɪdʒ/"
        },
        "nearby": [
            {
                "word": "instantly",
                "pos": "adverb"
            },
            {
                "word": "instant message",
                "pos": "noun"
            },
            {
                "word": "instant-message",
                "pos": "verb"
            },
            {
                "word": "instant messaging",
                "pos": "noun"
            },
            {
                "word": "instant messenger",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to send a written message using a system on the internet that allows people to communicate with each other very quickly",
                    "vi": "để gửi một tin nhắn bằng văn bản bằng một hệ thống trên internet cho phép mọi người liên lạc với nhau rất nhanh chóng"
                },
                "examples": [
                    {
                        "en": "She spent most of the evening instant-messaging.",
                        "vi": "Cô ấy dành phần lớn thời gian cho việc nhắn tin nhanh vào buổi tối."
                    },
                    {
                        "en": "instant-message somebody He instant-messaged me last night.",
                        "vi": "nhắn tin nhanh cho ai đó Anh ấy đã nhắn tin tức thời cho tôi vào đêm qua."
                    },
                    {
                        "en": "instant-message somebody something Can you instant-message me the news?",
                        "vi": "nhắn tin nhanh cho ai đó điều gì đó Bạn có thể nhắn tin tức thời cho tôi được không?"
                    }
                ]
            }
        ]
    },
    {
        "id": "6384817539594b6eb4037ffebf8aaf12",
        "word": "instant messaging",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˌɪnstənt ˈmesɪdʒɪŋ/",
            "us": "/ˌɪnstənt ˈmesɪdʒɪŋ/"
        },
        "nearby": [
            {
                "word": "instant message",
                "pos": "noun"
            },
            {
                "word": "instant-message",
                "pos": "verb"
            },
            {
                "word": "instant messaging",
                "pos": "noun"
            },
            {
                "word": "instant messenger",
                "pos": "noun"
            },
            {
                "word": "instant replay",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a system on the internet that allows people to exchange written messages with each other very quickly",
                    "vi": "một hệ thống trên internet cho phép mọi người trao đổi tin nhắn bằng văn bản với nhau rất nhanh chóng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "b9d06636699148509337402072dfd1d1",
        "word": "net surfer",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈnet sɜːfə(r)/",
            "us": "/ˈnet sɜːrfər/"
        },
        "nearby": [
            {
                "word": "netminder",
                "pos": "noun"
            },
            {
                "word": "net neutrality",
                "pos": "noun"
            },
            {
                "word": "net surfer",
                "pos": "noun"
            },
            {
                "word": "nett",
                "pos": "adverb"
            },
            {
                "word": "nett",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who spends a lot of time using the internet",
                    "vi": "một người dành nhiều thời gian sử dụng internet"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "5b42181d464440d283bf888b5a00fe01",
        "word": "offline",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/ˌɒfˈlaɪn/",
            "us": "/ˌɔːfˈlaɪn/"
        },
        "nearby": [
            {
                "word": "off-licence",
                "pos": "noun"
            },
            {
                "word": "off-limits",
                "pos": "adjective"
            },
            {
                "word": "offline",
                "pos": "adjective"
            },
            {
                "word": "offline",
                "pos": "adverb"
            },
            {
                "word": "offload",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "not directly controlled by or connected to a computer or to the internet",
                    "vi": "không được điều khiển trực tiếp bởi hoặc được kết nối với máy tính hoặc internet"
                },
                "examples": [
                    {
                        "en": "For offline orders, call this number.",
                        "vi": "Đối với các đơn đặt hàng ngoại tuyến, hãy gọi số này."
                    }
                ]
            },
            {
                "define": {
                    "en": "to talk about something on a later occasion, perhaps because it does not interest the other people who are present at a meeting",
                    "vi": "để nói về điều gì đó vào một dịp sau, có lẽ vì nó không quan tâm đến những người khác có mặt trong cuộc họp"
                },
                "examples": [
                    {
                        "en": "Could you two take that offline so we can move onto the other items on the agenda?",
                        "vi": "Hai bạn có thể thực hiện điều đó ngoại tuyến để chúng ta có thể chuyển sang các mục khác trong chương trình làm việc không?"
                    }
                ]
            }
        ]
    },
    {
        "id": "5cdc0bea2f534956bda86d95cf0476d8",
        "word": "offline",
        "pos": "adverb",
        "level": "b2",
        "phonetic": {
            "uk": "/ˌɒfˈlaɪn/",
            "us": "/ˌɔːfˈlaɪn/"
        },
        "nearby": [
            {
                "word": "off-limits",
                "pos": "adjective"
            },
            {
                "word": "offline",
                "pos": "adjective"
            },
            {
                "word": "offline",
                "pos": "adverb"
            },
            {
                "word": "offload",
                "pos": "verb"
            },
            {
                "word": "off-peak",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "without being directly controlled by or connected to a computer or to the internet",
                    "vi": "mà không bị điều khiển trực tiếp hoặc được kết nối với máy tính hoặc internet"
                },
                "examples": [
                    {
                        "en": "How do I write an email offline?",
                        "vi": "Làm cách nào để viết email ngoại tuyến?"
                    }
                ]
            }
        ]
    },
    {
        "id": "881e5494ccd5444d915cdf4fb60441c9",
        "word": "remote learning",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/rɪˌməʊt ˈlɜːnɪŋ/",
            "us": "/rɪˌməʊt ˈlɜːrnɪŋ/"
        },
        "nearby": [
            {
                "word": "remote control",
                "pos": "noun"
            },
            {
                "word": "remote-controlled",
                "pos": "adjective"
            },
            {
                "word": "remote learning",
                "pos": "noun"
            },
            {
                "word": "remotely",
                "pos": "adverb"
            },
            {
                "word": "remoteness",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a system of education in which students study at home and communicate with their teachers over the internet",
                    "vi": "một hệ thống giáo dục trong đó học sinh học ở nhà và giao tiếp với giáo viên của họ qua internet"
                },
                "examples": [
                    {
                        "en": "The Covid-19 pandemic has seen teachers and students all over the world getting used to remote learning.",
                        "vi": "Đại dịch Covid-19 đã khiến giáo viên và học sinh trên toàn thế giới quen với việc học từ xa."
                    }
                ]
            }
        ]
    },
    {
        "id": "84f910519c874c579dad909cd9ffe16e",
        "word": "service provider",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈsɜːvɪs prəvaɪdə(r)/",
            "us": "/ˈsɜːrvɪs prəvaɪdər/"
        },
        "nearby": [
            {
                "word": "service member",
                "pos": "noun"
            },
            {
                "word": "service plaza",
                "pos": "noun"
            },
            {
                "word": "service provider",
                "pos": "noun"
            },
            {
                "word": "service road",
                "pos": "noun"
            },
            {
                "word": "service station",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a business company that provides a service to customers, especially one that connects customers to the internet",
                    "vi": "một công ty kinh doanh cung cấp dịch vụ cho khách hàng, đặc biệt là một công ty kết nối khách hàng với internet"
                },
                "examples": [
                    {
                        "en": "an internet service provider",
                        "vi": "một nhà cung cấp dịch vụ internet"
                    }
                ]
            }
        ]
    },
    {
        "id": "5c3c499d80ca48509fc4cb45a899f726",
        "word": "surfer",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈsɜːfə(r)/",
            "us": "/ˈsɜːrfər/"
        },
        "nearby": [
            {
                "word": "surfboard",
                "pos": "noun"
            },
            {
                "word": "surfeit",
                "pos": "noun"
            },
            {
                "word": "surfer",
                "pos": "noun"
            },
            {
                "word": "surfie",
                "pos": "noun"
            },
            {
                "word": "surfing",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who goes surfing",
                    "vi": "một người đi lướt sóng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a person who spends a lot of time using the internet",
                    "vi": "một người dành nhiều thời gian sử dụng internet"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c36aa5f26ba84f16b3adbf755c5a6255",
        "word": "surfing",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈsɜːfɪŋ/",
            "us": "/ˈsɜːrfɪŋ/"
        },
        "nearby": [
            {
                "word": "surfer",
                "pos": "noun"
            },
            {
                "word": "surfie",
                "pos": "noun"
            },
            {
                "word": "surfing",
                "pos": "noun"
            },
            {
                "word": "surf lifesaver",
                "pos": "noun"
            },
            {
                "word": "surf 'n' turf",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the sport of riding on waves while standing on a narrow board called a surfboard",
                    "vi": "môn thể thao vừa cưỡi trên sóng vừa đứng trên một tấm ván hẹp gọi là ván lướt sóng"
                },
                "examples": [
                    {
                        "en": "to go surfing",
                        "vi": "đi lướt sóng"
                    }
                ]
            },
            {
                "define": {
                    "en": "the activity of looking at different things on the internet in order to find something interesting",
                    "vi": "hoạt động xem xét những thứ khác nhau trên internet để tìm một thứ gì đó thú vị"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "dc0e05244624408593b3bf6789397d0c",
        "word": "bookmark",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈbʊkmɑːk/",
            "us": "/ˈbʊkmɑːrk/"
        },
        "nearby": [
            {
                "word": "bookmaker",
                "pos": "noun"
            },
            {
                "word": "bookmaking",
                "pos": "noun"
            },
            {
                "word": "bookmark",
                "pos": "noun"
            },
            {
                "word": "bookmark",
                "pos": "verb"
            },
            {
                "word": "bookmobile",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a long narrow piece of paper, etc. that you put between the pages of a book when you finish reading so that you can easily find the place again",
                    "vi": "một mảnh giấy dài hẹp, v.v. mà bạn đặt giữa các trang sách khi đọc xong để bạn có thể dễ dàng tìm lại vị trí"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a record of the address of a file, a page on the internet, etc. that enables you to find it quickly",
                    "vi": "bản ghi địa chỉ của một tệp, một trang trên internet, v.v. cho phép bạn tìm thấy tệp đó một cách nhanh chóng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "007a58beab5549c7a143b033a8672561",
        "word": "bookmark",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈbʊkmɑːk/",
            "us": "/ˈbʊkmɑːrk/"
        },
        "nearby": [
            {
                "word": "bookmaking",
                "pos": "noun"
            },
            {
                "word": "bookmark",
                "pos": "noun"
            },
            {
                "word": "bookmark",
                "pos": "verb"
            },
            {
                "word": "bookmobile",
                "pos": "noun"
            },
            {
                "word": "the Book of Common Prayer",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to record of the address of a file, a page on the internet, etc. so that you can find it quickly",
                    "vi": "để ghi lại địa chỉ của một tệp, một trang trên internet, v.v. để bạn có thể tìm thấy nó một cách nhanh chóng"
                },
                "examples": [
                    {
                        "en": "Do you want to bookmark this site?",
                        "vi": "Bạn có muốn đánh dấu trang này không?"
                    }
                ]
            }
        ]
    },
    {
        "id": "afbd3c4198934a8f8b7476e254e9d049",
        "word": "broadband",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈbrɔːdbænd/",
            "us": "/ˈbrɔːdbænd/"
        },
        "nearby": [
            {
                "word": "broad",
                "pos": "noun"
            },
            {
                "word": "B-road",
                "pos": "noun"
            },
            {
                "word": "broadband",
                "pos": "noun"
            },
            {
                "word": "broad-based",
                "pos": "adjective"
            },
            {
                "word": "broad bean",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a way of connecting to the internet that allows you to receive information, including pictures, etc., very quickly and that is always active (so that the user does not have to connect each time)",
                    "vi": "một cách kết nối với internet cho phép bạn nhận thông tin, bao gồm cả hình ảnh, v.v., rất nhanh chóng và luôn hoạt động (để người dùng không phải kết nối mỗi lần)"
                },
                "examples": [
                    {
                        "en": "plans to provide rural areas with fast broadband",
                        "vi": "có kế hoạch cung cấp cho các vùng nông thôn băng thông rộng nhanh"
                    }
                ]
            },
            {
                "define": {
                    "en": "signals that use a wide range of frequencies",
                    "vi": "tín hiệu sử dụng nhiều tần số"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a548ebec0fd34099ac358dd33276f591",
        "word": "browse",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/braʊz/",
            "us": "/braʊz/"
        },
        "nearby": [
            {
                "word": "Brown v Board of Education",
                "pos": "noun"
            },
            {
                "word": "browse",
                "pos": "noun"
            },
            {
                "word": "browse",
                "pos": "verb"
            },
            {
                "word": "browser",
                "pos": "noun"
            },
            {
                "word": "brrr",
                "pos": "exclamation"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to look at a lot of things in a shop rather than looking for one particular thing",
                    "vi": "để xem nhiều thứ trong một cửa hàng hơn là tìm kiếm một thứ cụ thể"
                },
                "examples": [
                    {
                        "en": "You are welcome to come in and browse.",
                        "vi": "Bạn được chào đón vào và duyệt qua."
                    },
                    {
                        "en": "browse something She browsed the shelves for something interesting to read.",
                        "vi": "duyệt thứ gì đó Cô ấy duyệt qua các kệ để tìm thứ gì đó thú vị để đọc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to look through a book, newspaper, website, etc. without reading everything",
                    "vi": "để xem qua một cuốn sách, tờ báo, trang web, v.v. mà không cần đọc tất cả mọi thứ"
                },
                "examples": [
                    {
                        "en": "I spent the whole evening just browsing on the internet.",
                        "vi": "Tôi đã dành cả buổi tối chỉ để duyệt trên internet."
                    },
                    {
                        "en": "browse through something I found the article while I was browsing through some old magazines.",
                        "vi": "duyệt qua một số thứ tôi tìm thấy bài báo trong khi tôi đang duyệt qua một số tạp chí cũ."
                    },
                    {
                        "en": "to browse through the catalogue",
                        "vi": "để duyệt qua danh mục"
                    },
                    {
                        "en": "browse something I browsed the website for information about the event but didn’t find anything useful.",
                        "vi": "duyệt một cái gì đó Tôi đã duyệt trang web để biết thông tin về sự kiện nhưng không tìm thấy bất cứ điều gì hữu ích."
                    }
                ]
            },
            {
                "define": {
                    "en": "to eat leaves, etc. that are growing high up",
                    "vi": "ăn lá, v.v. đang mọc trên cao"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "b7673e6532f549a1b055b5ec0d84092f",
        "word": "browser",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈbraʊzə(r)/",
            "us": "/ˈbraʊzər/"
        },
        "nearby": [
            {
                "word": "browse",
                "pos": "noun"
            },
            {
                "word": "browse",
                "pos": "verb"
            },
            {
                "word": "browser",
                "pos": "noun"
            },
            {
                "word": "brrr",
                "pos": "exclamation"
            },
            {
                "word": "Dave Brubeck",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a computer program that lets you look at or read documents on the World Wide Web",
                    "vi": "một chương trình máy tính cho phép bạn xem hoặc đọc tài liệu trên World Wide Web"
                },
                "examples": [
                    {
                        "en": "What do you use as your default browser?",
                        "vi": "Bạn sử dụng gì làm trình duyệt mặc định của mình?"
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who looks through books, magazines, etc. or at things for sale, but may not seriously intend to buy anything",
                    "vi": "một người xem qua sách, tạp chí, v.v. hoặc những thứ được bán, nhưng có thể không thực sự có ý định mua bất cứ thứ gì"
                },
                "examples": [
                    {
                        "en": "There were one or two browsers in the bookstore.",
                        "vi": "Có một hoặc hai trình duyệt trong hiệu sách."
                    }
                ]
            }
        ]
    },
    {
        "id": "475584a06d2c4a369e26a64fecd86177",
        "word": "distance learning",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌdɪstəns ˈlɜːnɪŋ/",
            "us": "/ˌdɪstəns ˈlɜːrnɪŋ/"
        },
        "nearby": [
            {
                "word": "distance",
                "pos": "verb"
            },
            {
                "word": "distance education",
                "pos": "noun"
            },
            {
                "word": "distance learning",
                "pos": "noun"
            },
            {
                "word": "distant",
                "pos": "adjective"
            },
            {
                "word": "distantly",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a system of education in which people study at home with the help of special internet sites and send or email work to their teachers",
                    "vi": "một hệ thống giáo dục trong đó mọi người học ở nhà với sự trợ giúp của các trang web đặc biệt và gửi hoặc gửi email công việc cho giáo viên của họ"
                },
                "examples": [
                    {
                        "en": "a distance learning programme/package",
                        "vi": "một chương trình / gói đào tạo từ xa"
                    },
                    {
                        "en": "I got my degree through a distance learning program.",
                        "vi": "Tôi đã nhận được bằng của mình thông qua một chương trình đào tạo từ xa."
                    },
                    {
                        "en": "The Open University offers a wide range of distance learning programmes.",
                        "vi": "Trường Đại học Mở cung cấp một loạt các chương trình đào tạo từ xa."
                    }
                ]
            }
        ]
    },
    {
        "id": "73050f71d06545749ca22d3b3067dd20",
        "word": "internet of things",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌɪntənet əv ˈθɪŋz/",
            "us": "/ˌɪntərnet əv ˈθɪŋz/"
        },
        "nearby": [
            {
                "word": "internet",
                "pos": "noun"
            },
            {
                "word": "internet dating",
                "pos": "noun"
            },
            {
                "word": "internet of things",
                "pos": "noun"
            },
            {
                "word": "internet service provider",
                "pos": "noun"
            },
            {
                "word": "internist",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the connection of devices within everyday objects via the internet, enabling them to share data",
                    "vi": "kết nối của các thiết bị trong các đồ vật hàng ngày thông qua internet, cho phép chúng chia sẻ dữ liệu"
                },
                "examples": [
                    {
                        "en": "From smart refrigerators to web-enabled teddy bears, the internet of things has never been more extensive.",
                        "vi": "Từ tủ lạnh thông minh đến gấu bông hỗ trợ web, internet vạn vật chưa bao giờ rộng lớn hơn thế."
                    }
                ]
            }
        ]
    },
    {
        "id": "f278d632350e43538c2350848e7f5a48",
        "word": "navigate",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈnævɪɡeɪt/",
            "us": "/ˈnævɪɡeɪt/"
        },
        "nearby": [
            {
                "word": "navigability",
                "pos": "noun"
            },
            {
                "word": "navigable",
                "pos": "adjective"
            },
            {
                "word": "navigate",
                "pos": "verb"
            },
            {
                "word": "navigation",
                "pos": "noun"
            },
            {
                "word": "navigational",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to plan and direct the course of ship, plane, car etc., for example by using a map",
                    "vi": "để lập kế hoạch và định hướng đường đi của tàu, máy bay, ô tô, v.v., chẳng hạn bằng cách sử dụng bản đồ"
                },
                "examples": [
                    {
                        "en": "to navigate by the stars",
                        "vi": "để điều hướng bởi các vì sao"
                    },
                    {
                        "en": "I'll drive, and you can navigate.",
                        "vi": "Tôi sẽ lái xe, và bạn có thể điều hướng."
                    },
                    {
                        "en": "navigate through something There's nothing worse than navigating through heavy traffic.",
                        "vi": "điều hướng qua một cái gì đó Không có gì tệ hơn là điều hướng qua giao thông đông đúc."
                    },
                    {
                        "en": "navigate your way… How do you navigate your way through a forest?",
                        "vi": "điều hướng theo cách của bạn… Làm thế nào để bạn điều hướng theo cách của bạn qua một khu rừng?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to sail along, over or through a sea, river etc.",
                    "vi": "đi thuyền dọc, qua hoặc qua biển, sông, v.v."
                },
                "examples": [
                    {
                        "en": "The river became too narrow and shallow to navigate.",
                        "vi": "Con sông trở nên quá hẹp và nông để điều hướng."
                    },
                    {
                        "en": "Only the best-trained captains could safely navigate these routes.",
                        "vi": "Chỉ những thuyền trưởng được đào tạo tốt nhất mới có thể điều hướng các tuyến đường này một cách an toàn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to find the right way to deal with a difficult or complicated situation",
                    "vi": "để tìm ra cách thích hợp để đối phó với một tình huống khó khăn hoặc phức tạp"
                },
                "examples": [
                    {
                        "en": "We next had to navigate a complex network of committees.",
                        "vi": "Tiếp theo, chúng tôi phải điều hướng một mạng lưới các ủy ban phức tạp."
                    }
                ]
            },
            {
                "define": {
                    "en": "to find your way around on the internet or on a particular website",
                    "vi": "để tìm đường của bạn trên internet hoặc trên một trang web cụ thể"
                },
                "examples": [
                    {
                        "en": "Customers will be able to navigate easily throughout the site.",
                        "vi": "Khách hàng sẽ có thể điều hướng dễ dàng trên toàn bộ trang web."
                    },
                    {
                        "en": "navigate (through) something Lots of these sites are hard to navigate through.",
                        "vi": "điều hướng (thông qua) một cái gì đó Rất nhiều trang web này rất khó để điều hướng qua."
                    }
                ]
            }
        ]
    },
    {
        "id": "2a5389b2fe7f4105a583c8033a26ec0b",
        "word": "access provider",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈækses prəvaɪdə(r)/",
            "us": "/ˈækses prəvaɪdər/"
        },
        "nearby": [
            {
                "word": "accessory",
                "pos": "noun"
            },
            {
                "word": "accessory",
                "pos": "adjective"
            },
            {
                "word": "access provider",
                "pos": "noun"
            },
            {
                "word": "access road",
                "pos": "noun"
            },
            {
                "word": "access time",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a business company that provides a service to customers, especially one that connects customers to the internet",
                    "vi": "một công ty kinh doanh cung cấp dịch vụ cho khách hàng, đặc biệt là một công ty kết nối khách hàng với internet"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "01cb1bda2f6f4ffca2ba7f69b7f2e52e",
        "word": "ad blocker",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈæd blɒkə(r)/",
            "us": "/ˈæd blɑːkər/"
        },
        "nearby": [
            {
                "word": "adaptive",
                "pos": "adjective"
            },
            {
                "word": "ADAS",
                "pos": ""
            },
            {
                "word": "ad blocker",
                "pos": "noun"
            },
            {
                "word": "ADC",
                "pos": "noun"
            },
            {
                "word": "add",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a piece of software that removes the advertisements from a web page when you view it",
                    "vi": "một phần mềm loại bỏ các quảng cáo khỏi một trang web khi bạn xem nó"
                },
                "examples": [
                    {
                        "en": "Widespread use of ad blockers could pose a threat to the way many websites are currently funded.",
                        "vi": "Việc sử dụng rộng rãi các trình chặn quảng cáo có thể gây ra mối đe dọa đối với cách nhiều trang web hiện đang được cấp vốn."
                    }
                ]
            }
        ]
    },
    {
        "id": "84ed8573976c4dedad8c94a7eee96f2d",
        "word": "address bar",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/əˈdres bɑː(r)/",
            "us": "/əˈdres bɑːr/"
        },
        "nearby": [
            {
                "word": "address",
                "pos": "verb"
            },
            {
                "word": "addressable",
                "pos": "adjective"
            },
            {
                "word": "address bar",
                "pos": "noun"
            },
            {
                "word": "address book",
                "pos": "noun"
            },
            {
                "word": "addressee",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a line near the top of a page on an internet browser where you can type in the address of a website or where the website address is displayed",
                    "vi": "một dòng gần đầu trang trên trình duyệt internet nơi bạn có thể nhập địa chỉ của một trang web hoặc nơi địa chỉ trang web được hiển thị"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "e59ca03c23d740d7821418aa5d183fef",
        "word": "ADSL",
        "pos": "abbreviation",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌeɪ diː es ˈel/",
            "us": "/ˌeɪ diː es ˈel/"
        },
        "nearby": [
            {
                "word": "adroitly",
                "pos": "adverb"
            },
            {
                "word": "adroitness",
                "pos": "noun"
            },
            {
                "word": "ADSL",
                "pos": "abbreviation"
            },
            {
                "word": "adsorb",
                "pos": "verb"
            },
            {
                "word": "adsorbent",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "asymmetric digital subscriber line (a system for connecting a computer to the internet using a phone line)",
                    "vi": "đường dây thuê bao kỹ thuật số không đối xứng (hệ thống kết nối máy tính với internet bằng đường dây điện thoại)"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "dc665196d1434775b8d7b70d98969096",
        "word": "anonymize",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/əˈnɒnɪmaɪz/",
            "us": "/əˈnɑːnɪmaɪz/"
        },
        "nearby": [
            {
                "word": "anonymity",
                "pos": "noun"
            },
            {
                "word": "anonymization",
                "pos": "noun"
            },
            {
                "word": "anonymize",
                "pos": "verb"
            },
            {
                "word": "anonymous",
                "pos": "adjective"
            },
            {
                "word": "anonymous FTP",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "if you anonymize a test result, especially a medical test result, you remove any information that shows who it belongs to",
                    "vi": "nếu bạn ẩn danh một kết quả xét nghiệm, đặc biệt là kết quả xét nghiệm y tế, bạn sẽ xóa mọi thông tin cho biết kết quả đó thuộc về ai"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "if you anonymize data that is sent or received over the internet, you remove any information that identifies which particular computer that data originally came from",
                    "vi": "nếu bạn ẩn danh dữ liệu được gửi hoặc nhận qua internet, bạn sẽ xóa mọi thông tin xác định máy tính cụ thể nào mà dữ liệu ban đầu đến từ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "ddc9f19291334998a1ee223848cdea92",
        "word": "bandwidth",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbændwɪdθ/",
            "us": "/ˈbændwɪdθ/"
        },
        "nearby": [
            {
                "word": "band together",
                "pos": "phrasal verb"
            },
            {
                "word": "bandwagon",
                "pos": "noun"
            },
            {
                "word": "bandwidth",
                "pos": "noun"
            },
            {
                "word": "bandy",
                "pos": "adjective"
            },
            {
                "word": "bandy",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a band of frequencies used for sending electronic signals",
                    "vi": "một dải tần số được sử dụng để gửi tín hiệu điện tử"
                },
                "examples": [
                    {
                        "en": "bandwidths in the range of 50–70 Hz",
                        "vi": "băng thông trong khoảng 50–70 Hz"
                    }
                ]
            },
            {
                "define": {
                    "en": "a measurement of the amount of information that a particular computer network or internet connection can send in a particular time. It is often measured in bits per second.",
                    "vi": "phép đo lượng thông tin mà một mạng máy tính hoặc kết nối internet cụ thể có thể gửi trong một thời gian cụ thể. Nó thường được đo bằng bit trên giây."
                },
                "examples": [
                    {
                        "en": "Upgrade to a higher bandwidth to increase your download limits.",
                        "vi": "Nâng cấp lên băng thông cao hơn để tăng giới hạn tải xuống của bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "the energy or capacity that you need to do something",
                    "vi": "năng lượng hoặc năng lực mà bạn cần để làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "The team does not have the bandwidth to take on new projects at the moment.",
                        "vi": "Hiện tại, nhóm không có đủ băng thông để thực hiện các dự án mới."
                    }
                ]
            }
        ]
    },
    {
        "id": "e9553c679d51412b9d8b625b61503318",
        "word": "carrier",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkæriə(r)/",
            "us": "/ˈkæriər/"
        },
        "nearby": [
            {
                "word": "carriageway",
                "pos": "noun"
            },
            {
                "word": "Carrie",
                "pos": ""
            },
            {
                "word": "carrier",
                "pos": "noun"
            },
            {
                "word": "carrier bag",
                "pos": "noun"
            },
            {
                "word": "carrier pigeon",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a company that carries goods or passengers from one place to another, especially by air",
                    "vi": "một công ty vận chuyển hàng hóa hoặc hành khách từ nơi này đến nơi khác, đặc biệt là bằng đường hàng không"
                },
                "examples": [
                    {
                        "en": "Delta Air Lines, the third-largest carrier in the US",
                        "vi": "Delta Air Lines, hãng hàng không lớn thứ ba ở Mỹ"
                    }
                ]
            },
            {
                "define": {
                    "en": "a military vehicle or ship that carries soldiers or equipment from one place to another",
                    "vi": "một phương tiện quân sự hoặc tàu chở binh lính hoặc thiết bị từ nơi này đến nơi khác"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a person or animal that passes a disease to other people or animals but does not suffer from it",
                    "vi": "một người hoặc động vật truyền bệnh cho người hoặc động vật khác nhưng không mắc bệnh"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a metal frame that is fixed to a bicycle and used for carrying bags",
                    "vi": "khung kim loại được cố định vào xe đạp và dùng để đựng túi xách"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a person or thing that carries something",
                    "vi": "một người hoặc một vật mang cái gì đó"
                },
                "examples": [
                    {
                        "en": "Aquarius, the Water Carrier",
                        "vi": "Bảo bình, Người vận chuyển nước"
                    },
                    {
                        "en": "a baby carrier (= for carrying a baby on your back or in front of you)",
                        "vi": "địu em bé (= để địu em bé trên lưng hoặc trước mặt bạn)"
                    }
                ]
            },
            {
                "define": {
                    "en": "a paper or plastic bag for carrying shopping",
                    "vi": "một túi giấy hoặc nhựa để mang đi mua sắm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a company that provides a phone or internet service",
                    "vi": "một công ty cung cấp dịch vụ điện thoại hoặc internet"
                },
                "examples": [
                    {
                        "en": "a telecoms carrier",
                        "vi": "một hãng viễn thông"
                    },
                    {
                        "en": "mobile-phone carriers",
                        "vi": "nhà cung cấp dịch vụ điện thoại di động"
                    }
                ]
            }
        ]
    },
    {
        "id": "3162957d65924e3e90c85a55777dcc05",
        "word": "clickjacking",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈklɪkdʒækɪŋ/",
            "us": "/ˈklɪkdʒækɪŋ/"
        },
        "nearby": [
            {
                "word": "clickbait",
                "pos": "noun"
            },
            {
                "word": "clicker",
                "pos": "noun"
            },
            {
                "word": "clickjacking",
                "pos": "noun"
            },
            {
                "word": "click rate",
                "pos": "noun"
            },
            {
                "word": "clickstream",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the practice of adding hidden hyperlinks to documents on the internet, causing users to make purchases, perform actions on social media sites, etc. without their knowledge",
                    "vi": "thực hành thêm các siêu liên kết ẩn vào các tài liệu trên internet, khiến người dùng mua hàng, thực hiện các hành động trên các trang mạng xã hội, v.v. mà họ không hề hay biết"
                },
                "examples": [
                    {
                        "en": "a clickjacking attack",
                        "vi": "một cuộc tấn công clickjacking"
                    }
                ]
            }
        ]
    },
    {
        "id": "3e70e9922ec14159936ccca8395fa23b",
        "word": "clickstream",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈklɪkstriːm/",
            "us": "/ˈklɪkstriːm/"
        },
        "nearby": [
            {
                "word": "clickjacking",
                "pos": "noun"
            },
            {
                "word": "click rate",
                "pos": "noun"
            },
            {
                "word": "clickstream",
                "pos": "noun"
            },
            {
                "word": "click through",
                "pos": "phrasal verb"
            },
            {
                "word": "click-through",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a record of all the websites a person visits when spending time on the internet",
                    "vi": "bản ghi của tất cả các trang web mà một người truy cập khi dành thời gian trên internet"
                },
                "examples": [
                    {
                        "en": "Marketing companies find it useful to analyse clickstream data.",
                        "vi": "Các công ty tiếp thị thấy hữu ích khi phân tích dữ liệu luồng nhấp chuột."
                    }
                ]
            }
        ]
    },
    {
        "id": "a00f76371e92407badaed9fcab7f0c3e",
        "word": "cybernaut",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsaɪbənɔːt/",
            "us": "/ˈsaɪbərnɔːt/"
        },
        "nearby": [
            {
                "word": "the Cybermen",
                "pos": "noun"
            },
            {
                "word": "Cyber Monday",
                "pos": "noun"
            },
            {
                "word": "cybernaut",
                "pos": "noun"
            },
            {
                "word": "cybernetic",
                "pos": "adjective"
            },
            {
                "word": "cybernetics",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who wears special devices in order to experience virtual reality",
                    "vi": "một người đeo thiết bị đặc biệt để trải nghiệm thực tế ảo"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a regular or expert user of the internet",
                    "vi": "một người dùng thường xuyên hoặc chuyên gia của Internet"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "02fe04981fe54587bdf000e7487664a7",
        "word": "cybersex",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsaɪbəseks/",
            "us": "/ˈsaɪbərseks/"
        },
        "nearby": [
            {
                "word": "cybernetics",
                "pos": "noun"
            },
            {
                "word": "cyberpunk",
                "pos": "noun"
            },
            {
                "word": "cybersex",
                "pos": "noun"
            },
            {
                "word": "cyberspace",
                "pos": "noun"
            },
            {
                "word": "cybersquatter",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "communication between people using the internet that makes them sexually excited",
                    "vi": "giao tiếp giữa những người sử dụng Internet khiến họ kích thích tình dục"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "10d95fcadc3342ae8ade36c743b86504",
        "word": "dial-up",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈdaɪəl ʌp/",
            "us": "/ˈdaɪəl ʌp/"
        },
        "nearby": [
            {
                "word": "dialogue",
                "pos": "noun"
            },
            {
                "word": "dial up",
                "pos": "phrasal verb"
            },
            {
                "word": "dial-up",
                "pos": "adjective"
            },
            {
                "word": "dialysis",
                "pos": "noun"
            },
            {
                "word": "diamanté",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "using a phone line and a modem to connect your computer to the internet",
                    "vi": "sử dụng đường dây điện thoại và modem để kết nối máy tính của bạn với Internet"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a02e61854b0749b1969944a515f79e16",
        "word": "dial up",
        "pos": "phrasal verb",
        "level": "c2",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "dialog box",
                "pos": "noun"
            },
            {
                "word": "dialogue",
                "pos": "noun"
            },
            {
                "word": "dial up",
                "pos": "phrasal verb"
            },
            {
                "word": "dial-up",
                "pos": "adjective"
            },
            {
                "word": "dialysis",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to connect to a computer system using a phone line",
                    "vi": "kết nối với hệ thống máy tính bằng đường dây điện thoại"
                },
                "examples": [
                    {
                        "en": "Back then, you still had to dial up to the internet at 5p a minute.",
                        "vi": "Hồi đó, bạn vẫn phải quay số vào Internet với tốc độ 5p một phút."
                    },
                    {
                        "en": "I tried to dial up a connection.",
                        "vi": "Tôi đã cố gắng gọi một kết nối."
                    }
                ]
            },
            {
                "define": {
                    "en": "to order something by phone, to be delivered immediately",
                    "vi": "để đặt một cái gì đó qua điện thoại, để được giao ngay lập tức"
                },
                "examples": [
                    {
                        "en": "If I'm too tired to cook, I just dial up a pizza.",
                        "vi": "Nếu tôi quá mệt để nấu ăn, tôi chỉ cần gọi một chiếc bánh pizza."
                    }
                ]
            },
            {
                "define": {
                    "en": "to increase the noise, heat, etc. produced by a piece of equipment by moving its controls",
                    "vi": "để tăng tiếng ồn, nhiệt, v.v. do một phần thiết bị tạo ra bằng cách di chuyển các bộ điều khiển của nó"
                },
                "examples": [
                    {
                        "en": "Dial up the volume.",
                        "vi": "Tăng âm lượng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to increase the amount, degree or power of a quality",
                    "vi": "để tăng số lượng, mức độ hoặc sức mạnh của chất lượng"
                },
                "examples": [
                    {
                        "en": "She gradually dialled up the pressure on the rest of the team.",
                        "vi": "Cô ấy dần dần gây áp lực lên các thành viên còn lại trong đội."
                    }
                ]
            }
        ]
    },
    {
        "id": "cb4865fca031496d84a56e5913f309a5",
        "word": "eBay",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈiːbeɪ/",
            "us": "/ˈiːbeɪ/"
        },
        "nearby": [
            {
                "word": "eavesdropper",
                "pos": "noun"
            },
            {
                "word": "eavestrough",
                "pos": "noun"
            },
            {
                "word": "eBay",
                "pos": "verb"
            },
            {
                "word": "eBay",
                "pos": "noun"
            },
            {
                "word": "ebb",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to buy or sell goods on the website called eBay",
                    "vi": "để mua hoặc bán hàng hóa trên trang web có tên eBay"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "2dc50b15c6c74a848c7654f0ed0dedfe",
        "word": "ego-surfing",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈiːɡəʊ sɜːfɪŋ/",
            "us": "/ˈiːɡəʊ sɜːrfɪŋ/"
        },
        "nearby": [
            {
                "word": "egomaniac",
                "pos": "noun"
            },
            {
                "word": "egomaniacal",
                "pos": "adjective"
            },
            {
                "word": "ego-surfing",
                "pos": "noun"
            },
            {
                "word": "egotistically",
                "pos": "adverb"
            },
            {
                "word": "ego trip",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the activity of searching the internet to find places where your own name has been mentioned",
                    "vi": "hoạt động tìm kiếm trên internet để tìm những nơi mà tên của chính bạn đã được đề cập"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a675b33b73604d6886da4435d47d3b7c",
        "word": "feed",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/fiːd/",
            "us": "/fiːd/"
        },
        "nearby": [
            {
                "word": "feebly",
                "pos": "adverb"
            },
            {
                "word": "feed",
                "pos": "verb"
            },
            {
                "word": "feed",
                "pos": "noun"
            },
            {
                "word": "feed back",
                "pos": "phrasal verb"
            },
            {
                "word": "feedback",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a meal of milk for a young baby; a meal for an animal",
                    "vi": "một bữa ăn sữa cho trẻ nhỏ; một bữa ăn cho một con vật"
                },
                "examples": [
                    {
                        "en": "her morning feed",
                        "vi": "thức ăn buổi sáng của cô ấy"
                    }
                ]
            },
            {
                "define": {
                    "en": "food for animals or plants",
                    "vi": "thức ăn cho động vật hoặc thực vật"
                },
                "examples": [
                    {
                        "en": "a sack of animal feed",
                        "vi": "một bao tải thức ăn gia súc"
                    },
                    {
                        "en": "winter feed for the horses",
                        "vi": "thức ăn mùa đông cho ngựa"
                    },
                    {
                        "en": "liquid tomato feed",
                        "vi": "thức ăn cà chua lỏng"
                    }
                ]
            },
            {
                "define": {
                    "en": "material supplied to a machine",
                    "vi": "vật liệu cung cấp cho máy"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a pipe, device, etc. that supplies a machine with something",
                    "vi": "một đường ống, thiết bị, v.v. cung cấp cho máy một cái gì đó"
                },
                "examples": [
                    {
                        "en": "The printer has an automatic paper feed.",
                        "vi": "Máy in có bộ nạp giấy tự động."
                    },
                    {
                        "en": "feed to something the cold feed to the water cylinder",
                        "vi": "cấp cho một thứ gì đó cấp lạnh cho xi lanh nước"
                    }
                ]
            },
            {
                "define": {
                    "en": "a large meal",
                    "vi": "một bữa ăn lớn"
                },
                "examples": [
                    {
                        "en": "They needed a bath and a good feed.",
                        "vi": "Họ cần một bồn tắm và một thức ăn tốt."
                    }
                ]
            },
            {
                "define": {
                    "en": "television programmes that are sent from a central station to other stations in a network; the system of sending out these programmes",
                    "vi": "các chương trình truyền hình được gửi từ một đài trung ương đến các đài khác trong mạng; hệ thống gửi các chương trình này"
                },
                "examples": [
                    {
                        "en": "network feed",
                        "vi": "nguồn cấp dữ liệu mạng"
                    }
                ]
            },
            {
                "define": {
                    "en": "a special feature on a blog, news website, social media site, etc. that allows you to see new information that has been added without having to visit the website, usually using a feed reader (= a piece of software that displays this information)",
                    "vi": "một tính năng đặc biệt trên blog, trang web tin tức, trang web truyền thông xã hội, v.v. cho phép bạn xem thông tin mới đã được thêm vào mà không cần phải truy cập trang web, thường sử dụng trình đọc nguồn cấp dữ liệu (= một phần mềm hiển thị thông tin này)"
                },
                "examples": [
                    {
                        "en": "an RSS feed",
                        "vi": "một nguồn cấp dữ liệu RSS"
                    },
                    {
                        "en": "the film's official Twitter feed",
                        "vi": "nguồn cấp dữ liệu Twitter chính thức của bộ phim"
                    }
                ]
            }
        ]
    },
    {
        "id": "d026eeab33fd4af3ad46252ccaf073d5",
        "word": "feed reader",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈfiːd riːdə(r)/",
            "us": "/ˈfiːd riːdər/"
        },
        "nearby": [
            {
                "word": "feed off",
                "pos": "phrasal verb"
            },
            {
                "word": "feed on",
                "pos": "phrasal verb"
            },
            {
                "word": "feed reader",
                "pos": "noun"
            },
            {
                "word": "feedstuff",
                "pos": "noun"
            },
            {
                "word": "feed through",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a piece of software that you use to see new information that has been added on a blog, news website, social media site, etc. without having to visit the website",
                    "vi": "một phần mềm mà bạn sử dụng để xem thông tin mới đã được thêm vào blog, trang web tin tức, trang web truyền thông xã hội, v.v. mà không cần phải truy cập trang web"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "4644b5fc7fc443b89b4cfc5c5c0db71f",
        "word": "flame",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/fleɪm/",
            "us": "/fleɪm/"
        },
        "nearby": [
            {
                "word": "flamboyant",
                "pos": "adjective"
            },
            {
                "word": "flamboyantly",
                "pos": "adverb"
            },
            {
                "word": "flame",
                "pos": "noun"
            },
            {
                "word": "flame",
                "pos": "verb"
            },
            {
                "word": "flamenco",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a hot bright stream of burning gas that comes from something that is on fire",
                    "vi": "một dòng khí đốt sáng nóng phát ra từ một thứ gì đó đang cháy"
                },
                "examples": [
                    {
                        "en": "the tiny yellow flame of a match",
                        "vi": "ngọn lửa nhỏ màu vàng của que diêm"
                    },
                    {
                        "en": "The room was filled with smoke and flames.",
                        "vi": "Căn phòng ngập trong khói và lửa."
                    },
                    {
                        "en": "to douse/extinguish the flames",
                        "vi": "dập tắt / dập tắt ngọn lửa"
                    },
                    {
                        "en": "in flames The building was in flames (= was burning).",
                        "vi": "trong ngọn lửa Tòa nhà đã bị cháy (= đang cháy)."
                    },
                    {
                        "en": "The plane burst into flame(s) (= suddenly began burning strongly).",
                        "vi": "Máy bay bùng cháy (các) ngọn lửa (= đột ngột bắt đầu bốc cháy mạnh)."
                    },
                    {
                        "en": "Everything went up in flames (= was destroyed by fire).",
                        "vi": "Mọi thứ bốc lên trong lửa (= bị lửa thiêu rụi)."
                    },
                    {
                        "en": "Heat the olive oil over a moderate flame (= on a gas cooker/stove).",
                        "vi": "Đun nóng dầu ô liu trên ngọn lửa vừa phải (= trên bếp ga / bếp ga)."
                    },
                    {
                        "en": "The curtains were enveloped in a sheet of flame.",
                        "vi": "Những tấm màn che trong một ngọn lửa."
                    },
                    {
                        "en": "(British English) Never smoke or use spray paint near a naked flame.",
                        "vi": "(Tiếng Anh Anh) Không bao giờ hút thuốc hoặc sử dụng sơn phun gần ngọn lửa trần."
                    },
                    {
                        "en": "(North American English) an open flame",
                        "vi": "(Tiếng Anh Bắc Mỹ) một ngọn lửa mở"
                    }
                ]
            },
            {
                "define": {
                    "en": "a bright red or orange colour",
                    "vi": "màu đỏ tươi hoặc màu cam"
                },
                "examples": [
                    {
                        "en": "a flame-red car",
                        "vi": "một chiếc xe lửa đỏ"
                    }
                ]
            },
            {
                "define": {
                    "en": "a very strong feeling",
                    "vi": "một cảm giác rất mạnh"
                },
                "examples": [
                    {
                        "en": "His childhood interest in the game had ignited a flame of passion for football.",
                        "vi": "Niềm yêu thích game thuở nhỏ của anh đã thổi bùng lên ngọn lửa đam mê bóng đá."
                    }
                ]
            },
            {
                "define": {
                    "en": "an angry or offensive message sent to somebody by email or on the internet, typically in quick response to another message",
                    "vi": "một tin nhắn tức giận hoặc xúc phạm được gửi đến ai đó qua email hoặc trên internet, thường là phản hồi nhanh cho một tin nhắn khác"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to make a feeling such as anger, hate, etc. worse",
                    "vi": "làm cho cảm giác như tức giận, ghét bỏ, v.v. tồi tệ hơn"
                },
                "examples": [
                    {
                        "en": "His writings fanned the flames of racism.",
                        "vi": "Các bài viết của ông đã thổi bùng ngọn lửa phân biệt chủng tộc."
                    }
                ]
            }
        ]
    },
    {
        "id": "62e8c6e1a2f04061929dc2452f6a5bcb",
        "word": "flame",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/fleɪm/",
            "us": "/fleɪm/"
        },
        "nearby": [
            {
                "word": "flamboyantly",
                "pos": "adverb"
            },
            {
                "word": "flame",
                "pos": "noun"
            },
            {
                "word": "flame",
                "pos": "verb"
            },
            {
                "word": "flamenco",
                "pos": "noun"
            },
            {
                "word": "flameproof",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to burn with a bright flame",
                    "vi": "đốt cháy với ngọn lửa sáng"
                },
                "examples": [
                    {
                        "en": "The logs flamed on the hearth.",
                        "vi": "Các khúc gỗ cháy trên lò sưởi."
                    },
                    {
                        "en": "(figurative) Hope flamed in her.",
                        "vi": "(nghĩa bóng) Hy vọng bùng lên trong cô ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to become red as a result of a strong emotion; to make something become red",
                    "vi": "trở nên đỏ như một kết quả của một cảm xúc mạnh mẽ; để làm cho một cái gì đó trở nên đỏ"
                },
                "examples": [
                    {
                        "en": "Her cheeks flamed with rage.",
                        "vi": "Hai má cô bừng bừng cơn thịnh nộ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to send somebody an angry or offensive message by email or on the internet",
                    "vi": "gửi cho ai đó một thông điệp tức giận hoặc xúc phạm qua email hoặc trên internet"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "54300a23151e4934b32cef7a2d2ba15f",
        "word": "hook up",
        "pos": "phrasal verb",
        "level": "c2",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "hookey",
                "pos": ""
            },
            {
                "word": "hook shot",
                "pos": "noun"
            },
            {
                "word": "hook up",
                "pos": "phrasal verb"
            },
            {
                "word": "hook-up",
                "pos": "noun"
            },
            {
                "word": "hook up with",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to connect somebody/something to a piece of electronic equipment, to a power supply or to the internet",
                    "vi": "để kết nối ai đó / cái gì đó với một phần thiết bị điện tử, với nguồn điện hoặc với internet"
                },
                "examples": [
                    {
                        "en": "She was then hooked up to an IV drip.",
                        "vi": "Sau đó, cô ấy đã được nối với một ống nhỏ giọt IV."
                    },
                    {
                        "en": "Check that the computer is hooked up to the printer.",
                        "vi": "Kiểm tra xem máy tính đã được kết nối với máy in chưa."
                    },
                    {
                        "en": "A large proportion of the nation's households are hooked up to the internet.",
                        "vi": "Một tỷ lệ lớn các hộ gia đình của quốc gia này được kết nối với Internet."
                    }
                ]
            }
        ]
    },
    {
        "id": "7e6b2146f99c4f8c9b6f1bb89aeb4851",
        "word": "hotspot",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈhɒtspɒt/",
            "us": "/ˈhɑːtspɑːt/"
        },
        "nearby": [
            {
                "word": "hotshot",
                "pos": "noun"
            },
            {
                "word": "hotshot",
                "pos": "adjective"
            },
            {
                "word": "hotspot",
                "pos": "noun"
            },
            {
                "word": "hot stuff",
                "pos": "noun"
            },
            {
                "word": "hot-swap",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a place where fighting is common, especially for political reasons",
                    "vi": "một nơi thường xảy ra đánh nhau, đặc biệt là vì lý do chính trị"
                },
                "examples": [
                    {
                        "en": "UN peacekeeping forces have helped ease tensions in world hotspots since 1948.",
                        "vi": "Lực lượng gìn giữ hòa bình của Liên hợp quốc đã giúp xoa dịu căng thẳng tại các điểm nóng trên thế giới kể từ năm 1948."
                    }
                ]
            },
            {
                "define": {
                    "en": "a place with a particular kind of danger or problem",
                    "vi": "một nơi có một loại nguy hiểm hoặc vấn đề cụ thể"
                },
                "examples": [
                    {
                        "en": "They identified eight pollution hotspots at the mouth of the Thames.",
                        "vi": "Họ đã xác định được 8 điểm nóng về ô nhiễm ở cửa sông Thames."
                    }
                ]
            },
            {
                "define": {
                    "en": "a place where there is a lot of activity or entertainment",
                    "vi": "một nơi có rất nhiều hoạt động hoặc giải trí"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a place that is very hot and dry, where a fire has been burning or is likely to start",
                    "vi": "một nơi rất nóng và khô, nơi ngọn lửa đã bùng cháy hoặc có khả năng bùng phát"
                },
                "examples": [
                    {
                        "en": "Fire crews worked to douse hotspots left by two fires that consumed acres of forest.",
                        "vi": "Các đội cứu hỏa đã làm việc để khắc phục các điểm nóng do hai vụ cháy đã thiêu rụi hàng mẫu rừng."
                    }
                ]
            },
            {
                "define": {
                    "en": "an area on a computer screen that you can click on to start an operation such as loading a file",
                    "vi": "một khu vực trên màn hình máy tính mà bạn có thể nhấp vào để bắt đầu thao tác, chẳng hạn như tải tệp"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a place in a hotel, restaurant, airport, etc. that is fitted with a special device that enables you to connect a computer to the internet without using wires",
                    "vi": "một địa điểm trong khách sạn, nhà hàng, sân bay, v.v. được gắn một thiết bị đặc biệt cho phép bạn kết nối máy tính với Internet mà không cần sử dụng dây"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "fcbcdb281e5e4af99ed7876e279f7893",
        "word": "IoT",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌaɪ əʊ ˈtiː/",
            "us": "/ˌaɪ əʊ ˈtiː/"
        },
        "nearby": [
            {
                "word": "ionizer",
                "pos": "noun"
            },
            {
                "word": "the ionosphere",
                "pos": "noun"
            },
            {
                "word": "IoT",
                "pos": "noun"
            },
            {
                "word": "iota",
                "pos": "noun"
            },
            {
                "word": "IOU",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the connection of devices within everyday objects via the internet, enabling them to share data (the abbreviation for internet of things)",
                    "vi": "kết nối của các thiết bị trong các đồ vật hàng ngày thông qua internet, cho phép chúng chia sẻ dữ liệu (chữ viết tắt của internet of things)"
                },
                "examples": [
                    {
                        "en": "This enables developers to connect IoT devices to the cloud.",
                        "vi": "Điều này cho phép các nhà phát triển kết nối các thiết bị IoT với đám mây."
                    }
                ]
            }
        ]
    },
    {
        "id": "311db4d20e9445d8bfe8da9679bf5765",
        "word": "IP address",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌaɪ ˈpiː ədres/",
            "us": "/ˌaɪ ˈpiː ədres/"
        },
        "nearby": [
            {
                "word": "IPA",
                "pos": "abbreviation"
            },
            {
                "word": "iPad",
                "pos": "noun"
            },
            {
                "word": "IP address",
                "pos": "noun"
            },
            {
                "word": "iPhone",
                "pos": "noun"
            },
            {
                "word": "IPM",
                "pos": "abbreviation"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a series of numbers separated by dots (= round marks) that identifies a particular computer connected to the internet",
                    "vi": "một loạt các số được phân tách bằng dấu chấm (= dấu tròn) xác định một máy tính cụ thể được kết nối với Internet"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "ba7b1225b5364798a58193e809f1f737",
        "word": "ISP",
        "pos": "abbreviation",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌaɪ es ˈpiː/",
            "us": "/ˌaɪ es ˈpiː/"
        },
        "nearby": [
            {
                "word": "isotonic",
                "pos": "adjective"
            },
            {
                "word": "isotope",
                "pos": "noun"
            },
            {
                "word": "ISP",
                "pos": "abbreviation"
            },
            {
                "word": "I-spy",
                "pos": "noun"
            },
            {
                "word": "Israel",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "internet service provider (a company that provides you with an internet connection and services such as email, etc.)",
                    "vi": "nhà cung cấp dịch vụ internet (công ty cung cấp cho bạn kết nối internet và các dịch vụ như email, v.v.)"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "4f60b7aecb9244b0977cbfbfa03ccef1",
        "word": "lurk",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/lɜːk/",
            "us": "/lɜːrk/"
        },
        "nearby": [
            {
                "word": "lurid",
                "pos": "adjective"
            },
            {
                "word": "luridly",
                "pos": "adverb"
            },
            {
                "word": "lurk",
                "pos": "verb"
            },
            {
                "word": "lurk",
                "pos": "noun"
            },
            {
                "word": "lurker",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to wait somewhere secretly, especially because you are going to do something bad or illegal",
                    "vi": "chờ đợi một nơi nào đó bí mật, đặc biệt là vì bạn sắp làm điều gì đó xấu hoặc bất hợp pháp"
                },
                "examples": [
                    {
                        "en": "Why are you lurking around outside my house?",
                        "vi": "Tại sao bạn lại quanh quẩn bên ngoài nhà tôi?"
                    },
                    {
                        "en": "A crocodile was lurking just below the surface.",
                        "vi": "Một con cá sấu đang ẩn nấp ngay dưới bề mặt."
                    }
                ]
            },
            {
                "define": {
                    "en": "when something unpleasant or dangerous lurks, it is present but not in an obvious way",
                    "vi": "khi có điều gì đó khó chịu hoặc nguy hiểm rình rập, nó hiện diện nhưng không theo cách rõ ràng"
                },
                "examples": [
                    {
                        "en": "At night, danger lurks in these streets.",
                        "vi": "Vào ban đêm, nguy hiểm luôn rình rập ở những con phố này."
                    }
                ]
            },
            {
                "define": {
                    "en": "to read a discussion in a chat room, etc. on the internet, without taking part in it yourself",
                    "vi": "để đọc một cuộc thảo luận trong phòng trò chuyện, v.v. trên Internet mà không cần tự mình tham gia vào cuộc thảo luận đó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "5949254c60cc4073b6ea62fb8dae750b",
        "word": "netiquette",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈnetɪkət/",
            "us": "/ˈnetɪkət/"
        },
        "nearby": [
            {
                "word": "(the) Netherlands",
                "pos": "noun"
            },
            {
                "word": "the netherworld",
                "pos": "noun"
            },
            {
                "word": "netiquette",
                "pos": "noun"
            },
            {
                "word": "netizen",
                "pos": "noun"
            },
            {
                "word": "netminder",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the rules of correct or polite behaviour among people using the internet",
                    "vi": "các quy tắc cư xử đúng mực hoặc lịch sự giữa những người sử dụng Internet"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "7eb35757070b42ef98a0c2c2415a3956",
        "word": "netizen",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈnetɪzn/",
            "us": "/ˈnetɪzn/"
        },
        "nearby": [
            {
                "word": "the netherworld",
                "pos": "noun"
            },
            {
                "word": "netiquette",
                "pos": "noun"
            },
            {
                "word": "netizen",
                "pos": "noun"
            },
            {
                "word": "netminder",
                "pos": "noun"
            },
            {
                "word": "net neutrality",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who uses the internet a lot",
                    "vi": "một người sử dụng internet nhiều"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "8e04d5751ad6400a893c17e733e05762",
        "word": "ping",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/pɪŋ/",
            "us": "/pɪŋ/"
        },
        "nearby": [
            {
                "word": "Pinewood Studios",
                "pos": ""
            },
            {
                "word": "ping",
                "pos": "noun"
            },
            {
                "word": "ping",
                "pos": "verb"
            },
            {
                "word": "pinger",
                "pos": "noun"
            },
            {
                "word": "ping-pong",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to make a short, high ringing sound; to make something produce this sound",
                    "vi": "để tạo ra một âm thanh chuông cao, ngắn; để tạo ra thứ gì đó tạo ra âm thanh này"
                },
                "examples": [
                    {
                        "en": "The microwave pinged.",
                        "vi": "Lò vi sóng kêu."
                    },
                    {
                        "en": "+ adv./prep. He threw himself to the ground as bullets pinged off the metal behind him.",
                        "vi": "Err:509"
                    },
                    {
                        "en": "ping something You have to ping the bell on the desk to get someone to come and attend to you.",
                        "vi": "ping cái gì đó Bạn phải ping cái chuông trên bàn để có người đến và theo dõi bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make knocking sounds because the fuel is not burning correctly",
                    "vi": "tạo ra âm thanh gõ vì nhiên liệu đốt không chính xác"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to test whether an internet connection is working by sending a signal to a computer and waiting for a reply",
                    "vi": "để kiểm tra xem kết nối internet có hoạt động hay không bằng cách gửi tín hiệu đến máy tính và chờ phản hồi"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to send an email or a text message to somebody",
                    "vi": "để gửi một email hoặc một tin nhắn văn bản cho ai đó"
                },
                "examples": [
                    {
                        "en": "I'll ping it to you later.",
                        "vi": "Tôi sẽ ping nó cho bạn sau."
                    },
                    {
                        "en": "Ping me later in the week.",
                        "vi": "Ping cho tôi vào cuối tuần."
                    }
                ]
            }
        ]
    },
    {
        "id": "62a884d6cbc5448f94ff75d696364596",
        "word": "push technology",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpʊʃ teknɒlədʒi/",
            "us": "/ˈpʊʃ teknɑːlədʒi/"
        },
        "nearby": [
            {
                "word": "push-start",
                "pos": "noun"
            },
            {
                "word": "push-start",
                "pos": "verb"
            },
            {
                "word": "push technology",
                "pos": "noun"
            },
            {
                "word": "push through",
                "pos": "phrasal verb"
            },
            {
                "word": "push-up",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a service that allows internet users to keep receiving a particular type of information without having to request it each time",
                    "vi": "một dịch vụ cho phép người dùng internet tiếp tục nhận một loại thông tin cụ thể mà không cần phải yêu cầu mỗi lần"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a7d7394044534e58ac1ffb165e22f683",
        "word": "silver surfer",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌsɪlvə ˈsɜːfə(r)/",
            "us": "/ˌsɪlvər ˈsɜːrfər/"
        },
        "nearby": [
            {
                "word": "silversmith",
                "pos": "noun"
            },
            {
                "word": "Silverstone",
                "pos": ""
            },
            {
                "word": "silver surfer",
                "pos": "noun"
            },
            {
                "word": "silvertail",
                "pos": "noun"
            },
            {
                "word": "silver tongue",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an old person who spends a lot of time using the internet",
                    "vi": "một người già dành nhiều thời gian sử dụng internet"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "7e790171866c4b319157a65c1463230b",
        "word": "sock puppet",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsɒk pʌpɪt/",
            "us": "/ˈsɑːk pʌpɪt/"
        },
        "nearby": [
            {
                "word": "socket",
                "pos": "noun"
            },
            {
                "word": "socking",
                "pos": "adverb"
            },
            {
                "word": "sock puppet",
                "pos": "noun"
            },
            {
                "word": "sock puppetry",
                "pos": "noun"
            },
            {
                "word": "sod",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a type of puppet, made from a sock, that you put over your hand",
                    "vi": "một loại con rối, được làm từ một chiếc tất mà bạn đặt trên tay"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a person whose actions are controlled by another",
                    "vi": "một người có hành động bị kiểm soát bởi người khác"
                },
                "examples": [
                    {
                        "en": "He accused the politician of being a capitalist sock puppet.",
                        "vi": "Ông cáo buộc chính trị gia là một con rối vớ vẩn của tư bản."
                    }
                ]
            },
            {
                "define": {
                    "en": "a false online identity, usually created by a person or group in order to promote their own opinions",
                    "vi": "danh tính trực tuyến sai, thường được tạo bởi một người hoặc một nhóm để thúc đẩy ý kiến của riêng họ"
                },
                "examples": [
                    {
                        "en": "He created sock puppets to write positive comments about his blog posts.",
                        "vi": "Anh ấy đã tạo ra những con rối sock để viết những bình luận tích cực về các bài đăng trên blog của mình."
                    }
                ]
            }
        ]
    },
    {
        "id": "9c3e4cdc05c046b281bb6e3a0eeb96db",
        "word": "sock puppetry",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsɒk pʌpɪtri/",
            "us": "/ˈsɑːk pʌpɪtri/"
        },
        "nearby": [
            {
                "word": "socking",
                "pos": "adverb"
            },
            {
                "word": "sock puppet",
                "pos": "noun"
            },
            {
                "word": "sock puppetry",
                "pos": "noun"
            },
            {
                "word": "sod",
                "pos": "noun"
            },
            {
                "word": "sod",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the art and skill of making and using a type of puppet made from a sock, that you put over your hand",
                    "vi": "nghệ thuật và kỹ năng chế tạo và sử dụng một loại con rối làm từ một chiếc tất mà bạn đưa tay"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the act of creating and using a false online identity, usually in order to promote your own opinions",
                    "vi": "hành động tạo và sử dụng danh tính trực tuyến sai, thường là để thúc đẩy ý kiến của riêng bạn"
                },
                "examples": [
                    {
                        "en": "Sock puppetry can be used to artificially boost the support for a particular position or belief.",
                        "vi": "Sock rối có thể được sử dụng để tăng cường sự ủng hộ một cách giả tạo cho một vị trí hoặc niềm tin cụ thể."
                    }
                ]
            }
        ]
    },
    {
        "id": "d3ffeb59cb8145ac88db95f7f02424ac",
        "word": "troll",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/trɒl/",
            "us": "/trəʊl/"
        },
        "nearby": [
            {
                "word": "Trojan horse",
                "pos": "noun"
            },
            {
                "word": "troll",
                "pos": "noun"
            },
            {
                "word": "troll",
                "pos": "verb"
            },
            {
                "word": "trolley",
                "pos": "noun"
            },
            {
                "word": "trolleybus",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to catch fish by pulling a line with bait on it through the water behind a boat",
                    "vi": "bắt cá bằng cách kéo một dây có mồi trên đó qua mặt nước đằng sau một chiếc thuyền"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to search for or try to get something",
                    "vi": "để tìm kiếm hoặc cố gắng lấy một thứ gì đó"
                },
                "examples": [
                    {
                        "en": "troll something for something He trolled the internet for advice on the disease.",
                        "vi": "troll cái gì đó cho cái gì Anh ấy troll internet để xin lời khuyên về căn bệnh này."
                    },
                    {
                        "en": "troll for something Both candidates have been trolling for votes.",
                        "vi": "troll vì điều gì đó Cả hai ứng cử viên đều đã troll vì phiếu bầu."
                    }
                ]
            },
            {
                "define": {
                    "en": "to write false or offensive messages on the internet in order to make other people angry",
                    "vi": "viết những thông điệp sai trái hoặc xúc phạm trên internet để khiến người khác tức giận"
                },
                "examples": [
                    {
                        "en": "Someone keeps posting snide comments on the forum, trolling for a reaction.",
                        "vi": "Ai đó tiếp tục đăng những bình luận châm biếm trên diễn đàn, troll cho một phản ứng."
                    }
                ]
            }
        ]
    },
    {
        "id": "061f08eced304ee7b14c02b6ae96aff4",
        "word": "unboxing",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌʌnˈbɒksɪŋ/",
            "us": "/ˌʌnˈbɑːksɪŋ/"
        },
        "nearby": [
            {
                "word": "unbounded",
                "pos": "adjective"
            },
            {
                "word": "unbowed",
                "pos": "adjective"
            },
            {
                "word": "unboxing",
                "pos": "noun"
            },
            {
                "word": "unbranded",
                "pos": "adjective"
            },
            {
                "word": "unbreakable",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the process of removing a new product from the material it is packed in and examining its features, filmed and put on the internet",
                    "vi": "quy trình loại bỏ một sản phẩm mới khỏi vật liệu mà nó được đóng gói và kiểm tra các tính năng của nó, quay phim và đưa lên internet"
                },
                "examples": [
                    {
                        "en": "The site has a video of the product unboxing.",
                        "vi": "Trang web có một video về việc mở hộp sản phẩm."
                    },
                    {
                        "en": "Anyway, you can watch my unboxing video posted below this article.",
                        "vi": "Dù sao, bạn có thể xem video mở hộp của tôi được đăng bên dưới bài viết này."
                    }
                ]
            }
        ]
    },
    {
        "id": "267d3fc666744f90b3f10de2e5064fb5",
        "word": "webcast",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈwebkɑːst/",
            "us": "/ˈwebkæst/"
        },
        "nearby": [
            {
                "word": "web browser",
                "pos": "noun"
            },
            {
                "word": "webcam",
                "pos": "noun"
            },
            {
                "word": "webcast",
                "pos": "noun"
            },
            {
                "word": "web chat",
                "pos": "noun"
            },
            {
                "word": "webcomic",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a live broadcast that is sent out on the internet",
                    "vi": "một chương trình phát sóng trực tiếp được gửi trên internet"
                },
                "examples": [
                    {
                        "en": "We were able to watch a live webcast of the eclipse.",
                        "vi": "Chúng tôi đã có thể xem một webcast trực tiếp về nhật thực."
                    }
                ]
            }
        ]
    }
]