[
    {
        "id": "acc0f75b91d24657b8a7d0f4b80d3c0b",
        "word": "theatre",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/ˈθɪətə(r)/",
            "us": "/ˈθiːətər/"
        },
        "nearby": [
            {
                "word": "THE",
                "pos": ""
            },
            {
                "word": "Thea",
                "pos": ""
            },
            {
                "word": "theatre",
                "pos": "noun"
            },
            {
                "word": "theatregoer",
                "pos": "noun"
            },
            {
                "word": "theatre-going",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a building or an outdoor area where plays and similar types of entertainment are performed",
                    "vi": "một tòa nhà hoặc một khu vực ngoài trời nơi biểu diễn các vở kịch và các loại hình giải trí tương tự"
                },
                "examples": [
                    {
                        "en": "Broadway theatres",
                        "vi": "Rạp hát Broadway"
                    },
                    {
                        "en": "an open-air theatre",
                        "vi": "một nhà hát ngoài trời"
                    },
                    {
                        "en": "How often do you go to the theatre?",
                        "vi": "Bạn thường đến rạp chiếu phim như thế nào?"
                    },
                    {
                        "en": "She left the theatre a few minutes after the curtain fell.",
                        "vi": "Cô rời rạp vài phút sau khi tấm màn hạ xuống."
                    }
                ]
            },
            {
                "define": {
                    "en": "a building in which films are shown",
                    "vi": "một tòa nhà chiếu phim"
                },
                "examples": [
                    {
                        "en": "They arrived at the movie theater a few minutes later.",
                        "vi": "Họ đến rạp chiếu phim vài phút sau đó."
                    },
                    {
                        "en": "I urge you to go see this film when it comes to a theater near you.",
                        "vi": "Tôi mong các bạn hãy đi xem bộ phim này khi nó đến rạp gần bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "plays considered as entertainment",
                    "vi": "những vở kịch được coi là giải trí"
                },
                "examples": [
                    {
                        "en": "an evening of live music and theatre",
                        "vi": "một buổi tối nhạc sống và sân khấu"
                    },
                    {
                        "en": "(British English) I like music, theatre and cinema.",
                        "vi": "(Anh Anh) Tôi thích âm nhạc, sân khấu và điện ảnh."
                    },
                    {
                        "en": "current ideas about what makes good theatre (= what makes good entertainment when performed)",
                        "vi": "những ý tưởng hiện tại về những gì tạo nên một rạp hát tốt (= những gì tạo nên sự giải trí tốt khi được trình diễn)"
                    },
                    {
                        "en": "We're huge fans of musical theatre.",
                        "vi": "Chúng tôi rất hâm mộ sân khấu âm nhạc."
                    },
                    {
                        "en": "live/street/youth theatre",
                        "vi": "nhà hát trực tiếp / đường phố / thanh niên"
                    },
                    {
                        "en": "a theatre critic",
                        "vi": "một nhà phê bình sân khấu"
                    }
                ]
            },
            {
                "define": {
                    "en": "the work of writing, producing and acting in plays",
                    "vi": "công việc viết, sản xuất và diễn xuất trong các vở kịch"
                },
                "examples": [
                    {
                        "en": "I want to work in theatre.",
                        "vi": "Tôi muốn làm việc trong nhà hát."
                    },
                    {
                        "en": "a theatre troupe/company",
                        "vi": "một đoàn kịch / công ty"
                    },
                    {
                        "en": "He had never done musical theatre when he landed the lead role as the Phantom.",
                        "vi": "Anh ấy chưa bao giờ đóng phim ca nhạc khi đảm nhận vai chính là Bóng ma."
                    },
                    {
                        "en": "He was essentially a man of the theatre.",
                        "vi": "Về cơ bản anh ta là một người đàn ông của nhà hát."
                    },
                    {
                        "en": "He wants to go into the theatre when he finishes university.",
                        "vi": "Anh ấy muốn vào nhà hát khi học xong đại học."
                    }
                ]
            },
            {
                "define": {
                    "en": "a room in a hospital used for medical operations",
                    "vi": "một căn phòng trong bệnh viện được sử dụng cho các hoạt động y tế"
                },
                "examples": [
                    {
                        "en": "a theatre sister (= a nurse who helps during operations)",
                        "vi": "một chị trong rạp hát (= một y tá giúp đỡ trong quá trình phẫu thuật)"
                    },
                    {
                        "en": "in theatre He's still in theatre.",
                        "vi": "trong rạp hát Anh ấy vẫn ở trong rạp hát."
                    },
                    {
                        "en": "He's already been taken to theatre for the operation.",
                        "vi": "Anh ấy đã được đưa đến nhà hát để phẫu thuật."
                    }
                ]
            },
            {
                "define": {
                    "en": "the place in which a war or fighting takes place",
                    "vi": "nơi xảy ra chiến tranh hoặc giao tranh"
                },
                "examples": [
                    {
                        "en": "an intelligence officer in the Pacific theatre",
                        "vi": "một sĩ quan tình báo ở nhà hát Thái Bình Dương"
                    },
                    {
                        "en": "Russia replied by opening up a new theatre of war in the Balkans.",
                        "vi": "Nga đã trả lời bằng cách mở một sân khấu chiến tranh mới ở Balkan."
                    }
                ]
            }
        ]
    },
    {
        "id": "2f44963c08674db5991618153bcd99cf",
        "word": "curtain",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈkɜːtn/",
            "us": "/ˈkɜːrtn/"
        },
        "nearby": [
            {
                "word": "curtail",
                "pos": "verb"
            },
            {
                "word": "curtailment",
                "pos": "noun"
            },
            {
                "word": "curtain",
                "pos": "noun"
            },
            {
                "word": "curtain",
                "pos": "verb"
            },
            {
                "word": "curtain call",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a piece of cloth that is hung to cover a window",
                    "vi": "một mảnh vải được treo để che cửa sổ"
                },
                "examples": [
                    {
                        "en": "to draw/pull/close the curtains (= to pull them across the window so they cover it)",
                        "vi": "để kéo / kéo / đóng rèm (= kéo qua cửa sổ để chúng che lại)"
                    },
                    {
                        "en": "She opened her curtains and looked out.",
                        "vi": "Cô mở rèm cửa và nhìn ra ngoài."
                    },
                    {
                        "en": "It was ten in the morning but the curtains were still drawn (= closed).",
                        "vi": "Đã mười giờ sáng nhưng rèm cửa vẫn được kéo ra (= đóng lại)."
                    },
                    {
                        "en": "a pair of curtains",
                        "vi": "một đôi rèm"
                    },
                    {
                        "en": "She looked up and saw a face peering through the curtains.",
                        "vi": "Cô nhìn lên và thấy một khuôn mặt đang nhìn qua rèm cửa."
                    }
                ]
            },
            {
                "define": {
                    "en": "a very thin piece of cloth that you hang at a window and that allows light to enter but stops people outside from being able to see inside",
                    "vi": "một mảnh vải rất mỏng mà bạn treo ở cửa sổ cho phép ánh sáng chiếu vào nhưng ngăn những người bên ngoài không thể nhìn thấy bên trong"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a piece of cloth that is hung up as a screen in a room or around a bed, for example",
                    "vi": "Ví dụ như một mảnh vải được treo lên như một tấm bình phong trong phòng hoặc xung quanh giường"
                },
                "examples": [
                    {
                        "en": "a shower curtain",
                        "vi": "rèm tắm"
                    },
                    {
                        "en": "He took a bag from a shelf behind some curtains.",
                        "vi": "Anh ta lấy một chiếc túi từ kệ sau rèm cửa."
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of thick, heavy cloth that hangs in front of the stage in the theatre",
                    "vi": "một mảnh vải dày và nặng treo trước sân khấu trong rạp hát"
                },
                "examples": [
                    {
                        "en": "The audience was waiting for the curtain to rise (= for the play to begin).",
                        "vi": "Khán giả đang chờ hạ màn (= vở kịch bắt đầu)."
                    },
                    {
                        "en": "The curtain goes up to reveal a grand piano at the back of the stage.",
                        "vi": "Bức màn kéo lên để lộ một cây đàn piano lớn ở phía sau sân khấu."
                    },
                    {
                        "en": "There was tremendous applause when the curtain came down (= the play ended).",
                        "vi": "Có một tràng pháo tay vang dội khi bức màn hạ xuống (= vở kịch kết thúc)."
                    },
                    {
                        "en": "We left just before the final curtain (= the end of a play).",
                        "vi": "Chúng tôi rời đi ngay trước bức màn cuối cùng (= kết thúc một vở kịch)."
                    },
                    {
                        "en": "(figurative) It's time to face the final curtain (= the end; death).",
                        "vi": "(nghĩa bóng) Đã đến lúc phải đối mặt với bức màn cuối cùng (= sự kết thúc; cái chết)."
                    },
                    {
                        "en": "(figurative) The curtain has fallen on her long and distinguished career (= her career has ended).",
                        "vi": "(nghĩa bóng) Bức màn đã phủ xuống sự nghiệp lâu dài và lẫy lừng của cô ấy (= sự nghiệp của cô ấy đã kết thúc)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a thing that covers, hides or protects something",
                    "vi": "một thứ bao gồm, che giấu hoặc bảo vệ một cái gì đó"
                },
                "examples": [
                    {
                        "en": "a curtain of rain/smoke",
                        "vi": "màn mưa / khói"
                    },
                    {
                        "en": "She pushed back the curtain of brown hair from her eyes.",
                        "vi": "Cô vén rèm tóc nâu ra khỏi mắt."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be a situation without hope or that you cannot escape from",
                    "vi": "trở thành một tình huống không có hy vọng hoặc bạn không thể thoát khỏi"
                },
                "examples": [
                    {
                        "en": "When I saw he had a gun, I thought it was curtains for me.",
                        "vi": "Khi tôi nhìn thấy anh ta có một khẩu súng, tôi nghĩ đó là những tấm màn che cho tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to finish or mark the end of something",
                    "vi": "để kết thúc hoặc đánh dấu sự kết thúc của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "His sudden decision to retire brought down the curtain on a distinguished career.",
                        "vi": "Quyết định giải nghệ đột ngột của anh ấy đã hạ màn cho một sự nghiệp lẫy lừng."
                    }
                ]
            }
        ]
    },
    {
        "id": "a968aba04a0945429da0d7f165d52e28",
        "word": "scenery",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈsiːnəri/",
            "us": "/ˈsiːnəri/"
        },
        "nearby": [
            {
                "word": "scene",
                "pos": "noun"
            },
            {
                "word": "scene-of-crime",
                "pos": "adjective"
            },
            {
                "word": "scenery",
                "pos": "noun"
            },
            {
                "word": "scene-shifter",
                "pos": "noun"
            },
            {
                "word": "scene-shifting",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the natural features of an area, such as mountains, valleys, rivers and forests, when you are thinking about them being attractive to look at",
                    "vi": "các đặc điểm tự nhiên của một khu vực, chẳng hạn như núi, thung lũng, sông và rừng, khi bạn nghĩ về chúng sẽ hấp dẫn khi nhìn vào"
                },
                "examples": [
                    {
                        "en": "The scenery is magnificent.",
                        "vi": "Phong cảnh thật tráng lệ."
                    },
                    {
                        "en": "to enjoy the scenery",
                        "vi": "để thưởng thức phong cảnh"
                    }
                ]
            },
            {
                "define": {
                    "en": "the painted background that is used to represent natural features or buildings on a theatre stage",
                    "vi": "nền sơn được sử dụng để thể hiện các đặc điểm tự nhiên hoặc các tòa nhà trên sân khấu nhà hát"
                },
                "examples": [
                    {
                        "en": "That table is part of the scenery for Act 2.",
                        "vi": "Chiếc bàn đó là một phần của khung cảnh cho Màn 2."
                    }
                ]
            }
        ]
    },
    {
        "id": "fedec40bd7e94399b97d936e0cd45e1f",
        "word": "stage",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/steɪdʒ/",
            "us": "/steɪdʒ/"
        },
        "nearby": [
            {
                "word": "stag",
                "pos": "noun"
            },
            {
                "word": "stag beetle",
                "pos": "noun"
            },
            {
                "word": "stage",
                "pos": "noun"
            },
            {
                "word": "stage",
                "pos": "verb"
            },
            {
                "word": "stagecoach",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a period or state that something/somebody passes through while developing or making progress",
                    "vi": "một khoảng thời gian hoặc trạng thái mà một cái gì đó / ai đó đi qua trong khi phát triển hoặc đạt được tiến bộ"
                },
                "examples": [
                    {
                        "en": "at… stage I can't make a decision at this stage.",
                        "vi": "ở… giai đoạn này, tôi không thể đưa ra quyết định."
                    },
                    {
                        "en": "At one stage it looked as though they would win.",
                        "vi": "Ở một giai đoạn, có vẻ như họ sẽ giành chiến thắng."
                    },
                    {
                        "en": "The product is at the design stage.",
                        "vi": "Sản phẩm đang ở giai đoạn thiết kế."
                    },
                    {
                        "en": "in… stage This technology is still in its early stages.",
                        "vi": "trong… giai đoạn Công nghệ này vẫn đang ở giai đoạn đầu."
                    },
                    {
                        "en": "A new version is in the final stages of testing.",
                        "vi": "Một phiên bản mới đang trong giai đoạn thử nghiệm cuối cùng."
                    },
                    {
                        "en": "stage in something She's reached a crucial stage in her career.",
                        "vi": "giai đoạn nào đó Cô ấy đã đạt đến một giai đoạn quan trọng trong sự nghiệp của mình."
                    },
                    {
                        "en": "stage of something The children are at various stages of development.",
                        "vi": "giai đoạn của cái gì đó Trẻ em đang ở các giai đoạn phát triển khác nhau."
                    },
                    {
                        "en": "stage of doing something All babies go through a stage of not wanting to leave their mother.",
                        "vi": "giai đoạn làm gì đó Tất cả trẻ sơ sinh đều trải qua giai đoạn không muốn rời mẹ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a separate part that a process, etc. is divided into",
                    "vi": "một phần riêng biệt mà một quy trình, v.v. được chia thành"
                },
                "examples": [
                    {
                        "en": "We did the first stage of the trip by train.",
                        "vi": "Chúng tôi đã thực hiện chặng đầu tiên của chuyến đi bằng tàu hỏa."
                    },
                    {
                        "en": "in stages The pay increase will be introduced in stages (= not all at once).",
                        "vi": "theo từng giai đoạn Việc tăng lương sẽ được thực hiện theo từng giai đoạn (= không phải tất cả cùng một lúc)."
                    },
                    {
                        "en": "All the recipes are broken down into easy stages.",
                        "vi": "Tất cả các công thức được chia thành các giai đoạn dễ dàng."
                    },
                    {
                        "en": "We can take the argument one stage further.",
                        "vi": "Chúng ta có thể tranh luận thêm một giai đoạn nữa."
                    }
                ]
            },
            {
                "define": {
                    "en": "a raised area, usually in a theatre, etc. where actors, dancers, etc. perform",
                    "vi": "một khu vực được nâng lên, thường là trong nhà hát, v.v. nơi các diễn viên, vũ công, v.v. biểu diễn"
                },
                "examples": [
                    {
                        "en": "on stage There were more than 50 people on stage in one scene.",
                        "vi": "trên sân khấu Có hơn 50 người trên sân khấu trong một cảnh."
                    },
                    {
                        "en": "off stage Half the band walked off stage.",
                        "vi": "rời sân khấu Một nửa ban nhạc bước ra khỏi sân khấu."
                    },
                    {
                        "en": "onto the stage The audience threw flowers onto the stage.",
                        "vi": "lên sân khấu Khán giả ném hoa lên sân khấu."
                    },
                    {
                        "en": "The main character then takes the stage (= comes onto it).",
                        "vi": "Sau đó, nhân vật chính bước lên sân khấu (= come up)."
                    },
                    {
                        "en": "Rose exits stage left (= to the left hand side of the stage).",
                        "vi": "Rose thoát khỏi màn hình bên trái (= ở bên trái màn hình)."
                    }
                ]
            },
            {
                "define": {
                    "en": "the theatre and the world of acting as a form of entertainment",
                    "vi": "nhà hát và thế giới hoạt động như một hình thức giải trí"
                },
                "examples": [
                    {
                        "en": "The screenplay was originally written for the stage.",
                        "vi": "Kịch bản ban đầu được viết cho sân khấu."
                    },
                    {
                        "en": "on the stage His parents didn't want him to go on the stage (= to be an actor).",
                        "vi": "trên sân khấu Cha mẹ anh ấy không muốn anh ấy lên sân khấu (= trở thành một diễn viên)."
                    },
                    {
                        "en": "She was a popular star of stage and screen (= theatre and cinema/movies).",
                        "vi": "Cô ấy là một ngôi sao nổi tiếng của sân khấu và màn ảnh (= nhà hát và điện ảnh / phim)."
                    },
                    {
                        "en": "a stage play/musical/show",
                        "vi": "một vở kịch / nhạc kịch / chương trình sân khấu"
                    }
                ]
            },
            {
                "define": {
                    "en": "an area of activity where important things happen, especially in politics",
                    "vi": "một lĩnh vực hoạt động nơi những việc quan trọng xảy ra, đặc biệt là trong lĩnh vực chính trị"
                },
                "examples": [
                    {
                        "en": "She was forced to the centre of the political stage.",
                        "vi": "Cô bị buộc phải làm trung tâm của sân khấu chính trị."
                    },
                    {
                        "en": "The country is now a major player on the world stage.",
                        "vi": "Đất nước hiện là một cầu thủ lớn trên đấu trường thế giới."
                    },
                    {
                        "en": "Germany is playing a leading role on the international stage.",
                        "vi": "Đức đang đóng vai trò hàng đầu trên trường quốc tế."
                    }
                ]
            },
            {
                "define": {
                    "en": "a stagecoach (= a large carriage pulled by horses that was used in the past to carry passengers, and often mail, along a regular route)",
                    "vi": "xe ngựa (= một cỗ xe lớn do ngựa kéo, ngày xưa được dùng để chở hành khách và thường là đưa thư, dọc theo một tuyến đường thông thường)"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to make it possible for something to happen; to make something likely to happen",
                    "vi": "để làm cho nó có thể xảy ra một cái gì đó; để làm cho một cái gì đó có thể xảy ra"
                },
                "examples": [
                    {
                        "en": "Family problems in childhood can set the stage for stress in adult life.",
                        "vi": "Các vấn đề gia đình trong thời thơ ấu có thể tạo tiền đề cho căng thẳng trong cuộc sống của người lớn."
                    },
                    {
                        "en": "The thrilling semi-finals set the stage for what should be a great game.",
                        "vi": "Trận bán kết gay cấn đã tạo tiền đề cho một trận đấu tuyệt vời."
                    }
                ]
            }
        ]
    },
    {
        "id": "605b32c1b1874d3ca17b6235ff78b571",
        "word": "aisle",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/aɪl/",
            "us": "/aɪl/"
        },
        "nearby": [
            {
                "word": "airy-fairy",
                "pos": "adjective"
            },
            {
                "word": "Aisha",
                "pos": ""
            },
            {
                "word": "aisle",
                "pos": "noun"
            },
            {
                "word": "Aisling",
                "pos": ""
            },
            {
                "word": "aitch",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a passage between rows of seats in a church, theatre, train, etc., or between rows of shelves in a supermarket",
                    "vi": "lối đi giữa các hàng ghế trong nhà thờ, rạp hát, xe lửa, v.v. hoặc giữa các hàng kệ trong siêu thị"
                },
                "examples": [
                    {
                        "en": "an aisle seat (= in a plane or train)",
                        "vi": "ghế trên lối đi (= trên máy bay hoặc xe lửa)"
                    },
                    {
                        "en": "Coffee and tea are in the next aisle.",
                        "vi": "Cà phê và trà ở lối đi tiếp theo."
                    },
                    {
                        "en": "She looked radiant as she walked down the aisle on her father’s arm.",
                        "vi": "Cô trông rạng rỡ khi bước xuống lối đi trên tay bố."
                    }
                ]
            },
            {
                "define": {
                    "en": "to get married",
                    "vi": "kết hôn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "laughing a lot",
                    "vi": "cười rất nhiều"
                },
                "examples": [
                    {
                        "en": "She soon had us rolling in the aisles.",
                        "vi": "Cô ấy đã sớm bắt chúng tôi lăn bánh trên lối đi."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to refer to either of two opposite opinions on an issue",
                    "vi": "dùng để chỉ một trong hai ý kiến trái ngược nhau về một vấn đề"
                },
                "examples": [
                    {
                        "en": "The two countries are often on opposite sides of the fence when it comes to climate change.",
                        "vi": "Hai quốc gia thường ở hai phía đối diện của hàng rào khi nói đến biến đổi khí hậu."
                    },
                    {
                        "en": "There are arguments on both sides of the aisle.",
                        "vi": "Hai bên lối đi có những cuộc tranh cãi."
                    }
                ]
            }
        ]
    },
    {
        "id": "2ed86967962d464792a0340aeb441088",
        "word": "booking",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈbʊkɪŋ/",
            "us": "/ˈbʊkɪŋ/"
        },
        "nearby": [
            {
                "word": "bookie",
                "pos": "noun"
            },
            {
                "word": "book in",
                "pos": "phrasal verb"
            },
            {
                "word": "booking",
                "pos": "noun"
            },
            {
                "word": "booking office",
                "pos": "noun"
            },
            {
                "word": "book into",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an arrangement that you make in advance to buy a ticket to travel somewhere, go to the theatre, etc.",
                    "vi": "một sự sắp xếp mà bạn thực hiện trước để mua vé đi du lịch đâu đó, đi xem phim, v.v."
                },
                "examples": [
                    {
                        "en": "a booking form/hall/clerk",
                        "vi": "một biểu mẫu đặt phòng / hội trường / thư ký"
                    },
                    {
                        "en": "Can I make a booking for Friday?",
                        "vi": "Tôi có thể đặt chỗ cho thứ Sáu không?"
                    },
                    {
                        "en": "Early booking is recommended.",
                        "vi": "Nên đặt chỗ sớm."
                    },
                    {
                        "en": "No advance booking is necessary.",
                        "vi": "Không cần đặt trước."
                    },
                    {
                        "en": "We can't take any more bookings.",
                        "vi": "Chúng tôi không thể nhận thêm bất kỳ đơn đặt hàng nào nữa."
                    }
                ]
            },
            {
                "define": {
                    "en": "an arrangement for somebody to perform at a theatre, in a concert, etc.",
                    "vi": "sắp xếp để ai đó biểu diễn tại nhà hát, trong một buổi hòa nhạc, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "an act of the referee writing a player’s name in a book, as a punishment because an offence has been committed",
                    "vi": "hành động của trọng tài ghi tên cầu thủ vào sách, như một hình phạt vì một hành vi phạm tội đã được thực hiện"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "4aeda5daf35a4766867d8db1014f04b1",
        "word": "the performing arts",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ðə pəˌfɔːmɪŋ ˈɑːts/",
            "us": "/ðə pərˌfɔːrmɪŋ ˈɑːrts/"
        },
        "nearby": [
            {
                "word": "performative",
                "pos": "adjective"
            },
            {
                "word": "performer",
                "pos": "noun"
            },
            {
                "word": "the performing arts",
                "pos": "noun"
            },
            {
                "word": "perfume",
                "pos": "noun"
            },
            {
                "word": "perfume",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "arts such as music, dance and drama which are performed for an audience",
                    "vi": "nghệ thuật như âm nhạc, khiêu vũ và kịch được biểu diễn cho khán giả"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "d1c0285223d6478b8aad2e9dc7ec92e6",
        "word": "set",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/set/",
            "us": "/set/"
        },
        "nearby": [
            {
                "word": "session musician",
                "pos": "noun"
            },
            {
                "word": "set",
                "pos": "verb"
            },
            {
                "word": "set",
                "pos": "noun"
            },
            {
                "word": "set",
                "pos": "adjective"
            },
            {
                "word": "set about",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a group of similar things that belong together in some way",
                    "vi": "một nhóm những thứ giống nhau thuộc về nhau theo một cách nào đó"
                },
                "examples": [
                    {
                        "en": "a set of six chairs",
                        "vi": "một bộ sáu chiếc ghế"
                    },
                    {
                        "en": "a complete set of her novels",
                        "vi": "một bộ tiểu thuyết hoàn chỉnh của cô ấy"
                    },
                    {
                        "en": "a set of false teeth",
                        "vi": "một bộ răng giả"
                    },
                    {
                        "en": "These companies operate under a strict set of rules.",
                        "vi": "Các công ty này hoạt động theo một bộ quy tắc nghiêm ngặt."
                    },
                    {
                        "en": "This is an unusual set of circumstances.",
                        "vi": "Đây là một tập hợp các tình huống bất thường."
                    },
                    {
                        "en": "I have a different set of values to them.",
                        "vi": "Tôi có một bộ giá trị khác với chúng."
                    },
                    {
                        "en": "Now they faced a whole new set of problems.",
                        "vi": "Bây giờ họ phải đối mặt với một loạt vấn đề hoàn toàn mới."
                    },
                    {
                        "en": "You can borrow my keys—I have a spare set.",
                        "vi": "Bạn có thể mượn chìa khóa của tôi — tôi có một bộ dự phòng."
                    },
                    {
                        "en": "She won a silver medal in the long jump to complete her set.",
                        "vi": "Cô đã giành huy chương bạc môn nhảy xa để hoàn thành set của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "a group of objects used together, for example for playing a game",
                    "vi": "một nhóm các đối tượng được sử dụng cùng nhau, chẳng hạn như để chơi một trò chơi"
                },
                "examples": [
                    {
                        "en": "a chess set",
                        "vi": "một bộ cờ vua"
                    },
                    {
                        "en": "a model train set",
                        "vi": "một bộ mô hình xe lửa"
                    }
                ]
            },
            {
                "define": {
                    "en": "a group of people who have similar interests and spend a lot of time together socially",
                    "vi": "một nhóm những người có cùng sở thích và dành nhiều thời gian cho nhau trên phương diện xã hội"
                },
                "examples": [
                    {
                        "en": "the smart set (= rich, fashionable people)",
                        "vi": "bộ thông minh (= những người giàu có, thời trang)"
                    },
                    {
                        "en": "Dublin’s literary set",
                        "vi": "Bộ văn học của Dublin"
                    },
                    {
                        "en": "It's known as a playground for Scotland's rich hunting and fishing set.",
                        "vi": "Nó được biết đến như một sân chơi cho bộ môn săn bắn và câu cá phong phú của Scotland."
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of equipment for receiving television or radio signals",
                    "vi": "một phần của thiết bị để nhận tín hiệu truyền hình hoặc radio"
                },
                "examples": [
                    {
                        "en": "a television/TV set",
                        "vi": "một máy thu hình / TV"
                    }
                ]
            },
            {
                "define": {
                    "en": "the scenery used for a play, film, etc.",
                    "vi": "phong cảnh được sử dụng cho một vở kịch, bộ phim, v.v."
                },
                "examples": [
                    {
                        "en": "We need volunteers to help build and paint the set.",
                        "vi": "Chúng tôi cần các tình nguyện viên giúp xây dựng và sơn bộ này."
                    },
                    {
                        "en": "The locations and set designs were fabulous.",
                        "vi": "Các vị trí và thiết kế thiết lập là tuyệt vời."
                    }
                ]
            },
            {
                "define": {
                    "en": "a place where a play is performed or part of a film is filmed",
                    "vi": "nơi biểu diễn một vở kịch hoặc một phần của bộ phim được quay"
                },
                "examples": [
                    {
                        "en": "The cast must all be on (the) set by 7 in the morning.",
                        "vi": "Tất cả các diễn viên phải có mặt trên (bộ) trước 7 giờ sáng."
                    }
                ]
            },
            {
                "define": {
                    "en": "one section of a match in games such as tennis or volleyball",
                    "vi": "một phần của trận đấu trong các trò chơi như quần vợt hoặc bóng chuyền"
                },
                "examples": [
                    {
                        "en": "She won in straight sets (= without losing a set).",
                        "vi": "Cô ấy thắng trong các set liên tiếp (= mà không thua set nào)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a group of things regarded as a unit because they all have particular qualities in common",
                    "vi": "một nhóm những thứ được coi là một đơn vị vì chúng đều có những điểm chung đặc biệt"
                },
                "examples": [
                    {
                        "en": "the set of all square numbers less than 50",
                        "vi": "tập hợp tất cả các số bình phương nhỏ hơn 50"
                    }
                ]
            },
            {
                "define": {
                    "en": "a series of songs or pieces of music that a musician or group performs at a concert",
                    "vi": "một loạt các bài hát hoặc đoạn nhạc mà một nhạc sĩ hoặc nhóm biểu diễn tại một buổi hòa nhạc"
                },
                "examples": [
                    {
                        "en": "a stunning solo set of ten songs",
                        "vi": "một bộ mười bài hát solo tuyệt đẹp"
                    }
                ]
            },
            {
                "define": {
                    "en": "a group of school students with a similar ability in a particular subject",
                    "vi": "một nhóm học sinh có khả năng tương tự trong một môn học cụ thể"
                },
                "examples": [
                    {
                        "en": "She's in the top set for French.",
                        "vi": "Cô ấy thuộc nhóm hàng đầu về tiếng Pháp."
                    }
                ]
            },
            {
                "define": {
                    "en": "the way in which somebody’s face or body is fixed in a particular expression, especially one showing a feeling of being determined",
                    "vi": "cách mà khuôn mặt hoặc cơ thể của ai đó được cố định trong một biểu hiện cụ thể, đặc biệt là một người thể hiện cảm giác được xác định"
                },
                "examples": [
                    {
                        "en": "She admired the firm set of his jaw.",
                        "vi": "Cô ngưỡng mộ bộ hàm rắn chắc của anh ta."
                    }
                ]
            },
            {
                "define": {
                    "en": "an act of arranging hair in a particular style while it is wet",
                    "vi": "một hành động sắp xếp tóc theo một kiểu cụ thể khi tóc ướt"
                },
                "examples": [
                    {
                        "en": "A shampoo and set costs £15.",
                        "vi": "Một bộ dầu gội đầu có giá 15 bảng Anh."
                    }
                ]
            },
            {
                "define": {
                    "en": "the state of becoming solid or hard",
                    "vi": "trạng thái trở nên rắn hoặc cứng"
                },
                "examples": [
                    {
                        "en": "To be sure of a good set when making the jam, use preserving sugar with added pectin.",
                        "vi": "Để đảm bảo mứt ngon khi làm mứt, hãy sử dụng đường bảo quản có thêm pectin."
                    }
                ]
            },
            {
                "define": {
                    "en": "a hole in the ground where a badger lives",
                    "vi": "một cái lỗ trên mặt đất nơi một con lửng sống"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a young plant, shoot etc. for planting",
                    "vi": "một cây non, chồi vv để trồng"
                },
                "examples": [
                    {
                        "en": "onion sets",
                        "vi": "bộ hành"
                    }
                ]
            }
        ]
    },
    {
        "id": "c614bedcfe31408f8ae608aebe2f049a",
        "word": "wind machine",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈwɪnd məʃiːn/",
            "us": "/ˈwɪnd məʃiːn/"
        },
        "nearby": [
            {
                "word": "windlass",
                "pos": "noun"
            },
            {
                "word": "windless",
                "pos": "adjective"
            },
            {
                "word": "wind machine",
                "pos": "noun"
            },
            {
                "word": "windmill",
                "pos": "noun"
            },
            {
                "word": "the Windmill Theatre",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a machine used in the theatre or in films that blows air to give the effect of wind",
                    "vi": "một máy được sử dụng trong rạp hát hoặc trong các bộ phim thổi không khí để tạo ra hiệu ứng của gió"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a machine used in orchestras to produce the sound of wind",
                    "vi": "một cỗ máy được sử dụng trong dàn nhạc để tạo ra âm thanh của gió"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "bb69f6d6b1a94e7fa296e83efa162c8d",
        "word": "backcloth",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈbækklɒθ/",
            "us": "/ˈbækklɔːθ/"
        },
        "nearby": [
            {
                "word": "backchannel",
                "pos": "noun"
            },
            {
                "word": "backchat",
                "pos": "noun"
            },
            {
                "word": "backcloth",
                "pos": "noun"
            },
            {
                "word": "backcomb",
                "pos": "verb"
            },
            {
                "word": "back copy",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a painted piece of cloth that is hung behind the stage in a theatre as part of the scenery",
                    "vi": "một mảnh vải sơn được treo sau sân khấu trong nhà hát như một phần của khung cảnh"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "everything that can be seen around an event or scene",
                    "vi": "mọi thứ có thể nhìn thấy xung quanh một sự kiện hoặc cảnh"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the general conditions in which an event takes place, which sometimes help to explain that event",
                    "vi": "các điều kiện chung trong đó một sự kiện diễn ra, đôi khi giúp giải thích sự kiện đó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "82712a0d87ea4ebaa8b3d2855eaec42f",
        "word": "backdrop",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈbækdrɒp/",
            "us": "/ˈbækdrɑːp/"
        },
        "nearby": [
            {
                "word": "back down",
                "pos": "phrasal verb"
            },
            {
                "word": "backdraught",
                "pos": "noun"
            },
            {
                "word": "backdrop",
                "pos": "noun"
            },
            {
                "word": "back end",
                "pos": "noun"
            },
            {
                "word": "back-end",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "everything that can be seen around an event or scene",
                    "vi": "mọi thứ có thể nhìn thấy xung quanh một sự kiện hoặc cảnh"
                },
                "examples": [
                    {
                        "en": "The mountains provided a dramatic backdrop for our picnic.",
                        "vi": "Những ngọn núi đã cung cấp một bối cảnh ấn tượng cho chuyến dã ngoại của chúng tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "the general conditions in which an event takes place, which sometimes help to explain that event",
                    "vi": "các điều kiện chung trong đó một sự kiện diễn ra, đôi khi giúp giải thích sự kiện đó"
                },
                "examples": [
                    {
                        "en": "Her comments came against the backdrop of growing demand for vaccines.",
                        "vi": "Ý kiến của bà đưa ra trong bối cảnh nhu cầu về vắc xin ngày càng tăng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a painted piece of cloth that is hung behind the stage in a theatre as part of the scenery",
                    "vi": "một mảnh vải sơn được treo sau sân khấu trong nhà hát như một phần của khung cảnh"
                },
                "examples": [
                    {
                        "en": "She was an artist who designed backdrops for movies and stage plays.",
                        "vi": "Cô là một nghệ sĩ thiết kế phông nền cho các bộ phim và các vở kịch trên sân khấu."
                    },
                    {
                        "en": "The photographer poses his subjects against painted backdrops.",
                        "vi": "Các nhiếp ảnh gia đặt chủ thể của mình trên phông nền được sơn."
                    }
                ]
            }
        ]
    },
    {
        "id": "57cf2be8698942b8a3d3b99d2b5b9853",
        "word": "auditorium",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌɔːdɪˈtɔːriəm/",
            "us": "/ˌɔːdɪˈtɔːriəm/"
        },
        "nearby": [
            {
                "word": "audition",
                "pos": "verb"
            },
            {
                "word": "auditor",
                "pos": "noun"
            },
            {
                "word": "auditorium",
                "pos": "noun"
            },
            {
                "word": "auditory",
                "pos": "adjective"
            },
            {
                "word": "audit trail",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the part of a theatre, concert hall, etc. in which the audience sits",
                    "vi": "một phần của nhà hát, phòng hòa nhạc, v.v. trong đó khán giả ngồi"
                },
                "examples": [
                    {
                        "en": "The auditorium seats over a thousand people.",
                        "vi": "Khán phòng có hơn một nghìn người."
                    },
                    {
                        "en": "You will be taken on a guided tour of the theatre, including the stage, auditorium and backstage areas.",
                        "vi": "Bạn sẽ được hướng dẫn tham quan nhà hát, bao gồm các khu vực sân khấu, khán phòng và hậu trường."
                    }
                ]
            },
            {
                "define": {
                    "en": "a large building or room in which public meetings, concerts, etc. are held",
                    "vi": "một tòa nhà hoặc phòng lớn, nơi tổ chức các cuộc họp công cộng, buổi hòa nhạc, v.v."
                },
                "examples": [
                    {
                        "en": "He stood at the back of the packed auditorium.",
                        "vi": "Anh đứng ở phía sau khán phòng chật cứng."
                    },
                    {
                        "en": "The new building will include an exhibition hall, auditorium, bookshop and restaurant.",
                        "vi": "Tòa nhà mới sẽ bao gồm một phòng triển lãm, khán phòng, hiệu sách và nhà hàng."
                    }
                ]
            }
        ]
    },
    {
        "id": "3368968d44e8482e9b43f6187f136d7d",
        "word": "backstage",
        "pos": "adverb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌbækˈsteɪdʒ/",
            "us": "/ˌbækˈsteɪdʒ/"
        },
        "nearby": [
            {
                "word": "backspin",
                "pos": "noun"
            },
            {
                "word": "back-stabbing",
                "pos": "noun"
            },
            {
                "word": "backstage",
                "pos": "adverb"
            },
            {
                "word": "backstage",
                "pos": "adjective"
            },
            {
                "word": "backstairs",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "in the part of a theatre where the actors and artists get ready and wait to perform",
                    "vi": "trong phần của một nhà hát, nơi các diễn viên và nghệ sĩ đã sẵn sàng và chờ đợi để biểu diễn"
                },
                "examples": [
                    {
                        "en": "After the show, we were allowed to go backstage to meet the cast.",
                        "vi": "Sau chương trình, chúng tôi được phép vào hậu trường để gặp gỡ dàn diễn viên."
                    }
                ]
            },
            {
                "define": {
                    "en": "away from the attention of the public; in secret",
                    "vi": "tránh xa sự chú ý của công chúng; trong bí mật"
                },
                "examples": [
                    {
                        "en": "I'd like to know what really goes on backstage in government.",
                        "vi": "Tôi muốn biết những gì thực sự diễn ra ở hậu trường trong chính phủ."
                    }
                ]
            }
        ]
    },
    {
        "id": "f2fc664dce114befadc98f9204e1aaf1",
        "word": "balcony",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbælkəni/",
            "us": "/ˈbælkəni/"
        },
        "nearby": [
            {
                "word": "George Balanchine",
                "pos": ""
            },
            {
                "word": "balancing act",
                "pos": "noun"
            },
            {
                "word": "balcony",
                "pos": "noun"
            },
            {
                "word": "bald",
                "pos": "adjective"
            },
            {
                "word": "bald eagle",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a platform that is built on the upstairs outside wall of a building, with a wall or rail around it. You can get out onto a balcony from an upstairs room.",
                    "vi": "một nền tảng được xây dựng trên bức tường bên ngoài tầng trên của một tòa nhà, với một bức tường hoặc đường ray xung quanh nó. Bạn có thể ra ban công từ phòng trên lầu."
                },
                "examples": [
                    {
                        "en": "We had drinks on the hotel balcony.",
                        "vi": "Chúng tôi đã có đồ uống trên ban công khách sạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "an area of seats upstairs in a theatre",
                    "vi": "một khu vực ghế trên lầu trong rạp hát"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "d67b8f208ad144f8830876b308c14af1",
        "word": "bill",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/bɪl/",
            "us": "/bɪl/"
        },
        "nearby": [
            {
                "word": "bilk",
                "pos": "verb"
            },
            {
                "word": "Sergeant Bilko",
                "pos": ""
            },
            {
                "word": "bill",
                "pos": "noun"
            },
            {
                "word": "bill",
                "pos": "verb"
            },
            {
                "word": "Bill",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a document that shows how much you owe somebody for goods or services",
                    "vi": "một tài liệu cho thấy bạn nợ ai đó bao nhiêu tiền cho hàng hoá hoặc dịch vụ"
                },
                "examples": [
                    {
                        "en": "the phone/electricity/gas bill",
                        "vi": "hóa đơn điện thoại / điện / gas"
                    },
                    {
                        "en": "He is facing a huge tax bill.",
                        "vi": "Anh ấy đang phải đối mặt với một hóa đơn thuế khổng lồ."
                    },
                    {
                        "en": "She always pays her bills on time.",
                        "vi": "Cô ấy luôn thanh toán các hóa đơn của mình đúng hạn."
                    },
                    {
                        "en": "We ran up a massive hotel bill.",
                        "vi": "Chúng tôi đã thanh toán một hóa đơn khách sạn lớn."
                    },
                    {
                        "en": "bill for something I’ll be sending you the bill for the dry-cleaning!",
                        "vi": "hóa đơn cho thứ gì đó Tôi sẽ gửi cho bạn hóa đơn giặt hấp!"
                    },
                    {
                        "en": "The bills are piling up (= there are more and more that have still not been paid).",
                        "vi": "Các hóa đơn đang chồng chất (= ngày càng có nhiều khoản vẫn chưa được thanh toán)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of paper that shows how much you have to pay for the food and drinks that you have had in a restaurant",
                    "vi": "một mảnh giấy cho biết bạn phải trả bao nhiêu cho đồ ăn và thức uống mà bạn đã dùng trong một nhà hàng"
                },
                "examples": [
                    {
                        "en": "Let's ask for the bill.",
                        "vi": "Hãy yêu cầu các hóa đơn."
                    },
                    {
                        "en": "Could we have the bill, please?",
                        "vi": "Chúng tôi có thể lấy hóa đơn không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of paper money",
                    "vi": "một tờ tiền"
                },
                "examples": [
                    {
                        "en": "a ten-dollar bill",
                        "vi": "một tờ mười đô la"
                    }
                ]
            },
            {
                "define": {
                    "en": "a written suggestion for a new law that is presented to a country’s parliament so that its members can discuss it",
                    "vi": "một đề xuất bằng văn bản cho một luật mới được trình lên quốc hội của một quốc gia để các thành viên của quốc gia đó có thể thảo luận về nó"
                },
                "examples": [
                    {
                        "en": "to introduce/approve/oppose a bill",
                        "vi": "giới thiệu / thông qua / phản đối một dự luật"
                    },
                    {
                        "en": "Congress passed the energy bill last month.",
                        "vi": "Quốc hội đã thông qua dự luật năng lượng vào tháng trước."
                    },
                    {
                        "en": "Republicans said they would support the bill.",
                        "vi": "Đảng Cộng hòa cho biết họ sẽ ủng hộ dự luật."
                    },
                    {
                        "en": "the Education Reform Bill",
                        "vi": "Dự luật Cải cách Giáo dục"
                    }
                ]
            },
            {
                "define": {
                    "en": "a programme of entertainment at a theatre, etc.",
                    "vi": "một chương trình giải trí tại nhà hát, v.v."
                },
                "examples": [
                    {
                        "en": "a horror double bill (= two horror films shown one after the other)",
                        "vi": "một hóa đơn kinh dị gấp đôi (= hai bộ phim kinh dị được chiếu lần lượt)"
                    },
                    {
                        "en": "Topping the bill (= the most important performer) is violinist Joshua Bell.",
                        "vi": "Đứng đầu bảng (= nghệ sĩ biểu diễn quan trọng nhất) là nghệ sĩ vĩ cầm Joshua Bell."
                    },
                    {
                        "en": "Mozart is on the bill this evening.",
                        "vi": "Mozart có mặt trong hóa đơn tối nay."
                    }
                ]
            },
            {
                "define": {
                    "en": "a notice in a public place to advertise an event",
                    "vi": "một thông báo ở nơi công cộng để quảng cáo một sự kiện"
                },
                "examples": [
                    {
                        "en": "Post no bills (= a notice warning people not to stick bills in a particular place).",
                        "vi": "Không đăng hóa đơn (= một thông báo cảnh báo mọi người không dán hóa đơn ở một nơi cụ thể)."
                    }
                ]
            },
            {
                "define": {
                    "en": "the hard pointed or curved outer part of a bird’s mouth",
                    "vi": "phần ngoài cứng nhọn hoặc cong của miệng chim"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "having the type of bill mentioned",
                    "vi": "có loại hóa đơn được đề cập"
                },
                "examples": [
                    {
                        "en": "long-billed waders",
                        "vi": "waders thanh toán dài"
                    }
                ]
            },
            {
                "define": {
                    "en": "the stiff front part of a cap that sticks out above your eyes",
                    "vi": "phần trước cứng của một chiếc mũ lưỡi trai nhô ra khỏi mắt bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a report that says somebody is healthy or that something is in good condition",
                    "vi": "một báo cáo nói rằng ai đó khỏe mạnh hoặc một cái gì đó đang ở trong tình trạng tốt"
                },
                "examples": [
                    {
                        "en": "Doctors gave him a clean bill of health after a series of tests and examinations.",
                        "vi": "Các bác sĩ đã cho anh ta một sức khỏe sạch sẽ sau một loạt các xét nghiệm và kiểm tra."
                    },
                    {
                        "en": "The building was given a clean bill of health by the surveyor.",
                        "vi": "Tòa nhà đã được một nhà khảo sát đưa ra một hóa đơn sạch về sức khỏe."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be what is needed in a particular situation or for a particular purpose",
                    "vi": "là những gì cần thiết trong một tình huống cụ thể hoặc cho một mục đích cụ thể"
                },
                "examples": [
                    {
                        "en": "On paper, several of the applicants fit the bill.",
                        "vi": "Trên giấy tờ, một số người nộp đơn phù hợp với hóa đơn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be responsible for paying the cost of something",
                    "vi": "chịu trách nhiệm thanh toán chi phí của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "Once again it will be the taxpayer who has to foot the bill.",
                        "vi": "Một lần nữa, người đóng thuế sẽ là người phải chấp nhận hóa đơn."
                    },
                    {
                        "en": "Who will be footing the bill for the party?",
                        "vi": "Ai sẽ là người lập hóa đơn cho bữa tiệc?"
                    }
                ]
            }
        ]
    },
    {
        "id": "a4849f3034774ae9b9f630de22c782d3",
        "word": "circle",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsɜːkl/",
            "us": "/ˈsɜːrkl/"
        },
        "nearby": [
            {
                "word": "circa",
                "pos": "preposition"
            },
            {
                "word": "circadian",
                "pos": "adjective"
            },
            {
                "word": "circle",
                "pos": "noun"
            },
            {
                "word": "circle",
                "pos": "verb"
            },
            {
                "word": "circlet",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a completely round flat shape",
                    "vi": "một hình dạng phẳng hoàn toàn tròn"
                },
                "examples": [
                    {
                        "en": "the centre/circumference/radius/diameter of a circle",
                        "vi": "tâm / chu vi / bán kính / đường kính của một vòng tròn"
                    },
                    {
                        "en": "concentric circles",
                        "vi": "đường tròn đồng tâm"
                    },
                    {
                        "en": "a design of overlapping circles",
                        "vi": "một thiết kế của các vòng tròn chồng chéo"
                    },
                    {
                        "en": "circle of something Cut out two circles of paper.",
                        "vi": "hình tròn của cái gì đó Cắt ra hai hình tròn bằng giấy."
                    },
                    {
                        "en": "Spread 1 tablespoon of the meat mixture on each circle of dough.",
                        "vi": "Phết 1 thìa hỗn hợp thịt lên từng khoanh bột."
                    },
                    {
                        "en": "the circle of light thrown by the torch",
                        "vi": "đuốc ném vòng tròn ánh sáng"
                    }
                ]
            },
            {
                "define": {
                    "en": "the line that forms the edge of a circle",
                    "vi": "đường tạo thành cạnh của một vòng tròn"
                },
                "examples": [
                    {
                        "en": "Draw a circle.",
                        "vi": "Vẽ một vòng tròn."
                    },
                    {
                        "en": "He traced a circle in the dust with his finger.",
                        "vi": "Anh dùng ngón tay lần theo một vòng tròn trong bụi."
                    },
                    {
                        "en": "in a circle She walked the horse round in a circle.",
                        "vi": "theo vòng tròn Cô cho ngựa đi vòng tròn một vòng."
                    },
                    {
                        "en": "circle around somebody/something He had dark circles around his eyes from lack of sleep.",
                        "vi": "vòng quanh ai đó / cái gì đó Anh ấy có quầng thâm quanh mắt vì thiếu ngủ."
                    },
                    {
                        "en": "The sharks were swimming in circles around her.",
                        "vi": "Những con cá mập đang bơi vòng tròn xung quanh cô."
                    }
                ]
            },
            {
                "define": {
                    "en": "a thing or a group of people or things that is like a circle in shape",
                    "vi": "một sự vật hoặc một nhóm người hoặc những thứ giống như một hình tròn"
                },
                "examples": [
                    {
                        "en": "circle of somebody/something a circle of trees/chairs",
                        "vi": "vòng tròn của ai đó / cái gì đó vòng tròn của cây / ghế"
                    },
                    {
                        "en": "in a circle The children stood in a circle.",
                        "vi": "trong vòng tròn Các em đứng thành vòng tròn."
                    },
                    {
                        "en": "circle around somebody/something The crowd formed a circle around the two boys.",
                        "vi": "vòng quanh ai đó / cái gì đó Đám đông tạo thành một vòng tròn xung quanh hai cậu bé."
                    },
                    {
                        "en": "The M25 motorway isn't quite a complete circle.",
                        "vi": "Xa lộ M25 không phải là một vòng tròn hoàn chỉnh."
                    },
                    {
                        "en": "Arrange the candles to create a circle.",
                        "vi": "Sắp xếp các ngọn nến để tạo thành một vòng tròn."
                    }
                ]
            },
            {
                "define": {
                    "en": "an upper floor of a theatre or cinema where the seats are arranged in curved rows",
                    "vi": "tầng trên của nhà hát hoặc rạp chiếu phim, nơi các ghế được sắp xếp theo hàng cong"
                },
                "examples": [
                    {
                        "en": "We had seats in the circle.",
                        "vi": "Chúng tôi đã có chỗ ngồi trong vòng tròn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a group of people who are connected because they have the same interests, jobs, etc.",
                    "vi": "một nhóm người được kết nối vì họ có cùng sở thích, công việc, v.v."
                },
                "examples": [
                    {
                        "en": "Talk of religion was forbidden in the family circle.",
                        "vi": "Nói về tôn giáo bị cấm trong vòng gia đình."
                    },
                    {
                        "en": "She's well known in theatrical circles.",
                        "vi": "Cô ấy nổi tiếng trong giới sân khấu."
                    },
                    {
                        "en": "a large circle of friends",
                        "vi": "một nhóm bạn bè lớn"
                    }
                ]
            },
            {
                "define": {
                    "en": "to return to the situation in which you started, after a series of events or experiences",
                    "vi": "để quay lại tình huống mà bạn đã bắt đầu, sau một loạt các sự kiện hoặc trải nghiệm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to work hard at something or discuss something without making any progress",
                    "vi": "làm việc chăm chỉ hoặc thảo luận điều gì đó mà không đạt được bất kỳ tiến bộ nào"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be busy doing something without achieving anything important or making progress",
                    "vi": "bận rộn làm điều gì đó mà không đạt được bất cứ điều gì quan trọng hoặc đạt được tiến bộ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to do something that is considered to be impossible",
                    "vi": "để làm điều gì đó được coi là không thể"
                },
                "examples": [
                    {
                        "en": "Marketing companies are trying to square the circle of profitability and growth with strong ethical values and sustainability.",
                        "vi": "Các công ty tiếp thị đang cố gắng thu hẹp vòng tròn lợi nhuận và tăng trưởng bằng các giá trị đạo đức mạnh mẽ và tính bền vững."
                    }
                ]
            }
        ]
    },
    {
        "id": "d5f96c4debb2491e8fd664b33167a647",
        "word": "downstage",
        "pos": "adverb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌdaʊnˈsteɪdʒ/",
            "us": "/ˌdaʊnˈsteɪdʒ/"
        },
        "nearby": [
            {
                "word": "Down's syndrome",
                "pos": "noun"
            },
            {
                "word": "downstage",
                "pos": "adjective"
            },
            {
                "word": "downstage",
                "pos": "adverb"
            },
            {
                "word": "downstairs",
                "pos": "adverb"
            },
            {
                "word": "downstairs",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "towards the front of the stage in a theatre",
                    "vi": "về phía trước của sân khấu trong một nhà hát"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "4baa4cf3c55848baa64d0d3144055245",
        "word": "dressing room",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈdresɪŋ ruːm/",
            "us": "/ˈdresɪŋ ruːm/"
        },
        "nearby": [
            {
                "word": "dressing-down",
                "pos": "noun"
            },
            {
                "word": "dressing gown",
                "pos": "noun"
            },
            {
                "word": "dressing room",
                "pos": "noun"
            },
            {
                "word": "dressing table",
                "pos": "noun"
            },
            {
                "word": "dressmaker",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a room for changing your clothes in, especially one for actors or, in British English, for sports players",
                    "vi": "phòng để thay quần áo của bạn, đặc biệt là phòng dành cho diễn viên hoặc, bằng tiếng Anh Anh, dành cho người chơi thể thao"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a small room next to a bedroom in some large houses, in which clothes are kept and people get dressed",
                    "vi": "một căn phòng nhỏ bên cạnh một phòng ngủ trong một số ngôi nhà lớn, trong đó quần áo được cất giữ và mọi người mặc quần áo"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a room or cubicle in a shop where you can put on clothes to see how they look",
                    "vi": "một căn phòng hoặc buồng nhỏ trong một cửa hàng nơi bạn có thể đặt quần áo để xem chúng trông như thế nào"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c011c4adee7441f5ad80685fd87bbbda",
        "word": "drop curtain",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈdrɒp kɜːtn/",
            "us": "/ˈdrɑːp kɜːrtn/"
        },
        "nearby": [
            {
                "word": "drop by",
                "pos": "phrasal verb"
            },
            {
                "word": "drop cloth",
                "pos": "noun"
            },
            {
                "word": "drop curtain",
                "pos": "noun"
            },
            {
                "word": "drop-dead",
                "pos": "adverb"
            },
            {
                "word": "drop-down menu",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a curtain or a painted cloth that can be let down so that it hangs across the stage",
                    "vi": "rèm hoặc vải sơn có thể buông xuống để treo trên sân khấu"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "68aaebb49a0746c5a8bb54e2d45b21c6",
        "word": "entr’acte",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɒntrækt/",
            "us": "/ˈɑːntrækt/"
        },
        "nearby": [
            {
                "word": "entomology",
                "pos": "noun"
            },
            {
                "word": "entourage",
                "pos": "noun"
            },
            {
                "word": "entr'acte",
                "pos": "noun"
            },
            {
                "word": "entrails",
                "pos": "noun"
            },
            {
                "word": "entrance1",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the time between the different parts of a play, show, etc.",
                    "vi": "thời gian giữa các phần khác nhau của vở kịch, chương trình, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a short performance between the different parts of a play, show, etc.",
                    "vi": "một buổi biểu diễn ngắn giữa các phần khác nhau của vở kịch, chương trình, v.v."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "ceb16952c0c84190a41c29a9cf006a2c",
        "word": "fleapit",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈfliːpɪt/",
            "us": "/ˈfliːpɪt/"
        },
        "nearby": [
            {
                "word": "flea circus",
                "pos": "noun"
            },
            {
                "word": "flea market",
                "pos": "noun"
            },
            {
                "word": "fleapit",
                "pos": "noun"
            },
            {
                "word": "fleck",
                "pos": "noun"
            },
            {
                "word": "fleck",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an old and dirty cinema or theatre",
                    "vi": "rạp chiếu phim hoặc rạp hát cũ và bẩn thỉu"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "df9986207f20427a901efc7884c13633",
        "word": "footlights",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈfʊtlaɪts/",
            "us": "/ˈfʊtlaɪts/"
        },
        "nearby": [
            {
                "word": "footie",
                "pos": "noun"
            },
            {
                "word": "footing",
                "pos": "noun"
            },
            {
                "word": "footlights",
                "pos": "noun"
            },
            {
                "word": "footling",
                "pos": "adjective"
            },
            {
                "word": "footlocker",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a row of lights along the front of the stage in a theatre",
                    "vi": "một dãy đèn dọc phía trước sân khấu trong nhà hát"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a5488ee21bbb43a38136c51e2a058ea5",
        "word": "foyer",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈfɔɪeɪ/",
            "us": "/ˈfɔɪər/"
        },
        "nearby": [
            {
                "word": "foxtrot",
                "pos": "noun"
            },
            {
                "word": "foxy",
                "pos": "adjective"
            },
            {
                "word": "foyer",
                "pos": "noun"
            },
            {
                "word": "Foyle's",
                "pos": ""
            },
            {
                "word": "FPA",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a large open space inside the entrance of a theatre or hotel where people can meet or wait",
                    "vi": "một không gian mở rộng lớn bên trong lối vào của một nhà hát hoặc khách sạn, nơi mọi người có thể gặp gỡ hoặc chờ đợi"
                },
                "examples": [
                    {
                        "en": "I’ll meet you in the foyer at 7 o’clock.",
                        "vi": "Tôi sẽ gặp bạn ở tiền sảnh lúc 7 giờ."
                    }
                ]
            },
            {
                "define": {
                    "en": "an entrance hall in a private house or flat",
                    "vi": "lối vào nhà riêng hoặc căn hộ"
                },
                "examples": [
                    {
                        "en": "An elegant foyer leads directly to the living room.",
                        "vi": "Một tiền sảnh trang nhã dẫn thẳng đến phòng khách."
                    }
                ]
            }
        ]
    },
    {
        "id": "ceb51e15647e47038671b468d11f58cf",
        "word": "front of house",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌfrʌnt əv ˈhaʊs/",
            "us": "/ˌfrʌnt əv ˈhaʊs/"
        },
        "nearby": [
            {
                "word": "frontman",
                "pos": "noun"
            },
            {
                "word": "front office",
                "pos": "noun"
            },
            {
                "word": "front of house",
                "pos": "noun"
            },
            {
                "word": "front page",
                "pos": "noun"
            },
            {
                "word": "front-page",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the parts of a theatre that are used by the audience",
                    "vi": "các bộ phận của nhà hát được khán giả sử dụng"
                },
                "examples": [
                    {
                        "en": "New seating will be installed and the front of house will be improved.",
                        "vi": "Chỗ ngồi mới sẽ được lắp đặt và mặt tiền của ngôi nhà sẽ được cải thiện."
                    }
                ]
            },
            {
                "define": {
                    "en": "the business of dealing with an audience at a theatre, for example selling tickets and programmes",
                    "vi": "kinh doanh giao dịch với khán giả tại rạp hát, ví dụ như bán vé và chương trình"
                },
                "examples": [
                    {
                        "en": "a front-of-house manager",
                        "vi": "một người quản lý trước nhà"
                    },
                    {
                        "en": "the front-of-house staff",
                        "vi": "nhân viên trước nhà"
                    }
                ]
            }
        ]
    },
    {
        "id": "02f71a0ffe444869ad5ab412bdd24bdd",
        "word": "gallery",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɡæləri/",
            "us": "/ˈɡæləri/"
        },
        "nearby": [
            {
                "word": "galleon",
                "pos": "noun"
            },
            {
                "word": "galleried",
                "pos": "adjective"
            },
            {
                "word": "gallery",
                "pos": "noun"
            },
            {
                "word": "galley",
                "pos": "noun"
            },
            {
                "word": "galliard",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a room or building for showing works of art, especially to the public",
                    "vi": "một căn phòng hoặc tòa nhà để trưng bày các tác phẩm nghệ thuật, đặc biệt là cho công chúng"
                },
                "examples": [
                    {
                        "en": "a picture gallery",
                        "vi": "một thư viện hình ảnh"
                    },
                    {
                        "en": "at a gallery The painting is now on display at the National Gallery in London.",
                        "vi": "tại một phòng trưng bày Bức tranh hiện được trưng bày tại Phòng trưng bày Quốc gia ở Luân Đôn."
                    },
                    {
                        "en": "in a gallery the most famous sculpture in the gallery",
                        "vi": "trong một phòng trưng bày tác phẩm điêu khắc nổi tiếng nhất trong phòng trưng bày"
                    },
                    {
                        "en": "The extension will provide plenty of new gallery space.",
                        "vi": "Phần mở rộng sẽ cung cấp nhiều không gian thư viện mới."
                    }
                ]
            },
            {
                "define": {
                    "en": "a collection of pictures",
                    "vi": "một bộ sưu tập các hình ảnh"
                },
                "examples": [
                    {
                        "en": "Visit the photo gallery on our website to see pictures from the event.",
                        "vi": "Ghé thăm thư viện ảnh trên trang web của chúng tôi để xem hình ảnh từ sự kiện này."
                    },
                    {
                        "en": "an extensive gallery of colour photographs",
                        "vi": "một bộ sưu tập ảnh màu phong phú"
                    }
                ]
            },
            {
                "define": {
                    "en": "a small private shop where you can see and buy works of art",
                    "vi": "một cửa hàng tư nhân nhỏ, nơi bạn có thể xem và mua các tác phẩm nghệ thuật"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "an upstairs area at the back or sides of a large hall where people can sit",
                    "vi": "một khu vực trên lầu ở phía sau hoặc hai bên của hội trường lớn, nơi mọi người có thể ngồi"
                },
                "examples": [
                    {
                        "en": "Relatives of the victim watched from the public gallery as the murder charge was read out in court.",
                        "vi": "Người thân của nạn nhân theo dõi từ phòng trưng bày công cộng khi cáo buộc giết người được tuyên trước tòa."
                    }
                ]
            },
            {
                "define": {
                    "en": "the highest level in a theatre where the cheapest seats are",
                    "vi": "cấp độ cao nhất trong một rạp hát nơi có những chiếc ghế rẻ nhất"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a long narrow room, especially one used for a particular purpose",
                    "vi": "một căn phòng dài hẹp, đặc biệt là một căn phòng được sử dụng cho một mục đích cụ thể"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a level passage under the ground in a mine or cave",
                    "vi": "một lối đi bằng phẳng dưới mặt đất trong một hầm mỏ hoặc hang động"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to behave in an exaggerated way to attract people’s attention",
                    "vi": "cư xử một cách cường điệu để thu hút sự chú ý của mọi người"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "07de530a8b8f4872bafd735442457296",
        "word": "gangway",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɡæŋweɪ/",
            "us": "/ˈɡæŋweɪ/"
        },
        "nearby": [
            {
                "word": "gang together",
                "pos": "phrasal verb"
            },
            {
                "word": "gang up",
                "pos": "phrasal verb"
            },
            {
                "word": "gangway",
                "pos": "noun"
            },
            {
                "word": "ganja",
                "pos": "noun"
            },
            {
                "word": "gannet",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a passage between rows of seats in a theatre, an aircraft, etc.",
                    "vi": "lối đi giữa các hàng ghế trong rạp hát, máy bay, v.v."
                },
                "examples": [
                    {
                        "en": "I made my way along the narrow gangway.",
                        "vi": "Tôi đã đi theo con đường hẹp."
                    },
                    {
                        "en": "His suitcase was blocking the gangway.",
                        "vi": "Chiếc vali của anh ta nằm chắn ngang đường băng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a bridge placed between the side of a ship and land so people can get on and off",
                    "vi": "một cây cầu được đặt giữa mạn tàu và đất liền để mọi người có thể lên và xuống"
                },
                "examples": [
                    {
                        "en": "They staggered down the gangway to the quay.",
                        "vi": "Họ loạng choạng đi xuống đường sắt để đến bến tàu."
                    },
                    {
                        "en": "They finally agreed to let us on board and we climbed the gangway.",
                        "vi": "Cuối cùng họ đồng ý cho chúng tôi lên tàu và chúng tôi leo lên đường băng."
                    }
                ]
            }
        ]
    },
    {
        "id": "c028cda32664430e9f782d742111c9b2",
        "word": "god",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ɡɒd/",
            "us": "/ɡɑːd/"
        },
        "nearby": [
            {
                "word": "goby",
                "pos": "noun"
            },
            {
                "word": "go-cart",
                "pos": "noun"
            },
            {
                "word": "god",
                "pos": "noun"
            },
            {
                "word": "godawful",
                "pos": "adjective"
            },
            {
                "word": "God Bless America",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the being or spirit that is worshipped and is believed to have created the universe",
                    "vi": "thực thể hoặc tinh thần được tôn thờ và được cho là đã tạo ra vũ trụ"
                },
                "examples": [
                    {
                        "en": "Do you believe in God?",
                        "vi": "Bạn có tin vào thần?"
                    },
                    {
                        "en": "Good luck and God bless you.",
                        "vi": "Chúc may mắn và Chúa phù hộ cho bạn."
                    },
                    {
                        "en": "Christians believe that Jesus is the Son of God.",
                        "vi": "Cơ đốc nhân tin rằng Chúa Giê-xu là Con của Đức Chúa Trời."
                    },
                    {
                        "en": "I swear by Almighty God that the evidence I shall give… (= in a court of law)",
                        "vi": "Tôi thề với Chúa toàn năng rằng bằng chứng tôi sẽ cung cấp… (= trước tòa án pháp luật)"
                    }
                ]
            },
            {
                "define": {
                    "en": "(in some religions) a being or spirit who is believed to have power over a particular part of nature or who is believed to represent a particular quality",
                    "vi": "(trong một số tôn giáo) một thực thể hoặc linh hồn được cho là có quyền lực đối với một phần cụ thể của tự nhiên hoặc người được cho là đại diện cho một phẩm chất cụ thể"
                },
                "examples": [
                    {
                        "en": "Greek gods",
                        "vi": "những vị thần Hy Lạp"
                    },
                    {
                        "en": "the sun/rain god",
                        "vi": "thần mặt trời / thần mưa"
                    },
                    {
                        "en": "god of something Mars was the Roman god of war.",
                        "vi": "thần của cái gì đó Mars là thần chiến tranh của người La Mã."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who is loved or admired very much by other people",
                    "vi": "một người được người khác yêu mến hoặc ngưỡng mộ rất nhiều"
                },
                "examples": [
                    {
                        "en": "To her fans she's a god.",
                        "vi": "Đối với những người hâm mộ cô ấy, cô ấy là một vị thần."
                    }
                ]
            },
            {
                "define": {
                    "en": "something to which too much importance or attention is given",
                    "vi": "một cái gì đó mà quá quan trọng hoặc sự chú ý được đưa ra"
                },
                "examples": [
                    {
                        "en": "Money is his god.",
                        "vi": "Tiền là thượng đế của anh ta."
                    }
                ]
            },
            {
                "define": {
                    "en": "the seats that are high up at the back of a theatre",
                    "vi": "những chiếc ghế cao ở phía sau nhà hát"
                },
                "examples": [
                    {
                        "en": "We could only afford to sit in the gods.",
                        "vi": "Chúng tôi chỉ có thể đủ khả năng để ngồi trong các vị thần."
                    }
                ]
            },
            {
                "define": {
                    "en": "an event caused by natural forces beyond human control, such as a storm, a flood or an earthquake",
                    "vi": "một sự kiện gây ra bởi các lực lượng tự nhiên ngoài tầm kiểm soát của con người, chẳng hạn như bão, lũ lụt hoặc động đất"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to emphasize a feeling of surprise or that you are determined to do something",
                    "vi": "được sử dụng để nhấn mạnh cảm giác ngạc nhiên hoặc rằng bạn quyết tâm làm điều gì đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used when you are expressing anger and the fact that you are impatient",
                    "vi": "được sử dụng khi bạn đang thể hiện sự tức giận và thực tế là bạn đang thiếu kiên nhẫn"
                },
                "examples": [
                    {
                        "en": "For the love of God, tell me what he said!",
                        "vi": "Vì tình yêu của Đức Chúa Trời, hãy nói cho tôi biết những gì Ngài đã nói!"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to emphasize what you are saying when you are surprised, shocked or annoyed",
                    "vi": "được sử dụng để nhấn mạnh những gì bạn đang nói khi bạn ngạc nhiên, sốc hoặc khó chịu"
                },
                "examples": [
                    {
                        "en": "God, what a stupid thing to do!",
                        "vi": "Chúa ơi, làm một việc ngu ngốc làm sao!"
                    }
                ]
            },
            {
                "define": {
                    "en": "used when you are leaving somebody, to say that you hope they will be safe, etc.",
                    "vi": "được sử dụng khi bạn rời khỏi ai đó, để nói rằng bạn hy vọng họ sẽ an toàn, v.v."
                },
                "examples": [
                    {
                        "en": "Goodnight, God bless.",
                        "vi": "Chúc ngủ ngon, Chúa phù hộ."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that you hope that something will not happen",
                    "vi": "từng nói rằng bạn hy vọng rằng điều gì đó sẽ không xảy ra"
                },
                "examples": [
                    {
                        "en": "‘Maybe you'll end up as a lawyer, like me.’ ‘God forbid!’",
                        "vi": "Có lẽ bạn sẽ trở thành một luật sư, giống như tôi.' 'Chúa cấm!'"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that you are afraid somebody will be in danger or that something bad will happen to them",
                    "vi": "từng nói rằng bạn sợ ai đó gặp nguy hiểm hoặc điều gì đó tồi tệ sẽ xảy ra với họ"
                },
                "examples": [
                    {
                        "en": "God help us if this doesn't work.",
                        "vi": "Chúa giúp chúng tôi nếu điều này không hiệu quả."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to emphasize that you do not know something",
                    "vi": "được sử dụng để nhấn mạnh rằng bạn không biết điều gì đó"
                },
                "examples": [
                    {
                        "en": "God knows what else they might find.",
                        "vi": "Chúa biết những gì khác họ có thể tìm thấy."
                    },
                    {
                        "en": "‘Where are they?’ ‘Goodness knows.’",
                        "vi": "Họ ở đâu?' 'Lòng tốt biết.'"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to emphasize the truth of what you are saying",
                    "vi": "được sử dụng để nhấn mạnh sự thật của những gì bạn đang nói"
                },
                "examples": [
                    {
                        "en": "She ought to pass the exam—goodness knows she's been working hard enough.",
                        "vi": "Cô ấy phải vượt qua kỳ thi — trời cho biết cô ấy đã làm việc đủ chăm chỉ."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to show respect when you are talking about somebody who is dead",
                    "vi": "được sử dụng để thể hiện sự tôn trọng khi bạn đang nói về một người nào đó đã chết"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a person who thinks that they are particularly good at something or who thinks that somebody will find them particularly attractive",
                    "vi": "một người nghĩ rằng họ đặc biệt giỏi một cái gì đó hoặc người nghĩ rằng ai đó sẽ thấy họ đặc biệt hấp dẫn"
                },
                "examples": [
                    {
                        "en": "He seems to think he's God's gift to women.",
                        "vi": "Anh ấy dường như nghĩ rằng mình là món quà của Chúa dành cho phụ nữ."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that you hope that things will happen as you have planned and that there will be no problems",
                    "vi": "được sử dụng để nói rằng bạn hy vọng rằng mọi thứ sẽ xảy ra như bạn đã lên kế hoạch và sẽ không có vấn đề"
                },
                "examples": [
                    {
                        "en": "I'll be back next week, God willing.",
                        "vi": "Tôi sẽ trở lại vào tuần sau, Chúa sẵn lòng."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that you are frightened of the idea of something happening",
                    "vi": "từng nói rằng bạn sợ hãi về ý tưởng có điều gì đó xảy ra"
                },
                "examples": [
                    {
                        "en": "Heaven forfend that students are encouraged to think!",
                        "vi": "Thiên đường cho rằng học sinh được khuyến khích suy nghĩ!"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to emphasize that what you are saying is true",
                    "vi": "được sử dụng để nhấn mạnh rằng những gì bạn đang nói là sự thật"
                },
                "examples": [
                    {
                        "en": "Honest to God, Mary, I'm not joking.",
                        "vi": "Thành thật với Chúa, Mary, tôi không nói đùa đâu."
                    }
                ]
            },
            {
                "define": {
                    "en": "used especially in questions to show that you are angry, surprised or shocked",
                    "vi": "được sử dụng đặc biệt trong các câu hỏi để thể hiện rằng bạn đang tức giận, ngạc nhiên hoặc bị sốc"
                },
                "examples": [
                    {
                        "en": "What in God's name was that noise?",
                        "vi": "Tiếng ồn đó nhân danh Chúa là gì?"
                    },
                    {
                        "en": "Where in the name of Heaven have you been?",
                        "vi": "Bạn đã ở đâu nhân danh Thiên đường?"
                    }
                ]
            },
            {
                "define": {
                    "en": "if the result of something is in the lap of the gods, you do not know what will happen because it depends on luck or things you cannot control",
                    "vi": "Nếu kết quả của một điều gì đó nằm trong lòng của các vị thần, bạn không biết điều gì sẽ xảy ra vì nó phụ thuộc vào may mắn hoặc những điều bạn không thể kiểm soát"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a religious man, especially a priest or a clergyman",
                    "vi": "một người tôn giáo, đặc biệt là một linh mục hoặc một giáo sĩ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to behave as if you control events or other people’s lives",
                    "vi": "cư xử như thể bạn kiểm soát các sự kiện hoặc cuộc sống của người khác"
                },
                "examples": [
                    {
                        "en": "It is unfair to ask doctors to play God and end someone's life.",
                        "vi": "Thật không công bằng khi yêu cầu các bác sĩ đóng vai Chúa và kết thúc cuộc đời của một ai đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that you very much hope or wish that something will happen or not happen",
                    "vi": "từng nói rằng bạn rất hy vọng hoặc ước rằng điều gì đó sẽ xảy ra hoặc không xảy ra"
                },
                "examples": [
                    {
                        "en": "Please God, don't let him be dead.",
                        "vi": "Xin Chúa đừng để anh ấy chết."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody very frightened, especially in order to make them do something",
                    "vi": "khiến ai đó rất sợ hãi, đặc biệt là để khiến họ làm điều gì đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to swear that what you are saying is true, especially in a court of law",
                    "vi": "từng thề rằng những gì bạn đang nói là đúng, đặc biệt là trước tòa án pháp luật"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to say that you are pleased about something",
                    "vi": "từng nói rằng bạn hài lòng về điều gì đó"
                },
                "examples": [
                    {
                        "en": "Thank God you're safe!",
                        "vi": "Cảm ơn Chúa, bạn đã an toàn!"
                    },
                    {
                        "en": "‘Thank goodness for that!’ she said with a sigh of relief.",
                        "vi": "Cảm ơn chúa vì điều đó!' cô ấy nói với một hơi thở nhẹ nhõm."
                    },
                    {
                        "en": "Thank heavens I've found my keys.",
                        "vi": "Cảm ơn trời, tôi đã tìm thấy chìa khóa của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that you could easily have been in the same difficult or unpleasant situation that somebody else is in",
                    "vi": "từng nói rằng bạn có thể dễ dàng rơi vào tình huống khó khăn hoặc khó chịu giống như người khác đang ở trong"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used after a verb to emphasize a particular hope, wish, etc.",
                    "vi": "được sử dụng sau động từ để nhấn mạnh một hy vọng, mong muốn cụ thể, v.v."
                },
                "examples": [
                    {
                        "en": "I wish to God you'd learn to pay attention!",
                        "vi": "Tôi ước Chúa bạn sẽ học được cách chú ý!"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to show surprise, lack of belief, etc.",
                    "vi": "được sử dụng để thể hiện sự ngạc nhiên, thiếu niềm tin, v.v."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "e9c1c680be6f4d44ace4d255e87ca700",
        "word": "green room",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɡriːn ruːm/",
            "us": "/ˈɡriːn ruːm/"
        },
        "nearby": [
            {
                "word": "green pepper",
                "pos": "noun"
            },
            {
                "word": "green roof",
                "pos": "noun"
            },
            {
                "word": "green room",
                "pos": "noun"
            },
            {
                "word": "green salad",
                "pos": "noun"
            },
            {
                "word": "greenskeeper",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a room in a theatre, television studio, etc. where the performers can relax when they are not performing",
                    "vi": "một căn phòng trong nhà hát, phòng thu truyền hình, v.v. nơi những người biểu diễn có thể thư giãn khi họ không biểu diễn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "8263a18c9ab0404aa5e93c2e49050bcb",
        "word": "house",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/haʊs/",
            "us": "/haʊs/"
        },
        "nearby": [
            {
                "word": "hourly",
                "pos": "adjective"
            },
            {
                "word": "hourly",
                "pos": "adverb"
            },
            {
                "word": "house",
                "pos": "noun"
            },
            {
                "word": "house",
                "pos": "verb"
            },
            {
                "word": "house arrest",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a building for people to live in, usually for one family",
                    "vi": "một tòa nhà cho mọi người ở, thường là cho một gia đình"
                },
                "examples": [
                    {
                        "en": "in a house We live in a two-bedroom house.",
                        "vi": "trong một ngôi nhà Chúng tôi sống trong một ngôi nhà hai phòng ngủ."
                    },
                    {
                        "en": "in the house It was so hot outside we stayed in the house.",
                        "vi": "trong nhà Trời nóng quá, chúng tôi ở trong nhà."
                    },
                    {
                        "en": "into the house He went into the house.",
                        "vi": "vào nhà Anh ấy đã vào nhà."
                    },
                    {
                        "en": "out of the house I had to get out of the house.",
                        "vi": "ra khỏi nhà tôi phải ra khỏi nhà."
                    },
                    {
                        "en": "inside the house A light was on inside the house.",
                        "vi": "bên trong ngôi nhà Một ngọn đèn sáng bên trong ngôi nhà."
                    },
                    {
                        "en": "outside the house There was a police van parked outside the house.",
                        "vi": "bên ngoài ngôi nhà Có một chiếc xe cảnh sát đậu bên ngoài ngôi nhà."
                    },
                    {
                        "en": "at somebody's house Let's have a party at my house.",
                        "vi": "tại nhà của ai đó Hãy tổ chức một bữa tiệc tại nhà của tôi."
                    },
                    {
                        "en": "We need to build more houses in a way that respects the needs of the environment.",
                        "vi": "Chúng ta cần xây dựng nhiều ngôi nhà hơn theo cách tôn trọng nhu cầu của môi trường."
                    },
                    {
                        "en": "Investors were buying houses to rent them out.",
                        "vi": "Các nhà đầu tư đang mua nhà để cho thuê."
                    },
                    {
                        "en": "What time do you leave the house in the morning (= to go to work)?",
                        "vi": "Bạn ra khỏi nhà lúc mấy giờ vào buổi sáng (= đi làm)?"
                    },
                    {
                        "en": "(British English) We're moving house (= leaving our house and going to live in a different one).",
                        "vi": "(Tiếng Anh Anh) Chúng tôi đang chuyển nhà (= rời khỏi ngôi nhà của chúng tôi và đến sống ở một ngôi nhà khác)."
                    },
                    {
                        "en": "House prices (= prices of houses and flats) in London are still rising.",
                        "vi": "Giá nhà (= giá nhà và căn hộ) ở Luân Đôn vẫn đang tăng."
                    },
                    {
                        "en": "We went on a tour of the house and grounds (= for example, at a country house, open to the public).",
                        "vi": "Chúng tôi đã đi tham quan ngôi nhà và khu đất (= ví dụ: tại một ngôi nhà nông thôn, mở cửa cho công chúng)."
                    },
                    {
                        "en": "They went from house to house, begging for food.",
                        "vi": "Họ đi từ nhà này sang nhà khác, xin ăn."
                    }
                ]
            },
            {
                "define": {
                    "en": "all the people living in a house",
                    "vi": "tất cả những người sống trong một ngôi nhà"
                },
                "examples": [
                    {
                        "en": "Be quiet or you'll wake the whole house!",
                        "vi": "Hãy im lặng nếu không bạn sẽ đánh thức cả nhà!"
                    }
                ]
            },
            {
                "define": {
                    "en": "a building used for a particular purpose, for example for holding meetings in or keeping animals or goods in",
                    "vi": "một tòa nhà được sử dụng cho một mục đích cụ thể, ví dụ như để tổ chức các cuộc họp hoặc giữ động vật hoặc hàng hóa trong"
                },
                "examples": [
                    {
                        "en": "an opera house",
                        "vi": "một nhà hát opera"
                    },
                    {
                        "en": "a henhouse",
                        "vi": "một chuồng gà"
                    }
                ]
            },
            {
                "define": {
                    "en": "used in the names of office buildings",
                    "vi": "được sử dụng trong tên của các tòa nhà văn phòng"
                },
                "examples": [
                    {
                        "en": "Their offices are on the second floor of Chester House.",
                        "vi": "Văn phòng của họ ở tầng hai của Chester House."
                    }
                ]
            },
            {
                "define": {
                    "en": "a company involved in a particular kind of business; an institution of a particular kind",
                    "vi": "một công ty tham gia vào một loại hình kinh doanh cụ thể; một tổ chức của một loại cụ thể"
                },
                "examples": [
                    {
                        "en": "a fashion/banking/publishing house",
                        "vi": "thời trang / ngân hàng / nhà xuất bản"
                    },
                    {
                        "en": "a religious house (= a convent or a monastery)",
                        "vi": "một nhà tôn giáo (= một tu viện hoặc một tu viện)"
                    }
                ]
            },
            {
                "define": {
                    "en": "a restaurant",
                    "vi": "một nhà hàng"
                },
                "examples": [
                    {
                        "en": "a steakhouse",
                        "vi": "một nhà hàng bít tết"
                    },
                    {
                        "en": "a coffee house",
                        "vi": "một quán cà phê"
                    },
                    {
                        "en": "a bottle of house wine (= the cheapest wine available in a particular restaurant, sometimes not listed by name)",
                        "vi": "một chai rượu nhà (= loại rượu rẻ nhất có sẵn trong một nhà hàng cụ thể, đôi khi không được liệt kê theo tên)"
                    }
                ]
            },
            {
                "define": {
                    "en": "a group of people who meet to discuss and make the laws of a country",
                    "vi": "một nhóm người gặp nhau để thảo luận và đưa ra luật của một quốc gia"
                },
                "examples": [
                    {
                        "en": "Legislation requires approval by both houses of parliament.",
                        "vi": "Luật pháp đòi hỏi sự chấp thuận của cả hai viện của quốc hội."
                    }
                ]
            },
            {
                "define": {
                    "en": "the House of Commons or the House of Lords in the UK; the House of Representatives in the US",
                    "vi": "Hạ viện hoặc Hạ viện ở Vương quốc Anh; Hạ viện ở Hoa Kỳ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a group of people discussing something in a formal debate",
                    "vi": "một nhóm người thảo luận điều gì đó trong một cuộc tranh luận chính thức"
                },
                "examples": [
                    {
                        "en": "I urge the house to vote against the motion.",
                        "vi": "Tôi kêu gọi cả nhà bỏ phiếu chống lại đề nghị này."
                    }
                ]
            },
            {
                "define": {
                    "en": "the part of a theatre where the audience sits; the audience at a particular performance",
                    "vi": "phần của một nhà hát, nơi khán giả ngồi; khán giả tại một buổi biểu diễn cụ thể"
                },
                "examples": [
                    {
                        "en": "playing to a full/packed/empty house (= to a large/small audience)",
                        "vi": "chơi với một ngôi nhà đầy đủ / chật kín / trống rỗng (= cho một lượng lớn / khán giả nhỏ)"
                    },
                    {
                        "en": "The spotlight faded and the house lights came up.",
                        "vi": "Ánh đèn sân khấu mờ dần và đèn nhà bật lên."
                    }
                ]
            },
            {
                "define": {
                    "en": "(in some British schools) an organized group of students of different ages who compete against other groups in sports competitions, etc. and who may, in boarding schools, live together in one building",
                    "vi": "(ở một số trường học ở Anh) một nhóm có tổ chức gồm các học sinh ở các độ tuổi khác nhau thi đấu với các nhóm khác trong các cuộc thi thể thao, v.v. và những người có thể, trong các trường nội trú, sống cùng nhau trong một tòa nhà"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "an old and famous family",
                    "vi": "một gia đình lâu đời và nổi tiếng"
                },
                "examples": [
                    {
                        "en": "the House of Windsor (= the British royal family)",
                        "vi": "Nhà Windsor (= hoàng gia Anh)"
                    }
                ]
            },
            {
                "define": {
                    "en": "a type of electronic dance music with a fast beat",
                    "vi": "một loại nhạc dance điện tử với nhịp điệu nhanh"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to make everyone laugh or cheer, especially at a performance in the theatre",
                    "vi": "để làm cho mọi người cười hoặc cổ vũ, đặc biệt là tại một buổi biểu diễn trong nhà hát"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to remove people or things that are not necessary or wanted",
                    "vi": "để loại bỏ những người hoặc những thứ không cần thiết hoặc không muốn"
                },
                "examples": [
                    {
                        "en": "The new manager said he wanted to clean house.",
                        "vi": "Người quản lý mới nói rằng anh ấy muốn dọn dẹp nhà cửa."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make your house clean",
                    "vi": "để làm cho ngôi nhà của bạn sạch sẽ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to eat a lot of somebody else’s food",
                    "vi": "ăn nhiều thức ăn của người khác"
                },
                "examples": [
                    {
                        "en": "How much longer is he staying? He’s eating us out of house and home.",
                        "vi": "Anh ta sẽ ở lại bao lâu nữa? Anh ta đang ăn thịt chúng tôi ra khỏi nhà và nhà."
                    }
                ]
            },
            {
                "define": {
                    "en": "to become friends quickly and have a very friendly relationship",
                    "vi": "nhanh chóng trở thành bạn bè và có một mối quan hệ rất thân thiện"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to do something or ask a question in a very complicated way instead of in a simple, direct way",
                    "vi": "để làm điều gì đó hoặc đặt một câu hỏi theo một cách rất phức tạp thay vì một cách đơn giản, trực tiếp"
                },
                "examples": [
                    {
                        "en": "You did go all round the houses didn’t you? Why not get straight to the point?",
                        "vi": "Bạn đã đi khắp các ngôi nhà phải không? Tại sao không đi thẳng vào vấn đề?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to cook, clean and do all the other jobs around the house",
                    "vi": "nấu ăn, dọn dẹp và làm tất cả các công việc khác xung quanh nhà"
                },
                "examples": [
                    {
                        "en": "She kept house for her elderly parents.",
                        "vi": "Cô cất nhà cho cha mẹ già."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that everyone was very emotional about something",
                    "vi": "từng nói rằng mọi người đều rất xúc động về điều gì đó"
                },
                "examples": [
                    {
                        "en": "There wasn't a dry eye in the house when they announced their engagement.",
                        "vi": "Không có người nào thấy khô mắt khi họ tuyên bố đính hôn."
                    }
                ]
            },
            {
                "define": {
                    "en": "drinks or meals that are on the house are provided free by the pub or restaurant and you do not have to pay",
                    "vi": "đồ uống hoặc bữa ăn trong nhà được cung cấp miễn phí bởi quán rượu hoặc nhà hàng và bạn không phải trả tiền"
                },
                "examples": [
                    {
                        "en": "Have a drink on the house.",
                        "vi": "Vào nhà uống rượu đi."
                    }
                ]
            },
            {
                "define": {
                    "en": "you should not criticize other people, because they will easily find ways of criticizing you",
                    "vi": "bạn không nên chỉ trích người khác, vì họ sẽ dễ dàng tìm cách chỉ trích bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to play at being a family in its home",
                    "vi": "chơi để trở thành một gia đình trong ngôi nhà của nó"
                },
                "examples": [
                    {
                        "en": "The children were playing house, giving dinner to their dolls.",
                        "vi": "Những đứa trẻ đang chơi nhà, đưa bữa tối cho búp bê của chúng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to organize your own business or improve your own behaviour before you try to criticize somebody else",
                    "vi": "tổ chức công việc kinh doanh của riêng bạn hoặc cải thiện hành vi của chính bạn trước khi bạn cố gắng chỉ trích người khác"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "very safe",
                    "vi": "rất an toàn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to make a place your home",
                    "vi": "để biến một nơi thành nhà của bạn"
                },
                "examples": [
                    {
                        "en": "They set up house together in a small flat in Brighton.",
                        "vi": "Họ cùng nhau dựng nhà trong một căn hộ nhỏ ở Brighton."
                    },
                    {
                        "en": "They want to set up house together.",
                        "vi": "Họ muốn thiết lập một ngôi nhà cùng nhau."
                    }
                ]
            }
        ]
    },
    {
        "id": "01cdb7b06ab34e54a7b14a50bd371b35",
        "word": "mezzanine",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmezəniːn/",
            "us": "/ˈmezəniːn/"
        },
        "nearby": [
            {
                "word": "meze",
                "pos": "noun"
            },
            {
                "word": "mezuzah",
                "pos": "noun"
            },
            {
                "word": "mezzanine",
                "pos": "noun"
            },
            {
                "word": "mezzo-soprano",
                "pos": "noun"
            },
            {
                "word": "mezzotint",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a floor that is built between two floors of a building and is smaller than the other floors",
                    "vi": "một tầng được xây dựng giữa hai tầng của một tòa nhà và nhỏ hơn các tầng khác"
                },
                "examples": [
                    {
                        "en": "a bedroom on the mezzanine",
                        "vi": "một phòng ngủ trên gác lửng"
                    },
                    {
                        "en": "a mezzanine floor",
                        "vi": "một tầng lửng"
                    }
                ]
            },
            {
                "define": {
                    "en": "the first area of seats above the ground floor in a theatre; the first few rows of these seats",
                    "vi": "khu vực ghế đầu tiên phía trên tầng trệt trong rạp hát; vài hàng ghế đầu tiên của những ghế này"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "80ec93ff84ac4f1aa309c7dc9a6942a3",
        "word": "offstage",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌɒfˈsteɪdʒ/",
            "us": "/ˌɔːfˈsteɪdʒ/"
        },
        "nearby": [
            {
                "word": "offsider",
                "pos": "noun"
            },
            {
                "word": "offspring",
                "pos": "noun"
            },
            {
                "word": "offstage",
                "pos": "adjective"
            },
            {
                "word": "offstage",
                "pos": "adverb"
            },
            {
                "word": "off-street",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "not on the stage in a theatre; not where the audience can see",
                    "vi": "không phải trên sân khấu trong nhà hát; không phải nơi mà khán giả có thể nhìn thấy"
                },
                "examples": [
                    {
                        "en": "offstage sound effects",
                        "vi": "hiệu ứng âm thanh ngoại cảnh"
                    }
                ]
            },
            {
                "define": {
                    "en": "happening to an actor in real life, not on the stage",
                    "vi": "xảy ra với một diễn viên ngoài đời, không phải trên sân khấu"
                },
                "examples": [
                    {
                        "en": "The stars were having an offstage relationship.",
                        "vi": "Các ngôi sao đã có một mối quan hệ ngoài luồng."
                    }
                ]
            }
        ]
    },
    {
        "id": "a0ae43e5463e4029a7de1af74dd75578",
        "word": "offstage",
        "pos": "adverb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌɒfˈsteɪdʒ/",
            "us": "/ˌɔːfˈsteɪdʒ/"
        },
        "nearby": [
            {
                "word": "offspring",
                "pos": "noun"
            },
            {
                "word": "offstage",
                "pos": "adjective"
            },
            {
                "word": "offstage",
                "pos": "adverb"
            },
            {
                "word": "off-street",
                "pos": "adjective"
            },
            {
                "word": "off-tackle",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "not on the stage in a theatre; not where the audience can see",
                    "vi": "không phải trên sân khấu trong nhà hát; không phải nơi mà khán giả có thể nhìn thấy"
                },
                "examples": [
                    {
                        "en": "The hero dies offstage.",
                        "vi": "Anh hùng chết ngoài lề."
                    }
                ]
            },
            {
                "define": {
                    "en": "in real life, not on the stage",
                    "vi": "ngoài đời chứ không phải trên sân khấu"
                },
                "examples": [
                    {
                        "en": "Offstage, unlike many actors, he remained happily married.",
                        "vi": "Ngoài đời, khác với nhiều diễn viên, anh vẫn hạnh phúc trong cuộc hôn nhân."
                    }
                ]
            }
        ]
    },
    {
        "id": "f7e9d33f5fd24a3584dd7d1be94bfd3d",
        "word": "onstage",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌɒnˈsteɪdʒ/",
            "us": "/ˌɑːnˈsteɪdʒ/"
        },
        "nearby": [
            {
                "word": "onside",
                "pos": "adverb"
            },
            {
                "word": "onslaught",
                "pos": "noun"
            },
            {
                "word": "onstage",
                "pos": "adjective"
            },
            {
                "word": "onstage",
                "pos": "adverb"
            },
            {
                "word": "on-street",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "on the stage in a theatre; in front of an audience",
                    "vi": "trên sân khấu trong nhà hát; trước khán giả"
                },
                "examples": [
                    {
                        "en": "onstage fights",
                        "vi": "chiến đấu trên sân khấu"
                    }
                ]
            }
        ]
    },
    {
        "id": "5f8b3690f9964df4a7c9bc7666230f20",
        "word": "onstage",
        "pos": "adverb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌɒnˈsteɪdʒ/",
            "us": "/ˌɑːnˈsteɪdʒ/"
        },
        "nearby": [
            {
                "word": "onslaught",
                "pos": "noun"
            },
            {
                "word": "onstage",
                "pos": "adjective"
            },
            {
                "word": "onstage",
                "pos": "adverb"
            },
            {
                "word": "on-street",
                "pos": "adjective"
            },
            {
                "word": "Ontario",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "on the stage in a theatre; in front of an audience",
                    "vi": "trên sân khấu trong nhà hát; trước khán giả"
                },
                "examples": [
                    {
                        "en": "He ran onstage and bowed to the audience.",
                        "vi": "Anh chạy trên sân khấu và cúi chào khán giả."
                    }
                ]
            }
        ]
    },
    {
        "id": "f2a63e1499c144118a1c3801ab0f2103",
        "word": "orchestra",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɔːkɪstrə/",
            "us": "/ˈɔːrkɪstrə/"
        },
        "nearby": [
            {
                "word": "orchard",
                "pos": "noun"
            },
            {
                "word": "Orchard Street",
                "pos": ""
            },
            {
                "word": "orchestra",
                "pos": "noun"
            },
            {
                "word": "orchestral",
                "pos": "adjective"
            },
            {
                "word": "orchestra pit",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a large group of people who play various musical instruments together, led by a conductor",
                    "vi": "một nhóm lớn những người chơi nhiều loại nhạc cụ cùng nhau, dẫn đầu bởi một nhạc trưởng"
                },
                "examples": [
                    {
                        "en": "She plays the flute in the school orchestra.",
                        "vi": "Cô ấy thổi sáo trong dàn nhạc của trường."
                    },
                    {
                        "en": "the Scottish Symphony Orchestra",
                        "vi": "Dàn nhạc giao hưởng Scotland"
                    },
                    {
                        "en": "The competition gave the young composer her first opportunity to write for a full orchestra.",
                        "vi": "Cuộc thi đã cho nhà soạn nhạc trẻ cơ hội đầu tiên của cô để viết cho một dàn nhạc đầy đủ."
                    }
                ]
            },
            {
                "define": {
                    "en": "the seats that are nearest to the stage in a theatre",
                    "vi": "những chỗ ngồi gần sân khấu nhất trong rạp hát"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "de3ea411e38b4b55b9fa67cc1d588236",
        "word": "orchestra pit",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɔːkɪstrə pɪt/",
            "us": "/ˈɔːrkɪstrə pɪt/"
        },
        "nearby": [
            {
                "word": "orchestra",
                "pos": "noun"
            },
            {
                "word": "orchestral",
                "pos": "adjective"
            },
            {
                "word": "orchestra pit",
                "pos": "noun"
            },
            {
                "word": "orchestrate",
                "pos": "verb"
            },
            {
                "word": "orchestration",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the place in a theatre just in front of the stage where the orchestra sits and plays for an opera, a ballet, etc.",
                    "vi": "nơi trong một nhà hát ngay phía trước sân khấu, nơi dàn nhạc ngồi và chơi một vở opera, một vở ba lê, v.v."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "7a87eb29e8c940c6a46748c1e0b80c5a",
        "word": "ovation",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/əʊˈveɪʃn/",
            "us": "/əʊˈveɪʃn/"
        },
        "nearby": [
            {
                "word": "ovarian",
                "pos": "adjective"
            },
            {
                "word": "ovary",
                "pos": "noun"
            },
            {
                "word": "ovation",
                "pos": "noun"
            },
            {
                "word": "oven",
                "pos": "noun"
            },
            {
                "word": "oven glove",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "enthusiastic clapping by an audience as a sign of their approval",
                    "vi": "được khán giả vỗ tay nhiệt tình như một dấu hiệu của sự tán thành của họ"
                },
                "examples": [
                    {
                        "en": "to give somebody a huge/rapturous/rousing ovation",
                        "vi": "để mang đến cho ai đó sự hoan nghênh nhiệt liệt / cuồng nhiệt / sôi nổi"
                    },
                    {
                        "en": "The soloist got a ten-minute standing ovation (= in which people stand up from their seats).",
                        "vi": "Nghệ sĩ độc tấu đã được hoan nghênh nhiệt liệt trong mười phút (= mọi người đứng dậy khỏi chỗ ngồi của họ)."
                    }
                ]
            }
        ]
    },
    {
        "id": "6394c0c2da1c4801b43208c9770e11b7",
        "word": "playbill",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpleɪbɪl/",
            "us": "/ˈpleɪbɪl/"
        },
        "nearby": [
            {
                "word": "playback",
                "pos": "noun"
            },
            {
                "word": "playback singer",
                "pos": "noun"
            },
            {
                "word": "playbill",
                "pos": "noun"
            },
            {
                "word": "playbook",
                "pos": "noun"
            },
            {
                "word": "playboy",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a printed notice advertising a play",
                    "vi": "một thông báo in quảng cáo một vở kịch"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a theatre programme",
                    "vi": "một chương trình sân khấu"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "2946d3c88efc4a88aa723f9a7d9f116c",
        "word": "prop",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/prɒp/",
            "us": "/prɑːp/"
        },
        "nearby": [
            {
                "word": "proofread",
                "pos": "verb"
            },
            {
                "word": "proofreader",
                "pos": "noun"
            },
            {
                "word": "prop",
                "pos": "noun"
            },
            {
                "word": "prop",
                "pos": "verb"
            },
            {
                "word": "propaganda",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a piece of wood, metal, etc. used to support something or keep it in position",
                    "vi": "một miếng gỗ, kim loại, v.v. được sử dụng để hỗ trợ một cái gì đó hoặc giữ cho nó ở vị trí"
                },
                "examples": [
                    {
                        "en": "Rescuers used props to stop the roof of the tunnel collapsing.",
                        "vi": "Lực lượng cứu hộ dùng đạo cụ để ngăn mái hầm sập."
                    },
                    {
                        "en": "a pit prop (= one used in a coal mine)",
                        "vi": "một giá đỡ hầm lò (= một cái được sử dụng trong một mỏ than)"
                    }
                ]
            },
            {
                "define": {
                    "en": "a person or thing that gives help or support to somebody/something that is weak",
                    "vi": "một người hoặc vật giúp đỡ hoặc hỗ trợ ai đó / thứ gì đó yếu đuối"
                },
                "examples": [
                    {
                        "en": "After being the emotional prop he needed for so long, she dared not leave him.",
                        "vi": "Sau khi là chỗ dựa tình cảm mà anh cần bao lâu nay, cô không dám rời xa anh."
                    },
                    {
                        "en": "Many people use alcohol as a social prop.",
                        "vi": "Nhiều người sử dụng rượu như một phương tiện xã hội."
                    }
                ]
            },
            {
                "define": {
                    "en": "a small object used by actors during the performance of a play or in a film",
                    "vi": "một đồ vật nhỏ được các diễn viên sử dụng khi trình diễn vở kịch hoặc trong một bộ phim"
                },
                "examples": [
                    {
                        "en": "He is responsible for all the stage props and lighting.",
                        "vi": "Anh ấy chịu trách nhiệm về tất cả các đạo cụ sân khấu và ánh sáng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a player on either side of the front row of a scrum",
                    "vi": "một người chơi ở hai bên của hàng trước của một scrum"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "917d0fbdecbc4668ab26cd76582269ef",
        "word": "proscenium",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/prəˈsiːniəm/",
            "us": "/prəˈsiːniəm/"
        },
        "nearby": [
            {
                "word": "prosaic",
                "pos": "adjective"
            },
            {
                "word": "prosaically",
                "pos": "adverb"
            },
            {
                "word": "proscenium",
                "pos": "noun"
            },
            {
                "word": "prosciutto",
                "pos": "noun"
            },
            {
                "word": "proscribe",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the part of the stage in a theatre that is in front of the curtain",
                    "vi": "một phần của sân khấu trong nhà hát ở phía trước bức màn"
                },
                "examples": [
                    {
                        "en": "a traditional theatre with a proscenium arch (= one that forms a frame for the stage where the curtain is opened)",
                        "vi": "một nhà hát truyền thống với một mái vòm proscenium (= một nhà hát tạo thành khung cho sân khấu nơi bức màn được mở ra)"
                    }
                ]
            }
        ]
    },
    {
        "id": "f75c1dacf7604826a55f2d29ea1755ea",
        "word": "safety curtain",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈseɪfti kɜːtn/",
            "us": "/ˈseɪfti kɜːrtn/"
        },
        "nearby": [
            {
                "word": "safety belt",
                "pos": "noun"
            },
            {
                "word": "safety catch",
                "pos": "noun"
            },
            {
                "word": "safety curtain",
                "pos": "noun"
            },
            {
                "word": "safety deposit box",
                "pos": "noun"
            },
            {
                "word": "safety glass",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a curtain which can come down across the stage in a theatre, intended to stop a fire from spreading",
                    "vi": "một tấm màn có thể kéo xuống sân khấu trong nhà hát, nhằm ngăn ngọn lửa lan rộng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "5e98e050c8dd412598ce7efb5e754c82",
        "word": "sell-out",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsel aʊt/",
            "us": "/ˈsel aʊt/"
        },
        "nearby": [
            {
                "word": "Sellotape",
                "pos": "noun"
            },
            {
                "word": "sell out",
                "pos": "phrasal verb"
            },
            {
                "word": "sell-out",
                "pos": "noun"
            },
            {
                "word": "sell-through",
                "pos": "noun"
            },
            {
                "word": "sell up",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a play, concert, etc. for which all the tickets have been sold",
                    "vi": "một vở kịch, buổi hòa nhạc, v.v. mà tất cả vé đã được bán"
                },
                "examples": [
                    {
                        "en": "Next week's final looks like being a sell-out.",
                        "vi": "Cuối cùng của tuần tới có vẻ như là một đợt bán hết."
                    },
                    {
                        "en": "a sell-out tour",
                        "vi": "một chuyến du lịch bán hết vé"
                    }
                ]
            },
            {
                "define": {
                    "en": "a situation in which somebody behaves badly towards a person or group who trusted them, by not doing something that they promised to do, or by doing something that they promised not to do",
                    "vi": "một tình huống trong đó ai đó cư xử tệ với một người hoặc một nhóm người đã tin tưởng họ, bằng cách không làm điều gì đó họ đã hứa hoặc bằng cách làm điều gì đó mà họ đã hứa không làm"
                },
                "examples": [
                    {
                        "en": "The workers see the deal as a union sell-out to management.",
                        "vi": "Người lao động coi thỏa thuận này như một sự bán đứng của công đoàn đối với ban quản lý."
                    }
                ]
            }
        ]
    },
    {
        "id": "06587c539e1b41c1a705ae198d91b1dc",
        "word": "stage door",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌsteɪdʒ ˈdɔː(r)/",
            "us": "/ˌsteɪdʒ ˈdɔːr/"
        },
        "nearby": [
            {
                "word": "stagecraft",
                "pos": "noun"
            },
            {
                "word": "stage direction",
                "pos": "noun"
            },
            {
                "word": "stage door",
                "pos": "noun"
            },
            {
                "word": "stage fright",
                "pos": "noun"
            },
            {
                "word": "stagehand",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the entrance at the back of a theatre used by actors, staff, etc.",
                    "vi": "lối vào phía sau nhà hát được sử dụng bởi các diễn viên, nhân viên, v.v."
                },
                "examples": [
                    {
                        "en": "A crowd of fans was waiting outside the stage door.",
                        "vi": "Đông đảo người hâm mộ đã chờ sẵn ngoài cửa sân khấu."
                    },
                    {
                        "en": "Fans hung around the stage door hoping to meet the band.",
                        "vi": "Người hâm mộ vây kín cửa sân khấu với hy vọng được gặp ban nhạc."
                    }
                ]
            }
        ]
    },
    {
        "id": "54a56fdf356f45269d05982d9d498d13",
        "word": "stage left",
        "pos": "adverb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌsteɪdʒ ˈleft/",
            "us": "/ˌsteɪdʒ ˈleft/"
        },
        "nearby": [
            {
                "word": "stage fright",
                "pos": "noun"
            },
            {
                "word": "stagehand",
                "pos": "noun"
            },
            {
                "word": "stage left",
                "pos": "adverb"
            },
            {
                "word": "stage-manage",
                "pos": "verb"
            },
            {
                "word": "stage manager",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "on the left side of a stage in a theatre, as seen by an actor facing the audience",
                    "vi": "ở phía bên trái của sân khấu trong nhà hát, khi một diễn viên đang đối mặt với khán giả"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c53f0eea3b3744deab29caab2eedc0b5",
        "word": "stage right",
        "pos": "adverb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌsteɪdʒ ˈraɪt/",
            "us": "/ˌsteɪdʒ ˈraɪt/"
        },
        "nearby": [
            {
                "word": "stage manager",
                "pos": "noun"
            },
            {
                "word": "stage name",
                "pos": "noun"
            },
            {
                "word": "stage right",
                "pos": "adverb"
            },
            {
                "word": "stage-struck",
                "pos": "adjective"
            },
            {
                "word": "stagette",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "on the right side of a stage in a theatre, as seen by an actor facing the audience",
                    "vi": "ở phía bên phải của sân khấu trong nhà hát, khi một diễn viên đang đối mặt với khán giả"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "b756d34b388a4b06bdeac573c4003bde",
        "word": "stall",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/stɔːl/",
            "us": "/stɔːl/"
        },
        "nearby": [
            {
                "word": "stalking",
                "pos": "noun"
            },
            {
                "word": "stalking horse",
                "pos": "noun"
            },
            {
                "word": "stall",
                "pos": "noun"
            },
            {
                "word": "stall",
                "pos": "verb"
            },
            {
                "word": "stallholder",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a table or small shop with an open front that people sell things from, especially at a market",
                    "vi": "một cái bàn hoặc một cửa hàng nhỏ có mặt tiền thoáng để mọi người bán đồ, đặc biệt là ở chợ"
                },
                "examples": [
                    {
                        "en": "He works on a market stall in the Square.",
                        "vi": "Anh ta làm việc trên một quầy hàng trong chợ ở Quảng trường."
                    },
                    {
                        "en": "They have a fish stall on the market.",
                        "vi": "Họ có một quầy bán cá trên thị trường."
                    },
                    {
                        "en": "Drinks were being sold from makeshift stalls at the side of the road.",
                        "vi": "Đồ uống được bán từ các quầy hàng tạm bợ bên đường."
                    }
                ]
            },
            {
                "define": {
                    "en": "a section inside a farm building that is large enough for one animal to be kept in",
                    "vi": "một phần bên trong một tòa nhà trang trại đủ lớn cho một con vật được nuôi trong"
                },
                "examples": [
                    {
                        "en": "We had to muck out stalls and groom the horses.",
                        "vi": "Chúng tôi phải dọn chuồng và chải lông cho ngựa."
                    }
                ]
            },
            {
                "define": {
                    "en": "a small area in a room, surrounded by glass, walls, etc., that contains a shower or toilet",
                    "vi": "một khu vực nhỏ trong phòng, được bao quanh bởi kính, tường, v.v., có vòi hoa sen hoặc nhà vệ sinh"
                },
                "examples": [
                    {
                        "en": "a bathroom stall",
                        "vi": "quầy hàng trong phòng tắm"
                    }
                ]
            },
            {
                "define": {
                    "en": "the seats that are nearest to the stage in a theatre",
                    "vi": "những chỗ ngồi gần sân khấu nhất trong rạp hát"
                },
                "examples": [
                    {
                        "en": "the front row of the stalls",
                        "vi": "hàng trước của quầy hàng"
                    }
                ]
            },
            {
                "define": {
                    "en": "the seats at the front of a church where the choir (= singers) and priests sit",
                    "vi": "ghế ở phía trước của một nhà thờ, nơi ca đoàn (= ca sĩ) và các linh mục ngồi"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a situation in which a vehicle’s engine suddenly stops because it is not getting enough power",
                    "vi": "tình huống trong đó động cơ của xe đột ngột dừng lại do không nhận đủ công suất"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a situation in which an aircraft loses speed and goes steeply downwards",
                    "vi": "một tình huống trong đó một máy bay mất tốc độ và đi xuống dốc"
                },
                "examples": [
                    {
                        "en": "The plane went into a stall.",
                        "vi": "Máy bay bị chết máy."
                    }
                ]
            }
        ]
    },
    {
        "id": "814bbb4d3309452c8875c1e823b1fc0f",
        "word": "takings",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈteɪkɪŋz/",
            "us": "/ˈteɪkɪŋz/"
        },
        "nearby": [
            {
                "word": "take up on",
                "pos": "phrasal verb"
            },
            {
                "word": "take up with",
                "pos": "phrasal verb"
            },
            {
                "word": "takings",
                "pos": "noun"
            },
            {
                "word": "takkie",
                "pos": "noun"
            },
            {
                "word": "tal",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the amount of money that a shop, theatre, etc. receives from selling goods or tickets over a particular period of time",
                    "vi": "số tiền mà một cửa hàng, rạp hát, v.v. nhận được từ việc bán hàng hóa hoặc vé trong một khoảng thời gian cụ thể"
                },
                "examples": [
                    {
                        "en": "The box office takings are up on last week.",
                        "vi": "Doanh thu phòng vé đã tăng vào tuần trước."
                    }
                ]
            }
        ]
    },
    {
        "id": "502f8891fcd149449f67e7defe62d896",
        "word": "upper circle",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌʌpə ˈsɜːkl/",
            "us": "/ˌʌpər ˈsɜːrkl/"
        },
        "nearby": [
            {
                "word": "upper case",
                "pos": "noun"
            },
            {
                "word": "upper chamber",
                "pos": "noun"
            },
            {
                "word": "upper circle",
                "pos": "noun"
            },
            {
                "word": "upper class",
                "pos": "adjective"
            },
            {
                "word": "the upper class",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the second level of seats above the floor in a theatre",
                    "vi": "tầng thứ hai của chỗ ngồi trên sàn nhà trong rạp hát"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "832871415b774440a5b69e1c4a246ddb",
        "word": "upstage",
        "pos": "adverb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌʌpˈsteɪdʒ/",
            "us": "/ˌʌpˈsteɪdʒ/"
        },
        "nearby": [
            {
                "word": "upskilling",
                "pos": "noun"
            },
            {
                "word": "upspeak",
                "pos": "noun"
            },
            {
                "word": "upstage",
                "pos": "adverb, adjective"
            },
            {
                "word": "upstage",
                "pos": "verb"
            },
            {
                "word": "Upstairs, Downstairs",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "at or towards the back of the stage in a theatre",
                    "vi": "ở hoặc về phía sau sân khấu trong nhà hát"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "7f471fa6ef70459fa1a49ae3df2e12ab",
        "word": "wardrobe",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈwɔːdrəʊb/",
            "us": "/ˈwɔːrdrəʊb/"
        },
        "nearby": [
            {
                "word": "ward off",
                "pos": "phrasal verb"
            },
            {
                "word": "Wardour Street",
                "pos": ""
            },
            {
                "word": "wardrobe",
                "pos": "noun"
            },
            {
                "word": "wardrobe master",
                "pos": "noun"
            },
            {
                "word": "wardrobe mistress",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a large cupboard for hanging clothes in, which is either a piece of furniture or (in British English) built into the wall",
                    "vi": "một cái tủ lớn để treo quần áo, là một món đồ nội thất hoặc (bằng tiếng Anh Anh) được xây vào tường"
                },
                "examples": [
                    {
                        "en": "a fitted wardrobe",
                        "vi": "một tủ quần áo vừa vặn"
                    }
                ]
            },
            {
                "define": {
                    "en": "the clothes that a person has",
                    "vi": "quần áo mà một người có"
                },
                "examples": [
                    {
                        "en": "We have everything you need for your summer wardrobe.",
                        "vi": "Chúng tôi có mọi thứ bạn cần cho tủ quần áo mùa hè của bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "the department in a theatre or television company that takes care of the clothes that actors wear",
                    "vi": "bộ phận trong nhà hát hoặc công ty truyền hình chăm sóc trang phục mà các diễn viên mặc"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "1b727e2942a74210942eb462f02eae63",
        "word": "wing",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/wɪŋ/",
            "us": "/wɪŋ/"
        },
        "nearby": [
            {
                "word": "wine vinegar",
                "pos": "noun"
            },
            {
                "word": "wine waiter",
                "pos": "noun"
            },
            {
                "word": "wing",
                "pos": "noun"
            },
            {
                "word": "wing",
                "pos": "verb"
            },
            {
                "word": "wing back",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "one of the parts of the body of a bird, insect or bat that it uses for flying",
                    "vi": "một trong những bộ phận trên cơ thể của chim, côn trùng hoặc dơi mà nó sử dụng để bay"
                },
                "examples": [
                    {
                        "en": "The swan flapped its wings noisily.",
                        "vi": "Con thiên nga vỗ cánh ồn ào."
                    },
                    {
                        "en": "wing feathers",
                        "vi": "lông cánh"
                    }
                ]
            },
            {
                "define": {
                    "en": "the wing of a chicken, etc. eaten as food",
                    "vi": "cánh của một con gà, v.v. được ăn làm thức ăn"
                },
                "examples": [
                    {
                        "en": "We ordered the fried chicken wings.",
                        "vi": "Chúng tôi gọi món cánh gà rán."
                    },
                    {
                        "en": "First, fry the chicken wings in the oil until they begin to brown.",
                        "vi": "Đầu tiên, chiên cánh gà trong dầu cho đến khi chúng bắt đầu chuyển sang màu nâu."
                    }
                ]
            },
            {
                "define": {
                    "en": "one of the large flat parts that stick out from the side of a plane and help to keep it in the air when it is flying",
                    "vi": "một trong những bộ phận phẳng lớn nhô ra khỏi thành bên của máy bay và giúp giữ nó trong không khí khi nó đang bay"
                },
                "examples": [
                    {
                        "en": "Salvage teams have been able to recover part of the wing of the plane.",
                        "vi": "Các đội trục vớt đã trục vớt được một phần cánh của máy bay."
                    },
                    {
                        "en": "The right wing grazed the runway on landing.",
                        "vi": "Cánh phải sượt qua đường băng khi hạ cánh."
                    }
                ]
            },
            {
                "define": {
                    "en": "a part of a large building that sticks out from the main part",
                    "vi": "một phần của tòa nhà lớn nhô ra khỏi phần chính"
                },
                "examples": [
                    {
                        "en": "the east wing",
                        "vi": "cánh đông"
                    },
                    {
                        "en": "the new wing of the hospital",
                        "vi": "cánh mới của bệnh viện"
                    },
                    {
                        "en": "Our rooms were in the west wing.",
                        "vi": "Phòng của chúng tôi ở cánh phía tây."
                    }
                ]
            },
            {
                "define": {
                    "en": "a part of a car that is above a wheel",
                    "vi": "một bộ phận của ô tô ở phía trên bánh xe"
                },
                "examples": [
                    {
                        "en": "There was a dent in the nearside wing.",
                        "vi": "Có một vết lõm ở cánh gần."
                    }
                ]
            },
            {
                "define": {
                    "en": "one section of an organization that has a particular function or whose members share the same opinions",
                    "vi": "một bộ phận của tổ chức có một chức năng cụ thể hoặc có các thành viên có cùng quan điểm"
                },
                "examples": [
                    {
                        "en": "The radical wing of the party was dissatisfied with the policies.",
                        "vi": "Cánh cấp tiến của đảng đã không hài lòng với các chính sách."
                    },
                    {
                        "en": "The political wing of the National Resistance Army entered into negotiations with the government.",
                        "vi": "Cánh chính trị của Quân đội Kháng chiến Quốc gia tham gia đàm phán với chính phủ."
                    },
                    {
                        "en": "They're on the left wing of the Labour Party.",
                        "vi": "Họ thuộc cánh trái của Đảng Lao động."
                    }
                ]
            },
            {
                "define": {
                    "en": "either of the attacking players who play towards the side of the playing area in sports such as football (soccer) or hockey",
                    "vi": "một trong các cầu thủ tấn công chơi về phía bên của khu vực chơi trong các môn thể thao như bóng đá (bóng đá) hoặc khúc côn cầu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the far left or right side of the sports field",
                    "vi": "ngoài cùng bên trái hoặc bên phải của sân thể thao"
                },
                "examples": [
                    {
                        "en": "He plays on the wing.",
                        "vi": "Anh ấy chơi ở cánh."
                    }
                ]
            },
            {
                "define": {
                    "en": "the area at either side of the stage that cannot be seen by the audience",
                    "vi": "khu vực ở hai bên của sân khấu mà khán giả không thể nhìn thấy"
                },
                "examples": [
                    {
                        "en": "She watched every performance from the wings.",
                        "vi": "Cô ấy theo dõi mọi màn trình diễn từ đôi cánh."
                    }
                ]
            },
            {
                "define": {
                    "en": "to limit a person’s freedom or power",
                    "vi": "để hạn chế quyền tự do hoặc quyền lực của một người"
                },
                "examples": [
                    {
                        "en": "Having a new baby to take care of has clipped her wings.",
                        "vi": "Có một em bé mới để chăm sóc đã chắp cánh cho cô ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to pass the exams that mean you are allowed to fly a plane",
                    "vi": "để vượt qua các kỳ thi có nghĩa là bạn được phép lái máy bay"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "ready to take over a particular job or be used in a particular situation when needed",
                    "vi": "sẵn sàng đảm nhận một công việc cụ thể hoặc được sử dụng trong một tình huống cụ thể khi cần thiết"
                },
                "examples": [
                    {
                        "en": "She was aware of a whole host of ambitious young managers waiting in the wings.",
                        "vi": "Cô nhận thức được rằng có rất nhiều nhà quản lý trẻ đầy tham vọng đang chờ đợi trong cánh."
                    },
                    {
                        "en": "There's a wealth of talent waiting in the wings of British theatre.",
                        "vi": "Có rất nhiều tài năng đang chờ đợi trong cánh của nhà hát Anh."
                    }
                ]
            },
            {
                "define": {
                    "en": "flying",
                    "vi": "bay"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "with only a very slight chance of success",
                    "vi": "chỉ với một cơ hội thành công rất nhỏ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to become more independent and confident and try new activities, etc.",
                    "vi": "để trở nên độc lập và tự tin hơn và thử các hoạt động mới, v.v."
                },
                "examples": [
                    {
                        "en": "Going to college gave her the chance to spread her wings.",
                        "vi": "Vào đại học đã cho cô cơ hội để chắp cánh cho mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to take care of and help somebody who has less experience of something than you",
                    "vi": "để chăm sóc và giúp đỡ ai đó có ít kinh nghiệm về điều gì đó hơn bạn"
                },
                "examples": [
                    {
                        "en": "Simon's uncle had taken him under his wing.",
                        "vi": "Chú của Simon đã đưa anh ta về dưới trướng của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to fly away",
                    "vi": "bay đi"
                },
                "examples": [
                    {
                        "en": "(figurative) Her imagination took wing.",
                        "vi": "(nghĩa bóng) Trí tưởng tượng của cô ấy đã thành công."
                    }
                ]
            }
        ]
    }
]