[
    {
        "id": "4a20f29938014a6989c0bf59323ab6f9",
        "word": "marry",
        "pos": "verb",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈmæri/",
            "us": "/ˈmæri/"
        },
        "nearby": [
            {
                "word": "marrowbone",
                "pos": "noun"
            },
            {
                "word": "marrowfat pea",
                "pos": "noun"
            },
            {
                "word": "marry",
                "pos": "verb"
            },
            {
                "word": "marry into",
                "pos": "phrasal verb"
            },
            {
                "word": "marry off",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to become the husband or wife of somebody; to get married to somebody",
                    "vi": "trở thành vợ hoặc chồng của ai đó; kết hôn với ai đó"
                },
                "examples": [
                    {
                        "en": "marry (somebody) She married a German.",
                        "vi": "cưới (ai đó) Cô ấy kết hôn với một người Đức."
                    },
                    {
                        "en": "He was 36 when he married Viv.",
                        "vi": "Anh ấy 36 tuổi khi kết hôn với Viv."
                    },
                    {
                        "en": "I don't want to marry Robert.",
                        "vi": "Tôi không muốn kết hôn với Robert."
                    },
                    {
                        "en": "We got married in a small village church.",
                        "vi": "Chúng tôi kết hôn trong một nhà thờ nhỏ của làng."
                    },
                    {
                        "en": "Dali and Gala were married in a civil ceremony in Paris.",
                        "vi": "Dali và Gala đã kết hôn trong một buổi lễ dân sự ở Paris."
                    },
                    {
                        "en": "He never married.",
                        "vi": "Anh ấy chưa bao giờ kết hôn."
                    },
                    {
                        "en": "I guess I'm not the marrying kind (= the kind of person who wants to get married).",
                        "vi": "Tôi đoán tôi không phải là loại người muốn kết hôn (= loại người muốn kết hôn)."
                    },
                    {
                        "en": "+ adj. They married young.",
                        "vi": "Err:509"
                    }
                ]
            },
            {
                "define": {
                    "en": "to perform a ceremony in which two people get married",
                    "vi": "để thực hiện một nghi lễ mà hai người kết hôn"
                },
                "examples": [
                    {
                        "en": "They were married by the local priest.",
                        "vi": "Họ đã kết hôn bởi một linh mục địa phương."
                    }
                ]
            },
            {
                "define": {
                    "en": "to find a husband or wife for somebody, especially your daughter or son",
                    "vi": "để tìm một người chồng hoặc vợ cho ai đó, đặc biệt là con gái hoặc con trai của bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to combine two different things, ideas, etc. successfully",
                    "vi": "để kết hợp thành công hai thứ, ý tưởng, v.v. khác nhau"
                },
                "examples": [
                    {
                        "en": "marry A and B The music business marries art and commerce.",
                        "vi": "kết hôn với A và B Ngành kinh doanh âm nhạc kết hợp giữa nghệ thuật và thương mại."
                    },
                    {
                        "en": "marry A with/to B The focus for business should be how to marry economic efficiency with social justice.",
                        "vi": "kết hôn A với / với B Trọng tâm của kinh doanh là làm thế nào để kết hợp hiệu quả kinh tế với công bằng xã hội."
                    }
                ]
            },
            {
                "define": {
                    "en": "people who marry quickly, without really getting to know each other, may discover later that they have made a mistake",
                    "vi": "những người kết hôn nhanh chóng, không thực sự tìm hiểu nhau, sau này có thể phát hiện ra rằng họ đã mắc sai lầm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to marry a rich person",
                    "vi": "kết hôn với một người giàu có"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "200f83039294408fbf77f7589315abc6",
        "word": "wedding",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈwedɪŋ/",
            "us": "/ˈwedɪŋ/"
        },
        "nearby": [
            {
                "word": "we'd",
                "pos": "short form"
            },
            {
                "word": "wedded",
                "pos": "adjective"
            },
            {
                "word": "wedding",
                "pos": "noun"
            },
            {
                "word": "wedding anniversary",
                "pos": "noun"
            },
            {
                "word": "wedding band",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a marriage ceremony, and the meal or party that usually follows it",
                    "vi": "một buổi lễ kết hôn và bữa ăn hoặc bữa tiệc thường diễn ra sau đó"
                },
                "examples": [
                    {
                        "en": "I dreamed of having a big wedding, with all my family and friends.",
                        "vi": "Tôi mơ ước có một đám cưới lớn, với tất cả gia đình và bạn bè của tôi."
                    },
                    {
                        "en": "I'm going to a wedding this weekend.",
                        "vi": "Cuối tuần này tôi sẽ đi ăn cưới."
                    },
                    {
                        "en": "Have you been invited to their wedding?",
                        "vi": "Bạn đã được mời đến dự đám cưới của họ chưa?"
                    },
                    {
                        "en": "television coverage of the royal wedding",
                        "vi": "truyền hình đưa tin về đám cưới hoàng gia"
                    },
                    {
                        "en": "at a wedding I met her at my brother's wedding.",
                        "vi": "trong một đám cưới tôi gặp cô ấy trong đám cưới của anh trai tôi."
                    },
                    {
                        "en": "wedding to somebody Over 300 guests attended his wedding to his childhood sweetheart.",
                        "vi": "đám cưới với ai đó Hơn 300 khách đã tham dự đám cưới của anh ấy với người yêu thời thơ ấu của anh ấy."
                    },
                    {
                        "en": "a wedding ceremony/reception",
                        "vi": "một lễ cưới / tiệc chiêu đãi"
                    },
                    {
                        "en": "She looked beautiful on her wedding day.",
                        "vi": "Cô ấy trông thật xinh đẹp trong ngày cưới của mình."
                    },
                    {
                        "en": "a wedding present/gift",
                        "vi": "quà cưới / quà"
                    },
                    {
                        "en": "All her friends could hear wedding bells (= they thought she would soon get married).",
                        "vi": "Tất cả bạn bè của cô ấy đều có thể nghe thấy tiếng chuông đám cưới (= họ nghĩ rằng cô ấy sẽ sớm kết hôn)."
                    }
                ]
            }
        ]
    },
    {
        "id": "42c860a2d2ac4ee7966c33cc6c9847fe",
        "word": "bury",
        "pos": "verb",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈberi/",
            "us": "/ˈberi/"
        },
        "nearby": [
            {
                "word": "Burundi",
                "pos": "noun"
            },
            {
                "word": "Burundian",
                "pos": "noun, adjective"
            },
            {
                "word": "bury",
                "pos": "verb"
            },
            {
                "word": "bury yourself in",
                "pos": "phrasal verb"
            },
            {
                "word": "bus",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to place a dead body in the ground",
                    "vi": "đặt một xác chết dưới đất"
                },
                "examples": [
                    {
                        "en": "bury somebody/something They killed her and buried her body.",
                        "vi": "chôn ai đó / cái gì đó Họ đã giết cô ấy và chôn xác cô ấy."
                    },
                    {
                        "en": "bury somebody/something + adv./prep. He was buried in Highgate Cemetery.",
                        "vi": "chôn ai đó / cái gì đó + adv./prep. Ông được chôn cất tại Nghĩa trang Highgate."
                    },
                    {
                        "en": "(figurative) Their ambitions were finally dead and buried.",
                        "vi": "(nghĩa bóng) Tham vọng của họ cuối cùng đã chết và bị chôn vùi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to lose somebody by death",
                    "vi": "để mất ai đó bằng cái chết"
                },
                "examples": [
                    {
                        "en": "She's 85 and has buried three husbands.",
                        "vi": "Bà 85 tuổi và đã chôn cất ba đời chồng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to hide something in the ground",
                    "vi": "giấu một cái gì đó dưới đất"
                },
                "examples": [
                    {
                        "en": "bury something We used to dig for hours, looking for buried treasure.",
                        "vi": "chôn thứ gì đó Chúng ta đã từng đào hàng giờ, tìm kiếm kho báu bị chôn vùi."
                    },
                    {
                        "en": "They plan to bury a time capsule containing work from every child in the school.",
                        "vi": "Họ dự định chôn một viên thời gian chứa công việc của mọi đứa trẻ trong trường."
                    },
                    {
                        "en": "bury something + adv./prep. The dog had buried its bone in the garden.",
                        "vi": "chôn cái gì đó + adv./prep. Con chó đã chôn xương trong vườn."
                    },
                    {
                        "en": "The waste is buried deep underground.",
                        "vi": "Chất thải được chôn sâu dưới lòng đất."
                    }
                ]
            },
            {
                "define": {
                    "en": "to cover somebody/something with soil, rocks, leaves, etc.",
                    "vi": "để che phủ ai đó / thứ gì đó bằng đất, đá, lá cây, v.v."
                },
                "examples": [
                    {
                        "en": "bury somebody/something A landslide buried about 25 people yesterday.",
                        "vi": "chôn ai đó / cái gì đó Một trận lở đất đã chôn vùi khoảng 25 người vào ngày hôm qua."
                    },
                    {
                        "en": "bury somebody/something + adv./prep. The house was buried under ten feet of snow.",
                        "vi": "chôn ai đó / cái gì đó + adv./prep. Ngôi nhà đã bị chôn vùi dưới lớp tuyết dày 10 feet."
                    },
                    {
                        "en": "Another vehicle was found buried under rubble.",
                        "vi": "Một phương tiện khác được tìm thấy bị chôn vùi dưới đống đổ nát."
                    },
                    {
                        "en": "bury somebody/something + adj. The miners were buried alive when the tunnel collapsed.",
                        "vi": "chôn ai đó / cái gì đó + adj. Những người thợ mỏ bị chôn sống khi đường hầm bị sập."
                    }
                ]
            },
            {
                "define": {
                    "en": "to cover something so that it cannot be seen",
                    "vi": "để che một cái gì đó để nó không thể được nhìn thấy"
                },
                "examples": [
                    {
                        "en": "Your letter got buried under a pile of papers.",
                        "vi": "Bức thư của bạn đã bị chôn vùi dưới một đống giấy tờ."
                    },
                    {
                        "en": "He buried his face in his hands and wept.",
                        "vi": "Anh vùi mặt vào tay mình và khóc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to ignore or hide a feeling, a mistake, etc.",
                    "vi": "bỏ qua hoặc che giấu một cảm giác, một sai lầm, v.v."
                },
                "examples": [
                    {
                        "en": "She had learnt to bury her feelings.",
                        "vi": "Cô đã học cách chôn giấu cảm xúc của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to put something deeply into something else",
                    "vi": "đặt một cái gì đó sâu vào một cái gì đó khác"
                },
                "examples": [
                    {
                        "en": "He walked slowly, his hands buried in his pockets.",
                        "vi": "Anh chậm rãi bước đi, hai tay vùi vào túi quần."
                    },
                    {
                        "en": "She always has her head buried in a book.",
                        "vi": "Cô ấy luôn vùi đầu vào sách."
                    }
                ]
            },
            {
                "define": {
                    "en": "to stop not being friendly and become friends again",
                    "vi": "ngừng không thân thiện và trở thành bạn bè một lần nữa"
                },
                "examples": [
                    {
                        "en": "After not speaking to each other for years, the two brothers decided to bury the hatchet.",
                        "vi": "Sau nhiều năm không nói với nhau lời nào, hai anh em quyết định chôn cất cái hầm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to refuse to admit that a problem exists or refuse to deal with it",
                    "vi": "từ chối thừa nhận rằng một vấn đề tồn tại hoặc từ chối giải quyết nó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to give the most important point of a news story near the end instead of at the beginning",
                    "vi": "để đưa ra điểm quan trọng nhất của một câu chuyện tin tức ở gần cuối thay vì ở đầu"
                },
                "examples": [
                    {
                        "en": "Unfortunately, he buried the lede in the last paragraph of the story.",
                        "vi": "Thật không may, anh ta đã chôn con chì trong đoạn cuối của câu chuyện."
                    }
                ]
            }
        ]
    },
    {
        "id": "91e4561826e84731ade3046cec1d743a",
        "word": "celebration",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˌselɪˈbreɪʃn/",
            "us": "/ˌselɪˈbreɪʃn/"
        },
        "nearby": [
            {
                "word": "celebrate",
                "pos": "verb"
            },
            {
                "word": "celebrated",
                "pos": "adjective"
            },
            {
                "word": "celebration",
                "pos": "noun"
            },
            {
                "word": "celebratory",
                "pos": "adjective"
            },
            {
                "word": "celebrity",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a special event that people organize in order to celebrate something",
                    "vi": "một sự kiện đặc biệt mà mọi người tổ chức để kỷ niệm điều gì đó"
                },
                "examples": [
                    {
                        "en": "The occasion was the 40th anniversary celebrations of the orchestra.",
                        "vi": "Sự kiện này là lễ kỷ niệm 40 năm thành lập dàn nhạc."
                    },
                    {
                        "en": "birthday celebrations",
                        "vi": "lễ kỷ niệm sinh nhật"
                    },
                    {
                        "en": "wedding/victory celebrations",
                        "vi": "lễ kỷ niệm đám cưới / chiến thắng"
                    },
                    {
                        "en": "I hope you'll join in the Christmas celebrations.",
                        "vi": "Tôi hy vọng bạn sẽ tham gia vào lễ kỷ niệm Giáng sinh."
                    },
                    {
                        "en": "They held a celebration to mark forty years of the lifeboat service.",
                        "vi": "Họ đã tổ chức một lễ kỷ niệm để đánh dấu bốn mươi năm hoạt động của xuồng cứu sinh."
                    },
                    {
                        "en": "As part of the celebrations, the school is planning an open day for the public.",
                        "vi": "Là một phần của lễ kỷ niệm, trường đang lên kế hoạch cho một ngày mở cửa cho công chúng."
                    },
                    {
                        "en": "They were among the crowd that attended the celebration.",
                        "vi": "Họ có mặt trong đám đông tham dự lễ kỷ niệm."
                    },
                    {
                        "en": "at a celebration The winners will be honoured at a celebration in Boston next week.",
                        "vi": "tại một lễ kỷ niệm Những người chiến thắng sẽ được vinh danh tại một lễ kỷ niệm ở Boston vào tuần tới."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of celebrating something",
                    "vi": "hành động kỷ niệm một cái gì đó"
                },
                "examples": [
                    {
                        "en": "Her triumph was a cause for celebration.",
                        "vi": "Chiến thắng của cô ấy là một lý do để ăn mừng."
                    },
                    {
                        "en": "celebration of something The service was a celebration of his life (= praised what he had done in his life).",
                        "vi": "Lễ kỷ niệm một điều gì đó Dịch vụ là một lễ kỷ niệm cuộc đời anh ta (= ca ngợi những gì anh ta đã làm trong cuộc đời mình)."
                    },
                    {
                        "en": "The city's annual celebration of Caribbean culture kicks off on June 4.",
                        "vi": "Lễ kỷ niệm văn hóa Caribe hàng năm của thành phố bắt đầu vào ngày 4 tháng 6."
                    },
                    {
                        "en": "in celebration of something a party in celebration of their fiftieth wedding anniversary",
                        "vi": "trong lễ kỷ niệm một cái gì đó một bữa tiệc kỷ niệm 50 năm ngày cưới của họ"
                    },
                    {
                        "en": "a day of celebration and national unity",
                        "vi": "một ngày kỷ niệm và đoàn kết dân tộc"
                    }
                ]
            }
        ]
    },
    {
        "id": "5be88b315fe84314a5e31876922c5e53",
        "word": "ceremony",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈserəməni/",
            "us": "/ˈserəməʊni/"
        },
        "nearby": [
            {
                "word": "ceremonious",
                "pos": "adjective"
            },
            {
                "word": "ceremoniously",
                "pos": "adverb"
            },
            {
                "word": "ceremony",
                "pos": "noun"
            },
            {
                "word": "the Ceremony of the Keys",
                "pos": ""
            },
            {
                "word": "cerise",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a public or religious occasion that includes a series of formal or traditional actions",
                    "vi": "một dịp công cộng hoặc tôn giáo bao gồm một loạt các hành động chính thức hoặc truyền thống"
                },
                "examples": [
                    {
                        "en": "More than 1 000 people attended the ceremony.",
                        "vi": "Hơn 1 000 người đã tham dự buổi lễ."
                    },
                    {
                        "en": "an awards/opening ceremony",
                        "vi": "lễ trao giải / khai mạc"
                    },
                    {
                        "en": "a wedding/marriage/graduation ceremony",
                        "vi": "một đám cưới / hôn nhân / lễ tốt nghiệp"
                    },
                    {
                        "en": "a religious/civil ceremony",
                        "vi": "một buổi lễ tôn giáo / dân sự"
                    },
                    {
                        "en": "The priest had travelled from Australia to perform the ceremony.",
                        "vi": "Vị linh mục đã đi từ Úc để thực hiện nghi lễ."
                    },
                    {
                        "en": "at a ceremony She was last seen in public at the closing ceremony of the Commonwealth Games",
                        "vi": "tại một buổi lễ Cô được nhìn thấy lần cuối trước công chúng tại lễ bế mạc Đại hội thể thao Khối thịnh vượng chung"
                    },
                    {
                        "en": "Who officiated at the ceremony?",
                        "vi": "Ai là người chủ trì buổi lễ?"
                    },
                    {
                        "en": "in a ceremony They were married in a simple ceremony.",
                        "vi": "trong một buổi lễ Họ đã kết hôn trong một buổi lễ đơn giản."
                    },
                    {
                        "en": "ceremony for somebody/something The villagers held a memorial ceremony for those who lost their lives in the war.",
                        "vi": "lễ cho ai đó / cái gì đó Dân làng tổ chức lễ tưởng niệm những người đã mất mạng trong chiến tranh."
                    },
                    {
                        "en": "ceremony to do something There will be a special ceremony to mark the 60th anniversary of the battle.",
                        "vi": "Lễ làm phép Sẽ có một buổi lễ đặc biệt để kỷ niệm 60 năm trận chiến."
                    }
                ]
            },
            {
                "define": {
                    "en": "formal behaviour; traditional actions and words used on particular formal occasions",
                    "vi": "tác phong chính thức; những hành động và lời nói truyền thống được sử dụng trong những dịp trang trọng cụ thể"
                },
                "examples": [
                    {
                        "en": "The royal guests were welcomed with pomp and ceremony.",
                        "vi": "Các vị khách hoàng gia được chào đón bằng sự chu đáo và lễ nghi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to behave formally",
                    "vi": "cư xử chính thức"
                },
                "examples": [
                    {
                        "en": "Please don't stand on ceremony (= Please be natural and relaxed) with me.",
                        "vi": "Xin đừng đứng trên lễ đường (= Hãy tự nhiên và thoải mái) với tôi."
                    },
                    {
                        "en": "I won't stand on ceremony.",
                        "vi": "Tôi sẽ không đứng trong buổi lễ."
                    }
                ]
            },
            {
                "define": {
                    "en": "in a very rough or informal way",
                    "vi": "một cách rất thô bạo hoặc không chính thức"
                },
                "examples": [
                    {
                        "en": "He found himself pushed without ceremony out of the house and the door slammed in his face.",
                        "vi": "Anh thấy mình bị đẩy ra khỏi nhà một cách thiếu lễ độ và cánh cửa bị đóng sầm vào mặt anh."
                    }
                ]
            }
        ]
    },
    {
        "id": "d1b130cfde3f492bb2a0d899eee36762",
        "word": "marriage",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈmærɪdʒ/",
            "us": "/ˈmærɪdʒ/"
        },
        "nearby": [
            {
                "word": "marquise",
                "pos": "noun"
            },
            {
                "word": "marram grass",
                "pos": "noun"
            },
            {
                "word": "marriage",
                "pos": "noun"
            },
            {
                "word": "marriageable",
                "pos": "adjective"
            },
            {
                "word": "marriage broker",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the legal relationship between two people who are married to each other",
                    "vi": "mối quan hệ pháp lý giữa hai người kết hôn với nhau"
                },
                "examples": [
                    {
                        "en": "a happy/an unhappy marriage",
                        "vi": "một cuộc hôn nhân hạnh phúc / không hạnh phúc"
                    },
                    {
                        "en": "All of her children's marriages ended in divorce.",
                        "vi": "Tất cả cuộc hôn nhân của các con bà đều kết thúc bằng ly hôn."
                    },
                    {
                        "en": "She has two children by a previous marriage.",
                        "vi": "Cô có hai con bởi một cuộc hôn nhân trước."
                    },
                    {
                        "en": "This is his second marriage.",
                        "vi": "Đây là cuộc hôn nhân thứ hai của anh ấy."
                    },
                    {
                        "en": "Same-sex marriages are now recognized in many countries.",
                        "vi": "Hôn nhân đồng giới hiện đã được công nhận ở nhiều quốc gia."
                    }
                ]
            },
            {
                "define": {
                    "en": "the state of being married",
                    "vi": "tình trạng kết hôn"
                },
                "examples": [
                    {
                        "en": "They don't believe in marriage.",
                        "vi": "Họ không tin vào hôn nhân."
                    },
                    {
                        "en": "My parents are celebrating 30 years of marriage.",
                        "vi": "Bố mẹ tôi đang kỷ niệm 30 năm ngày cưới."
                    },
                    {
                        "en": "Most of the public now support gay marriage.",
                        "vi": "Hầu hết công chúng hiện nay đều ủng hộ hôn nhân đồng tính."
                    },
                    {
                        "en": "before/outside marriage They strongly disapprove of sex outside marriage.",
                        "vi": "trước / ngoài hôn nhân Họ cực lực phản đối quan hệ tình dục ngoài hôn nhân."
                    }
                ]
            },
            {
                "define": {
                    "en": "the ceremony in which two people marry each other",
                    "vi": "buổi lễ mà hai người kết hôn với nhau"
                },
                "examples": [
                    {
                        "en": "Their marriage took place in a local church.",
                        "vi": "Hôn lễ của họ diễn ra tại một nhà thờ địa phương."
                    }
                ]
            },
            {
                "define": {
                    "en": "a combination of two things",
                    "vi": "sự kết hợp của hai thứ"
                },
                "examples": [
                    {
                        "en": "marriage of A and B The new collection is a marriage of fashion and technology.",
                        "vi": "Cuộc hôn nhân của A và B Bộ sưu tập mới là cuộc hôn nhân của thời trang và công nghệ."
                    },
                    {
                        "en": "marriage between A and B the marriage between a young team and an experienced coach",
                        "vi": "cuộc hôn nhân giữa A và B cuộc hôn nhân giữa một đội trẻ và một huấn luyện viên giàu kinh nghiệm"
                    }
                ]
            },
            {
                "define": {
                    "en": "when somebody is related to you by marriage, they are married to somebody in your family, or you are married to somebody in their family",
                    "vi": "khi ai đó có quan hệ với bạn bằng hôn nhân, họ kết hôn với ai đó trong gia đình bạn, hoặc bạn kết hôn với ai đó trong gia đình họ"
                },
                "examples": [
                    {
                        "en": "Jane and I are related by marriage.",
                        "vi": "Jane và tôi có quan hệ hôn nhân."
                    }
                ]
            },
            {
                "define": {
                    "en": "permission to marry somebody, especially a woman",
                    "vi": "cho phép kết hôn với ai đó, đặc biệt là một người phụ nữ"
                },
                "examples": [
                    {
                        "en": "He asked the general for his daughter's hand in marriage.",
                        "vi": "Ông xin tướng quân cho con gái ông kết hôn."
                    }
                ]
            }
        ]
    },
    {
        "id": "e5eb1b2136294975b77fd167d6878909",
        "word": "service",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈsɜːvɪs/",
            "us": "/ˈsɜːrvɪs/"
        },
        "nearby": [
            {
                "word": "servery",
                "pos": "noun"
            },
            {
                "word": "serve up",
                "pos": "phrasal verb"
            },
            {
                "word": "service",
                "pos": "noun"
            },
            {
                "word": "service",
                "pos": "verb"
            },
            {
                "word": "serviceable",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a system that provides something that the public needs, organized by the government or a private company",
                    "vi": "một hệ thống cung cấp thứ gì đó mà công chúng cần, được tổ chức bởi chính phủ hoặc một công ty tư nhân"
                },
                "examples": [
                    {
                        "en": "the ambulance/bus/postal service",
                        "vi": "xe cứu thương / xe buýt / dịch vụ bưu điện"
                    },
                    {
                        "en": "The government aims to improve public services, especially education.",
                        "vi": "Chính phủ đặt mục tiêu cải thiện các dịch vụ công, đặc biệt là giáo dục."
                    },
                    {
                        "en": "Essential services (= the supply of water, gas, electricity) will be maintained.",
                        "vi": "Các dịch vụ thiết yếu (= cung cấp nước, khí đốt, điện) sẽ được duy trì."
                    },
                    {
                        "en": "Councillors have called for better provision of services for young people.",
                        "vi": "Các ủy viên hội đồng đã kêu gọi cung cấp các dịch vụ tốt hơn cho những người trẻ tuổi."
                    },
                    {
                        "en": "The charity provides a vital service to the local community.",
                        "vi": "Tổ chức từ thiện cung cấp một dịch vụ quan trọng cho cộng đồng địa phương."
                    }
                ]
            },
            {
                "define": {
                    "en": "an organization or a company that provides something for the public or does something for the government",
                    "vi": "một tổ chức hoặc một công ty cung cấp một cái gì đó cho công chúng hoặc làm một cái gì đó cho chính phủ"
                },
                "examples": [
                    {
                        "en": "the prison service",
                        "vi": "dịch vụ nhà tù"
                    },
                    {
                        "en": "the BBC World Service",
                        "vi": "Dịch vụ Thế giới của BBC"
                    },
                    {
                        "en": "the Foreign Service",
                        "vi": "Bộ Ngoại giao"
                    }
                ]
            },
            {
                "define": {
                    "en": "a business whose work involves doing something for customers but not producing goods; the work that such a business does",
                    "vi": "một doanh nghiệp có công việc liên quan đến việc làm một cái gì đó cho khách hàng nhưng không sản xuất hàng hóa; công việc mà một doanh nghiệp như vậy làm"
                },
                "examples": [
                    {
                        "en": "financial services",
                        "vi": "các dịch vụ tài chính"
                    },
                    {
                        "en": "the development of new goods and services",
                        "vi": "sự phát triển của hàng hóa và dịch vụ mới"
                    },
                    {
                        "en": "Smith's Catering Services (= a company) offers the best value.",
                        "vi": "Smith's Catering Services (= một công ty) mang lại giá trị tốt nhất."
                    },
                    {
                        "en": "We guarantee (an) excellent service.",
                        "vi": "Chúng tôi đảm bảo (một) dịch vụ xuất sắc."
                    },
                    {
                        "en": "We aim to provide a high-quality service.",
                        "vi": "Chúng tôi mong muốn cung cấp một dịch vụ chất lượng cao."
                    },
                    {
                        "en": "They offer an after-care service.",
                        "vi": "Họ cung cấp một dịch vụ chăm sóc sau."
                    },
                    {
                        "en": "Training the staff required to deliver the service remains a challenge.",
                        "vi": "Đào tạo nhân viên cần thiết để cung cấp dịch vụ vẫn là một thách thức."
                    },
                    {
                        "en": "We are working hard to improve the services that we provide.",
                        "vi": "Chúng tôi đang làm việc chăm chỉ để cải thiện các dịch vụ mà chúng tôi cung cấp."
                    },
                    {
                        "en": "The number of people using the service has fallen.",
                        "vi": "Số lượng người sử dụng dịch vụ đã giảm."
                    },
                    {
                        "en": "I am not willing to pay for a service I am not receiving.",
                        "vi": "Tôi không sẵn sàng trả tiền cho một dịch vụ mà tôi không nhận được."
                    },
                    {
                        "en": "We offer clients a broad range of services.",
                        "vi": "Chúng tôi cung cấp cho khách hàng một loạt các dịch vụ."
                    },
                    {
                        "en": "the service sector (= the part of the economy involved in this type of business)",
                        "vi": "khu vực dịch vụ (= một phần của nền kinh tế tham gia vào loại hình kinh doanh này)"
                    },
                    {
                        "en": "a service industry",
                        "vi": "một ngành dịch vụ"
                    }
                ]
            },
            {
                "define": {
                    "en": "the serving of customers in hotels, restaurants, and shops",
                    "vi": "phục vụ khách hàng trong khách sạn, nhà hàng và cửa hàng"
                },
                "examples": [
                    {
                        "en": "The food was good but the service was very slow.",
                        "vi": "Thức ăn ngon nhưng dịch vụ rất chậm."
                    },
                    {
                        "en": "I complained about the poor service.",
                        "vi": "Tôi phàn nàn về dịch vụ kém."
                    },
                    {
                        "en": "10% will be added to your bill for service.",
                        "vi": "10% sẽ được thêm vào hóa đơn dịch vụ của bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "the work that somebody does for an organization, etc., especially when it continues for a long time or is admired very much",
                    "vi": "công việc mà ai đó làm cho một tổ chức, v.v., đặc biệt là khi nó tiếp tục trong một thời gian dài hoặc được ngưỡng mộ rất nhiều"
                },
                "examples": [
                    {
                        "en": "service with something She has just celebrated 25 years' service with the company.",
                        "vi": "dịch vụ với một cái gì đó Cô ấy vừa kỷ niệm 25 năm phục vụ với công ty."
                    },
                    {
                        "en": "service to something He has retired after 30 years of dedicated service to the local community.",
                        "vi": "Ông đã nghỉ hưu sau 30 năm cống hiến cho cộng đồng địa phương."
                    },
                    {
                        "en": "She was presented with a long-service award after 40 years with the firm.",
                        "vi": "Cô đã được trao tặng giải thưởng phục vụ lâu dài sau 40 năm gắn bó với công ty."
                    },
                    {
                        "en": "The employees have good conditions of service.",
                        "vi": "Các nhân viên có điều kiện phục vụ tốt."
                    },
                    {
                        "en": "After retiring, she became involved in voluntary service in the local community.",
                        "vi": "Sau khi nghỉ hưu, cô đã tham gia hoạt động tình nguyện trong cộng đồng địa phương."
                    }
                ]
            },
            {
                "define": {
                    "en": "the army, the navy and the air force; the work done by people in them",
                    "vi": "lục quân, hải quân và không quân; công việc được thực hiện bởi những người trong họ"
                },
                "examples": [
                    {
                        "en": "Most of the boys went straight into the services.",
                        "vi": "Hầu hết các chàng trai đã đi thẳng vào các dịch vụ."
                    },
                    {
                        "en": "He saw service in North Africa.",
                        "vi": "Anh ấy đã thấy dịch vụ ở Bắc Phi."
                    },
                    {
                        "en": "After service in the US Army, he began his legal career.",
                        "vi": "Sau khi phục vụ trong Quân đội Hoa Kỳ, ông bắt đầu sự nghiệp luật sư của mình."
                    },
                    {
                        "en": "the country's military intelligence services",
                        "vi": "dịch vụ tình báo quân sự của đất nước"
                    },
                    {
                        "en": "a service family",
                        "vi": "một gia đình dịch vụ"
                    }
                ]
            },
            {
                "define": {
                    "en": "the use that you can get from a vehicle or machine; the state of being used",
                    "vi": "việc sử dụng mà bạn có thể nhận được từ một chiếc xe hoặc máy móc; trạng thái được sử dụng"
                },
                "examples": [
                    {
                        "en": "That computer gave us very good service.",
                        "vi": "Máy tính đó đã cung cấp cho chúng tôi dịch vụ rất tốt."
                    },
                    {
                        "en": "in service This bus is not in service.",
                        "vi": "đang hoạt động Xe buýt này không hoạt động."
                    },
                    {
                        "en": "out of service The ship will be taken out of service within two years.",
                        "vi": "hết hoạt động Con tàu sẽ ngừng hoạt động trong vòng hai năm."
                    }
                ]
            },
            {
                "define": {
                    "en": "an examination of a vehicle or machine followed by any work that is necessary to keep it operating well",
                    "vi": "kiểm tra phương tiện hoặc máy móc sau đó là bất kỳ công việc nào cần thiết để giữ cho nó hoạt động tốt"
                },
                "examples": [
                    {
                        "en": "a service engineer",
                        "vi": "một kỹ sư dịch vụ"
                    },
                    {
                        "en": "(British English) I had taken the car in for a service.",
                        "vi": "(Anh Anh) Tôi đã lấy xe hơi cho một dịch vụ."
                    },
                    {
                        "en": "(North American English) I had taken the car in for service.",
                        "vi": "(Tiếng Anh Bắc Mỹ) Tôi đã đưa xe vào dịch vụ."
                    }
                ]
            },
            {
                "define": {
                    "en": "the particular skills or help that a person is able to offer",
                    "vi": "các kỹ năng cụ thể hoặc sự giúp đỡ mà một người có thể cung cấp"
                },
                "examples": [
                    {
                        "en": "You need the services of a good lawyer.",
                        "vi": "Bạn cần dịch vụ của một luật sư giỏi."
                    },
                    {
                        "en": "service as somebody/something He offered his services as a driver.",
                        "vi": "dịch vụ như một ai đó / cái gì đó Anh ấy đã cung cấp dịch vụ của mình với tư cách là một người lái xe."
                    }
                ]
            },
            {
                "define": {
                    "en": "a religious ceremony",
                    "vi": "một buổi lễ tôn giáo"
                },
                "examples": [
                    {
                        "en": "a funeral/memorial service",
                        "vi": "một lễ tang / lễ tưởng niệm"
                    },
                    {
                        "en": "A memorial service will be held at St James's Church on Sunday.",
                        "vi": "Một buổi lễ tưởng niệm sẽ được tổ chức tại Nhà thờ St James vào Chủ nhật."
                    },
                    {
                        "en": "More than 100 people attended the service.",
                        "vi": "Hơn 100 người đã tham dự buổi lễ."
                    },
                    {
                        "en": "to go to morning/evening service",
                        "vi": "đi phục vụ buổi sáng / buổi tối"
                    }
                ]
            },
            {
                "define": {
                    "en": "a bus, train, etc. that goes regularly to a particular place at a particular time",
                    "vi": "xe buýt, xe lửa, v.v. thường xuyên đến một địa điểm cụ thể vào một thời điểm cụ thể"
                },
                "examples": [
                    {
                        "en": "the cancellation of the 10.15 service to Glasgow",
                        "vi": "việc hủy bỏ dịch vụ 10.15 đến Glasgow"
                    }
                ]
            },
            {
                "define": {
                    "en": "a place next to a motorway where you can stop for petrol, a meal, the toilets, etc.",
                    "vi": "một nơi bên cạnh đường cao tốc, nơi bạn có thể dừng lại để đổ xăng, ăn uống, nhà vệ sinh, v.v."
                },
                "examples": [
                    {
                        "en": "motorway services",
                        "vi": "dịch vụ đường cao tốc"
                    },
                    {
                        "en": "It's five miles to the next services.",
                        "vi": "Còn năm dặm nữa là đến các dịch vụ tiếp theo."
                    }
                ]
            },
            {
                "define": {
                    "en": "an act of hitting the ball in order to start playing; the way that you hit it",
                    "vi": "một hành động đánh bóng để bắt đầu chơi; cách bạn đánh nó"
                },
                "examples": [
                    {
                        "en": "It's your service (= your turn to start playing).",
                        "vi": "Đó là dịch vụ của bạn (= đến lượt bạn bắt đầu chơi)."
                    },
                    {
                        "en": "Her service has improved.",
                        "vi": "Dịch vụ của cô ấy đã được cải thiện."
                    }
                ]
            },
            {
                "define": {
                    "en": "a complete set of plates, dishes, etc. that match each other",
                    "vi": "một bộ đầy đủ các đĩa, đĩa, v.v. khớp với nhau"
                },
                "examples": [
                    {
                        "en": "a tea service (= cups, saucers, a teapot and plates, for serving tea)",
                        "vi": "một dịch vụ trà (= tách, đĩa, ấm trà và đĩa, để phục vụ trà)"
                    }
                ]
            },
            {
                "define": {
                    "en": "the state or position of being a servant",
                    "vi": "trạng thái hoặc vị trí của một người hầu"
                },
                "examples": [
                    {
                        "en": "to be in/go into service (= to be/become a servant)",
                        "vi": "được trong / đi phục vụ (= trở thành / trở thành người hầu)"
                    },
                    {
                        "en": "a job in domestic service",
                        "vi": "một công việc giúp việc gia đình"
                    }
                ]
            },
            {
                "define": {
                    "en": "the formal giving of an official document, etc. to somebody",
                    "vi": "việc trao chính thức một tài liệu chính thức, v.v. cho ai đó"
                },
                "examples": [
                    {
                        "en": "the service of a demand for payment",
                        "vi": "dịch vụ của một nhu cầu thanh toán"
                    }
                ]
            },
            {
                "define": {
                    "en": "completely available for somebody to use or to help somebody",
                    "vi": "hoàn toàn có sẵn để ai đó sử dụng hoặc để giúp ai đó"
                },
                "examples": [
                    {
                        "en": "Healthcare must be at the service of all who need it.",
                        "vi": "Chăm sóc sức khỏe phải phục vụ tất cả những ai cần."
                    },
                    {
                        "en": "(formal or humorous) If you need anything, I am at your service.",
                        "vi": "(trang trọng hoặc hài hước) Nếu bạn cần bất cứ điều gì, tôi sẽ phục vụ bạn."
                    },
                    {
                        "en": "The cabin staff are at your service throughout the flight.",
                        "vi": "Các nhân viên tiếp viên phục vụ bạn trong suốt chuyến bay."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be useful or helpful",
                    "vi": "hữu ích hoặc hữu ích"
                },
                "examples": [
                    {
                        "en": "Can I be of service to anyone?",
                        "vi": "Tôi có thể phục vụ bất cứ ai?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to do something that is helpful/not helpful to somebody",
                    "vi": "làm điều gì đó hữu ích / không hữu ích cho ai đó"
                },
                "examples": [
                    {
                        "en": "She was doing herself no service by remaining silent.",
                        "vi": "Cô ấy không phục vụ mình bằng cách giữ im lặng."
                    },
                    {
                        "en": "You have done us a great service.",
                        "vi": "Bạn đã làm cho chúng tôi một dịch vụ tuyệt vời."
                    }
                ]
            },
            {
                "define": {
                    "en": "to use somebody/something for a purpose that they were not trained or intended for because there is nobody or nothing else available",
                    "vi": "sử dụng ai đó / cái gì đó cho một mục đích mà họ không được đào tạo hoặc dự định vì không có ai hoặc không có gì khác"
                },
                "examples": [
                    {
                        "en": "Every type of boat was pressed into service to rescue passengers from the sinking ferry.",
                        "vi": "Các loại thuyền đều dồn dập tham gia cứu hộ hành khách thoát khỏi vụ chìm phà."
                    }
                ]
            }
        ]
    },
    {
        "id": "7d4263810a4047dc8fc598acc32af9ca",
        "word": "burial",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈberiəl/",
            "us": "/ˈberiəl/"
        },
        "nearby": [
            {
                "word": "burgundy",
                "pos": "noun"
            },
            {
                "word": "burgundy",
                "pos": "adjective"
            },
            {
                "word": "burial",
                "pos": "noun"
            },
            {
                "word": "burial ground",
                "pos": "noun"
            },
            {
                "word": "burka",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act or ceremony of burying a dead body",
                    "vi": "hành động hoặc nghi lễ chôn cất một xác chết"
                },
                "examples": [
                    {
                        "en": "a burial place/mound/site",
                        "vi": "một nơi chôn cất / gò đất / địa điểm"
                    },
                    {
                        "en": "Her body was sent home for burial.",
                        "vi": "Thi thể của cô đã được đưa về nhà để mai táng."
                    },
                    {
                        "en": "His family insisted he should be given a proper burial.",
                        "vi": "Gia đình anh khẳng định anh nên được chôn cất đàng hoàng."
                    },
                    {
                        "en": "baptism, marriage and burial services",
                        "vi": "lễ rửa tội, hôn nhân và mai táng"
                    }
                ]
            }
        ]
    },
    {
        "id": "702be7a893ad408890dc79eea8479187",
        "word": "christening",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈkrɪsnɪŋ/",
            "us": "/ˈkrɪsnɪŋ/"
        },
        "nearby": [
            {
                "word": "christen",
                "pos": "verb"
            },
            {
                "word": "Christendom",
                "pos": "noun"
            },
            {
                "word": "christening",
                "pos": "noun"
            },
            {
                "word": "Christian",
                "pos": "adjective"
            },
            {
                "word": "Christian",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a Christian ceremony in which a baby is officially named and welcomed into the Christian Church",
                    "vi": "một buổi lễ Cơ đốc, trong đó một em bé được chính thức đặt tên và chào đón vào Nhà thờ Cơ đốc"
                },
                "examples": [
                    {
                        "en": "We all got together at the christening.",
                        "vi": "Tất cả chúng tôi đã cùng nhau làm lễ rửa tội."
                    },
                    {
                        "en": "my nephew’s christening",
                        "vi": "cháu trai tôi đang làm lễ rửa tội"
                    }
                ]
            }
        ]
    },
    {
        "id": "d9674375fa314b7bac7ca3d50920bf31",
        "word": "funeral",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈfjuːnərəl/",
            "us": "/ˈfjuːnərəl/"
        },
        "nearby": [
            {
                "word": "fundraiser",
                "pos": "noun"
            },
            {
                "word": "fundraising",
                "pos": "noun"
            },
            {
                "word": "funeral",
                "pos": "noun"
            },
            {
                "word": "funeral director",
                "pos": "noun"
            },
            {
                "word": "funeral parlour",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a ceremony, often a religious one, for burying or cremating (= burning) a dead person",
                    "vi": "một nghi lễ, thường là một nghi lễ tôn giáo, để chôn hoặc hỏa táng (= thiêu) một người đã chết"
                },
                "examples": [
                    {
                        "en": "Hundreds of people attended the funeral.",
                        "vi": "Hàng trăm người đã đến tham dự lễ tang."
                    },
                    {
                        "en": "a funeral procession",
                        "vi": "một đám tang"
                    },
                    {
                        "en": "a funeral march (= a sad piece of music suitable for funerals)",
                        "vi": "a tang diễu hành (= một bản nhạc buồn thích hợp cho tang lễ)"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to tell somebody that they, and nobody else, will have to deal with the unpleasant results of their own actions",
                    "vi": "được sử dụng để nói với ai đó rằng họ, và không ai khác, sẽ phải đối mặt với những kết quả khó chịu do hành động của chính họ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "e09d8b9f0d4e4739b30d395f9da2913c",
        "word": "procession",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/prəˈseʃn/",
            "us": "/prəˈseʃn/"
        },
        "nearby": [
            {
                "word": "process2",
                "pos": "verb"
            },
            {
                "word": "processing",
                "pos": "noun"
            },
            {
                "word": "procession",
                "pos": "noun"
            },
            {
                "word": "processional",
                "pos": "adjective"
            },
            {
                "word": "processor",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a line of people or vehicles that move along slowly, especially as part of a ceremony; the act of moving in this way",
                    "vi": "một dòng người hoặc phương tiện di chuyển chậm, đặc biệt là một phần của buổi lễ; hành động di chuyển theo cách này"
                },
                "examples": [
                    {
                        "en": "a funeral procession",
                        "vi": "một đám tang"
                    },
                    {
                        "en": "a torchlight procession",
                        "vi": "rước đuốc"
                    },
                    {
                        "en": "The procession made its way down the hill.",
                        "vi": "Đoàn rước tiến xuống đồi."
                    },
                    {
                        "en": "in procession Groups of unemployed people from all over the country marched in procession to the capital.",
                        "vi": "trong đoàn rước Những người thất nghiệp từ khắp nơi trong nước diễu hành rước về thủ đô."
                    }
                ]
            },
            {
                "define": {
                    "en": "a number of people who come one after the other",
                    "vi": "một số người đến lần lượt"
                },
                "examples": [
                    {
                        "en": "A procession of waiters appeared bearing trays of food.",
                        "vi": "Một đám người phục vụ xuất hiện những khay thức ăn."
                    },
                    {
                        "en": "We've had an endless procession of new secretaries through the office since Amy left.",
                        "vi": "Chúng tôi đã có một cuộc rước vô số thư ký mới qua văn phòng kể từ khi Amy rời đi."
                    }
                ]
            }
        ]
    },
    {
        "id": "89de3d7345fe4780b6a735c35d850520",
        "word": "ritual",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈrɪtʃuəl/",
            "us": "/ˈrɪtʃuəl/"
        },
        "nearby": [
            {
                "word": "rite",
                "pos": "noun"
            },
            {
                "word": "rite of passage",
                "pos": "noun"
            },
            {
                "word": "ritual",
                "pos": "noun"
            },
            {
                "word": "ritual",
                "pos": "adjective"
            },
            {
                "word": "ritualistic",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a series of actions that are always performed in the same way, especially as part of a religious ceremony",
                    "vi": "một loạt các hành động luôn được thực hiện theo cùng một cách, đặc biệt là một phần của nghi lễ tôn giáo"
                },
                "examples": [
                    {
                        "en": "religious rituals",
                        "vi": "nghi lễ tôn giáo"
                    },
                    {
                        "en": "She objects to the ritual of organized religion.",
                        "vi": "Cô ấy phản đối các nghi lễ của tôn giáo có tổ chức."
                    }
                ]
            },
            {
                "define": {
                    "en": "something that is done regularly and always in the same way",
                    "vi": "điều gì đó được thực hiện thường xuyên và luôn theo cùng một cách"
                },
                "examples": [
                    {
                        "en": "Sunday lunch with the in-laws has become something of a ritual.",
                        "vi": "Bữa trưa Chủ nhật với các gia đình nội ngoại đã trở thành một nghi lễ."
                    }
                ]
            }
        ]
    },
    {
        "id": "97f6e1b4beee484bbf4f57e664a4ed39",
        "word": "ritual",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈrɪtʃuəl/",
            "us": "/ˈrɪtʃuəl/"
        },
        "nearby": [
            {
                "word": "rite of passage",
                "pos": "noun"
            },
            {
                "word": "ritual",
                "pos": "noun"
            },
            {
                "word": "ritual",
                "pos": "adjective"
            },
            {
                "word": "ritualistic",
                "pos": "adjective"
            },
            {
                "word": "ritualize",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "done as part of a ritual or ceremony",
                    "vi": "được thực hiện như một phần của nghi lễ hoặc nghi lễ"
                },
                "examples": [
                    {
                        "en": "ritual chanting",
                        "vi": "tụng kinh nghi lễ"
                    },
                    {
                        "en": "the accusation that they practised ritual murder",
                        "vi": "cáo buộc rằng họ đã thực hiện nghi lễ giết người"
                    },
                    {
                        "en": "the ritual practices of ancient religions",
                        "vi": "các thực hành nghi lễ của các tôn giáo cổ đại"
                    }
                ]
            },
            {
                "define": {
                    "en": "always done or said in the same way, especially when this is not sincere",
                    "vi": "luôn được thực hiện hoặc nói theo cách tương tự, đặc biệt khi điều này không chân thành"
                },
                "examples": [
                    {
                        "en": "ritual expressions of sympathy",
                        "vi": "biểu hiện nghi thức của sự cảm thông"
                    }
                ]
            }
        ]
    },
    {
        "id": "7f04f076ce1a49a5a18e4417489cfb9e",
        "word": "worship",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈwɜːʃɪp/",
            "us": "/ˈwɜːrʃɪp/"
        },
        "nearby": [
            {
                "word": "worsening",
                "pos": "adjective"
            },
            {
                "word": "worsening",
                "pos": "noun"
            },
            {
                "word": "worship",
                "pos": "noun"
            },
            {
                "word": "worship",
                "pos": "verb"
            },
            {
                "word": "worshipful",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the practice of showing respect for God or a god, by saying prayers, singing with others, etc.; a ceremony for this",
                    "vi": "thực hành thể hiện sự tôn trọng đối với Chúa hoặc một vị thần, bằng cách nói lời cầu nguyện, hát với người khác, v.v.; một buổi lễ cho điều này"
                },
                "examples": [
                    {
                        "en": "an act/a place of worship",
                        "vi": "một hành động / một nơi thờ phượng"
                    },
                    {
                        "en": "morning/evening worship (= a church service in the morning/evening)",
                        "vi": "thờ phượng buổi sáng / buổi tối (= buổi thờ phượng vào buổi sáng / buổi tối)"
                    },
                    {
                        "en": "The tradition of ancestor worship stretches back thousands of years.",
                        "vi": "Truyền thống thờ cúng tổ tiên có từ hàng nghìn năm trước."
                    }
                ]
            },
            {
                "define": {
                    "en": "a strong feeling of love and respect for somebody/something",
                    "vi": "một cảm giác mạnh mẽ của tình yêu và sự tôn trọng đối với ai đó / điều gì đó"
                },
                "examples": [
                    {
                        "en": "What she feels for him is akin to worship.",
                        "vi": "Những gì cô ấy cảm thấy đối với anh ấy giống như một sự tôn thờ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a polite way of addressing or referring to a magistrate or mayor",
                    "vi": "một cách xưng hô lịch sự hoặc đề cập đến thẩm phán hoặc thị trưởng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "3acbf9b6ee6442f1a6c01a2cc253bedd",
        "word": "worship",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈwɜːʃɪp/",
            "us": "/ˈwɜːrʃɪp/"
        },
        "nearby": [
            {
                "word": "worsening",
                "pos": "noun"
            },
            {
                "word": "worship",
                "pos": "noun"
            },
            {
                "word": "worship",
                "pos": "verb"
            },
            {
                "word": "worshipful",
                "pos": "adjective"
            },
            {
                "word": "worshipper",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to show respect for God or a god, especially by saying prayers, singing, etc. with other people in a religious building",
                    "vi": "thể hiện sự tôn kính đối với Chúa hoặc một vị thần, đặc biệt bằng cách nói những lời cầu nguyện, ca hát, v.v. với những người khác trong một tòa nhà tôn giáo"
                },
                "examples": [
                    {
                        "en": "The Mayans built jungle pyramids to worship their gods.",
                        "vi": "Người Maya đã xây dựng các kim tự tháp trong rừng để thờ cúng các vị thần của họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to go to a service in a religious building",
                    "vi": "đi lễ trong một tòa nhà tôn giáo"
                },
                "examples": [
                    {
                        "en": "We worship at St Mary's.",
                        "vi": "Chúng tôi thờ phượng tại St Mary's."
                    },
                    {
                        "en": "He worshipped at the local mosque.",
                        "vi": "Ông thờ ở nhà thờ Hồi giáo địa phương."
                    }
                ]
            },
            {
                "define": {
                    "en": "to love and admire somebody very much, especially so much that you cannot see their faults",
                    "vi": "yêu và ngưỡng mộ ai đó rất nhiều, đặc biệt đến mức bạn không thể nhìn ra lỗi của họ"
                },
                "examples": [
                    {
                        "en": "She worships her children.",
                        "vi": "Cô ấy tôn thờ những đứa con của mình."
                    },
                    {
                        "en": "He worshipped her from afar (= he loved her but did not tell her his feelings).",
                        "vi": "Anh tôn thờ cô từ xa (= anh yêu cô nhưng không nói cho cô biết tình cảm của mình)."
                    },
                    {
                        "en": "She worships the ground he walks on.",
                        "vi": "Cô ấy tôn thờ mặt đất mà anh ấy bước đi."
                    }
                ]
            }
        ]
    },
    {
        "id": "08d4888d29b94f708e4214722d68f34a",
        "word": "worshipper",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈwɜːʃɪpə(r)/",
            "us": "/ˈwɜːrʃɪpər/"
        },
        "nearby": [
            {
                "word": "worship",
                "pos": "verb"
            },
            {
                "word": "worshipful",
                "pos": "adjective"
            },
            {
                "word": "worshipper",
                "pos": "noun"
            },
            {
                "word": "worst",
                "pos": "adjective"
            },
            {
                "word": "worst",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who worships God or a god",
                    "vi": "một người thờ phượng Chúa hoặc một vị thần"
                },
                "examples": [
                    {
                        "en": "regular worshippers at St Andrew’s Church",
                        "vi": "những người thường xuyên thờ phượng tại Nhà thờ St Andrew"
                    }
                ]
            }
        ]
    },
    {
        "id": "e56b046d85184deabe47e236c2f529e2",
        "word": "baptism",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbæptɪzəm/",
            "us": "/ˈbæptɪzəm/"
        },
        "nearby": [
            {
                "word": "baobab",
                "pos": "noun"
            },
            {
                "word": "bap",
                "pos": "noun"
            },
            {
                "word": "baptism",
                "pos": "noun"
            },
            {
                "word": "baptismal",
                "pos": "adjective"
            },
            {
                "word": "Baptist",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a Christian ceremony in which a few drops of water are poured on somebody or they are covered with water, to welcome them into the Christian Church and often to name them",
                    "vi": "một nghi lễ Cơ đốc giáo, trong đó một vài giọt nước được đổ lên người nào đó hoặc họ được phủ đầy nước, để chào đón họ vào Nhà thờ Cơ đốc và thường để đặt tên cho họ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a difficult introduction to a new job or activity",
                    "vi": "một lời giới thiệu khó về một công việc hoặc hoạt động mới"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "84b5ed973e0f4a45aafc25b78be01c8c",
        "word": "baptismal",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/bæpˈtɪzməl/",
            "us": "/bæpˈtɪzməl/"
        },
        "nearby": [
            {
                "word": "bap",
                "pos": "noun"
            },
            {
                "word": "baptism",
                "pos": "noun"
            },
            {
                "word": "baptismal",
                "pos": "adjective"
            },
            {
                "word": "Baptist",
                "pos": "adjective"
            },
            {
                "word": "Baptist",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "connected with baptism",
                    "vi": "kết nối với lễ rửa tội"
                },
                "examples": [
                    {
                        "en": "a baptismal service/ceremony",
                        "vi": "một nghi lễ / lễ rửa tội"
                    }
                ]
            }
        ]
    },
    {
        "id": "8a7adb4006b44898865c915f3b25a03a",
        "word": "baptize",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/bæpˈtaɪz/",
            "us": "/ˈbæptaɪz/"
        },
        "nearby": [
            {
                "word": "Baptist",
                "pos": "adjective"
            },
            {
                "word": "Baptist",
                "pos": "noun"
            },
            {
                "word": "baptize",
                "pos": "verb"
            },
            {
                "word": "Bapu",
                "pos": "noun"
            },
            {
                "word": "bar",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to give somebody baptism",
                    "vi": "để cho ai đó làm lễ rửa tội"
                },
                "examples": [
                    {
                        "en": "She was baptized Mary.",
                        "vi": "Cô đã được rửa tội cho Mary."
                    },
                    {
                        "en": "I was baptized a Catholic.",
                        "vi": "Tôi đã được rửa tội là một người Công giáo."
                    }
                ]
            }
        ]
    },
    {
        "id": "14c50542e2db4f3684c1d3c3a3883ad7",
        "word": "bar mitzvah",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌbɑː ˈmɪtsvə/",
            "us": "/ˌbɑːr ˈmɪtsvə/"
        },
        "nearby": [
            {
                "word": "barmaid",
                "pos": "noun"
            },
            {
                "word": "barman",
                "pos": "noun"
            },
            {
                "word": "bar mitzvah",
                "pos": "noun"
            },
            {
                "word": "barmy",
                "pos": "adjective"
            },
            {
                "word": "barn",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a ceremony and celebration for a Jewish boy who has reached the age of 13, at which he accepts the religious responsibilities of an adult",
                    "vi": "một buổi lễ và lễ kỷ niệm cho một cậu bé Do Thái đã được 13 tuổi, khi cậu ấy chấp nhận những trách nhiệm tôn giáo của một người trưởng thành"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the boy who is celebrating this occasion",
                    "vi": "cậu bé đang ăn mừng dịp này"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "7b007116788b40129ca2133911d3149f",
        "word": "bas mitzvah",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌbæs ˈmɪtsvə/",
            "us": "/ˌbæs ˈmɪtsvə/"
        },
        "nearby": [
            {
                "word": "basking shark",
                "pos": "noun"
            },
            {
                "word": "basmati",
                "pos": "noun"
            },
            {
                "word": "bas mitzvah",
                "pos": "noun"
            },
            {
                "word": "Basotho",
                "pos": "noun"
            },
            {
                "word": "basque",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a ceremony and celebration that is held for a Jewish girl between the ages of 12 and 14 at which she accepts the religious responsibilities of an adult",
                    "vi": "một buổi lễ và lễ kỷ niệm được tổ chức cho một cô gái Do Thái trong độ tuổi từ 12 đến 14, tại đó cô ấy chấp nhận các trách nhiệm tôn giáo của một người trưởng thành"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the girl who is celebrating this occasion",
                    "vi": "cô gái đang ăn mừng dịp này"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "8f7b679a92234cbeb6dc2d5cbf43b7cc",
        "word": "bat mitzvah",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌbæt ˈmɪtsvə/",
            "us": "/ˌbæt ˈmɪtsvə/"
        },
        "nearby": [
            {
                "word": "batman",
                "pos": "noun"
            },
            {
                "word": "Batman",
                "pos": ""
            },
            {
                "word": "bat mitzvah",
                "pos": "noun"
            },
            {
                "word": "baton",
                "pos": "noun"
            },
            {
                "word": "Baton Rouge",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a ceremony and celebration that is held for a Jewish girl between the ages of 12 and 14 at which she accepts the religious responsibilities of an adult",
                    "vi": "một buổi lễ và lễ kỷ niệm được tổ chức cho một cô gái Do Thái trong độ tuổi từ 12 đến 14, tại đó cô ấy chấp nhận các trách nhiệm tôn giáo của một người trưởng thành"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the girl who is celebrating this occasion",
                    "vi": "cô gái đang ăn mừng dịp này"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "7429db57420c489588c880fe1f9f4afe",
        "word": "canonization",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌkænənaɪˈzeɪʃn/",
            "us": "/ˌkænənəˈzeɪʃn/"
        },
        "nearby": [
            {
                "word": "canonical",
                "pos": "adjective"
            },
            {
                "word": "canonical form",
                "pos": "noun"
            },
            {
                "word": "canonization",
                "pos": "noun"
            },
            {
                "word": "canonize",
                "pos": "verb"
            },
            {
                "word": "canon law",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act by the Pope of stating officially that somebody is now a saint; the process of being made a saint by the Pope",
                    "vi": "hành động của Giáo hoàng tuyên bố chính thức rằng ai đó bây giờ là một vị thánh; quá trình được Giáo hoàng phong làm thánh"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "5aa5a9da0f5e4df3b53c48e23026d1fa",
        "word": "canonize",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkænənaɪz/",
            "us": "/ˈkænənaɪz/"
        },
        "nearby": [
            {
                "word": "canonical form",
                "pos": "noun"
            },
            {
                "word": "canonization",
                "pos": "noun"
            },
            {
                "word": "canonize",
                "pos": "verb"
            },
            {
                "word": "canon law",
                "pos": "noun"
            },
            {
                "word": "canoodle",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to state officially that somebody is now a saint",
                    "vi": "tuyên bố chính thức rằng ai đó bây giờ là một vị thánh"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "96f39657d64c4e969cb86e942ea94893",
        "word": "chant",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/tʃɑːnt/",
            "us": "/tʃænt/"
        },
        "nearby": [
            {
                "word": "the Channel Islands",
                "pos": "noun"
            },
            {
                "word": "the Channel Tunnel",
                "pos": ""
            },
            {
                "word": "chant",
                "pos": "noun"
            },
            {
                "word": "chant",
                "pos": "verb"
            },
            {
                "word": "chanter",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "words or phrases that a group of people shout or sing again and again",
                    "vi": "những từ hoặc cụm từ mà một nhóm người hét lên hoặc hát đi hát lại"
                },
                "examples": [
                    {
                        "en": "The crowd broke into chants of ‘Out! Out!’",
                        "vi": "Đám đông đã vỡ òa trong tiếng hô vang 'Ra ngoài! Ngoài!'"
                    },
                    {
                        "en": "football chants",
                        "vi": "những câu hò trong bóng đá"
                    }
                ]
            },
            {
                "define": {
                    "en": "a religious song or prayer or a way of singing, using only a few notes that are repeated many times",
                    "vi": "một bài hát tôn giáo hoặc lời cầu nguyện hoặc một cách hát, chỉ sử dụng một vài nốt nhạc được lặp lại nhiều lần"
                },
                "examples": [
                    {
                        "en": "a Buddhist chant",
                        "vi": "một bài tụng kinh Phật giáo"
                    }
                ]
            }
        ]
    },
    {
        "id": "9a062708de5344949bd5af4d257328b7",
        "word": "christen",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkrɪsn/",
            "us": "/ˈkrɪsn/"
        },
        "nearby": [
            {
                "word": "Christ",
                "pos": "exclamation"
            },
            {
                "word": "Christchurch",
                "pos": ""
            },
            {
                "word": "christen",
                "pos": "verb"
            },
            {
                "word": "Christendom",
                "pos": "noun"
            },
            {
                "word": "christening",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to give a name to a baby at his or her baptism to welcome him or her into the Christian Church",
                    "vi": "đặt tên cho một em bé tại lễ rửa tội của em để chào đón em vào Nhà thờ Thiên chúa giáo"
                },
                "examples": [
                    {
                        "en": "christen somebody + noun The child was christened Mary.",
                        "vi": "christen somebody + danh từ Đứa trẻ đã được rửa tội là Mary."
                    },
                    {
                        "en": "christen somebody Did you have your children christened?",
                        "vi": "Christen somebody Bạn đã làm rửa tội cho các con của bạn chưa?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to give a name to somebody/something",
                    "vi": "đặt tên cho ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "This area has been christened ‘Britain's last wilderness’.",
                        "vi": "Khu vực này đã được đặt tên là 'vùng hoang dã cuối cùng của nước Anh'."
                    },
                    {
                        "en": "They christened the boat ‘Oceania’.",
                        "vi": "Họ đặt tên cho con thuyền là 'Châu Đại Dương'."
                    }
                ]
            },
            {
                "define": {
                    "en": "to use something for the first time",
                    "vi": "sử dụng thứ gì đó lần đầu tiên"
                },
                "examples": [
                    {
                        "en": "Let’s have a drink to christen our new wine glasses.",
                        "vi": "Hãy uống một ly để làm lễ rửa tội cho những ly rượu mới của chúng ta."
                    }
                ]
            }
        ]
    },
    {
        "id": "83c98afb1628483c938345467ffe3acf",
        "word": "churchgoing",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈtʃɜːtʃɡəʊɪŋ/",
            "us": "/ˈtʃɜːrtʃɡəʊɪŋ/"
        },
        "nearby": [
            {
                "word": "the Church Commissioners",
                "pos": ""
            },
            {
                "word": "churchgoer",
                "pos": "noun"
            },
            {
                "word": "churchgoing",
                "pos": "noun"
            },
            {
                "word": "Winston Churchill",
                "pos": ""
            },
            {
                "word": "the Church in Wales",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the practice of going to church services regularly",
                    "vi": "thói quen đi lễ nhà thờ thường xuyên"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "664599f0dfdb456e86f6c7e2c3419bd6",
        "word": "circumcise",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsɜːkəmsaɪz/",
            "us": "/ˈsɜːrkəmsaɪz/"
        },
        "nearby": [
            {
                "word": "circulatory",
                "pos": "adjective"
            },
            {
                "word": "circum-",
                "pos": "prefix"
            },
            {
                "word": "circumcise",
                "pos": "verb"
            },
            {
                "word": "circumcision",
                "pos": "noun"
            },
            {
                "word": "circumference",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to remove the foreskin of a boy or man for religious or medical reasons",
                    "vi": "để loại bỏ bao quy đầu của một cậu bé hoặc một người đàn ông vì lý do tôn giáo hoặc y tế"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to cut off part of the sex organs of a girl or woman for non-medical reasons (a traditional practice in some cultures but illegal in many countries)",
                    "vi": "cắt bỏ một phần cơ quan sinh dục của một cô gái hoặc phụ nữ không vì lý do y tế (một tập tục truyền thống ở một số nền văn hóa nhưng bất hợp pháp ở nhiều quốc gia)"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "4ad62fc8d6f341bb842965107af8d523",
        "word": "circumcision",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌsɜːkəmˈsɪʒn/",
            "us": "/ˌsɜːrkəmˈsɪʒn/"
        },
        "nearby": [
            {
                "word": "circum-",
                "pos": "prefix"
            },
            {
                "word": "circumcise",
                "pos": "verb"
            },
            {
                "word": "circumcision",
                "pos": "noun"
            },
            {
                "word": "circumference",
                "pos": "noun"
            },
            {
                "word": "circumflex",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act of circumcising somebody; the religious ceremony when somebody, especially a baby, is circumcised",
                    "vi": "hành động cắt bao quy đầu cho ai đó; nghi lễ tôn giáo khi ai đó, đặc biệt là một em bé, được cắt bao quy đầu"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "9240d7f3d78d4e62a927f503170de6fb",
        "word": "communion",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/kəˈmjuːniən/",
            "us": "/kəˈmjuːniən/"
        },
        "nearby": [
            {
                "word": "communicative competence",
                "pos": "noun"
            },
            {
                "word": "communicator",
                "pos": "noun"
            },
            {
                "word": "communion",
                "pos": "noun"
            },
            {
                "word": "communiqué",
                "pos": "noun"
            },
            {
                "word": "communism",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a ceremony in the Christian Church during which people eat bread and drink wine in memory of the last meal that Christ had with his disciples",
                    "vi": "một buổi lễ trong Nhà thờ Cơ đốc, trong đó mọi người ăn bánh và uống rượu để tưởng nhớ bữa ăn cuối cùng mà Đấng Christ đã có với các môn đồ của mình"
                },
                "examples": [
                    {
                        "en": "to go to Communion (= attend church for this celebration)",
                        "vi": "đi lễ (= tham dự nhà thờ cho lễ kỷ niệm này)"
                    },
                    {
                        "en": "to take/receive communion (= receive the bread and wine)",
                        "vi": "rước / rước lễ (= rước bánh rượu)"
                    }
                ]
            },
            {
                "define": {
                    "en": "the state of sharing or exchanging thoughts and feelings; the feeling of being part of something",
                    "vi": "trạng thái chia sẻ hoặc trao đổi những suy nghĩ và cảm xúc; cảm giác là một phần của cái gì đó"
                },
                "examples": [
                    {
                        "en": "poets living in communion with nature",
                        "vi": "nhà thơ sống giao cảm với thiên nhiên"
                    }
                ]
            },
            {
                "define": {
                    "en": "a group of people with the same religious beliefs",
                    "vi": "một nhóm người có cùng niềm tin tôn giáo"
                },
                "examples": [
                    {
                        "en": "the Anglican communion",
                        "vi": "sự hiệp thông của Anh giáo"
                    }
                ]
            }
        ]
    },
    {
        "id": "83542c2de9f841ea80cad331f0dd6eb0",
        "word": "confirm",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/kənˈfɜːm/",
            "us": "/kənˈfɜːrm/"
        },
        "nearby": [
            {
                "word": "confinement",
                "pos": "noun"
            },
            {
                "word": "confines",
                "pos": "noun"
            },
            {
                "word": "confirm",
                "pos": "verb"
            },
            {
                "word": "confirmation",
                "pos": "noun"
            },
            {
                "word": "confirmed",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to state or show that something is definitely true or correct, especially by providing evidence",
                    "vi": "để nêu rõ hoặc cho thấy điều gì đó chắc chắn là đúng hoặc đúng, đặc biệt là bằng cách cung cấp bằng chứng"
                },
                "examples": [
                    {
                        "en": "confirm something His guilty expression confirmed my suspicions.",
                        "vi": "xác nhận điều gì đó Biểu hiện tội lỗi của anh ấy đã xác nhận sự nghi ngờ của tôi."
                    },
                    {
                        "en": "to confirm a diagnosis/report",
                        "vi": "để xác nhận chẩn đoán / báo cáo"
                    },
                    {
                        "en": "to confirm results/findings",
                        "vi": "để xác nhận kết quả / phát hiện"
                    },
                    {
                        "en": "Rumours of job losses were later confirmed.",
                        "vi": "Tin đồn về việc mất việc sau đó đã được xác nhận."
                    },
                    {
                        "en": "We have yet to confirm the identities of the victims.",
                        "vi": "Chúng tôi vẫn chưa xác nhận danh tính của các nạn nhân."
                    },
                    {
                        "en": "She said she could not confirm or deny the allegations.",
                        "vi": "Cô ấy nói rằng cô ấy không thể xác nhận hoặc phủ nhận các cáo buộc."
                    },
                    {
                        "en": "The authorities refused to confirm any details.",
                        "vi": "Các nhà chức trách từ chối xác nhận bất kỳ chi tiết nào."
                    },
                    {
                        "en": "confirm (that)… Police sources confirmed that ten people had been arrested at the march.",
                        "vi": "xác nhận (điều đó)… Các nguồn tin cảnh sát xác nhận rằng mười người đã bị bắt tại cuộc tuần hành."
                    },
                    {
                        "en": "confirm to somebody/something that… A government official confirmed to the newspaper that Britain was pushing hard for an end to the arms embargo.",
                        "vi": "xác nhận với ai đó / điều gì đó rằng… Một quan chức chính phủ xác nhận với tờ báo rằng Anh đang nỗ lực hết sức để chấm dứt lệnh cấm vận vũ khí."
                    },
                    {
                        "en": "confirm what/when, etc… Can you confirm what happened?",
                        "vi": "xác nhận cái gì / khi nào, v.v. Bạn có thể xác nhận điều gì đã xảy ra không?"
                    },
                    {
                        "en": "it is confirmed that… It has been confirmed that an official complaint was made to the council.",
                        "vi": "nó được xác nhận rằng… Nó đã được xác nhận rằng một khiếu nại chính thức đã được gửi đến hội đồng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make a position, an agreement, etc. more definite or official; to establish somebody/something clearly",
                    "vi": "để làm cho một vị trí, một thỏa thuận, v.v. rõ ràng hơn hoặc chính thức hơn; để thiết lập ai đó / điều gì đó rõ ràng"
                },
                "examples": [
                    {
                        "en": "confirm something Please write to confirm your reservation (= say that it is definite).",
                        "vi": "xác nhận điều gì đó Vui lòng viết thư để xác nhận đặt phòng của bạn (= nói rằng nó là xác định)."
                    },
                    {
                        "en": "After a six-month probationary period, her position was confirmed.",
                        "vi": "Sau thời gian thử việc sáu tháng, vị trí của cô đã được khẳng định."
                    },
                    {
                        "en": "confirm (that)… Has everyone confirmed (that) they’re coming?",
                        "vi": "xác nhận (điều đó)… Mọi người đã xác nhận (điều đó) họ đang đến chưa?"
                    },
                    {
                        "en": "it is confirmed that… It has been confirmed that the meeting will take place next week.",
                        "vi": "nó được xác nhận rằng… Nó đã được xác nhận rằng cuộc họp sẽ diễn ra vào tuần tới."
                    },
                    {
                        "en": "confirm somebody as something He was confirmed as captain for the rest of the season.",
                        "vi": "xác nhận ai đó như một cái gì đó Anh ấy đã được xác nhận là đội trưởng trong phần còn lại của mùa giải."
                    },
                    {
                        "en": "confirm somebody in something I'm very happy to confirm you in your post.",
                        "vi": "xác nhận ai đó về điều gì đó Tôi rất vui khi xác nhận bạn trong bài đăng của bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody feel or believe something even more strongly",
                    "vi": "để làm cho ai đó cảm thấy hoặc tin vào điều gì đó thậm chí còn mạnh mẽ hơn"
                },
                "examples": [
                    {
                        "en": "confirm something The walk in the mountains confirmed his fear of heights.",
                        "vi": "Xác nhận điều gì đó Cuộc đi bộ trên núi khẳng định chứng sợ độ cao của anh ấy."
                    },
                    {
                        "en": "confirm somebody in something This latest tragedy merely confirms my view that the law must be tightened.",
                        "vi": "Xác nhận ai đó trong điều gì đó Thảm kịch mới nhất này chỉ đơn thuần khẳng định quan điểm của tôi rằng luật pháp phải được thắt chặt."
                    }
                ]
            },
            {
                "define": {
                    "en": "to perform the Christian or Jewish ceremony of confirmation",
                    "vi": "để thực hiện nghi lễ xác nhận của Cơ đốc giáo hoặc Do Thái"
                },
                "examples": [
                    {
                        "en": "be confirmed She was baptized when she was a month old and confirmed when she was thirteen.",
                        "vi": "được xác nhận Cô đã làm báp têm khi cô được một tháng tuổi và được xác nhận khi cô mười ba tuổi."
                    }
                ]
            }
        ]
    },
    {
        "id": "33b68e7dcca94cb3aefdedcb7dbc007f",
        "word": "confirmation",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌkɒnfəˈmeɪʃn/",
            "us": "/ˌkɑːnfərˈmeɪʃn/"
        },
        "nearby": [
            {
                "word": "confines",
                "pos": "noun"
            },
            {
                "word": "confirm",
                "pos": "verb"
            },
            {
                "word": "confirmation",
                "pos": "noun"
            },
            {
                "word": "confirmed",
                "pos": "adjective"
            },
            {
                "word": "confiscate",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a statement, letter, etc. that shows that something is true, correct or definite",
                    "vi": "một tuyên bố, lá thư, v.v. cho thấy điều gì đó là đúng, chính xác hoặc xác định"
                },
                "examples": [
                    {
                        "en": "I'm still waiting for confirmation of the test results.",
                        "vi": "Tôi vẫn đang chờ xác nhận kết quả kiểm tra."
                    }
                ]
            },
            {
                "define": {
                    "en": "a ceremony at which a person becomes a full member of the Christian Church",
                    "vi": "một buổi lễ mà tại đó một người trở thành thành viên đầy đủ của Giáo hội Cơ đốc"
                },
                "examples": [
                    {
                        "en": "a confirmation service",
                        "vi": "một dịch vụ xác nhận"
                    }
                ]
            },
            {
                "define": {
                    "en": "a Jewish ceremony similar to a bar mitzvah or bat mitzvah but usually for young people over the age of 16",
                    "vi": "một nghi lễ của người Do Thái tương tự như bar mitzvah hoặc bat mitzvah nhưng thường dành cho thanh niên trên 16 tuổi"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "dd4a558caf5543bbbc4468d00e95d7ba",
        "word": "consecrate",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkɒnsɪkreɪt/",
            "us": "/ˈkɑːnsɪkreɪt/"
        },
        "nearby": [
            {
                "word": "conscript",
                "pos": "noun"
            },
            {
                "word": "conscription",
                "pos": "noun"
            },
            {
                "word": "consecrate",
                "pos": "verb"
            },
            {
                "word": "consecration",
                "pos": "noun"
            },
            {
                "word": "consecutive",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to state officially in a religious ceremony that something is holy and can be used for religious purposes",
                    "vi": "tuyên bố chính thức trong một buổi lễ tôn giáo rằng một cái gì đó là thánh và có thể được sử dụng cho các mục đích tôn giáo"
                },
                "examples": [
                    {
                        "en": "The church was consecrated in 1853.",
                        "vi": "Nhà thờ được thánh hiến vào năm 1853."
                    },
                    {
                        "en": "consecrated ground",
                        "vi": "đất thánh hiến"
                    }
                ]
            },
            {
                "define": {
                    "en": "to make bread and wine into the body and blood of Christ",
                    "vi": "để biến bánh và rượu thành thân và huyết của Đấng Christ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to state officially in a religious ceremony that somebody is now a priest, etc.",
                    "vi": "tuyên bố chính thức trong một buổi lễ tôn giáo rằng ai đó hiện là linh mục, v.v."
                },
                "examples": [
                    {
                        "en": "He was consecrated (as) bishop last year.",
                        "vi": "Ông đã được thánh hiến (làm) giám mục vào năm ngoái."
                    }
                ]
            },
            {
                "define": {
                    "en": "to give something/somebody/yourself to a special purpose, especially a religious one",
                    "vi": "để cung cấp một cái gì đó / ai đó / bản thân cho một mục đích đặc biệt, đặc biệt là một mục đích tôn giáo"
                },
                "examples": [
                    {
                        "en": "She consecrated her life to God.",
                        "vi": "Cô đã dâng hiến cuộc đời mình cho Chúa."
                    }
                ]
            }
        ]
    },
    {
        "id": "4b9ad42ad18d40f58534a5c15805c697",
        "word": "consecration",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌkɒnsɪˈkreɪʃn/",
            "us": "/ˌkɑːnsɪˈkreɪʃn/"
        },
        "nearby": [
            {
                "word": "conscription",
                "pos": "noun"
            },
            {
                "word": "consecrate",
                "pos": "verb"
            },
            {
                "word": "consecration",
                "pos": "noun"
            },
            {
                "word": "consecutive",
                "pos": "adjective"
            },
            {
                "word": "consecutively",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act of stating officially in a religious ceremony that something is holy and can be used for religious purposes",
                    "vi": "hành động tuyên bố chính thức trong một buổi lễ tôn giáo rằng một cái gì đó là thánh và có thể được sử dụng cho các mục đích tôn giáo"
                },
                "examples": [
                    {
                        "en": "the consecration of a church",
                        "vi": "sự thánh hiến của một nhà thờ"
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of making bread and wine into the body and blood of Christ",
                    "vi": "hành động làm cho bánh và rượu trở thành mình và huyết của Đấng Christ"
                },
                "examples": [
                    {
                        "en": "the consecration of bread and wine in the Eucharist",
                        "vi": "truyền phép bánh và rượu trong Bí tích Thánh Thể"
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of stating officially in a religious ceremony that somebody is now a priest, etc.",
                    "vi": "hành động tuyên bố chính thức trong một buổi lễ tôn giáo rằng ai đó hiện là linh mục, v.v."
                },
                "examples": [
                    {
                        "en": "the consecration of a bishop",
                        "vi": "sự thánh hiến của một giám mục"
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of giving something/somebody/yourself to a special purpose, especially a religious one",
                    "vi": "hành động cho một cái gì đó / ai đó / bản thân cho một mục đích đặc biệt, đặc biệt là một mục đích tôn giáo"
                },
                "examples": [
                    {
                        "en": "As a sign of their consecration to religious life, they are to clothe themselves plainly and to live in simplicity.",
                        "vi": "Như một dấu chỉ của sự dâng mình cho đời sống tu trì, họ phải ăn mặc giản dị và sống giản dị."
                    }
                ]
            }
        ]
    },
    {
        "id": "ed4ca169a22d4b75961d5ec57e961e8d",
        "word": "cremate",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/krəˈmeɪt/",
            "us": "/ˈkriːmeɪt/"
        },
        "nearby": [
            {
                "word": "creepy-crawly",
                "pos": "noun"
            },
            {
                "word": "cremains",
                "pos": "noun"
            },
            {
                "word": "cremate",
                "pos": "verb"
            },
            {
                "word": "cremation",
                "pos": "noun"
            },
            {
                "word": "crematorium",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to burn a dead body, especially as part of a funeral ceremony",
                    "vi": "đốt xác chết, đặc biệt là một phần của lễ tang"
                },
                "examples": [
                    {
                        "en": "be cremated When she dies she wants to be cremated, not buried.",
                        "vi": "được hỏa táng Khi chết cô ấy muốn được hỏa táng, không được chôn cất."
                    }
                ]
            }
        ]
    },
    {
        "id": "b873eaed54bf4f2dbfb0ddefe60b9ac2",
        "word": "cremation",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/krəˈmeɪʃn/",
            "us": "/krəˈmeɪʃn/"
        },
        "nearby": [
            {
                "word": "cremains",
                "pos": "noun"
            },
            {
                "word": "cremate",
                "pos": "verb"
            },
            {
                "word": "cremation",
                "pos": "noun"
            },
            {
                "word": "crematorium",
                "pos": "noun"
            },
            {
                "word": "crème brûlée",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act of cremating somebody",
                    "vi": "hành động hỏa táng ai đó"
                },
                "examples": [
                    {
                        "en": "More people are choosing cremation rather than burial.",
                        "vi": "Nhiều người đang chọn hỏa táng hơn là chôn cất."
                    }
                ]
            },
            {
                "define": {
                    "en": "a funeral at which the dead person is cremated",
                    "vi": "một đám tang mà người chết được hỏa táng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "4af87520fb824240868efa162f2ffd39",
        "word": "Eucharist",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈjuːkərɪst/",
            "us": "/ˈjuːkərɪst/"
        },
        "nearby": [
            {
                "word": "eucaryote",
                "pos": "noun"
            },
            {
                "word": "eucaryotic",
                "pos": "adjective"
            },
            {
                "word": "Eucharist",
                "pos": "noun"
            },
            {
                "word": "Euclidean geometry",
                "pos": "noun"
            },
            {
                "word": "Eugene",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a ceremony in the Christian Church during which people eat bread and drink wine in memory of the last meal that Christ had with his disciples; the bread and wine taken at this ceremony",
                    "vi": "một nghi lễ trong Nhà thờ Cơ đốc, trong đó mọi người ăn bánh và uống rượu để tưởng nhớ bữa ăn cuối cùng mà Đấng Christ đã dùng với các môn đồ; bánh và rượu được lấy trong buổi lễ này"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "0700ff50a3e94a43aee74482c6e67ee1",
        "word": "exorcise",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈeksɔːsaɪz/",
            "us": "/ˈeksɔːrsaɪz/"
        },
        "nearby": [
            {
                "word": "exorbitant",
                "pos": "adjective"
            },
            {
                "word": "exorbitantly",
                "pos": "adverb"
            },
            {
                "word": "exorcise",
                "pos": "verb"
            },
            {
                "word": "exorcism",
                "pos": "noun"
            },
            {
                "word": "exorcist",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to make an evil spirit leave a place or somebody’s body by special prayers or magic",
                    "vi": "khiến một linh hồn xấu xa rời khỏi một nơi hoặc cơ thể của ai đó bằng những lời cầu nguyện hoặc phép thuật đặc biệt"
                },
                "examples": [
                    {
                        "en": "exorcise something from somebody/something The ghost was exorcised from the house.",
                        "vi": "xua đuổi cái gì đó khỏi ai đó / cái gì đó Con ma đã bị trừ tà khỏi nhà."
                    },
                    {
                        "en": "exorcise somebody/something (of something) They said they were exorcising her of evil spirits.",
                        "vi": "exorcise somebody / something (of something) Họ nói rằng họ đang trừ tà ma cho cô ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to remove something that is bad or painful from your mind",
                    "vi": "để loại bỏ điều gì đó tồi tệ hoặc đau đớn khỏi tâm trí của bạn"
                },
                "examples": [
                    {
                        "en": "She had managed to exorcise these unhappy memories from her mind.",
                        "vi": "Cô đã cố gắng loại bỏ những ký ức không vui này khỏi tâm trí của mình."
                    }
                ]
            }
        ]
    },
    {
        "id": "e995fb0df5e24d8f8638fd953e71f3ec",
        "word": "exorcism",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈeksɔːsɪzəm/",
            "us": "/ˈeksɔːrsɪzəm/"
        },
        "nearby": [
            {
                "word": "exorbitantly",
                "pos": "adverb"
            },
            {
                "word": "exorcise",
                "pos": "verb"
            },
            {
                "word": "exorcism",
                "pos": "noun"
            },
            {
                "word": "exorcist",
                "pos": "noun"
            },
            {
                "word": "exoskeleton",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act of getting rid of an evil spirit from a place or a person’s body by prayers or magic; a ceremony where this is done",
                    "vi": "hành động tống khứ một linh hồn xấu xa khỏi một nơi hoặc cơ thể của một người bằng những lời cầu nguyện hoặc phép thuật; một buổi lễ nơi điều này được thực hiện"
                },
                "examples": [
                    {
                        "en": "A priest performed an exorcism and afterwards the ghost disappeared.",
                        "vi": "Một linh mục đã thực hiện một lễ trừ tà và sau đó hồn ma biến mất."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of making yourself forget a bad experience or memory",
                    "vi": "hành động làm cho bản thân quên đi một kinh nghiệm hoặc ký ức tồi tệ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "9794b19f59624b44bd6afa5323ceb968",
        "word": "godchild",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɡɒdtʃaɪld/",
            "us": "/ˈɡɑːdtʃaɪld/"
        },
        "nearby": [
            {
                "word": "godawful",
                "pos": "adjective"
            },
            {
                "word": "God Bless America",
                "pos": ""
            },
            {
                "word": "godchild",
                "pos": "noun"
            },
            {
                "word": "goddam",
                "pos": "adjective, adverb"
            },
            {
                "word": "god-daughter",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a child that a godparent at a Christian baptism ceremony promises to be responsible for and to teach about the Christian religion",
                    "vi": "một đứa trẻ mà cha mẹ đỡ đầu tại một buổi lễ rửa tội của Cơ đốc giáo hứa sẽ chịu trách nhiệm và dạy dỗ về tôn giáo Cơ đốc"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "10b367ac29904fe4849752564cfcfb0a",
        "word": "god-daughter",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɡɒd dɔːtə(r)/",
            "us": "/ˈɡɑːd dɔːtər/"
        },
        "nearby": [
            {
                "word": "godchild",
                "pos": "noun"
            },
            {
                "word": "goddam",
                "pos": "adjective, adverb"
            },
            {
                "word": "god-daughter",
                "pos": "noun"
            },
            {
                "word": "goddess",
                "pos": "noun"
            },
            {
                "word": "godfather",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a female godchild",
                    "vi": "một đứa con đỡ đầu của phụ nữ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "2c150ba8edc9493cb0fb0774bf3deefb",
        "word": "godfather",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɡɒdfɑːðə(r)/",
            "us": "/ˈɡɑːdfɑːðər/"
        },
        "nearby": [
            {
                "word": "god-daughter",
                "pos": "noun"
            },
            {
                "word": "goddess",
                "pos": "noun"
            },
            {
                "word": "godfather",
                "pos": "noun"
            },
            {
                "word": "The Godfather",
                "pos": ""
            },
            {
                "word": "God-fearing",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a male godparent",
                    "vi": "cha mẹ đỡ đầu của nam giới"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a very powerful man in a criminal organization, especially the Mafia",
                    "vi": "một người đàn ông rất quyền lực trong một tổ chức tội phạm, đặc biệt là Mafia"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a person who began or developed something",
                    "vi": "một người đã bắt đầu hoặc phát triển một cái gì đó"
                },
                "examples": [
                    {
                        "en": "He's the godfather of punk.",
                        "vi": "Anh ấy là cha đỡ đầu của punk."
                    }
                ]
            }
        ]
    },
    {
        "id": "239d0618ecbe4dcd977ac693d63b6ef8",
        "word": "godmother",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɡɒdmʌðə(r)/",
            "us": "/ˈɡɑːdmʌðər/"
        },
        "nearby": [
            {
                "word": "godly",
                "pos": "adjective"
            },
            {
                "word": "god-man",
                "pos": "noun"
            },
            {
                "word": "godmother",
                "pos": "noun"
            },
            {
                "word": "go down",
                "pos": "phrasal verb"
            },
            {
                "word": "godown",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a female godparent",
                    "vi": "một phụ nữ đỡ đầu"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "d790eede84fa4d528609fa82c7057f43",
        "word": "godparent",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɡɒdpeərənt/",
            "us": "/ˈɡɑːdperənt/"
        },
        "nearby": [
            {
                "word": "godown",
                "pos": "noun"
            },
            {
                "word": "go down with",
                "pos": "phrasal verb"
            },
            {
                "word": "godparent",
                "pos": "noun"
            },
            {
                "word": "God Rest You Merry, Gentlemen",
                "pos": ""
            },
            {
                "word": "God Save the King/Queen",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who promises at a Christian baptism ceremony to be responsible for a child (= his or her godchild) and to teach them about the Christian religion",
                    "vi": "một người hứa tại một buổi lễ rửa tội của Cơ đốc giáo sẽ có trách nhiệm với một đứa trẻ (= đứa con đỡ đầu của anh ta hoặc cô ta) và dạy chúng về tôn giáo Cơ đốc."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "e9eef350a26642e9af8a1fb48313886a",
        "word": "godson",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɡɒdsʌn/",
            "us": "/ˈɡɑːdsʌn/"
        },
        "nearby": [
            {
                "word": "God's country",
                "pos": "noun"
            },
            {
                "word": "godsend",
                "pos": "noun"
            },
            {
                "word": "godson",
                "pos": "noun"
            },
            {
                "word": "Godspeed",
                "pos": "exclamation"
            },
            {
                "word": "the God squad",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a male godchild",
                    "vi": "một đứa con đỡ đầu của nam giới"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "f83f0c25b7a44c6bbd85cd2ab9dba83d",
        "word": "hajj",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/hædʒ/",
            "us": "/hædʒ/"
        },
        "nearby": [
            {
                "word": "Haiti",
                "pos": "noun"
            },
            {
                "word": "Haitian",
                "pos": "noun, adjective"
            },
            {
                "word": "hajj",
                "pos": "noun"
            },
            {
                "word": "haka",
                "pos": "noun"
            },
            {
                "word": "hake",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the religious journey to Mecca that all Muslims try to make at least once in their lives. The Hajj is one of the Five Pillars of Islam.",
                    "vi": "hành trình tôn giáo đến Mecca mà tất cả những người theo đạo Hồi đều cố gắng thực hiện ít nhất một lần trong đời. Hajj là một trong Năm Trụ cột của Hồi giáo."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a72c99a675944dffa61870cbaa486fbb",
        "word": "Holy Communion",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌhəʊli kəˈmjuːniən/",
            "us": "/ˌhəʊli kəˈmjuːniən/"
        },
        "nearby": [
            {
                "word": "Victoria Holt",
                "pos": ""
            },
            {
                "word": "holy",
                "pos": "adjective"
            },
            {
                "word": "Holy Communion",
                "pos": "noun"
            },
            {
                "word": "the Holy Father",
                "pos": "noun"
            },
            {
                "word": "the Holy Ghost",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a ceremony in the Christian Church during which people eat bread and drink wine in memory of the last meal that Christ had with his disciples",
                    "vi": "một buổi lễ trong Nhà thờ Cơ đốc, trong đó mọi người ăn bánh và uống rượu để tưởng nhớ bữa ăn cuối cùng mà Đấng Christ đã có với các môn đồ của mình"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "f3ff06f115a3436faef79a60428764bd",
        "word": "hymn",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/hɪm/",
            "us": "/hɪm/"
        },
        "nearby": [
            {
                "word": "hygienist",
                "pos": "noun"
            },
            {
                "word": "hymen",
                "pos": "noun"
            },
            {
                "word": "hymn",
                "pos": "noun"
            },
            {
                "word": "hymn book",
                "pos": "noun"
            },
            {
                "word": "Hymns Ancient and Modern",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a song of praise, especially one praising God and sung by Christians",
                    "vi": "một bài hát ca ngợi, đặc biệt là một bài ca ngợi Chúa và được hát bởi các Cơ đốc nhân"
                },
                "examples": [
                    {
                        "en": "The service began with a rousing hymn.",
                        "vi": "Buổi lễ bắt đầu bằng một bài thánh ca sôi nổi."
                    }
                ]
            },
            {
                "define": {
                    "en": "if a film, book, etc. is a hymn to something, it praises it very strongly",
                    "vi": "nếu một bộ phim, cuốn sách, v.v. là một bài thánh ca cho một cái gì đó, nó sẽ ca ngợi nó rất mạnh mẽ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to show that you are in agreement with each other by saying the same things in public",
                    "vi": "để thể hiện rằng bạn đồng ý với nhau bằng cách nói những điều giống nhau ở nơi công cộng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "0dc94cf793cc4626bf2a0290436b454f",
        "word": "the last rites",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ðə ˌlɑːst ˈraɪts/",
            "us": "/ðə ˌlæst ˈraɪts/"
        },
        "nearby": [
            {
                "word": "last orders",
                "pos": "noun"
            },
            {
                "word": "the last post",
                "pos": "noun"
            },
            {
                "word": "the last rites",
                "pos": "noun"
            },
            {
                "word": "Las Vegas",
                "pos": ""
            },
            {
                "word": "lat.",
                "pos": "abbreviation"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a Christian religious ceremony that a priest performs for, and in the presence of, a dying person",
                    "vi": "một nghi lễ tôn giáo Cơ đốc giáo mà một linh mục thực hiện và trước sự chứng kiến của một người sắp chết"
                },
                "examples": [
                    {
                        "en": "to administer the last rites to somebody",
                        "vi": "quản lý những nghi thức cuối cùng cho ai đó"
                    },
                    {
                        "en": "He received the last rites from a Roman Catholic priest and died an hour later.",
                        "vi": "Ông đã nhận được những nghi thức cuối cùng từ một linh mục Công giáo La Mã và qua đời một giờ sau đó."
                    }
                ]
            }
        ]
    },
    {
        "id": "c53f757260e548d7ba90bf0ba57ab41e",
        "word": "Mass",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/mæs/",
            "us": "/mæs/"
        },
        "nearby": [
            {
                "word": "mass",
                "pos": "adjective"
            },
            {
                "word": "mass",
                "pos": "verb"
            },
            {
                "word": "Mass",
                "pos": "noun"
            },
            {
                "word": "Massachusetts",
                "pos": ""
            },
            {
                "word": "Massachusetts Institute of Technology",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "(especially in the Roman Catholic Church) a ceremony held in memory of the last meal that Christ had with his disciples",
                    "vi": "(đặc biệt là trong Giáo hội Công giáo La Mã) một buổi lễ được tổ chức để tưởng nhớ bữa ăn cuối cùng mà Đấng Christ đã có với các môn đồ của mình"
                },
                "examples": [
                    {
                        "en": "to go to Mass",
                        "vi": "đi dự thánh lễ"
                    },
                    {
                        "en": "a priest celebrating/saying Mass",
                        "vi": "một linh mục cử hành / nói thánh lễ"
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of music that is written for the prayers, etc. of this ceremony",
                    "vi": "một bản nhạc được viết cho những lời cầu nguyện, v.v. của buổi lễ này"
                },
                "examples": [
                    {
                        "en": "Bach’s Mass in B minor",
                        "vi": "Thánh lễ của Bach ở B nhỏ"
                    }
                ]
            }
        ]
    },
    {
        "id": "e9ad646eea9b4cb8b27e33468f751682",
        "word": "meeting",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmiːtɪŋ/",
            "us": "/ˈmiːtɪŋ/"
        },
        "nearby": [
            {
                "word": "meet and greet",
                "pos": "noun"
            },
            {
                "word": "meet-and-greet",
                "pos": "adjective"
            },
            {
                "word": "meeting",
                "pos": "noun"
            },
            {
                "word": "meeting house",
                "pos": "noun"
            },
            {
                "word": "meeting place",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an occasion when people come together to discuss or decide something",
                    "vi": "một dịp khi mọi người cùng nhau thảo luận hoặc quyết định điều gì đó"
                },
                "examples": [
                    {
                        "en": "A hundred people attended the public meeting.",
                        "vi": "Một trăm người đã tham dự cuộc họp công khai."
                    },
                    {
                        "en": "The meeting will be held in the school hall.",
                        "vi": "Cuộc họp sẽ được tổ chức tại hội trường của trường."
                    },
                    {
                        "en": "to schedule/convene/arrange/organize/call a meeting",
                        "vi": "lên lịch / triệu tập / sắp xếp / tổ chức / gọi một cuộc họp"
                    },
                    {
                        "en": "Helen will chair the meeting (= be in charge of it).",
                        "vi": "Helen sẽ chủ trì cuộc họp (= phụ trách cuộc họp)."
                    },
                    {
                        "en": "The meeting was postponed.",
                        "vi": "Cuộc họp đã bị hoãn lại."
                    },
                    {
                        "en": "an annual meeting",
                        "vi": "một cuộc họp thường niên"
                    },
                    {
                        "en": "a board/council/committee/public meeting",
                        "vi": "một hội đồng quản trị / hội đồng / ủy ban / cuộc họp công cộng"
                    },
                    {
                        "en": "a series of meetings",
                        "vi": "một loạt các cuộc họp"
                    },
                    {
                        "en": "What time is the meeting?",
                        "vi": "Cuộc họp diễn ra lúc mấy giờ?"
                    },
                    {
                        "en": "Three speakers addressed the meeting.",
                        "vi": "Ba diễn giả phát biểu tại cuộc họp."
                    },
                    {
                        "en": "in a meeting I'll be in a meeting all morning—can you take my calls?",
                        "vi": "trong một cuộc họp Tôi sẽ họp cả buổi sáng — bạn có thể nhận cuộc gọi của tôi không?"
                    },
                    {
                        "en": "at a meeting The issue will be discussed at the next board meeting.",
                        "vi": "tại cuộc họp Vấn đề sẽ được thảo luận trong cuộc họp hội đồng quản trị tiếp theo."
                    },
                    {
                        "en": "meeting of somebody/something a meeting of the United Nations Security Council",
                        "vi": "cuộc họp của ai đó / cái gì đó một cuộc họp của Hội đồng Bảo an Liên hợp quốc"
                    },
                    {
                        "en": "meeting with somebody She is due to have a meeting with senior government officials.",
                        "vi": "meeting with somebody Cô ấy sẽ có một cuộc họp với các quan chức cấp cao của chính phủ."
                    },
                    {
                        "en": "meeting about something A public meeting about the proposal takes place on Monday.",
                        "vi": "cuộc họp về điều gì đó Một cuộc họp công khai về đề xuất diễn ra vào thứ Hai."
                    },
                    {
                        "en": "meeting between A and B This will be the first meeting between the two leaders since they took office.",
                        "vi": "Cuộc gặp giữa A và B Đây sẽ là cuộc gặp đầu tiên giữa hai nhà lãnh đạo kể từ khi họ nhậm chức."
                    },
                    {
                        "en": "Facilities include nine meeting rooms.",
                        "vi": "Cơ sở vật chất bao gồm chín phòng họp."
                    },
                    {
                        "en": "They rely on videoconferencing for virtual meetings.",
                        "vi": "Họ dựa vào hội nghị truyền hình cho các cuộc họp ảo."
                    }
                ]
            },
            {
                "define": {
                    "en": "the people at a meeting",
                    "vi": "những người trong một cuộc họp"
                },
                "examples": [
                    {
                        "en": "The meeting will discuss how to resolve the ongoing crisis in this region.",
                        "vi": "Cuộc họp sẽ thảo luận về cách giải quyết cuộc khủng hoảng đang diễn ra ở khu vực này."
                    },
                    {
                        "en": "The meeting voted to accept the pay offer.",
                        "vi": "Cuộc họp đã biểu quyết chấp nhận đề nghị trả lương."
                    },
                    {
                        "en": "Mr Wade told the meeting that a one-way system would make the town safer.",
                        "vi": "Ông Wade nói với cuộc họp rằng hệ thống một chiều sẽ giúp thị trấn an toàn hơn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a situation in which two or more people meet together, because they have arranged it or by chance",
                    "vi": "một tình huống mà hai hoặc nhiều người gặp nhau, do họ đã sắp xếp hoặc do tình cờ"
                },
                "examples": [
                    {
                        "en": "at a meeting At our first meeting I was nervous.",
                        "vi": "tại một cuộc họp Tại cuộc họp đầu tiên của chúng tôi, tôi đã rất lo lắng."
                    },
                    {
                        "en": "It was a chance meeting that would change my life.",
                        "vi": "Đó là một cuộc gặp gỡ tình cờ sẽ thay đổi cuộc đời tôi."
                    },
                    {
                        "en": "He remembered their childhood meetings with nostalgia.",
                        "vi": "Anh nhớ về những cuộc gặp gỡ thuở nhỏ của họ với nỗi nhớ."
                    },
                    {
                        "en": "meeting of/between A and B The meeting of father and son after so long was a joyous occasion.",
                        "vi": "cuộc gặp gỡ của / giữa A và B Cuộc gặp gỡ của hai cha con sau bao lâu là một dịp vui."
                    },
                    {
                        "en": "meeting with somebody This was only my second meeting with him.",
                        "vi": "cuộc gặp với ai đó Đây chỉ là cuộc gặp thứ hai của tôi với anh ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "a sports event or set of races, especially for horses",
                    "vi": "một sự kiện thể thao hoặc tập hợp các cuộc đua, đặc biệt là dành cho ngựa"
                },
                "examples": [
                    {
                        "en": "an athletics meeting",
                        "vi": "một cuộc họp điền kinh"
                    },
                    {
                        "en": "a race meeting",
                        "vi": "một cuộc họp cuộc đua"
                    },
                    {
                        "en": "The horse has won at all of his previous meetings this season.",
                        "vi": "Chú ngựa ô đã thắng trong tất cả các lần gặp nhau trước đây của anh ấy trong mùa giải này."
                    }
                ]
            },
            {
                "define": {
                    "en": "an occasion when people, especially Quakers, come together for worship",
                    "vi": "một dịp mà mọi người, đặc biệt là Quakers, đến với nhau để thờ phượng"
                },
                "examples": [
                    {
                        "en": "Quaker meetings are held here every week.",
                        "vi": "Các cuộc họp Quaker được tổ chức ở đây hàng tuần."
                    }
                ]
            },
            {
                "define": {
                    "en": "a close understanding between people with similar ideas, especially when they meet to do something or meet for the first time",
                    "vi": "sự hiểu biết chặt chẽ giữa những người có cùng ý tưởng, đặc biệt là khi họ gặp nhau để làm việc gì đó hoặc gặp nhau lần đầu tiên"
                },
                "examples": [
                    {
                        "en": "a meeting of minds between the two artists",
                        "vi": "cuộc gặp gỡ tâm đầu ý hợp giữa hai nghệ sĩ"
                    }
                ]
            }
        ]
    },
    {
        "id": "33292cbc35c7484d9ba42ff128c08efd",
        "word": "observance",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/əbˈzɜːvəns/",
            "us": "/əbˈzɜːrvəns/"
        },
        "nearby": [
            {
                "word": "observable",
                "pos": "adjective"
            },
            {
                "word": "observably",
                "pos": "adverb"
            },
            {
                "word": "observance",
                "pos": "noun"
            },
            {
                "word": "observant",
                "pos": "adjective"
            },
            {
                "word": "observation",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the practice of obeying a law, celebrating a festival or behaving according to a particular custom",
                    "vi": "thực hành tuân theo pháp luật, tổ chức lễ hội hoặc cư xử theo một phong tục cụ thể"
                },
                "examples": [
                    {
                        "en": "observance (of something) observance of the law",
                        "vi": "chấp hành (của một cái gì đó) tuân thủ pháp luật"
                    },
                    {
                        "en": "a strict observance of the Sabbath",
                        "vi": "tuân thủ nghiêm ngặt ngày Sa-bát"
                    },
                    {
                        "en": "observance of traditional practices",
                        "vi": "tuân thủ các tập tục truyền thống"
                    }
                ]
            },
            {
                "define": {
                    "en": "an act performed as part of a religious or traditional ceremony",
                    "vi": "một hành động được thực hiện như một phần của nghi lễ tôn giáo hoặc truyền thống"
                },
                "examples": [
                    {
                        "en": "religious observances",
                        "vi": "quan sát tôn giáo"
                    }
                ]
            }
        ]
    },
    {
        "id": "b2743785d288453c8ec6fb1b8ab5d7da",
        "word": "observe",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/əbˈzɜːv/",
            "us": "/əbˈzɜːrv/"
        },
        "nearby": [
            {
                "word": "observation car",
                "pos": "noun"
            },
            {
                "word": "observatory",
                "pos": "noun"
            },
            {
                "word": "observe",
                "pos": "verb"
            },
            {
                "word": "observed trials",
                "pos": "noun"
            },
            {
                "word": "observer",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to see or notice somebody/something",
                    "vi": "để xem hoặc để ý ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "observe somebody/something Have you observed any changes lately?",
                        "vi": "quan sát ai đó / điều gì đó Bạn có quan sát thấy bất kỳ thay đổi nào gần đây không?"
                    },
                    {
                        "en": "All the characters in the novel are closely observed (= seem like people in real life).",
                        "vi": "Tất cả các nhân vật trong cuốn tiểu thuyết đều được quan sát chặt chẽ (= có vẻ giống như những người trong cuộc sống thực)."
                    },
                    {
                        "en": "I want you to observe all the details.",
                        "vi": "Tôi muốn bạn quan sát tất cả các chi tiết."
                    },
                    {
                        "en": "The patterns observed in our study may represent a general rule.",
                        "vi": "Các mẫu quan sát được trong nghiên cứu của chúng tôi có thể đại diện cho một quy luật chung."
                    },
                    {
                        "en": "observe somebody/something do something The police observed a man enter the bank.",
                        "vi": "quan sát ai đó / điều gì đó làm điều gì đó Cảnh sát đã quan sát thấy một người đàn ông vào ngân hàng."
                    },
                    {
                        "en": "observe somebody/something doing something They observed him entering the bank.",
                        "vi": "quan sát ai đó / điều gì đó đang làm điều gì đó Họ đã quan sát anh ta vào ngân hàng."
                    },
                    {
                        "en": "observe that… She observed that all the chairs were already occupied.",
                        "vi": "quan sát điều đó… Cô ấy quan sát rằng tất cả các ghế đều đã có người ngồi."
                    },
                    {
                        "en": "be observed to do something He was observed to follow her closely.",
                        "vi": "được quan sát để làm điều gì đó Anh được quan sát để theo sát cô ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to watch somebody/something carefully, especially to learn more about them",
                    "vi": "để quan sát ai đó / cái gì đó một cách cẩn thận, đặc biệt là để tìm hiểu thêm về họ"
                },
                "examples": [
                    {
                        "en": "He observes keenly, but says little.",
                        "vi": "Anh ấy quan sát một cách nhạy bén, nhưng ít nói."
                    },
                    {
                        "en": "observe somebody/something I felt he was observing everything I did.",
                        "vi": "quan sát ai đó / điều gì đó mà tôi cảm thấy anh ấy đang quan sát mọi thứ tôi đã làm."
                    },
                    {
                        "en": "The patients were observed over a period of several months.",
                        "vi": "Các bệnh nhân được quan sát trong khoảng thời gian vài tháng."
                    },
                    {
                        "en": "an observed decrease in rainfall in the area",
                        "vi": "lượng mưa quan sát được trong khu vực giảm"
                    },
                    {
                        "en": "The program provided an opportunity to observe the effects of treatment.",
                        "vi": "Chương trình đã tạo cơ hội để quan sát những tác động của việc điều trị."
                    },
                    {
                        "en": "The cells were observed under a microscope.",
                        "vi": "Các tế bào được quan sát dưới kính hiển vi."
                    },
                    {
                        "en": "observe somebody/something for something The patient should be observed for signs of an allergic reaction.",
                        "vi": "quan sát ai đó / cái gì đó cho cái gì Cần quan sát bệnh nhân để tìm các dấu hiệu của phản ứng dị ứng."
                    },
                    {
                        "en": "observe how, what, etc… They observed how the parts of the machine fitted together.",
                        "vi": "quan sát như thế nào, cái gì, vv… Họ quan sát cách các bộ phận của máy được lắp với nhau."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make a remark",
                    "vi": "để đưa ra một nhận xét"
                },
                "examples": [
                    {
                        "en": "She observed that it was getting late.",
                        "vi": "Cô quan sát thấy trời đã muộn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to obey rules, laws, etc.",
                    "vi": "tuân thủ các quy tắc, luật pháp, v.v."
                },
                "examples": [
                    {
                        "en": "Will the rebels observe the ceasefire?",
                        "vi": "Liệu phiến quân có tuân theo lệnh ngừng bắn?"
                    },
                    {
                        "en": "The crowd observed a minute's silence (= were silent for one minute) in memory of those who had died.",
                        "vi": "Đám đông quan sát sự im lặng trong một phút (= im lặng trong một phút) để tưởng nhớ những người đã chết."
                    }
                ]
            },
            {
                "define": {
                    "en": "to celebrate festivals, birthdays, etc.",
                    "vi": "để tổ chức lễ hội, sinh nhật, v.v."
                },
                "examples": [
                    {
                        "en": "Do they observe Christmas?",
                        "vi": "Họ có quan sát lễ Giáng sinh không?"
                    }
                ]
            }
        ]
    },
    {
        "id": "91687a538efe41e7abdc799a35c56f78",
        "word": "ordain",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ɔːˈdeɪn/",
            "us": "/ɔːrˈdeɪn/"
        },
        "nearby": [
            {
                "word": "orchestration",
                "pos": "noun"
            },
            {
                "word": "orchid",
                "pos": "noun"
            },
            {
                "word": "ordain",
                "pos": "verb"
            },
            {
                "word": "ordeal",
                "pos": "noun"
            },
            {
                "word": "order",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to make somebody a priest, minister or rabbi",
                    "vi": "để biến ai đó trở thành linh mục, mục sư hoặc giáo sĩ Do Thái"
                },
                "examples": [
                    {
                        "en": "He was ordained (as) a priest last year.",
                        "vi": "Anh ấy đã được thụ phong linh mục vào năm ngoái."
                    }
                ]
            },
            {
                "define": {
                    "en": "to order or command something; to decide something in advance",
                    "vi": "để ra lệnh hoặc chỉ huy một cái gì đó; quyết định trước một cái gì đó"
                },
                "examples": [
                    {
                        "en": "ordain that… Fate had ordained that they would never meet again.",
                        "vi": "quy định rằng… Định mệnh đã sắp đặt rằng họ sẽ không bao giờ gặp lại nhau."
                    },
                    {
                        "en": "it is ordained that… It was ordained that the property should be returned to the original owner.",
                        "vi": "nó được sắc phong rằng… Người ta đã sắc phong rằng tài sản phải được trả lại cho chủ sở hữu ban đầu."
                    },
                    {
                        "en": "(be) ordained by somebody You should keep to the law as ordained by God.",
                        "vi": "(được) phong chức bởi ai đó Bạn nên tuân thủ luật pháp như được phong chức bởi Đức Chúa Trời."
                    }
                ]
            }
        ]
    },
    {
        "id": "9b8ec714432349628d2408173ee00ab7",
        "word": "ordination",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌɔːdɪˈneɪʃn/",
            "us": "/ˌɔːrdnˈeɪʃn/"
        },
        "nearby": [
            {
                "word": "ordinary share",
                "pos": "noun"
            },
            {
                "word": "ordinate",
                "pos": "noun"
            },
            {
                "word": "ordination",
                "pos": "noun"
            },
            {
                "word": "the ordination of women",
                "pos": "noun"
            },
            {
                "word": "ordnance",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act or ceremony of making somebody a priest, minister or rabbi",
                    "vi": "hành động hoặc nghi lễ biến ai đó trở thành linh mục, mục sư hoặc giáo sĩ Do Thái"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "b59e764ce3264ea69269f1cf5c46d2f0",
        "word": "puja",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpuːdʒɑː/",
            "us": "/ˈpuːdʒɑː/"
        },
        "nearby": [
            {
                "word": "pugnacity",
                "pos": "noun"
            },
            {
                "word": "puissance",
                "pos": "noun"
            },
            {
                "word": "puja",
                "pos": "noun"
            },
            {
                "word": "pujari",
                "pos": "noun"
            },
            {
                "word": "puke",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a Hindu ceremony of worship",
                    "vi": "một nghi lễ thờ cúng của người Hindu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "an offering (= a gift that is given to a god) at the ceremony",
                    "vi": "một lễ vật (= một món quà được ban cho một vị thần) tại buổi lễ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "b1fc85851bc5423cafb85ec02e0a34b9",
        "word": "remembrance",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/rɪˈmembrəns/",
            "us": "/rɪˈmembrəns/"
        },
        "nearby": [
            {
                "word": "remember",
                "pos": "verb"
            },
            {
                "word": "remember me to",
                "pos": "phrasal verb"
            },
            {
                "word": "remembrance",
                "pos": "noun"
            },
            {
                "word": "Remembrance Sunday",
                "pos": "noun"
            },
            {
                "word": "remind",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act or process of remembering an event in the past or a person who is dead",
                    "vi": "hành động hoặc quá trình ghi nhớ một sự kiện trong quá khứ hoặc một người đã chết"
                },
                "examples": [
                    {
                        "en": "in remembrance of somebody/something A service was held in remembrance of local soldiers killed in the war.",
                        "vi": "để tưởng nhớ ai đó / điều gì đó Một buổi lễ được tổ chức để tưởng nhớ những người lính địa phương đã thiệt mạng trong chiến tranh."
                    },
                    {
                        "en": "a remembrance service",
                        "vi": "một dịch vụ tưởng nhớ"
                    },
                    {
                        "en": "(formal) He smiled at the remembrance of their first kiss.",
                        "vi": "(trang trọng) Anh ấy mỉm cười khi nhớ lại nụ hôn đầu tiên của họ."
                    },
                    {
                        "en": "a chapel/garden of remembrance (= in memory of people who have died)",
                        "vi": "nhà nguyện / khu vườn tưởng nhớ (= tưởng nhớ những người đã mất)"
                    }
                ]
            },
            {
                "define": {
                    "en": "an object that causes you to remember somebody/something; a memory of somebody/something",
                    "vi": "một đối tượng khiến bạn nhớ ai đó / cái gì đó; ký ức về ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "The cenotaph stands as a remembrance of those killed during the war.",
                        "vi": "Cenotaph tượng trưng cho sự tưởng nhớ những người đã thiệt mạng trong chiến tranh."
                    },
                    {
                        "en": "The group shared their remembrances of life at school.",
                        "vi": "Nhóm đã chia sẻ những kỷ niệm của họ về cuộc sống ở trường."
                    }
                ]
            }
        ]
    },
    {
        "id": "138d3f88e34a494186e5f28b53cb49cd",
        "word": "Remembrance Sunday",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/rɪˌmembrəns ˈsʌndeɪ/",
            "us": "/rɪˌmembrəns ˈsʌndeɪ/"
        },
        "nearby": [
            {
                "word": "remember me to",
                "pos": "phrasal verb"
            },
            {
                "word": "remembrance",
                "pos": "noun"
            },
            {
                "word": "Remembrance Sunday",
                "pos": "noun"
            },
            {
                "word": "remind",
                "pos": "verb"
            },
            {
                "word": "reminder",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the Sunday nearest to the 11 November on which those killed in war, especially the wars of 1914–18 and 1939–45, are remembered in ceremonies and church services in the UK and some other countries",
                    "vi": "Chủ nhật gần nhất với ngày 11 tháng 11, ngày mà những người thiệt mạng trong chiến tranh, đặc biệt là các cuộc chiến tranh năm 1914–18 và 1939–45, được tưởng nhớ trong các nghi lễ và dịch vụ nhà thờ ở Vương quốc Anh và một số quốc gia khác"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a45d856071c141aba4ce40a17f42c5df",
        "word": "requiem",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈrekwiəm/",
            "us": "/ˈrekwiəm/"
        },
        "nearby": [
            {
                "word": "request",
                "pos": "verb"
            },
            {
                "word": "request stop",
                "pos": "noun"
            },
            {
                "word": "requiem",
                "pos": "noun"
            },
            {
                "word": "require",
                "pos": "verb"
            },
            {
                "word": "requirement",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a Christian ceremony for a person who has recently died, at which people say prayers for his or her soul",
                    "vi": "một buổi lễ Cơ đốc cho một người vừa qua đời, tại đó mọi người cầu nguyện cho linh hồn của người đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a piece of music for this ceremony",
                    "vi": "một bản nhạc cho buổi lễ này"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "2f2ec359d18e46a9917e43ce3bbb5422",
        "word": "rite",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/raɪt/",
            "us": "/raɪt/"
        },
        "nearby": [
            {
                "word": "Ritalin",
                "pos": "noun"
            },
            {
                "word": "Ritchie",
                "pos": ""
            },
            {
                "word": "rite",
                "pos": "noun"
            },
            {
                "word": "rite of passage",
                "pos": "noun"
            },
            {
                "word": "ritual",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a ceremony performed by a particular group of people, often for religious purposes",
                    "vi": "một buổi lễ được thực hiện bởi một nhóm người cụ thể, thường vì mục đích tôn giáo"
                },
                "examples": [
                    {
                        "en": "funeral rites",
                        "vi": "nghi thức tang lễ"
                    },
                    {
                        "en": "initiation rites (= performed when a new member joins a secret society)",
                        "vi": "nghi thức bắt đầu (= được thực hiện khi một thành viên mới gia nhập hội kín)"
                    }
                ]
            }
        ]
    },
    {
        "id": "f7d6128b9eaf4c07bd8d2ace88a7fb0f",
        "word": "ritualistic",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌrɪtʃuəˈlɪstɪk/",
            "us": "/ˌrɪtʃuəˈlɪstɪk/"
        },
        "nearby": [
            {
                "word": "ritual",
                "pos": "noun"
            },
            {
                "word": "ritual",
                "pos": "adjective"
            },
            {
                "word": "ritualistic",
                "pos": "adjective"
            },
            {
                "word": "ritualize",
                "pos": "verb"
            },
            {
                "word": "ritually",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "connected with the rituals performed as part of a ceremony",
                    "vi": "kết nối với các nghi lễ được thực hiện như một phần của buổi lễ"
                },
                "examples": [
                    {
                        "en": "a ritualistic act of worship",
                        "vi": "một hành động thờ cúng mang tính nghi lễ"
                    },
                    {
                        "en": "Objects connected with the saint have assumed an almost ritualistic significance.",
                        "vi": "Các đối tượng được kết nối với vị thánh đã mang một ý nghĩa gần như nghi lễ."
                    }
                ]
            },
            {
                "define": {
                    "en": "always done or said in the same way, especially when this is not sincere",
                    "vi": "luôn được thực hiện hoặc nói theo cách tương tự, đặc biệt khi điều này không chân thành"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "8856d0351e4947129a48d42f053a778d",
        "word": "sacrament",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsækrəmənt/",
            "us": "/ˈsækrəmənt/"
        },
        "nearby": [
            {
                "word": "Oliver Sacks",
                "pos": ""
            },
            {
                "word": "Vita Sackville-West",
                "pos": ""
            },
            {
                "word": "sacrament",
                "pos": "noun"
            },
            {
                "word": "sacramental",
                "pos": "adjective"
            },
            {
                "word": "Sacramento",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an important religious ceremony such as marriage, baptism or Communion",
                    "vi": "một nghi lễ tôn giáo quan trọng như hôn nhân, rửa tội hoặc rước lễ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the bread and wine that are eaten and drunk during the service of Communion",
                    "vi": "bánh và rượu được ăn và uống trong khi rước lễ"
                },
                "examples": [
                    {
                        "en": "to receive the sacrament",
                        "vi": "để lãnh nhận bí tích"
                    }
                ]
            }
        ]
    },
    {
        "id": "e5b8a7eba4df45be8aff8d10a769272a",
        "word": "Seder",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈseɪdə(r)/",
            "us": "/ˈseɪdər/"
        },
        "nearby": [
            {
                "word": "sedative",
                "pos": "adjective"
            },
            {
                "word": "sedentary",
                "pos": "adjective"
            },
            {
                "word": "Seder",
                "pos": "noun"
            },
            {
                "word": "sedge",
                "pos": "noun"
            },
            {
                "word": "the Battle of Sedgemoor",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a Jewish ceremonial service and dinner on the first night or first two nights of Passover",
                    "vi": "một nghi lễ và bữa tối của người Do Thái vào đêm đầu tiên hoặc hai đêm đầu tiên của Lễ Vượt Qua"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "66220e03208d4721b3cbd6c15fec01d3",
        "word": "sermon",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsɜːmən/",
            "us": "/ˈsɜːrmən/"
        },
        "nearby": [
            {
                "word": "seriousness",
                "pos": "noun"
            },
            {
                "word": "the Serious Organised Crime Agency",
                "pos": ""
            },
            {
                "word": "sermon",
                "pos": "noun"
            },
            {
                "word": "sermonize",
                "pos": "verb"
            },
            {
                "word": "serotonin",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a talk on a moral or religious subject, usually given by a religious leader during a service",
                    "vi": "một bài nói chuyện về chủ đề đạo đức hoặc tôn giáo, thường được đưa ra bởi một nhà lãnh đạo tôn giáo trong một buổi lễ"
                },
                "examples": [
                    {
                        "en": "She preached a sermon on forgiveness.",
                        "vi": "Cô ấy đã giảng một bài giảng về sự tha thứ."
                    },
                    {
                        "en": "He gave a long sermon against abortion.",
                        "vi": "Ông đã thuyết pháp dài chống lại việc phá thai."
                    },
                    {
                        "en": "He preached a long sermon against the war.",
                        "vi": "Ông đã thuyết giảng một bài thuyết pháp dài chống lại chiến tranh."
                    }
                ]
            },
            {
                "define": {
                    "en": "moral advice that a person tries to give you in a long talk",
                    "vi": "lời khuyên đạo đức mà một người cố gắng đưa ra cho bạn trong một cuộc nói chuyện dài"
                },
                "examples": [
                    {
                        "en": "We had to listen to a long sermon on the evils of wasting time.",
                        "vi": "Chúng tôi đã phải nghe một bài giảng dài về tệ nạn của việc lãng phí thời gian."
                    }
                ]
            }
        ]
    },
    {
        "id": "15f3f98be12c49cabfc2e39f6e3d8818",
        "word": "solemnize",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsɒləmnaɪz/",
            "us": "/ˈsɑːləmnaɪz/"
        },
        "nearby": [
            {
                "word": "solemn",
                "pos": "adjective"
            },
            {
                "word": "solemnity",
                "pos": "noun"
            },
            {
                "word": "solemnize",
                "pos": "verb"
            },
            {
                "word": "solemnly",
                "pos": "adverb"
            },
            {
                "word": "solenoid",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to perform a religious ceremony, especially a marriage",
                    "vi": "để thực hiện một nghi lễ tôn giáo, đặc biệt là hôn nhân"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "85720341c9fb48f4ad7de281953387ee",
        "word": "tangi",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈtæŋi/",
            "us": "/ˈtæŋi/"
        },
        "nearby": [
            {
                "word": "tangerine",
                "pos": "adjective"
            },
            {
                "word": "tangerine",
                "pos": "noun"
            },
            {
                "word": "tangi",
                "pos": "noun"
            },
            {
                "word": "tangible",
                "pos": "adjective"
            },
            {
                "word": "tangibly",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a Maori funeral (= ceremony for a dead person), or meal that is held after the ceremony",
                    "vi": "một đám tang của người Maori (= lễ cho một người đã chết), hoặc bữa ăn được tổ chức sau buổi lễ"
                },
                "examples": []
            }
        ]
    }
]