[
    {
        "id": "6096e1c16a85494588dd0804949100a1",
        "word": "dialogue",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/ˈdaɪəlɒɡ/",
            "us": "/ˈdaɪəlɔːɡ/"
        },
        "nearby": [
            {
                "word": "dialling tone",
                "pos": "noun"
            },
            {
                "word": "dialog box",
                "pos": "noun"
            },
            {
                "word": "dialogue",
                "pos": "noun"
            },
            {
                "word": "dial up",
                "pos": "phrasal verb"
            },
            {
                "word": "dial-up",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a conversation in a book, play or film or in language teaching materials",
                    "vi": "một cuộc trò chuyện trong một cuốn sách, vở kịch hoặc phim hoặc trong tài liệu giảng dạy ngôn ngữ"
                },
                "examples": [
                    {
                        "en": "Learners are asked to listen to three short dialogues.",
                        "vi": "Người học được yêu cầu nghe ba đoạn hội thoại ngắn."
                    },
                    {
                        "en": "Practise the dialogue with a partner.",
                        "vi": "Thực hành đối thoại với đối tác."
                    },
                    {
                        "en": "The novel has long descriptions and not much dialogue.",
                        "vi": "Cuốn tiểu thuyết có những đoạn miêu tả dài và không nhiều lời thoại."
                    }
                ]
            },
            {
                "define": {
                    "en": "a formal discussion between two groups or countries, especially when they are trying to solve a problem, end a disagreement, etc.",
                    "vi": "một cuộc thảo luận chính thức giữa hai nhóm hoặc quốc gia, đặc biệt khi họ đang cố gắng giải quyết một vấn đề, chấm dứt bất đồng, v.v."
                },
                "examples": [
                    {
                        "en": "The president told waiting reporters there had been a constructive dialogue.",
                        "vi": "Tổng thống nói với các phóng viên đang chờ rằng đã có một cuộc đối thoại mang tính xây dựng."
                    },
                    {
                        "en": "dialogue with somebody The government refused to engage in direct dialogue with the terrorists.",
                        "vi": "đối thoại với ai đó Chính phủ từ chối tham gia đối thoại trực tiếp với những kẻ khủng bố."
                    },
                    {
                        "en": "dialogue between A and B There needs to be a closer dialogue between management and staff.",
                        "vi": "đối thoại giữa A và B Cần có một cuộc đối thoại chặt chẽ hơn giữa quản lý và nhân viên."
                    },
                    {
                        "en": "dialogue about something an honest and open dialogue about racial identity in the US",
                        "vi": "đối thoại về điều gì đó đối thoại trung thực và cởi mở về bản sắc chủng tộc ở Hoa Kỳ"
                    },
                    {
                        "en": "dialogue on something a meaningful dialogue on pay and working conditions",
                        "vi": "đối thoại về điều gì đó đối thoại có ý nghĩa về lương và điều kiện làm việc"
                    }
                ]
            }
        ]
    },
    {
        "id": "4cb01da3ada74234b40a112c47917540",
        "word": "character",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈkærəktə(r)/",
            "us": "/ˈkærəktər/"
        },
        "nearby": [
            {
                "word": "char",
                "pos": "verb"
            },
            {
                "word": "charabanc",
                "pos": "noun"
            },
            {
                "word": "character",
                "pos": "noun"
            },
            {
                "word": "character actor",
                "pos": "noun"
            },
            {
                "word": "character code",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person or an animal in a book, play or film",
                    "vi": "một người hoặc một con vật trong một cuốn sách, vở kịch hoặc bộ phim"
                },
                "examples": [
                    {
                        "en": "the main character in the film",
                        "vi": "nhân vật chính trong phim"
                    },
                    {
                        "en": "a major/minor character in the book",
                        "vi": "một nhân vật chính / phụ trong cuốn sách"
                    },
                    {
                        "en": "Who plays the main character?",
                        "vi": "Ai đóng vai nhân vật chính?"
                    },
                    {
                        "en": "He loves to draw and create his own cartoon characters.",
                        "vi": "Anh ấy thích vẽ và tạo ra các nhân vật hoạt hình của riêng mình."
                    },
                    {
                        "en": "Clint Eastwood's character is the most sympathetic in the movie.",
                        "vi": "Nhân vật của Clint Eastwood gây được thiện cảm nhất phim."
                    }
                ]
            },
            {
                "define": {
                    "en": "a particular type of person in a play, film or TV show",
                    "vi": "một kiểu người cụ thể trong vở kịch, phim hoặc chương trình truyền hình"
                },
                "examples": [
                    {
                        "en": "He has developed a skill set from his character work in film,TV and stage.",
                        "vi": "Anh ấy đã phát triển một bộ kỹ năng từ công việc nhân vật của mình trong phim, truyền hình và sân khấu."
                    }
                ]
            },
            {
                "define": {
                    "en": "all the qualities and features that make a person different from others",
                    "vi": "tất cả những phẩm chất và đặc điểm khiến một người khác biệt với những người khác"
                },
                "examples": [
                    {
                        "en": "to have a strong/weak character",
                        "vi": "có một nhân vật mạnh / yếu"
                    },
                    {
                        "en": "character traits",
                        "vi": "đặc điểm tính cách"
                    },
                    {
                        "en": "character defects",
                        "vi": "khuyết tật nhân vật"
                    },
                    {
                        "en": "The book gives a fascinating insight into Mrs Obama's character.",
                        "vi": "Cuốn sách mang đến một cái nhìn sâu sắc hấp dẫn về tính cách của bà Obama."
                    },
                    {
                        "en": "Generosity is part of the American character.",
                        "vi": "Sự hào phóng là một phần trong tính cách của người Mỹ."
                    }
                ]
            },
            {
                "define": {
                    "en": "strong personal qualities such as the ability to deal with difficult or dangerous situations",
                    "vi": "phẩm chất cá nhân mạnh mẽ như khả năng đối phó với các tình huống khó khăn hoặc nguy hiểm"
                },
                "examples": [
                    {
                        "en": "Everyone admires her strength of character and determination.",
                        "vi": "Mọi người đều khâm phục nghị lực và lòng quyết tâm của cô ấy."
                    },
                    {
                        "en": "He showed great character returning to the sport after his accident.",
                        "vi": "Anh ấy đã thể hiện bản lĩnh tuyệt vời khi trở lại với môn thể thao này sau tai nạn của mình."
                    },
                    {
                        "en": "Adventure camps are considered to be character-building (= meant to improve somebody's strong qualities).",
                        "vi": "Trại phiêu lưu được coi là hoạt động xây dựng nhân vật (= nhằm nâng cao phẩm chất mạnh mẽ của ai đó)."
                    }
                ]
            },
            {
                "define": {
                    "en": "the way that something is; a particular quality or feature that a thing, an event or a place has",
                    "vi": "cách mà một cái gì đó là; chất lượng hoặc tính năng cụ thể mà một sự vật, một sự kiện hoặc một địa điểm có"
                },
                "examples": [
                    {
                        "en": "The character of the neighbourhood hasn't changed at all.",
                        "vi": "Tính cách của khu phố không hề thay đổi."
                    },
                    {
                        "en": "I love the delicate character of the light in the evening.",
                        "vi": "Tôi yêu đặc tính mong manh của ánh sáng vào buổi tối."
                    },
                    {
                        "en": "The police pointed out the illegal character of the protest action.",
                        "vi": "Cảnh sát đã chỉ ra đặc điểm bất hợp pháp của hành động biểu tình."
                    },
                    {
                        "en": "in character buildings that are very simple in character",
                        "vi": "trong các tòa nhà nhân vật rất đơn giản về tính cách"
                    }
                ]
            },
            {
                "define": {
                    "en": "the interesting or unusual quality that a place or a person has",
                    "vi": "chất lượng thú vị hoặc bất thường mà một nơi hoặc một người có"
                },
                "examples": [
                    {
                        "en": "The modern hotels here have no real character.",
                        "vi": "Các khách sạn hiện đại ở đây không có nhân vật thực sự."
                    },
                    {
                        "en": "a face with a lot of character",
                        "vi": "một khuôn mặt có rất nhiều tính cách"
                    }
                ]
            },
            {
                "define": {
                    "en": "a person, particularly an unpleasant or strange one",
                    "vi": "một người, đặc biệt là một người khó ưa hoặc kỳ lạ"
                },
                "examples": [
                    {
                        "en": "There were some really strange characters hanging around the bar.",
                        "vi": "Có một số nhân vật thực sự kỳ lạ quanh quán bar."
                    }
                ]
            },
            {
                "define": {
                    "en": "an interesting or unusual person",
                    "vi": "một người thú vị hoặc bất thường"
                },
                "examples": [
                    {
                        "en": "She's a character!",
                        "vi": "Cô ấy là một nhân vật!"
                    }
                ]
            },
            {
                "define": {
                    "en": "the opinion that people have of you, particularly of whether you can be trusted or relied on",
                    "vi": "ý kiến mà mọi người có về bạn, đặc biệt là về việc bạn có thể được tin cậy hay dựa vào"
                },
                "examples": [
                    {
                        "en": "She was a victim of character assassination (= an unfair attack on the good opinion people had of her).",
                        "vi": "Cô là nạn nhân của vụ ám sát nhân vật (= một cuộc tấn công không công bằng vào quan điểm tốt mà mọi người dành cho cô)."
                    },
                    {
                        "en": "a slur/attack on his character",
                        "vi": "một cuộc tấn công vào nhân vật của anh ta"
                    },
                    {
                        "en": "My teacher agreed to be a character witness for me in court.",
                        "vi": "Giáo viên của tôi đã đồng ý làm nhân chứng cho tôi trước tòa."
                    },
                    {
                        "en": "a character reference (= a letter that a person who knows you well writes to an employer to tell them about your good qualities)",
                        "vi": "một tham chiếu về nhân vật (= một lá thư mà một người biết rõ về bạn viết cho nhà tuyển dụng để nói với họ về những phẩm chất tốt của bạn)"
                    }
                ]
            },
            {
                "define": {
                    "en": "a letter, sign, mark or symbol used in writing, in printing or on computers",
                    "vi": "một chữ cái, ký hiệu, dấu hoặc ký hiệu được sử dụng trong văn bản, in ấn hoặc trên máy tính"
                },
                "examples": [
                    {
                        "en": "These are the Chinese characters meaning ‘wind’ and ‘water’.",
                        "vi": "Đây là những ký tự Trung Quốc có nghĩa là \"gió\" và \"nước\"."
                    },
                    {
                        "en": "This size of type produces a line 30 characters long.",
                        "vi": "Loại kích thước này tạo ra một dòng dài 30 ký tự."
                    },
                    {
                        "en": "optical character recognition",
                        "vi": "nhận dạng ký tự quang học"
                    },
                    {
                        "en": "The URL contained non-standard characters like question marks.",
                        "vi": "URL chứa các ký tự không chuẩn như dấu chấm hỏi."
                    }
                ]
            },
            {
                "define": {
                    "en": "typical/not typical of a person’s character",
                    "vi": "điển hình / không điển hình về tính cách của một người"
                },
                "examples": [
                    {
                        "en": "Her behaviour last night was completely out of character.",
                        "vi": "Hành vi của cô đêm qua hoàn toàn không có tính cách."
                    },
                    {
                        "en": "The lawyer argued that his client's violent behaviour was out of character.",
                        "vi": "Luật sư lập luận rằng hành vi bạo lực của thân chủ của mình là ngoài tính cách."
                    }
                ]
            },
            {
                "define": {
                    "en": "in the same style as something",
                    "vi": "theo cùng một phong cách với một cái gì đó"
                },
                "examples": [
                    {
                        "en": "The new wing of the museum was not really in character with the rest of the building.",
                        "vi": "Cánh mới của bảo tàng không thực sự đặc trưng với phần còn lại của tòa nhà."
                    }
                ]
            }
        ]
    },
    {
        "id": "c0a20d3c1eb64c2dbd0fac40868d4b12",
        "word": "ending",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈendɪŋ/",
            "us": "/ˈendɪŋ/"
        },
        "nearby": [
            {
                "word": "endgame",
                "pos": "noun"
            },
            {
                "word": "end in",
                "pos": "phrasal verb"
            },
            {
                "word": "ending",
                "pos": "noun"
            },
            {
                "word": "endive",
                "pos": "noun"
            },
            {
                "word": "endless",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the last part of a story, film, etc.",
                    "vi": "phần cuối của một câu chuyện, bộ phim, v.v."
                },
                "examples": [
                    {
                        "en": "His stories usually have a happy ending.",
                        "vi": "Những câu chuyện của anh ấy thường có một kết thúc có hậu."
                    },
                    {
                        "en": "Friends don't spoil the endings of films for their friends.",
                        "vi": "Bạn bè không làm hỏng phần cuối của bộ phim cho bạn bè của họ."
                    },
                    {
                        "en": "ending to something It's a beautiful ending to the scene.",
                        "vi": "kết thúc cho một cái gì đó Đó là một kết thúc đẹp cho cảnh."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of finishing something; the last part of something",
                    "vi": "hành động hoàn thành một cái gì đó; phần cuối cùng của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "Today is the anniversary of the ending of the Pacific War.",
                        "vi": "Hôm nay là ngày kỷ niệm kết thúc Chiến tranh Thái Bình Dương."
                    },
                    {
                        "en": "ending to something It was the perfect ending to the perfect day.",
                        "vi": "kết thúc cho một cái gì đó Đó là kết thúc hoàn hảo cho ngày hoàn hảo."
                    }
                ]
            },
            {
                "define": {
                    "en": "the last part of a word, that is added to a main part",
                    "vi": "phần cuối cùng của từ, được thêm vào phần chính"
                },
                "examples": [
                    {
                        "en": "verb endings",
                        "vi": "kết thúc động từ"
                    },
                    {
                        "en": "a masculine/feminine ending",
                        "vi": "một kết thúc nam tính / nữ tính"
                    }
                ]
            }
        ]
    },
    {
        "id": "30284105faea4488a80c8c8947f194a7",
        "word": "hero",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈhɪərəʊ/",
            "us": "/ˈhɪrəʊ/"
        },
        "nearby": [
            {
                "word": "hernia",
                "pos": "noun"
            },
            {
                "word": "herniated disc",
                "pos": "noun"
            },
            {
                "word": "hero",
                "pos": "noun"
            },
            {
                "word": "heroic",
                "pos": "adjective"
            },
            {
                "word": "heroically",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who is admired by many people for doing something brave or good",
                    "vi": "một người được nhiều người ngưỡng mộ vì đã làm điều gì đó dũng cảm hoặc tốt"
                },
                "examples": [
                    {
                        "en": "a war hero (= somebody who was very brave during a war)",
                        "vi": "một anh hùng chiến tranh (= ai đó rất dũng cảm trong chiến tranh)"
                    },
                    {
                        "en": "a hero of the First World War",
                        "vi": "một anh hùng trong chiến tranh thế giới thứ nhất"
                    },
                    {
                        "en": "one of the country’s national heroes",
                        "vi": "một trong những anh hùng dân tộc của đất nước"
                    },
                    {
                        "en": "His charity work has made him something of a local hero.",
                        "vi": "Công việc từ thiện của anh ấy đã khiến anh ấy trở thành một anh hùng của địa phương."
                    },
                    {
                        "en": "The Olympic team were given a hero's welcome on their return home.",
                        "vi": "Đội tuyển Olympic đã được chào đón một người hùng trong chuyến trở về nhà."
                    },
                    {
                        "en": "Scientists like her are typically unsung heroes (= people who are not praised or famous but deserve to be).",
                        "vi": "Các nhà khoa học như cô ấy thường là những anh hùng thầm lặng (= những người không được ca ngợi hay nổi tiếng nhưng xứng đáng được trở thành)."
                    },
                    {
                        "en": "He was hailed as a hero after the rescue.",
                        "vi": "Anh được ca ngợi như một anh hùng sau cuộc giải cứu."
                    }
                ]
            },
            {
                "define": {
                    "en": "the main male character in a story, novel, film, etc.",
                    "vi": "nhân vật nam chính trong truyện, tiểu thuyết, phim, v.v."
                },
                "examples": [
                    {
                        "en": "The hero of the novel is a ten-year old boy.",
                        "vi": "Anh hùng của cuốn tiểu thuyết là một cậu bé mười tuổi."
                    },
                    {
                        "en": "action heroes like Bruce Willis",
                        "vi": "những anh hùng hành động như Bruce Willis"
                    }
                ]
            },
            {
                "define": {
                    "en": "a person that you admire because of a particular quality or skill that they have",
                    "vi": "một người mà bạn ngưỡng mộ vì phẩm chất hoặc kỹ năng cụ thể mà họ có"
                },
                "examples": [
                    {
                        "en": "my childhood hero",
                        "vi": "anh hùng thời thơ ấu của tôi"
                    },
                    {
                        "en": "hero to somebody He became a hero to millions for his decision to oppose the government's reforms.",
                        "vi": "anh hùng đối với ai đó Anh trở thành anh hùng đối với hàng triệu người vì quyết định chống lại những cải cách của chính phủ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a long bread roll split open along its length and filled with various types of food",
                    "vi": "một cuộn bánh mì dài được tách ra dọc theo chiều dài của nó và chứa đầy các loại thức ăn khác nhau"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "f0199ebb487a4f85a4763d584c43d4fd",
        "word": "heroine",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈherəʊɪn/",
            "us": "/ˈherəʊɪn/"
        },
        "nearby": [
            {
                "word": "heroics",
                "pos": "noun"
            },
            {
                "word": "heroin",
                "pos": "noun"
            },
            {
                "word": "heroine",
                "pos": "noun"
            },
            {
                "word": "heroism",
                "pos": "noun"
            },
            {
                "word": "heron",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a girl or woman who is admired by many for doing something brave or good",
                    "vi": "một cô gái hoặc phụ nữ được nhiều người ngưỡng mộ vì đã làm điều gì đó dũng cảm hoặc tốt"
                },
                "examples": [
                    {
                        "en": "the heroines of the revolution",
                        "vi": "các nữ anh hùng của cuộc cách mạng"
                    },
                    {
                        "en": "She remains one of the unsung heroines of the Second World War.",
                        "vi": "Cô vẫn là một trong những nữ anh hùng vô danh của Chiến tranh thế giới thứ hai."
                    }
                ]
            },
            {
                "define": {
                    "en": "the main female character in a story, novel, film, etc.",
                    "vi": "nhân vật nữ chính trong truyện, tiểu thuyết, phim, v.v."
                },
                "examples": [
                    {
                        "en": "The heroine is played by Demi Moore.",
                        "vi": "Nhân vật nữ chính do Demi Moore thủ vai."
                    },
                    {
                        "en": "She has played several of Shakespeare's heroines—Portia and Juliet among them.",
                        "vi": "Cô ấy đã đóng một số nữ anh hùng của Shakespeare — trong số đó có Portia và Juliet."
                    }
                ]
            },
            {
                "define": {
                    "en": "a woman that you admire because of a particular quality or skill that she has",
                    "vi": "một người phụ nữ mà bạn ngưỡng mộ vì phẩm chất hoặc kỹ năng cụ thể mà cô ấy có"
                },
                "examples": [
                    {
                        "en": "Madonna was her teenage heroine.",
                        "vi": "Madonna là nữ anh hùng tuổi teen của cô ấy."
                    },
                    {
                        "en": "She was thrilled to be interviewing her childhood heroine.",
                        "vi": "Cô ấy rất xúc động khi được phỏng vấn nữ anh hùng thời thơ ấu của mình."
                    }
                ]
            }
        ]
    },
    {
        "id": "fd94b36d924a4110aed2e6dc0fee1773",
        "word": "role",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/rəʊl/",
            "us": "/rəʊl/"
        },
        "nearby": [
            {
                "word": "the Rokeby Venus",
                "pos": ""
            },
            {
                "word": "roko",
                "pos": "noun"
            },
            {
                "word": "role",
                "pos": "noun"
            },
            {
                "word": "role model",
                "pos": "noun"
            },
            {
                "word": "role-play",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an actor’s part in a play, film, etc.",
                    "vi": "phần của một diễn viên trong một vở kịch, bộ phim, v.v."
                },
                "examples": [
                    {
                        "en": "She has landed the lead role (= the most important one) in a new play.",
                        "vi": "Cô ấy đã đảm nhận vai chính (= vai quan trọng nhất) trong một vở kịch mới."
                    },
                    {
                        "en": "a leading/starring role",
                        "vi": "một vai chính / đóng vai chính"
                    },
                    {
                        "en": "the role of somebody He played the role of Sonny in ‘The Godfather’.",
                        "vi": "vai của ai đó Anh ấy đã đóng vai Sonny trong 'The Godfather'."
                    }
                ]
            },
            {
                "define": {
                    "en": "the function or position that somebody has or is expected to have in an organization, in society or in a relationship",
                    "vi": "chức năng hoặc vị trí mà ai đó có hoặc dự kiến sẽ có trong một tổ chức, trong xã hội hoặc trong một mối quan hệ"
                },
                "examples": [
                    {
                        "en": "the changing role of women",
                        "vi": "vai trò thay đổi của phụ nữ"
                    },
                    {
                        "en": "role in something the artist's role in society",
                        "vi": "vai trò của nghệ sĩ trong xã hội"
                    },
                    {
                        "en": "role as somebody He is stepping down from his role as chair.",
                        "vi": "vai trò như một người nào đó Anh ấy từ bỏ vai trò chủ tọa của mình."
                    },
                    {
                        "en": "I welcome the opportunity to assume a leadership role within the organization.",
                        "vi": "Tôi hoan nghênh cơ hội đảm nhận vai trò lãnh đạo trong tổ chức."
                    },
                    {
                        "en": "In many marriages there has been a complete role reversal (= change of roles) with the man staying at home and the woman going out to work.",
                        "vi": "Trong nhiều cuộc hôn nhân, đã có sự đảo ngược vai trò hoàn toàn (= sự thay đổi vai trò) với người đàn ông ở nhà và người phụ nữ ra ngoài làm việc."
                    },
                    {
                        "en": "It is important that everyone has clearly defined roles and responsibilities.",
                        "vi": "Điều quan trọng là mọi người phải xác định rõ vai trò và trách nhiệm."
                    }
                ]
            },
            {
                "define": {
                    "en": "the degree to which somebody/something is involved in a situation or an activity and the effect that they have on it",
                    "vi": "mức độ mà ai đó / điều gì đó tham gia vào một tình huống hoặc một hoạt động và ảnh hưởng của họ đối với nó"
                },
                "examples": [
                    {
                        "en": "A cup of tea often serves an important social role.",
                        "vi": "Một tách trà thường phục vụ một vai trò xã hội quan trọng."
                    },
                    {
                        "en": "a key/leading/central/crucial/vital role",
                        "vi": "một vai trò quan trọng / hàng đầu / trung tâm / quan trọng / quan trọng"
                    },
                    {
                        "en": "role in doing something The media play a major role in influencing people's opinions.",
                        "vi": "vai trò trong việc thực hiện một cái gì đó Các phương tiện truyền thông đóng một vai trò quan trọng trong việc ảnh hưởng đến ý kiến của mọi người."
                    },
                    {
                        "en": "Small businesses have a significant role to play in keeping the economy buoyant.",
                        "vi": "Các doanh nghiệp nhỏ có một vai trò quan trọng trong việc giữ cho nền kinh tế phát triển."
                    },
                    {
                        "en": "role in something UK scientists have taken a lead role in the project.",
                        "vi": "vai trò trong một cái gì đó các nhà khoa học Vương quốc Anh đã đảm nhận vai trò chính trong dự án."
                    },
                    {
                        "en": "role of somebody/something in something the role of diet in the prevention of disease",
                        "vi": "vai trò của ai đó / cái gì đó trong một cái gì đó vai trò của chế độ ăn uống trong việc ngăn ngừa bệnh tật"
                    },
                    {
                        "en": "role as something The company has cemented its role as a leader in the industry.",
                        "vi": "vai trò như một cái gì đó Công ty đã củng cố vai trò của mình như một công ty hàng đầu trong ngành."
                    },
                    {
                        "en": "role of somebody/something as something Thomas downplays the role of these letters as historical evidence.",
                        "vi": "vai trò của ai đó / cái gì đó như một cái gì đó Thomas hạ thấp vai trò của những bức thư này như là bằng chứng lịch sử."
                    }
                ]
            }
        ]
    },
    {
        "id": "8e40a198886d4ecfa03636e8549382cb",
        "word": "scene",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/siːn/",
            "us": "/siːn/"
        },
        "nearby": [
            {
                "word": "SCE",
                "pos": "abbreviation"
            },
            {
                "word": "scenario",
                "pos": "noun"
            },
            {
                "word": "scene",
                "pos": "noun"
            },
            {
                "word": "scene-of-crime",
                "pos": "adjective"
            },
            {
                "word": "scenery",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the place where something happens, especially something unpleasant",
                    "vi": "nơi mà một cái gì đó xảy ra, đặc biệt là một cái gì đó khó chịu"
                },
                "examples": [
                    {
                        "en": "the scene of the accident/crime/crash",
                        "vi": "hiện trường của vụ tai nạn / tội phạm / vụ tai nạn"
                    },
                    {
                        "en": "The attacker fled the scene.",
                        "vi": "Kẻ tấn công đã bỏ trốn khỏi hiện trường."
                    },
                    {
                        "en": "Italy was the scene of many demonstrations at that time.",
                        "vi": "Ý là nơi diễn ra nhiều cuộc biểu tình lúc bấy giờ."
                    },
                    {
                        "en": "on the scene Firefighters arrived on the scene within minutes.",
                        "vi": "tại hiện trường Các nhân viên cứu hỏa đã đến hiện trường trong vòng vài phút."
                    },
                    {
                        "en": "at the scene Sadly the man died at the scene.",
                        "vi": "tại hiện trường Đáng buồn là người đàn ông đã chết tại hiện trường."
                    }
                ]
            },
            {
                "define": {
                    "en": "an event or a situation that you see, especially one of a particular type",
                    "vi": "một sự kiện hoặc một tình huống mà bạn thấy, đặc biệt là một trong những loại cụ thể"
                },
                "examples": [
                    {
                        "en": "The team's victory produced scenes of jubilation all over the country.",
                        "vi": "Chiến thắng của đội đã tạo ra những cảnh tượng tưng bừng trên khắp đất nước."
                    },
                    {
                        "en": "a scene of devastation/carnage",
                        "vi": "một cảnh tượng tàn phá / tàn sát"
                    },
                    {
                        "en": "She witnessed some very distressing scenes.",
                        "vi": "Cô đã chứng kiến một số cảnh rất đau khổ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a part of a film, play or book in which the action happens in one place or is of one particular type",
                    "vi": "một phần của phim, vở kịch hoặc cuốn sách trong đó hành động xảy ra ở một nơi hoặc thuộc một loại cụ thể"
                },
                "examples": [
                    {
                        "en": "sex/fight/action/battle scenes",
                        "vi": "cảnh quan hệ tình dục / chiến đấu / hành động / chiến đấu"
                    },
                    {
                        "en": "deleted scenes (= ones that were not included in the final version)",
                        "vi": "những cảnh đã xóa (= những cảnh không có trong phiên bản cuối cùng)"
                    },
                    {
                        "en": "to film/shoot a scene",
                        "vi": "quay phim / quay một cảnh"
                    },
                    {
                        "en": "They shot the opening scene 15 times.",
                        "vi": "Họ đã quay cảnh mở đầu 15 lần."
                    },
                    {
                        "en": "I got very nervous before my big scene (= the one where I have a very important part).",
                        "vi": "Tôi đã rất lo lắng trước cảnh quay lớn của mình (= cảnh mà tôi có một phần rất quan trọng)."
                    },
                    {
                        "en": "The scene where he arrives at the factory is the turning point in the book.",
                        "vi": "Cảnh anh đến nhà máy là bước ngoặt của cuốn sách."
                    }
                ]
            },
            {
                "define": {
                    "en": "one of the small sections that a play or an opera is divided into",
                    "vi": "một trong những phần nhỏ mà vở kịch hoặc một vở opera được chia thành"
                },
                "examples": [
                    {
                        "en": "Act I, Scene 2 of ‘Macbeth’",
                        "vi": "Act I, Scene 2 of 'Macbeth'"
                    }
                ]
            },
            {
                "define": {
                    "en": "a particular area of activity or way of life and the people who are part of it",
                    "vi": "một lĩnh vực hoạt động hoặc cách sống cụ thể và những người là một phần của nó"
                },
                "examples": [
                    {
                        "en": "the art/club/punk scene",
                        "vi": "bối cảnh nghệ thuật / câu lạc bộ / punk"
                    },
                    {
                        "en": "on the… scene a newcomer on the music scene",
                        "vi": "trên sân khấu… một người mới trên sân khấu âm nhạc"
                    },
                    {
                        "en": "British players were finding it increasingly difficult to compete on the international scene.",
                        "vi": "Các cầu thủ Anh ngày càng gặp khó khăn khi thi đấu trên đấu trường quốc tế."
                    },
                    {
                        "en": "Tarantino burst onto the cinema scene in the ’90s.",
                        "vi": "Tarantino bùng nổ trên sân khấu điện ảnh vào những năm 90."
                    },
                    {
                        "en": "After years at the top, she just vanished from the scene.",
                        "vi": "Sau nhiều năm ở đỉnh cao, cô ấy biến mất khỏi hiện trường."
                    }
                ]
            },
            {
                "define": {
                    "en": "a view that you see",
                    "vi": "một cái nhìn mà bạn thấy"
                },
                "examples": [
                    {
                        "en": "a delightful rural scene",
                        "vi": "một cảnh nông thôn thú vị"
                    },
                    {
                        "en": "They went abroad for a change of scene (= to see and experience new surroundings).",
                        "vi": "Họ ra nước ngoài để thay đổi bối cảnh (= để xem và trải nghiệm môi trường xung quanh mới)."
                    },
                    {
                        "en": "We stood and surveyed the scene.",
                        "vi": "Chúng tôi đã đứng và khảo sát hiện trường."
                    },
                    {
                        "en": "I stared out of the window of the train on the ever-changing scene.",
                        "vi": "Tôi nhìn chằm chằm ra ngoài cửa sổ của toa tàu về khung cảnh luôn thay đổi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a painting, drawing, or photograph of a place and the things that are happening there",
                    "vi": "một bức tranh, bản vẽ hoặc ảnh chụp một địa điểm và những điều đang diễn ra ở đó"
                },
                "examples": [
                    {
                        "en": "an exhibition of Parisian street scenes",
                        "vi": "triển lãm cảnh đường phố Paris"
                    },
                    {
                        "en": "He painted scenes of country life.",
                        "vi": "Anh vẽ những cảnh sinh hoạt đồng quê."
                    }
                ]
            },
            {
                "define": {
                    "en": "a loud, angry argument, especially one that happens in public and is embarrassing",
                    "vi": "một cuộc tranh cãi ồn ào và tức giận, đặc biệt là một cuộc tranh cãi xảy ra ở nơi công cộng và đáng xấu hổ"
                },
                "examples": [
                    {
                        "en": "She had made a scene in the middle of the party.",
                        "vi": "Cô ấy đã thực hiện một cảnh ở giữa bữa tiệc."
                    },
                    {
                        "en": "‘Please leave,’ he said. ‘I don't want a scene.’",
                        "vi": "“Xin hãy rời khỏi đây,” anh ta nói. 'Tôi không muốn một cảnh.'"
                    }
                ]
            },
            {
                "define": {
                    "en": "in the part of a theatre, etc. that the public does not usually see",
                    "vi": "trong một phần của nhà hát, v.v. mà công chúng thường không nhìn thấy"
                },
                "examples": [
                    {
                        "en": "The students were able to go behind the scenes to see how programmes are made.",
                        "vi": "Các sinh viên có thể đến hậu trường để xem các chương trình được thực hiện như thế nào."
                    }
                ]
            },
            {
                "define": {
                    "en": "in a way that people in general are not aware of",
                    "vi": "theo cách mà mọi người nói chung không nhận thức được"
                },
                "examples": [
                    {
                        "en": "A lot of negotiating has been going on behind the scenes.",
                        "vi": "Rất nhiều cuộc đàm phán đã được diễn ra ở hậu trường."
                    },
                    {
                        "en": "behind-the-scenes work",
                        "vi": "công việc hậu trường"
                    }
                ]
            },
            {
                "define": {
                    "en": "not the type of thing that somebody likes or enjoys doing",
                    "vi": "không phải kiểu mà ai đó thích hoặc thích làm"
                },
                "examples": [
                    {
                        "en": "Hillwalking is not my scene, so I stayed at home.",
                        "vi": "Trượt đồi không phải là cảnh của tôi, vì vậy tôi đã ở nhà."
                    }
                ]
            },
            {
                "define": {
                    "en": "to create a situation in which something can easily happen or develop",
                    "vi": "để tạo ra một tình huống trong đó điều gì đó có thể dễ dàng xảy ra hoặc phát triển"
                },
                "examples": [
                    {
                        "en": "His arrival set the scene for another argument.",
                        "vi": "Sự xuất hiện của anh ta đã tạo ra bối cảnh cho một cuộc tranh cãi khác."
                    }
                ]
            },
            {
                "define": {
                    "en": "to give somebody the information and details they need in order to understand what comes next",
                    "vi": "cung cấp cho ai đó thông tin và chi tiết họ cần để hiểu điều gì xảy ra tiếp theo"
                },
                "examples": [
                    {
                        "en": "The first part of the programme was just setting the scene.",
                        "vi": "Phần đầu tiên của chương trình chỉ là dựng cảnh."
                    },
                    {
                        "en": "The scene is set in the first paragraph with an account of Sally's childhood.",
                        "vi": "Bối cảnh được đặt ở đoạn đầu tiên kể về thời thơ ấu của Sally."
                    }
                ]
            }
        ]
    },
    {
        "id": "682dfb099a3643ea84aed82ad31b3812",
        "word": "line",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/laɪn/",
            "us": "/laɪn/"
        },
        "nearby": [
            {
                "word": "Lindow Man",
                "pos": ""
            },
            {
                "word": "Lindsey",
                "pos": ""
            },
            {
                "word": "line",
                "pos": "noun"
            },
            {
                "word": "line",
                "pos": "verb"
            },
            {
                "word": "lineage",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a long, thin mark on a surface",
                    "vi": "một vết dài, mỏng trên bề mặt"
                },
                "examples": [
                    {
                        "en": "a straight/solid/dotted/dashed line",
                        "vi": "một đường thẳng / liền nét / chấm / đứt nét"
                    },
                    {
                        "en": "a wavy/diagonal line",
                        "vi": "một đường lượn sóng / đường chéo"
                    },
                    {
                        "en": "a vertical/horizontal line",
                        "vi": "một đường dọc / ngang"
                    },
                    {
                        "en": "parallel lines",
                        "vi": "những đường thẳng song song"
                    },
                    {
                        "en": "Draw a thick black line across the page.",
                        "vi": "Vẽ một đường đen dày trên trang."
                    }
                ]
            },
            {
                "define": {
                    "en": "a long, thin mark on the ground to show the limit or border of something, especially of a playing area in some sports",
                    "vi": "một dấu dài và mảnh trên mặt đất để hiển thị giới hạn hoặc đường viền của một thứ gì đó, đặc biệt là khu vực chơi trong một số môn thể thao"
                },
                "examples": [
                    {
                        "en": "The first to cross the line wins the race.",
                        "vi": "Người đầu tiên vượt qua vạch chiến thắng cuộc đua."
                    },
                    {
                        "en": "They were all waiting on the starting line.",
                        "vi": "Tất cả đều đang đợi ở vạch xuất phát."
                    },
                    {
                        "en": "She crossed the centre line and hit an oncoming truck.",
                        "vi": "Cô ấy băng qua vạch giữa và tông vào một chiếc xe tải đang chạy tới."
                    },
                    {
                        "en": "over/across the line The ball was over the line.",
                        "vi": "over / ngang đường Bóng đã qua đường biên ngang."
                    },
                    {
                        "en": "behind the line Your feet must be behind the line when you serve (= in tennis).",
                        "vi": "phía sau dây Chân của bạn phải ở phía sau vạch khi bạn giao bóng (= trong quần vợt)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a mark like a line on somebody’s skin that people usually get as they get older",
                    "vi": "một vết giống như một đường trên da của ai đó mà mọi người thường nhận được khi họ già đi"
                },
                "examples": [
                    {
                        "en": "He has fine lines around his eyes.",
                        "vi": "Anh ấy có nếp nhăn quanh mắt."
                    }
                ]
            },
            {
                "define": {
                    "en": "a row of people or things next to each other or behind each other",
                    "vi": "một hàng người hoặc vật ở cạnh nhau hoặc phía sau nhau"
                },
                "examples": [
                    {
                        "en": "They formed a line and marched forward.",
                        "vi": "Họ xếp thành một đội hình và tiến về phía trước."
                    },
                    {
                        "en": "in a line The children all stood in a line.",
                        "vi": "in a line Tất cả trẻ em đứng thành một hàng."
                    },
                    {
                        "en": "line of something They were stuck in a line of traffic.",
                        "vi": "dòng thứ gì đó Họ đã bị mắc kẹt trong một dòng xe cộ."
                    },
                    {
                        "en": "a straight/long line of trees",
                        "vi": "một hàng cây dài / thẳng"
                    }
                ]
            },
            {
                "define": {
                    "en": "a queue of people",
                    "vi": "một hàng người"
                },
                "examples": [
                    {
                        "en": "A line formed at each teller window.",
                        "vi": "Một dòng được hình thành tại mỗi cửa sổ giao dịch viên."
                    },
                    {
                        "en": "in line to stand/wait in line",
                        "vi": "xếp hàng để đứng / xếp hàng chờ"
                    },
                    {
                        "en": "If you want a ticket, get in line.",
                        "vi": "Nếu bạn muốn có vé, hãy xếp hàng."
                    },
                    {
                        "en": "line for something There's a line for the women's bathroom.",
                        "vi": "dòng cho một cái gì đó Có một dòng cho phòng tắm dành cho phụ nữ."
                    },
                    {
                        "en": "They have to stand in line for groceries.",
                        "vi": "Họ phải đứng xếp hàng mua hàng tạp hóa."
                    }
                ]
            },
            {
                "define": {
                    "en": "a phone connection; a particular phone number",
                    "vi": "kết nối điện thoại; một số điện thoại cụ thể"
                },
                "examples": [
                    {
                        "en": "The phone lines were jammed (= very busy) with people calling to complain.",
                        "vi": "Đường dây điện thoại bị kẹt (= rất bận) với những người gọi đến để phàn nàn."
                    },
                    {
                        "en": "I tried to call but the line was busy.",
                        "vi": "Tôi cố gọi nhưng đường dây bận."
                    },
                    {
                        "en": "I was talking to John when the line suddenly went dead.",
                        "vi": "Tôi đang nói chuyện với John thì đường dây đột ngột tắt."
                    },
                    {
                        "en": "Lines are open from 7.30 am until midnight seven days a week.",
                        "vi": "Đường dây mở cửa từ 7:30 sáng đến nửa đêm bảy ngày trong tuần."
                    },
                    {
                        "en": "If you hold the line (= stay on the phone and wait), I'll see if she is available.",
                        "vi": "Nếu bạn giữ máy (= ở lại điện thoại và đợi), tôi sẽ xem cô ấy có rảnh không."
                    },
                    {
                        "en": "on the line It's your mother on the line.",
                        "vi": "trên đường dây Đó là mẹ của bạn trên đường dây."
                    },
                    {
                        "en": "Your bill includes line rental.",
                        "vi": "Hóa đơn của bạn bao gồm tiền thuê đường truyền."
                    }
                ]
            },
            {
                "define": {
                    "en": "a railway track or other transport route; a section of a transport system or route",
                    "vi": "đường ray xe lửa hoặc các tuyến đường vận tải khác; một phần của hệ thống giao thông hoặc tuyến đường"
                },
                "examples": [
                    {
                        "en": "The train was delayed because a tree had fallen across the line.",
                        "vi": "Chuyến tàu bị hoãn vì một cây đổ chắn ngang đường."
                    },
                    {
                        "en": "a rail line",
                        "vi": "một tuyến đường sắt"
                    },
                    {
                        "en": "(British English also) a railway line",
                        "vi": "(Anh cũng có tiếng Anh) một tuyến đường sắt"
                    },
                    {
                        "en": "the East Coast line",
                        "vi": "đường bờ biển phía đông"
                    },
                    {
                        "en": "We got off the bus near the end of the line at San Gerardo.",
                        "vi": "Chúng tôi xuống xe buýt gần cuối hàng ở San Gerardo."
                    },
                    {
                        "en": "Streetcar lines carried passengers to ever more distant areas of the city.",
                        "vi": "Các tuyến xe điện đã đưa hành khách đến những khu vực xa xôi hơn bao giờ hết của thành phố."
                    },
                    {
                        "en": "on a line We live on the Northern Line.",
                        "vi": "trên một dòng Chúng tôi sống trên Dòng phía Bắc."
                    }
                ]
            },
            {
                "define": {
                    "en": "the direction that somebody/something is moving or located in",
                    "vi": "hướng mà ai đó / cái gì đó đang di chuyển hoặc đang ở"
                },
                "examples": [
                    {
                        "en": "in a line Just keep going in a straight line.",
                        "vi": "trên một đường thẳng Chỉ cần tiếp tục đi trên một đường thẳng."
                    },
                    {
                        "en": "The town is in a direct line between London and the coast.",
                        "vi": "Thị trấn nằm trên một đường thẳng giữa Luân Đôn và bờ biển."
                    },
                    {
                        "en": "line of something Be careful to stay out of the line of fire (= the direction somebody is shooting in).",
                        "vi": "dòng gì đó Hãy cẩn thận tránh xa vùng lửa (= hướng ai đó đang bắn vào)."
                    },
                    {
                        "en": "They followed the line of the river for three miles.",
                        "vi": "Họ đi theo dòng sông trong ba dặm."
                    }
                ]
            },
            {
                "define": {
                    "en": "a route from one place to another especially when it is used for a particular purpose",
                    "vi": "một tuyến đường từ nơi này đến nơi khác, đặc biệt là khi nó được sử dụng cho một mục đích cụ thể"
                },
                "examples": [
                    {
                        "en": "Their aim was to block guerrilla supply lines.",
                        "vi": "Mục đích của họ là chặn đường tiếp tế của quân du kích."
                    }
                ]
            },
            {
                "define": {
                    "en": "a row of words on a page or the empty space where they can be written; the words of a song or poem or other piece of writing",
                    "vi": "một hàng từ trên một trang hoặc khoảng trống nơi chúng có thể được viết; lời của một bài hát hoặc bài thơ hoặc đoạn văn khác"
                },
                "examples": [
                    {
                        "en": "Look at line 5 of the text.",
                        "vi": "Nhìn vào dòng 5 của văn bản."
                    },
                    {
                        "en": "Write the title of your essay on the top line.",
                        "vi": "Viết tiêu đề bài luận của bạn ở dòng trên cùng."
                    },
                    {
                        "en": "I can only remember the first two lines of that song.",
                        "vi": "Tôi chỉ có thể nhớ hai dòng đầu tiên của bài hát đó."
                    },
                    {
                        "en": "She quoted a few lines of Shakespeare.",
                        "vi": "Cô ấy đã trích dẫn một vài dòng của Shakespeare."
                    },
                    {
                        "en": "A team of programmers wrote 200 000 lines of code (= computer programming language).",
                        "vi": "Một nhóm lập trình viên đã viết 200 000 dòng mã (= ngôn ngữ lập trình máy tính)."
                    },
                    {
                        "en": "Avoid a line break (= starting a new line) in the middle of a word.",
                        "vi": "Tránh ngắt dòng (= bắt đầu một dòng mới) ở giữa một từ."
                    }
                ]
            },
            {
                "define": {
                    "en": "the words spoken by an actor in a play or film",
                    "vi": "những lời diễn viên nói trong một vở kịch hoặc một bộ phim"
                },
                "examples": [
                    {
                        "en": "to learn your lines",
                        "vi": "để học lời thoại của bạn"
                    },
                    {
                        "en": "I keep forgetting my lines.",
                        "vi": "Tôi tiếp tục quên lời thoại của mình."
                    },
                    {
                        "en": "The way she delivers the line is hilarious.",
                        "vi": "Cách cô ấy giao hàng thật vui nhộn."
                    },
                    {
                        "en": "line from something He quoted a line from the film ‘Casablanca’.",
                        "vi": "dòng từ cái gì đó Anh ấy đã trích dẫn một dòng trong bộ phim 'Casablanca'."
                    }
                ]
            },
            {
                "define": {
                    "en": "a punishment in which a child has to write out a particular sentence a number of times",
                    "vi": "một hình phạt trong đó một đứa trẻ phải viết ra một câu cụ thể nhiều lần"
                },
                "examples": [
                    {
                        "en": "The teacher gave me 100 lines.",
                        "vi": "Cô giáo cho tôi 100 dòng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a remark, especially when somebody says it to achieve a particular purpose",
                    "vi": "một nhận xét, đặc biệt là khi ai đó nói rằng nó để đạt được một mục đích cụ thể"
                },
                "examples": [
                    {
                        "en": "Don't give me that line about having to work late again.",
                        "vi": "Đừng đưa cho tôi dòng đó về việc phải làm việc muộn một lần nữa."
                    },
                    {
                        "en": "(British English) That's the worst chat-up line I've ever heard.",
                        "vi": "(Anh Anh) Đó là dòng trò chuyện tồi tệ nhất mà tôi từng nghe."
                    }
                ]
            },
            {
                "define": {
                    "en": "a long piece of rope, string, etc., especially when it is used for a particular purpose",
                    "vi": "một đoạn dây dài, dây, v.v., đặc biệt khi nó được sử dụng cho một mục đích cụ thể"
                },
                "examples": [
                    {
                        "en": "They dropped the sails and threw a line to a man on the dock.",
                        "vi": "Họ thả buồm xuống và ném dây chuyền cho một người đàn ông trên bến tàu."
                    },
                    {
                        "en": "on the line Towels were hanging on the line (= clothes line).",
                        "vi": "on the line Khăn được treo trên dây (= dây phơi quần áo)."
                    },
                    {
                        "en": "He had a fish on his line.",
                        "vi": "Anh ta có một con cá trên dây của mình."
                    },
                    {
                        "en": "150 feet of nylon line",
                        "vi": "150 feet dây nylon"
                    }
                ]
            },
            {
                "define": {
                    "en": "a pipe or thick wire that carries water, gas or electricity from one place to another",
                    "vi": "một đường ống hoặc dây dày dẫn nước, khí đốt hoặc điện từ nơi này đến nơi khác"
                },
                "examples": [
                    {
                        "en": "water/gas/sewage lines",
                        "vi": "đường nước / khí đốt / nước thải"
                    },
                    {
                        "en": "Telephone lines were brought down in the storm.",
                        "vi": "Đường dây điện thoại bị đứt trong cơn bão."
                    },
                    {
                        "en": "There were two fuel lines coming into the engine.",
                        "vi": "Có hai đường nhiên liệu đi vào động cơ."
                    },
                    {
                        "en": "The telegraph lines connecting the two cities had been cut.",
                        "vi": "Các đường dây điện báo nối hai thành phố đã bị cắt."
                    }
                ]
            },
            {
                "define": {
                    "en": "an imaginary limit or border between one place or thing and another",
                    "vi": "một giới hạn tưởng tượng hoặc biên giới giữa địa điểm hoặc sự vật này với nơi khác"
                },
                "examples": [
                    {
                        "en": "a district/county line",
                        "vi": "một tuyến quận / huyện"
                    },
                    {
                        "en": "lines of longitude and latitude",
                        "vi": "đường kinh độ và vĩ độ"
                    },
                    {
                        "en": "across a line He was convicted of illegally importing weapons across state lines.",
                        "vi": "qua đường dây Anh ta bị kết tội nhập khẩu trái phép vũ khí qua các đường dây của bang."
                    }
                ]
            },
            {
                "define": {
                    "en": "the division between one area of thought or behaviour and another or between one group of people and another",
                    "vi": "sự phân chia giữa lĩnh vực suy nghĩ hoặc hành vi này với lĩnh vực khác hoặc giữa nhóm người này với nhóm người khác"
                },
                "examples": [
                    {
                        "en": "Mass consumption blurred the lines of class distinction.",
                        "vi": "Tiêu dùng hàng loạt đã làm mờ ranh giới của sự phân biệt giai cấp."
                    },
                    {
                        "en": "We want to cut across lines of race, sex and religion.",
                        "vi": "Chúng tôi muốn vượt qua ranh giới chủng tộc, giới tính và tôn giáo."
                    },
                    {
                        "en": "Music offers a way to cross cultural lines.",
                        "vi": "Âm nhạc cung cấp một cách để vượt qua các dòng văn hóa."
                    },
                    {
                        "en": "line between A and B There is a fine line between informing the public and alarming them.",
                        "vi": "ranh giới giữa A và B Có một ranh giới nhỏ giữa việc thông báo cho công chúng và báo động cho họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "an attitude or a belief, especially one that somebody states publicly",
                    "vi": "một thái độ hoặc một niềm tin, đặc biệt là một thái độ mà ai đó tuyên bố công khai"
                },
                "examples": [
                    {
                        "en": "The company line is that discrimination in any form is not tolerated.",
                        "vi": "Đường lối của công ty là không dung thứ cho sự phân biệt đối xử dưới mọi hình thức."
                    },
                    {
                        "en": "line on something He supported the official line on education.",
                        "vi": "dòng về điều gì đó Anh ấy ủng hộ dòng chính thức về giáo dục."
                    },
                    {
                        "en": "The government is taking a firm line on terrorism.",
                        "vi": "Chính phủ đang có quan điểm kiên quyết đối với chủ nghĩa khủng bố."
                    }
                ]
            },
            {
                "define": {
                    "en": "a method or way of doing or thinking about something",
                    "vi": "một phương pháp hoặc cách làm hoặc suy nghĩ về điều gì đó"
                },
                "examples": [
                    {
                        "en": "His research follows quite different lines.",
                        "vi": "Nghiên cứu của ông đi theo các dòng khá khác nhau."
                    },
                    {
                        "en": "line of something I don't follow your line of reasoning.",
                        "vi": "dòng gì đó tôi không theo dòng lý luận của bạn."
                    },
                    {
                        "en": "a line of thought/thinking",
                        "vi": "một dòng suy nghĩ / suy nghĩ"
                    },
                    {
                        "en": "She decided to try a different line of argument (= way of persuading somebody of something).",
                        "vi": "Cô ấy quyết định thử một cách lập luận khác (= cách thuyết phục ai đó về điều gì đó)."
                    },
                    {
                        "en": "somebody’s first line of attack/defence",
                        "vi": "tuyến tấn công / phòng thủ đầu tiên của ai đó"
                    },
                    {
                        "en": "The police are pursuing a new line of inquiry (= way of finding out information).",
                        "vi": "Cảnh sát đang theo đuổi một đường điều tra mới (= cách tìm hiểu thông tin)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a series of people, things or events that follow one another in time",
                    "vi": "một loạt người, sự vật hoặc sự kiện nối tiếp nhau trong thời gian"
                },
                "examples": [
                    {
                        "en": "to pass something down through the male/female line",
                        "vi": "để chuyển một cái gì đó xuống qua ranh giới nam / nữ"
                    },
                    {
                        "en": "line of something She came from a long line of doctors.",
                        "vi": "dòng thứ gì đó Cô ấy đến từ một hàng dài bác sĩ."
                    },
                    {
                        "en": "This novel is the latest in a long line of thrillers that he has written.",
                        "vi": "Cuốn tiểu thuyết này là cuốn tiểu thuyết mới nhất trong một bộ dài tập kinh dị mà ông đã viết."
                    },
                    {
                        "en": "That was the first in a whole line of mistakes and bad decisions.",
                        "vi": "Đó là lần đầu tiên trong toàn bộ hàng loạt sai lầm và quyết định tồi tệ."
                    },
                    {
                        "en": "line (from somebody/something) (to somebody/something) The book traces a historical line from Beethoven to the present day.",
                        "vi": "dòng (from somebody / something) (to somebody / something) Cuốn sách vạch một dòng lịch sử từ Beethoven cho đến ngày nay."
                    },
                    {
                        "en": "down the line The muddle seems to have happened further down the line.",
                        "vi": "xuống dòng Sự lộn xộn dường như đã xảy ra ở phía dưới dòng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a series of people in order of importance",
                    "vi": "một loạt người theo thứ tự quan trọng"
                },
                "examples": [
                    {
                        "en": "line of something a line of command",
                        "vi": "dòng gì đó một dòng lệnh"
                    },
                    {
                        "en": "There is some benefit to having a clear line of authority.",
                        "vi": "Có một số lợi ích khi có một đường quyền rõ ràng."
                    },
                    {
                        "en": "down the line (from somebody/something) Orders came down the line from the very top.",
                        "vi": "xuống dòng (từ ai đó / cái gì đó) Các đơn đặt hàng xuống dòng từ trên cùng."
                    },
                    {
                        "en": "in line (to somebody/something) He is second in line to the chairman.",
                        "vi": "trong hàng (với ai đó / cái gì đó) Anh ấy đứng hàng thứ hai sau chủ tịch."
                    },
                    {
                        "en": "to be next in line to the throne",
                        "vi": "xếp hàng tiếp theo để lên ngôi"
                    }
                ]
            },
            {
                "define": {
                    "en": "the edge, outline or shape of somebody/something",
                    "vi": "góc cạnh, đường viền hoặc hình dạng của ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "He traced the line of her jaw with his finger.",
                        "vi": "Anh dùng ngón tay lần theo đường viền hàm của cô."
                    },
                    {
                        "en": "a beautiful sports car with sleek lines",
                        "vi": "một chiếc xe thể thao đẹp với những đường nét bóng bẩy"
                    },
                    {
                        "en": "I prefer simple lines in skirts and trousers.",
                        "vi": "Tôi thích những đường đơn giản trong váy và quần."
                    }
                ]
            },
            {
                "define": {
                    "en": "a system of making something, in which the product moves from one worker to the next until it is finished",
                    "vi": "một hệ thống chế tạo thứ gì đó, trong đó sản phẩm chuyển từ công nhân này sang công nhân khác cho đến khi hoàn thành"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a type or area of business, activity or interest",
                    "vi": "một loại hoặc lĩnh vực kinh doanh, hoạt động hoặc sở thích"
                },
                "examples": [
                    {
                        "en": "line of something My line of work pays pretty well.",
                        "vi": "dòng thứ gì đó Dòng công việc của tôi trả lương khá cao."
                    },
                    {
                        "en": "What line of business are they in?",
                        "vi": "Ngành nghề kinh doanh của họ là gì?"
                    },
                    {
                        "en": "in the… line You can't do much in the art line without training.",
                        "vi": "trong dòng… Bạn không thể làm gì nhiều trong lĩnh vực nghệ thuật nếu không được đào tạo."
                    }
                ]
            },
            {
                "define": {
                    "en": "a type of product",
                    "vi": "một loại sản phẩm"
                },
                "examples": [
                    {
                        "en": "Some lines sell better than others.",
                        "vi": "Một số dòng bán chạy hơn những dòng khác."
                    },
                    {
                        "en": "new product lines",
                        "vi": "dòng sản phẩm mới"
                    },
                    {
                        "en": "line in something We are starting a new line in casual clothes.",
                        "vi": "hàng trong một cái gì đó Chúng tôi đang bắt đầu một dòng mới trong quần áo bình thường."
                    }
                ]
            },
            {
                "define": {
                    "en": "a company that provides transport for people or goods",
                    "vi": "một công ty cung cấp dịch vụ vận chuyển cho người hoặc hàng hóa"
                },
                "examples": [
                    {
                        "en": "a shipping/bus line",
                        "vi": "một tuyến vận chuyển / xe buýt"
                    },
                    {
                        "en": "the White Star Line",
                        "vi": "đường ngôi sao trắng"
                    }
                ]
            },
            {
                "define": {
                    "en": "a row or series of military defences where the soldiers are fighting during a war",
                    "vi": "một hàng hoặc một loạt các tuyến phòng thủ quân sự nơi những người lính đang chiến đấu trong chiến tranh"
                },
                "examples": [
                    {
                        "en": "They were trapped behind enemy lines (= in the area controlled by the enemy).",
                        "vi": "Họ bị mắc kẹt sau phòng tuyến của kẻ thù (= trong khu vực do kẻ thù kiểm soát)."
                    }
                ]
            },
            {
                "define": {
                    "en": "an amount of cocaine that is spread out in a thin line, ready to take",
                    "vi": "một lượng cocaine được dàn thành một đường mỏng, sẵn sàng để lấy"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "connected with the income that a company receives and the costs it has to pay in its daily business, which affect the profit it makes",
                    "vi": "liên quan đến thu nhập mà một công ty nhận được và chi phí mà công ty phải trả trong hoạt động kinh doanh hàng ngày của mình, điều này ảnh hưởng đến lợi nhuận mà công ty tạo ra"
                },
                "examples": [
                    {
                        "en": "All these costs are above the line and directly hit profits.",
                        "vi": "Tất cả những chi phí này đều vượt quá giới hạn và đánh trực tiếp vào lợi nhuận."
                    }
                ]
            },
            {
                "define": {
                    "en": "connected with advertising in the mass media",
                    "vi": "kết nối với quảng cáo trên các phương tiện thông tin đại chúng"
                },
                "examples": [
                    {
                        "en": "They planned an advertising campaign with both above-the-line and social media components.",
                        "vi": "Họ đã lên kế hoạch cho một chiến dịch quảng cáo với cả các thành phần trên mạng và mạng xã hội."
                    }
                ]
            },
            {
                "define": {
                    "en": "at some point during an activity or a process",
                    "vi": "tại một số thời điểm trong một hoạt động hoặc một quá trình"
                },
                "examples": [
                    {
                        "en": "Somewhere along the line a large amount of money went missing.",
                        "vi": "Ở đâu đó dọc theo đường dây, một số tiền lớn đã bị mất tích."
                    },
                    {
                        "en": "We'll make a decision on that further down the line.",
                        "vi": "Chúng tôi sẽ đưa ra quyết định về vấn đề đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "in the way that is mentioned",
                    "vi": "theo cách được đề cập"
                },
                "examples": [
                    {
                        "en": "The new system will operate along the same lines as the old one.",
                        "vi": "Hệ thống mới sẽ hoạt động cùng dòng với hệ thống cũ."
                    },
                    {
                        "en": "They voted along class lines.",
                        "vi": "Họ đã bỏ phiếu dọc theo các hàng trong lớp."
                    }
                ]
            },
            {
                "define": {
                    "en": "similar to the way or thing that is mentioned",
                    "vi": "tương tự như cách hoặc điều được đề cập"
                },
                "examples": [
                    {
                        "en": "Those aren't his exact words, but he said something along those lines.",
                        "vi": "Đó không phải là những lời chính xác của anh ấy, nhưng anh ấy đã nói điều gì đó dọc theo những dòng đó."
                    },
                    {
                        "en": "The hotel was built along the lines of a French chateau.",
                        "vi": "Khách sạn được xây dựng dọc theo các đường nét của một lâu đài Pháp."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that people or groups have shown which side they intend to support in an argument or contest that is going to begin",
                    "vi": "được sử dụng để nói rằng mọi người hoặc nhóm đã chỉ ra rằng họ dự định ủng hộ phe nào trong một cuộc tranh cãi hoặc cuộc cạnh tranh sắp bắt đầu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be working or functioning",
                    "vi": "đang làm việc hoặc hoạt động"
                },
                "examples": [
                    {
                        "en": "The new working methods will come on line in June.",
                        "vi": "Các phương pháp làm việc mới sẽ được áp dụng vào tháng 6."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be in a position where you can be shot at",
                    "vi": "ở một vị trí mà bạn có thể bị bắn vào"
                },
                "examples": [
                    {
                        "en": "attempts to prevent civilians from being in the firing line",
                        "vi": "nỗ lực ngăn cản dân thường ở trong tầm bắn"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be in a position where people can criticize or blame you",
                    "vi": "ở vị trí mà mọi người có thể chỉ trích hoặc đổ lỗi cho bạn"
                },
                "examples": [
                    {
                        "en": "The employment secretary found himself in the firing line over recent job cuts.",
                        "vi": "Thư ký việc làm nhận thấy mình đang trong tình trạng sa thải vì những đợt cắt giảm việc làm gần đây."
                    }
                ]
            },
            {
                "define": {
                    "en": "connected with unusual costs or income that a company pays or receives, that are not part of its daily business and are taken away or added after calculating profits",
                    "vi": "liên quan đến chi phí hoặc thu nhập bất thường mà một công ty trả hoặc nhận, không phải là một phần hoạt động kinh doanh hàng ngày của công ty và được lấy đi hoặc thêm vào sau khi tính toán lợi nhuận"
                },
                "examples": [
                    {
                        "en": "There was a £4 million extraordinary charge below the line.",
                        "vi": "Có một khoản phí bất thường trị giá 4 triệu bảng Anh bên dưới dòng."
                    }
                ]
            },
            {
                "define": {
                    "en": "connected with advertising by means of direct mail, email, social media, events, etc.",
                    "vi": "được kết nối với quảng cáo bằng thư trực tiếp, email, phương tiện truyền thông xã hội, sự kiện, v.v."
                },
                "examples": [
                    {
                        "en": "We are planning social networking, digital marketing and below-the-line activities across the country.",
                        "vi": "Chúng tôi đang lên kế hoạch cho mạng xã hội, tiếp thị kỹ thuật số và các hoạt động dưới dây trên toàn quốc."
                    }
                ]
            },
            {
                "define": {
                    "en": "connected with a section at the end of an online article or blog post where readers can put comments",
                    "vi": "được kết nối với một phần ở cuối bài viết trực tuyến hoặc bài đăng trên blog, nơi người đọc có thể đưa ra nhận xét"
                },
                "examples": [
                    {
                        "en": "There were numerous comments below the line.",
                        "vi": "Có rất nhiều bình luận bên dưới dòng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to behave or make somebody/something behave in the same way as other people or how they should behave",
                    "vi": "để cư xử hoặc làm cho ai đó / cái gì đó cư xử theo cách giống như những người khác hoặc cách họ nên cư xử"
                },
                "examples": [
                    {
                        "en": "The other members of the board must be brought into line.",
                        "vi": "Các thành viên khác của hội đồng quản trị phải được đưa vào hàng."
                    },
                    {
                        "en": "The actions of investors do not always fall into line with financial theory.",
                        "vi": "Các hành động của các nhà đầu tư không phải lúc nào cũng phù hợp với lý thuyết tài chính."
                    }
                ]
            },
            {
                "define": {
                    "en": "to do something that is not considered to be acceptable behaviour",
                    "vi": "làm điều gì đó không được coi là hành vi có thể chấp nhận được"
                },
                "examples": [
                    {
                        "en": "He crossed the line by making details of their very private conversation public.",
                        "vi": "Anh ta vượt qua ranh giới bằng cách công khai chi tiết cuộc trò chuyện rất riêng tư của họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to go to the front of a line of people without waiting for your turn",
                    "vi": "đi đến trước một dòng người mà không cần đợi đến lượt của bạn"
                },
                "examples": [
                    {
                        "en": "Somebody cut in line in front of me.",
                        "vi": "Ai đó đã xếp hàng trước mặt tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to say that something is finished and not worth discussing any more",
                    "vi": "để nói rằng một cái gì đó đã kết thúc và không đáng thảo luận nữa"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "(to reach) the point at which something can no longer continue in the same way",
                    "vi": "(đạt đến) điểm mà tại đó điều gì đó không còn có thể tiếp tục theo cách cũ"
                },
                "examples": [
                    {
                        "en": "A defeat in the second round marked the end of the line for last year's champion.",
                        "vi": "Một thất bại ở vòng thứ hai đánh dấu dấu chấm hết cho nhà vô địch năm ngoái."
                    },
                    {
                        "en": "The loss of this contract could signal the end of the line for the shipyard.",
                        "vi": "Việc mất hợp đồng này có thể báo hiệu sự kết thúc của dây chuyền cho nhà máy đóng tàu."
                    },
                    {
                        "en": "This latest disagreement could mean the end of the road for the band.",
                        "vi": "Sự bất đồng mới nhất này có thể có nghĩa là con đường kết thúc của ban nhạc."
                    }
                ]
            },
            {
                "define": {
                    "en": "strong control or discipline",
                    "vi": "kiểm soát hoặc kỷ luật mạnh mẽ"
                },
                "examples": [
                    {
                        "en": "Those children need a firm hand to make them behave.",
                        "vi": "Những đứa trẻ đó cần một bàn tay cứng rắn để bắt chúng cư xử."
                    }
                ]
            },
            {
                "define": {
                    "en": "completely",
                    "vi": "hoàn toàn"
                },
                "examples": [
                    {
                        "en": "What I said was not true, but he fell for it (= believed it) hook, line and sinker.",
                        "vi": "Những gì tôi nói là không đúng, nhưng anh ấy đã mắc phải (= tin vào điều đó) cái móc, đường dây và kẻ đánh chìm."
                    }
                ]
            },
            {
                "define": {
                    "en": "in a position that forms a straight line with something",
                    "vi": "ở một vị trí tạo thành một đường thẳng với một cái gì đó"
                },
                "examples": [
                    {
                        "en": "An eclipse happens when the earth and moon are in line with the sun.",
                        "vi": "Nhật thực xảy ra khi trái đất và mặt trăng nằm thẳng hàng với mặt trời."
                    }
                ]
            },
            {
                "define": {
                    "en": "likely to get something",
                    "vi": "có khả năng nhận được một cái gì đó"
                },
                "examples": [
                    {
                        "en": "She is in line for promotion.",
                        "vi": "Cô ấy đang trong hàng để thăng chức."
                    }
                ]
            },
            {
                "define": {
                    "en": "while doing a job",
                    "vi": "trong khi làm một công việc"
                },
                "examples": [
                    {
                        "en": "A policeman was injured in the line of duty yesterday.",
                        "vi": "Một cảnh sát đã bị thương trong khi làm nhiệm vụ ngày hôm qua."
                    }
                ]
            },
            {
                "define": {
                    "en": "similar to something or so that one thing is closely connected with another",
                    "vi": "tương tự như một cái gì đó hoặc sao cho cái này được kết nối chặt chẽ với cái khác"
                },
                "examples": [
                    {
                        "en": "Annual pay increases will be in line with inflation.",
                        "vi": "Tăng lương hàng năm sẽ phù hợp với lạm phát."
                    }
                ]
            },
            {
                "define": {
                    "en": "to tell somebody clearly what you think, especially when they will not like what you say",
                    "vi": "để nói với ai đó rõ ràng những gì bạn nghĩ, đặc biệt là khi họ sẽ không thích những gì bạn nói"
                },
                "examples": [
                    {
                        "en": "The manager laid it on the line—some people would have to lose their jobs.",
                        "vi": "Người quản lý đã đặt nó vào tình trạng khó khăn - một số người sẽ phải mất việc."
                    }
                ]
            },
            {
                "define": {
                    "en": "(to establish) a clear limit to what you will do or accept",
                    "vi": "(để thiết lập) một giới hạn rõ ràng cho những gì bạn sẽ làm hoặc chấp nhận"
                },
                "examples": [
                    {
                        "en": "It’s time to draw a line in the sand and stop allowing workplace bullying to continue.",
                        "vi": "Đã đến lúc vẽ một ranh giới trên cát và ngừng cho phép tiếp tục bắt nạt nơi làm việc."
                    }
                ]
            },
            {
                "define": {
                    "en": "(to choose, etc.) the easiest way of doing something",
                    "vi": "(để lựa chọn, v.v.) cách dễ nhất để làm điều gì đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "at risk",
                    "vi": "gặp rủi ro"
                },
                "examples": [
                    {
                        "en": "If we don't make a profit, my job is on the line.",
                        "vi": "Nếu chúng tôi không tạo ra lợi nhuận, công việc của tôi là trên đường dây."
                    }
                ]
            },
            {
                "define": {
                    "en": "not forming a straight line",
                    "vi": "không tạo thành một đường thẳng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "different from something",
                    "vi": "khác với một cái gì đó"
                },
                "examples": [
                    {
                        "en": "London prices are way out of line with the rest of the country.",
                        "vi": "Giá London đang chênh lệch với phần còn lại của đất nước."
                    }
                ]
            },
            {
                "define": {
                    "en": "behaving in a way that is not acceptable or right",
                    "vi": "hành xử theo cách không thể chấp nhận được hoặc đúng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to behave in a way that people think is not acceptable",
                    "vi": "cư xử theo cách mà mọi người nghĩ là không thể chấp nhận được"
                },
                "examples": [
                    {
                        "en": "She realized she had overstepped the mark and quickly apologized.",
                        "vi": "Cô nhận ra mình đã vượt quá mức cho phép và nhanh chóng xin lỗi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to tell somebody a story or make an excuse that is not true",
                    "vi": "kể cho ai đó một câu chuyện hoặc viện cớ không đúng sự thật"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to look for or discover a meaning in something that is not openly stated",
                    "vi": "để tìm kiếm hoặc khám phá ý nghĩa của điều gì đó không được công khai"
                },
                "examples": [
                    {
                        "en": "Reading between the lines, I think Clare needs money.",
                        "vi": "Đọc giữa dòng, tôi nghĩ Clare cần tiền."
                    }
                ]
            },
            {
                "define": {
                    "en": "to sign a document to show that you have agreed to buy something or do something",
                    "vi": "ký một tài liệu để chứng tỏ rằng bạn đã đồng ý mua một cái gì đó hoặc làm một cái gì đó"
                },
                "examples": [
                    {
                        "en": "Just sign on the dotted line and the car is yours.",
                        "vi": "Chỉ cần ký vào đường chấm và chiếc xe là của bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to behave badly or break the rules",
                    "vi": "cư xử tồi tệ hoặc vi phạm các quy tắc"
                },
                "examples": [
                    {
                        "en": "His boss warned him that if he stepped out of line once more he would be fired.",
                        "vi": "Sếp của anh ta đã cảnh báo anh ta rằng nếu anh ta bước ra khỏi giới hạn một lần nữa, anh ta sẽ bị sa thải."
                    }
                ]
            },
            {
                "define": {
                    "en": "to say or do what somebody in authority tells you to say or do, even if you do not share the same opinions, etc.",
                    "vi": "để nói hoặc làm những gì ai đó có thẩm quyền yêu cầu bạn nói hoặc làm, ngay cả khi bạn không có cùng quan điểm, v.v."
                },
                "examples": [
                    {
                        "en": "One or two of them refused to toe the line.",
                        "vi": "Một hoặc hai người trong số họ từ chối dây."
                    },
                    {
                        "en": "MPs rarely fail to toe the party line.",
                        "vi": "Các nghị sĩ hiếm khi không tuân theo đường lối của đảng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be in a difficult or dangerous situation where you could easily make a mistake",
                    "vi": "ở trong một tình huống khó khăn hoặc nguy hiểm mà bạn có thể dễ dàng mắc sai lầm"
                },
                "examples": [
                    {
                        "en": "He was walking a fine line between being funny and being rude.",
                        "vi": "Anh ấy đang đi đúng ranh giới giữa hài hước và thô lỗ."
                    },
                    {
                        "en": "She often seems to tread a thin line between success and failure.",
                        "vi": "Cô ấy dường như luôn vạch ra một ranh giới mỏng manh giữa thành công và thất bại."
                    }
                ]
            }
        ]
    },
    {
        "id": "b62f1452b3b04552ac39efbc953ccf82",
        "word": "part",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/pɑːt/",
            "us": "/pɑːrt/"
        },
        "nearby": [
            {
                "word": "Louella Parsons",
                "pos": ""
            },
            {
                "word": "parson's nose",
                "pos": "noun"
            },
            {
                "word": "part",
                "pos": "noun"
            },
            {
                "word": "part",
                "pos": "verb"
            },
            {
                "word": "part",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "some but not all of a thing",
                    "vi": "một số nhưng không phải tất cả"
                },
                "examples": [
                    {
                        "en": "We spent part of the time in the museum.",
                        "vi": "Chúng tôi đã dành một phần thời gian trong bảo tàng."
                    },
                    {
                        "en": "Part of the building was destroyed in the fire.",
                        "vi": "Một phần của tòa nhà đã bị phá hủy trong đám cháy."
                    },
                    {
                        "en": "Part of the problem is that more and more people live alone.",
                        "vi": "Một phần của vấn đề là ngày càng có nhiều người sống một mình."
                    },
                    {
                        "en": "Voters are given only part of the story (= only some of the information).",
                        "vi": "Người bình chọn chỉ được cung cấp một phần của câu chuyện (= chỉ một số thông tin)."
                    },
                    {
                        "en": "Part of me feels sorry for him (= I feel a little sorry for him, but not very sorry).",
                        "vi": "Một phần trong tôi cảm thấy có lỗi với anh ấy (= Tôi cảm thấy hơi tiếc cho anh ấy, nhưng không phải là rất tiếc)."
                    },
                    {
                        "en": "We spent a good part of the day rehearsing.",
                        "vi": "Chúng tôi đã dành một phần tốt trong ngày để tập luyện."
                    }
                ]
            },
            {
                "define": {
                    "en": "a section, piece or feature of something",
                    "vi": "một phần, mảnh hoặc tính năng của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "part of something The mountains are covered with snow for a large part of the year.",
                        "vi": "một phần của cái gì đó Những ngọn núi được bao phủ bởi tuyết trong một phần lớn thời gian trong năm."
                    },
                    {
                        "en": "The early part of her life was spent in Paris.",
                        "vi": "Thời gian đầu của cuộc đời cô ấy đã sống ở Paris."
                    },
                    {
                        "en": "the latter part of the 19th century",
                        "vi": "phần sau của thế kỷ 19"
                    },
                    {
                        "en": "Making mistakes is an integral part of the learning process.",
                        "vi": "Sai lầm là một phần không thể thiếu trong quá trình học tập."
                    },
                    {
                        "en": "We've done the difficult part of the job.",
                        "vi": "Chúng tôi đã hoàn thành phần khó của công việc."
                    },
                    {
                        "en": "an important/essential part of the project",
                        "vi": "một phần quan trọng / thiết yếu của dự án"
                    },
                    {
                        "en": "Wool production was a key part of the economy.",
                        "vi": "Sản xuất len là một phần quan trọng của nền kinh tế."
                    },
                    {
                        "en": "in parts The novel is good in parts.",
                        "vi": "theo từng phần Cuốn tiểu thuyết hay ở từng phần."
                    },
                    {
                        "en": "The procedure can be divided into two parts.",
                        "vi": "Thủ tục có thể được chia thành hai phần."
                    },
                    {
                        "en": "The worst part was having to wait three hours in the rain.",
                        "vi": "Phần tồi tệ nhất là phải đợi ba giờ dưới mưa."
                    }
                ]
            },
            {
                "define": {
                    "en": "an element or member of something; a person or thing that helps to make up a whole or belongs in it",
                    "vi": "một phần tử hoặc thành viên của một cái gì đó; một người hoặc vật giúp tạo nên tổng thể hoặc thuộc về nó"
                },
                "examples": [
                    {
                        "en": "Snacks can be part of a healthy eating plan.",
                        "vi": "Đồ ăn nhẹ có thể là một phần của kế hoạch ăn uống lành mạnh."
                    },
                    {
                        "en": "You need to be able to work as part of a team.",
                        "vi": "Bạn cần có khả năng làm việc như một phần của nhóm."
                    },
                    {
                        "en": "Under the Saxons, Westmorland formed part of the Kingdom of Northumberland.",
                        "vi": "Dưới thời người Saxon, Westmorland hình thành một phần của Vương quốc Northumberland."
                    },
                    {
                        "en": "Antibiotics have become part of our daily existence.",
                        "vi": "Thuốc kháng sinh đã trở thành một phần trong cuộc sống hàng ngày của chúng ta."
                    }
                ]
            },
            {
                "define": {
                    "en": "a separate piece or area of a human or animal body or of a plant",
                    "vi": "một mảnh hoặc khu vực riêng biệt của cơ thể người hoặc động vật hoặc thực vật"
                },
                "examples": [
                    {
                        "en": "The cancer could spread to other parts of the body.",
                        "vi": "Ung thư có thể di căn sang các bộ phận khác của cơ thể."
                    },
                    {
                        "en": "It may one day be possible to grow new body parts in the laboratory.",
                        "vi": "Có thể một ngày nào đó người ta có thể phát triển các bộ phận cơ thể mới trong phòng thí nghiệm."
                    },
                    {
                        "en": "Different insects feed on different parts of the plant.",
                        "vi": "Các loài côn trùng khác nhau ăn các bộ phận khác nhau của cây."
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of a machine or structure",
                    "vi": "một bộ phận của máy móc hoặc cấu trúc"
                },
                "examples": [
                    {
                        "en": "The factory manufactures aircraft parts.",
                        "vi": "Nhà máy sản xuất các bộ phận máy bay."
                    },
                    {
                        "en": "car/machine/engine parts",
                        "vi": "phụ tùng ô tô / máy móc / động cơ"
                    },
                    {
                        "en": "the working parts of the machinery",
                        "vi": "các bộ phận làm việc của máy móc"
                    },
                    {
                        "en": "Where can I get spare parts for my bike?",
                        "vi": "Tôi có thể mua phụ tùng thay thế cho xe đạp của mình ở đâu?"
                    }
                ]
            },
            {
                "define": {
                    "en": "an area or a region of the world, a country, a town, etc.",
                    "vi": "một khu vực hoặc một khu vực trên thế giới, một quốc gia, một thị trấn, v.v."
                },
                "examples": [
                    {
                        "en": "The island is mostly flat, but there are some hilly parts.",
                        "vi": "Hòn đảo chủ yếu bằng phẳng, nhưng có một số phần đồi núi."
                    },
                    {
                        "en": "part of something the northern part of town",
                        "vi": "một phần của cái gì đó phía bắc của thị trấn"
                    },
                    {
                        "en": "different parts of the world/country",
                        "vi": "các khu vực khác nhau trên thế giới / quốc gia"
                    },
                    {
                        "en": "Which part of Japan do you come from?",
                        "vi": "Bạn đến từ vùng nào của Nhật Bản?"
                    },
                    {
                        "en": "Come and visit us if you're ever in our part of the world.",
                        "vi": "Hãy đến và thăm chúng tôi nếu bạn đã từng ở trong thế giới của chúng tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a region or an area",
                    "vi": "một khu vực hoặc một khu vực"
                },
                "examples": [
                    {
                        "en": "She's not from these parts.",
                        "vi": "Cô ấy không đến từ những bộ phận này."
                    },
                    {
                        "en": "He's just arrived back from foreign parts.",
                        "vi": "Anh ấy vừa từ nước ngoài trở về."
                    }
                ]
            },
            {
                "define": {
                    "en": "a section of a book, television series, etc., especially one that is published or broadcast separately",
                    "vi": "một phần của sách, phim truyền hình, v.v., đặc biệt là phần được xuất bản hoặc phát sóng riêng lẻ"
                },
                "examples": [
                    {
                        "en": "The documentary was screened in four parts.",
                        "vi": "Bộ phim tài liệu đã được trình chiếu thành bốn phần."
                    },
                    {
                        "en": "Henry IV, Part II",
                        "vi": "Henry IV, Phần II"
                    },
                    {
                        "en": "The final part will be shown next Sunday evening.",
                        "vi": "Phần cuối cùng sẽ được trình chiếu vào tối chủ nhật tuần sau."
                    }
                ]
            },
            {
                "define": {
                    "en": "a role played by an actor in a play, film, etc.; the words spoken by an actor in a particular role",
                    "vi": "một vai diễn của một diễn viên trong một vở kịch, một bộ phim, v.v.; lời nói của một diễn viên trong một vai trò cụ thể"
                },
                "examples": [
                    {
                        "en": "She played the part of Juliet.",
                        "vi": "Cô ấy đã đóng vai Juliet."
                    },
                    {
                        "en": "(figurative) He's always playing a part (= pretending to be something that he is not).",
                        "vi": "(nghĩa bóng) Anh ấy luôn đóng một vai (= giả vờ như một cái gì đó không phải là anh ấy)."
                    },
                    {
                        "en": "Have you learned your part yet?",
                        "vi": "Bạn đã học được phần của mình chưa?"
                    },
                    {
                        "en": "part in something He got a small part in a West End play.",
                        "vi": "tham gia một phần nào đó Anh ấy đã tham gia một vai nhỏ trong một vở kịch ở West End."
                    },
                    {
                        "en": "in a part She was very good in the part.",
                        "vi": "ở một phần nào đó Cô ấy đã rất giỏi trong phần đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "the way in which somebody/something is involved in an action or situation",
                    "vi": "cách mà ai đó / điều gì đó tham gia vào một hành động hoặc tình huống"
                },
                "examples": [
                    {
                        "en": "Luck played a big part in their success.",
                        "vi": "May mắn đóng một phần không nhỏ trong thành công của họ."
                    },
                    {
                        "en": "She plays an active part in local politics.",
                        "vi": "Cô ấy đóng một vai trò tích cực trong chính trị địa phương."
                    },
                    {
                        "en": "We all have a part to play in the fight against crime.",
                        "vi": "Tất cả chúng ta đều có một phần vai trò trong cuộc chiến chống tội phạm."
                    },
                    {
                        "en": "He had no part in the decision.",
                        "vi": "Anh ấy không có phần quyết định."
                    },
                    {
                        "en": "I want no part of this sordid business.",
                        "vi": "Tôi không muốn tham gia vào công việc kinh doanh bẩn thỉu này."
                    }
                ]
            },
            {
                "define": {
                    "en": "music for a particular voice or instrument in a group singing or playing together",
                    "vi": "âm nhạc cho một giọng nói hoặc nhạc cụ cụ thể trong một nhóm hát hoặc chơi cùng nhau"
                },
                "examples": [
                    {
                        "en": "the clarinet part",
                        "vi": "phần clarinet"
                    },
                    {
                        "en": "The first two verses of the song are set in four-part harmony.",
                        "vi": "Hai câu đầu của bài hát được đặt trong sự hòa hợp bốn phần."
                    },
                    {
                        "en": "I can play the guitar part to that song.",
                        "vi": "Tôi có thể chơi phần guitar của bài hát đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "a unit of measurement that allows you to compare the different amounts of substances in something",
                    "vi": "một đơn vị đo lường cho phép bạn so sánh các lượng khác nhau của các chất trong một thứ gì đó"
                },
                "examples": [
                    {
                        "en": "Add three parts wine to one part water.",
                        "vi": "Thêm ba phần rượu vào một phần nước."
                    },
                    {
                        "en": "fluoride levels of 0.2 parts per million",
                        "vi": "mức florua 0,2 phần triệu"
                    }
                ]
            },
            {
                "define": {
                    "en": "a line on a person’s head where the hair is divided with a comb",
                    "vi": "một đường trên đầu của một người, nơi tóc được chia bằng lược"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be better or more effective as a group than you would think just by looking at the individual members of the group",
                    "vi": "để trở thành một nhóm tốt hơn hoặc hiệu quả hơn những gì bạn nghĩ chỉ bằng cách nhìn vào từng thành viên trong nhóm"
                },
                "examples": [
                    {
                        "en": "The team is greater than the sum of its parts.",
                        "vi": "Nhóm lớn hơn tổng các bộ phận của nó."
                    }
                ]
            },
            {
                "define": {
                    "en": "most of something, especially a period of time; more than half of something",
                    "vi": "hầu hết mọi thứ, đặc biệt là một khoảng thời gian; hơn một nửa của cái gì đó"
                },
                "examples": [
                    {
                        "en": "He drank the best part of a bottle of Scotch waiting for her to get home.",
                        "vi": "Anh uống phần ngon nhất của chai Scotch chờ cô về nhà."
                    },
                    {
                        "en": "The journey took her the better part of an hour.",
                        "vi": "Cuộc hành trình đã khiến cô mất một giờ tốt hơn."
                    }
                ]
            },
            {
                "define": {
                    "en": "you should avoid danger and not take unnecessary risks",
                    "vi": "bạn nên tránh nguy hiểm và không gặp rủi ro không cần thiết"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "mostly; usually",
                    "vi": "hầu hết; thường xuyên"
                },
                "examples": [
                    {
                        "en": "The contributors are, for the most part, professional scientists.",
                        "vi": "Phần lớn những người đóng góp là các nhà khoa học chuyên nghiệp."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to express your own, his, their, etc. opinion or feelings about something",
                    "vi": "được sử dụng để bày tỏ ý kiến hoặc cảm xúc của riêng bạn, của anh ấy, của họ, v.v. về điều gì đó"
                },
                "examples": [
                    {
                        "en": "For my part, I would reject all these arguments.",
                        "vi": "Về phần mình, tôi xin bác bỏ tất cả những lập luận này."
                    }
                ]
            },
            {
                "define": {
                    "en": "to a great extent",
                    "vi": "đến một giới hạn rất lớn"
                },
                "examples": [
                    {
                        "en": "Their success is due in large part to their determination.",
                        "vi": "Thành công của họ một phần lớn nhờ vào sự quyết tâm của họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "partly; to some extent",
                    "vi": "từng phần; đến một mức độ nào"
                },
                "examples": [
                    {
                        "en": "Her success was due in part to luck.",
                        "vi": "Thành công của cô một phần là do may mắn."
                    },
                    {
                        "en": "Your salary depends in part on your qualifications.",
                        "vi": "Mức lương của bạn phụ thuộc một phần vào trình độ của bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have an appearance or wear clothes suitable for a particular job, role or position",
                    "vi": "có ngoại hình hoặc mặc quần áo phù hợp với công việc, vai trò hoặc vị trí cụ thể"
                },
                "examples": [
                    {
                        "en": "He acts and dresses the part of a gentleman.",
                        "vi": "Anh ấy hành động và ăn mặc như một quý ông."
                    },
                    {
                        "en": "He was a pirate in the school play and certainly looked the part.",
                        "vi": "Anh ta là một tên cướp biển trong vở kịch của trường và chắc chắn là một phần."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person with many skills",
                    "vi": "một người có nhiều kỹ năng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "made or done by somebody",
                    "vi": "được thực hiện hoặc thực hiện bởi ai đó"
                },
                "examples": [
                    {
                        "en": "It was an error on my part.",
                        "vi": "Đó là một lỗi từ phía tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a normal part of something",
                    "vi": "một phần bình thường của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "Keeping the accounts is part and parcel of my job.",
                        "vi": "Giữ các tài khoản là một phần công việc của tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person or thing that you are so used to seeing that you no longer notice them",
                    "vi": "một người hoặc một vật mà bạn đã quá quen với việc nhìn thấy rằng bạn không còn để ý đến họ nữa"
                },
                "examples": [
                    {
                        "en": "I worked there so long that I became part of the furniture.",
                        "vi": "Tôi đã làm việc ở đó lâu đến nỗi tôi trở thành một phần của đồ nội thất."
                    }
                ]
            },
            {
                "define": {
                    "en": "to accept something slightly unpleasant without complaining or being offended",
                    "vi": "chấp nhận điều gì đó hơi khó chịu mà không phàn nàn hoặc bị xúc phạm"
                },
                "examples": [
                    {
                        "en": "He took the teasing in good part.",
                        "vi": "Anh ấy đã có một phần tốt việc trêu chọc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be involved in something",
                    "vi": "tham gia vào một cái gì đó"
                },
                "examples": [
                    {
                        "en": "to take part in a discussion/demonstration/fight/celebration",
                        "vi": "tham gia vào một cuộc thảo luận / biểu tình / chiến đấu / lễ kỷ niệm"
                    },
                    {
                        "en": "How many countries took part in the last Olympic Games?",
                        "vi": "Có bao nhiêu quốc gia đã tham dự Thế vận hội Olympic gần đây nhất?"
                    },
                    {
                        "en": "They took little part in the discussion.",
                        "vi": "Họ tham gia rất ít vào cuộc thảo luận."
                    }
                ]
            },
            {
                "define": {
                    "en": "to support somebody, for example in an argument",
                    "vi": "để hỗ trợ ai đó, chẳng hạn như trong một cuộc tranh cãi"
                },
                "examples": [
                    {
                        "en": "His mother always takes his part.",
                        "vi": "Mẹ anh ấy luôn dành phần của anh ấy."
                    }
                ]
            }
        ]
    },
    {
        "id": "410ab6f4a3cc4258bbb78a103f7c50cd",
        "word": "plot",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/plɒt/",
            "us": "/plɑːt/"
        },
        "nearby": [
            {
                "word": "plosive",
                "pos": "adjective"
            },
            {
                "word": "plosive",
                "pos": "noun"
            },
            {
                "word": "plot",
                "pos": "noun"
            },
            {
                "word": "plot",
                "pos": "verb"
            },
            {
                "word": "plot hole",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the series of events that form the story of a novel, play, film, etc.",
                    "vi": "Chuỗi sự kiện tạo thành câu chuyện của một cuốn tiểu thuyết, vở kịch, bộ phim, v.v."
                },
                "examples": [
                    {
                        "en": "It's hard to follow the plot of the film.",
                        "vi": "Thật khó để theo dõi tình tiết của phim."
                    },
                    {
                        "en": "plot about something a conventional plot about love and marriage",
                        "vi": "cốt truyện về một cái gì đó một cốt truyện thông thường về tình yêu và hôn nhân"
                    },
                    {
                        "en": "The book is well organized in terms of plot.",
                        "vi": "Cuốn sách được tổ chức tốt về mặt cốt truyện."
                    },
                    {
                        "en": "Plot twists (= unexpected developments) keep you guessing throughout the series.",
                        "vi": "Các khúc quanh của âm mưu (= diễn biến bất ngờ) khiến bạn phải đoán trong suốt bộ truyện."
                    }
                ]
            },
            {
                "define": {
                    "en": "a secret plan made by a group of people to do something wrong or illegal",
                    "vi": "một kế hoạch bí mật được thực hiện bởi một nhóm người để làm điều gì đó sai trái hoặc bất hợp pháp"
                },
                "examples": [
                    {
                        "en": "He had been the victim of an elaborate murder plot.",
                        "vi": "Anh ta từng là nạn nhân của một âm mưu giết người phức tạp."
                    },
                    {
                        "en": "plot to do something The rebels hatched a plot to overthrow the government.",
                        "vi": "âm mưu làm điều gì đó Những kẻ nổi dậy ấp ủ một âm mưu lật đổ chính phủ."
                    },
                    {
                        "en": "plot against somebody Police uncovered a plot against the president.",
                        "vi": "âm mưu chống lại ai đó Cảnh sát đã phát hiện ra một âm mưu chống lại tổng thống."
                    },
                    {
                        "en": "They had taken part in a Jacobite plot against William III.",
                        "vi": "Họ đã tham gia vào một âm mưu của Jacobite chống lại William III."
                    }
                ]
            },
            {
                "define": {
                    "en": "a small piece of land that is used or intended for a special purpose",
                    "vi": "một mảnh đất nhỏ được sử dụng hoặc có mục đích đặc biệt"
                },
                "examples": [
                    {
                        "en": "She bought a small plot of land to build a house on.",
                        "vi": "Cô mua một mảnh đất nhỏ để xây nhà."
                    },
                    {
                        "en": "a vegetable plot",
                        "vi": "một lô rau"
                    }
                ]
            },
            {
                "define": {
                    "en": "to lose your ability to understand or deal with what is happening",
                    "vi": "mất khả năng hiểu hoặc đối phó với những gì đang xảy ra"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to say that a situation is becoming more complicated and difficult to understand",
                    "vi": "từng nói rằng một tình huống đang trở nên phức tạp và khó hiểu hơn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "4f437552c4934c58a659ecd5426f9370",
        "word": "setting",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈsetɪŋ/",
            "us": "/ˈsetɪŋ/"
        },
        "nearby": [
            {
                "word": "setter",
                "pos": "noun"
            },
            {
                "word": "set text",
                "pos": "noun"
            },
            {
                "word": "setting",
                "pos": "noun"
            },
            {
                "word": "settle",
                "pos": "verb"
            },
            {
                "word": "settle",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an environment where something is located; the place at which something happens",
                    "vi": "một môi trường nơi một cái gì đó được đặt; nơi mà tại đó điều gì đó xảy ra"
                },
                "examples": [
                    {
                        "en": "a rural/an ideal/a beautiful/an idyllic setting",
                        "vi": "một vùng nông thôn / một lý tưởng / một khung cảnh đẹp / một khung cảnh bình dị"
                    },
                    {
                        "en": "setting for something It was the perfect setting for a wonderful Christmas.",
                        "vi": "sắp đặt cho một cái gì đó Đó là khung cảnh hoàn hảo cho một Giáng sinh tuyệt vời."
                    },
                    {
                        "en": "in a setting The exhibition shows how bees can live happily in an urban setting.",
                        "vi": "trong một khung cảnh Triển lãm cho thấy làm thế nào những con ong có thể sống hạnh phúc trong một khung cảnh đô thị."
                    },
                    {
                        "en": "This is the first time the method has been tested in a clinical setting.",
                        "vi": "Đây là lần đầu tiên phương pháp này được thử nghiệm trên lâm sàng."
                    },
                    {
                        "en": "Infections acquired in health-care settings are of increasing concern.",
                        "vi": "Nhiễm trùng mắc phải trong các cơ sở chăm sóc sức khỏe đang ngày càng được quan tâm."
                    },
                    {
                        "en": "People tend to behave differently in different social settings.",
                        "vi": "Mọi người có xu hướng hành xử khác nhau trong các môi trường xã hội khác nhau."
                    }
                ]
            },
            {
                "define": {
                    "en": "the place and time at which the action of a play, novel, etc. takes place",
                    "vi": "địa điểm và thời gian diễn ra hành động của một vở kịch, tiểu thuyết, v.v."
                },
                "examples": [
                    {
                        "en": "short stories with a contemporary setting",
                        "vi": "truyện ngắn với bối cảnh đương đại"
                    },
                    {
                        "en": "New York City is the setting of his new novel.",
                        "vi": "Thành phố New York là bối cảnh của cuốn tiểu thuyết mới của anh ấy."
                    },
                    {
                        "en": "setting for something London has been used as the setting for many films.",
                        "vi": "bối cảnh cho một cái gì đó London đã được sử dụng làm bối cảnh cho nhiều bộ phim."
                    },
                    {
                        "en": "The Scottish Highlands provide the settings for many of his stories.",
                        "vi": "Cao nguyên Scotland cung cấp bối cảnh cho nhiều câu chuyện của anh ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "a position at which the controls on a machine can be set, to set the speed, height, temperature, etc.",
                    "vi": "vị trí mà tại đó các điều khiển trên máy có thể được đặt, để đặt tốc độ, chiều cao, nhiệt độ, v.v."
                },
                "examples": [
                    {
                        "en": "There are three speed settings: high, medium, and low.",
                        "vi": "Có ba cài đặt tốc độ: cao, trung bình và thấp."
                    },
                    {
                        "en": "at a setting The performance of the engine was tested at different settings.",
                        "vi": "ở một cài đặt Hiệu suất của động cơ đã được kiểm tra ở các cài đặt khác nhau."
                    },
                    {
                        "en": "The oven should be at a high setting.",
                        "vi": "Lò nướng phải ở nhiệt độ cao."
                    },
                    {
                        "en": "on a setting He keeps the car's speakers on a low volume setting.",
                        "vi": "trên một cài đặt Anh ấy để loa của ô tô ở cài đặt âm lượng nhỏ."
                    },
                    {
                        "en": "In very hot weather it may be necessary to adjust the temperature setting on your fridge.",
                        "vi": "Trong thời tiết quá nóng, có thể cần điều chỉnh cài đặt nhiệt độ trên tủ lạnh của bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "the place on a computer or other electronic device where you can choose the way that it works or looks; the particular choices that you make",
                    "vi": "vị trí trên máy tính hoặc thiết bị điện tử khác, nơi bạn có thể chọn cách thức hoạt động hoặc giao diện của nó; những lựa chọn cụ thể mà bạn thực hiện"
                },
                "examples": [
                    {
                        "en": "To change the size of the font, go to Settings.",
                        "vi": "Để thay đổi kích thước của phông chữ, hãy chuyển đến Cài đặt."
                    },
                    {
                        "en": "It's easy to change the settings on your device.",
                        "vi": "Thật dễ dàng để thay đổi cài đặt trên thiết bị của bạn."
                    },
                    {
                        "en": "All tests were run at default settings.",
                        "vi": "Tất cả các thử nghiệm đã được chạy ở cài đặt mặc định."
                    }
                ]
            },
            {
                "define": {
                    "en": "music written to go with a poem, etc.",
                    "vi": "nhạc được viết để đi cùng với một bài thơ, v.v."
                },
                "examples": [
                    {
                        "en": "Schubert’s setting of a poem by Goethe",
                        "vi": "Schubert sắp đặt một bài thơ của Goethe"
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of metal in which a precious stone is fixed to form a piece of jewellery",
                    "vi": "một miếng kim loại trong đó một viên đá quý được cố định để tạo thành một món đồ trang sức"
                },
                "examples": [
                    {
                        "en": "a ruby in a heavy gold setting",
                        "vi": "một viên hồng ngọc trong một thiết lập vàng nặng"
                    }
                ]
            },
            {
                "define": {
                    "en": "a complete set of equipment for eating with (knife, fork, spoon, glass, etc.) for one person, arranged on a table",
                    "vi": "một bộ đầy đủ các thiết bị dùng để ăn (dao, nĩa, thìa, thủy tinh, v.v.) cho một người, được sắp xếp trên bàn"
                },
                "examples": [
                    {
                        "en": "a place setting",
                        "vi": "một thiết lập địa điểm"
                    }
                ]
            }
        ]
    },
    {
        "id": "7a065a4070db4fe79a8c94f5e1ac0557",
        "word": "speech",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/spiːtʃ/",
            "us": "/spiːtʃ/"
        },
        "nearby": [
            {
                "word": "speculum",
                "pos": "noun"
            },
            {
                "word": "sped",
                "pos": "verb"
            },
            {
                "word": "speech",
                "pos": "noun"
            },
            {
                "word": "speech act",
                "pos": "noun"
            },
            {
                "word": "speech bubble",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a formal talk that a person gives to an audience",
                    "vi": "một cuộc nói chuyện chính thức mà một người dành cho khán giả"
                },
                "examples": [
                    {
                        "en": "Several people made speeches at the wedding.",
                        "vi": "Một số người đã phát biểu trong lễ cưới."
                    },
                    {
                        "en": "She gave a rousing speech to the crowd.",
                        "vi": "Cô ấy đã có một bài phát biểu sôi nổi trước đám đông."
                    },
                    {
                        "en": "speech on something to deliver a speech on human rights",
                        "vi": "bài phát biểu về điều gì đó để thực hiện một bài phát biểu về quyền con người"
                    },
                    {
                        "en": "speech about something He inspired everyone with a moving speech about tolerance and respect.",
                        "vi": "bài phát biểu về điều gì đó Anh ấy đã truyền cảm hứng cho mọi người bằng một bài phát biểu cảm động về lòng khoan dung và sự tôn trọng."
                    },
                    {
                        "en": "in a speech In his acceptance speech, the actor thanked his family.",
                        "vi": "trong bài phát biểu Trong bài phát biểu nhận giải, nam diễn viên đã gửi lời cảm ơn đến gia đình."
                    }
                ]
            },
            {
                "define": {
                    "en": "the language used when speaking; the fact of speaking rather than writing",
                    "vi": "ngôn ngữ được sử dụng khi nói; thực tế là nói hơn là viết"
                },
                "examples": [
                    {
                        "en": "in speech This expression is used mainly in speech, not in writing.",
                        "vi": "trong lời nói Biểu thức này được sử dụng chủ yếu trong lời nói, không phải trong văn bản."
                    },
                    {
                        "en": "a defence of free speech (= the right to say openly what you think)",
                        "vi": "bảo vệ quyền tự do ngôn luận (= quyền nói công khai những gì bạn nghĩ)"
                    },
                    {
                        "en": "speech sounds",
                        "vi": "âm thanh lời nói"
                    }
                ]
            },
            {
                "define": {
                    "en": "the ability to speak",
                    "vi": "khả năng nói"
                },
                "examples": [
                    {
                        "en": "I seemed to have lost the power of speech.",
                        "vi": "Tôi dường như đã mất sức mạnh của lời nói."
                    },
                    {
                        "en": "a speech impediment",
                        "vi": "một trở ngại lời nói"
                    },
                    {
                        "en": "The child was referred to a speech therapist.",
                        "vi": "Đứa trẻ đã được giới thiệu đến một nhà trị liệu ngôn ngữ."
                    }
                ]
            },
            {
                "define": {
                    "en": "the way in which a particular person speaks",
                    "vi": "cách mà một người cụ thể nói"
                },
                "examples": [
                    {
                        "en": "Her speech was slurred—she was clearly drunk.",
                        "vi": "Bài phát biểu của cô ấy bị lắp bắp - rõ ràng là cô ấy đang say."
                    },
                    {
                        "en": "Clear speech with crisp consonant sounds is very important.",
                        "vi": "Lời nói rõ ràng với các phụ âm rõ ràng là rất quan trọng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a group of lines that an actor speaks in a play in the theatre",
                    "vi": "một nhóm lời thoại mà một diễn viên nói trong một vở kịch trong rạp hát"
                },
                "examples": [
                    {
                        "en": "She has the longest speech in the play.",
                        "vi": "Cô ấy có bài phát biểu dài nhất trong vở kịch."
                    }
                ]
            }
        ]
    },
    {
        "id": "f14e5d06a52e4ac5a225b76749c33fa1",
        "word": "superhero",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈsuːpəhɪərəʊ/",
            "us": "/ˈsuːpərhɪrəʊ/"
        },
        "nearby": [
            {
                "word": "superheated",
                "pos": "adjective"
            },
            {
                "word": "superheavyweight",
                "pos": "noun"
            },
            {
                "word": "superhero",
                "pos": "noun"
            },
            {
                "word": "superhighway",
                "pos": "noun"
            },
            {
                "word": "superhuman",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a character in a story, film, etc. who has unusual strength or power and uses it to help people; a real person who has done something unusually brave to help somebody",
                    "vi": "một nhân vật trong truyện, phim, v.v ... có sức mạnh hoặc quyền năng khác thường và sử dụng nó để giúp đỡ mọi người; một người thực sự đã làm điều gì đó dũng cảm một cách bất thường để giúp đỡ ai đó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "04193f7e0cb94261bd8b2eab20fab976",
        "word": "action",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈækʃn/",
            "us": "/ˈækʃn/"
        },
        "nearby": [
            {
                "word": "acting pilot officer",
                "pos": "noun"
            },
            {
                "word": "actinium",
                "pos": "noun"
            },
            {
                "word": "action",
                "pos": "noun"
            },
            {
                "word": "action",
                "pos": "verb"
            },
            {
                "word": "actionable",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the process of doing something in order to make something happen or to deal with a situation",
                    "vi": "quá trình làm điều gì đó để biến điều gì đó xảy ra hoặc để đối phó với một tình huống"
                },
                "examples": [
                    {
                        "en": "The time has come for action if these beautiful animals are to survive.",
                        "vi": "Đã đến lúc phải hành động nếu những con vật xinh đẹp này muốn tồn tại."
                    },
                    {
                        "en": "to threaten/demand/call for action",
                        "vi": "đe dọa / yêu cầu / kêu gọi hành động"
                    },
                    {
                        "en": "Firefighters took action immediately to stop the blaze spreading.",
                        "vi": "Lực lượng cứu hỏa đã hành động ngay lập tức để ngăn ngọn lửa lan rộng."
                    },
                    {
                        "en": "Divers were close at hand, ready to go into action if the stunt went wrong.",
                        "vi": "Các thợ lặn đã sẵn sàng hành động nếu diễn viên đóng thế gặp trục trặc."
                    },
                    {
                        "en": "What is the best course of action in the circumstances?",
                        "vi": "Cách hành động tốt nhất trong hoàn cảnh nào?"
                    },
                    {
                        "en": "She began to explain her plan of action to the group.",
                        "vi": "Cô bắt đầu giải thích kế hoạch hành động của mình cho cả nhóm."
                    },
                    {
                        "en": "The men face disciplinary action.",
                        "vi": "Những người đàn ông phải đối mặt với hình thức kỷ luật."
                    }
                ]
            },
            {
                "define": {
                    "en": "a thing that somebody does",
                    "vi": "một điều mà ai đó làm"
                },
                "examples": [
                    {
                        "en": "Each of us must take responsibility for our own actions.",
                        "vi": "Mỗi chúng ta phải tự chịu trách nhiệm về những việc làm của mình."
                    },
                    {
                        "en": "They sought to justify their actions.",
                        "vi": "Họ đã tìm cách biện minh cho hành động của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "things that workers do, especially stopping work, to protest to their employers about something",
                    "vi": "những việc mà người lao động làm, đặc biệt là ngừng việc, để phản đối người chủ của họ về điều gì đó"
                },
                "examples": [
                    {
                        "en": "Workers voted in favour of strike action.",
                        "vi": "Công nhân đã bỏ phiếu ủng hộ hành động đình công."
                    },
                    {
                        "en": "They called off their action at 7.40 am after the meeting was arranged.",
                        "vi": "Họ ngừng hành động lúc 7 giờ 40 sáng sau khi cuộc họp được sắp xếp."
                    },
                    {
                        "en": "Unions said the action could be suspended early on Friday if talks between the two sides resumed.",
                        "vi": "Các nghiệp đoàn cho biết hành động này có thể bị đình chỉ vào đầu ngày thứ Sáu nếu các cuộc đàm phán giữa hai bên được nối lại."
                    },
                    {
                        "en": "The government began taking a hard line against labour actions.",
                        "vi": "Chính phủ bắt đầu có đường lối cứng rắn đối với các hành động lao động."
                    }
                ]
            },
            {
                "define": {
                    "en": "a legal process to stop a person or company from doing something, or to make them pay for a mistake, etc.",
                    "vi": "một quy trình pháp lý để ngăn một người hoặc công ty làm điều gì đó hoặc buộc họ phải trả giá cho một sai lầm, v.v."
                },
                "examples": [
                    {
                        "en": "A libel action is being brought against the magazine that published the article.",
                        "vi": "Một hành động bôi nhọ đang được thực hiện chống lại tạp chí đã xuất bản bài báo."
                    },
                    {
                        "en": "action against somebody/something He is considering taking legal action against the hospital.",
                        "vi": "hành động chống lại ai đó / điều gì đó Anh ấy đang xem xét việc thực hiện hành động pháp lý chống lại bệnh viện."
                    }
                ]
            },
            {
                "define": {
                    "en": "fighting in a battle or war",
                    "vi": "chiến đấu trong một trận chiến hoặc chiến tranh"
                },
                "examples": [
                    {
                        "en": "The possibility of taking military action has not been ruled out.",
                        "vi": "Khả năng thực hiện các hành động quân sự vẫn chưa bị loại trừ."
                    },
                    {
                        "en": "I never saw action during the war.",
                        "vi": "Tôi chưa bao giờ thấy hành động trong chiến tranh."
                    },
                    {
                        "en": "in action soldiers killed in action",
                        "vi": "trong hành động những người lính bị giết trong hành động"
                    }
                ]
            },
            {
                "define": {
                    "en": "the events in a story, play, etc.",
                    "vi": "các sự kiện trong một câu chuyện, vở kịch, v.v."
                },
                "examples": [
                    {
                        "en": "The action takes place in France.",
                        "vi": "Hành động diễn ra ở Pháp."
                    }
                ]
            },
            {
                "define": {
                    "en": "exciting events",
                    "vi": "sự kiện thú vị"
                },
                "examples": [
                    {
                        "en": "I like films with plenty of action.",
                        "vi": "Tôi thích những bộ phim có nhiều pha hành động."
                    },
                    {
                        "en": "New York is where the action is.",
                        "vi": "New York là nơi hành động."
                    },
                    {
                        "en": "If you want to know where all the action is around here, just ask Jo.",
                        "vi": "Nếu bạn muốn biết tất cả các hành động xung quanh đây ở đâu, chỉ cần hỏi Jo."
                    }
                ]
            },
            {
                "define": {
                    "en": "the effect that something such as a chemical has on something",
                    "vi": "ảnh hưởng của một thứ gì đó chẳng hạn như hóa chất đối với một thứ gì đó"
                },
                "examples": [
                    {
                        "en": "Vitamin D can be made in the body by the action of sunlight on the skin.",
                        "vi": "Vitamin D có thể được tạo ra trong cơ thể nhờ tác động của ánh nắng mặt trời lên da."
                    },
                    {
                        "en": "The action of the rushing water cleans the gully.",
                        "vi": "Hoạt động của dòng nước chảy xiết sẽ làm sạch rãnh nước."
                    }
                ]
            },
            {
                "define": {
                    "en": "the way a part of the body moves or functions",
                    "vi": "cách một bộ phận của cơ thể di chuyển hoặc hoạt động"
                },
                "examples": [
                    {
                        "en": "a study of the action of the liver",
                        "vi": "một nghiên cứu về hoạt động của gan"
                    }
                ]
            },
            {
                "define": {
                    "en": "the mechanical parts of a piano, gun, clock, etc. or the way the parts move",
                    "vi": "các bộ phận cơ học của đàn piano, súng, đồng hồ, v.v. hoặc cách các bộ phận chuyển động"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "what a person actually does means more than what they say they will do",
                    "vi": "những gì một người thực sự làm có ý nghĩa hơn những gì họ nói rằng họ sẽ làm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "if somebody/something is in action, they are doing the activity or work that is typical for them",
                    "vi": "nếu ai đó / điều gì đó đang hoạt động, họ đang thực hiện hoạt động hoặc công việc tiêu biểu cho họ"
                },
                "examples": [
                    {
                        "en": "Just press the button to see your favourite character in action.",
                        "vi": "Chỉ cần nhấn nút để xem nhân vật yêu thích của bạn đang hoạt động."
                    },
                    {
                        "en": "I've yet to see all the players in action.",
                        "vi": "Tôi vẫn chưa thấy tất cả các cầu thủ thi đấu."
                    },
                    {
                        "en": "I have not yet seen the machines in action.",
                        "vi": "Tôi vẫn chưa nhìn thấy máy móc hoạt động."
                    }
                ]
            },
            {
                "define": {
                    "en": "if you put an idea or a plan into action, you start making it happen or work",
                    "vi": "nếu bạn đưa một ý tưởng hoặc một kế hoạch vào hành động, bạn bắt đầu biến nó thành hiện thực hoặc hoạt động"
                },
                "examples": [
                    {
                        "en": "The new plan for traffic control is being put into action on an experimental basis.",
                        "vi": "Kế hoạch mới để kiểm soát giao thông đang được thực hiện trên cơ sở thử nghiệm."
                    },
                    {
                        "en": "We need to put these ideas into action.",
                        "vi": "Chúng ta cần đưa những ý tưởng này vào hành động."
                    }
                ]
            },
            {
                "define": {
                    "en": "not able to work or be used because of injury or damage",
                    "vi": "không thể làm việc hoặc sử dụng được vì bị thương hoặc bị hư hỏng"
                },
                "examples": [
                    {
                        "en": "Jon will be out of action for weeks with a broken leg.",
                        "vi": "Jon sẽ phải nghỉ thi đấu nhiều tuần vì bị gãy chân."
                    },
                    {
                        "en": "The photocopier is out of action today.",
                        "vi": "Hôm nay máy photocopy không hoạt động."
                    },
                    {
                        "en": "He is out of action following an ankle injury.",
                        "vi": "Anh ấy phải nghỉ thi đấu sau chấn thương mắt cá chân."
                    }
                ]
            },
            {
                "define": {
                    "en": "a share or role in an interesting or exciting activity, especially one that makes money",
                    "vi": "một chia sẻ hoặc vai trò trong một hoạt động thú vị hoặc hấp dẫn, đặc biệt là một hoạt động kiếm tiền"
                },
                "examples": [
                    {
                        "en": "Foreign firms will all want a piece of the action if the new airport goes ahead.",
                        "vi": "Tất cả các công ty nước ngoài sẽ muốn có một phần hành động nếu sân bay mới đi vào hoạt động."
                    }
                ]
            },
            {
                "define": {
                    "en": "to suddenly start working or doing something",
                    "vi": "đột nhiên bắt đầu làm việc hoặc làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "‘Let's go!’ he said, springing into action.",
                        "vi": "Đi nào!' anh ta nói, bắt đầu hành động."
                    },
                    {
                        "en": "The town springs to life (= becomes busy) during the carnival.",
                        "vi": "Thị trấn bừng lên sức sống (= trở nên bận rộn) trong lễ hội hóa trang."
                    }
                ]
            },
            {
                "define": {
                    "en": "to start doing something quickly and with a lot of energy",
                    "vi": "để bắt đầu làm một việc gì đó nhanh chóng và tốn nhiều năng lượng"
                },
                "examples": [
                    {
                        "en": "The ambulance crew swung into action to resuscitate the patient.",
                        "vi": "Đội xe cứu thương đã lao vào hành động để hồi sức cấp cứu cho bệnh nhân."
                    },
                    {
                        "en": "The rescue operation swung into action immediately.",
                        "vi": "Chiến dịch cứu hộ bắt đầu ngay lập tức."
                    },
                    {
                        "en": "The emergency services swung into action as soon as the disaster was reported.",
                        "vi": "Các dịch vụ khẩn cấp bắt đầu hoạt động ngay sau khi thảm họa được báo cáo."
                    }
                ]
            },
            {
                "define": {
                    "en": "to act in order to avoid danger or an unpleasant situation",
                    "vi": "hành động để tránh nguy hiểm hoặc một tình huống khó chịu"
                },
                "examples": [
                    {
                        "en": "The pilot had to take evasive action to avoid a mid-air collision.",
                        "vi": "Phi công đã phải thực hiện hành động né tránh để tránh va chạm giữa không trung."
                    }
                ]
            }
        ]
    },
    {
        "id": "2cd1a66bceb64d0b8461c25052cf4d7b",
        "word": "interval",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈɪntəvl/",
            "us": "/ˈɪntərvl/"
        },
        "nearby": [
            {
                "word": "intertextuality",
                "pos": "noun"
            },
            {
                "word": "intertwine",
                "pos": "verb"
            },
            {
                "word": "interval",
                "pos": "noun"
            },
            {
                "word": "interval training",
                "pos": "noun"
            },
            {
                "word": "intervene",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a period of time between two events",
                    "vi": "một khoảng thời gian giữa hai sự kiện"
                },
                "examples": [
                    {
                        "en": "The interval between major earthquakes might be 200 years.",
                        "vi": "Khoảng thời gian giữa các trận động đất lớn có thể là 200 năm."
                    },
                    {
                        "en": "He knocked on the door and after a brief interval it was opened.",
                        "vi": "Anh ấy gõ cửa và sau một khoảng thời gian ngắn, nó đã được mở ra."
                    }
                ]
            },
            {
                "define": {
                    "en": "a short period of time separating parts of a play, film or concert",
                    "vi": "một khoảng thời gian ngắn tách các phần của vở kịch, bộ phim hoặc buổi hòa nhạc"
                },
                "examples": [
                    {
                        "en": "There will be an interval of 20 minutes after the second act.",
                        "vi": "Sẽ có một khoảng thời gian là 20 phút sau hành động thứ hai."
                    }
                ]
            },
            {
                "define": {
                    "en": "a short period during which something different happens from what is happening the rest of the time",
                    "vi": "một khoảng thời gian ngắn trong đó điều gì đó xảy ra khác với những gì đang xảy ra trong khoảng thời gian còn lại"
                },
                "examples": [
                    {
                        "en": "She's delirious, but has lucid intervals.",
                        "vi": "Cô ấy mê sảng, nhưng có những khoảng thời gian minh mẫn."
                    },
                    {
                        "en": "(British English) The day should be mainly dry with sunny intervals.",
                        "vi": "(Tiếng Anh Anh) Ngày sẽ chủ yếu khô với các khoảng thời gian nắng."
                    },
                    {
                        "en": "The intervals between his various illnesses grew shorter and shorter.",
                        "vi": "Khoảng thời gian giữa các lần bệnh khác nhau của anh ngày càng ngắn lại."
                    }
                ]
            },
            {
                "define": {
                    "en": "a difference in pitch (= how high or low a note sounds) between two notes",
                    "vi": "sự khác biệt về cao độ (= âm lượng của một nốt cao hoặc thấp) giữa hai nốt"
                },
                "examples": [
                    {
                        "en": "an interval of one octave",
                        "vi": "khoảng một quãng tám"
                    }
                ]
            },
            {
                "define": {
                    "en": "an activity in interval training",
                    "vi": "một hoạt động trong đào tạo ngắt quãng"
                },
                "examples": [
                    {
                        "en": "You can do intervals by alternating power walking with easy jogging.",
                        "vi": "Bạn có thể thực hiện cách quãng bằng cách đi bộ bằng sức xen kẽ với chạy bộ dễ dàng."
                    }
                ]
            },
            {
                "define": {
                    "en": "with time between",
                    "vi": "với thời gian giữa"
                },
                "examples": [
                    {
                        "en": "Buses to the city leave at regular intervals.",
                        "vi": "Các chuyến xe buýt đến thành phố khởi hành đều đặn."
                    },
                    {
                        "en": "The runners started at 5-minute intervals.",
                        "vi": "Người chạy bắt đầu cách nhau 5 phút."
                    }
                ]
            },
            {
                "define": {
                    "en": "with spaces between",
                    "vi": "với khoảng cách giữa"
                },
                "examples": [
                    {
                        "en": "Flaming torches were positioned at intervals along the terrace.",
                        "vi": "Những ngọn đuốc rực lửa được đặt cách nhau dọc theo sân thượng."
                    },
                    {
                        "en": "The flags were spaced at two-metre intervals.",
                        "vi": "Các lá cờ được đặt cách nhau hai mét."
                    }
                ]
            }
        ]
    },
    {
        "id": "7e85bf3121364873afa04300f9ddfdd0",
        "word": "opening",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈəʊpənɪŋ/",
            "us": "/ˈəʊpənɪŋ/"
        },
        "nearby": [
            {
                "word": "open-heart surgery",
                "pos": "noun"
            },
            {
                "word": "open house",
                "pos": "noun"
            },
            {
                "word": "opening",
                "pos": "noun"
            },
            {
                "word": "opening",
                "pos": "adjective"
            },
            {
                "word": "opening hours",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a space or hole that somebody/something can pass through",
                    "vi": "một không gian hoặc lỗ hổng mà ai đó / thứ gì đó có thể đi qua"
                },
                "examples": [
                    {
                        "en": "We could see the stars through an opening in the roof.",
                        "vi": "Chúng tôi có thể nhìn thấy các vì sao thông qua một khe hở trên mái nhà."
                    },
                    {
                        "en": "opening to something It looks like the opening to a small cave.",
                        "vi": "mở ra một cái gì đó Nó trông giống như việc mở ra một cái hang nhỏ."
                    }
                ]
            },
            {
                "define": {
                    "en": "the beginning or first part of something",
                    "vi": "phần đầu hoặc phần đầu tiên của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "The movie has an exciting opening.",
                        "vi": "Phim có một mở đầu hấp dẫn."
                    },
                    {
                        "en": "a brilliant opening sequence",
                        "vi": "một chuỗi mở đầu tuyệt vời"
                    },
                    {
                        "en": "opening to something It's such a brave opening to a book.",
                        "vi": "mở đầu cho một điều gì đó Đó là một sự mở đầu dũng cảm đối với một cuốn sách."
                    }
                ]
            },
            {
                "define": {
                    "en": "a ceremony to celebrate the start of a public event or the first time a new building, road, etc. is used",
                    "vi": "lễ kỷ niệm khởi công một sự kiện công cộng hoặc lần đầu tiên một công trình mới, con đường, v.v. được sử dụng"
                },
                "examples": [
                    {
                        "en": "opening of something the official opening of the new hospital",
                        "vi": "khai trương một cái gì đó chính thức mở bệnh viện mới"
                    },
                    {
                        "en": "the opening of the Olympic Games",
                        "vi": "khai mạc Thế vận hội Olympic"
                    },
                    {
                        "en": "the state opening of Parliament",
                        "vi": "quốc hội khai mạc tiểu bang"
                    },
                    {
                        "en": "tickets for the opening ceremony",
                        "vi": "vé cho lễ khai mạc"
                    },
                    {
                        "en": "The gallery has scheduled a grand opening for June 29.",
                        "vi": "Phòng trưng bày đã lên lịch khai mạc vào ngày 29/6."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act or process of making something open or of becoming open",
                    "vi": "hành động hoặc quá trình làm cho một cái gì đó mở ra hoặc trở nên cởi mở"
                },
                "examples": [
                    {
                        "en": "opening of something the opening of a flower",
                        "vi": "mở một cái gì đó mở một bông hoa"
                    },
                    {
                        "en": "the opening of the new play",
                        "vi": "phần mở đầu của vở kịch mới"
                    },
                    {
                        "en": "Late opening of supermarkets is common in Britain now.",
                        "vi": "Giờ đây, việc mở cửa siêu thị muộn là điều phổ biến ở Anh."
                    },
                    {
                        "en": "She heard footsteps and the opening and closing of the door.",
                        "vi": "Cô nghe thấy tiếng bước chân và tiếng đóng mở cửa."
                    }
                ]
            },
            {
                "define": {
                    "en": "a job that is available",
                    "vi": "một công việc có sẵn"
                },
                "examples": [
                    {
                        "en": "There are several openings in the sales department.",
                        "vi": "Có một số sơ hở trong bộ phận bán hàng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a good opportunity for somebody",
                    "vi": "một cơ hội tốt cho ai đó"
                },
                "examples": [
                    {
                        "en": "Winning the competition was the opening she needed for her career.",
                        "vi": "Chiến thắng cuộc thi là sự mở đầu cần thiết cho sự nghiệp của cô."
                    }
                ]
            },
            {
                "define": {
                    "en": "part of a piece of clothing that is made to open and close so that it can be put on easily",
                    "vi": "một phần của quần áo được tạo ra để đóng mở để có thể mặc vào dễ dàng"
                },
                "examples": [
                    {
                        "en": "The skirt has a side opening.",
                        "vi": "Váy có một bên hở."
                    }
                ]
            }
        ]
    },
    {
        "id": "352ad2d7539f47249a421de4213ca2d4",
        "word": "routine",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ruːˈtiːn/",
            "us": "/ruːˈtiːn/"
        },
        "nearby": [
            {
                "word": "router1",
                "pos": "noun"
            },
            {
                "word": "router2",
                "pos": "noun"
            },
            {
                "word": "routine",
                "pos": "noun"
            },
            {
                "word": "routine",
                "pos": "adjective"
            },
            {
                "word": "routinely",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the normal order and way in which you regularly do things",
                    "vi": "thứ tự bình thường và cách bạn thường xuyên làm mọi việc"
                },
                "examples": [
                    {
                        "en": "to settle/get/fall into a routine",
                        "vi": "để giải quyết / có được / rơi vào một thói quen"
                    },
                    {
                        "en": "We are trying to get the baby into a routine for feeding and sleeping.",
                        "vi": "Chúng tôi đang cố gắng tạo cho em bé thói quen bú và ngủ."
                    },
                    {
                        "en": "In school, I quickly fell into the routine.",
                        "vi": "Ở trường, tôi nhanh chóng rơi vào nề nếp."
                    },
                    {
                        "en": "Make exercise a part of your daily routine.",
                        "vi": "Hãy tập thể dục trở thành một phần trong thói quen hàng ngày của bạn."
                    },
                    {
                        "en": "A pressing work project had disrupted his normal sleep routine.",
                        "vi": "Một dự án công việc cấp bách đã làm gián đoạn thói quen ngủ bình thường của anh ấy."
                    },
                    {
                        "en": "There's never a bad time to begin a new exercise routine.",
                        "vi": "Không bao giờ là thời điểm xấu để bắt đầu một thói quen tập thể dục mới."
                    },
                    {
                        "en": "We clean and repair the machines as a matter of routine.",
                        "vi": "Chúng tôi vệ sinh và sửa chữa máy móc như một việc thường xuyên."
                    },
                    {
                        "en": "Don't cut back on your regular fitness routine.",
                        "vi": "Đừng cắt giảm thói quen tập thể dục thường xuyên của bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a situation in which life is boring because things are always done in the same way",
                    "vi": "một tình huống mà cuộc sống tẻ nhạt vì mọi thứ luôn được thực hiện theo cùng một cách"
                },
                "examples": [
                    {
                        "en": "She needed a break from routine.",
                        "vi": "Cô cần nghỉ ngơi khỏi những công việc thường ngày."
                    },
                    {
                        "en": "He tries to escape the dull routine of his office life.",
                        "vi": "Anh ta cố gắng thoát khỏi thói quen buồn tẻ của cuộc sống văn phòng của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "a series of movements, jokes, etc. that are part of a performance",
                    "vi": "một loạt các chuyển động, trò đùa, v.v. là một phần của màn biểu diễn"
                },
                "examples": [
                    {
                        "en": "to do/perform a dance routine",
                        "vi": "để làm / thực hiện một thói quen khiêu vũ"
                    },
                    {
                        "en": "We need some new material for our routine.",
                        "vi": "Chúng tôi cần một số tài liệu mới cho thói quen của chúng tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a list of instructions that enable a computer to perform a particular task",
                    "vi": "danh sách các hướng dẫn cho phép máy tính thực hiện một tác vụ cụ thể"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "dc2cae4fac394a20b865ab95d57f70b8",
        "word": "scenario",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/səˈnɑːriəʊ/",
            "us": "/səˈnæriəʊ/"
        },
        "nearby": [
            {
                "word": "scavenger hunt",
                "pos": "noun"
            },
            {
                "word": "SCE",
                "pos": "abbreviation"
            },
            {
                "word": "scenario",
                "pos": "noun"
            },
            {
                "word": "scene",
                "pos": "noun"
            },
            {
                "word": "scene-of-crime",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a description of how things might happen in the future",
                    "vi": "mô tả về cách mọi thứ có thể xảy ra trong tương lai"
                },
                "examples": [
                    {
                        "en": "Let me suggest a possible scenario.",
                        "vi": "Hãy để tôi đề xuất một kịch bản khả thi."
                    },
                    {
                        "en": "The worst-case scenario (= the worst possible thing that could happen) would be for the factory to be closed down.",
                        "vi": "Tình huống xấu nhất (= điều tồi tệ nhất có thể xảy ra) là nhà máy sẽ phải đóng cửa."
                    },
                    {
                        "en": "a nightmare scenario",
                        "vi": "một kịch bản ác mộng"
                    }
                ]
            },
            {
                "define": {
                    "en": "a written outline of what happens in a film or play",
                    "vi": "một phác thảo bằng văn bản về những gì xảy ra trong một bộ phim hoặc vở kịch"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "49eb4f059b434deda2629de5aa8df5ea",
        "word": "storyline",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈstɔːrilaɪn/",
            "us": "/ˈstɔːrilaɪn/"
        },
        "nearby": [
            {
                "word": "storybook",
                "pos": "noun"
            },
            {
                "word": "story editor",
                "pos": "noun"
            },
            {
                "word": "storyline",
                "pos": "noun"
            },
            {
                "word": "storyteller",
                "pos": "noun"
            },
            {
                "word": "storytelling",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the basic story in a novel, play, film, etc.",
                    "vi": "câu chuyện cơ bản trong tiểu thuyết, vở kịch, phim, v.v."
                },
                "examples": [
                    {
                        "en": "Her novels always have the same basic storyline.",
                        "vi": "Tiểu thuyết của cô ấy luôn có cùng một cốt truyện cơ bản."
                    },
                    {
                        "en": "a compelling and tragic storyline",
                        "vi": "một cốt truyện hấp dẫn và bi thảm"
                    }
                ]
            }
        ]
    },
    {
        "id": "112f25c2c51b4d3eb424237db2385bbe",
        "word": "tension",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈtenʃn/",
            "us": "/ˈtenʃn/"
        },
        "nearby": [
            {
                "word": "tenseness",
                "pos": "noun"
            },
            {
                "word": "tensile",
                "pos": "adjective"
            },
            {
                "word": "tension",
                "pos": "noun"
            },
            {
                "word": "tension",
                "pos": "verb"
            },
            {
                "word": "1066",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a situation in which people do not trust each other, or feel unfriendly towards each other, and that may cause them to attack each other",
                    "vi": "một tình huống mà mọi người không tin tưởng lẫn nhau hoặc cảm thấy không thân thiện với nhau và điều đó có thể khiến họ tấn công lẫn nhau"
                },
                "examples": [
                    {
                        "en": "There is mounting tension along the border.",
                        "vi": "Có lực căng dọc theo biên giới."
                    },
                    {
                        "en": "international/racial/political tensions",
                        "vi": "căng thẳng quốc tế / chủng tộc / chính trị"
                    },
                    {
                        "en": "Family tensions and conflicts may lead to violence.",
                        "vi": "Những căng thẳng và xung đột trong gia đình có thể dẫn đến bạo lực."
                    },
                    {
                        "en": "tension between A and B The incident has further increased tension between the two countries.",
                        "vi": "căng thẳng giữa A và B Vụ việc càng làm gia tăng căng thẳng giữa hai nước."
                    }
                ]
            },
            {
                "define": {
                    "en": "a situation in which the fact that there are different needs or interests causes difficulties",
                    "vi": "một tình huống mà thực tế là có những nhu cầu hoặc sở thích khác nhau gây ra khó khăn"
                },
                "examples": [
                    {
                        "en": "There is often a tension between the aims of the company and the wishes of the employees.",
                        "vi": "Thường có sự căng thẳng giữa mục tiêu của công ty và mong muốn của nhân viên."
                    }
                ]
            },
            {
                "define": {
                    "en": "a feeling of worry and stress that makes it impossible to relax",
                    "vi": "cảm giác lo lắng và căng thẳng khiến bạn không thể thư giãn"
                },
                "examples": [
                    {
                        "en": "nervous tension",
                        "vi": "căng thẳng thần kinh"
                    },
                    {
                        "en": "We laughed and that helped ease the tension.",
                        "vi": "Chúng tôi đã cười và điều đó giúp giảm bớt căng thẳng."
                    },
                    {
                        "en": "Walking and swimming are excellent for releasing tension.",
                        "vi": "Đi bộ và bơi lội là cách tuyệt vời để giải tỏa căng thẳng."
                    },
                    {
                        "en": "a tension headache",
                        "vi": "đau đầu căng thẳng"
                    }
                ]
            },
            {
                "define": {
                    "en": "the feeling of fear and excitement that is created by a writer or a film director",
                    "vi": "cảm giác sợ hãi và phấn khích được tạo ra bởi một nhà văn hoặc một đạo diễn phim"
                },
                "examples": [
                    {
                        "en": "dramatic tension",
                        "vi": "căng thẳng kịch tính"
                    },
                    {
                        "en": "As the movie progresses the tension builds.",
                        "vi": "Khi bộ phim tiến triển, căng thẳng tăng lên."
                    }
                ]
            },
            {
                "define": {
                    "en": "the state of being stretched tight; the extent to which something is stretched tight",
                    "vi": "tình trạng bị kéo căng; mức độ mà một cái gì đó bị kéo căng"
                },
                "examples": [
                    {
                        "en": "muscular tension",
                        "vi": "căng cơ"
                    },
                    {
                        "en": "Adjust the string tension of your tennis racket to suit your style of playing.",
                        "vi": "Điều chỉnh độ căng dây của vợt tennis phù hợp với phong cách chơi của bạn."
                    },
                    {
                        "en": "When knitting, try to keep the same tension throughout.",
                        "vi": "Khi đan, cố gắng giữ nguyên độ căng trong suốt."
                    },
                    {
                        "en": "Massage can relieve tension in your shoulders and back.",
                        "vi": "Mát xa có thể làm giảm căng thẳng ở vai và lưng của bạn."
                    }
                ]
            }
        ]
    },
    {
        "id": "5e707a361a654c1d8082e8ed0f968a8b",
        "word": "villain",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈvɪlən/",
            "us": "/ˈvɪlən/"
        },
        "nearby": [
            {
                "word": "villager",
                "pos": "noun"
            },
            {
                "word": "The Village Voice",
                "pos": ""
            },
            {
                "word": "villain",
                "pos": "noun"
            },
            {
                "word": "villainous",
                "pos": "adjective"
            },
            {
                "word": "villainy",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the main bad character in a story, play, etc.",
                    "vi": "nhân vật xấu chính trong một câu chuyện, vở kịch, v.v."
                },
                "examples": [
                    {
                        "en": "He often plays the part of the villain.",
                        "vi": "Anh ấy thường đóng vai phản diện."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who is morally bad or responsible for causing trouble or harm",
                    "vi": "một người xấu về mặt đạo đức hoặc có trách nhiệm gây ra rắc rối hoặc tổn hại"
                },
                "examples": [
                    {
                        "en": "the heroes and villains of the 20th century",
                        "vi": "những anh hùng và nhân vật phản diện của thế kỷ 20"
                    },
                    {
                        "en": "Industrialized nations are the real environmental villains.",
                        "vi": "Các quốc gia công nghiệp hóa là những kẻ phản diện môi trường thực sự."
                    }
                ]
            },
            {
                "define": {
                    "en": "a criminal",
                    "vi": "một tên tội phạm"
                },
                "examples": [
                    {
                        "en": "The police still haven't caught the villain.",
                        "vi": "Cảnh sát vẫn chưa bắt được kẻ thủ ác."
                    }
                ]
            },
            {
                "define": {
                    "en": "the person or thing that is responsible for all the trouble in a situation",
                    "vi": "người hoặc vật chịu trách nhiệm cho tất cả các rắc rối trong một tình huống"
                },
                "examples": [
                    {
                        "en": "It’s hard to identify the real villain of the piece in this case.",
                        "vi": "Thật khó để xác định nhân vật phản diện thực sự của tác phẩm trong trường hợp này."
                    }
                ]
            }
        ]
    },
    {
        "id": "68665867a4e040aeba3e2ae75b17095e",
        "word": "act",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ækt/",
            "us": "/ækt/"
        },
        "nearby": [
            {
                "word": "acrylic",
                "pos": "noun"
            },
            {
                "word": "act",
                "pos": "verb"
            },
            {
                "word": "act",
                "pos": "noun"
            },
            {
                "word": "ACT",
                "pos": "abbreviation"
            },
            {
                "word": "act for",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a particular thing that somebody does",
                    "vi": "một điều cụ thể mà ai đó làm"
                },
                "examples": [
                    {
                        "en": "You have committed a serious criminal act.",
                        "vi": "Bạn đã thực hiện một hành vi tội phạm nghiêm trọng."
                    },
                    {
                        "en": "act of something an act of kindness",
                        "vi": "hành động một cái gì đó một hành động tử tế"
                    },
                    {
                        "en": "This was one of the most appalling acts of terror of recent times.",
                        "vi": "Đây là một trong những hành động khủng bố kinh hoàng nhất trong thời gian gần đây."
                    },
                    {
                        "en": "acts of terrorism/violence/aggression",
                        "vi": "hành động khủng bố / bạo lực / xâm lược"
                    },
                    {
                        "en": "They performed acts of great heroism.",
                        "vi": "Họ đã thực hiện những hành động của chủ nghĩa anh hùng tuyệt vời."
                    },
                    {
                        "en": "The murder was the act of a psychopath.",
                        "vi": "Vụ giết người là hành động của một kẻ tâm thần."
                    }
                ]
            },
            {
                "define": {
                    "en": "a law that has been passed by a parliament",
                    "vi": "một luật đã được quốc hội thông qua"
                },
                "examples": [
                    {
                        "en": "an Act of Congress/Parliament",
                        "vi": "một Đạo luật của Quốc hội / Nghị viện"
                    },
                    {
                        "en": "the Care Act 2014",
                        "vi": "Đạo luật Chăm sóc 2014"
                    },
                    {
                        "en": "to pass/repeal/amend an Act",
                        "vi": "để thông qua / bãi bỏ / sửa đổi một Đạo luật"
                    },
                    {
                        "en": "under an Act A Committee on Safety of Medicines was set up under the Act.",
                        "vi": "theo Đạo luật Một Ủy ban về An toàn Thuốc được thành lập theo Đạo luật."
                    }
                ]
            },
            {
                "define": {
                    "en": "a way of behaving that is not sincere but is intended to have a particular effect on others",
                    "vi": "một cách cư xử không chân thành nhưng nhằm gây ảnh hưởng cụ thể đến người khác"
                },
                "examples": [
                    {
                        "en": "Don't take her seriously—it's all an act.",
                        "vi": "Đừng coi cô ấy nghiêm túc — tất cả chỉ là một hành động."
                    },
                    {
                        "en": "You could tell she was just putting on an act.",
                        "vi": "Bạn có thể biết cô ấy chỉ đang diễn."
                    }
                ]
            },
            {
                "define": {
                    "en": "one of the main divisions of a play, an opera, etc.",
                    "vi": "một trong những bộ phận chính của một vở kịch, một vở opera, v.v."
                },
                "examples": [
                    {
                        "en": "a play in five acts",
                        "vi": "một vở kịch trong năm màn"
                    },
                    {
                        "en": "The hero dies in Act 5, Scene 3.",
                        "vi": "Người anh hùng chết trong Màn 5, Cảnh 3."
                    },
                    {
                        "en": "The king is killed in the opening act.",
                        "vi": "Nhà vua bị giết trong màn mở đầu."
                    }
                ]
            },
            {
                "define": {
                    "en": "a performance, especially one of several short pieces of entertainment in a show",
                    "vi": "một buổi biểu diễn, đặc biệt là một trong số vài phần giải trí ngắn trong một chương trình"
                },
                "examples": [
                    {
                        "en": "a circus/comedy/magic act",
                        "vi": "một vở xiếc / hài kịch / ảo thuật"
                    },
                    {
                        "en": "her one-woman poetry act",
                        "vi": "hành động thơ một người phụ nữ của cô ấy"
                    }
                ]
            },
            {
                "define": {
                    "en": "a performer or group of musicians",
                    "vi": "một nghệ sĩ biểu diễn hoặc một nhóm nhạc sĩ"
                },
                "examples": [
                    {
                        "en": "They were one of rock's most impressive live acts.",
                        "vi": "Họ là một trong những buổi biểu diễn trực tiếp ấn tượng nhất của rock."
                    }
                ]
            },
            {
                "define": {
                    "en": "an event caused by natural forces beyond human control, such as a storm, a flood or an earthquake",
                    "vi": "một sự kiện gây ra bởi các lực lượng tự nhiên ngoài tầm kiểm soát của con người, chẳng hạn như bão, lũ lụt hoặc động đất"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be/become involved in an activity that somebody else has started, especially to get something for yourself",
                    "vi": "tham gia / tham gia vào một hoạt động mà người khác đã bắt đầu, đặc biệt là để có được thứ gì đó cho chính bạn"
                },
                "examples": [
                    {
                        "en": "Other manufacturers are getting in on the act, creating their own versions of the popular toy.",
                        "vi": "Các nhà sản xuất khác đang vào cuộc, tạo ra các phiên bản đồ chơi phổ biến của riêng họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to start behaving in a moral or responsible way",
                    "vi": "để bắt đầu cư xử một cách có đạo đức hoặc có trách nhiệm"
                },
                "examples": [
                    {
                        "en": "He cleaned up his act and came off drugs.",
                        "vi": "Anh ta đã dọn dẹp hành vi của mình và bỏ ma túy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to go away or be impossible to find when people need or want you",
                    "vi": "đi xa hoặc không thể tìm thấy khi mọi người cần hoặc muốn bạn"
                },
                "examples": [
                    {
                        "en": "The cat had done a disappearing act.",
                        "vi": "Con mèo đã thực hiện một hành động biến mất."
                    }
                ]
            },
            {
                "define": {
                    "en": "to organize yourself and your activities in a more effective way in order to achieve something",
                    "vi": "tổ chức bản thân và các hoạt động của bạn theo cách hiệu quả hơn để đạt được điều gì đó"
                },
                "examples": [
                    {
                        "en": "He needs to get his act together if he's going to pass.",
                        "vi": "Anh ấy cần phải tập hợp lại hành động của mình nếu anh ấy sẽ vượt qua."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person or event that is so good or successful at something that it will be difficult for anyone/anything else coming after them to be as good or successful",
                    "vi": "một người hoặc một sự kiện quá tốt hoặc thành công ở một thứ gì đó mà sẽ khó cho bất kỳ ai / bất cứ điều gì khác sau họ trở nên tốt hoặc thành công"
                },
                "examples": [
                    {
                        "en": "She has been an excellent principal and will be a hard act to follow.",
                        "vi": "Cô ấy đã là một hiệu trưởng xuất sắc và sẽ là một hành động khó để noi theo."
                    },
                    {
                        "en": "Their contribution will prove a tough act to follow.",
                        "vi": "Sự đóng góp của họ sẽ chứng minh một hành động khó khăn để làm theo."
                    }
                ]
            },
            {
                "define": {
                    "en": "while you are doing something",
                    "vi": "trong khi bạn đang làm gì đó"
                },
                "examples": [
                    {
                        "en": "He was caught in the act of stealing a car.",
                        "vi": "Anh ta bị bắt quả tang khi đang thực hiện hành vi trộm xe."
                    },
                    {
                        "en": "It is often difficult to tell when someone is using drugs unless they are caught in the act.",
                        "vi": "Thường rất khó để biết ai đó đang sử dụng ma túy trừ khi họ bị bắt quả tang."
                    }
                ]
            },
            {
                "define": {
                    "en": "to tell somebody with force that they must not do something",
                    "vi": "buộc phải nói với ai đó rằng họ không được làm điều gì đó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "4e6d060b1cd340109d7cf81f2e1f693a",
        "word": "backstory",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈbækstɔːri/",
            "us": "/ˈbækstɔːri/"
        },
        "nearby": [
            {
                "word": "backstitch",
                "pos": "noun"
            },
            {
                "word": "backstop",
                "pos": "noun"
            },
            {
                "word": "backstory",
                "pos": "noun"
            },
            {
                "word": "backstreet",
                "pos": "noun"
            },
            {
                "word": "backstreet",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the things that are supposed to have happened to the characters in a film, novel, etc., before the film, etc. starts",
                    "vi": "những điều được cho là đã xảy ra với các nhân vật trong phim, tiểu thuyết, v.v., trước khi phim bắt đầu, v.v."
                },
                "examples": [
                    {
                        "en": "The film spends too long establishing the characters' backstories.",
                        "vi": "Bộ phim dành quá nhiều thời gian để thiết lập câu chuyện hậu trường của các nhân vật."
                    }
                ]
            },
            {
                "define": {
                    "en": "the background to a news story",
                    "vi": "nền của một câu chuyện tin tức"
                },
                "examples": [
                    {
                        "en": "First, some backstory:…",
                        "vi": "Đầu tiên, một số câu chuyện cơ bản:…"
                    }
                ]
            }
        ]
    },
    {
        "id": "6b0b72deac074d60a525d916fee05215",
        "word": "climax",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈklaɪmæks/",
            "us": "/ˈklaɪmæks/"
        },
        "nearby": [
            {
                "word": "climatologist",
                "pos": "noun"
            },
            {
                "word": "climatology",
                "pos": "noun"
            },
            {
                "word": "climax",
                "pos": "noun"
            },
            {
                "word": "climax",
                "pos": "verb"
            },
            {
                "word": "climb",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the most exciting or important event or point in time",
                    "vi": "sự kiện thú vị hoặc quan trọng nhất hoặc đúng thời điểm"
                },
                "examples": [
                    {
                        "en": "to come to/reach a climax",
                        "vi": "đi đến / đạt đến cao trào"
                    },
                    {
                        "en": "Signing the peace agreement was the climax of his political career.",
                        "vi": "Ký kết hiệp định hòa bình là đỉnh cao trong sự nghiệp chính trị của ông."
                    },
                    {
                        "en": "The team’s 3–1 victory in the final provided a fitting climax to a great season.",
                        "vi": "Chiến thắng 3–1 của đội trong trận chung kết đã tạo ra một đỉnh cao phù hợp cho một mùa giải tuyệt vời."
                    }
                ]
            },
            {
                "define": {
                    "en": "the most exciting part of a play, piece of music, etc. that usually happens near the end",
                    "vi": "phần thú vị nhất của một vở kịch, bản nhạc, v.v. thường xảy ra ở gần cuối"
                },
                "examples": [
                    {
                        "en": "The book’s powerful climax is the murder of Nancy by her lover Bill Sikes.",
                        "vi": "Đỉnh điểm mạnh mẽ của cuốn sách là vụ sát hại Nancy bởi người tình của cô là Bill Sikes."
                    }
                ]
            },
            {
                "define": {
                    "en": "the highest point of sexual pleasure",
                    "vi": "điểm cao nhất của khoái cảm tình dục"
                },
                "examples": [
                    {
                        "en": "She found it hard to achieve a/reach climax.",
                        "vi": "Cô ấy cảm thấy khó đạt được một / đạt đến cao trào."
                    }
                ]
            }
        ]
    },
    {
        "id": "a2e0e4597c7848b28d6fb35393f6187e",
        "word": "exit",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈeksɪt/",
            "us": "/ˈeksɪt/"
        },
        "nearby": [
            {
                "word": "existentialist",
                "pos": "adjective"
            },
            {
                "word": "existing",
                "pos": "adjective"
            },
            {
                "word": "exit",
                "pos": "noun"
            },
            {
                "word": "exit",
                "pos": "verb"
            },
            {
                "word": "exit exam",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a way out of a public building or vehicle",
                    "vi": "lối thoát ra khỏi tòa nhà hoặc phương tiện công cộng"
                },
                "examples": [
                    {
                        "en": "Where's the exit?",
                        "vi": "Lối ra ở đâu?"
                    },
                    {
                        "en": "There is a fire exit on each floor of the building.",
                        "vi": "Mỗi tầng của tòa nhà đều có lối thoát hiểm."
                    },
                    {
                        "en": "The emergency exit is at the back of the bus.",
                        "vi": "Lối thoát hiểm ở phía sau xe buýt."
                    }
                ]
            },
            {
                "define": {
                    "en": "a place where vehicles can leave a road to join another road",
                    "vi": "nơi mà các phương tiện có thể rời khỏi một con đường để tham gia vào một con đường khác"
                },
                "examples": [
                    {
                        "en": "Leave the roundabout at the second exit.",
                        "vi": "Rời khỏi bùng binh ở lối ra thứ hai."
                    },
                    {
                        "en": "Take the exit for Brno.",
                        "vi": "Đi theo lối ra cho Brno."
                    }
                ]
            },
            {
                "define": {
                    "en": "an act of leaving, especially of an actor from the stage",
                    "vi": "một hành động rời đi, đặc biệt là của một diễn viên từ sân khấu"
                },
                "examples": [
                    {
                        "en": "The heroine made her exit to great applause.",
                        "vi": "Nhân vật nữ chính đã xuất hiện trong tràng pháo tay lớn."
                    },
                    {
                        "en": "He made a quick exit to avoid meeting her.",
                        "vi": "Anh nhanh chóng thoát ra để tránh gặp cô."
                    }
                ]
            },
            {
                "define": {
                    "en": "the fact of leaving a particular situation or activity",
                    "vi": "thực tế là rời khỏi một tình huống hoặc hoạt động cụ thể"
                },
                "examples": [
                    {
                        "en": "exit from something They were disappointed by the team's early exit from the World Cup.",
                        "vi": "thoát khỏi điều gì đó Họ thất vọng trước việc đội bị loại sớm khỏi World Cup."
                    }
                ]
            }
        ]
    },
    {
        "id": "272b98bf19a74d369f58814d7bed5214",
        "word": "love interest",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈlʌv ɪntrəst/",
            "us": "/ˈlʌv ɪntrəst/"
        },
        "nearby": [
            {
                "word": "love-hate relationship",
                "pos": "noun"
            },
            {
                "word": "love-in",
                "pos": "noun"
            },
            {
                "word": "love interest",
                "pos": "noun"
            },
            {
                "word": "Richard Lovelace",
                "pos": ""
            },
            {
                "word": "loveless",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a character in a film or story who has a romantic role, often as the main character’s partner",
                    "vi": "một nhân vật trong phim hoặc truyện có vai trò lãng mạn, thường là bạn đời của nhân vật chính"
                },
                "examples": [
                    {
                        "en": "Emma Watson supplies the love interest in the film.",
                        "vi": "Emma Watson mang đến niềm yêu thích cho bộ phim."
                    }
                ]
            },
            {
                "define": {
                    "en": "a theme or part of the plot in a story or film that is mainly about love between two characters",
                    "vi": "chủ đề hoặc một phần của tình tiết trong một câu chuyện hoặc bộ phim chủ yếu nói về tình yêu giữa hai nhân vật"
                },
                "examples": [
                    {
                        "en": "The film is all action and violence and completely without love interest.",
                        "vi": "Bộ phim chỉ toàn là hành động và bạo lực và hoàn toàn không có tình yêu."
                    }
                ]
            }
        ]
    },
    {
        "id": "9054617a54ab4451bcfd60d25ddf68b6",
        "word": "narrate",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/nəˈreɪt/",
            "us": "/ˈnæreɪt/"
        },
        "nearby": [
            {
                "word": "narky",
                "pos": "adjective"
            },
            {
                "word": "Narnia",
                "pos": ""
            },
            {
                "word": "narrate",
                "pos": "verb"
            },
            {
                "word": "narration",
                "pos": "noun"
            },
            {
                "word": "narrative",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to tell a story",
                    "vi": "kể một câu chuyện"
                },
                "examples": [
                    {
                        "en": "She entertained them by narrating her adventures in Africa.",
                        "vi": "Cô giải trí cho họ bằng cách kể lại cuộc phiêu lưu của mình ở Châu Phi."
                    },
                    {
                        "en": "The story is narrated in flashback.",
                        "vi": "Câu chuyện được kể lại theo kiểu hồi tưởng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to speak the words that form the text of a documentary film or programme",
                    "vi": "để nói những từ tạo thành văn bản của một bộ phim hoặc chương trình tài liệu"
                },
                "examples": [
                    {
                        "en": "The film was narrated by Andrew Sachs.",
                        "vi": "Phim do Andrew Sachs thuyết minh."
                    }
                ]
            }
        ]
    },
    {
        "id": "21a333205534467f8c6de68c5bfba702",
        "word": "score",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/skɔː(r)/",
            "us": "/skɔːr/"
        },
        "nearby": [
            {
                "word": "scorch mark",
                "pos": "noun"
            },
            {
                "word": "score",
                "pos": "verb"
            },
            {
                "word": "score",
                "pos": "noun"
            },
            {
                "word": "scoreboard",
                "pos": "noun"
            },
            {
                "word": "scorecard",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the number of points, goals, etc. scored by each player or team in a game or competition",
                    "vi": "số điểm, số bàn thắng, v.v. được ghi bởi mỗi cầu thủ hoặc đội trong một trò chơi hoặc cuộc thi"
                },
                "examples": [
                    {
                        "en": "a high/low score",
                        "vi": "điểm cao / thấp"
                    },
                    {
                        "en": "What's the score now?",
                        "vi": "Điểm số bây giờ là bao nhiêu?"
                    },
                    {
                        "en": "The final score was 4–3.",
                        "vi": "Tỷ số cuối cùng là 4–3."
                    },
                    {
                        "en": "I’ll keep (the) score.",
                        "vi": "Tôi sẽ giữ (điểm)."
                    },
                    {
                        "en": "A penalty in the last minute of the game levelled the score 2–2.",
                        "vi": "Một quả phạt đền ở phút cuối cùng của trận đấu đã san bằng tỷ số 2–2."
                    }
                ]
            },
            {
                "define": {
                    "en": "the number of points somebody gets for correct answers in a test",
                    "vi": "số điểm ai đó nhận được cho các câu trả lời đúng trong một bài kiểm tra"
                },
                "examples": [
                    {
                        "en": "test scores",
                        "vi": "điểm kiểm tra"
                    },
                    {
                        "en": "an IQ score of 120",
                        "vi": "điểm IQ là 120"
                    },
                    {
                        "en": "a perfect score",
                        "vi": "một điểm hoàn hảo"
                    },
                    {
                        "en": "to get a high/low score",
                        "vi": "để đạt điểm cao / thấp"
                    },
                    {
                        "en": "This year, Jimmy's maths scores are slipping.",
                        "vi": "Năm nay, điểm môn toán của Jimmy đang tụt dốc."
                    },
                    {
                        "en": "The mean scores are as shown in Table 1.",
                        "vi": "Điểm trung bình được thể hiện trong Bảng 1."
                    },
                    {
                        "en": "Other factors did not significantly impact children's scores on these tests.",
                        "vi": "Các yếu tố khác không ảnh hưởng đáng kể đến điểm số của trẻ em trong các bài kiểm tra này."
                    }
                ]
            },
            {
                "define": {
                    "en": "a written or printed version of a piece of music showing what each instrument is to play or what each voice is to sing",
                    "vi": "bản viết hoặc bản in của một bản nhạc cho biết mỗi loại nhạc cụ sẽ chơi hoặc giọng hát của mỗi người"
                },
                "examples": [
                    {
                        "en": "an orchestral score",
                        "vi": "một điểm số của dàn nhạc"
                    },
                    {
                        "en": "the score of Verdi’s ‘Requiem’",
                        "vi": "điểm số của Verdi's 'Requiem'"
                    }
                ]
            },
            {
                "define": {
                    "en": "the music written for a film or play",
                    "vi": "âm nhạc được viết cho một bộ phim hoặc vở kịch"
                },
                "examples": [
                    {
                        "en": "an award for best original score",
                        "vi": "một giải thưởng cho điểm gốc tốt nhất"
                    },
                    {
                        "en": "The musical score is magnificent and the performances are outstanding.",
                        "vi": "Điểm âm nhạc là tuyệt vời và các màn trình diễn xuất sắc."
                    },
                    {
                        "en": "The score for the movie was composed by John Williams.",
                        "vi": "Phần nhạc cho phim do John Williams sáng tác."
                    }
                ]
            },
            {
                "define": {
                    "en": "a set or group of 20 or approximately 20",
                    "vi": "một tập hợp hoặc một nhóm 20 hoặc khoảng 20"
                },
                "examples": [
                    {
                        "en": "Several cabs and a score of cars were parked outside.",
                        "vi": "Một số xe taxi và một số ô tô đã đậu bên ngoài."
                    },
                    {
                        "en": "by the score Doyle's success brought imitators by the score (= very many imitators).",
                        "vi": "bởi điểm số Thành công của Doyle mang lại cho những kẻ bắt chước bằng điểm số (= rất nhiều người bắt chước)."
                    },
                    {
                        "en": "the biblical age of three score years and ten (= 70)",
                        "vi": "độ tuổi trong Kinh thánh là ba điểm năm và mười (= 70)"
                    }
                ]
            },
            {
                "define": {
                    "en": "very many",
                    "vi": "rất nhiều"
                },
                "examples": [
                    {
                        "en": "There were scores of boxes and crates, all waiting to be checked and loaded.",
                        "vi": "Có rất nhiều hộp và thùng, tất cả đang chờ được kiểm tra và tải."
                    }
                ]
            },
            {
                "define": {
                    "en": "a cut in a surface, made with a sharp tool",
                    "vi": "một vết cắt trên bề mặt, được thực hiện bằng một công cụ sắc bén"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the real facts about the present situation",
                    "vi": "sự thật thực tế về tình hình hiện tại"
                },
                "examples": [
                    {
                        "en": "What's the score?",
                        "vi": "Điểm số thế nào?"
                    },
                    {
                        "en": "You don't have to lie to me. I know the score.",
                        "vi": "Bạn không cần phải nói dối tôi. Tôi biết số điểm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to harm or punish somebody who has harmed or cheated you in the past",
                    "vi": "để làm hại hoặc trừng phạt ai đó đã làm hại hoặc lừa dối bạn trong quá khứ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "about that/this matter",
                    "vi": "về điều đó / vấn đề này"
                },
                "examples": [
                    {
                        "en": "You don't have to worry on that score.",
                        "vi": "Bạn không phải lo lắng về điểm số đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "to hurt or punish somebody who has harmed or cheated you in the past",
                    "vi": "để làm tổn thương hoặc trừng phạt ai đó đã làm hại hoặc lừa dối bạn trong quá khứ"
                },
                "examples": [
                    {
                        "en": "‘Who would do such a thing?’ ‘Maybe someone with an old score to settle.’",
                        "vi": "Ai sẽ làm một điều như vậy?' 'Có lẽ ai đó có số điểm cũ để giải quyết.'"
                    },
                    {
                        "en": "An embittered Charlotte is determined to settle accounts with Elizabeth.",
                        "vi": "Charlotte chán nản quyết tâm thanh toán các khoản với Elizabeth."
                    }
                ]
            }
        ]
    },
    {
        "id": "70692ec18b8442c895828d570ba55d56",
        "word": "twist",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/twɪst/",
            "us": "/twɪst/"
        },
        "nearby": [
            {
                "word": "twirl",
                "pos": "noun"
            },
            {
                "word": "twist",
                "pos": "verb"
            },
            {
                "word": "twist",
                "pos": "noun"
            },
            {
                "word": "twisted",
                "pos": "adjective"
            },
            {
                "word": "twister",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the action of turning something with your hand, or of turning a part of your body",
                    "vi": "hành động xoay vật gì đó bằng tay hoặc xoay một phần cơ thể của bạn"
                },
                "examples": [
                    {
                        "en": "She gave the lid another twist and it came off.",
                        "vi": "Cô ấy vặn nắp một lần nữa và nó bật ra."
                    },
                    {
                        "en": "He gave a shy smile and a little twist of his head.",
                        "vi": "Anh ta nở một nụ cười bẽn lẽn và hơi quay đầu lại."
                    },
                    {
                        "en": "He finished him off with a quick twist of the knife.",
                        "vi": "Anh ta kết liễu anh ta bằng một cú xoay con dao nhanh chóng."
                    }
                ]
            },
            {
                "define": {
                    "en": "an unexpected change or development in a story or situation",
                    "vi": "một sự thay đổi hoặc phát triển bất ngờ trong một câu chuyện hoặc tình huống"
                },
                "examples": [
                    {
                        "en": "the twists and turns of his political career",
                        "vi": "những khúc quanh trong sự nghiệp chính trị của anh ấy"
                    },
                    {
                        "en": "The story has taken another twist.",
                        "vi": "Câu chuyện đã có một bước ngoặt khác."
                    },
                    {
                        "en": "The disappearance of a vital witness added a new twist to the case.",
                        "vi": "Sự biến mất của một nhân chứng quan trọng đã thêm một bước ngoặt mới cho vụ án."
                    },
                    {
                        "en": "By a curious twist of fate we met again only a week or so later.",
                        "vi": "Bởi một sự xoay chuyển kỳ lạ của số phận, chúng tôi đã gặp lại nhau chỉ sau đó một tuần hoặc lâu hơn."
                    },
                    {
                        "en": "a bizarre twist to the tale",
                        "vi": "một bước ngoặt kỳ lạ đối với câu chuyện"
                    }
                ]
            },
            {
                "define": {
                    "en": "a sharp bend in a road or river",
                    "vi": "khúc cua gấp trên đường hoặc sông"
                },
                "examples": [
                    {
                        "en": "The car followed the twists and turns of the mountain road.",
                        "vi": "Chiếc xe chạy theo những khúc quanh ngoằn ngoèo của con đường núi."
                    },
                    {
                        "en": "They approached a twist in the path.",
                        "vi": "Họ đến gần một khúc quanh trên con đường."
                    }
                ]
            },
            {
                "define": {
                    "en": "a thing that has been twisted into a particular shape",
                    "vi": "một thứ đã được xoắn lại thành một hình dạng cụ thể"
                },
                "examples": [
                    {
                        "en": "mineral water with a twist of lemon",
                        "vi": "nước khoáng chanh"
                    }
                ]
            },
            {
                "define": {
                    "en": "a fast dance that was popular in the 1960s, in which you twist from side to side",
                    "vi": "một điệu nhảy nhanh phổ biến vào những năm 1960, trong đó bạn xoay người từ bên này sang bên kia"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to become angry, confused or upset",
                    "vi": "trở nên tức giận, bối rối hoặc khó chịu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "crazy",
                    "vi": "khùng"
                },
                "examples": [
                    {
                        "en": "She's gone completely round the twist.",
                        "vi": "Cô ấy đã hoàn toàn đi đúng hướng."
                    }
                ]
            }
        ]
    },
    {
        "id": "c0c167992a8c43b992c1ed6c33e865c0",
        "word": "voice-over",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈvɔɪs əʊvə(r)/",
            "us": "/ˈvɔɪs əʊvər/"
        },
        "nearby": [
            {
                "word": "voice message",
                "pos": "noun"
            },
            {
                "word": "the Voice of America",
                "pos": "noun"
            },
            {
                "word": "voice-over",
                "pos": "noun"
            },
            {
                "word": "voiceprint",
                "pos": "noun"
            },
            {
                "word": "voice recognition",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "information or comments in a film, television programme, etc. that are given by a person who is not seen on the screen",
                    "vi": "thông tin hoặc nhận xét trong một bộ phim, chương trình truyền hình, v.v. được đưa ra bởi một người không nhìn thấy trên màn hình"
                },
                "examples": [
                    {
                        "en": "She earns a lot of money doing voice-overs for TV commercials.",
                        "vi": "Cô ấy kiếm được rất nhiều tiền khi làm công việc lồng tiếng cho các quảng cáo trên TV."
                    }
                ]
            }
        ]
    },
    {
        "id": "a9b5e2a66593402a97ff52d80a63796c",
        "word": "allegory",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈæləɡəri/",
            "us": "/ˈæləɡɔːri/"
        },
        "nearby": [
            {
                "word": "allegorical",
                "pos": "adjective"
            },
            {
                "word": "allegorically",
                "pos": "adverb"
            },
            {
                "word": "allegory",
                "pos": "noun"
            },
            {
                "word": "allegro",
                "pos": "adverb"
            },
            {
                "word": "allegro",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a story, play, picture, etc. in which each character or event is a symbol representing an idea or a quality, such as truth, evil, death, etc.; the use of such symbols",
                    "vi": "một câu chuyện, vở kịch, bức tranh, v.v. trong đó mỗi nhân vật hoặc sự kiện là một biểu tượng đại diện cho một ý tưởng hoặc một phẩm chất, chẳng hạn như sự thật, cái ác, cái chết, v.v.; việc sử dụng các ký hiệu như vậy"
                },
                "examples": [
                    {
                        "en": "a political allegory",
                        "vi": "một câu chuyện ngụ ngôn chính trị"
                    },
                    {
                        "en": "the poet’s use of allegory",
                        "vi": "việc sử dụng truyện ngụ ngôn của nhà thơ"
                    }
                ]
            }
        ]
    },
    {
        "id": "422a22874e4743dab47812e694553a75",
        "word": "aside",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/əˈsaɪd/",
            "us": "/əˈsaɪd/"
        },
        "nearby": [
            {
                "word": "Asiatic",
                "pos": "adjective"
            },
            {
                "word": "aside",
                "pos": "adverb"
            },
            {
                "word": "aside",
                "pos": "noun"
            },
            {
                "word": "A-side",
                "pos": "noun"
            },
            {
                "word": "aside from",
                "pos": "preposition"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "something that a character in a play says to the audience, but that the other characters on stage are not intended to hear",
                    "vi": "điều gì đó mà một nhân vật trong vở kịch nói với khán giả, nhưng các nhân vật khác trên sân khấu không muốn nghe"
                },
                "examples": [
                    {
                        "en": "Shakespeare’s use of asides and soliloquies",
                        "vi": "Shakespeare sử dụng asides và soliloquies"
                    }
                ]
            },
            {
                "define": {
                    "en": "a remark, often made in a low voice, that is not intended to be heard by everyone present",
                    "vi": "một nhận xét, thường được đưa ra bằng một giọng trầm, không nhằm để mọi người có mặt nghe thấy"
                },
                "examples": [
                    {
                        "en": "He made several mocking asides about the inadequacy of women.",
                        "vi": "Anh ta đưa ra một số mặt chế giễu về sự kém cỏi của phụ nữ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a remark that is not directly connected with the main subject that is being discussed",
                    "vi": "một nhận xét không được kết nối trực tiếp với chủ đề chính đang được thảo luận"
                },
                "examples": [
                    {
                        "en": "I mention it only as an aside.",
                        "vi": "Tôi đề cập đến nó chỉ như một bên."
                    }
                ]
            }
        ]
    },
    {
        "id": "6cc8c8fc4bc746ff9b835eb5d473449b",
        "word": "baddy",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbædi/",
            "us": "/ˈbædi/"
        },
        "nearby": [
            {
                "word": "bad breath",
                "pos": "noun"
            },
            {
                "word": "bad debt",
                "pos": "noun"
            },
            {
                "word": "baddy",
                "pos": "noun"
            },
            {
                "word": "bade",
                "pos": "verb"
            },
            {
                "word": "Lord Baden-Powell",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a bad or evil character in a film, book, play, etc.",
                    "vi": "một nhân vật xấu hoặc ác trong phim, sách, vở kịch, v.v."
                },
                "examples": [
                    {
                        "en": "As usual, the cops get the baddies in the end.",
                        "vi": "Như thường lệ, cuối cùng cảnh sát cũng lấy được baddies."
                    }
                ]
            }
        ]
    },
    {
        "id": "576e0a593efa496ab0ff921c7debc603",
        "word": "coup de théâtre",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌkuː də teɪˈɑːtrə/",
            "us": "/ˌkuː də teɪˈɑːtrə/"
        },
        "nearby": [
            {
                "word": "coup de grâce",
                "pos": "noun"
            },
            {
                "word": "coup d'état",
                "pos": "noun"
            },
            {
                "word": "coup de théâtre",
                "pos": "noun"
            },
            {
                "word": "coupé",
                "pos": "noun"
            },
            {
                "word": "couple",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "something very dramatic and surprising that happens, especially in a play",
                    "vi": "điều gì đó rất kịch tính và đáng ngạc nhiên xảy ra, đặc biệt là trong một vở kịch"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a play, show, etc. which is very successful",
                    "vi": "một vở kịch, chương trình, v.v. rất thành công"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a4885ab0af854e398c2d5d3812748164",
        "word": "denouement",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌdeɪˈnuːmɒ̃/",
            "us": "/ˌdeɪnuːˈmɑ̃ː/"
        },
        "nearby": [
            {
                "word": "denotational",
                "pos": "adjective"
            },
            {
                "word": "denote",
                "pos": "verb"
            },
            {
                "word": "denouement",
                "pos": "noun"
            },
            {
                "word": "denounce",
                "pos": "verb"
            },
            {
                "word": "dense",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the end of a play, book, etc., in which everything is explained or settled; the end result of a situation",
                    "vi": "phần cuối của một vở kịch, cuốn sách, v.v., trong đó mọi thứ được giải thích hoặc giải quyết; kết quả cuối cùng của một tình huống"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "890cd410a64841d993be20dd129fcccf",
        "word": "dramatic irony",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/drəˌmætɪk ˈaɪrəni/",
            "us": "/drəˌmætɪk ˈaɪrəni/"
        },
        "nearby": [
            {
                "word": "dramatic",
                "pos": "adjective"
            },
            {
                "word": "dramatically",
                "pos": "adverb"
            },
            {
                "word": "dramatic irony",
                "pos": "noun"
            },
            {
                "word": "dramatic monologue",
                "pos": "noun"
            },
            {
                "word": "dramatics",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a situation in a play when a character’s words carry an extra meaning to the audience because they know more than the character, especially about what is going to happen",
                    "vi": "một tình huống trong vở kịch khi lời nói của nhân vật mang thêm ý nghĩa đối với khán giả vì họ biết nhiều hơn nhân vật, đặc biệt là về những gì sắp xảy ra"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "903c654b08dd45b0951653bde4c1b855",
        "word": "dramatis personae",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌdræmətɪs pəˈsəʊnaɪ/",
            "us": "/ˌdræmətɪs pərˈsəʊni/"
        },
        "nearby": [
            {
                "word": "dramatic monologue",
                "pos": "noun"
            },
            {
                "word": "dramatics",
                "pos": "noun"
            },
            {
                "word": "dramatis personae",
                "pos": "noun"
            },
            {
                "word": "dramatist",
                "pos": "noun"
            },
            {
                "word": "dramatization",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "all the characters in a play in the theatre",
                    "vi": "tất cả các nhân vật trong một vở kịch trong rạp hát"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "23e1fa93d9f44347902eacbdcbb80233",
        "word": "epilogue",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈepɪlɒɡ/",
            "us": "/ˈepɪlɔːɡ/"
        },
        "nearby": [
            {
                "word": "epileptic",
                "pos": "noun"
            },
            {
                "word": "epileptic",
                "pos": "adjective"
            },
            {
                "word": "epilogue",
                "pos": "noun"
            },
            {
                "word": "epinephrine",
                "pos": "noun"
            },
            {
                "word": "EpiPen",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a speech, etc. at the end of a play, book, or film that comments on or acts as a conclusion to what has happened",
                    "vi": "một bài phát biểu, v.v. ở cuối vở kịch, cuốn sách hoặc bộ phim nhận xét hoặc đóng vai trò như một kết luận cho những gì đã xảy ra"
                },
                "examples": [
                    {
                        "en": "Fortinbras speaks the epilogue in Shakespeare’s ‘Hamlet’.",
                        "vi": "Fortinbras nói phần kết trong 'Hamlet' của Shakespeare."
                    }
                ]
            }
        ]
    },
    {
        "id": "59b3c09c2ce84e2c924e54403b31575b",
        "word": "flashback",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈflæʃbæk/",
            "us": "/ˈflæʃbæk/"
        },
        "nearby": [
            {
                "word": "flash around",
                "pos": "phrasal verb"
            },
            {
                "word": "flash back",
                "pos": "phrasal verb"
            },
            {
                "word": "flashback",
                "pos": "noun"
            },
            {
                "word": "flashbulb",
                "pos": "noun"
            },
            {
                "word": "flash by",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a part of a film, play, etc. that shows a scene that happened earlier in time than the main story",
                    "vi": "một phần của phim, vở kịch, v.v. có cảnh diễn ra sớm hơn câu chuyện chính"
                },
                "examples": [
                    {
                        "en": "The events that led up to the murder were shown in a series of flashbacks.",
                        "vi": "Các sự kiện dẫn đến vụ giết người được thể hiện trong một chuỗi hồi tưởng."
                    },
                    {
                        "en": "The reader is told the story in flashback.",
                        "vi": "Người đọc được kể câu chuyện trong hồi tưởng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a sudden, very clear, strong memory of something that happened in the past that is so real you feel that you are living through the experience again",
                    "vi": "một ký ức đột ngột, rất rõ ràng, mạnh mẽ về một điều gì đó đã xảy ra trong quá khứ rất chân thực đến mức bạn cảm thấy rằng bạn đang sống qua trải nghiệm một lần nữa"
                },
                "examples": [
                    {
                        "en": "war veterans suffering from nightmares and flashbacks",
                        "vi": "những cựu chiến binh bị ác mộng và hồi tưởng"
                    }
                ]
            }
        ]
    },
    {
        "id": "124d181051284e81a73bca35db8d5ec7",
        "word": "fourth wall",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌfɔːθ ˈwɔːl/",
            "us": "/ˌfɔːrθ ˈwɔːl/"
        },
        "nearby": [
            {
                "word": "fourth official",
                "pos": "noun"
            },
            {
                "word": "the Fourth of July",
                "pos": "noun"
            },
            {
                "word": "fourth wall",
                "pos": "noun"
            },
            {
                "word": "four-way stop",
                "pos": "noun"
            },
            {
                "word": "Four Weddings and a Funeral",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the imaginary barrier that separates the characters in a work of fiction from the people who are watching or reading the story they are in",
                    "vi": "rào cản tưởng tượng ngăn cách các nhân vật trong một tác phẩm hư cấu với những người đang xem hoặc đọc câu chuyện mà họ tham gia"
                },
                "examples": [
                    {
                        "en": "The actors break the fourth wall and talk directly to the audience.",
                        "vi": "Các diễn viên phá vỡ bức tường thứ tư và nói chuyện trực tiếp với khán giả."
                    }
                ]
            }
        ]
    },
    {
        "id": "e3ff50212e6044b98dca06b1598c7e6b",
        "word": "goodie",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɡʊdi/",
            "us": "/ˈɡʊdi/"
        },
        "nearby": [
            {
                "word": "good-humoured",
                "pos": "adjective"
            },
            {
                "word": "good-humouredly",
                "pos": "adverb"
            },
            {
                "word": "goodie",
                "pos": "noun"
            },
            {
                "word": "goodish",
                "pos": "adjective"
            },
            {
                "word": "Good King Wenceslas",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a thing that is very nice to eat",
                    "vi": "một thứ rất ngon để ăn"
                },
                "examples": [
                    {
                        "en": "a basket of goodies for the children",
                        "vi": "một giỏ quà cho trẻ em"
                    }
                ]
            },
            {
                "define": {
                    "en": "anything that is attractive and that people want to have",
                    "vi": "bất cứ thứ gì hấp dẫn và mọi người muốn có"
                },
                "examples": [
                    {
                        "en": "We're giving away lots of free goodies—T-shirts, hats and posters!",
                        "vi": "Chúng tôi đang tặng rất nhiều quà tặng miễn phí — áo phông, mũ và áp phích!"
                    }
                ]
            },
            {
                "define": {
                    "en": "a good person, especially in a book or film",
                    "vi": "một người tốt, đặc biệt là trong một cuốn sách hoặc bộ phim"
                },
                "examples": [
                    {
                        "en": "It's sometimes difficult to tell who are the goodies and who are the baddies.",
                        "vi": "Đôi khi rất khó để phân biệt ai là thiện và ai là xấu."
                    }
                ]
            }
        ]
    },
    {
        "id": "3cc851227df84245a08a05d2d01f817c",
        "word": "goody",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɡʊdi/",
            "us": "/ˈɡʊdi/"
        },
        "nearby": [
            {
                "word": "Goodwin Sands",
                "pos": ""
            },
            {
                "word": "Goodwood House",
                "pos": ""
            },
            {
                "word": "goody",
                "pos": "noun"
            },
            {
                "word": "goody",
                "pos": "exclamation"
            },
            {
                "word": "goody bag",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a thing that is very nice to eat",
                    "vi": "một thứ rất ngon để ăn"
                },
                "examples": [
                    {
                        "en": "a basket of goodies for the children",
                        "vi": "một giỏ quà cho trẻ em"
                    }
                ]
            },
            {
                "define": {
                    "en": "anything that is attractive and that people want to have",
                    "vi": "bất cứ thứ gì hấp dẫn và mọi người muốn có"
                },
                "examples": [
                    {
                        "en": "We're giving away lots of free goodies—T-shirts, hats and posters!",
                        "vi": "Chúng tôi đang tặng rất nhiều quà tặng miễn phí — áo phông, mũ và áp phích!"
                    }
                ]
            },
            {
                "define": {
                    "en": "a good person, especially in a book or film",
                    "vi": "một người tốt, đặc biệt là trong một cuốn sách hoặc bộ phim"
                },
                "examples": [
                    {
                        "en": "It's sometimes difficult to tell who are the goodies and who are the baddies.",
                        "vi": "Đôi khi rất khó để phân biệt ai là thiện và ai là xấu."
                    }
                ]
            }
        ]
    },
    {
        "id": "00a11516ce03407b9688372bc31a24a9",
        "word": "Hollywood ending",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌhɒliwʊd ˈendɪŋ/",
            "us": "/ˌhɑːliwʊd ˈendɪŋ/"
        },
        "nearby": [
            {
                "word": "Hollywood",
                "pos": "noun"
            },
            {
                "word": "the Hollywood Bowl",
                "pos": ""
            },
            {
                "word": "Hollywood ending",
                "pos": "noun"
            },
            {
                "word": "Oliver Wendell Holmes",
                "pos": ""
            },
            {
                "word": "Sherlock Holmes",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an ending in a film, novel, etc. that happens in the way you expect, is full of exaggerated happiness or love, and may not be very realistic",
                    "vi": "một kết thúc trong một bộ phim, tiểu thuyết, v.v. xảy ra theo cách bạn mong đợi, tràn ngập hạnh phúc hoặc tình yêu cường điệu và có thể không thực tế lắm"
                },
                "examples": [
                    {
                        "en": "The film refuses to sell out and provide a Hollywood ending.",
                        "vi": "Bộ phim từ chối bán hết vé và đưa ra một cái kết đậm chất Hollywood."
                    },
                    {
                        "en": "Those expecting a big, happy Hollywood ending (a backlit kiss for example) may be disappointed.",
                        "vi": "Những người mong đợi một cái kết Hollywood vui vẻ và lớn (một nụ hôn ngược sáng chẳng hạn) có thể thất vọng."
                    }
                ]
            }
        ]
    },
    {
        "id": "265bc25f30404d8fb361fb077414d59e",
        "word": "interlude",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɪntəluːd/",
            "us": "/ˈɪntərluːd/"
        },
        "nearby": [
            {
                "word": "interlocutor",
                "pos": "noun"
            },
            {
                "word": "interloper",
                "pos": "noun"
            },
            {
                "word": "interlude",
                "pos": "noun"
            },
            {
                "word": "intermarriage",
                "pos": "noun"
            },
            {
                "word": "intermarry",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a period of time between two events during which something different happens",
                    "vi": "một khoảng thời gian giữa hai sự kiện trong đó điều gì đó khác nhau xảy ra"
                },
                "examples": [
                    {
                        "en": "a romantic interlude (= a short romantic relationship)",
                        "vi": "một đoạn kết lãng mạn (= một mối quan hệ lãng mạn ngắn ngủi)"
                    },
                    {
                        "en": "Apart from a brief interlude of peace, the war lasted nine years.",
                        "vi": "Ngoài một giai đoạn hòa bình ngắn ngủi, cuộc chiến kéo dài chín năm."
                    }
                ]
            },
            {
                "define": {
                    "en": "a short period of time between the parts of a play, film, etc.",
                    "vi": "một khoảng thời gian ngắn giữa các phần của vở kịch, bộ phim, v.v."
                },
                "examples": [
                    {
                        "en": "There will now be a short interlude.",
                        "vi": "Bây giờ sẽ có một đoạn kết ngắn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a short piece of music or a talk, etc. played or given between the parts of a play or film or between other pieces of music",
                    "vi": "một đoạn nhạc ngắn hoặc một bài nói chuyện, v.v. được phát hoặc đưa ra giữa các phần của vở kịch hoặc bộ phim hoặc giữa các đoạn nhạc khác"
                },
                "examples": [
                    {
                        "en": "a musical interlude between two the acts of the play",
                        "vi": "một đoạn nhạc xen kẽ giữa hai hành động của vở kịch"
                    },
                    {
                        "en": "The album includes short instrumental interludes between the songs.",
                        "vi": "Album bao gồm các đoạn nhạc cụ ngắn xen kẽ giữa các bài hát."
                    }
                ]
            }
        ]
    },
    {
        "id": "55de0654ad4e4401907f5672676af069",
        "word": "intermission",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌɪntəˈmɪʃn/",
            "us": "/ˌɪntərˈmɪʃn/"
        },
        "nearby": [
            {
                "word": "interminably",
                "pos": "adverb"
            },
            {
                "word": "intermingle",
                "pos": "verb"
            },
            {
                "word": "intermission",
                "pos": "noun"
            },
            {
                "word": "intermittent",
                "pos": "adjective"
            },
            {
                "word": "intermittently",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a short period of time between the parts of a play, film, etc.",
                    "vi": "một khoảng thời gian ngắn giữa các phần của vở kịch, bộ phim, v.v."
                },
                "examples": [
                    {
                        "en": "Coffee was served during the intermission.",
                        "vi": "Cà phê đã được phục vụ trong thời gian tạm nghỉ."
                    },
                    {
                        "en": "(North American English) After intermission, the second band played.",
                        "vi": "(Tiếng Anh Bắc Mỹ) Sau khi tạm nghỉ, ban nhạc thứ hai chơi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a period of time during which something stops before continuing again",
                    "vi": "một khoảng thời gian mà trong đó điều gì đó dừng lại trước khi tiếp tục trở lại"
                },
                "examples": [
                    {
                        "en": "This state of affairs lasted without intermission for a hundred years.",
                        "vi": "Tình trạng này kéo dài không ngừng trong một trăm năm."
                    }
                ]
            }
        ]
    },
    {
        "id": "12ad9dae35354629adfed2e72b3c3c85",
        "word": "meta",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmetə/",
            "us": "/ˈmetə/"
        },
        "nearby": [
            {
                "word": "Met",
                "pos": "abbreviation"
            },
            {
                "word": "the Met",
                "pos": "noun"
            },
            {
                "word": "meta",
                "pos": "adjective"
            },
            {
                "word": "meta-",
                "pos": "combining form"
            },
            {
                "word": "meta-analysis",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "showing awareness of itself or its genre",
                    "vi": "thể hiện nhận thức về bản thân hoặc thể loại của nó"
                },
                "examples": [
                    {
                        "en": "The current season relies on running jokes and meta references to the show's history.",
                        "vi": "Phần hiện tại dựa trên các câu chuyện cười đang chạy và tham chiếu meta đến lịch sử của chương trình."
                    }
                ]
            }
        ]
    },
    {
        "id": "87248c503ca74720a2fd2d65b7408f15",
        "word": "monologue",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmɒnəlɒɡ/",
            "us": "/ˈmɑːnəlɔːɡ/"
        },
        "nearby": [
            {
                "word": "monolith",
                "pos": "noun"
            },
            {
                "word": "monolithic",
                "pos": "adjective"
            },
            {
                "word": "monologue",
                "pos": "noun"
            },
            {
                "word": "monomania",
                "pos": "noun"
            },
            {
                "word": "monomer",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a long speech by one person during a conversation that stops other people from speaking or expressing an opinion",
                    "vi": "một bài phát biểu dài của một người trong cuộc trò chuyện khiến người khác không thể phát biểu hoặc bày tỏ ý kiến"
                },
                "examples": [
                    {
                        "en": "He went into a long monologue about life in America.",
                        "vi": "Anh ấy đã đi vào một đoạn độc thoại dài về cuộc sống ở Mỹ."
                    },
                    {
                        "en": "She launched into a long monologue about how wonderful the company was.",
                        "vi": "Cô ấy bắt đầu một đoạn độc thoại dài về công ty tuyệt vời như thế nào."
                    }
                ]
            },
            {
                "define": {
                    "en": "a long speech in a play, film, etc. spoken by one actor, especially when alone",
                    "vi": "một bài phát biểu dài trong một vở kịch, bộ phim, v.v. do một diễn viên nói, đặc biệt là khi ở một mình"
                },
                "examples": [
                    {
                        "en": "She delivered her monologue in a deadpan voice.",
                        "vi": "Cô độc thoại bằng một giọng cụt ngủn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a dramatic story, especially in verse, told or performed by one person",
                    "vi": "một câu chuyện kịch tính, đặc biệt là ở dạng câu thơ, do một người kể hoặc trình diễn"
                },
                "examples": [
                    {
                        "en": "an entertainer who does comic monologues",
                        "vi": "một nghệ sĩ giải trí độc thoại truyện tranh"
                    }
                ]
            }
        ]
    },
    {
        "id": "64a483d3923f4996844bb7026be4ec40",
        "word": "production number",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/prəˈdʌkʃn nʌmbə(r)/",
            "us": "/prəˈdʌkʃn nʌmbər/"
        },
        "nearby": [
            {
                "word": "production",
                "pos": "noun"
            },
            {
                "word": "production line",
                "pos": "noun"
            },
            {
                "word": "production number",
                "pos": "noun"
            },
            {
                "word": "production values",
                "pos": "noun"
            },
            {
                "word": "productive",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a scene in a musical play or a film where a lot of people sing and dance",
                    "vi": "một cảnh trong vở nhạc kịch hoặc một bộ phim có nhiều người hát và nhảy"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "9e3f2fa6015d4a70a2bbd04d0763944e",
        "word": "prologue",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈprəʊlɒɡ/",
            "us": "/ˈprəʊlɔːɡ/"
        },
        "nearby": [
            {
                "word": "prolix",
                "pos": "adjective"
            },
            {
                "word": "prolixity",
                "pos": "noun"
            },
            {
                "word": "prologue",
                "pos": "noun"
            },
            {
                "word": "prolong",
                "pos": "verb"
            },
            {
                "word": "prolongation",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a speech, etc. at the beginning of a play, book or film that introduces it",
                    "vi": "một bài phát biểu, v.v. ở đầu vở kịch, cuốn sách hoặc bộ phim giới thiệu nó"
                },
                "examples": [
                    {
                        "en": "the Prologue to Chaucer’s ‘Canterbury Tales’",
                        "vi": "phần mở đầu cho 'Canterbury Tales' của Chaucer"
                    }
                ]
            }
        ]
    },
    {
        "id": "c816142a04154050b5eac83b2638b58f",
        "word": "protagonist",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/prəˈtæɡənɪst/",
            "us": "/prəˈtæɡənɪst/"
        },
        "nearby": [
            {
                "word": "prostration",
                "pos": "noun"
            },
            {
                "word": "protactinium",
                "pos": "noun"
            },
            {
                "word": "protagonist",
                "pos": "noun"
            },
            {
                "word": "protea",
                "pos": "noun"
            },
            {
                "word": "protean",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the main character in a play, film or book",
                    "vi": "nhân vật chính trong một vở kịch, bộ phim hoặc cuốn sách"
                },
                "examples": [
                    {
                        "en": "The main protagonist is a cruel, selfish man.",
                        "vi": "Nhân vật chính là một người đàn ông tàn nhẫn, ích kỷ."
                    },
                    {
                        "en": "At that time, films rarely had a woman as the main protagonist.",
                        "vi": "Vào thời điểm đó, các bộ phim hiếm khi có một người phụ nữ làm nhân vật chính."
                    },
                    {
                        "en": "Bohi Di, first person narrator and protagonist of the novel",
                        "vi": "Bohi Di, người kể chuyện ngôi thứ nhất và là nhân vật chính của cuốn tiểu thuyết"
                    },
                    {
                        "en": "Oliver Twist, the young protagonist",
                        "vi": "Oliver Twist, nhân vật chính trẻ tuổi"
                    }
                ]
            },
            {
                "define": {
                    "en": "one of the main people in a real event, especially a competition, battle or struggle",
                    "vi": "một trong những người chính trong một sự kiện thực tế, đặc biệt là một cuộc thi, trận chiến hoặc cuộc đấu tranh"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "an active supporter of a policy or movement, especially one that is trying to change something",
                    "vi": "một người ủng hộ tích cực cho một chính sách hoặc phong trào, đặc biệt là một người đang cố gắng thay đổi điều gì đó"
                },
                "examples": [
                    {
                        "en": "a leading protagonist of the conservation movement",
                        "vi": "một nhân vật chính hàng đầu của phong trào bảo tồn"
                    }
                ]
            }
        ]
    },
    {
        "id": "d2a8209e53bf40f2a467f17b0f586566",
        "word": "soliloquy",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/səˈlɪləkwi/",
            "us": "/səˈlɪləkwi/"
        },
        "nearby": [
            {
                "word": "solid-state",
                "pos": "adjective"
            },
            {
                "word": "soliloquize",
                "pos": "verb"
            },
            {
                "word": "soliloquy",
                "pos": "noun"
            },
            {
                "word": "solipsism",
                "pos": "noun"
            },
            {
                "word": "solipsistic",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a speech in a play in which a character, who is alone on the stage, speaks his or her thoughts; the act of speaking thoughts in this way",
                    "vi": "một bài diễn thuyết trong một vở kịch, trong đó một nhân vật ở một mình trên sân khấu, nói lên suy nghĩ của mình; hành động nói lên suy nghĩ theo cách này"
                },
                "examples": [
                    {
                        "en": "Hamlet’s famous soliloquy, ‘To be or not to be…’",
                        "vi": "Bài soliloquy nổi tiếng của Hamlet, 'Trở thành hay không trở thành ...'"
                    },
                    {
                        "en": "the playwright’s use of soliloquy",
                        "vi": "việc sử dụng soliloquy của nhà viết kịch"
                    }
                ]
            }
        ]
    },
    {
        "id": "140d1486bc7b48a1bb909cff9741016c",
        "word": "subplot",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsʌbplɒt/",
            "us": "/ˈsʌbplɑːt/"
        },
        "nearby": [
            {
                "word": "suborn",
                "pos": "verb"
            },
            {
                "word": "subpar",
                "pos": "adjective"
            },
            {
                "word": "subplot",
                "pos": "noun"
            },
            {
                "word": "subpoena",
                "pos": "noun"
            },
            {
                "word": "subpoena",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a series of events in a play, novel, etc. that is separate from but linked to the main story",
                    "vi": "một loạt các sự kiện trong một vở kịch, tiểu thuyết, v.v. tách biệt nhưng được liên kết với câu chuyện chính"
                },
                "examples": []
            }
        ]
    }
]