[
    {
        "id": "0d02a8f5951e4914afc530dbb0e1f0f4",
        "word": "art",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/ɑːt/",
            "us": "/ɑːrt/"
        },
        "nearby": [
            {
                "word": "arson",
                "pos": "noun"
            },
            {
                "word": "arsonist",
                "pos": "noun"
            },
            {
                "word": "art",
                "pos": "noun"
            },
            {
                "word": "art",
                "pos": "verb"
            },
            {
                "word": "Art",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the use of the imagination to express ideas or feelings, particularly in painting, drawing or sculpture",
                    "vi": "việc sử dụng trí tưởng tượng để thể hiện ý tưởng hoặc cảm xúc, đặc biệt là trong hội họa, vẽ hoặc điêu khắc"
                },
                "examples": [
                    {
                        "en": "modern/contemporary art",
                        "vi": "nghệ thuật hiện đại / đương đại"
                    },
                    {
                        "en": "an art critic/historian/lover",
                        "vi": "một nhà phê bình nghệ thuật / nhà sử học / người yêu"
                    },
                    {
                        "en": "Can we call television art?",
                        "vi": "Có thể gọi là nghệ thuật truyền hình không?"
                    },
                    {
                        "en": "stolen works of art",
                        "vi": "tác phẩm nghệ thuật bị đánh cắp"
                    },
                    {
                        "en": "Her performance displayed great art.",
                        "vi": "Màn biểu diễn của cô ấy thể hiện nghệ thuật tuyệt vời."
                    },
                    {
                        "en": "American art",
                        "vi": "Nghệ thuật mỹ"
                    },
                    {
                        "en": "It's a very beautiful piece of art.",
                        "vi": "Đó là một tác phẩm nghệ thuật rất đẹp."
                    }
                ]
            },
            {
                "define": {
                    "en": "examples of objects such as paintings, drawings or sculptures",
                    "vi": "ví dụ về các đối tượng như tranh vẽ, bản vẽ hoặc tác phẩm điêu khắc"
                },
                "examples": [
                    {
                        "en": "an art gallery/exhibition",
                        "vi": "một phòng trưng bày / triển lãm nghệ thuật"
                    },
                    {
                        "en": "a collection of art and antiques",
                        "vi": "một bộ sưu tập nghệ thuật và đồ cổ"
                    }
                ]
            },
            {
                "define": {
                    "en": "the skill of creating objects such as paintings and drawings, especially when you study it",
                    "vi": "kỹ năng tạo ra các đối tượng như tranh vẽ và bản vẽ, đặc biệt là khi bạn học nó"
                },
                "examples": [
                    {
                        "en": "She's good at art and design.",
                        "vi": "Cô ấy giỏi nghệ thuật và thiết kế."
                    },
                    {
                        "en": "He has a master's degree in fine art.",
                        "vi": "Anh ấy có bằng thạc sĩ mỹ thuật."
                    },
                    {
                        "en": "an art teacher/student/college/class",
                        "vi": "một giáo viên nghệ thuật / sinh viên / đại học / lớp học"
                    }
                ]
            },
            {
                "define": {
                    "en": "art, music, theatre, literature, etc. when you think of them as a group",
                    "vi": "nghệ thuật, âm nhạc, sân khấu, văn học, v.v. khi bạn coi họ là một nhóm"
                },
                "examples": [
                    {
                        "en": "lottery funding for the arts",
                        "vi": "xổ số tài trợ cho nghệ thuật"
                    },
                    {
                        "en": "What is the relationship between the visual arts and music?",
                        "vi": "Mối quan hệ giữa nghệ thuật thị giác và âm nhạc là gì?"
                    }
                ]
            },
            {
                "define": {
                    "en": "a type of visual or performing art",
                    "vi": "một loại hình nghệ thuật biểu diễn hoặc thị giác"
                },
                "examples": [
                    {
                        "en": "an exhibition of Peruvian arts and crafts",
                        "vi": "triển lãm nghệ thuật và hàng thủ công của Peru"
                    },
                    {
                        "en": "Dance is a very theatrical art.",
                        "vi": "Khiêu vũ là một nghệ thuật sân khấu rất đặc sắc."
                    }
                ]
            },
            {
                "define": {
                    "en": "the subjects you can study at school or university that are not sciences, such as languages, history or literature",
                    "vi": "các môn học bạn có thể học ở trường hoặc trường đại học không phải là khoa học, chẳng hạn như ngôn ngữ, lịch sử hoặc văn học"
                },
                "examples": [
                    {
                        "en": "an arts degree",
                        "vi": "bằng cấp nghệ thuật"
                    }
                ]
            },
            {
                "define": {
                    "en": "an ability or a skill that you can develop with training and practice",
                    "vi": "một khả năng hoặc một kỹ năng mà bạn có thể phát triển khi được đào tạo và thực hành"
                },
                "examples": [
                    {
                        "en": "a therapist trained in the art of healing",
                        "vi": "một nhà trị liệu được đào tạo về nghệ thuật chữa bệnh"
                    },
                    {
                        "en": "I've never mastered the art of making bread.",
                        "vi": "Tôi chưa bao giờ thành thạo nghệ thuật làm bánh mì."
                    },
                    {
                        "en": "Letter-writing is a lost art nowadays.",
                        "vi": "Viết thư là một nghệ thuật đã mất ngày nay."
                    },
                    {
                        "en": "Appearing confident at interviews is quite an art (= rather difficult).",
                        "vi": "Tự tin xuất hiện tại các cuộc phỏng vấn là một nghệ thuật (= khá khó)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to learn to do something well and efficiently",
                    "vi": "để học cách làm điều gì đó tốt và hiệu quả"
                },
                "examples": [
                    {
                        "en": "I spend so much time travelling that I've got packing down to a fine art.",
                        "vi": "Tôi dành nhiều thời gian đi du lịch đến nỗi tôi đã đóng gói thành một tác phẩm nghệ thuật."
                    }
                ]
            }
        ]
    },
    {
        "id": "d2f73563abc24197bd73739edf6dd725",
        "word": "course",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/kɔːs/",
            "us": "/kɔːrs/"
        },
        "nearby": [
            {
                "word": "courier",
                "pos": "noun"
            },
            {
                "word": "courier",
                "pos": "verb"
            },
            {
                "word": "course",
                "pos": "noun"
            },
            {
                "word": "course",
                "pos": "verb"
            },
            {
                "word": "coursebook",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a series of lessons or lectures on a particular subject",
                    "vi": "một loạt các bài học hoặc bài giảng về một chủ đề cụ thể"
                },
                "examples": [
                    {
                        "en": "a French/chemistry course",
                        "vi": "một khóa học tiếng Pháp / hóa học"
                    },
                    {
                        "en": "course in something He took a course in Russian language and literature.",
                        "vi": "khóa học về cái gì đó Anh ấy đã tham gia một khóa học về ngôn ngữ và văn học Nga."
                    },
                    {
                        "en": "I want to do a course in art and design.",
                        "vi": "Tôi muốn tham gia một khóa học về nghệ thuật và thiết kế."
                    },
                    {
                        "en": "The department offers short courses in drama, fiction, and poetry.",
                        "vi": "Khoa cung cấp các khóa học ngắn hạn về kịch, tiểu thuyết và thơ."
                    },
                    {
                        "en": "course on something She teaches a course on internet crime.",
                        "vi": "khóa học về cái gì đó Cô ấy dạy một khóa học về tội phạm internet."
                    },
                    {
                        "en": "on a course My boss has been on a course this week.",
                        "vi": "về một khóa học Ông chủ của tôi đã tham gia một khóa học tuần này."
                    },
                    {
                        "en": "You need to go on a management training course.",
                        "vi": "Bạn cần tham gia một khóa đào tạo về quản lý."
                    },
                    {
                        "en": "He has recently completed the five-week course.",
                        "vi": "Anh ấy gần đây đã hoàn thành khóa học năm tuần."
                    },
                    {
                        "en": "The college runs specialist language courses.",
                        "vi": "Trường tổ chức các khóa học ngôn ngữ chuyên biệt."
                    },
                    {
                        "en": "I enrolled in a ten-week online course.",
                        "vi": "Tôi đã đăng ký một khóa học trực tuyến kéo dài mười tuần."
                    }
                ]
            },
            {
                "define": {
                    "en": "a period of study at a college or university that leads to an exam or a qualification",
                    "vi": "một khoảng thời gian học tập tại một trường cao đẳng hoặc đại học dẫn đến một kỳ thi hoặc chứng chỉ"
                },
                "examples": [
                    {
                        "en": "What degree course did you choose?",
                        "vi": "Bạn đã chọn khóa học cấp bằng nào?"
                    },
                    {
                        "en": "a two-year postgraduate course leading to a master’s degree",
                        "vi": "một khóa học sau đại học hai năm để lấy bằng thạc sĩ"
                    },
                    {
                        "en": "He was able to design his own course of study.",
                        "vi": "Anh ấy đã có thể thiết kế lộ trình học của riêng mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "a large area of land that is designed for playing golf on",
                    "vi": "một khu đất rộng lớn được thiết kế để chơi gôn trên"
                },
                "examples": [
                    {
                        "en": "He set a new course record.",
                        "vi": "Anh ấy đã thiết lập một kỷ lục khóa học mới."
                    }
                ]
            },
            {
                "define": {
                    "en": "an area of land or water where races are held",
                    "vi": "một khu vực đất hoặc nước nơi các cuộc đua được tổ chức"
                },
                "examples": [
                    {
                        "en": "She was overtaken on the last stretch of the course.",
                        "vi": "Cô ấy đã bị vượt qua ở đoạn cuối cùng của khóa học."
                    },
                    {
                        "en": "Only ten yachts completed the course.",
                        "vi": "Chỉ có mười du thuyền hoàn thành khóa học."
                    }
                ]
            },
            {
                "define": {
                    "en": "any of the separate parts of a meal",
                    "vi": "bất kỳ phần riêng biệt nào của bữa ăn"
                },
                "examples": [
                    {
                        "en": "a four-course dinner",
                        "vi": "một bữa tối bốn món"
                    },
                    {
                        "en": "The main course was roast duck.",
                        "vi": "Món chính là vịt quay."
                    },
                    {
                        "en": "for… course We had chicken for our main course.",
                        "vi": "cho… tất nhiên Chúng tôi đã có gà cho món chính của chúng tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a direction or route followed by a ship or an aircraft",
                    "vi": "một hướng hoặc tuyến đường theo sau bởi một con tàu hoặc một chiếc máy bay"
                },
                "examples": [
                    {
                        "en": "He radioed the pilot to change course.",
                        "vi": "Anh ta ra lệnh cho phi công thay đổi hướng đi."
                    },
                    {
                        "en": "on/off course The plane was off course (= not going in the right direction).",
                        "vi": "on / off course Máy bay đã chệch hướng (= không đi đúng hướng)."
                    },
                    {
                        "en": "We're on course for our destination.",
                        "vi": "Chúng tôi đang trên đường đến đích của chúng tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "the general direction in which somebody’s ideas or actions are moving or in which things are developing",
                    "vi": "hướng chung trong đó ý tưởng hoặc hành động của ai đó đang di chuyển hoặc mọi thứ đang phát triển"
                },
                "examples": [
                    {
                        "en": "The president appears likely to change course on some key issues.",
                        "vi": "Tổng thống dường như sẽ thay đổi quan điểm về một số vấn đề chính."
                    },
                    {
                        "en": "The dollar fell sharply for two days, and then reversed course.",
                        "vi": "Đồng đô la giảm mạnh trong hai ngày, và sau đó đảo chiều."
                    },
                    {
                        "en": "Her career followed a similar course to her sister's.",
                        "vi": "Sự nghiệp của cô cũng theo một lộ trình tương tự như chị gái của cô."
                    },
                    {
                        "en": "Politicians are often obliged to steer a course between incompatible interests.",
                        "vi": "Các chính trị gia thường có nghĩa vụ phải điều khiển một hướng đi giữa các lợi ích không tương đồng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a way of acting in or dealing with a particular situation",
                    "vi": "một cách hành động hoặc đối phó với một tình huống cụ thể"
                },
                "examples": [
                    {
                        "en": "There are various courses open to us.",
                        "vi": "Có nhiều khóa học khác nhau được mở cho chúng tôi."
                    },
                    {
                        "en": "What course of action would you recommend?",
                        "vi": "Bạn sẽ đề xuất phương thức hành động nào?"
                    },
                    {
                        "en": "It was the best course of action to take in the circumstances.",
                        "vi": "Đó là cách hành động tốt nhất để thực hiện trong hoàn cảnh."
                    },
                    {
                        "en": "The wisest course would be to say nothing.",
                        "vi": "Cách khôn ngoan nhất là không nói gì cả."
                    }
                ]
            },
            {
                "define": {
                    "en": "the way something develops or should develop",
                    "vi": "cách một cái gì đó phát triển hoặc nên phát triển"
                },
                "examples": [
                    {
                        "en": "course of something This was an event that changed the course of history.",
                        "vi": "tất nhiên của điều gì đó Đây là một sự kiện đã thay đổi tiến trình lịch sử."
                    },
                    {
                        "en": "The unexpected course of events aroused considerable alarm.",
                        "vi": "Diễn biến bất ngờ của các sự kiện đã làm dấy lên sự báo động đáng kể."
                    },
                    {
                        "en": "during the course of something She repeatedly raised the issue during the course of the campaign.",
                        "vi": "trong quá trình của một cái gì đó Cô ấy liên tục nêu vấn đề trong suốt quá trình của chiến dịch."
                    }
                ]
            },
            {
                "define": {
                    "en": "the direction a river moves in",
                    "vi": "hướng dòng sông di chuyển"
                },
                "examples": [
                    {
                        "en": "The path follows the course of the river.",
                        "vi": "Đường đi theo dòng sông."
                    }
                ]
            },
            {
                "define": {
                    "en": "a series of medical treatments, tablets, etc.",
                    "vi": "một loạt các phương pháp điều trị y tế, máy tính bảng, v.v."
                },
                "examples": [
                    {
                        "en": "to prescribe a course of antibiotics",
                        "vi": "kê đơn một đợt kháng sinh"
                    },
                    {
                        "en": "When taking antibiotics it is important to finish the course.",
                        "vi": "Khi dùng thuốc kháng sinh, điều quan trọng là phải kết thúc liệu trình."
                    }
                ]
            },
            {
                "define": {
                    "en": "a continuous layer of brick, stone or other building material in a wall",
                    "vi": "một lớp gạch, đá hoặc vật liệu xây dựng khác trong tường liên tục"
                },
                "examples": [
                    {
                        "en": "A new damp-proof course could cost £1 000 or more.",
                        "vi": "Một khóa học chống ẩm mới có thể có giá từ 1.000 bảng Anh trở lên."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be in a situation that is almost certain to cause an argument",
                    "vi": "ở trong một tình huống gần như chắc chắn gây ra một cuộc tranh cãi"
                },
                "examples": [
                    {
                        "en": "I was on a collision course with my boss over the sales figures.",
                        "vi": "Tôi đã tham gia một khóa học va chạm với sếp của mình về các số liệu bán hàng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be moving in a direction in which it is likely that you will crash into somebody/something",
                    "vi": "đang di chuyển theo hướng có khả năng bạn sẽ đâm vào ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "A giant iceberg was on a collision course with the ship.",
                        "vi": "Một tảng băng khổng lồ đang trên đường va chạm với con tàu."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be just what you would expect to happen or expect somebody to do in a particular situation",
                    "vi": "chỉ là những gì bạn mong đợi sẽ xảy ra hoặc mong đợi ai đó làm trong một tình huống cụ thể"
                },
                "examples": [
                    {
                        "en": "Starting early and working long hours is par for the course in this job.",
                        "vi": "Bắt đầu sớm và làm việc nhiều giờ là điều bình thường đối với công việc này."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of matching people with suitable jobs or tasks",
                    "vi": "hành động kết hợp những người với công việc hoặc nhiệm vụ phù hợp"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "going through a particular process",
                    "vi": "trải qua một quá trình cụ thể"
                },
                "examples": [
                    {
                        "en": "The new textbook is in course of preparation.",
                        "vi": "Sách giáo khoa mới đang trong quá trình chuẩn bị."
                    }
                ]
            },
            {
                "define": {
                    "en": "during",
                    "vi": "suốt trong"
                },
                "examples": [
                    {
                        "en": "He's seen many changes in the course of his long life.",
                        "vi": "Anh ấy đã nhìn thấy nhiều thay đổi trong quá trình sống lâu dài của mình."
                    },
                    {
                        "en": "The company faces major challenges over the course of the next few years.",
                        "vi": "Công ty phải đối mặt với những thách thức lớn trong vài năm tới."
                    }
                ]
            },
            {
                "define": {
                    "en": "when enough time has passed",
                    "vi": "khi đủ thời gian trôi qua"
                },
                "examples": [
                    {
                        "en": "It is possible that in the course of time a cure for cancer will be found.",
                        "vi": "Có thể trong một thời gian nữa sẽ tìm ra phương pháp chữa khỏi bệnh ung thư."
                    },
                    {
                        "en": "In the course of time, I began to understand.",
                        "vi": "Theo dòng thời gian, tôi bắt đầu hiểu."
                    }
                ]
            },
            {
                "define": {
                    "en": "at the right time and not before",
                    "vi": "vào đúng thời điểm và không phải trước đó"
                },
                "examples": [
                    {
                        "en": "Your request will be dealt with in due course.",
                        "vi": "Yêu cầu của bạn sẽ được giải quyết trong quá trình thích hợp."
                    }
                ]
            },
            {
                "define": {
                    "en": "as things usually happen",
                    "vi": "như mọi thứ thường xảy ra"
                },
                "examples": [
                    {
                        "en": "In the normal course of things we would not treat her disappearance as suspicious.",
                        "vi": "Trong quá trình bình thường của mọi thứ, chúng tôi sẽ không coi sự mất tích của cô ấy là đáng ngờ."
                    },
                    {
                        "en": "In the normal course of events, you should get a reply by Monday.",
                        "vi": "Trong quá trình bình thường của các sự kiện, bạn sẽ nhận được trả lời trước thứ Hai."
                    }
                ]
            },
            {
                "define": {
                    "en": "to allow natural processes to happen, without trying to stop or change them (used especially in the context of illness)",
                    "vi": "để cho phép các quá trình tự nhiên xảy ra mà không cần cố gắng ngăn chặn hoặc thay đổi chúng (được sử dụng đặc biệt trong bối cảnh bệnh tật)"
                },
                "examples": [
                    {
                        "en": "The midwife must judge when to let nature take its course and when to intervene.",
                        "vi": "Người hộ sinh phải phán đoán khi nào để tự nhiên diễn ra và khi nào cần can thiệp."
                    },
                    {
                        "en": "When the dog responded so badly to the treatment, we decided to let nature take its course.",
                        "vi": "Khi con chó phản ứng rất tệ với phương pháp điều trị, chúng tôi quyết định để tự nhiên xử lý."
                    }
                ]
            },
            {
                "define": {
                    "en": "(as) the usual and correct thing to do",
                    "vi": "(như) điều bình thường và đúng đắn cần làm"
                },
                "examples": [
                    {
                        "en": "We always check people's addresses as a matter of course.",
                        "vi": "Chúng tôi luôn kiểm tra địa chỉ của mọi người như một điều tất nhiên."
                    }
                ]
            },
            {
                "define": {
                    "en": "(to take/find) an acceptable course of action that avoids two extreme positions",
                    "vi": "(để thực hiện / tìm) một hướng hành động có thể chấp nhận được tránh hai vị trí cực đoan"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to emphasize that what you are saying is true or correct",
                    "vi": "được sử dụng để nhấn mạnh rằng những gì bạn đang nói là đúng hoặc đúng"
                },
                "examples": [
                    {
                        "en": "‘Don't you like my mother?’ ‘Of course I do!’",
                        "vi": "Bạn không thích mẹ tôi?' 'Tất nhiên tôi làm!'"
                    },
                    {
                        "en": "‘Will you be there?’ ‘Course I will.’",
                        "vi": "Bạn sẽ ở đó chứ?' \"Tất nhiên là tôi sẽ làm.\""
                    }
                ]
            },
            {
                "define": {
                    "en": "used as a polite way of giving somebody permission to do something",
                    "vi": "được sử dụng như một cách lịch sự để cho phép ai đó làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "‘Can I come, too?’ ‘Course you can.’",
                        "vi": "Tôi có thể đến được không?' 'Tất nhiên bạn có thể.'"
                    },
                    {
                        "en": "‘Can I have one of those pens?’ ‘Of course—help yourself.’",
                        "vi": "Tôi có thể có một trong những chiếc bút đó không?' \"Tất nhiên rồi - hãy tự giúp mình.\""
                    }
                ]
            },
            {
                "define": {
                    "en": "used as a polite way of agreeing with what somebody has just said",
                    "vi": "được sử dụng như một cách lịch sự để đồng ý với những gì ai đó vừa nói"
                },
                "examples": [
                    {
                        "en": "‘I did all I could to help.’ ‘Of course,’ he murmured gently.",
                        "vi": "Tôi đã làm tất cả những gì có thể để giúp đỡ.' “Tất nhiên,” anh nhẹ nhàng thì thầm."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to show that what you are saying is not surprising or is generally known or accepted",
                    "vi": "được sử dụng để cho thấy rằng những gì bạn đang nói không gây ngạc nhiên hoặc thường được biết đến hoặc chấp nhận"
                },
                "examples": [
                    {
                        "en": "Ben, of course, was the last to arrive.",
                        "vi": "Tất nhiên, Ben là người đến cuối cùng."
                    },
                    {
                        "en": "Of course, there are other ways of doing this.",
                        "vi": "Tất nhiên, có những cách khác để làm điều này."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to emphasize the fact that you are saying ‘no’",
                    "vi": "được sử dụng để nhấn mạnh thực tế là bạn đang nói 'không'"
                },
                "examples": [
                    {
                        "en": "‘Are you going?’ ‘Of course not.’",
                        "vi": "Bạn có đi không?' 'Dĩ nhiên là không.'"
                    },
                    {
                        "en": "‘Do you mind?’ ‘No, of course not.’",
                        "vi": "Bạn có phiền?' 'Tất nhiên là không rồi.'"
                    }
                ]
            },
            {
                "define": {
                    "en": "likely to achieve or do something because you have already started to do it",
                    "vi": "có khả năng đạt được hoặc làm được điều gì đó bởi vì bạn đã bắt đầu làm"
                },
                "examples": [
                    {
                        "en": "The American economy is on course for higher inflation than Britain by the end of the year.",
                        "vi": "Nền kinh tế Mỹ có xu hướng lạm phát cao hơn Anh vào cuối năm."
                    },
                    {
                        "en": "Victory in Saturday’s match will put them on course to qualify for the European championships.",
                        "vi": "Chiến thắng trong trận đấu hôm thứ Bảy sẽ giúp họ đủ điều kiện tham dự giải vô địch châu Âu."
                    }
                ]
            },
            {
                "define": {
                    "en": "to tell a lie or to do something in order to prevent the police, etc. from finding out the truth about a crime",
                    "vi": "nói dối hoặc làm điều gì đó để ngăn cảnh sát, v.v. tìm ra sự thật về tội phạm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to develop in the usual way and come to the usual end",
                    "vi": "phát triển theo cách thông thường và đi đến kết thúc thông thường"
                },
                "examples": [
                    {
                        "en": "When her tears had run their course, she felt calmer and more in control.",
                        "vi": "Khi nước mắt chảy thành dòng, cô cảm thấy bình tĩnh hơn và kiểm soát được nhiều hơn."
                    },
                    {
                        "en": "With minor ailments the best thing is often to let nature take its course.",
                        "vi": "Với những bệnh nhẹ, điều tốt nhất là thường để tự nhiên điều trị."
                    }
                ]
            },
            {
                "define": {
                    "en": "to continue doing something until it has finished or been completed, even though it is difficult",
                    "vi": "để tiếp tục làm điều gì đó cho đến khi nó đã hoàn thành hoặc đã hoàn thành, mặc dù điều đó rất khó khăn"
                },
                "examples": [
                    {
                        "en": "Very few of the trainees have stayed the course.",
                        "vi": "Rất ít học viên đã ở lại khóa học."
                    },
                    {
                        "en": "He insists that he will not quit but will stay the course.",
                        "vi": "Anh khẳng định sẽ không bỏ mà sẽ ở lại khóa học."
                    }
                ]
            }
        ]
    },
    {
        "id": "61e7a34b8a2b4a5a8c873dc6ec43ccf0",
        "word": "English",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/ˈɪŋɡlɪʃ/",
            "us": "/ˈɪŋɡlɪʃ/"
        },
        "nearby": [
            {
                "word": "the England and Wales Cricket Board",
                "pos": ""
            },
            {
                "word": "England expects",
                "pos": ""
            },
            {
                "word": "English",
                "pos": "noun"
            },
            {
                "word": "English",
                "pos": "adjective"
            },
            {
                "word": "English breakfast",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the language, originally of England, now spoken in many other countries and used as a language of international communication throughout the world",
                    "vi": "ngôn ngữ ban đầu của Anh, hiện được nói ở nhiều quốc gia khác và được sử dụng như một ngôn ngữ giao tiếp quốc tế trên khắp thế giới"
                },
                "examples": [
                    {
                        "en": "She speaks good English.",
                        "vi": "Cô ấy nói tiếng Anh tốt."
                    },
                    {
                        "en": "I need to improve my English.",
                        "vi": "Tôi cần phải cải thiện Tiếng Anh của tôi."
                    },
                    {
                        "en": "world Englishes",
                        "vi": "thế giới Tiếng Anh"
                    },
                    {
                        "en": "They taught conversational English to a group of Japanese students.",
                        "vi": "Họ đã dạy tiếng Anh giao tiếp cho một nhóm sinh viên Nhật Bản."
                    }
                ]
            },
            {
                "define": {
                    "en": "English language or literature as a subject of study",
                    "vi": "Ngôn ngữ Anh hoặc văn học như một đối tượng nghiên cứu"
                },
                "examples": [
                    {
                        "en": "a degree in English",
                        "vi": "bằng tiếng anh"
                    },
                    {
                        "en": "English is my best subject.",
                        "vi": "Tiếng Anh là môn học tốt nhất của tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "the people of England (sometimes wrongly used to mean the British, including the Scots, the Welsh and the Northern Irish)",
                    "vi": "người dân Anh (đôi khi được sử dụng sai khi có nghĩa là người Anh, bao gồm người Scotland, người xứ Wales và người Bắc Ireland)"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "simply and clearly expressed, without using technical language",
                    "vi": "được diễn đạt đơn giản và rõ ràng, không sử dụng ngôn ngữ kỹ thuật"
                },
                "examples": [
                    {
                        "en": "a document written in plain English",
                        "vi": "một tài liệu được viết bằng tiếng Anh đơn giản"
                    },
                    {
                        "en": "If you could put it in plain English I might be able to understand.",
                        "vi": "Nếu bạn có thể viết nó bằng tiếng Anh đơn giản, tôi có thể hiểu được."
                    },
                    {
                        "en": "Teachers should encourage students to write in plain English.",
                        "vi": "Giáo viên nên khuyến khích học sinh viết bằng tiếng Anh đơn giản."
                    }
                ]
            }
        ]
    },
    {
        "id": "235df316e78b4b15928df28d75e3dae2",
        "word": "geography",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/dʒiˈɒɡrəfi/",
            "us": "/dʒiˈɑːɡrəfi/"
        },
        "nearby": [
            {
                "word": "geographical",
                "pos": "adjective"
            },
            {
                "word": "geographically",
                "pos": "adverb"
            },
            {
                "word": "geography",
                "pos": "noun"
            },
            {
                "word": "geolocation",
                "pos": "noun"
            },
            {
                "word": "geological",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the scientific study of the earth’s surface, physical features, divisions, products, population, etc.",
                    "vi": "nghiên cứu khoa học về bề mặt trái đất, các đặc điểm vật lý, sự phân chia, sản phẩm, dân số, v.v."
                },
                "examples": [
                    {
                        "en": "recent work in economic geography",
                        "vi": "công việc gần đây trong địa lý kinh tế"
                    },
                    {
                        "en": "cultural/historical/political geography",
                        "vi": "địa lý văn hóa / lịch sử / chính trị"
                    },
                    {
                        "en": "a geography lesson/class/teacher",
                        "vi": "một bài học địa lý / lớp học / giáo viên"
                    },
                    {
                        "en": "a degree in geography",
                        "vi": "bằng địa lý"
                    }
                ]
            },
            {
                "define": {
                    "en": "the way in which the physical features of a place are arranged",
                    "vi": "cách mà các đặc điểm vật lý của một địa điểm được sắp xếp"
                },
                "examples": [
                    {
                        "en": "These streets had a very particular geography.",
                        "vi": "Những con phố này có một vị trí địa lý rất đặc biệt."
                    },
                    {
                        "en": "the geography of New York City",
                        "vi": "địa lý của thành phố New York"
                    },
                    {
                        "en": "Kim knew the geography of the building and strode along the corridor.",
                        "vi": "Kim biết vị trí địa lý của tòa nhà và sải bước dọc theo hành lang."
                    }
                ]
            },
            {
                "define": {
                    "en": "the way in which a particular aspect of life or society is influenced by geography or varies according to geography",
                    "vi": "cách thức mà một khía cạnh cụ thể của cuộc sống hoặc xã hội bị ảnh hưởng bởi địa lý hoặc thay đổi theo địa lý"
                },
                "examples": [
                    {
                        "en": "The geography of poverty and the geography of voting are connected.",
                        "vi": "Địa lý nghèo đói và địa lý bỏ phiếu có mối liên hệ với nhau."
                    }
                ]
            },
            {
                "define": {
                    "en": "a country, area or region",
                    "vi": "một quốc gia, khu vực hoặc khu vực"
                },
                "examples": [
                    {
                        "en": "We are now operational across multiple geographies.",
                        "vi": "Chúng tôi hiện đang hoạt động trên nhiều vùng địa lý."
                    }
                ]
            }
        ]
    },
    {
        "id": "cbc8e6c7776445fa9101a9b66da57840",
        "word": "history",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/ˈhɪstri/",
            "us": "/ˈhɪstri/"
        },
        "nearby": [
            {
                "word": "historiographical",
                "pos": "adjective"
            },
            {
                "word": "historiography",
                "pos": "noun"
            },
            {
                "word": "history",
                "pos": "noun"
            },
            {
                "word": "history-sheeter",
                "pos": "noun"
            },
            {
                "word": "histrionic",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "all the events that happened in the past",
                    "vi": "tất cả các sự kiện đã xảy ra trong quá khứ"
                },
                "examples": [
                    {
                        "en": "in history The battle was a turning point in human history.",
                        "vi": "trong lịch sử Trận chiến là một bước ngoặt trong lịch sử nhân loại."
                    },
                    {
                        "en": "one of the worst disasters in recent history",
                        "vi": "một trong những thảm họa tồi tệ nhất trong lịch sử gần đây"
                    },
                    {
                        "en": "throughout history Many people throughout history have dreamt of a world without war.",
                        "vi": "Trong suốt lịch sử Nhiều người trong suốt lịch sử đã mơ về một thế giới không có chiến tranh."
                    },
                    {
                        "en": "a people with no sense of history",
                        "vi": "một dân tộc không có cảm giác về lịch sử"
                    },
                    {
                        "en": "The area was inhabited long before the dawn of recorded history (= before people wrote about events).",
                        "vi": "Khu vực này đã có người sinh sống từ rất lâu trước buổi bình minh của lịch sử được ghi lại (= trước khi mọi người viết về các sự kiện)."
                    },
                    {
                        "en": "These events changed the course of history.",
                        "vi": "Những sự kiện này đã thay đổi tiến trình lịch sử."
                    },
                    {
                        "en": "This was her attempt to rewrite history with herself in the role of heroine.",
                        "vi": "Đây là nỗ lực của cô để viết lại lịch sử với chính mình trong vai trò nữ anh hùng."
                    }
                ]
            },
            {
                "define": {
                    "en": "the past events connected with the development of a particular place, subject, etc.",
                    "vi": "các sự kiện trong quá khứ kết nối với sự phát triển của một địa điểm, chủ đề cụ thể, v.v."
                },
                "examples": [
                    {
                        "en": "the history of science/music/philosophy",
                        "vi": "lịch sử khoa học / âm nhạc / triết học"
                    },
                    {
                        "en": "She is an expert in the history of the United States.",
                        "vi": "Cô ấy là một chuyên gia về lịch sử của Hoa Kỳ."
                    },
                    {
                        "en": "The local history of the area is fascinating.",
                        "vi": "Lịch sử địa phương của khu vực này thật hấp dẫn."
                    },
                    {
                        "en": "The museum traces the history of the slave trade.",
                        "vi": "Bảo tàng lưu lại lịch sử buôn bán nô lệ."
                    }
                ]
            },
            {
                "define": {
                    "en": "the study of past events, especially as a subject at school or university",
                    "vi": "nghiên cứu các sự kiện trong quá khứ, đặc biệt là một môn học ở trường học hoặc trường đại học"
                },
                "examples": [
                    {
                        "en": "a history professor/teacher",
                        "vi": "một giáo sư / giáo viên lịch sử"
                    },
                    {
                        "en": "a history lesson/textbook",
                        "vi": "một bài học lịch sử / sách giáo khoa"
                    },
                    {
                        "en": "a degree in History",
                        "vi": "bằng Lịch sử"
                    },
                    {
                        "en": "cultural/social/economic/political history",
                        "vi": "lịch sử văn hóa / xã hội / kinh tế / chính trị"
                    },
                    {
                        "en": "modern/ancient history",
                        "vi": "lịch sử hiện đại / cổ đại"
                    },
                    {
                        "en": "She's studying art history.",
                        "vi": "Cô ấy đang học lịch sử nghệ thuật."
                    },
                    {
                        "en": "She studies history of art.",
                        "vi": "Cô ấy nghiên cứu lịch sử nghệ thuật."
                    }
                ]
            },
            {
                "define": {
                    "en": "a written or spoken account of real past events",
                    "vi": "một tài khoản viết hoặc nói về các sự kiện thực trong quá khứ"
                },
                "examples": [
                    {
                        "en": "She's writing a new history of Europe.",
                        "vi": "Cô ấy đang viết một trang sử mới của Châu Âu."
                    },
                    {
                        "en": "She went on to catalogue a long history of disasters.",
                        "vi": "Cô tiếp tục liệt kê một lịch sử lâu dài về các thảm họa."
                    },
                    {
                        "en": "the oral histories of ordinary people",
                        "vi": "lịch sử truyền miệng của những người bình thường"
                    }
                ]
            },
            {
                "define": {
                    "en": "the set of facts that are known about somebody/something's past",
                    "vi": "tập hợp các sự kiện đã biết về quá khứ của ai đó / điều gì đó"
                },
                "examples": [
                    {
                        "en": "I know nothing about his personal history.",
                        "vi": "Tôi không biết gì về lịch sử cá nhân của anh ấy."
                    },
                    {
                        "en": "The group has quite a history.",
                        "vi": "Nhóm có lịch sử khá lâu đời."
                    },
                    {
                        "en": "The doctor will need some details of your medical history.",
                        "vi": "Bác sĩ sẽ cần một số chi tiết về bệnh sử của bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a record of something happening frequently in the past life of a person, family or place",
                    "vi": "bản ghi về điều gì đó xảy ra thường xuyên trong tiền kiếp của một người, gia đình hoặc địa điểm"
                },
                "examples": [
                    {
                        "en": "He has a history of violent crime.",
                        "vi": "Anh ta có tiền sử tội phạm bạo lực."
                    },
                    {
                        "en": "She has a long history of mental illness.",
                        "vi": "Cô có tiền sử bệnh tâm thần lâu năm."
                    },
                    {
                        "en": "There is a history of heart disease in my family.",
                        "vi": "Có tiền sử bệnh tim trong gia đình tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a record kept by a web browser of the web pages and other files it has been used to access",
                    "vi": "một bản ghi được lưu giữ bởi trình duyệt web về các trang web và các tệp khác mà nó đã được sử dụng để truy cập"
                },
                "examples": [
                    {
                        "en": "Clearing your browser history prevents websites from following and tracking your actions.",
                        "vi": "Xóa lịch sử trình duyệt của bạn ngăn các trang web theo dõi và theo dõi hành động của bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a relationship between two people, groups, companies, etc. that started in the past and continued for a period of time, especially one involving bad or complicated feelings",
                    "vi": "mối quan hệ giữa hai người, nhóm, công ty, v.v. đã bắt đầu trong quá khứ và tiếp tục trong một khoảng thời gian, đặc biệt là mối quan hệ liên quan đến cảm xúc tồi tệ hoặc phức tạp"
                },
                "examples": [
                    {
                        "en": "Sure there's history between Anna Mae and me, like you said.",
                        "vi": "Chắc chắn có lịch sử giữa Anna Mae và tôi, như bạn đã nói."
                    }
                ]
            },
            {
                "define": {
                    "en": "a historical play",
                    "vi": "một vở kịch lịch sử"
                },
                "examples": [
                    {
                        "en": "Shakespeare's comedies, histories and tragedies",
                        "vi": "Phim hài, lịch sử và bi kịch của Shakespeare"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be dead or no longer important",
                    "vi": "chết hoặc không còn quan trọng"
                },
                "examples": [
                    {
                        "en": "Another mistake like that and you're history.",
                        "vi": "Một sai lầm khác như thế và bạn là lịch sử."
                    },
                    {
                        "en": "We won't talk about that—that's history.",
                        "vi": "Chúng ta sẽ không nói về điều đó - đó là lịch sử."
                    },
                    {
                        "en": "That's past history now.",
                        "vi": "Đó là lịch sử quá khứ bây giờ."
                    },
                    {
                        "en": "They had an affair once, but that's past history now.",
                        "vi": "Họ đã ngoại tình một lần, nhưng đó là lịch sử đã qua."
                    }
                ]
            },
            {
                "define": {
                    "en": "the record of great achievements in history",
                    "vi": "kỷ lục của những thành tựu vĩ đại trong lịch sử"
                },
                "examples": [
                    {
                        "en": "She has earned her place in the history books.",
                        "vi": "Cô ấy đã giành được vị trí của mình trong sử sách."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that things often happen later in the same way as before",
                    "vi": "được sử dụng để nói rằng mọi thứ thường xảy ra sau đó giống như trước đây"
                },
                "examples": [
                    {
                        "en": "Years later family history repeated itself with Eve’s daughters.",
                        "vi": "Nhiều năm sau, lịch sử gia đình lặp lại với các cô con gái của Eve."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be or do something so important that it will be recorded in history",
                    "vi": "trở thành hoặc làm điều gì đó quan trọng đến mức nó sẽ được ghi vào lịch sử"
                },
                "examples": [
                    {
                        "en": "a discovery that made medical history",
                        "vi": "một khám phá làm nên lịch sử y học"
                    }
                ]
            },
            {
                "define": {
                    "en": "used when you are telling a story to say that you do not need to tell the end of it, because everyone knows it already",
                    "vi": "được sử dụng khi bạn đang kể một câu chuyện để nói rằng bạn không cần phải kể phần cuối của nó, vì mọi người đều biết điều đó rồi"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "53f0d92040fc40c19dd263a94d88f716",
        "word": "music",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/ˈmjuːzɪk/",
            "us": "/ˈmjuːzɪk/"
        },
        "nearby": [
            {
                "word": "mushy",
                "pos": "adjective"
            },
            {
                "word": "mushy peas",
                "pos": "noun"
            },
            {
                "word": "music",
                "pos": "noun"
            },
            {
                "word": "musical",
                "pos": "adjective"
            },
            {
                "word": "musical",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "sounds that are arranged in a way that is pleasant or exciting to listen to. People sing music or play it on instruments.",
                    "vi": "âm thanh được sắp xếp theo cách dễ chịu hoặc thú vị để nghe. Mọi người hát nhạc hoặc chơi nó trên các nhạc cụ."
                },
                "examples": [
                    {
                        "en": "I like any kind of pop or dance music.",
                        "vi": "Tôi thích bất kỳ loại nhạc pop hoặc dance nào."
                    },
                    {
                        "en": "He plays traditional Korean music.",
                        "vi": "Anh ấy chơi nhạc truyền thống của Hàn Quốc."
                    },
                    {
                        "en": "People often choose to listen to music that suits their moods and activities.",
                        "vi": "Mọi người thường chọn nghe nhạc phù hợp với tâm trạng và hoạt động của họ."
                    },
                    {
                        "en": "She could hear music playing somewhere.",
                        "vi": "Cô có thể nghe thấy tiếng nhạc đang phát ở đâu đó."
                    },
                    {
                        "en": "to stream/share/download music",
                        "vi": "phát / chia sẻ / tải nhạc xuống"
                    },
                    {
                        "en": "to write/compose music",
                        "vi": "viết / soạn nhạc"
                    },
                    {
                        "en": "to perform/record music",
                        "vi": "để biểu diễn / ghi âm nhạc"
                    },
                    {
                        "en": "Every week they get together to make music (= to play music or sing).",
                        "vi": "Hàng tuần, họ cùng nhau sáng tác âm nhạc (= chơi nhạc hoặc hát)."
                    },
                    {
                        "en": "the popularity of Mozart’s music",
                        "vi": "sự phổ biến của âm nhạc của Mozart"
                    },
                    {
                        "en": "It was a charming piece of music.",
                        "vi": "Đó là một bản nhạc quyến rũ."
                    },
                    {
                        "en": "The poem has been set to music (= music has been written for it)",
                        "vi": "Bài thơ đã được đặt thành nhạc (= nhạc đã được viết cho nó)"
                    },
                    {
                        "en": "Birmingham's live music scene",
                        "vi": "Sân khấu nhạc sống của Birmingham"
                    },
                    {
                        "en": "music lovers/fans",
                        "vi": "những người yêu thích / người hâm mộ âm nhạc"
                    },
                    {
                        "en": "Every summer he runs a three-day music festival.",
                        "vi": "Mỗi mùa hè, anh ấy tổ chức một lễ hội âm nhạc kéo dài ba ngày."
                    },
                    {
                        "en": "The band released a music video on YouTube today.",
                        "vi": "Ban nhạc đã phát hành một video âm nhạc trên YouTube vào ngày hôm nay."
                    }
                ]
            },
            {
                "define": {
                    "en": "the art of writing or playing music",
                    "vi": "nghệ thuật viết hoặc chơi nhạc"
                },
                "examples": [
                    {
                        "en": "He studied music in Moscow.",
                        "vi": "Anh ấy học nhạc ở Matxcova."
                    },
                    {
                        "en": "a career in music",
                        "vi": "sự nghiệp trong âm nhạc"
                    },
                    {
                        "en": "a music teacher",
                        "vi": "một giáo viên dạy nhạc"
                    },
                    {
                        "en": "music lessons",
                        "vi": "bài học âm nhạc"
                    },
                    {
                        "en": "the music business/industry",
                        "vi": "ngành công nghiệp / kinh doanh âm nhạc"
                    }
                ]
            },
            {
                "define": {
                    "en": "the written or printed signs that represent the sounds to be played or sung in a piece of music",
                    "vi": "các dấu hiệu viết hoặc in đại diện cho âm thanh được chơi hoặc hát trong một bản nhạc"
                },
                "examples": [
                    {
                        "en": "Can you read music (= understand the signs in order to play or sing a piece of music)?",
                        "vi": "Bạn có thể đọc nhạc (= hiểu các dấu hiệu để chơi hoặc hát một bản nhạc) không?"
                    },
                    {
                        "en": "I had to play it without the music.",
                        "vi": "Tôi đã phải chơi nó mà không có nhạc."
                    },
                    {
                        "en": "The music (= the paper or book with the musical notes on it) was still open on the piano.",
                        "vi": "Nhạc (= tờ giấy hoặc cuốn sách có ghi các nốt nhạc trên đó) vẫn mở trên piano."
                    }
                ]
            },
            {
                "define": {
                    "en": "to accept and deal with criticism or punishment for something you have done",
                    "vi": "chấp nhận và đối phó với những lời chỉ trích hoặc trừng phạt cho điều gì đó bạn đã làm"
                },
                "examples": [
                    {
                        "en": "The others all ran off, leaving me to face the music.",
                        "vi": "Những người khác đều chạy đi, để lại tôi đối mặt với âm nhạc."
                    }
                ]
            },
            {
                "define": {
                    "en": "news or information that you are very pleased to hear",
                    "vi": "tin tức hoặc thông tin mà bạn rất vui khi biết"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "2720b9b83341431bb54da4436059fcf3",
        "word": "science",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/ˈsaɪəns/",
            "us": "/ˈsaɪəns/"
        },
        "nearby": [
            {
                "word": "sciatic",
                "pos": "adjective"
            },
            {
                "word": "sciatica",
                "pos": "noun"
            },
            {
                "word": "science",
                "pos": "noun"
            },
            {
                "word": "science fair",
                "pos": "noun"
            },
            {
                "word": "science fiction",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "knowledge about the structure and behaviour of the natural and physical world, based on facts that you can prove, for example by experiments",
                    "vi": "kiến thức về cấu trúc và hành vi của thế giới tự nhiên và vật lý, dựa trên các dữ kiện mà bạn có thể chứng minh, chẳng hạn bằng các thí nghiệm"
                },
                "examples": [
                    {
                        "en": "new developments in science and technology",
                        "vi": "những phát triển mới trong khoa học và công nghệ"
                    },
                    {
                        "en": "the advance of modern science",
                        "vi": "tiến bộ của khoa học hiện đại"
                    },
                    {
                        "en": "the laws of science",
                        "vi": "luật khoa học"
                    }
                ]
            },
            {
                "define": {
                    "en": "the study of science",
                    "vi": "nghiên cứu khoa học"
                },
                "examples": [
                    {
                        "en": "science students/teachers/classes",
                        "vi": "sinh viên khoa học / giáo viên / lớp học"
                    },
                    {
                        "en": "She is trying to encourage more young people to study science.",
                        "vi": "Cô đang cố gắng khuyến khích nhiều bạn trẻ nghiên cứu khoa học hơn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a particular branch of science",
                    "vi": "một ngành khoa học cụ thể"
                },
                "examples": [
                    {
                        "en": "medical/environmental science",
                        "vi": "khoa học y tế / môi trường"
                    },
                    {
                        "en": "the biological sciences",
                        "vi": "khoa học sinh học"
                    },
                    {
                        "en": "to study one of the sciences",
                        "vi": "nghiên cứu một trong những ngành khoa học"
                    },
                    {
                        "en": "science of something He was a pioneer in the science of genetics.",
                        "vi": "khoa học về cái gì đó Ông là người đi tiên phong trong khoa học di truyền học."
                    }
                ]
            },
            {
                "define": {
                    "en": "a system for organizing the knowledge about a particular subject, especially one that deals with aspects of human behaviour or society",
                    "vi": "một hệ thống tổ chức kiến thức về một chủ đề cụ thể, đặc biệt là một chủ đề liên quan đến các khía cạnh của hành vi con người hoặc xã hội"
                },
                "examples": [
                    {
                        "en": "a science of international politics",
                        "vi": "một khoa học về chính trị quốc tế"
                    }
                ]
            },
            {
                "define": {
                    "en": "to confuse somebody by using technical or complicated language that they do not understand",
                    "vi": "gây nhầm lẫn cho ai đó bằng cách sử dụng ngôn ngữ kỹ thuật hoặc phức tạp mà họ không hiểu"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "cc2264e7a57e42a6b76e3ad631afbff0",
        "word": "subject",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/ˈsʌbdʒɪkt/",
            "us": "/ˈsʌbdʒɪkt/"
        },
        "nearby": [
            {
                "word": "subheading",
                "pos": "noun"
            },
            {
                "word": "subhuman",
                "pos": "adjective"
            },
            {
                "word": "subject",
                "pos": "noun"
            },
            {
                "word": "subject",
                "pos": "adjective"
            },
            {
                "word": "subject",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a thing or person that is being discussed, described or dealt with",
                    "vi": "một sự vật hoặc con người đang được thảo luận, mô tả hoặc xử lý"
                },
                "examples": [
                    {
                        "en": "subject of something Walker's work has been the subject of much debate.",
                        "vi": "chủ đề của một cái gì đó Công việc của Walker đã là chủ đề của nhiều cuộc tranh luận."
                    },
                    {
                        "en": "a subject of discussion/conversation",
                        "vi": "một chủ đề của cuộc thảo luận / cuộc trò chuyện"
                    },
                    {
                        "en": "Nelson Mandela is the subject of a new biography.",
                        "vi": "Nelson Mandela là chủ đề của một cuốn tiểu sử mới."
                    },
                    {
                        "en": "The incident is currently the subject of a police investigation.",
                        "vi": "Vụ việc hiện đang là chủ đề của một cuộc điều tra của cảnh sát."
                    },
                    {
                        "en": "on a/the subject books on many different subjects",
                        "vi": "trên a / sách chủ đề về nhiều chủ đề khác nhau"
                    },
                    {
                        "en": "I have nothing more to say on the subject.",
                        "vi": "Tôi không còn gì để nói về chủ đề này."
                    },
                    {
                        "en": "on the subject of something a magazine article on the subject of space travel",
                        "vi": "về chủ đề gì đó một bài báo trên tạp chí về chủ đề du hành vũ trụ"
                    },
                    {
                        "en": "How did we get onto the subject of marriage?",
                        "vi": "Làm thế nào chúng ta có được chủ đề hôn nhân?"
                    },
                    {
                        "en": "I wish you'd change the subject (= talk about something else).",
                        "vi": "Tôi ước bạn thay đổi chủ đề (= nói về điều gì đó khác)."
                    },
                    {
                        "en": "We seem to have got off the subject we're meant to be discussing.",
                        "vi": "Chúng ta dường như đã lạc đề tài mà chúng ta muốn thảo luận."
                    },
                    {
                        "en": "a subject for debate/discussion",
                        "vi": "một chủ đề để tranh luận / thảo luận"
                    },
                    {
                        "en": "The university runs a wide range of research programmes in different subject areas.",
                        "vi": "Trường đại học điều hành một loạt các chương trình nghiên cứu trong các lĩnh vực chủ đề khác nhau."
                    }
                ]
            },
            {
                "define": {
                    "en": "an area of knowledge studied in a school, college, etc.",
                    "vi": "một lĩnh vực kiến thức được học ở trường học, trường cao đẳng, v.v."
                },
                "examples": [
                    {
                        "en": "Biology is my favourite subject.",
                        "vi": "Sinh học là môn học yêu thích của tôi."
                    },
                    {
                        "en": "Which subjects are you studying?",
                        "vi": "Bạn đang học những môn nào?"
                    },
                    {
                        "en": "The college offers a wide range of subjects.",
                        "vi": "Trường cung cấp một loạt các môn học."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person or thing that is the main feature of a picture or photograph, or that a work of art is based on",
                    "vi": "một người hoặc một vật là đặc điểm chính của một bức tranh hoặc ảnh chụp hoặc một tác phẩm nghệ thuật dựa trên"
                },
                "examples": [
                    {
                        "en": "Focus the camera on the subject.",
                        "vi": "Lấy nét máy ảnh vào đối tượng."
                    },
                    {
                        "en": "Classical landscapes were a popular subject with many 18th century painters.",
                        "vi": "Phong cảnh cổ điển là một chủ đề phổ biến với nhiều họa sĩ thế kỷ 18."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person or thing being used to study something, especially in an experiment",
                    "vi": "một người hoặc vật được sử dụng để nghiên cứu điều gì đó, đặc biệt là trong một thí nghiệm"
                },
                "examples": [
                    {
                        "en": "We need male subjects between the ages of 18 and 25 for the experiment.",
                        "vi": "Chúng tôi cần đối tượng nam trong độ tuổi từ 18 đến 25 cho cuộc thử nghiệm."
                    }
                ]
            },
            {
                "define": {
                    "en": "a noun, noun phrase or pronoun representing the person or thing that performs the action of the verb (I in I sat down.), about which something is stated (the house in the house is very old) or, in a passive sentence, that is affected by the action of the verb (the tree in the tree was blown down in the storm)",
                    "vi": "một danh từ, cụm danh từ hoặc đại từ đại diện cho người hoặc vật thực hiện hành động của động từ (tôi trong tôi ngồi xuống.), về cái gì đó được nêu (ngôi nhà trong ngôi nhà rất cũ) hoặc, trong một câu bị động, điều đó bị ảnh hưởng bởi hành động của động từ (cây trên cây bị thổi ngã trong cơn bão)"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a person who belongs to a particular country, especially one with a king or queen",
                    "vi": "một người thuộc về một quốc gia cụ thể, đặc biệt là một quốc gia có vua hoặc hoàng hậu"
                },
                "examples": [
                    {
                        "en": "a British subject",
                        "vi": "một chủ đề tiếng Anh"
                    },
                    {
                        "en": "The prince had to tax his subjects heavily to raise money for the war.",
                        "vi": "Hoàng tử đã phải đánh thuế thần dân của mình một cách nặng nề để gây quỹ cho chiến tranh."
                    }
                ]
            }
        ]
    },
    {
        "id": "917f66b40c7e4bd3ab8ca746ad15be92",
        "word": "biology",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/baɪˈɒlədʒi/",
            "us": "/baɪˈɑːlədʒi/"
        },
        "nearby": [
            {
                "word": "biological weapon",
                "pos": "noun"
            },
            {
                "word": "biologist",
                "pos": "noun"
            },
            {
                "word": "biology",
                "pos": "noun"
            },
            {
                "word": "bioluminescence",
                "pos": "noun"
            },
            {
                "word": "biomass",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the scientific study of the life and structure of plants and animals",
                    "vi": "nghiên cứu khoa học về đời sống và cấu trúc của thực vật và động vật"
                },
                "examples": [
                    {
                        "en": "a degree in biology",
                        "vi": "bằng sinh học"
                    },
                    {
                        "en": "molecular/evolutionary biology",
                        "vi": "sinh học phân tử / tiến hóa"
                    },
                    {
                        "en": "a biology teacher/class/textbook",
                        "vi": "một giáo viên sinh học / lớp học / sách giáo khoa"
                    },
                    {
                        "en": "She's a professor of biology at Stanford.",
                        "vi": "Cô ấy là giáo sư sinh học tại Stanford."
                    }
                ]
            },
            {
                "define": {
                    "en": "the way in which the body and cells of a living thing behave",
                    "vi": "cách thức mà cơ thể và các tế bào của một sinh vật sống hoạt động"
                },
                "examples": [
                    {
                        "en": "How far is human nature determined by biology?",
                        "vi": "Bản chất con người được xác định bởi sinh học đến mức nào?"
                    },
                    {
                        "en": "the biology of marine animals",
                        "vi": "sinh học của động vật biển"
                    }
                ]
            }
        ]
    },
    {
        "id": "145052ad5f8d419cbf15911cd855ef2d",
        "word": "chemistry",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈkemɪstri/",
            "us": "/ˈkemɪstri/"
        },
        "nearby": [
            {
                "word": "chemise",
                "pos": "noun"
            },
            {
                "word": "chemist",
                "pos": "noun"
            },
            {
                "word": "chemistry",
                "pos": "noun"
            },
            {
                "word": "chemistry set",
                "pos": "noun"
            },
            {
                "word": "chemo",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the scientific study of the structure of substances, how they react when combined or in contact with one another, and how they behave under different conditions",
                    "vi": "nghiên cứu khoa học về cấu trúc của các chất, cách chúng phản ứng khi kết hợp hoặc tiếp xúc với nhau và cách chúng hoạt động trong các điều kiện khác nhau"
                },
                "examples": [
                    {
                        "en": "a degree in chemistry",
                        "vi": "bằng cấp về hóa học"
                    },
                    {
                        "en": "He did physics and chemistry at university.",
                        "vi": "Anh ấy học vật lý và hóa học ở trường đại học."
                    },
                    {
                        "en": "the university’s chemistry department",
                        "vi": "khoa hóa học của trường đại học"
                    },
                    {
                        "en": "inorganic/organic chemistry",
                        "vi": "hóa học vô cơ / hữu cơ"
                    }
                ]
            },
            {
                "define": {
                    "en": "the chemical structure and behaviour of a particular substance",
                    "vi": "cấu trúc hóa học và hành vi của một chất cụ thể"
                },
                "examples": [
                    {
                        "en": "the chemistry of copper",
                        "vi": "hóa học của đồng"
                    },
                    {
                        "en": "We do not fully understand the chemistry of genes.",
                        "vi": "Chúng tôi không hiểu đầy đủ về hóa học của gen."
                    },
                    {
                        "en": "The patient's blood chemistry was monitored regularly.",
                        "vi": "Sinh hóa máu của bệnh nhân được theo dõi thường xuyên."
                    },
                    {
                        "en": "natural changes in body chemistry",
                        "vi": "những thay đổi tự nhiên trong hóa học cơ thể"
                    }
                ]
            },
            {
                "define": {
                    "en": "the relationship between two people, usually a strong sexual attraction",
                    "vi": "mối quan hệ giữa hai người, thường là một sự hấp dẫn tình dục mạnh mẽ"
                },
                "examples": [
                    {
                        "en": "sexual chemistry",
                        "vi": "hóa học tình dục"
                    },
                    {
                        "en": "The chemistry just wasn't right.",
                        "vi": "Hóa học không đúng."
                    },
                    {
                        "en": "The personal chemistry between the two stars is obvious.",
                        "vi": "Sự ăn ý giữa hai ngôi sao là điều hiển nhiên."
                    }
                ]
            }
        ]
    },
    {
        "id": "95f7f4c1ddd44888b735e18f8c4d2054",
        "word": "drama",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈdrɑːmə/",
            "us": "/ˈdrɑːmə/"
        },
        "nearby": [
            {
                "word": "Francis Drake",
                "pos": ""
            },
            {
                "word": "dram",
                "pos": "noun"
            },
            {
                "word": "drama",
                "pos": "noun"
            },
            {
                "word": "drama queen",
                "pos": "noun"
            },
            {
                "word": "dramatic",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a play for the theatre, television or radio",
                    "vi": "một vở kịch cho nhà hát, truyền hình hoặc đài phát thanh"
                },
                "examples": [
                    {
                        "en": "a costume/period/courtroom/crime drama",
                        "vi": "trang phục / thời kỳ / phòng xử án / bộ phim tội phạm"
                    },
                    {
                        "en": "a powerful television drama about city life",
                        "vi": "một bộ phim truyền hình mạnh mẽ về cuộc sống thành phố"
                    },
                    {
                        "en": "a drama series set in an American dance academy",
                        "vi": "một bộ phim truyền hình lấy bối cảnh ở một học viện khiêu vũ của Mỹ"
                    }
                ]
            },
            {
                "define": {
                    "en": "plays considered as a form of literature",
                    "vi": "kịch được coi là một dạng văn học"
                },
                "examples": [
                    {
                        "en": "classical/modern drama",
                        "vi": "kịch cổ điển / hiện đại"
                    },
                    {
                        "en": "a drama critic",
                        "vi": "một nhà phê bình phim truyền hình"
                    },
                    {
                        "en": "a drama school/group",
                        "vi": "một trường / nhóm kịch"
                    },
                    {
                        "en": "a drama student/teacher",
                        "vi": "một học sinh / giáo viên kịch"
                    },
                    {
                        "en": "I studied English and Drama at college.",
                        "vi": "Tôi đã học tiếng Anh và Kịch ở trường đại học."
                    },
                    {
                        "en": "It is a first-class piece of costume drama.",
                        "vi": "Đây là một bộ phim cổ trang hạng nhất."
                    }
                ]
            },
            {
                "define": {
                    "en": "an exciting event",
                    "vi": "một sự kiện thú vị"
                },
                "examples": [
                    {
                        "en": "A powerful human drama was unfolding before our eyes.",
                        "vi": "Một màn kịch đầy sức mạnh của con người đang diễn ra trước mắt chúng tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "the fact of being exciting",
                    "vi": "thực tế là thú vị"
                },
                "examples": [
                    {
                        "en": "You couldn't help being thrilled by the drama of the situation.",
                        "vi": "Bạn không khỏi xúc động trước sự kịch tính của tình huống."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make a small problem or event seem more important or serious than it really is",
                    "vi": "để làm cho một vấn đề nhỏ hoặc một sự kiện có vẻ quan trọng hơn hoặc nghiêm trọng hơn so với thực tế"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "9b5d4cda0040446eafd7675937f7cc15",
        "word": "mathematics",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˌmæθəˈmætɪks/",
            "us": "/ˌmæθəˈmætɪks/"
        },
        "nearby": [
            {
                "word": "mathematically",
                "pos": "adverb"
            },
            {
                "word": "mathematician",
                "pos": "noun"
            },
            {
                "word": "mathematics",
                "pos": "noun"
            },
            {
                "word": "Cotton Mather",
                "pos": ""
            },
            {
                "word": "math rock",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the science of numbers and shapes. Branches of mathematics include arithmetic, algebra, geometry and trigonometry.",
                    "vi": "khoa học về các con số và hình dạng. Các nhánh của toán học bao gồm số học, đại số, hình học và lượng giác."
                },
                "examples": [
                    {
                        "en": "the school mathematics curriculum",
                        "vi": "chương trình giảng dạy toán học ở trường"
                    },
                    {
                        "en": "applied/pure mathematics",
                        "vi": "toán học ứng dụng / thuần túy"
                    }
                ]
            },
            {
                "define": {
                    "en": "the process of calculating using numbers",
                    "vi": "quá trình tính toán bằng cách sử dụng các con số"
                },
                "examples": [
                    {
                        "en": "He worked out the very difficult mathematics in great detail.",
                        "vi": "Anh ấy đã giải bài toán rất khó một cách chi tiết."
                    },
                    {
                        "en": "Her proof is a remarkable piece of mathematics.",
                        "vi": "Chứng minh của cô ấy là một phần toán học đáng chú ý."
                    }
                ]
            }
        ]
    },
    {
        "id": "3bcac3ac655f496dbe4aea13f8105f2a",
        "word": "physics",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈfɪzɪks/",
            "us": "/ˈfɪzɪks/"
        },
        "nearby": [
            {
                "word": "physician's assistant",
                "pos": "noun"
            },
            {
                "word": "physicist",
                "pos": "noun"
            },
            {
                "word": "physics",
                "pos": "noun"
            },
            {
                "word": "physio",
                "pos": "noun"
            },
            {
                "word": "physio-",
                "pos": "combining form"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the scientific study of matter and energy and the relationships between them, including the study of forces, heat, light, sound, electricity and the structure of atoms",
                    "vi": "nghiên cứu khoa học về vật chất và năng lượng và các mối quan hệ giữa chúng, bao gồm nghiên cứu lực, nhiệt, ánh sáng, âm thanh, điện và cấu trúc của nguyên tử"
                },
                "examples": [
                    {
                        "en": "a degree in physics",
                        "vi": "bằng vật lý"
                    },
                    {
                        "en": "quantum/theoretical physics",
                        "vi": "vật lý lượng tử / lý thuyết"
                    },
                    {
                        "en": "the laws of physics",
                        "vi": "định luật vật lý"
                    },
                    {
                        "en": "the physics laboratory/department",
                        "vi": "phòng thí nghiệm vật lý / khoa"
                    },
                    {
                        "en": "a physics professor/teacher",
                        "vi": "một giáo sư / giáo viên vật lý"
                    },
                    {
                        "en": "physics of something to study the physics of the electron",
                        "vi": "vật lý của một cái gì đó để nghiên cứu vật lý của electron"
                    }
                ]
            }
        ]
    },
    {
        "id": "decd200f3f9546a3bfc8112e66fa2d1f",
        "word": "business studies",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈbɪznəs stʌdiz/",
            "us": "/ˈbɪznəs stʌdiz/"
        },
        "nearby": [
            {
                "word": "business rates",
                "pos": "noun"
            },
            {
                "word": "business school",
                "pos": "noun"
            },
            {
                "word": "business studies",
                "pos": "noun"
            },
            {
                "word": "business-to-business",
                "pos": "adjective"
            },
            {
                "word": "business-to-consumer",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the study of subjects connected with money and managing a business",
                    "vi": "nghiên cứu các chủ đề liên quan đến tiền và quản lý một doanh nghiệp"
                },
                "examples": [
                    {
                        "en": "a degree in business studies",
                        "vi": "bằng cấp về nghiên cứu kinh doanh"
                    }
                ]
            }
        ]
    },
    {
        "id": "da9b3b7606394abd9ffd72870b08619d",
        "word": "engineering",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˌendʒɪˈnɪərɪŋ/",
            "us": "/ˌendʒɪˈnɪrɪŋ/"
        },
        "nearby": [
            {
                "word": "engineer",
                "pos": "noun"
            },
            {
                "word": "engineer",
                "pos": "verb"
            },
            {
                "word": "engineering",
                "pos": "noun"
            },
            {
                "word": "engine room",
                "pos": "noun"
            },
            {
                "word": "England",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the activity of applying scientific knowledge to the design, building and control of machines, roads, bridges, electrical equipment, etc.",
                    "vi": "hoạt động ứng dụng kiến thức khoa học vào thiết kế, chế tạo và điều khiển máy móc, đường xá, cầu cống, thiết bị điện, v.v."
                },
                "examples": [
                    {
                        "en": "The bridge is a triumph of modern engineering.",
                        "vi": "Cây cầu là một thành tựu của kỹ thuật hiện đại."
                    },
                    {
                        "en": "an engineering firm/company",
                        "vi": "một công ty / công ty kỹ thuật"
                    },
                    {
                        "en": "Train services on Sunday will be restricted because of engineering works.",
                        "vi": "Dịch vụ xe lửa vào Chủ Nhật sẽ bị hạn chế vì các công trình kỹ thuật."
                    }
                ]
            },
            {
                "define": {
                    "en": "the study of engineering as a subject",
                    "vi": "nghiên cứu kỹ thuật như một môn học"
                },
                "examples": [
                    {
                        "en": "a degree in engineering",
                        "vi": "bằng kỹ sư"
                    },
                    {
                        "en": "an engineering student",
                        "vi": "một sinh viên kỹ thuật"
                    }
                ]
            }
        ]
    },
    {
        "id": "06e224e3aec0467989da94e7542dfa7d",
        "word": "gymnastics",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/dʒɪmˈnæstɪks/",
            "us": "/dʒɪmˈnæstɪks/"
        },
        "nearby": [
            {
                "word": "gymnast",
                "pos": "noun"
            },
            {
                "word": "gymnastic",
                "pos": "adjective"
            },
            {
                "word": "gymnastics",
                "pos": "noun"
            },
            {
                "word": "gym shoe",
                "pos": "noun"
            },
            {
                "word": "gymslip",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "physical exercises, often using special equipment, that develop and show the body’s strength and ability to move and bend easily, often done as a sport in competitions",
                    "vi": "các bài tập thể chất, thường sử dụng thiết bị đặc biệt, phát triển và thể hiện sức mạnh của cơ thể cũng như khả năng di chuyển và uốn cong dễ dàng, thường được thực hiện như một môn thể thao trong các cuộc thi"
                },
                "examples": [
                    {
                        "en": "a gymnastics competition",
                        "vi": "một cuộc thi thể dục dụng cụ"
                    },
                    {
                        "en": "(figurative) mental/verbal gymnastics (= quick or clever thinking or use of words)",
                        "vi": "(nghĩa bóng) thể dục tâm thần / lời nói (= tư duy hoặc sử dụng từ ngữ nhanh chóng, thông minh)"
                    },
                    {
                        "en": "She does gymnastics at school.",
                        "vi": "Cô ấy tập thể dục ở trường."
                    }
                ]
            }
        ]
    },
    {
        "id": "47e9f189272f4c50a383d0c7ce235ad3",
        "word": "information technology",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˌɪnfəˌmeɪʃn tekˈnɒlədʒi/",
            "us": "/ˌɪnfərˌmeɪʃn tekˈnɑːlədʒi/"
        },
        "nearby": [
            {
                "word": "information science",
                "pos": "noun"
            },
            {
                "word": "information security",
                "pos": "noun"
            },
            {
                "word": "information technology",
                "pos": "noun"
            },
            {
                "word": "information theory",
                "pos": "noun"
            },
            {
                "word": "informative",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the study or use of electronic equipment, especially computers, for storing, accessing, analysing and sending information",
                    "vi": "nghiên cứu hoặc sử dụng thiết bị điện tử, đặc biệt là máy tính, để lưu trữ, truy cập, phân tích và gửi thông tin"
                },
                "examples": [
                    {
                        "en": "Recent advances in information technology have led to important changes in the operation of offices.",
                        "vi": "Những tiến bộ gần đây của công nghệ thông tin đã dẫn đến những thay đổi quan trọng trong hoạt động của các văn phòng."
                    }
                ]
            }
        ]
    },
    {
        "id": "f07281858c06490a8ec16877d2c8c0cd",
        "word": "law",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/lɔː/",
            "us": "/lɔː/"
        },
        "nearby": [
            {
                "word": "lavish on",
                "pos": "phrasal verb"
            },
            {
                "word": "lavish upon",
                "pos": "phrasal verb"
            },
            {
                "word": "law",
                "pos": "noun"
            },
            {
                "word": "Bonar Law",
                "pos": ""
            },
            {
                "word": "law-abiding",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a rule that deals with a particular crime, agreement, etc.",
                    "vi": "quy tắc xử lý một tội phạm cụ thể, thỏa thuận, v.v."
                },
                "examples": [
                    {
                        "en": "to pass a law (= officially make it part of the system of laws)",
                        "vi": "để thông qua luật (= chính thức biến nó thành một phần của hệ thống luật)"
                    },
                    {
                        "en": "law against (doing) something Police don't have the resources to enforce the law against dumping waste.",
                        "vi": "luật chống lại (làm) điều gì đó Cảnh sát không có đủ nguồn lực để thực thi luật chống đổ chất thải."
                    },
                    {
                        "en": "(informal) There ought to be a law against it!",
                        "vi": "(không chính thức) Cần phải có luật chống lại nó!"
                    },
                    {
                        "en": "law on something The company's actions violated the law on equal employment.",
                        "vi": "luật về điều gì đó Các hành động của công ty đã vi phạm luật về việc làm bình đẳng."
                    },
                    {
                        "en": "The suspects were in clear violation of immigration laws.",
                        "vi": "Các nghi phạm rõ ràng đã vi phạm luật nhập cư."
                    }
                ]
            },
            {
                "define": {
                    "en": "the whole system of rules that everyone in a country or society must obey",
                    "vi": "toàn bộ hệ thống quy tắc mà mọi người trong một quốc gia hoặc xã hội phải tuân theo"
                },
                "examples": [
                    {
                        "en": "If they entered the building they would be breaking the law.",
                        "vi": "Nếu họ bước vào tòa nhà, họ sẽ phạm luật."
                    },
                    {
                        "en": "The reforms have recently become law.",
                        "vi": "Những cải cách gần đây đã trở thành luật."
                    },
                    {
                        "en": "The Civil Rights Act of 1964 became the law of the land on July 2, 1964.",
                        "vi": "Đạo luật Quyền Công dân năm 1964 trở thành luật đất đai vào ngày 2 tháng 7 năm 1964."
                    },
                    {
                        "en": "state/federal law",
                        "vi": "luật tiểu bang / liên bang"
                    },
                    {
                        "en": "State law prohibits gambling in public places.",
                        "vi": "Luật tiểu bang nghiêm cấm đánh bạc ở nơi công cộng."
                    },
                    {
                        "en": "against the law In Sweden it is against the law to hit a child.",
                        "vi": "chống lại luật pháp Ở Thụy Điển, việc đánh một đứa trẻ là vi phạm pháp luật."
                    },
                    {
                        "en": "within the law Defence attorneys can use any means within the law to get their client off.",
                        "vi": "trong luật Các luật sư bào chữa có thể sử dụng bất kỳ phương tiện nào trong luật để đuổi khách hàng của họ."
                    },
                    {
                        "en": "outside the law to operate outside the law",
                        "vi": "ngoài pháp luật hoạt động ngoài pháp luật"
                    },
                    {
                        "en": "by law British schools are required by law to publish their exam results.",
                        "vi": "theo luật Các trường ở Anh được yêu cầu theo luật phải công bố kết quả kỳ thi của họ."
                    },
                    {
                        "en": "under the (…) law | under… law Under existing law, journalists cannot refuse to provide information to a jury.",
                        "vi": "theo (…) luật | theo… luật Theo luật hiện hành, các nhà báo không thể từ chối cung cấp thông tin cho bồi thẩm đoàn."
                    },
                    {
                        "en": "above the law Do not think you are above the law (= that you cannot be punished by the law).",
                        "vi": "Trên cả luật pháp Đừng nghĩ rằng bạn ở trên luật pháp (= rằng bạn không thể bị trừng phạt bởi luật pháp)."
                    },
                    {
                        "en": "They acted in accordance with the law of the country.",
                        "vi": "Họ đã hành động phù hợp với luật pháp của đất nước."
                    },
                    {
                        "en": "The constitution guarantees equality before the law for all.",
                        "vi": "Hiến pháp bảo đảm sự bình đẳng trước pháp luật cho tất cả mọi người."
                    },
                    {
                        "en": "law enforcement agencies/officials",
                        "vi": "các cơ quan / quan chức thực thi pháp luật"
                    },
                    {
                        "en": "(humorous) Kate's word was law in the Brown household.",
                        "vi": "(hài hước) Lời của Kate là luật trong gia đình Brown."
                    }
                ]
            },
            {
                "define": {
                    "en": "a particular branch of the law",
                    "vi": "một nhánh luật cụ thể"
                },
                "examples": [
                    {
                        "en": "He specializes in international law.",
                        "vi": "Ông ấy chuyên về luật quốc tế."
                    },
                    {
                        "en": "tax/employment law",
                        "vi": "luật thuế / việc làm"
                    },
                    {
                        "en": "according to… law According to copyright law, the author is the owner of the material.",
                        "vi": "theo… luật Theo luật bản quyền, tác giả là chủ sở hữu của tài liệu."
                    }
                ]
            },
            {
                "define": {
                    "en": "the study of the law as a subject at university, etc.; the profession of being a lawyer",
                    "vi": "nghiên cứu luật như một môn học ở trường đại học, v.v.; nghề luật sư"
                },
                "examples": [
                    {
                        "en": "a law student/professor",
                        "vi": "một sinh viên luật / giáo sư"
                    },
                    {
                        "en": "Jane is studying law.",
                        "vi": "Jane đang học luật."
                    },
                    {
                        "en": "(North American English) He's in law school.",
                        "vi": "(Tiếng Anh Bắc Mỹ) Anh ấy đang học trường luật."
                    },
                    {
                        "en": "(British English) He's at law school.",
                        "vi": "(Anh Anh) Anh ấy đang ở trường luật."
                    },
                    {
                        "en": "What made you go into law?",
                        "vi": "Điều gì đã khiến bạn sa vào pháp luật?"
                    },
                    {
                        "en": "a law firm",
                        "vi": "một công ty luật"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to refer to the police and the legal system",
                    "vi": "dùng để chỉ cảnh sát và hệ thống pháp luật"
                },
                "examples": [
                    {
                        "en": "Jim is always getting into trouble with the law.",
                        "vi": "Jim luôn gặp rắc rối với luật pháp."
                    },
                    {
                        "en": "She was well known for her brushes with the law.",
                        "vi": "Cô ấy nổi tiếng với những bàn chải của mình với luật pháp."
                    }
                ]
            },
            {
                "define": {
                    "en": "the fact that something always happens in the same way in an activity or in nature",
                    "vi": "thực tế là một cái gì đó luôn xảy ra theo cùng một cách trong một hoạt động hoặc trong tự nhiên"
                },
                "examples": [
                    {
                        "en": "The usual laws of supply and demand do not seem to apply in this case.",
                        "vi": "Quy luật cung và cầu thông thường dường như không áp dụng trong trường hợp này."
                    },
                    {
                        "en": "the laws of nature/physics",
                        "vi": "quy luật tự nhiên / vật lý"
                    }
                ]
            },
            {
                "define": {
                    "en": "a scientific rule that somebody has stated to explain a natural process",
                    "vi": "một quy tắc khoa học mà ai đó đã nêu ra để giải thích một quá trình tự nhiên"
                },
                "examples": [
                    {
                        "en": "the first law of thermodynamics",
                        "vi": "định luật đầu tiên của nhiệt động lực học"
                    },
                    {
                        "en": "Do you remember anything about Ohm's Law?",
                        "vi": "Bạn có nhớ gì về Định luật Ohm không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "one of the rules that controls an organization or activity",
                    "vi": "một trong những quy tắc kiểm soát một tổ chức hoặc hoạt động"
                },
                "examples": [
                    {
                        "en": "the laws of the Church",
                        "vi": "luật của Giáo hội"
                    },
                    {
                        "en": "The first law of kung fu is to defend yourself.",
                        "vi": "Luật đầu tiên của kung fu là tự vệ."
                    },
                    {
                        "en": "the laws of cricket",
                        "vi": "luật chơi cricket"
                    }
                ]
            },
            {
                "define": {
                    "en": "a rule for good behaviour or how you should behave in a particular place or situation",
                    "vi": "quy tắc cho hành vi tốt hoặc cách bạn nên cư xử trong một địa điểm hoặc tình huống cụ thể"
                },
                "examples": [
                    {
                        "en": "He frequently behaved as though moral laws did not exist.",
                        "vi": "Anh ta thường cư xử như thể luật đạo đức không tồn tại."
                    },
                    {
                        "en": "Their world is shaped by their parents' attitudes and the unspoken laws of the street.",
                        "vi": "Thế giới của chúng được định hình bởi thái độ của cha mẹ và những luật bất thành văn trên đường phố."
                    }
                ]
            },
            {
                "define": {
                    "en": "to behave in an independent way and ignore rules or what other people want you to do",
                    "vi": "cư xử theo cách độc lập và phớt lờ các quy tắc hoặc những gì người khác muốn bạn làm"
                },
                "examples": [
                    {
                        "en": "Boys of that age are a law unto themselves.",
                        "vi": "Con trai ở độ tuổi đó là một quy luật đối với bản thân."
                    }
                ]
            },
            {
                "define": {
                    "en": "to ask a court to settle a problem or disagreement",
                    "vi": "yêu cầu tòa án giải quyết vấn đề hoặc bất đồng"
                },
                "examples": [
                    {
                        "en": "They went to law to get back their property.",
                        "vi": "Họ đã tìm đến pháp luật để lấy lại tài sản của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "a situation in which people obey the law and behave in a peaceful way",
                    "vi": "một tình huống mà mọi người tuân theo luật pháp và cư xử một cách hòa bình"
                },
                "examples": [
                    {
                        "en": "The government struggled to maintain law and order.",
                        "vi": "Chính phủ đã đấu tranh để duy trì luật pháp và trật tự."
                    },
                    {
                        "en": "After the riots, the military was brought in to restore law and order.",
                        "vi": "Sau cuộc bạo loạn, quân đội đã được đưa đến để khôi phục lại luật pháp và trật tự."
                    },
                    {
                        "en": "They claim to be the party of law and order.",
                        "vi": "Họ tự xưng là đảng của luật pháp và trật tự."
                    },
                    {
                        "en": "Martial law was imposed to prevent the breakdown of law and order.",
                        "vi": "Thiết quân luật đã được áp dụng để ngăn chặn sự phá vỡ luật pháp và trật tự."
                    }
                ]
            },
            {
                "define": {
                    "en": "the principle that one thing will happen as often as another if you try enough times",
                    "vi": "nguyên tắc rằng một việc sẽ xảy ra thường xuyên như một điều khác nếu bạn cố gắng đủ lần"
                },
                "examples": [
                    {
                        "en": "Keep applying and by the law of averages you'll get a job sooner or later.",
                        "vi": "Hãy tiếp tục nộp đơn và theo quy luật trung bình bạn sẽ sớm có việc làm."
                    }
                ]
            },
            {
                "define": {
                    "en": "a situation in which people are prepared to harm other people in order to succeed",
                    "vi": "một tình huống trong đó mọi người chuẩn bị để làm hại người khác để thành công"
                },
                "examples": [
                    {
                        "en": "These criminal gangs only recognize the law of the jungle.",
                        "vi": "Các băng nhóm tội phạm này chỉ thừa nhận luật rừng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to tell somebody with force what they should or should not do",
                    "vi": "buộc phải nói với ai đó những gì họ nên làm hoặc không nên làm"
                },
                "examples": [
                    {
                        "en": "My dad started laying down the law about what time I should come home.",
                        "vi": "Bố tôi bắt đầu đặt ra luật về thời gian tôi nên về nhà."
                    }
                ]
            },
            {
                "define": {
                    "en": "the exact words of a law or rule rather than its general meaning",
                    "vi": "những từ chính xác của một luật hoặc quy tắc hơn là ý nghĩa chung của nó"
                },
                "examples": [
                    {
                        "en": "They insist on sticking to the letter of the law.",
                        "vi": "Họ nhất quyết bám sát luật lệ."
                    },
                    {
                        "en": "We might be guilty of slightly bending the letter of the law.",
                        "vi": "Chúng tôi có thể phạm tội khi hơi bẻ cong văn bản của luật pháp."
                    },
                    {
                        "en": "In spite of the difficulties it would cause her family, the judge stuck to the letter of the law and jailed her.",
                        "vi": "Bất chấp những khó khăn mà nó sẽ gây ra cho gia đình cô, thẩm phán vẫn tuân theo luật lệ và bỏ tù cô."
                    }
                ]
            },
            {
                "define": {
                    "en": "in trouble with the police",
                    "vi": "gặp rắc rối với cảnh sát"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "if you already have or control something, it is difficult for somebody else to take it away from you, even if they have the legal right to it",
                    "vi": "nếu bạn đã có hoặc kiểm soát một thứ gì đó, thì rất khó để người khác lấy đi nó khỏi bạn, ngay cả khi họ có quyền hợp pháp đối với nó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the condition in which all members of society, including its political leaders, accept the authority of the law",
                    "vi": "điều kiện trong đó tất cả các thành viên của xã hội, bao gồm cả các nhà lãnh đạo chính trị của nó, chấp nhận thẩm quyền của pháp luật"
                },
                "examples": [
                    {
                        "en": "Democracy and the rule of law are yet to be firmly established in the country.",
                        "vi": "Dân chủ và pháp quyền vẫn chưa được thiết lập vững chắc trong nước."
                    }
                ]
            },
            {
                "define": {
                    "en": "to do something illegal in order to punish somebody for doing something wrong, instead of letting the police deal with them",
                    "vi": "làm điều gì đó bất hợp pháp để trừng phạt ai đó đã làm điều gì đó sai trái, thay vì để cảnh sát xử lý họ"
                },
                "examples": [
                    {
                        "en": "After a series of burglaries in the area, the police are worried that residents might take the law into their own hands.",
                        "vi": "Sau hàng loạt vụ trộm trên địa bàn, cảnh sát lo ngại cư dân có thể sa lưới pháp luật."
                    },
                    {
                        "en": "When police failed to arrest the suspect, local people took the law into their own hands and beat him up.",
                        "vi": "Khi cảnh sát không bắt được nghi phạm, người dân địa phương đã lao vào luật pháp và đánh anh ta tới tấp."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to tell somebody who is criticizing you that you are not doing anything wrong",
                    "vi": "được sử dụng để nói với ai đó đang chỉ trích bạn rằng bạn không làm gì sai"
                },
                "examples": [
                    {
                        "en": "I'll sing if I want to—there's no law against it.",
                        "vi": "Tôi sẽ hát nếu tôi muốn - không có luật nào chống lại điều đó."
                    }
                ]
            }
        ]
    },
    {
        "id": "bd0ce9ba9bc44ae59c936989c5ee9416",
        "word": "PE",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˌpiː ˈiː/",
            "us": "/ˌpiː ˈiː/"
        },
        "nearby": [
            {
                "word": "PDSA",
                "pos": ""
            },
            {
                "word": "PDT",
                "pos": "abbreviation"
            },
            {
                "word": "PE",
                "pos": "noun"
            },
            {
                "word": "pea",
                "pos": "noun"
            },
            {
                "word": "peace",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "sport and exercise that is taught in schools (the abbreviation for ‘physical education’)",
                    "vi": "thể dục thể thao được dạy trong trường học (viết tắt của 'giáo dục thể chất')"
                },
                "examples": [
                    {
                        "en": "a PE class",
                        "vi": "một lớp thể dục"
                    },
                    {
                        "en": "a PE lesson/teacher",
                        "vi": "một bài học / giáo viên thể dục"
                    }
                ]
            }
        ]
    },
    {
        "id": "f99f9982a1424cecab231894de33e494",
        "word": "physical education",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˌfɪzɪkl edʒuˈkeɪʃn/",
            "us": "/ˌfɪzɪkl edʒuˈkeɪʃn/"
        },
        "nearby": [
            {
                "word": "physical",
                "pos": "noun"
            },
            {
                "word": "physical distancing",
                "pos": "noun"
            },
            {
                "word": "physical education",
                "pos": "noun"
            },
            {
                "word": "physical geography",
                "pos": "noun"
            },
            {
                "word": "physicality",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "sport and exercise that is taught in schools",
                    "vi": "thể dục thể thao được dạy trong trường học"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "116ebc238625431facee9c7160af5227",
        "word": "politics",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈpɒlətɪks/",
            "us": "/ˈpɑːlətɪks/"
        },
        "nearby": [
            {
                "word": "politicking",
                "pos": "noun"
            },
            {
                "word": "politico",
                "pos": "noun"
            },
            {
                "word": "politics",
                "pos": "noun"
            },
            {
                "word": "polity",
                "pos": "noun"
            },
            {
                "word": "James K Polk",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the activities involved in getting and using power in public life, and being able to influence decisions that affect a country or a society",
                    "vi": "các hoạt động liên quan đến việc giành và sử dụng quyền lực trong đời sống công cộng, và có thể tác động đến các quyết định có ảnh hưởng đến một quốc gia hoặc một xã hội"
                },
                "examples": [
                    {
                        "en": "world/international politics",
                        "vi": "chính trị thế giới / quốc tế"
                    },
                    {
                        "en": "domestic/national/local politics",
                        "vi": "chính trị trong nước / quốc gia / địa phương"
                    },
                    {
                        "en": "progressive/radical politics",
                        "vi": "chính trị tiến bộ / cấp tiến"
                    },
                    {
                        "en": "in politics She is aiming for a career in politics.",
                        "vi": "trong chính trị Cô ấy đang hướng tới một sự nghiệp trong lĩnh vực chính trị."
                    },
                    {
                        "en": "a major figure in British politics",
                        "vi": "một nhân vật lớn trong chính trị Anh"
                    },
                    {
                        "en": "Have you considered going into politics (= trying to become a Member of Parliament, Congress, etc.)?",
                        "vi": "Bạn đã tính đến việc tham gia chính trị (= cố gắng trở thành Nghị sĩ, Quốc hội, v.v.) chưa?"
                    },
                    {
                        "en": "The economy has been the major issue in electoral politics.",
                        "vi": "Kinh tế là vấn đề chính trong chính trị bầu cử."
                    },
                    {
                        "en": "This issue is beyond partisan politics (= when people strongly support one party or another).",
                        "vi": "Vấn đề này nằm ngoài chính trị đảng phái (= khi mọi người ủng hộ mạnh mẽ đảng này hay đảng khác)."
                    }
                ]
            },
            {
                "define": {
                    "en": "matters connected with getting or using power within a particular group or organization",
                    "vi": "các vấn đề liên quan đến việc nhận hoặc sử dụng quyền lực trong một nhóm hoặc tổ chức cụ thể"
                },
                "examples": [
                    {
                        "en": "I don't want to get involved in office politics.",
                        "vi": "Tôi không muốn dính líu đến chính trị văn phòng."
                    },
                    {
                        "en": "the internal politics of the legal profession",
                        "vi": "chính trị nội bộ của nghề luật sư"
                    },
                    {
                        "en": "racial/gender/sexual politics (= connected with relationships of power between different groups in society)",
                        "vi": "chính trị chủng tộc / giới tính / tình dục (= kết nối với các mối quan hệ quyền lực giữa các nhóm khác nhau trong xã hội)"
                    },
                    {
                        "en": "the politics of something the politics of identity/race/gender",
                        "vi": "chính trị của một cái gì đó chính trị của bản sắc / chủng tộc / giới tính"
                    },
                    {
                        "en": "the politics of fear/envy/division/hate (= when people are influenced by fear, envy, etc.)",
                        "vi": "chính trị của sự sợ hãi / đố kỵ / chia rẽ / ghét bỏ (= khi mọi người bị ảnh hưởng bởi sự sợ hãi, đố kỵ, v.v.)"
                    }
                ]
            },
            {
                "define": {
                    "en": "a person’s political views or beliefs",
                    "vi": "quan điểm chính trị hoặc niềm tin của một người"
                },
                "examples": [
                    {
                        "en": "His politics are extreme.",
                        "vi": "Chính trị của ông ấy là cực đoan."
                    }
                ]
            },
            {
                "define": {
                    "en": "the study of government and politics",
                    "vi": "nghiên cứu về chính phủ và chính trị"
                },
                "examples": [
                    {
                        "en": "a degree in Politics",
                        "vi": "bằng chính trị"
                    }
                ]
            },
            {
                "define": {
                    "en": "a system of political beliefs; a state of political affairs",
                    "vi": "hệ thống niềm tin chính trị; tình trạng của các vấn đề chính trị"
                },
                "examples": [
                    {
                        "en": "A politics of the future has to engage with new ideas.",
                        "vi": "Một nền chính trị của tương lai phải gắn kết với những ý tưởng mới."
                    }
                ]
            }
        ]
    },
    {
        "id": "e127fdc035e740859c9f72c5ababa169",
        "word": "programme",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈprəʊɡræm/",
            "us": "/ˈprəʊɡræm/"
        },
        "nearby": [
            {
                "word": "programmatic",
                "pos": "adjective"
            },
            {
                "word": "programmatically",
                "pos": "adverb"
            },
            {
                "word": "programme",
                "pos": "noun"
            },
            {
                "word": "programme",
                "pos": "verb"
            },
            {
                "word": "programmed learning",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "something that people watch on television or listen to on the radio",
                    "vi": "một cái gì đó mà mọi người xem trên truyền hình hoặc nghe trên đài phát thanh"
                },
                "examples": [
                    {
                        "en": "a news programme",
                        "vi": "một chương trình tin tức"
                    },
                    {
                        "en": "a TV/television/radio programme",
                        "vi": "một chương trình TV / truyền hình / đài phát thanh"
                    },
                    {
                        "en": "What time is that programme on?",
                        "vi": "Chương trình đó đang diễn ra lúc mấy giờ?"
                    },
                    {
                        "en": "programme about something I watched a programme about volcanoes.",
                        "vi": "chương trình về điều gì đó Tôi đã xem một chương trình về núi lửa."
                    },
                    {
                        "en": "programme on something Did you see that programme on India last night?",
                        "vi": "chương trình về điều gì đó Bạn có xem chương trình đó ở Ấn Độ tối qua không?"
                    },
                    {
                        "en": "a programme on BBC1",
                        "vi": "một chương trình trên BBC1"
                    }
                ]
            },
            {
                "define": {
                    "en": "a plan of things that will be done or included in the development of something",
                    "vi": "một kế hoạch về những thứ sẽ được thực hiện hoặc bao gồm trong quá trình phát triển một thứ gì đó"
                },
                "examples": [
                    {
                        "en": "the country's nuclear weapons/space programme",
                        "vi": "vũ khí hạt nhân / chương trình không gian của đất nước"
                    },
                    {
                        "en": "We have recently launched a research programme.",
                        "vi": "Gần đây chúng tôi đã khởi động một chương trình nghiên cứu."
                    },
                    {
                        "en": "The zoo runs several breeding programmes.",
                        "vi": "Vườn thú thực hiện một số chương trình nhân giống."
                    },
                    {
                        "en": "programme for somebody a training programme for new staff",
                        "vi": "chương trình cho ai đó chương trình đào tạo cho nhân viên mới"
                    },
                    {
                        "en": "Our centres offer training programmes designed for all types of athletes.",
                        "vi": "Các trung tâm của chúng tôi cung cấp các chương trình đào tạo được thiết kế cho tất cả các loại vận động viên."
                    },
                    {
                        "en": "programme of something The government is implementing a programme of reform.",
                        "vi": "chương trình của một cái gì đó Chính phủ đang thực hiện một chương trình cải cách."
                    },
                    {
                        "en": "programme to do something The college has initiated a programme to improve student retention.",
                        "vi": "chương trình để làm điều gì đó Trường cao đẳng đã khởi xướng một chương trình để cải thiện khả năng giữ chân học sinh."
                    }
                ]
            },
            {
                "define": {
                    "en": "a course of study",
                    "vi": "một khóa học"
                },
                "examples": [
                    {
                        "en": "a school/an educational programme",
                        "vi": "một trường học / một chương trình giáo dục"
                    },
                    {
                        "en": "The college offers a wide variety of programmes of study.",
                        "vi": "Trường cung cấp nhiều chương trình học đa dạng."
                    },
                    {
                        "en": "programme in something She enrolled in a Master's programme in American history.",
                        "vi": "chương trình trong một cái gì đó Cô đăng ký vào một chương trình Thạc sĩ về lịch sử Hoa Kỳ."
                    }
                ]
            },
            {
                "define": {
                    "en": "an organized order of performances or events",
                    "vi": "một thứ tự có tổ chức của các buổi biểu diễn hoặc sự kiện"
                },
                "examples": [
                    {
                        "en": "The concert is the highlight of the festival's musical programme.",
                        "vi": "Buổi biểu diễn là điểm nhấn trong chương trình âm nhạc của lễ hội."
                    },
                    {
                        "en": "programme of something a week-long programme of lectures",
                        "vi": "chương trình của một cái gì đó một chương trình dài một tuần các bài giảng"
                    },
                    {
                        "en": "We're planning an exciting programme of events.",
                        "vi": "Chúng tôi đang lên kế hoạch cho một chương trình sự kiện thú vị."
                    },
                    {
                        "en": "What's the programme for (= what are we going to do) tomorrow?",
                        "vi": "Chương trình cho (= chúng ta sẽ làm gì) vào ngày mai?"
                    }
                ]
            },
            {
                "define": {
                    "en": "a thin book or a piece of paper that gives you information about a play, a concert, etc.",
                    "vi": "một cuốn sách mỏng hoặc một mảnh giấy cung cấp cho bạn thông tin về một vở kịch, một buổi hòa nhạc, v.v."
                },
                "examples": [
                    {
                        "en": "a theatre programme",
                        "vi": "một chương trình sân khấu"
                    },
                    {
                        "en": "Her name doesn't appear in the concert programme.",
                        "vi": "Tên của cô ấy không xuất hiện trong chương trình hòa nhạc."
                    }
                ]
            },
            {
                "define": {
                    "en": "a series of actions done by a machine, such as a washing machine",
                    "vi": "một loạt các hành động được thực hiện bởi một máy, chẳng hạn như máy giặt"
                },
                "examples": [
                    {
                        "en": "Select a cool programme for woollen clothes.",
                        "vi": "Chọn một chương trình mát mẻ cho quần áo len."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to tell somebody that they should change their attitude and do what they are supposed to be doing",
                    "vi": "được sử dụng để nói với ai đó rằng họ nên thay đổi thái độ của mình và làm những gì họ được cho là phải làm"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "e4e967db22aa4e4fbb3e104aaaefb8d5",
        "word": "compulsory",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/kəmˈpʌlsəri/",
            "us": "/kəmˈpʌlsəri/"
        },
        "nearby": [
            {
                "word": "compulsively",
                "pos": "adverb"
            },
            {
                "word": "compulsorily",
                "pos": "adverb"
            },
            {
                "word": "compulsory",
                "pos": "adjective"
            },
            {
                "word": "compulsory purchase",
                "pos": "noun"
            },
            {
                "word": "compunction",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "that must be done because of a law or a rule",
                    "vi": "điều đó phải được thực hiện vì luật hoặc quy tắc"
                },
                "examples": [
                    {
                        "en": "English is a compulsory subject at this level.",
                        "vi": "Tiếng Anh là môn học bắt buộc ở cấp học này."
                    },
                    {
                        "en": "compulsory education/schooling",
                        "vi": "giáo dục bắt buộc / đi học"
                    },
                    {
                        "en": "The strikers are protesting against the threat of compulsory redundancies.",
                        "vi": "Các tiền đạo đang phản đối mối đe dọa về việc thừa bắt buộc."
                    },
                    {
                        "en": "There is no compulsory education in this part of Africa.",
                        "vi": "Không có giáo dục bắt buộc ở khu vực này của Châu Phi."
                    },
                    {
                        "en": "it is compulsory (for somebody/something) to do something It is compulsory for all motorcyclists to wear helmets.",
                        "vi": "bắt buộc (đối với ai đó / điều gì đó) làm điều gì đó Mọi người điều khiển xe mô tô phải đội mũ bảo hiểm."
                    }
                ]
            }
        ]
    },
    {
        "id": "baac808410b04af1aa51446e3fc9bdb8",
        "word": "curriculum",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/kəˈrɪkjələm/",
            "us": "/kəˈrɪkjələm/"
        },
        "nearby": [
            {
                "word": "currently",
                "pos": "adverb"
            },
            {
                "word": "curricular",
                "pos": "adjective"
            },
            {
                "word": "curriculum",
                "pos": "noun"
            },
            {
                "word": "curriculum vitae",
                "pos": "noun"
            },
            {
                "word": "curried",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the subjects that are included in a course of study or taught in a school, college, etc.",
                    "vi": "các môn học được bao gồm trong một quá trình nghiên cứu hoặc được giảng dạy trong một trường học, trường cao đẳng, v.v."
                },
                "examples": [
                    {
                        "en": "The school curriculum should be as broad as possible.",
                        "vi": "Chương trình giảng dạy của trường nên càng rộng càng tốt."
                    },
                    {
                        "en": "on the curriculum (British English) Spanish is on the curriculum.",
                        "vi": "trên chương trình giảng dạy (tiếng Anh Anh) Tiếng Tây Ban Nha có trong chương trình giảng dạy."
                    },
                    {
                        "en": "in the curriculum (North American English) Spanish is in the curriculum.",
                        "vi": "trong chương trình giảng dạy (Tiếng Anh Bắc Mỹ) Tiếng Tây Ban Nha có trong chương trình giảng dạy."
                    }
                ]
            }
        ]
    },
    {
        "id": "923fa3f21d53486b8da7e20e8740cded",
        "word": "economics",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˌiːkəˈnɒmɪks/",
            "us": "/ˌiːkəˈnɑːmɪks/"
        },
        "nearby": [
            {
                "word": "Economic and Monetary Union",
                "pos": ""
            },
            {
                "word": "economic migrant",
                "pos": "noun"
            },
            {
                "word": "economics",
                "pos": "noun"
            },
            {
                "word": "economist",
                "pos": "noun"
            },
            {
                "word": "The Economist",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the study of how a society organizes its money, trade and industry",
                    "vi": "nghiên cứu về cách một xã hội tổ chức tiền, thương mại và công nghiệp của nó"
                },
                "examples": [
                    {
                        "en": "He studied politics and economics at Yale.",
                        "vi": "Ông học chính trị và kinh tế tại Yale."
                    },
                    {
                        "en": "Keynesian/Marxist economics",
                        "vi": "Kinh tế học Keynes / Mác xít"
                    },
                    {
                        "en": "trends in modern economics",
                        "vi": "xu hướng kinh tế học hiện đại"
                    }
                ]
            },
            {
                "define": {
                    "en": "the way in which money influences, or is organized within, an area of business or society",
                    "vi": "cách thức mà tiền ảnh hưởng hoặc được tổ chức trong một lĩnh vực kinh doanh hoặc xã hội"
                },
                "examples": [
                    {
                        "en": "The economics of the project are very encouraging.",
                        "vi": "Tính kinh tế của dự án là rất đáng khích lệ."
                    },
                    {
                        "en": "The economics of maintaining a safe environment are not just the concern of the government.",
                        "vi": "Tính kinh tế của việc duy trì một môi trường an toàn không chỉ là mối quan tâm của chính phủ."
                    }
                ]
            }
        ]
    },
    {
        "id": "8bc197e3c9224e10a96df16df72f053c",
        "word": "gender studies",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈdʒendə stʌdiz/",
            "us": "/ˈdʒendər stʌdiz/"
        },
        "nearby": [
            {
                "word": "gender reveal",
                "pos": "noun"
            },
            {
                "word": "gender-specific",
                "pos": "adjective"
            },
            {
                "word": "gender studies",
                "pos": "noun"
            },
            {
                "word": "gene",
                "pos": "noun"
            },
            {
                "word": "Gene",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the study of gender as a subject at university, college, etc.",
                    "vi": "nghiên cứu về giới như một môn học ở trường đại học, cao đẳng, v.v."
                },
                "examples": [
                    {
                        "en": "She teaches gender studies and political science at Hunter College.",
                        "vi": "Cô dạy nghiên cứu giới tính và khoa học chính trị tại Cao đẳng Hunter."
                    }
                ]
            }
        ]
    },
    {
        "id": "70e43c1384844129995d8d5b98d40571",
        "word": "geology",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/dʒiˈɒlədʒi/",
            "us": "/dʒiˈɑːlədʒi/"
        },
        "nearby": [
            {
                "word": "geologically",
                "pos": "adverb"
            },
            {
                "word": "geologist",
                "pos": "noun"
            },
            {
                "word": "geology",
                "pos": "noun"
            },
            {
                "word": "geomagnetic",
                "pos": "adjective"
            },
            {
                "word": "geomagnetism",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the scientific study of the physical structure of the earth, including the origin and history of the rocks and soil of which the earth is made",
                    "vi": "nghiên cứu khoa học về cấu trúc vật lý của trái đất, bao gồm nguồn gốc và lịch sử của các loại đá và đất mà trái đất được tạo thành"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the origin and history of the rocks and soil of a particular area",
                    "vi": "nguồn gốc và lịch sử của đá và đất của một khu vực cụ thể"
                },
                "examples": [
                    {
                        "en": "the geology of the British Isles",
                        "vi": "địa chất của quần đảo Anh"
                    }
                ]
            }
        ]
    },
    {
        "id": "919d421cd6824729b084a74b2e02ee20",
        "word": "ICT",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˌaɪ siː ˈtiː/",
            "us": "/ˌaɪ siː ˈtiː/"
        },
        "nearby": [
            {
                "word": "iconology",
                "pos": "noun"
            },
            {
                "word": "-ics",
                "pos": "suffix"
            },
            {
                "word": "ICT",
                "pos": "noun"
            },
            {
                "word": "ictus",
                "pos": "noun"
            },
            {
                "word": "ICU",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the study of the use of computers, the internet, video, and other technology as a subject at school (the abbreviation for ‘information and communications technology’)",
                    "vi": "nghiên cứu việc sử dụng máy tính, internet, video và công nghệ khác như một môn học ở trường (viết tắt của 'công nghệ thông tin và truyền thông')"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "cb7c8056e120431a8fb63386c769e964",
        "word": "media studies",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈmiːdiə stʌdiz/",
            "us": "/ˈmiːdiə stʌdiz/"
        },
        "nearby": [
            {
                "word": "median",
                "pos": "noun"
            },
            {
                "word": "media-savvy",
                "pos": "adjective"
            },
            {
                "word": "media studies",
                "pos": "noun"
            },
            {
                "word": "mediate",
                "pos": "verb"
            },
            {
                "word": "mediation",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the study of newspapers, television, radio, the internet, etc. as a subject at school, etc.",
                    "vi": "nghiên cứu báo chí, truyền hình, đài phát thanh, internet, v.v. như một môn học ở trường, v.v."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "180efd643dac4ba79c6f5119786f9e3f",
        "word": "module",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈmɒdjuːl/",
            "us": "/ˈmɑːdʒuːl/"
        },
        "nearby": [
            {
                "word": "modulate",
                "pos": "verb"
            },
            {
                "word": "modulation",
                "pos": "noun"
            },
            {
                "word": "module",
                "pos": "noun"
            },
            {
                "word": "modus operandi",
                "pos": "noun"
            },
            {
                "word": "modus vivendi",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a unit that can form part of a course of study, especially at a college or university in the UK",
                    "vi": "một đơn vị có thể tạo thành một phần của khóa học, đặc biệt là tại một trường cao đẳng hoặc đại học ở Vương quốc Anh"
                },
                "examples": [
                    {
                        "en": "The course consists of ten core modules and five optional modules.",
                        "vi": "Khóa học bao gồm mười mô-đun cốt lõi và năm mô-đun tùy chọn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a unit of a computer system or program that has a particular function",
                    "vi": "một đơn vị của hệ thống máy tính hoặc chương trình có một chức năng cụ thể"
                },
                "examples": [
                    {
                        "en": "You can buy memory modules to increase storage capacity.",
                        "vi": "Bạn có thể mua mô-đun bộ nhớ để tăng dung lượng lưu trữ."
                    },
                    {
                        "en": "New software modules include a virtual memory tool.",
                        "vi": "Mô-đun phần mềm mới bao gồm một công cụ bộ nhớ ảo."
                    }
                ]
            },
            {
                "define": {
                    "en": "one of a set of separate parts or units that can be joined together to make a machine, a piece of furniture, a building, etc.",
                    "vi": "một trong một tập hợp các bộ phận hoặc đơn vị riêng biệt có thể được kết hợp với nhau để tạo thành một chiếc máy, một món đồ nội thất, một tòa nhà, v.v."
                },
                "examples": [
                    {
                        "en": "Ships are now built in modules rather than built in a whole from the base up.",
                        "vi": "Các con tàu hiện được xây dựng theo mô-đun thay vì được xây dựng toàn bộ từ cơ sở trở lên."
                    }
                ]
            },
            {
                "define": {
                    "en": "a unit of a spacecraft that can function independently of the main part",
                    "vi": "một đơn vị của tàu vũ trụ có thể hoạt động độc lập với bộ phận chính"
                },
                "examples": [
                    {
                        "en": "Photographs were taken from a lunar module",
                        "vi": "Các bức ảnh được chụp từ một mô-đun mặt trăng"
                    },
                    {
                        "en": "the tiny command module of the spaceship",
                        "vi": "mô-đun lệnh nhỏ bé của tàu vũ trụ"
                    }
                ]
            }
        ]
    },
    {
        "id": "05625d629c1144d8ba023b55b10276ac",
        "word": "optional",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈɒpʃənl/",
            "us": "/ˈɑːpʃənl/"
        },
        "nearby": [
            {
                "word": "option",
                "pos": "noun"
            },
            {
                "word": "option",
                "pos": "verb"
            },
            {
                "word": "optional",
                "pos": "adjective"
            },
            {
                "word": "optometrist",
                "pos": "noun"
            },
            {
                "word": "optometry",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "that you can choose to do or have if you want to",
                    "vi": "mà bạn có thể chọn làm hoặc có nếu bạn muốn"
                },
                "examples": [
                    {
                        "en": "Certain courses are compulsory; others are optional.",
                        "vi": "Một số khóa học là bắt buộc; những người khác là tùy chọn."
                    },
                    {
                        "en": "This model comes with a number of optional extras (= things you can choose to have but which you will have to pay extra for).",
                        "vi": "Mô hình này đi kèm với một số tính năng bổ sung tùy chọn (= những thứ bạn có thể chọn để có nhưng bạn sẽ phải trả thêm tiền)."
                    },
                    {
                        "en": "These features can be offered as an optional part of the package.",
                        "vi": "Các tính năng này có thể được cung cấp như một phần tùy chọn của gói."
                    }
                ]
            }
        ]
    },
    {
        "id": "e4cd421fe11c4f248583d22e9bdd7e36",
        "word": "the performing arts",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ðə pəˌfɔːmɪŋ ˈɑːts/",
            "us": "/ðə pərˌfɔːrmɪŋ ˈɑːrts/"
        },
        "nearby": [
            {
                "word": "performative",
                "pos": "adjective"
            },
            {
                "word": "performer",
                "pos": "noun"
            },
            {
                "word": "the performing arts",
                "pos": "noun"
            },
            {
                "word": "perfume",
                "pos": "noun"
            },
            {
                "word": "perfume",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "arts such as music, dance and drama which are performed for an audience",
                    "vi": "nghệ thuật như âm nhạc, khiêu vũ và kịch được biểu diễn cho khán giả"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "d99cdfa025554dd096d187f91df5872a",
        "word": "philosophy",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/fəˈlɒsəfi/",
            "us": "/fəˈlɑːsəfi/"
        },
        "nearby": [
            {
                "word": "philosophize",
                "pos": "verb"
            },
            {
                "word": "philosophizing",
                "pos": "noun"
            },
            {
                "word": "philosophy",
                "pos": "noun"
            },
            {
                "word": "philtre",
                "pos": "noun"
            },
            {
                "word": "phishing",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the study of the nature and meaning of the universe and of human life",
                    "vi": "nghiên cứu về bản chất và ý nghĩa của vũ trụ và cuộc sống con người"
                },
                "examples": [
                    {
                        "en": "philosophy of something the philosophy of science",
                        "vi": "triết học của một cái gì đó triết học của khoa học"
                    },
                    {
                        "en": "a professor of philosophy",
                        "vi": "một giáo sư triết học"
                    },
                    {
                        "en": "a degree in philosophy",
                        "vi": "bằng triết học"
                    }
                ]
            },
            {
                "define": {
                    "en": "a particular set or system of beliefs resulting from the search for knowledge about life and the universe",
                    "vi": "một tập hợp hoặc hệ thống niềm tin cụ thể là kết quả của việc tìm kiếm kiến thức về cuộc sống và vũ trụ"
                },
                "examples": [
                    {
                        "en": "Buddhist/Eastern/Hindu philosophy",
                        "vi": "Triết học Phật giáo / Đông phương / Ấn Độ giáo"
                    },
                    {
                        "en": "the philosophy of Aristotle",
                        "vi": "triết lý của Aristotle"
                    },
                    {
                        "en": "the development of different philosophies",
                        "vi": "sự phát triển của các triết lý khác nhau"
                    }
                ]
            },
            {
                "define": {
                    "en": "a set of beliefs or an attitude to life that guides somebody’s behaviour",
                    "vi": "một tập hợp các niềm tin hoặc một thái độ sống để hướng dẫn hành vi của ai đó"
                },
                "examples": [
                    {
                        "en": "philosophy of something Her philosophy of life is to take every opportunity that presents itself.",
                        "vi": "triết lý về điều gì đó Triết lý sống của cô là tận dụng mọi cơ hội để thể hiện bản thân."
                    },
                    {
                        "en": "a furniture-maker's design philosophy",
                        "vi": "triết lý thiết kế của một nhà sản xuất đồ nội thất"
                    }
                ]
            }
        ]
    },
    {
        "id": "45117fc450174d0a997a053ac66fb9c0",
        "word": "psychology",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/saɪˈkɒlədʒi/",
            "us": "/saɪˈkɑːlədʒi/"
        },
        "nearby": [
            {
                "word": "psychological warfare",
                "pos": "noun"
            },
            {
                "word": "psychologist",
                "pos": "noun"
            },
            {
                "word": "psychology",
                "pos": "noun"
            },
            {
                "word": "psychometric",
                "pos": "adjective"
            },
            {
                "word": "psychopath",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the scientific study of the mind and how it influences behaviour",
                    "vi": "nghiên cứu khoa học về tâm trí và cách nó ảnh hưởng đến hành vi"
                },
                "examples": [
                    {
                        "en": "clinical/educational/child/sport psychology",
                        "vi": "tâm lý học lâm sàng / giáo dục / trẻ em / thể thao"
                    },
                    {
                        "en": "Kevin has a masters degree in psychology.",
                        "vi": "Kevin có bằng thạc sĩ tâm lý học."
                    },
                    {
                        "en": "She's a professor of psychology at Harvard University.",
                        "vi": "Cô ấy là giáo sư tâm lý học tại Đại học Harvard."
                    }
                ]
            },
            {
                "define": {
                    "en": "the kind of mind that somebody has that makes them think or behave in a particular way",
                    "vi": "loại tâm trí mà ai đó có khiến họ suy nghĩ hoặc hành xử theo một cách cụ thể"
                },
                "examples": [
                    {
                        "en": "psychology of somebody the psychology of small boys",
                        "vi": "tâm lý của ai đó tâm lý của những cậu bé nhỏ"
                    },
                    {
                        "en": "I help the actors understand the psychology of their characters.",
                        "vi": "Tôi giúp diễn viên hiểu tâm lý nhân vật của mình."
                    },
                    {
                        "en": "The answers we give will reflect our own psychology.",
                        "vi": "Câu trả lời mà chúng ta đưa ra sẽ phản ánh tâm lý của chính chúng ta."
                    },
                    {
                        "en": "Watching the shoppers at the sales gave her a first-hand insight into crowd psychology.",
                        "vi": "Quan sát những người mua sắm tại buổi bán hàng đã giúp cô ấy có cái nhìn đầu tiên về tâm lý đám đông."
                    }
                ]
            },
            {
                "define": {
                    "en": "how the mind influences behaviour in a particular area of life",
                    "vi": "tâm trí ảnh hưởng như thế nào đến hành vi trong một lĩnh vực cụ thể của cuộc sống"
                },
                "examples": [
                    {
                        "en": "psychology of something the psychology of interpersonal relationships",
                        "vi": "tâm lý của một cái gì đó tâm lý của các mối quan hệ giữa các cá nhân"
                    }
                ]
            }
        ]
    },
    {
        "id": "bebbe904ed8347e5a3459bf3a12c12c7",
        "word": "social science",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˌsəʊʃl ˈsaɪəns/",
            "us": "/ˌsəʊʃl ˈsaɪəns/"
        },
        "nearby": [
            {
                "word": "social psychologist",
                "pos": "noun"
            },
            {
                "word": "social psychology",
                "pos": "noun"
            },
            {
                "word": "social science",
                "pos": "noun"
            },
            {
                "word": "social scientist",
                "pos": "noun"
            },
            {
                "word": "social secretary",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the study of people in society",
                    "vi": "nghiên cứu về mọi người trong xã hội"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a particular subject connected with the study of people in society, for example geography, economics or sociology",
                    "vi": "một môn học cụ thể liên quan đến việc nghiên cứu con người trong xã hội, ví dụ như địa lý, kinh tế học hoặc xã hội học"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "abc1a73b1b5446219e1d50dc74678a12",
        "word": "social studies",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˌsəʊʃl ˈstʌdiz/",
            "us": "/ˈsəʊʃl stʌdiz/"
        },
        "nearby": [
            {
                "word": "social services",
                "pos": "noun"
            },
            {
                "word": "social software",
                "pos": "noun"
            },
            {
                "word": "social studies",
                "pos": "noun"
            },
            {
                "word": "social work",
                "pos": "noun"
            },
            {
                "word": "social worker",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the study of people in society",
                    "vi": "nghiên cứu về mọi người trong xã hội"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "d9fa562780e74a058310b31a91f94bfd",
        "word": "sociology",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˌsəʊsiˈɒlədʒi/",
            "us": "/ˌsəʊsiˈɑːlədʒi/"
        },
        "nearby": [
            {
                "word": "sociologically",
                "pos": "adverb"
            },
            {
                "word": "sociologist",
                "pos": "noun"
            },
            {
                "word": "sociology",
                "pos": "noun"
            },
            {
                "word": "sociopath",
                "pos": "noun"
            },
            {
                "word": "sociopolitical",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the scientific study of the nature and development of society and social behaviour",
                    "vi": "nghiên cứu khoa học về bản chất và sự phát triển của xã hội và hành vi xã hội"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "5f20ca0d3e2d4c9f8745aa338cd5fc95",
        "word": "summer school",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈsʌmə skuːl/",
            "us": "/ˈsʌmər skuːl/"
        },
        "nearby": [
            {
                "word": "summer house",
                "pos": "noun"
            },
            {
                "word": "summer pudding",
                "pos": "noun"
            },
            {
                "word": "summer school",
                "pos": "noun"
            },
            {
                "word": "summer stock",
                "pos": "noun"
            },
            {
                "word": "summer student",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "courses that are held in the summer at a university or college or, in the US, at a school",
                    "vi": "các khóa học được tổ chức vào mùa hè tại một trường đại học hoặc cao đẳng hoặc ở Hoa Kỳ, tại một trường học"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "67b877ceb8d44864b96b5267fd2bfcbd",
        "word": "algebra",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈældʒɪbrə/",
            "us": "/ˈældʒɪbrə/"
        },
        "nearby": [
            {
                "word": "algae",
                "pos": "noun"
            },
            {
                "word": "algal",
                "pos": "adjective"
            },
            {
                "word": "algebra",
                "pos": "noun"
            },
            {
                "word": "algebraic",
                "pos": "adjective"
            },
            {
                "word": "Horatio Alger",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a type of mathematics in which letters and symbols are used to represent quantities",
                    "vi": "một loại toán học trong đó các chữ cái và ký hiệu được sử dụng để biểu thị các đại lượng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c0b5f6dbbffd4776b11166ba46e505c8",
        "word": "arithmetic",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/əˈrɪθmətɪk/",
            "us": "/əˈrɪθmətɪk/"
        },
        "nearby": [
            {
                "word": "aristocratic",
                "pos": "adjective"
            },
            {
                "word": "Aristotelian",
                "pos": "adjective"
            },
            {
                "word": "arithmetic",
                "pos": "noun"
            },
            {
                "word": "arithmetic",
                "pos": "adjective"
            },
            {
                "word": "arithmetical",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the type of mathematics that deals with the adding, multiplying, etc. of numbers",
                    "vi": "loại toán học liên quan đến phép cộng, nhân, v.v. của các số"
                },
                "examples": [
                    {
                        "en": "He's not very good at arithmetic.",
                        "vi": "Anh ấy không giỏi số học lắm."
                    }
                ]
            },
            {
                "define": {
                    "en": "sums involving the adding, multiplying, etc. of numbers",
                    "vi": "tổng liên quan đến việc cộng, nhân, v.v. của các số"
                },
                "examples": [
                    {
                        "en": "a quick bit of mental arithmetic (= sums you do in your head, without writing anything down)",
                        "vi": "một chút tính nhẩm nhanh chóng (= tổng số bạn làm trong đầu mà không cần viết ra giấy)"
                    },
                    {
                        "en": "I think there's something wrong with your arithmetic.",
                        "vi": "Tôi nghĩ rằng có gì đó sai với số học của bạn."
                    },
                    {
                        "en": "I’ve worked out the price, but I need to check the arithmetic.",
                        "vi": "Tôi đã tính ra giá cả, nhưng tôi cần kiểm tra số học."
                    },
                    {
                        "en": "a test of mental arithmetic",
                        "vi": "một bài kiểm tra tính nhẩm"
                    }
                ]
            }
        ]
    },
    {
        "id": "d0c293f6311d45319b336ad6d29cea5a",
        "word": "classic",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈklæsɪk/",
            "us": "/ˈklæsɪk/"
        },
        "nearby": [
            {
                "word": "class-consciousness",
                "pos": "noun"
            },
            {
                "word": "classic",
                "pos": "adjective"
            },
            {
                "word": "classic",
                "pos": "noun"
            },
            {
                "word": "classical",
                "pos": "adjective"
            },
            {
                "word": "classically",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a book, film or song which is well known and considered to be of very high quality, setting standards for other books, etc.",
                    "vi": "một cuốn sách, bộ phim hoặc bài hát nổi tiếng và được coi là có chất lượng rất cao, đặt ra tiêu chuẩn cho những cuốn sách khác, v.v."
                },
                "examples": [
                    {
                        "en": "The film is now a cult classic.",
                        "vi": "Bộ phim hiện là một tác phẩm kinh điển đình đám."
                    },
                    {
                        "en": "The song became an instant classic.",
                        "vi": "Bài hát trở thành một tác phẩm kinh điển ngay lập tức."
                    },
                    {
                        "en": "The novel may become a modern classic.",
                        "vi": "Cuốn tiểu thuyết có thể trở thành một tác phẩm kinh điển hiện đại."
                    },
                    {
                        "en": "English classics such as ‘Alice in Wonderland’",
                        "vi": "Tác phẩm kinh điển của Anh như 'Alice ở xứ sở thần tiên'"
                    },
                    {
                        "en": "His book is something of a classic of the genre.",
                        "vi": "Cuốn sách của anh ấy là một cuốn sách kinh điển của thể loại này."
                    },
                    {
                        "en": "one of the true classics of French cinema",
                        "vi": "một trong những tác phẩm kinh điển thực sự của điện ảnh Pháp"
                    }
                ]
            },
            {
                "define": {
                    "en": "a thing that is an excellent example of its kind",
                    "vi": "một thứ là một ví dụ xuất sắc của loại hình này"
                },
                "examples": [
                    {
                        "en": "That match was a classic.",
                        "vi": "Trận đấu đó là một trận kinh điển."
                    },
                    {
                        "en": "The second goal was an absolute classic.",
                        "vi": "Bàn thắng thứ hai là một bàn thắng kinh điển tuyệt đối."
                    },
                    {
                        "en": "The professor's reply was a classic.",
                        "vi": "Câu trả lời của giáo sư là một câu trả lời kinh điển."
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of clothing, a vehicle or other item that is admired for its beautiful style or design that is not affected by changes in fashion",
                    "vi": "một bộ quần áo, một chiếc xe hoặc một món đồ khác được ngưỡng mộ vì kiểu dáng hoặc thiết kế đẹp mắt mà không bị ảnh hưởng bởi những thay đổi của thời trang"
                },
                "examples": [
                    {
                        "en": "Classics don't lose their style.",
                        "vi": "Các tác phẩm kinh điển không bị mất phong cách."
                    },
                    {
                        "en": "We pick out some collectors' cars and modern classics.",
                        "vi": "Chúng tôi chọn ra một số xe hơi của các nhà sưu tập và các tác phẩm cổ điển hiện đại."
                    }
                ]
            },
            {
                "define": {
                    "en": "the study of ancient Greek and Roman culture, especially their languages and literature",
                    "vi": "nghiên cứu văn hóa Hy Lạp và La Mã cổ đại, đặc biệt là ngôn ngữ và văn học của họ"
                },
                "examples": [
                    {
                        "en": "a degree in Classics",
                        "vi": "bằng cấp về Kinh điển"
                    }
                ]
            }
        ]
    },
    {
        "id": "359f2a06b2a84255bd37226048e18546",
        "word": "extracurricular",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌekstrəkəˈrɪkjələ(r)/",
            "us": "/ˌekstrəkəˈrɪkjələr/"
        },
        "nearby": [
            {
                "word": "extractive",
                "pos": "adjective"
            },
            {
                "word": "extractor",
                "pos": "noun"
            },
            {
                "word": "extracurricular",
                "pos": "adjective"
            },
            {
                "word": "extradite",
                "pos": "verb"
            },
            {
                "word": "extradition",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "not part of the usual course of work or studies at a school or college",
                    "vi": "không phải là một phần của quá trình làm việc hoặc nghiên cứu thông thường tại trường học hoặc trường cao đẳng"
                },
                "examples": [
                    {
                        "en": "She's involved in many extracurricular activities.",
                        "vi": "Cô ấy tham gia vào nhiều hoạt động ngoại khóa."
                    }
                ]
            }
        ]
    },
    {
        "id": "81840d02c47f435c935c7115406e149b",
        "word": "human geography",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌhjuːmən dʒiˈɒɡrəfi/",
            "us": "/ˌhjuːmən dʒiˈɑːɡrəfi/"
        },
        "nearby": [
            {
                "word": "human error",
                "pos": "noun"
            },
            {
                "word": "the Human Genome Project",
                "pos": ""
            },
            {
                "word": "human geography",
                "pos": "noun"
            },
            {
                "word": "human interest",
                "pos": "noun"
            },
            {
                "word": "humanism",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the scientific study of how human activity affects or is affected by the surface of the earth",
                    "vi": "nghiên cứu khoa học về cách hoạt động của con người ảnh hưởng hoặc bị ảnh hưởng bởi bề mặt trái đất"
                },
                "examples": [
                    {
                        "en": "She is a lecturer in the human geography of China.",
                        "vi": "Cô ấy là một giảng viên về địa lý nhân văn của Trung Quốc."
                    },
                    {
                        "en": "Human geography covers topics ranging from cultural differences and politics to agriculture and food production.",
                        "vi": "Địa lý nhân văn bao gồm các chủ đề khác nhau, từ sự khác biệt văn hóa và chính trị đến nông nghiệp và sản xuất lương thực."
                    }
                ]
            }
        ]
    },
    {
        "id": "342d352f28634e559a54defbbb5b706d",
        "word": "humanity",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/hjuːˈmænəti/",
            "us": "/hjuːˈmænəti/"
        },
        "nearby": [
            {
                "word": "humanitarian",
                "pos": "noun"
            },
            {
                "word": "humanitarianism",
                "pos": "noun"
            },
            {
                "word": "humanity",
                "pos": "noun"
            },
            {
                "word": "humanize",
                "pos": "verb"
            },
            {
                "word": "humankind",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "people in general",
                    "vi": "mọi người nói chung"
                },
                "examples": [
                    {
                        "en": "He was found guilty of crimes against humanity.",
                        "vi": "Anh ta bị kết tội chống lại loài người."
                    }
                ]
            },
            {
                "define": {
                    "en": "the state of being a person rather than a god, an animal or a machine",
                    "vi": "trạng thái là một con người chứ không phải là một vị thần, một con vật hay một cỗ máy"
                },
                "examples": [
                    {
                        "en": "The story was used to emphasize the humanity of Jesus.",
                        "vi": "Câu chuyện được dùng để nhấn mạnh nhân tính của Chúa Giê-xu."
                    },
                    {
                        "en": "united by a sense of common humanity",
                        "vi": "đoàn kết bởi một ý thức chung của nhân loại"
                    }
                ]
            },
            {
                "define": {
                    "en": "the quality of being kind to people and animals by making sure that they do not suffer more than is necessary; the quality of being humane",
                    "vi": "phẩm chất đối xử tốt với con người và động vật bằng cách đảm bảo rằng họ không phải chịu đựng nhiều hơn mức cần thiết; phẩm chất của nhân đạo"
                },
                "examples": [
                    {
                        "en": "The judge was praised for his courage and humanity.",
                        "vi": "Vị thẩm phán được khen ngợi vì lòng dũng cảm và lòng nhân đạo."
                    }
                ]
            },
            {
                "define": {
                    "en": "the subjects of study that are about the way people think and behave, for example literature, language, history and philosophy",
                    "vi": "các chủ đề nghiên cứu về cách con người suy nghĩ và hành xử, ví dụ như văn học, ngôn ngữ, lịch sử và triết học"
                },
                "examples": [
                    {
                        "en": "The college offers a wide range of courses in the arts and humanities.",
                        "vi": "Trường cung cấp một loạt các khóa học về nghệ thuật và nhân văn."
                    }
                ]
            }
        ]
    },
    {
        "id": "175cb96f86fb4a3483a447a297aaa6be",
        "word": "major",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈmeɪdʒə(r)/",
            "us": "/ˈmeɪdʒər/"
        },
        "nearby": [
            {
                "word": "majimbo",
                "pos": "noun"
            },
            {
                "word": "major",
                "pos": "adjective"
            },
            {
                "word": "major",
                "pos": "noun"
            },
            {
                "word": "major",
                "pos": "verb"
            },
            {
                "word": "major-domo",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an officer of fairly high rank in the army or the US air force",
                    "vi": "một sĩ quan có cấp bậc khá cao trong quân đội hoặc lực lượng không quân Hoa Kỳ"
                },
                "examples": [
                    {
                        "en": "Major Smith",
                        "vi": "Thiếu tá Smith"
                    },
                    {
                        "en": "He's a major in the US army.",
                        "vi": "Anh ta là một thiếu tá trong quân đội Hoa Kỳ."
                    }
                ]
            },
            {
                "define": {
                    "en": "the main subject or course of a student at college or university",
                    "vi": "môn học hoặc khóa học chính của một sinh viên tại trường cao đẳng hoặc đại học"
                },
                "examples": [
                    {
                        "en": "Her major is French.",
                        "vi": "Chuyên ngành của cô ấy là tiếng Pháp."
                    }
                ]
            },
            {
                "define": {
                    "en": "a student studying a particular subject as the main part of their course",
                    "vi": "một sinh viên nghiên cứu một chủ đề cụ thể như là phần chính của khóa học của họ"
                },
                "examples": [
                    {
                        "en": "She's a French major.",
                        "vi": "Cô ấy là một sinh viên chuyên ngành tiếng Pháp."
                    }
                ]
            },
            {
                "define": {
                    "en": "a major organization or competition",
                    "vi": "một tổ chức hoặc cuộc thi lớn"
                },
                "examples": [
                    {
                        "en": "The output of the big five oil majors has fallen in recent years.",
                        "vi": "Sản lượng của 5 công ty dầu mỏ lớn đã giảm trong những năm gần đây."
                    },
                    {
                        "en": "The greatest achievement in tennis is to win all four majors in a single year.",
                        "vi": "Thành tích lớn nhất của quần vợt là vô địch cả 4 chuyên ngành chỉ trong một năm."
                    }
                ]
            },
            {
                "define": {
                    "en": "the major leagues",
                    "vi": "các giải đấu lớn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "34d7fd0be47d485a97f5d95d562079bf",
        "word": "major in",
        "pos": "phrasal verb",
        "level": "c1",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "majorette",
                "pos": "noun"
            },
            {
                "word": "major general",
                "pos": "noun"
            },
            {
                "word": "major in",
                "pos": "phrasal verb"
            },
            {
                "word": "majority",
                "pos": "noun"
            },
            {
                "word": "majority leader",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to study something as your main subject at a university or college",
                    "vi": "nghiên cứu một cái gì đó như là môn học chính của bạn tại một trường đại học hoặc cao đẳng"
                },
                "examples": [
                    {
                        "en": "She majored in history at Stanford.",
                        "vi": "Cô theo học chuyên ngành lịch sử tại Stanford."
                    }
                ]
            }
        ]
    },
    {
        "id": "b3861343835d4eea94f7606755c19019",
        "word": "minor",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈmaɪnə(r)/",
            "us": "/ˈmaɪnər/"
        },
        "nearby": [
            {
                "word": "minnow",
                "pos": "noun"
            },
            {
                "word": "minor",
                "pos": "adjective"
            },
            {
                "word": "minor",
                "pos": "noun"
            },
            {
                "word": "minor",
                "pos": "verb"
            },
            {
                "word": "minor in",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who is under the age at which you legally become an adult and are responsible for your actions",
                    "vi": "một người dưới độ tuổi mà bạn đã trở thành người lớn một cách hợp pháp và chịu trách nhiệm về các hành động của mình"
                },
                "examples": [
                    {
                        "en": "It is an offence to serve alcohol to minors.",
                        "vi": "Việc phục vụ rượu cho trẻ vị thành niên là vi phạm."
                    }
                ]
            },
            {
                "define": {
                    "en": "a subject that you study at university in addition to your major",
                    "vi": "một môn học mà bạn học ở trường đại học ngoài chuyên ngành của bạn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "cca637ec07ef4c1199943bc50df88d0b",
        "word": "sociological",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌsəʊsiəˈlɒdʒɪkl/",
            "us": "/ˌsəʊsiəˈlɑːdʒɪkl/"
        },
        "nearby": [
            {
                "word": "sociolinguistic",
                "pos": "adjective"
            },
            {
                "word": "sociolinguistics",
                "pos": "noun"
            },
            {
                "word": "sociological",
                "pos": "adjective"
            },
            {
                "word": "sociologically",
                "pos": "adverb"
            },
            {
                "word": "sociologist",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "connected with sociology (= the scientific study of the nature and development of society and social behaviour)",
                    "vi": "kết nối với xã hội học (= nghiên cứu khoa học về bản chất và sự phát triển của xã hội và hành vi xã hội)"
                },
                "examples": [
                    {
                        "en": "sociological theories",
                        "vi": "lý thuyết xã hội học"
                    }
                ]
            }
        ]
    },
    {
        "id": "dd7b2bad9d4f498baf402be048166c21",
        "word": "STEM",
        "pos": "abbreviation",
        "level": "c1",
        "phonetic": {
            "uk": "/stem/",
            "us": "/stem/"
        },
        "nearby": [
            {
                "word": "St Elmo's fire",
                "pos": "noun"
            },
            {
                "word": "stem",
                "pos": "noun"
            },
            {
                "word": "STEM",
                "pos": "abbreviation"
            },
            {
                "word": "stem",
                "pos": "verb"
            },
            {
                "word": "stem cell",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "science, technology, engineering and mathematics (used to refer to these subjects as a group in the context of education and jobs)",
                    "vi": "khoa học, công nghệ, kỹ thuật và toán học (được sử dụng để gọi các môn học này như một nhóm trong bối cảnh giáo dục và việc làm)"
                },
                "examples": [
                    {
                        "en": "We need to encourage more girls to enrol on STEM courses.",
                        "vi": "Chúng tôi cần khuyến khích nhiều nữ sinh đăng ký các khóa học STEM hơn."
                    }
                ]
            }
        ]
    },
    {
        "id": "f1e111c2cadc40ff983812b398368c0f",
        "word": "theology",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/θiˈɒlədʒi/",
            "us": "/θiˈɑːlədʒi/"
        },
        "nearby": [
            {
                "word": "theological",
                "pos": "adjective"
            },
            {
                "word": "theologically",
                "pos": "adverb"
            },
            {
                "word": "theology",
                "pos": "noun"
            },
            {
                "word": "theorem",
                "pos": "noun"
            },
            {
                "word": "theoretical",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the study of religion and beliefs",
                    "vi": "nghiên cứu về tôn giáo và tín ngưỡng"
                },
                "examples": [
                    {
                        "en": "a degree in theology",
                        "vi": "bằng thần học"
                    },
                    {
                        "en": "a theology student",
                        "vi": "một sinh viên thần học"
                    },
                    {
                        "en": "the rarefied world of academic theology",
                        "vi": "thế giới hiếm hoi của thần học hàn lâm"
                    }
                ]
            },
            {
                "define": {
                    "en": "a set of religious beliefs",
                    "vi": "một tập hợp các niềm tin tôn giáo"
                },
                "examples": [
                    {
                        "en": "the theologies of the East",
                        "vi": "thần học phương Đông"
                    }
                ]
            }
        ]
    },
    {
        "id": "7d3e64e48ddc4a18a2b1f5b3b4a51f09",
        "word": "vocational",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/vəʊˈkeɪʃənl/",
            "us": "/vəʊˈkeɪʃənl/"
        },
        "nearby": [
            {
                "word": "vocally",
                "pos": "adverb"
            },
            {
                "word": "vocation",
                "pos": "noun"
            },
            {
                "word": "vocational",
                "pos": "adjective"
            },
            {
                "word": "vocational school",
                "pos": "noun"
            },
            {
                "word": "vocative",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "connected with the skills, knowledge, etc. that you need to have in order to do a particular job",
                    "vi": "kết nối với các kỹ năng, kiến thức, v.v. mà bạn cần phải có để làm một công việc cụ thể"
                },
                "examples": [
                    {
                        "en": "vocational education/qualifications/training",
                        "vi": "giáo dục nghề nghiệp / bằng cấp / đào tạo"
                    }
                ]
            }
        ]
    },
    {
        "id": "b938a310ef074f45896fc639312a5e25",
        "word": "zoology",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/zuˈɒlədʒi/",
            "us": "/zuˈɑːlədʒi/"
        },
        "nearby": [
            {
                "word": "zoological garden",
                "pos": "noun"
            },
            {
                "word": "zoologist",
                "pos": "noun"
            },
            {
                "word": "zoology",
                "pos": "noun"
            },
            {
                "word": "zoom",
                "pos": "verb"
            },
            {
                "word": "zoom",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the scientific study of animals and their behaviour",
                    "vi": "nghiên cứu khoa học về động vật và hành vi của chúng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "d2758c3cd0e84c5b9c117806546eec42",
        "word": "cross-disciplinary",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌkrɒs dɪsəˈplɪnəri/",
            "us": "/ˌkrɔːs ˈdɪsəpləneri/"
        },
        "nearby": [
            {
                "word": "cross-current",
                "pos": "noun"
            },
            {
                "word": "cross-curricular",
                "pos": "adjective"
            },
            {
                "word": "cross-disciplinary",
                "pos": "adjective"
            },
            {
                "word": "cross-dresser",
                "pos": "noun"
            },
            {
                "word": "cross-dressing",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "involving different areas of knowledge or study",
                    "vi": "liên quan đến các lĩnh vực kiến thức hoặc nghiên cứu khác nhau"
                },
                "examples": [
                    {
                        "en": "a cross-disciplinary approach to research",
                        "vi": "một cách tiếp cận đa ngành để nghiên cứu"
                    },
                    {
                        "en": "The second factor is the growth in cross-disciplinary research, especially within the life sciences.",
                        "vi": "Yếu tố thứ hai là sự phát triển trong nghiên cứu đa ngành, đặc biệt là trong lĩnh vực khoa học đời sống."
                    }
                ]
            }
        ]
    },
    {
        "id": "51cdbbdbb39d47efb3c6e9517cc8b001",
        "word": "curricular",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/kəˈrɪkjələ(r)/",
            "us": "/kəˈrɪkjələr/"
        },
        "nearby": [
            {
                "word": "current events",
                "pos": "noun"
            },
            {
                "word": "currently",
                "pos": "adverb"
            },
            {
                "word": "curricular",
                "pos": "adjective"
            },
            {
                "word": "curriculum",
                "pos": "noun"
            },
            {
                "word": "curriculum vitae",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "connected with the curriculum of a school, etc.",
                    "vi": "kết nối với chương trình giảng dạy của một trường học, v.v."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "14282611ed634feb8e5fdb92dbee3698",
        "word": "day school",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈdeɪ skuːl/",
            "us": "/ˈdeɪ skuːl/"
        },
        "nearby": [
            {
                "word": "day return",
                "pos": "noun"
            },
            {
                "word": "day room",
                "pos": "noun"
            },
            {
                "word": "day school",
                "pos": "noun"
            },
            {
                "word": "Days of Our Lives",
                "pos": ""
            },
            {
                "word": "day student",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a private school with students who live at home and only go to school during the day",
                    "vi": "một trường tư thục với những học sinh sống ở nhà và chỉ đến trường vào ban ngày"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a course of education lasting one day, at which a particular topic is discussed",
                    "vi": "một khóa học giáo dục kéo dài một ngày, trong đó một chủ đề cụ thể được thảo luận"
                },
                "examples": [
                    {
                        "en": "a day school at Leeds University on women in Victorian times",
                        "vi": "một trường học ban ngày tại Đại học Leeds dành cho phụ nữ thời Victoria"
                    }
                ]
            }
        ]
    },
    {
        "id": "6c054a3dcc554af1ae8ce6322c23b707",
        "word": "disciplinary",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌdɪsəˈplɪnəri/",
            "us": "/ˈdɪsəpləneri/"
        },
        "nearby": [
            {
                "word": "disciple",
                "pos": "noun"
            },
            {
                "word": "disciplinarian",
                "pos": "noun"
            },
            {
                "word": "disciplinary",
                "pos": "adjective"
            },
            {
                "word": "discipline",
                "pos": "noun"
            },
            {
                "word": "discipline",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "connected with the punishment of people who break rules",
                    "vi": "liên quan đến việc trừng phạt những người vi phạm quy tắc"
                },
                "examples": [
                    {
                        "en": "a disciplinary hearing (= to decide if somebody has done something wrong)",
                        "vi": "một phiên điều trần kỷ luật (= để quyết định xem ai đó đã làm điều gì sai trái)"
                    },
                    {
                        "en": "The company will be taking disciplinary action against him.",
                        "vi": "Công ty sẽ tiến hành hình thức kỷ luật đối với anh ta."
                    },
                    {
                        "en": "She will have to explain her actions before the disciplinary committee.",
                        "vi": "Cô sẽ phải giải trình về hành động của mình trước hội đồng kỷ luật."
                    }
                ]
            },
            {
                "define": {
                    "en": "connected with an area of knowledge, especially a subject that people study in a university",
                    "vi": "kết nối với một lĩnh vực kiến thức, đặc biệt là một chủ đề mà mọi người học trong trường đại học"
                },
                "examples": [
                    {
                        "en": "Students need to broaden and deepen their disciplinary knowledge.",
                        "vi": "Học sinh cần mở rộng và đào sâu kiến thức ngành học."
                    }
                ]
            }
        ]
    },
    {
        "id": "0f882b8980104c97a4885aff24d12594",
        "word": "DT",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌdiː ˈtiː/",
            "us": "/ˌdiː ˈtiː/"
        },
        "nearby": [
            {
                "word": "DST",
                "pos": "abbreviation"
            },
            {
                "word": "D-structure",
                "pos": "noun"
            },
            {
                "word": "DT",
                "pos": "noun"
            },
            {
                "word": "DTP",
                "pos": "abbreviation"
            },
            {
                "word": "DTs",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a school subject in which students learn about the role of technology in modern life and also design and make things for themselves (the abbreviation for ‘design and technology’)",
                    "vi": "một môn học trong đó học sinh tìm hiểu về vai trò của công nghệ trong cuộc sống hiện đại và cũng có thể thiết kế và làm ra những thứ cho chính mình (viết tắt của 'thiết kế và công nghệ')"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "6285a6deb1f5420f8dd021368a11f4d2",
        "word": "elective",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ɪˈlektɪv/",
            "us": "/ɪˈlektɪv/"
        },
        "nearby": [
            {
                "word": "election",
                "pos": "noun"
            },
            {
                "word": "electioneering",
                "pos": "noun"
            },
            {
                "word": "elective",
                "pos": "adjective"
            },
            {
                "word": "elective",
                "pos": "noun"
            },
            {
                "word": "elector",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "using or chosen by election",
                    "vi": "sử dụng hoặc được lựa chọn bởi bầu cử"
                },
                "examples": [
                    {
                        "en": "an elective democracy",
                        "vi": "một nền dân chủ tự chọn"
                    },
                    {
                        "en": "an elective assembly",
                        "vi": "một hội đồng tự chọn"
                    },
                    {
                        "en": "an elective member",
                        "vi": "một thành viên tự chọn"
                    },
                    {
                        "en": "He had never held elective office (= a position that is filled by election).",
                        "vi": "Anh ta chưa bao giờ giữ chức vụ bầu cử (= một vị trí được bầu cử)."
                    }
                ]
            },
            {
                "define": {
                    "en": "having the power to elect",
                    "vi": "có quyền bầu cử"
                },
                "examples": [
                    {
                        "en": "an elective body",
                        "vi": "một cơ quan tự chọn"
                    }
                ]
            },
            {
                "define": {
                    "en": "that you choose to have; that does not require immediate attention",
                    "vi": "mà bạn chọn để có; điều đó không đòi hỏi sự chú ý ngay lập tức"
                },
                "examples": [
                    {
                        "en": "elective surgery",
                        "vi": "Lựa chọn phẫu thuật"
                    },
                    {
                        "en": "an elective operation",
                        "vi": "một hoạt động tự chọn"
                    }
                ]
            },
            {
                "define": {
                    "en": "that a student can choose",
                    "vi": "mà một sinh viên có thể chọn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "80911eebcba54e3a97ae1a58dace2fc8",
        "word": "elective",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ɪˈlektɪv/",
            "us": "/ɪˈlektɪv/"
        },
        "nearby": [
            {
                "word": "electioneering",
                "pos": "noun"
            },
            {
                "word": "elective",
                "pos": "adjective"
            },
            {
                "word": "elective",
                "pos": "noun"
            },
            {
                "word": "elector",
                "pos": "noun"
            },
            {
                "word": "electoral",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a course or subject at a college or school that a student can choose to do",
                    "vi": "một khóa học hoặc môn học tại một trường đại học hoặc trường học mà học sinh có thể chọn để làm"
                },
                "examples": [
                    {
                        "en": "Students can choose from a range of electives offered by the science department.",
                        "vi": "Học sinh có thể chọn từ một loạt các môn tự chọn do khoa khoa học cung cấp."
                    }
                ]
            }
        ]
    },
    {
        "id": "f4c3231361ec44edba73d8a06d4769a3",
        "word": "extramural",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌekstrəˈmjʊərəl/",
            "us": "/ˌekstrəˈmjʊrəl/"
        },
        "nearby": [
            {
                "word": "extrajudicial",
                "pos": "adjective"
            },
            {
                "word": "extramarital",
                "pos": "adjective"
            },
            {
                "word": "extramural",
                "pos": "adjective"
            },
            {
                "word": "extraneous",
                "pos": "adjective"
            },
            {
                "word": "extranet",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "arranged by a university, college, etc. for people who only study part-time",
                    "vi": "do một trường đại học, cao đẳng, v.v. sắp xếp cho những người chỉ học bán thời gian"
                },
                "examples": [
                    {
                        "en": "extramural education/studies/departments",
                        "vi": "giáo dục ngoại quốc / nghiên cứu / khoa"
                    }
                ]
            },
            {
                "define": {
                    "en": "happening or existing outside or separate from a place, an organization, etc.",
                    "vi": "đang xảy ra hoặc tồn tại bên ngoài hoặc tách biệt khỏi một địa điểm, một tổ chức, v.v."
                },
                "examples": [
                    {
                        "en": "The hospital provides extramural care to patients who do not need to be admitted.",
                        "vi": "Bệnh viện cung cấp dịch vụ chăm sóc ngoại khoa cho những bệnh nhân không cần nhập viện."
                    }
                ]
            }
        ]
    },
    {
        "id": "45e87c779e57439a8f210dc0435b13be",
        "word": "foundation course",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/faʊnˈdeɪʃn kɔːs/",
            "us": "/faʊnˈdeɪʃn kɔːrs/"
        },
        "nearby": [
            {
                "word": "found",
                "pos": "verb"
            },
            {
                "word": "foundation",
                "pos": "noun"
            },
            {
                "word": "foundation course",
                "pos": "noun"
            },
            {
                "word": "foundation stone",
                "pos": "noun"
            },
            {
                "word": "founder",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a general course at a college that prepares students for longer or more difficult courses",
                    "vi": "một khóa học chung tại trường cao đẳng chuẩn bị cho sinh viên cho các khóa học dài hơn hoặc khó hơn"
                },
                "examples": [
                    {
                        "en": "an arts foundation course",
                        "vi": "một khóa học nền tảng nghệ thuật"
                    }
                ]
            }
        ]
    },
    {
        "id": "83c193ad518248c2866cea31305b6db9",
        "word": "geometry",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/dʒiˈɒmətri/",
            "us": "/dʒiˈɑːmətri/"
        },
        "nearby": [
            {
                "word": "geometric mean",
                "pos": "noun"
            },
            {
                "word": "geometric progression",
                "pos": "noun"
            },
            {
                "word": "geometry",
                "pos": "noun"
            },
            {
                "word": "geophysical",
                "pos": "adjective"
            },
            {
                "word": "geophysicist",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the branch of mathematics that deals with the measurements and relationships of lines, angles, surfaces and solids",
                    "vi": "nhánh toán học liên quan đến các phép đo và mối quan hệ của đường thẳng, góc, bề mặt và chất rắn"
                },
                "examples": [
                    {
                        "en": "Pre-Christian sacred geometry was incorporated into church architecture.",
                        "vi": "Hình học thiêng liêng tiền Cơ đốc giáo đã được đưa vào kiến trúc nhà thờ."
                    }
                ]
            },
            {
                "define": {
                    "en": "the measurements and relationships of lines, angles, etc. in a particular object or shape",
                    "vi": "các phép đo và mối quan hệ của các đường, góc, v.v. trong một đối tượng hoặc hình dạng cụ thể"
                },
                "examples": [
                    {
                        "en": "the geometry of a spider’s web",
                        "vi": "hình học của mạng nhện"
                    }
                ]
            }
        ]
    },
    {
        "id": "cde477e79e2a488abc9cd02de8ba5503",
        "word": "home economics",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌhəʊm ˌiːkəˈnɒmɪks/",
            "us": "/ˌhəʊm ˌiːkəˈnɑːmɪks/"
        },
        "nearby": [
            {
                "word": "the Home Counties",
                "pos": "noun"
            },
            {
                "word": "Home Depot",
                "pos": ""
            },
            {
                "word": "home economics",
                "pos": "noun"
            },
            {
                "word": "home entertainment",
                "pos": "noun"
            },
            {
                "word": "home fries",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "cooking and other skills needed at home, taught as a subject in school",
                    "vi": "nấu ăn và các kỹ năng khác cần thiết ở nhà, được dạy như một môn học ở trường"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "5224808170b745beb85fbe5c655434b3",
        "word": "honour",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɒnə(r)/",
            "us": "/ˈɑːnər/"
        },
        "nearby": [
            {
                "word": "honor society",
                "pos": "noun"
            },
            {
                "word": "honor system",
                "pos": "noun"
            },
            {
                "word": "honour",
                "pos": "noun"
            },
            {
                "word": "honour",
                "pos": "verb"
            },
            {
                "word": "honourable",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "great respect for somebody",
                    "vi": "rất tôn trọng ai đó"
                },
                "examples": [
                    {
                        "en": "the guest of honour (= the most important one)",
                        "vi": "vị khách danh dự (= người quan trọng nhất)"
                    },
                    {
                        "en": "the seat/place of honour (= given to the most important guest)",
                        "vi": "ghế / nơi vinh danh (= được trao cho vị khách quan trọng nhất)"
                    },
                    {
                        "en": "They stood in silence as a mark of honour to her.",
                        "vi": "Họ đứng trong im lặng như một sự tôn vinh đối với cô."
                    },
                    {
                        "en": "do honour to somebody/something This biography does great honour to the poet's achievements.",
                        "vi": "làm vinh dự cho ai đó / cái gì đó Tiểu sử này rất vinh dự đối với những thành tựu của nhà thơ."
                    }
                ]
            },
            {
                "define": {
                    "en": "something that you are very pleased or proud to do because people are showing you great respect",
                    "vi": "điều gì đó mà bạn rất hài lòng hoặc tự hào khi làm vì mọi người đang thể hiện sự tôn trọng của bạn"
                },
                "examples": [
                    {
                        "en": "honour to do something It was a great honour to be invited here today.",
                        "vi": "vinh dự được làm điều gì đó Thật vinh dự khi được mời đến đây hôm nay."
                    },
                    {
                        "en": "It is a great honour to represent my country at the Olympics.",
                        "vi": "Đó là một vinh dự lớn khi đại diện cho đất nước của tôi tại Thế vận hội."
                    },
                    {
                        "en": "It was my honour and privilege to be Helen's friend.",
                        "vi": "Đó là vinh dự và đặc ân của tôi khi được làm bạn của Helen."
                    },
                    {
                        "en": "honour of doing something The city has the dubious honour (= something that does not make you pleased or proud) of being the road rage capital of Europe.",
                        "vi": "vinh dự làm điều gì đó Thành phố có vinh dự không rõ ràng (= điều gì đó không làm bạn hài lòng hoặc tự hào) là thủ đô thịnh nộ đường của Châu Âu."
                    },
                    {
                        "en": "He shared the honour of being the season's top scorer with Andy Cole.",
                        "vi": "Anh ấy đã chia sẻ niềm vinh dự là cầu thủ ghi bàn hàng đầu của mùa giải với Andy Cole."
                    }
                ]
            },
            {
                "define": {
                    "en": "the quality of knowing and doing what is morally right",
                    "vi": "phẩm chất của việc biết và làm những gì là đúng đắn về mặt đạo đức"
                },
                "examples": [
                    {
                        "en": "a man of honour",
                        "vi": "một người đàn ông của danh dự"
                    },
                    {
                        "en": "Proving his innocence has become a matter of honour.",
                        "vi": "Chứng minh sự vô tội của mình đã trở thành một vấn đề danh dự."
                    }
                ]
            },
            {
                "define": {
                    "en": "a good reputation; respect from other people",
                    "vi": "một danh tiếng tốt; sự tôn trọng từ những người khác"
                },
                "examples": [
                    {
                        "en": "upholding the honour of your country",
                        "vi": "đề cao danh dự của đất nước bạn"
                    },
                    {
                        "en": "The family honour is at stake.",
                        "vi": "Danh dự của gia đình đang bị đe dọa."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person or thing that causes others to respect and admire something/somebody",
                    "vi": "một người hoặc một điều khiến người khác tôn trọng và ngưỡng mộ điều gì đó / ai đó"
                },
                "examples": [
                    {
                        "en": "She is an honour to the profession.",
                        "vi": "Cô ấy là một vinh dự đối với nghề."
                    }
                ]
            },
            {
                "define": {
                    "en": "an award, official title, etc. given to somebody as a reward for something that they have done",
                    "vi": "một giải thưởng, danh hiệu chính thức, v.v. được trao cho ai đó như một phần thưởng cho điều gì đó mà họ đã làm"
                },
                "examples": [
                    {
                        "en": "the New Year’s Honours list (= in Britain, a list of awards and titles given on January 1 each year)",
                        "vi": "danh sách Danh dự Năm mới (= ở Anh, danh sách các giải thưởng và danh hiệu được trao vào ngày 1 tháng 1 hàng năm)"
                    },
                    {
                        "en": "to receive/win the highest honour",
                        "vi": "để nhận được / giành được vinh dự cao nhất"
                    },
                    {
                        "en": "to bestow an honour on somebody",
                        "vi": "để ban tặng một vinh dự cho ai đó"
                    },
                    {
                        "en": "She received nearly every honour bestowed upon a poet.",
                        "vi": "Cô nhận được gần như mọi vinh dự do một nhà thơ ban tặng."
                    },
                    {
                        "en": "He received numerous honours, including the OBE in 1961.",
                        "vi": "Ông đã nhận được nhiều danh hiệu, bao gồm cả OBE vào năm 1961."
                    },
                    {
                        "en": "He was buried with full military honours (= with a special military service as a sign of respect).",
                        "vi": "Ông được chôn cất với đầy đủ các danh hiệu quân sự (= với một nghĩa vụ quân sự đặc biệt như một dấu hiệu của sự tôn trọng)."
                    },
                    {
                        "en": "He wears his scars like badges of honour (= rewards that you can see).",
                        "vi": "Anh ta đeo những vết sẹo của mình như huy hiệu danh dự (= phần thưởng mà bạn có thể nhìn thấy)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a university course that is of a higher level than a basic course (in the US also used to describe a class in school that is at a higher level than other classes)",
                    "vi": "khóa học đại học ở cấp độ cao hơn khóa học cơ bản (ở Mỹ cũng được sử dụng để mô tả một lớp học trong trường ở cấp độ cao hơn các lớp học khác)"
                },
                "examples": [
                    {
                        "en": "an honours degree/course",
                        "vi": "một bằng cấp danh dự / khóa học"
                    },
                    {
                        "en": "a First Class Honours degree",
                        "vi": "bằng Danh dự Hạng Nhất"
                    },
                    {
                        "en": "(North American English) I took an honors class in English.",
                        "vi": "(Tiếng Anh Bắc Mỹ) Tôi đã học một lớp danh dự bằng tiếng Anh."
                    }
                ]
            },
            {
                "define": {
                    "en": "if you pass an exam or graduate from a university or school with honours, you receive a special grade for having achieved a very high standard",
                    "vi": "nếu bạn vượt qua một kỳ thi hoặc tốt nghiệp từ một trường đại học hoặc trường học xuất sắc, bạn sẽ nhận được điểm đặc biệt vì đã đạt được tiêu chuẩn rất cao"
                },
                "examples": [
                    {
                        "en": "He passed with second-class honours.",
                        "vi": "Anh đã đỗ bằng danh dự hạng nhì."
                    }
                ]
            },
            {
                "define": {
                    "en": "a title of respect used when talking to or about a judge or a US mayor",
                    "vi": "một danh hiệu tôn trọng được sử dụng khi nói chuyện với hoặc về thẩm phán hoặc thị trưởng Hoa Kỳ"
                },
                "examples": [
                    {
                        "en": "No more questions, Your Honour.",
                        "vi": "Không còn câu hỏi nào nữa, thưa Ngài."
                    }
                ]
            },
            {
                "define": {
                    "en": "the cards that have the highest value",
                    "vi": "thẻ có giá trị cao nhất"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to do something to make somebody feel very proud and pleased",
                    "vi": "làm điều gì đó để khiến ai đó cảm thấy rất tự hào và hài lòng"
                },
                "examples": [
                    {
                        "en": "Would you do me the honour of dining with me?",
                        "vi": "Bạn có thể làm cho tôi vinh dự được ăn tối với tôi không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to perform a social duty or ceremony, such as pouring drinks, making a speech, etc.",
                    "vi": "để thực hiện một nghĩa vụ xã hội hoặc nghi lễ, chẳng hạn như rót đồ uống, phát biểu, v.v."
                },
                "examples": [
                    {
                        "en": "Would you do the honours and draw the winning ticket?",
                        "vi": "Bạn có làm được danh dự và rút được tấm vé chiến thắng không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be given the opportunity to do something that makes you feel proud and happy",
                    "vi": "được trao cơ hội để làm điều gì đó khiến bạn cảm thấy tự hào và hạnh phúc"
                },
                "examples": [
                    {
                        "en": "May I have the honour of the next dance?",
                        "vi": "Tôi có thể có vinh dự của buổi khiêu vũ tiếp theo không?"
                    },
                    {
                        "en": "It was Tevez who had the honour of scoring the first goal.",
                        "vi": "Chính Tevez là người có vinh dự ghi bàn đầu tiên."
                    },
                    {
                        "en": "She had the honour of being the first living artist to have her work exhibited in the Louvre.",
                        "vi": "Cô có vinh dự là nghệ sĩ còn sống đầu tiên được trưng bày tác phẩm của mình tại Louvre."
                    },
                    {
                        "en": "I had the rare honour of being allowed into the artist's studio.",
                        "vi": "Tôi có vinh dự hiếm hoi được phép vào phòng thu của nghệ sĩ."
                    },
                    {
                        "en": "Max was given the dubious honour (= it may not really have made him feel proud and happy) of organizing the children's party.",
                        "vi": "Max đã được trao cho vinh dự không rõ ràng (= nó có thể không thực sự khiến anh ấy cảm thấy tự hào và hạnh phúc) khi tổ chức bữa tiệc cho trẻ em."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that even criminals have standards of behaviour that they respect",
                    "vi": "được sử dụng để nói rằng ngay cả tội phạm cũng có các tiêu chuẩn hành vi mà họ tôn trọng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to feel that you must do something because of your sense of moral duty",
                    "vi": "để cảm thấy rằng bạn phải làm điều gì đó vì ý thức của bạn về nghĩa vụ đạo đức"
                },
                "examples": [
                    {
                        "en": "She felt honour-bound to attend as she had promised to.",
                        "vi": "Cô cảm thấy vinh dự được tham dự như những gì cô đã hứa."
                    },
                    {
                        "en": "He felt honour bound to help her.",
                        "vi": "Anh cảm thấy vinh dự khi được giúp đỡ cô ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "no particular person, team, etc. is doing better than the others in a competition, an argument, etc.",
                    "vi": "không có người, đội cụ thể nào, v.v. làm tốt hơn những người khác trong một cuộc thi, một cuộc tranh cãi, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "in order to show great respect for somebody/something",
                    "vi": "để thể hiện sự tôn trọng tuyệt đối với ai đó / điều gì đó"
                },
                "examples": [
                    {
                        "en": "a ceremony in honour of those killed in the explosion",
                        "vi": "một buổi lễ vinh danh những người thiệt mạng trong vụ nổ"
                    },
                    {
                        "en": "A banquet was held in her honour.",
                        "vi": "Một bữa tiệc được tổ chức để vinh danh cô."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to promise very seriously that you will do something or that something is true",
                    "vi": "từng hứa rất nghiêm túc rằng bạn sẽ làm điều gì đó hoặc điều gì đó là sự thật"
                },
                "examples": [
                    {
                        "en": "I swear on my honour that I knew nothing about this.",
                        "vi": "Tôi xin thề trên danh dự của mình rằng tôi không biết gì về điều này."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be trusted to do something",
                    "vi": "được tin tưởng để làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "You're on your honour not to go into my room.",
                        "vi": "Bạn vinh dự không vào phòng tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a thing that somebody considers to be very important for their honour or reputation",
                    "vi": "một điều mà ai đó coi là rất quan trọng đối với danh dự hoặc danh tiếng của họ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "926539e0248e4ecbad00e461e87008ee",
        "word": "interdisciplinarity",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌɪntəˌdɪsəplɪˈnærəti/",
            "us": "/ˌɪntərˌdɪsəplɪˈnærəti/"
        },
        "nearby": [
            {
                "word": "interdict",
                "pos": "noun"
            },
            {
                "word": "interdiction",
                "pos": "noun"
            },
            {
                "word": "interdisciplinarity",
                "pos": "noun"
            },
            {
                "word": "interdisciplinary",
                "pos": "adjective"
            },
            {
                "word": "interest",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the quality or fact of involving different areas of knowledge or study",
                    "vi": "chất lượng hoặc thực tế của việc liên quan đến các lĩnh vực kiến thức hoặc nghiên cứu khác nhau"
                },
                "examples": [
                    {
                        "en": "I believe environmental historians should embrace interdisciplinarity more fully.",
                        "vi": "Tôi tin rằng các nhà sử học môi trường nên nắm bắt đầy đủ hơn về liên ngành."
                    }
                ]
            }
        ]
    },
    {
        "id": "e131aa543dd84649a953a8cff5096742",
        "word": "interdisciplinary",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌɪntədɪsəˈplɪnəri/",
            "us": "/ˌɪntərˈdɪsəplɪneri/"
        },
        "nearby": [
            {
                "word": "interdiction",
                "pos": "noun"
            },
            {
                "word": "interdisciplinarity",
                "pos": "noun"
            },
            {
                "word": "interdisciplinary",
                "pos": "adjective"
            },
            {
                "word": "interest",
                "pos": "noun"
            },
            {
                "word": "interest",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "involving different areas of knowledge or study",
                    "vi": "liên quan đến các lĩnh vực kiến thức hoặc nghiên cứu khác nhau"
                },
                "examples": [
                    {
                        "en": "interdisciplinary research",
                        "vi": "nghiên cứu liên ngành"
                    },
                    {
                        "en": "an interdisciplinary approach",
                        "vi": "một cách tiếp cận liên ngành"
                    }
                ]
            }
        ]
    },
    {
        "id": "29e87a967a1f4d87b9baa87856460c19",
        "word": "liberal arts",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌlɪbərəl ˈɑːts/",
            "us": "/ˌlɪbərəl ˈɑːrts/"
        },
        "nearby": [
            {
                "word": "liberal",
                "pos": "adjective"
            },
            {
                "word": "liberal",
                "pos": "noun"
            },
            {
                "word": "liberal arts",
                "pos": "noun"
            },
            {
                "word": "Liberal Democrat",
                "pos": "noun"
            },
            {
                "word": "the Liberal Democrats",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "subjects of study that develop students’ general knowledge and ability to think, rather than their technical skills",
                    "vi": "các môn học phát triển kiến thức chung và khả năng tư duy của học sinh, thay vì các kỹ năng kỹ thuật của họ"
                },
                "examples": [
                    {
                        "en": "a liberal arts college",
                        "vi": "một trường cao đẳng nghệ thuật tự do"
                    }
                ]
            }
        ]
    },
    {
        "id": "51533aab7cf948738e96c9de1c1d1188",
        "word": "linguistics",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/lɪŋˈɡwɪstɪks/",
            "us": "/lɪŋˈɡwɪstɪks/"
        },
        "nearby": [
            {
                "word": "linguistic",
                "pos": "adjective"
            },
            {
                "word": "linguistically",
                "pos": "adverb"
            },
            {
                "word": "linguistics",
                "pos": "noun"
            },
            {
                "word": "liniment",
                "pos": "noun"
            },
            {
                "word": "lining",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the scientific study of language or of particular languages",
                    "vi": "nghiên cứu khoa học về ngôn ngữ hoặc các ngôn ngữ cụ thể"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "31264a0a16354f86bbc55710e353f70c",
        "word": "modular",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmɒdjələ(r)/",
            "us": "/ˈmɑːdʒələr/"
        },
        "nearby": [
            {
                "word": "modify",
                "pos": "verb"
            },
            {
                "word": "modish",
                "pos": "adjective"
            },
            {
                "word": "modular",
                "pos": "adjective"
            },
            {
                "word": "modulate",
                "pos": "verb"
            },
            {
                "word": "modulation",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "consisting of separate units from which students may choose several",
                    "vi": "bao gồm các đơn vị riêng biệt mà từ đó học sinh có thể chọn một số"
                },
                "examples": [
                    {
                        "en": "a modular course",
                        "vi": "một khóa học mô-đun"
                    }
                ]
            },
            {
                "define": {
                    "en": "consisting of separate parts or units that can be joined together",
                    "vi": "bao gồm các bộ phận hoặc đơn vị riêng biệt có thể được nối với nhau"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "101af17c5835479784fc244d3f69195d",
        "word": "multidisciplinary",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌmʌltidɪsəˈplɪnəri/",
            "us": "/ˌmʌltiˈdɪsəpləneri/"
        },
        "nearby": [
            {
                "word": "multiculturalism",
                "pos": "noun"
            },
            {
                "word": "multidimensional",
                "pos": "adjective"
            },
            {
                "word": "multidisciplinary",
                "pos": "adjective"
            },
            {
                "word": "multi-ethnic",
                "pos": "adjective"
            },
            {
                "word": "multifaceted",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "involving several different subjects of study",
                    "vi": "liên quan đến một số chủ đề nghiên cứu khác nhau"
                },
                "examples": [
                    {
                        "en": "a multidisciplinary course",
                        "vi": "một khóa học đa ngành"
                    }
                ]
            }
        ]
    },
    {
        "id": "6b624cf0afa74d709332abd8fa6dad4a",
        "word": "postdoctoral",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌpəʊstˈdɒktərəl/",
            "us": "/ˌpəʊstˈdɑːktərəl/"
        },
        "nearby": [
            {
                "word": "post-date",
                "pos": "verb"
            },
            {
                "word": "postdoc",
                "pos": "noun"
            },
            {
                "word": "postdoctoral",
                "pos": "adjective"
            },
            {
                "word": "poster",
                "pos": "noun"
            },
            {
                "word": "poster child",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "connected with advanced research or study that is done after a PhD has been completed",
                    "vi": "kết nối với nghiên cứu nâng cao hoặc nghiên cứu được thực hiện sau khi hoàn thành bằng tiến sĩ"
                },
                "examples": [
                    {
                        "en": "a postdoctoral student",
                        "vi": "một sinh viên sau tiến sĩ"
                    },
                    {
                        "en": "postdoctoral research",
                        "vi": "nghiên cứu sau tiến sĩ"
                    }
                ]
            }
        ]
    },
    {
        "id": "7a546498cc7d429387c3d44b75b8d46a",
        "word": "PSHE",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌpiː es eɪtʃ ˈiː/",
            "us": "/ˌpiː es eɪtʃ ˈiː/"
        },
        "nearby": [
            {
                "word": "pseudonymous",
                "pos": "adjective"
            },
            {
                "word": "pseudoscience",
                "pos": "noun"
            },
            {
                "word": "PSHE",
                "pos": "noun"
            },
            {
                "word": "psi",
                "pos": "noun"
            },
            {
                "word": "p.s.i.",
                "pos": "abbreviation"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a subject taught in British schools that deals with a person’s emotional and social development and discusses such issues as health, sex, drugs, relationships with other people, work and finance (the abbreviation for ‘personal, social and health and education’)",
                    "vi": "một môn học được giảng dạy trong các trường học ở Anh liên quan đến sự phát triển cảm xúc và xã hội của một người và thảo luận về các vấn đề như sức khỏe, tình dục, ma túy, mối quan hệ với người khác, công việc và tài chính (viết tắt của 'cá nhân, xã hội và sức khỏe và giáo dục')"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "1ff9863684ee4a02912478b828056680",
        "word": "RE",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌɑːr ˈiː/",
            "us": "/ˌɑːr ˈiː/"
        },
        "nearby": [
            {
                "word": "re1",
                "pos": "noun"
            },
            {
                "word": "re2",
                "pos": "preposition"
            },
            {
                "word": "RE",
                "pos": "noun"
            },
            {
                "word": "RE",
                "pos": ""
            },
            {
                "word": "re-",
                "pos": "prefix"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a school subject in which students learn about different religions (the abbreviation for ‘religious education’)",
                    "vi": "một môn học trong đó học sinh tìm hiểu về các tôn giáo khác nhau (viết tắt của 'giáo dục tôn giáo')"
                },
                "examples": [
                    {
                        "en": "an RE teacher",
                        "vi": "một giáo viên RE"
                    }
                ]
            }
        ]
    },
    {
        "id": "d3b6b70047c94966a1cd16ef942bcaaf",
        "word": "STEAM",
        "pos": "abbreviation",
        "level": "c2",
        "phonetic": {
            "uk": "/stiːm/",
            "us": "/stiːm/"
        },
        "nearby": [
            {
                "word": "stealthy",
                "pos": "adjective"
            },
            {
                "word": "steam",
                "pos": "noun"
            },
            {
                "word": "STEAM",
                "pos": "abbreviation"
            },
            {
                "word": "steam",
                "pos": "verb"
            },
            {
                "word": "steamboat",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "science, technology, engineering, arts and mathematics (used to refer to these subjects as a group in the context of education and jobs)",
                    "vi": "khoa học, công nghệ, kỹ thuật, nghệ thuật và toán học (được sử dụng để gọi các môn học này như một nhóm trong bối cảnh giáo dục và việc làm)"
                },
                "examples": [
                    {
                        "en": "As a teacher, I'm excited by my school's developing STEAM program.",
                        "vi": "Là một giáo viên, tôi rất hào hứng với chương trình STEAM đang phát triển của trường tôi."
                    }
                ]
            }
        ]
    }
]