[
    {
        "id": "70a7893528264aa2a747d720bf69263b",
        "word": "egg",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/eɡ/",
            "us": "/eɡ/"
        },
        "nearby": [
            {
                "word": "egalitarian",
                "pos": "adjective"
            },
            {
                "word": "egalitarianism",
                "pos": "noun"
            },
            {
                "word": "egg",
                "pos": "noun"
            },
            {
                "word": "egg",
                "pos": "verb"
            },
            {
                "word": "egg-and-spoon race",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small oval object with a thin hard shell produced by a female bird and containing a young bird; a similar object (without a hard shell) produced by a female fish, insect, etc.",
                    "vi": "một vật nhỏ hình bầu dục có vỏ cứng mỏng do chim mái đẻ ra và chứa chim non; một vật tương tự (không có vỏ cứng) do cá cái, côn trùng, v.v."
                },
                "examples": [
                    {
                        "en": "The female sits on the eggs until they hatch.",
                        "vi": "Con cái ngồi trên những quả trứng cho đến khi chúng nở."
                    },
                    {
                        "en": "The fish lay thousands of eggs at one time.",
                        "vi": "Cá đẻ hàng nghìn quả trứng cùng một lúc."
                    },
                    {
                        "en": "crocodile eggs",
                        "vi": "trứng cá sấu"
                    }
                ]
            },
            {
                "define": {
                    "en": "a bird’s egg, especially one from a chicken, that is eaten as food",
                    "vi": "trứng chim, đặc biệt là trứng gà, được dùng làm thức ăn"
                },
                "examples": [
                    {
                        "en": "a boiled egg",
                        "vi": "một quả trứng luộc"
                    },
                    {
                        "en": "bacon and eggs",
                        "vi": "thịt xông khói và trứng"
                    },
                    {
                        "en": "fried/poached/scrambled eggs",
                        "vi": "trứng chiên / luộc / bác"
                    },
                    {
                        "en": "Bind the mixture together with a little beaten egg.",
                        "vi": "Trộn hỗn hợp với một ít trứng đã đánh tan."
                    },
                    {
                        "en": "You've got some egg on your shirt.",
                        "vi": "Bạn có một số quả trứng trên áo sơ mi của bạn."
                    },
                    {
                        "en": "egg yolks/whites",
                        "vi": "lòng đỏ / lòng trắng trứng"
                    },
                    {
                        "en": "egg noodles",
                        "vi": "mì trứng"
                    },
                    {
                        "en": "hen's/duck/quail eggs",
                        "vi": "trứng gà mái / vịt / cút"
                    },
                    {
                        "en": "a chocolate egg (= made from chocolate in the shape of an egg)",
                        "vi": "một quả trứng sô cô la (= được làm từ sô cô la trong hình dạng của một quả trứng)"
                    }
                ]
            },
            {
                "define": {
                    "en": "a cell that combines with a sperm to create a baby or young animal",
                    "vi": "tế bào kết hợp với tinh trùng để tạo ra con non hoặc động vật non"
                },
                "examples": [
                    {
                        "en": "The male sperm fertilizes the female egg.",
                        "vi": "Tinh trùng đực thụ tinh với trứng cái."
                    },
                    {
                        "en": "an egg donor",
                        "vi": "một người hiến trứng"
                    },
                    {
                        "en": "Many women conceive through the use of a donor egg.",
                        "vi": "Nhiều phụ nữ thụ thai thông qua việc sử dụng một quả trứng hiến tặng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a situation in which it is difficult to tell which one of two things was the cause of the other",
                    "vi": "một tình huống trong đó rất khó để biết một trong hai điều nào là nguyên nhân của điều kia"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "something that has some good parts and some bad ones",
                    "vi": "một cái gì đó có một số phần tốt và một số phần xấu"
                },
                "examples": [
                    {
                        "en": "Their investment plan shows the familiar curate's egg pattern of some bits doing well and others doing badly.",
                        "vi": "Kế hoạch đầu tư của họ cho thấy mô hình trứng của người quản lý quen thuộc là một số bit làm tốt và một số khác hoạt động kém."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who you know will behave well/badly",
                    "vi": "một người mà bạn biết sẽ cư xử tốt / xấu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be made to look stupid",
                    "vi": "bị làm cho trông ngu ngốc"
                },
                "examples": [
                    {
                        "en": "They were left with egg on their faces when only ten people showed up.",
                        "vi": "Họ bị bỏ lại với quả trứng trên mặt khi chỉ có mười người xuất hiện."
                    }
                ]
            },
            {
                "define": {
                    "en": "to destroy something that would make you rich, successful, etc.",
                    "vi": "để phá hủy thứ gì đó có thể khiến bạn trở nên giàu có, thành công, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to rely on one particular course of action for success rather than giving yourself several different possibilities",
                    "vi": "dựa vào một quá trình hành động cụ thể để thành công hơn là tạo cho mình một số khả năng khác nhau"
                },
                "examples": [
                    {
                        "en": "I’ve applied for several jobs. I don’t want to put all my eggs in one basket.",
                        "vi": "Tôi đã nộp đơn cho một số công việc. Tôi không muốn bỏ tất cả trứng vào một giỏ."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that something is definitely true",
                    "vi": "từng nói rằng điều gì đó chắc chắn là đúng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to tell or show somebody how to do something that they can already do well, and probably better than you can",
                    "vi": "để nói hoặc chỉ cho ai đó cách làm điều gì đó mà họ đã có thể làm tốt và có thể tốt hơn bạn có thể"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "you cannot achieve something important without causing a few small problems",
                    "vi": "bạn không thể đạt được điều gì đó quan trọng mà không gây ra một số vấn đề nhỏ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c88d546ea034441587f4695b563f15b8",
        "word": "tail",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/teɪl/",
            "us": "/teɪl/"
        },
        "nearby": [
            {
                "word": "t'ai chi ch'uan",
                "pos": "noun"
            },
            {
                "word": "taiga",
                "pos": "noun"
            },
            {
                "word": "tail",
                "pos": "noun"
            },
            {
                "word": "tail",
                "pos": "verb"
            },
            {
                "word": "tail away",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the part that sticks out at the back of the body of a bird, an animal or a fish, which the animal can move from side to side or up and down",
                    "vi": "phần nhô ra ở phía sau cơ thể của một con chim, một con vật hoặc một con cá mà con vật có thể di chuyển từ bên này sang bên kia hoặc lên xuống"
                },
                "examples": [
                    {
                        "en": "The dog ran up, wagging its tail.",
                        "vi": "Con chó chạy đến, vẫy đuôi."
                    },
                    {
                        "en": "My dog loves to chase his tail.",
                        "vi": "Con chó của tôi rất thích đuổi theo đuôi của mình."
                    },
                    {
                        "en": "The male has beautiful tail feathers.",
                        "vi": "Con đực có bộ lông đuôi đẹp."
                    },
                    {
                        "en": "It was black from its nose to the tip of its tail.",
                        "vi": "Nó có màu đen từ mũi đến đầu đuôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "having the type of tail mentioned",
                    "vi": "có loại đuôi được đề cập"
                },
                "examples": [
                    {
                        "en": "a white-tailed eagle",
                        "vi": "đại bàng đuôi trắng"
                    }
                ]
            },
            {
                "define": {
                    "en": "the back part of a plane, spacecraft, etc.",
                    "vi": "phần sau của máy bay, tàu vũ trụ, v.v."
                },
                "examples": [
                    {
                        "en": "The plane's tail section had broken off.",
                        "vi": "Phần đuôi của chiếc máy bay đã bị gãy."
                    }
                ]
            },
            {
                "define": {
                    "en": "a part of something that sticks out at the back like a tail",
                    "vi": "một phần của cái gì đó nhô ra ở phía sau như một cái đuôi"
                },
                "examples": [
                    {
                        "en": "the tail of a kite",
                        "vi": "đuôi của một con diều"
                    }
                ]
            },
            {
                "define": {
                    "en": "the last part of something that is moving away from you",
                    "vi": "phần cuối cùng của thứ gì đó đang rời xa bạn"
                },
                "examples": [
                    {
                        "en": "the tail of the procession",
                        "vi": "đuôi của đám rước"
                    },
                    {
                        "en": "the truck at the tail of our convoy",
                        "vi": "chiếc xe tải ở đuôi đoàn xe của chúng tôi"
                    }
                ]
            },
            {
                "define": {
                    "en": "a long jacket divided at the back below the waist into two pieces that become narrower at the bottom, worn by men at very formal events",
                    "vi": "một chiếc áo khoác dài được chia ở phía sau dưới thắt lưng thành hai mảnh trở nên hẹp hơn ở phía dưới, được nam giới mặc tại các sự kiện rất trang trọng"
                },
                "examples": [
                    {
                        "en": "The men all wore top hat and tails.",
                        "vi": "Những người đàn ông đều đội mũ chóp và có đuôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "the side of a coin that does not have a picture of the head of a person on it, used as one choice when a coin is tossed to decide something",
                    "vi": "mặt của đồng xu không có hình đầu người trên đó, được sử dụng như một sự lựa chọn khi tung đồng xu để quyết định điều gì đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a person who is sent to follow somebody secretly and find out information about where that person goes, what they do, etc.",
                    "vi": "một người được cử đi theo dõi ai đó một cách bí mật và tìm hiểu thông tin về nơi người đó đi, họ làm gì, v.v."
                },
                "examples": [
                    {
                        "en": "The police have put a tail on him.",
                        "vi": "Cảnh sát đã bắt được hắn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be unable to understand something",
                    "vi": "không thể hiểu điều gì đó"
                },
                "examples": [
                    {
                        "en": "I couldn't make head nor tail of what he was saying.",
                        "vi": "Tôi không thể hiểu rõ anh ta đang nói gì."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be very busy but in fact achieve very little",
                    "vi": "rất bận rộn nhưng trên thực tế đạt được rất ít"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to ask somebody which side of a coin they think will be facing upwards when it is tossed in order to decide something by chance",
                    "vi": "được sử dụng để hỏi ai đó mặt nào của đồng xu mà họ nghĩ sẽ hướng lên trên khi nó được tung ra để quyết định một điều gì đó tình cờ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "if cars, etc. are nose to tail, they are moving slowly in a long line with little space between them",
                    "vi": "nếu ô tô, v.v. hướng mũi vào nhau, chúng đang di chuyển chậm trên một đường dài với rất ít khoảng trống giữa chúng"
                },
                "examples": [
                    {
                        "en": "The traffic was nose to tail for miles.",
                        "vi": "Giao thông nối đuôi nhau hàng dặm."
                    }
                ]
            },
            {
                "define": {
                    "en": "following behind somebody very closely, especially in a car",
                    "vi": "theo sau ai đó rất gần, đặc biệt là trong ô tô"
                },
                "examples": [
                    {
                        "en": "There’s been a white van sitting on my tail for the past ten miles.",
                        "vi": "Có một chiếc xe tải màu trắng đang ngồi trên đuôi tôi trong mười dặm qua."
                    }
                ]
            },
            {
                "define": {
                    "en": "an unpleasant feature that comes at the end of a story, an event, etc. and makes it less good, successful, etc.",
                    "vi": "một tính năng khó chịu xuất hiện ở cuối câu chuyện, sự kiện, v.v. và làm cho nó kém hay, thành công, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to describe a situation in which the most important aspect is being influenced and controlled by somebody/something that is not as important",
                    "vi": "được sử dụng để mô tả một tình huống trong đó khía cạnh quan trọng nhất đang bị ảnh hưởng và kiểm soát bởi ai đó / điều gì đó không quan trọng bằng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to run away from a fight or dangerous situation",
                    "vi": "để chạy trốn khỏi một cuộc chiến hoặc tình huống nguy hiểm"
                },
                "examples": [
                    {
                        "en": "When they heard the sirens, they turned tail and ran.",
                        "vi": "Khi nghe tiếng còi, chúng quay đầu bỏ chạy."
                    }
                ]
            },
            {
                "define": {
                    "en": "feeling ashamed or unhappy because you have been defeated or punished",
                    "vi": "cảm thấy xấu hổ hoặc không vui vì bạn đã bị đánh bại hoặc bị trừng phạt"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "d98b6a1bfb0846989bdb8186c3c2fcdf",
        "word": "wing",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/wɪŋ/",
            "us": "/wɪŋ/"
        },
        "nearby": [
            {
                "word": "wine vinegar",
                "pos": "noun"
            },
            {
                "word": "wine waiter",
                "pos": "noun"
            },
            {
                "word": "wing",
                "pos": "noun"
            },
            {
                "word": "wing",
                "pos": "verb"
            },
            {
                "word": "wing back",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "one of the parts of the body of a bird, insect or bat that it uses for flying",
                    "vi": "một trong những bộ phận trên cơ thể của chim, côn trùng hoặc dơi mà nó sử dụng để bay"
                },
                "examples": [
                    {
                        "en": "The swan flapped its wings noisily.",
                        "vi": "Con thiên nga vỗ cánh ồn ào."
                    },
                    {
                        "en": "wing feathers",
                        "vi": "lông cánh"
                    }
                ]
            },
            {
                "define": {
                    "en": "the wing of a chicken, etc. eaten as food",
                    "vi": "cánh của một con gà, v.v. được ăn làm thức ăn"
                },
                "examples": [
                    {
                        "en": "We ordered the fried chicken wings.",
                        "vi": "Chúng tôi gọi món cánh gà rán."
                    },
                    {
                        "en": "First, fry the chicken wings in the oil until they begin to brown.",
                        "vi": "Đầu tiên, chiên cánh gà trong dầu cho đến khi chúng bắt đầu chuyển sang màu nâu."
                    }
                ]
            },
            {
                "define": {
                    "en": "one of the large flat parts that stick out from the side of a plane and help to keep it in the air when it is flying",
                    "vi": "một trong những bộ phận phẳng lớn nhô ra khỏi thành bên của máy bay và giúp giữ nó trong không khí khi nó đang bay"
                },
                "examples": [
                    {
                        "en": "Salvage teams have been able to recover part of the wing of the plane.",
                        "vi": "Các đội trục vớt đã trục vớt được một phần cánh của máy bay."
                    },
                    {
                        "en": "The right wing grazed the runway on landing.",
                        "vi": "Cánh phải sượt qua đường băng khi hạ cánh."
                    }
                ]
            },
            {
                "define": {
                    "en": "a part of a large building that sticks out from the main part",
                    "vi": "một phần của tòa nhà lớn nhô ra khỏi phần chính"
                },
                "examples": [
                    {
                        "en": "the east wing",
                        "vi": "cánh đông"
                    },
                    {
                        "en": "the new wing of the hospital",
                        "vi": "cánh mới của bệnh viện"
                    },
                    {
                        "en": "Our rooms were in the west wing.",
                        "vi": "Phòng của chúng tôi ở cánh phía tây."
                    }
                ]
            },
            {
                "define": {
                    "en": "a part of a car that is above a wheel",
                    "vi": "một bộ phận của ô tô ở phía trên bánh xe"
                },
                "examples": [
                    {
                        "en": "There was a dent in the nearside wing.",
                        "vi": "Có một vết lõm ở cánh gần."
                    }
                ]
            },
            {
                "define": {
                    "en": "one section of an organization that has a particular function or whose members share the same opinions",
                    "vi": "một bộ phận của tổ chức có một chức năng cụ thể hoặc có các thành viên có cùng quan điểm"
                },
                "examples": [
                    {
                        "en": "The radical wing of the party was dissatisfied with the policies.",
                        "vi": "Cánh cấp tiến của đảng đã không hài lòng với các chính sách."
                    },
                    {
                        "en": "The political wing of the National Resistance Army entered into negotiations with the government.",
                        "vi": "Cánh chính trị của Quân đội Kháng chiến Quốc gia tham gia đàm phán với chính phủ."
                    },
                    {
                        "en": "They're on the left wing of the Labour Party.",
                        "vi": "Họ thuộc cánh trái của Đảng Lao động."
                    }
                ]
            },
            {
                "define": {
                    "en": "either of the attacking players who play towards the side of the playing area in sports such as football (soccer) or hockey",
                    "vi": "một trong các cầu thủ tấn công chơi về phía bên của khu vực chơi trong các môn thể thao như bóng đá (bóng đá) hoặc khúc côn cầu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the far left or right side of the sports field",
                    "vi": "ngoài cùng bên trái hoặc bên phải của sân thể thao"
                },
                "examples": [
                    {
                        "en": "He plays on the wing.",
                        "vi": "Anh ấy chơi ở cánh."
                    }
                ]
            },
            {
                "define": {
                    "en": "the area at either side of the stage that cannot be seen by the audience",
                    "vi": "khu vực ở hai bên của sân khấu mà khán giả không thể nhìn thấy"
                },
                "examples": [
                    {
                        "en": "She watched every performance from the wings.",
                        "vi": "Cô ấy theo dõi mọi màn trình diễn từ đôi cánh."
                    }
                ]
            },
            {
                "define": {
                    "en": "to limit a person’s freedom or power",
                    "vi": "để hạn chế quyền tự do hoặc quyền lực của một người"
                },
                "examples": [
                    {
                        "en": "Having a new baby to take care of has clipped her wings.",
                        "vi": "Có một em bé mới để chăm sóc đã chắp cánh cho cô ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to pass the exams that mean you are allowed to fly a plane",
                    "vi": "để vượt qua các kỳ thi có nghĩa là bạn được phép lái máy bay"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "ready to take over a particular job or be used in a particular situation when needed",
                    "vi": "sẵn sàng đảm nhận một công việc cụ thể hoặc được sử dụng trong một tình huống cụ thể khi cần thiết"
                },
                "examples": [
                    {
                        "en": "She was aware of a whole host of ambitious young managers waiting in the wings.",
                        "vi": "Cô nhận thức được rằng có rất nhiều nhà quản lý trẻ đầy tham vọng đang chờ đợi trong cánh."
                    },
                    {
                        "en": "There's a wealth of talent waiting in the wings of British theatre.",
                        "vi": "Có rất nhiều tài năng đang chờ đợi trong cánh của nhà hát Anh."
                    }
                ]
            },
            {
                "define": {
                    "en": "flying",
                    "vi": "bay"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "with only a very slight chance of success",
                    "vi": "chỉ với một cơ hội thành công rất nhỏ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to become more independent and confident and try new activities, etc.",
                    "vi": "để trở nên độc lập và tự tin hơn và thử các hoạt động mới, v.v."
                },
                "examples": [
                    {
                        "en": "Going to college gave her the chance to spread her wings.",
                        "vi": "Vào đại học đã cho cô cơ hội để chắp cánh cho mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to take care of and help somebody who has less experience of something than you",
                    "vi": "để chăm sóc và giúp đỡ ai đó có ít kinh nghiệm về điều gì đó hơn bạn"
                },
                "examples": [
                    {
                        "en": "Simon's uncle had taken him under his wing.",
                        "vi": "Chú của Simon đã đưa anh ta về dưới trướng của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to fly away",
                    "vi": "bay đi"
                },
                "examples": [
                    {
                        "en": "(figurative) Her imagination took wing.",
                        "vi": "(nghĩa bóng) Trí tưởng tượng của cô ấy đã thành công."
                    }
                ]
            }
        ]
    },
    {
        "id": "60d204d0868e4a7aa4f24e0a77f734f8",
        "word": "beak",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/biːk/",
            "us": "/biːk/"
        },
        "nearby": [
            {
                "word": "beagle",
                "pos": "noun"
            },
            {
                "word": "HMS Beagle",
                "pos": ""
            },
            {
                "word": "beak",
                "pos": "noun"
            },
            {
                "word": "beaked",
                "pos": "adjective"
            },
            {
                "word": "beaker",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the hard pointed or curved outer part of a bird’s mouth",
                    "vi": "phần ngoài cứng nhọn hoặc cong của miệng chim"
                },
                "examples": [
                    {
                        "en": "The gull held the fish in its beak.",
                        "vi": "Mòng biển giữ con cá trong mỏ của nó."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person’s nose, especially when it is large and/or pointed",
                    "vi": "mũi của một người, đặc biệt là khi nó lớn và / hoặc nhọn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a person in a position of authority, especially a judge",
                    "vi": "một người có chức vụ quyền hạn, đặc biệt là thẩm phán"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "3cddf167661d4354bfee082c247b20f6",
        "word": "breast",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/brest/",
            "us": "/brest/"
        },
        "nearby": [
            {
                "word": "break with",
                "pos": "phrasal verb"
            },
            {
                "word": "bream",
                "pos": "noun"
            },
            {
                "word": "breast",
                "pos": "noun"
            },
            {
                "word": "breast",
                "pos": "verb"
            },
            {
                "word": "breastbone",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "either of the two round soft parts at the front of a woman’s body that produce milk when she has had a baby",
                    "vi": "một trong hai bộ phận mềm tròn ở phía trước cơ thể người phụ nữ tiết sữa khi sinh con"
                },
                "examples": [
                    {
                        "en": "She put the baby to her breast.",
                        "vi": "Cô đặt đứa trẻ vào vú của mình."
                    },
                    {
                        "en": "breast cancer",
                        "vi": "ung thư vú"
                    },
                    {
                        "en": "The protective benefits of breast milk are numerous for both mother and baby.",
                        "vi": "Lợi ích bảo vệ của sữa mẹ là rất nhiều cho cả mẹ và con."
                    },
                    {
                        "en": "She had breast-augmentation surgery.",
                        "vi": "Cô đã phẫu thuật nâng ngực."
                    },
                    {
                        "en": "Getting breast implants entails major surgery.",
                        "vi": "Để cấy ghép ngực đòi hỏi một cuộc phẫu thuật lớn."
                    },
                    {
                        "en": "The book promoted the benefits of breast feeding to child health.",
                        "vi": "Cuốn sách đã đề cao lợi ích của việc nuôi con bằng sữa mẹ đối với sức khỏe trẻ em."
                    },
                    {
                        "en": "She discovered a lump in her breast.",
                        "vi": "Cô phát hiện ra một khối u ở vú."
                    }
                ]
            },
            {
                "define": {
                    "en": "the similar, smaller part on a man’s body, which does not produce milk",
                    "vi": "bộ phận tương tự, nhỏ hơn trên cơ thể đàn ông, không sản xuất sữa"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the top part of the front of your body, below your neck",
                    "vi": "phần trên cùng của phía trước cơ thể của bạn, bên dưới cổ của bạn"
                },
                "examples": [
                    {
                        "en": "He cradled the child against his breast.",
                        "vi": "Anh ôm đứa trẻ vào vú mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "the part of a piece of clothing that covers your chest",
                    "vi": "phần của một mảnh quần áo che ngực của bạn"
                },
                "examples": [
                    {
                        "en": "A row of medals was pinned to the breast of his coat.",
                        "vi": "Một hàng huy chương được gắn trên ngực áo khoác của anh ta."
                    }
                ]
            },
            {
                "define": {
                    "en": "the front part of a bird’s body",
                    "vi": "phần trước của cơ thể một con chim"
                },
                "examples": [
                    {
                        "en": "breast feathers",
                        "vi": "lông ngực"
                    },
                    {
                        "en": "The robin has a red breast.",
                        "vi": "Con ngựa đực có một bộ ngực màu đỏ."
                    },
                    {
                        "en": "a robin with a red breast",
                        "vi": "một con ngựa vằn với bộ ngực đỏ"
                    }
                ]
            },
            {
                "define": {
                    "en": "meat from the front part of the body of a bird or an animal",
                    "vi": "thịt từ phần trước của cơ thể của một con chim hoặc động vật"
                },
                "examples": [
                    {
                        "en": "chicken/turkey breasts",
                        "vi": "ức gà / gà tây"
                    },
                    {
                        "en": "breast of lamb",
                        "vi": "vú của cừu"
                    }
                ]
            },
            {
                "define": {
                    "en": "having the type of chest or breasts mentioned",
                    "vi": "có loại ngực hoặc bộ ngực được đề cập"
                },
                "examples": [
                    {
                        "en": "a small-breasted/full-breasted woman",
                        "vi": "một phụ nữ ngực nhỏ / đầy đặn"
                    },
                    {
                        "en": "bare-breasted",
                        "vi": "ngực trần"
                    },
                    {
                        "en": "the yellow-breasted male of the species",
                        "vi": "con đực ngực vàng của loài"
                    }
                ]
            },
            {
                "define": {
                    "en": "the part of the body where the feelings and emotions are thought to be",
                    "vi": "bộ phận của cơ thể nơi được cho là cảm xúc và cảm xúc"
                },
                "examples": [
                    {
                        "en": "a troubled breast",
                        "vi": "một bộ ngực rắc rối"
                    }
                ]
            },
            {
                "define": {
                    "en": "to show that you feel sorry about something that you have done, especially in public and in an exaggerated way",
                    "vi": "để thể hiện rằng bạn cảm thấy hối tiếc về điều gì đó mà bạn đã làm, đặc biệt là ở nơi công cộng và một cách phóng đại"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to tell the truth about something so that you no longer feel guilty",
                    "vi": "nói sự thật về điều gì đó để bạn không còn cảm thấy tội lỗi"
                },
                "examples": [
                    {
                        "en": "He made a clean breast of everything and admitted taking the money.",
                        "vi": "Anh ta làm sạch mọi thứ và thừa nhận đã lấy tiền."
                    }
                ]
            }
        ]
    },
    {
        "id": "2fe04f1cd2784dfda39a0e8241b4f4d8",
        "word": "feather",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈfeðə(r)/",
            "us": "/ˈfeðər/"
        },
        "nearby": [
            {
                "word": "Feast of Weeks",
                "pos": "noun"
            },
            {
                "word": "feat",
                "pos": "noun"
            },
            {
                "word": "feather",
                "pos": "noun"
            },
            {
                "word": "feather",
                "pos": "verb"
            },
            {
                "word": "feather-bed",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "one of the many soft light parts covering a bird’s body",
                    "vi": "một trong nhiều phần ánh sáng mềm bao phủ cơ thể một con chim"
                },
                "examples": [
                    {
                        "en": "a peacock feather",
                        "vi": "lông công"
                    },
                    {
                        "en": "tail/flight/wing feathers",
                        "vi": "lông đuôi / chuyến bay / cánh"
                    },
                    {
                        "en": "a feather pillow (= one containing feathers)",
                        "vi": "một cái gối lông vũ (= một cái chứa lông vũ)"
                    }
                ]
            },
            {
                "define": {
                    "en": "people of the same sort (are found together)",
                    "vi": "những người cùng loại (được tìm thấy cùng nhau)"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "an action that you can be proud of",
                    "vi": "một hành động mà bạn có thể tự hào"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to annoy or upset somebody or a group of people",
                    "vi": "làm phiền hoặc làm phiền ai đó hoặc một nhóm người"
                },
                "examples": [
                    {
                        "en": "The senator's speech ruffled a few feathers in the business world.",
                        "vi": "Bài phát biểu của thượng nghị sĩ đã làm xù lông một vài người trong giới kinh doanh."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody feel less angry or offended",
                    "vi": "để làm cho ai đó cảm thấy bớt tức giận hoặc bị xúc phạm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to express surprise",
                    "vi": "được sử dụng để bày tỏ sự ngạc nhiên"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "cff13bbe72d14a8a8488da09c30132af",
        "word": "bill",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/bɪl/",
            "us": "/bɪl/"
        },
        "nearby": [
            {
                "word": "bilk",
                "pos": "verb"
            },
            {
                "word": "Sergeant Bilko",
                "pos": ""
            },
            {
                "word": "bill",
                "pos": "noun"
            },
            {
                "word": "bill",
                "pos": "verb"
            },
            {
                "word": "Bill",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a document that shows how much you owe somebody for goods or services",
                    "vi": "một tài liệu cho thấy bạn nợ ai đó bao nhiêu tiền cho hàng hoá hoặc dịch vụ"
                },
                "examples": [
                    {
                        "en": "the phone/electricity/gas bill",
                        "vi": "hóa đơn điện thoại / điện / gas"
                    },
                    {
                        "en": "He is facing a huge tax bill.",
                        "vi": "Anh ấy đang phải đối mặt với một hóa đơn thuế khổng lồ."
                    },
                    {
                        "en": "She always pays her bills on time.",
                        "vi": "Cô ấy luôn thanh toán các hóa đơn của mình đúng hạn."
                    },
                    {
                        "en": "We ran up a massive hotel bill.",
                        "vi": "Chúng tôi đã thanh toán một hóa đơn khách sạn lớn."
                    },
                    {
                        "en": "bill for something I’ll be sending you the bill for the dry-cleaning!",
                        "vi": "hóa đơn cho thứ gì đó Tôi sẽ gửi cho bạn hóa đơn giặt hấp!"
                    },
                    {
                        "en": "The bills are piling up (= there are more and more that have still not been paid).",
                        "vi": "Các hóa đơn đang chồng chất (= ngày càng có nhiều khoản vẫn chưa được thanh toán)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of paper that shows how much you have to pay for the food and drinks that you have had in a restaurant",
                    "vi": "một mảnh giấy cho biết bạn phải trả bao nhiêu cho đồ ăn và thức uống mà bạn đã dùng trong một nhà hàng"
                },
                "examples": [
                    {
                        "en": "Let's ask for the bill.",
                        "vi": "Hãy yêu cầu các hóa đơn."
                    },
                    {
                        "en": "Could we have the bill, please?",
                        "vi": "Chúng tôi có thể lấy hóa đơn không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of paper money",
                    "vi": "một tờ tiền"
                },
                "examples": [
                    {
                        "en": "a ten-dollar bill",
                        "vi": "một tờ mười đô la"
                    }
                ]
            },
            {
                "define": {
                    "en": "a written suggestion for a new law that is presented to a country’s parliament so that its members can discuss it",
                    "vi": "một đề xuất bằng văn bản cho một luật mới được trình lên quốc hội của một quốc gia để các thành viên của quốc gia đó có thể thảo luận về nó"
                },
                "examples": [
                    {
                        "en": "to introduce/approve/oppose a bill",
                        "vi": "giới thiệu / thông qua / phản đối một dự luật"
                    },
                    {
                        "en": "Congress passed the energy bill last month.",
                        "vi": "Quốc hội đã thông qua dự luật năng lượng vào tháng trước."
                    },
                    {
                        "en": "Republicans said they would support the bill.",
                        "vi": "Đảng Cộng hòa cho biết họ sẽ ủng hộ dự luật."
                    },
                    {
                        "en": "the Education Reform Bill",
                        "vi": "Dự luật Cải cách Giáo dục"
                    }
                ]
            },
            {
                "define": {
                    "en": "a programme of entertainment at a theatre, etc.",
                    "vi": "một chương trình giải trí tại nhà hát, v.v."
                },
                "examples": [
                    {
                        "en": "a horror double bill (= two horror films shown one after the other)",
                        "vi": "một hóa đơn kinh dị gấp đôi (= hai bộ phim kinh dị được chiếu lần lượt)"
                    },
                    {
                        "en": "Topping the bill (= the most important performer) is violinist Joshua Bell.",
                        "vi": "Đứng đầu bảng (= nghệ sĩ biểu diễn quan trọng nhất) là nghệ sĩ vĩ cầm Joshua Bell."
                    },
                    {
                        "en": "Mozart is on the bill this evening.",
                        "vi": "Mozart có mặt trong hóa đơn tối nay."
                    }
                ]
            },
            {
                "define": {
                    "en": "a notice in a public place to advertise an event",
                    "vi": "một thông báo ở nơi công cộng để quảng cáo một sự kiện"
                },
                "examples": [
                    {
                        "en": "Post no bills (= a notice warning people not to stick bills in a particular place).",
                        "vi": "Không đăng hóa đơn (= một thông báo cảnh báo mọi người không dán hóa đơn ở một nơi cụ thể)."
                    }
                ]
            },
            {
                "define": {
                    "en": "the hard pointed or curved outer part of a bird’s mouth",
                    "vi": "phần ngoài cứng nhọn hoặc cong của miệng chim"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "having the type of bill mentioned",
                    "vi": "có loại hóa đơn được đề cập"
                },
                "examples": [
                    {
                        "en": "long-billed waders",
                        "vi": "waders thanh toán dài"
                    }
                ]
            },
            {
                "define": {
                    "en": "the stiff front part of a cap that sticks out above your eyes",
                    "vi": "phần trước cứng của một chiếc mũ lưỡi trai nhô ra khỏi mắt bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a report that says somebody is healthy or that something is in good condition",
                    "vi": "một báo cáo nói rằng ai đó khỏe mạnh hoặc một cái gì đó đang ở trong tình trạng tốt"
                },
                "examples": [
                    {
                        "en": "Doctors gave him a clean bill of health after a series of tests and examinations.",
                        "vi": "Các bác sĩ đã cho anh ta một sức khỏe sạch sẽ sau một loạt các xét nghiệm và kiểm tra."
                    },
                    {
                        "en": "The building was given a clean bill of health by the surveyor.",
                        "vi": "Tòa nhà đã được một nhà khảo sát đưa ra một hóa đơn sạch về sức khỏe."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be what is needed in a particular situation or for a particular purpose",
                    "vi": "là những gì cần thiết trong một tình huống cụ thể hoặc cho một mục đích cụ thể"
                },
                "examples": [
                    {
                        "en": "On paper, several of the applicants fit the bill.",
                        "vi": "Trên giấy tờ, một số người nộp đơn phù hợp với hóa đơn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be responsible for paying the cost of something",
                    "vi": "chịu trách nhiệm thanh toán chi phí của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "Once again it will be the taxpayer who has to foot the bill.",
                        "vi": "Một lần nữa, người đóng thuế sẽ là người phải chấp nhận hóa đơn."
                    },
                    {
                        "en": "Who will be footing the bill for the party?",
                        "vi": "Ai sẽ là người lập hóa đơn cho bữa tiệc?"
                    }
                ]
            }
        ]
    },
    {
        "id": "c17900e89a904913b6b8996bf6fc175b",
        "word": "craw",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/krɔː/",
            "us": "/krɔː/"
        },
        "nearby": [
            {
                "word": "cravenly",
                "pos": "adverb"
            },
            {
                "word": "craving",
                "pos": "noun"
            },
            {
                "word": "craw",
                "pos": "noun"
            },
            {
                "word": "crawfish",
                "pos": "noun"
            },
            {
                "word": "Joan Crawford",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the part of a bird’s throat where food is kept",
                    "vi": "phần cổ họng của một con chim nơi giữ thức ăn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be difficult or impossible to say",
                    "vi": "khó hoặc không thể nói"
                },
                "examples": [
                    {
                        "en": "She wanted to say how sorry she was but the words seemed to stick in her throat.",
                        "vi": "Cô ấy muốn nói rằng cô ấy đã xin lỗi như thế nào nhưng những từ đó dường như mắc kẹt trong cổ họng cô ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be difficult or impossible to accept; to make you angry",
                    "vi": "khó hoặc không thể chấp nhận; làm bạn tức giận"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c54610711b754611b94ef09eedfb2345",
        "word": "crest",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/krest/",
            "us": "/krest/"
        },
        "nearby": [
            {
                "word": "crescent",
                "pos": "noun"
            },
            {
                "word": "cress",
                "pos": "noun"
            },
            {
                "word": "crest",
                "pos": "noun"
            },
            {
                "word": "crest",
                "pos": "verb"
            },
            {
                "word": "crested",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the top part of a hill or wave",
                    "vi": "phần trên cùng của ngọn đồi hoặc ngọn sóng"
                },
                "examples": [
                    {
                        "en": "surfers riding the crest of the wave",
                        "vi": "người lướt sóng cưỡi trên đỉnh sóng"
                    }
                ]
            },
            {
                "define": {
                    "en": "a design used as the symbol of a particular family, organization, etc., especially one that has a long history",
                    "vi": "một thiết kế được sử dụng làm biểu tượng của một gia đình, tổ chức cụ thể, v.v., đặc biệt là một thiết kế có lịch sử lâu đời"
                },
                "examples": [
                    {
                        "en": "the university crest",
                        "vi": "đỉnh trường đại học"
                    },
                    {
                        "en": "The family crest consists of a crown and an eight-pointed star.",
                        "vi": "Gia huy bao gồm một vương miện và một ngôi sao tám cánh."
                    }
                ]
            },
            {
                "define": {
                    "en": "a group of feathers that stand up on top of a bird’s head",
                    "vi": "một nhóm lông vũ dựng lên trên đầu của một con chim"
                },
                "examples": [
                    {
                        "en": "The male is recognizable by its yellow crest.",
                        "vi": "Con đực có thể nhận biết được bằng mào màu vàng của nó."
                    }
                ]
            },
            {
                "define": {
                    "en": "a situation in which somebody is very successful, happy, etc.",
                    "vi": "một tình huống trong đó ai đó rất thành công, hạnh phúc, v.v."
                },
                "examples": [
                    {
                        "en": "They’ve been on the crest of the wave ever since their election victory.",
                        "vi": "Họ đã ở trên đỉnh của làn sóng kể từ khi chiến thắng cuộc bầu cử của họ."
                    },
                    {
                        "en": "She is on the crest of a wave at the moment following her Olympic success.",
                        "vi": "Cô ấy đang ở trên đỉnh của làn sóng vào lúc này sau thành công ở Olympic của cô ấy."
                    },
                    {
                        "en": "They are riding the crest of the wave at the moment.",
                        "vi": "Họ đang cưỡi trên đỉnh của làn sóng vào lúc này."
                    }
                ]
            },
            {
                "define": {
                    "en": "to enjoy great success or support because of a particular situation or event",
                    "vi": "để tận hưởng thành công lớn hoặc sự hỗ trợ vì một tình huống hoặc sự kiện cụ thể"
                },
                "examples": [
                    {
                        "en": "The band is riding the crest of its last tour.",
                        "vi": "Ban nhạc đang đi đầu trong chuyến lưu diễn cuối cùng của họ."
                    }
                ]
            }
        ]
    },
    {
        "id": "3c07f8bc649d40c6882fc6d5e8e6de7e",
        "word": "crop",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/krɒp/",
            "us": "/krɑːp/"
        },
        "nearby": [
            {
                "word": "croon",
                "pos": "verb"
            },
            {
                "word": "crooner",
                "pos": "noun"
            },
            {
                "word": "crop",
                "pos": "noun"
            },
            {
                "word": "crop",
                "pos": "verb"
            },
            {
                "word": "crop circle",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a plant that is grown in large quantities, especially as food",
                    "vi": "một loại cây được trồng với số lượng lớn, đặc biệt là làm thực phẩm"
                },
                "examples": [
                    {
                        "en": "Sugar is an important crop on the island.",
                        "vi": "Đường là một loại cây trồng quan trọng trên đảo."
                    },
                    {
                        "en": "What are the benefits of growing GM crops?",
                        "vi": "Lợi ích của việc trồng cây biến đổi gen là gì?"
                    },
                    {
                        "en": "food crops",
                        "vi": "cây lương thực"
                    },
                    {
                        "en": "crop yield/production",
                        "vi": "năng suất / sản lượng cây trồng"
                    },
                    {
                        "en": "to grow/plant/harvest crops",
                        "vi": "trồng / trồng / thu hoạch cây trồng"
                    },
                    {
                        "en": "The crops are regularly sprayed with pesticides.",
                        "vi": "Các loại cây trồng thường xuyên được phun thuốc trừ sâu."
                    }
                ]
            },
            {
                "define": {
                    "en": "the amount of grain, fruit, etc. that is grown in one season",
                    "vi": "số lượng ngũ cốc, trái cây, v.v. được trồng trong một mùa"
                },
                "examples": [
                    {
                        "en": "a fall in this year’s coffee crop",
                        "vi": "vụ cà phê năm nay rớt giá"
                    },
                    {
                        "en": "Australia's wheat crop is likely to be lower than forecast this year.",
                        "vi": "Vụ lúa mì của Australia có thể sẽ thấp hơn dự báo trong năm nay."
                    },
                    {
                        "en": "We are looking forward to a bumper crop (= a very large one).",
                        "vi": "Chúng tôi đang mong đợi một vụ mùa bội thu (= một vụ mùa rất lớn)."
                    },
                    {
                        "en": "We had a very good crop of apples last year.",
                        "vi": "Chúng tôi đã có một vụ táo rất tốt vào năm ngoái."
                    }
                ]
            },
            {
                "define": {
                    "en": "a group of people who do something at the same time; a number of things that happen at the same time",
                    "vi": "một nhóm người làm việc gì đó cùng một lúc; một số điều xảy ra cùng một lúc"
                },
                "examples": [
                    {
                        "en": "the current crop of trainees",
                        "vi": "vụ mùa hiện tại của các học viên"
                    },
                    {
                        "en": "She is really the cream of the crop (= the best in her group).",
                        "vi": "Cô ấy thực sự là kem của mùa vụ (= tốt nhất trong nhóm của cô ấy)."
                    },
                    {
                        "en": "a crop of disasters/injuries",
                        "vi": "một vụ thiên tai / thương tích"
                    }
                ]
            },
            {
                "define": {
                    "en": "a short whip used by horse riders",
                    "vi": "một chiếc roi ngắn được sử dụng bởi những người cưỡi ngựa"
                },
                "examples": [
                    {
                        "en": "a riding crop",
                        "vi": "một cây trồng cưỡi"
                    }
                ]
            },
            {
                "define": {
                    "en": "a very short hairstyle",
                    "vi": "một kiểu tóc rất ngắn"
                },
                "examples": [
                    {
                        "en": "She has her hair cut in a short crop.",
                        "vi": "Cô ấy cắt tóc ngắn."
                    }
                ]
            },
            {
                "define": {
                    "en": "hair that is short and thick",
                    "vi": "tóc ngắn và dày"
                },
                "examples": [
                    {
                        "en": "He had a thick crop of black curly hair.",
                        "vi": "Anh ta có một mái tóc xoăn đen dày."
                    }
                ]
            },
            {
                "define": {
                    "en": "a part of a bird’s throat that has the shape of a bag where food is stored before it passes into the stomach",
                    "vi": "một phần cổ họng của chim có hình dạng như một cái túi, nơi chứa thức ăn trước khi đi vào dạ dày"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "82884301728a4a73848dc690991f3894",
        "word": "down",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/daʊn/",
            "us": "/daʊn/"
        },
        "nearby": [
            {
                "word": "down",
                "pos": "verb"
            },
            {
                "word": "down",
                "pos": "adjective"
            },
            {
                "word": "down",
                "pos": "noun"
            },
            {
                "word": "down and out",
                "pos": "adjective"
            },
            {
                "word": "down-and-out",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the very fine soft feathers of a bird",
                    "vi": "lông mềm rất mịn của một con chim"
                },
                "examples": [
                    {
                        "en": "duck down",
                        "vi": "vịt xuống"
                    }
                ]
            },
            {
                "define": {
                    "en": "fine soft hair",
                    "vi": "tóc mềm mịn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a period of feeling sad or depressed, or when things are not going well",
                    "vi": "giai đoạn cảm thấy buồn hoặc chán nản, hoặc khi mọi thứ không suôn sẻ"
                },
                "examples": [
                    {
                        "en": "We all have our downs from time to time.",
                        "vi": "Tất cả chúng ta đều có những lúc gặp khó khăn."
                    },
                    {
                        "en": "Her career has had a few downs this year.",
                        "vi": "Sự nghiệp của cô đã có một vài bước đi xuống trong năm nay."
                    }
                ]
            },
            {
                "define": {
                    "en": "one of a series of four chances to carry the ball forward ten yards that a team is allowed. These series continue until the team loses the ball or fails to go forward ten yards in four downs.",
                    "vi": "một trong bốn cơ hội để mang bóng về phía trước mười thước mà một đội được phép. Chuỗi trận này tiếp tục cho đến khi đội mất bóng hoặc không đi tiếp được mười thước trong bốn lần hạ gục."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to have a bad opinion of a person or thing",
                    "vi": "có ý kiến xấu về một người hoặc một sự vật"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the mixture of good and bad things in life or in a particular situation or relationship",
                    "vi": "hỗn hợp của những điều tốt và xấu trong cuộc sống hoặc trong một tình huống hoặc mối quan hệ cụ thể"
                },
                "examples": [
                    {
                        "en": "Every business has its ups and downs.",
                        "vi": "Mọi doanh nghiệp đều có những thăng trầm."
                    }
                ]
            }
        ]
    },
    {
        "id": "f52b03b2ea92486492b61f45a26174c0",
        "word": "gizzard",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɡɪzəd/",
            "us": "/ˈɡɪzərd/"
        },
        "nearby": [
            {
                "word": "give yourself up to",
                "pos": "phrasal verb"
            },
            {
                "word": "gizmo",
                "pos": "noun"
            },
            {
                "word": "gizzard",
                "pos": "noun"
            },
            {
                "word": "the GLA",
                "pos": ""
            },
            {
                "word": "glacé",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the part of a bird’s stomach in which food is broken up into smaller pieces before being digested",
                    "vi": "phần dạ dày của chim, trong đó thức ăn được chia thành nhiều mảnh nhỏ hơn trước khi được tiêu hóa"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "7039fbfbd830425b91c9fee1a1bfe1ae",
        "word": "mandible",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmændɪbl/",
            "us": "/ˈmændɪbl/"
        },
        "nearby": [
            {
                "word": "mandatory",
                "pos": "adjective"
            },
            {
                "word": "mandazi",
                "pos": "noun"
            },
            {
                "word": "mandible",
                "pos": "noun"
            },
            {
                "word": "mandir",
                "pos": "noun"
            },
            {
                "word": "M&M's",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the jawbone",
                    "vi": "xương hàm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the upper or lower part of a bird’s beak",
                    "vi": "phần trên hoặc phần dưới của mỏ chim"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "either of the two parts that are at the front and on either side of an insect’s mouth, used especially for biting and crushing food",
                    "vi": "một trong hai bộ phận ở phía trước và hai bên miệng của côn trùng, được sử dụng đặc biệt để cắn và nghiền thức ăn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "fa34d12ef9a141349691f087300b25b8",
        "word": "plumage",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpluːmɪdʒ/",
            "us": "/ˈpluːmɪdʒ/"
        },
        "nearby": [
            {
                "word": "plum",
                "pos": "noun"
            },
            {
                "word": "plum",
                "pos": "adjective"
            },
            {
                "word": "plumage",
                "pos": "noun"
            },
            {
                "word": "plumb",
                "pos": "verb"
            },
            {
                "word": "plumb",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the feathers covering a bird’s body",
                    "vi": "lông bao phủ cơ thể của một con chim"
                },
                "examples": [
                    {
                        "en": "to be in summer/winter plumage",
                        "vi": "có trong bộ lông mùa hè / mùa đông"
                    }
                ]
            }
        ]
    },
    {
        "id": "2837fac6fb95464e9a9f62ddcbb572c7",
        "word": "talon",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈtælən/",
            "us": "/ˈtælən/"
        },
        "nearby": [
            {
                "word": "the Talmud",
                "pos": "noun"
            },
            {
                "word": "Talmudic",
                "pos": "adjective"
            },
            {
                "word": "talon",
                "pos": "noun"
            },
            {
                "word": "taluk",
                "pos": "noun"
            },
            {
                "word": "talwar",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a long, sharp, curved nail on the feet of some birds, especially birds of prey (= birds that kill other creatures for food)",
                    "vi": "móng cong, dài, sắc nhọn trên bàn chân của một số loài chim, đặc biệt là chim săn mồi (= loài chim giết các sinh vật khác để làm thức ăn)"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "0d24c5e1f54d4b5ca3a283d746f57e70",
        "word": "vent",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/vent/",
            "us": "/vent/"
        },
        "nearby": [
            {
                "word": "venomously",
                "pos": "adverb"
            },
            {
                "word": "venous",
                "pos": "adjective"
            },
            {
                "word": "vent",
                "pos": "noun"
            },
            {
                "word": "vent",
                "pos": "verb"
            },
            {
                "word": "ventilate",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an opening that allows air, gas or liquid to pass out of or into a room, building, container, etc.",
                    "vi": "một khe hở cho phép không khí, khí đốt hoặc chất lỏng đi ra ngoài hoặc đi vào phòng, tòa nhà, thùng chứa, v.v."
                },
                "examples": [
                    {
                        "en": "air/heating vents",
                        "vi": "lỗ thông hơi / sưởi ấm"
                    }
                ]
            },
            {
                "define": {
                    "en": "the opening in the body of a bird, fish, reptile or other small animal, through which waste matter is passed out",
                    "vi": "lỗ mở trong cơ thể của chim, cá, bò sát hoặc động vật nhỏ khác, qua đó chất thải được thải ra ngoài"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a long, thin opening at the bottom of the back or side of a coat or jacket",
                    "vi": "một lỗ dài và mỏng ở dưới cùng của lưng hoặc bên hông của áo khoác hoặc áo khoác"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to express a feeling, especially anger, strongly",
                    "vi": "thể hiện một cách mạnh mẽ cảm xúc, đặc biệt là tức giận"
                },
                "examples": [
                    {
                        "en": "Children give vent to their anger in various ways.",
                        "vi": "Trẻ em giải tỏa cơn giận bằng nhiều cách khác nhau."
                    },
                    {
                        "en": "She gave full vent to her feelings in a violent outburst.",
                        "vi": "Cô ấy đã bộc lộ hết cảm xúc của mình trong một cơn bộc phát dữ dội."
                    }
                ]
            }
        ]
    },
    {
        "id": "61048809c52a4624a810d02e37302664",
        "word": "wattle",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈwɒtl/",
            "us": "/ˈwɑːtl/"
        },
        "nearby": [
            {
                "word": "James Watt",
                "pos": ""
            },
            {
                "word": "wattage",
                "pos": "noun"
            },
            {
                "word": "wattle",
                "pos": "noun"
            },
            {
                "word": "Evelyn Waugh",
                "pos": ""
            },
            {
                "word": "wave",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "sticks woven together as a material for making fences, walls, etc.",
                    "vi": "các que đan lại với nhau để làm vật liệu làm hàng rào, tường, v.v."
                },
                "examples": [
                    {
                        "en": "walls made of wattle and daub",
                        "vi": "những bức tường làm bằng mo cau và daub"
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of red skin that hangs down from the throat of a bird such as a turkey",
                    "vi": "một miếng da đỏ treo xuống cổ họng của một loài chim chẳng hạn như gà tây"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a name for various types of acacia tree",
                    "vi": "tên các loại cây keo"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "550e5c00d588418b82aef63a0be8e6a7",
        "word": "wishbone",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈwɪʃbəʊn/",
            "us": "/ˈwɪʃbəʊn/"
        },
        "nearby": [
            {
                "word": "wish",
                "pos": "noun"
            },
            {
                "word": "wish away",
                "pos": "phrasal verb"
            },
            {
                "word": "wishbone",
                "pos": "noun"
            },
            {
                "word": "wishful thinking",
                "pos": "noun"
            },
            {
                "word": "wishing well",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a bone in the shape of a V between the neck and breast of a chicken, duck, etc. When the bird is eaten, this bone is sometimes pulled apart by two people, and the person who gets the larger part can make a wish.",
                    "vi": "một khúc xương hình chữ V giữa cổ và ức gà, vịt,… Khi ăn thịt gia cầm, khúc xương này có khi bị hai người kéo ra, người lấy được phần to hơn thì ước được."
                },
                "examples": []
            }
        ]
    }
]