[
    {
        "id": "68d5a7183bc743b193ff5fbb70d95994",
        "word": "history",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/ˈhɪstri/",
            "us": "/ˈhɪstri/"
        },
        "nearby": [
            {
                "word": "historiographical",
                "pos": "adjective"
            },
            {
                "word": "historiography",
                "pos": "noun"
            },
            {
                "word": "history",
                "pos": "noun"
            },
            {
                "word": "history-sheeter",
                "pos": "noun"
            },
            {
                "word": "histrionic",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "all the events that happened in the past",
                    "vi": "tất cả các sự kiện đã xảy ra trong quá khứ"
                },
                "examples": [
                    {
                        "en": "in history The battle was a turning point in human history.",
                        "vi": "trong lịch sử Trận chiến là một bước ngoặt trong lịch sử nhân loại."
                    },
                    {
                        "en": "one of the worst disasters in recent history",
                        "vi": "một trong những thảm họa tồi tệ nhất trong lịch sử gần đây"
                    },
                    {
                        "en": "throughout history Many people throughout history have dreamt of a world without war.",
                        "vi": "Trong suốt lịch sử Nhiều người trong suốt lịch sử đã mơ về một thế giới không có chiến tranh."
                    },
                    {
                        "en": "a people with no sense of history",
                        "vi": "một dân tộc không có cảm giác về lịch sử"
                    },
                    {
                        "en": "The area was inhabited long before the dawn of recorded history (= before people wrote about events).",
                        "vi": "Khu vực này đã có người sinh sống từ rất lâu trước buổi bình minh của lịch sử được ghi lại (= trước khi mọi người viết về các sự kiện)."
                    },
                    {
                        "en": "These events changed the course of history.",
                        "vi": "Những sự kiện này đã thay đổi tiến trình lịch sử."
                    },
                    {
                        "en": "This was her attempt to rewrite history with herself in the role of heroine.",
                        "vi": "Đây là nỗ lực của cô để viết lại lịch sử với chính mình trong vai trò nữ anh hùng."
                    }
                ]
            },
            {
                "define": {
                    "en": "the past events connected with the development of a particular place, subject, etc.",
                    "vi": "các sự kiện trong quá khứ kết nối với sự phát triển của một địa điểm, chủ đề cụ thể, v.v."
                },
                "examples": [
                    {
                        "en": "the history of science/music/philosophy",
                        "vi": "lịch sử khoa học / âm nhạc / triết học"
                    },
                    {
                        "en": "She is an expert in the history of the United States.",
                        "vi": "Cô ấy là một chuyên gia về lịch sử của Hoa Kỳ."
                    },
                    {
                        "en": "The local history of the area is fascinating.",
                        "vi": "Lịch sử địa phương của khu vực này thật hấp dẫn."
                    },
                    {
                        "en": "The museum traces the history of the slave trade.",
                        "vi": "Bảo tàng lưu lại lịch sử buôn bán nô lệ."
                    }
                ]
            },
            {
                "define": {
                    "en": "the study of past events, especially as a subject at school or university",
                    "vi": "nghiên cứu các sự kiện trong quá khứ, đặc biệt là một môn học ở trường học hoặc trường đại học"
                },
                "examples": [
                    {
                        "en": "a history professor/teacher",
                        "vi": "một giáo sư / giáo viên lịch sử"
                    },
                    {
                        "en": "a history lesson/textbook",
                        "vi": "một bài học lịch sử / sách giáo khoa"
                    },
                    {
                        "en": "a degree in History",
                        "vi": "bằng Lịch sử"
                    },
                    {
                        "en": "cultural/social/economic/political history",
                        "vi": "lịch sử văn hóa / xã hội / kinh tế / chính trị"
                    },
                    {
                        "en": "modern/ancient history",
                        "vi": "lịch sử hiện đại / cổ đại"
                    },
                    {
                        "en": "She's studying art history.",
                        "vi": "Cô ấy đang học lịch sử nghệ thuật."
                    },
                    {
                        "en": "She studies history of art.",
                        "vi": "Cô ấy nghiên cứu lịch sử nghệ thuật."
                    }
                ]
            },
            {
                "define": {
                    "en": "a written or spoken account of real past events",
                    "vi": "một tài khoản viết hoặc nói về các sự kiện thực trong quá khứ"
                },
                "examples": [
                    {
                        "en": "She's writing a new history of Europe.",
                        "vi": "Cô ấy đang viết một trang sử mới của Châu Âu."
                    },
                    {
                        "en": "She went on to catalogue a long history of disasters.",
                        "vi": "Cô tiếp tục liệt kê một lịch sử lâu dài về các thảm họa."
                    },
                    {
                        "en": "the oral histories of ordinary people",
                        "vi": "lịch sử truyền miệng của những người bình thường"
                    }
                ]
            },
            {
                "define": {
                    "en": "the set of facts that are known about somebody/something's past",
                    "vi": "tập hợp các sự kiện đã biết về quá khứ của ai đó / điều gì đó"
                },
                "examples": [
                    {
                        "en": "I know nothing about his personal history.",
                        "vi": "Tôi không biết gì về lịch sử cá nhân của anh ấy."
                    },
                    {
                        "en": "The group has quite a history.",
                        "vi": "Nhóm có lịch sử khá lâu đời."
                    },
                    {
                        "en": "The doctor will need some details of your medical history.",
                        "vi": "Bác sĩ sẽ cần một số chi tiết về bệnh sử của bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a record of something happening frequently in the past life of a person, family or place",
                    "vi": "bản ghi về điều gì đó xảy ra thường xuyên trong tiền kiếp của một người, gia đình hoặc địa điểm"
                },
                "examples": [
                    {
                        "en": "He has a history of violent crime.",
                        "vi": "Anh ta có tiền sử tội phạm bạo lực."
                    },
                    {
                        "en": "She has a long history of mental illness.",
                        "vi": "Cô có tiền sử bệnh tâm thần lâu năm."
                    },
                    {
                        "en": "There is a history of heart disease in my family.",
                        "vi": "Có tiền sử bệnh tim trong gia đình tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a record kept by a web browser of the web pages and other files it has been used to access",
                    "vi": "một bản ghi được lưu giữ bởi trình duyệt web về các trang web và các tệp khác mà nó đã được sử dụng để truy cập"
                },
                "examples": [
                    {
                        "en": "Clearing your browser history prevents websites from following and tracking your actions.",
                        "vi": "Xóa lịch sử trình duyệt của bạn ngăn các trang web theo dõi và theo dõi hành động của bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a relationship between two people, groups, companies, etc. that started in the past and continued for a period of time, especially one involving bad or complicated feelings",
                    "vi": "mối quan hệ giữa hai người, nhóm, công ty, v.v. đã bắt đầu trong quá khứ và tiếp tục trong một khoảng thời gian, đặc biệt là mối quan hệ liên quan đến cảm xúc tồi tệ hoặc phức tạp"
                },
                "examples": [
                    {
                        "en": "Sure there's history between Anna Mae and me, like you said.",
                        "vi": "Chắc chắn có lịch sử giữa Anna Mae và tôi, như bạn đã nói."
                    }
                ]
            },
            {
                "define": {
                    "en": "a historical play",
                    "vi": "một vở kịch lịch sử"
                },
                "examples": [
                    {
                        "en": "Shakespeare's comedies, histories and tragedies",
                        "vi": "Phim hài, lịch sử và bi kịch của Shakespeare"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be dead or no longer important",
                    "vi": "chết hoặc không còn quan trọng"
                },
                "examples": [
                    {
                        "en": "Another mistake like that and you're history.",
                        "vi": "Một sai lầm khác như thế và bạn là lịch sử."
                    },
                    {
                        "en": "We won't talk about that—that's history.",
                        "vi": "Chúng ta sẽ không nói về điều đó - đó là lịch sử."
                    },
                    {
                        "en": "That's past history now.",
                        "vi": "Đó là lịch sử quá khứ bây giờ."
                    },
                    {
                        "en": "They had an affair once, but that's past history now.",
                        "vi": "Họ đã ngoại tình một lần, nhưng đó là lịch sử đã qua."
                    }
                ]
            },
            {
                "define": {
                    "en": "the record of great achievements in history",
                    "vi": "kỷ lục của những thành tựu vĩ đại trong lịch sử"
                },
                "examples": [
                    {
                        "en": "She has earned her place in the history books.",
                        "vi": "Cô ấy đã giành được vị trí của mình trong sử sách."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that things often happen later in the same way as before",
                    "vi": "được sử dụng để nói rằng mọi thứ thường xảy ra sau đó giống như trước đây"
                },
                "examples": [
                    {
                        "en": "Years later family history repeated itself with Eve’s daughters.",
                        "vi": "Nhiều năm sau, lịch sử gia đình lặp lại với các cô con gái của Eve."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be or do something so important that it will be recorded in history",
                    "vi": "trở thành hoặc làm điều gì đó quan trọng đến mức nó sẽ được ghi vào lịch sử"
                },
                "examples": [
                    {
                        "en": "a discovery that made medical history",
                        "vi": "một khám phá làm nên lịch sử y học"
                    }
                ]
            },
            {
                "define": {
                    "en": "used when you are telling a story to say that you do not need to tell the end of it, because everyone knows it already",
                    "vi": "được sử dụng khi bạn đang kể một câu chuyện để nói rằng bạn không cần phải kể phần cuối của nó, vì mọi người đều biết điều đó rồi"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "d3206164c20a4d4dac2097eb0608e60a",
        "word": "invention",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ɪnˈvenʃn/",
            "us": "/ɪnˈvenʃn/"
        },
        "nearby": [
            {
                "word": "inveigle",
                "pos": "verb"
            },
            {
                "word": "invent",
                "pos": "verb"
            },
            {
                "word": "invention",
                "pos": "noun"
            },
            {
                "word": "inventive",
                "pos": "adjective"
            },
            {
                "word": "inventively",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a thing or an idea that has been invented",
                    "vi": "một điều hoặc một ý tưởng đã được phát minh"
                },
                "examples": [
                    {
                        "en": "Fax machines were a wonderful invention at the time.",
                        "vi": "Máy fax là một phát minh tuyệt vời vào thời điểm đó."
                    },
                    {
                        "en": "He failed to patent his invention and never made a penny from it.",
                        "vi": "Ông đã thất bại trong việc cấp bằng sáng chế cho phát minh của mình và không bao giờ kiếm được một xu nào từ nó."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of inventing something",
                    "vi": "hành động phát minh ra thứ gì đó"
                },
                "examples": [
                    {
                        "en": "Such changes have not been seen since the invention of the printing press.",
                        "vi": "Những thay đổi như vậy đã không được nhìn thấy kể từ khi phát minh ra máy in."
                    },
                    {
                        "en": "After the war, Westinghouse devoted himself to invention.",
                        "vi": "Sau chiến tranh, Westinghouse đã cống hiến hết mình cho việc phát minh."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of inventing a story or an idea and pretending that it is true; a story invented in this way",
                    "vi": "hành động bịa ra một câu chuyện hoặc một ý tưởng và giả vờ rằng đó là sự thật; một câu chuyện được phát minh theo cách này"
                },
                "examples": [
                    {
                        "en": "This story is apparently a complete invention.",
                        "vi": "Câu chuyện này rõ ràng là một phát minh hoàn chỉnh."
                    },
                    {
                        "en": "Most of what she says is pure invention.",
                        "vi": "Hầu hết những gì cô ấy nói là phát minh thuần túy."
                    },
                    {
                        "en": "What would he tell his parents? Some invention and quick thinking—that’s what was needed.",
                        "vi": "Anh ấy sẽ nói gì với bố mẹ mình? Một số phát minh và tư duy nhanh — đó là những gì cần thiết."
                    }
                ]
            },
            {
                "define": {
                    "en": "the ability to have new and interesting ideas",
                    "vi": "khả năng có những ý tưởng mới và thú vị"
                },
                "examples": [
                    {
                        "en": "John was full of invention—always making up new dance steps and sequences.",
                        "vi": "John đầy sáng tạo — luôn tạo ra các bước nhảy và trình tự mới."
                    },
                    {
                        "en": "Her powers of invention were somewhat limited.",
                        "vi": "Khả năng phát minh của cô bị hạn chế phần nào."
                    }
                ]
            },
            {
                "define": {
                    "en": "a difficult new problem forces people to think of a solution to it",
                    "vi": "một vấn đề khó mới buộc mọi người phải nghĩ ra giải pháp cho nó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "6934431a21024976896642120f53c36f",
        "word": "battle",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈbætl/",
            "us": "/ˈbætl/"
        },
        "nearby": [
            {
                "word": "Battery Park",
                "pos": ""
            },
            {
                "word": "batting average",
                "pos": "noun"
            },
            {
                "word": "battle",
                "pos": "noun"
            },
            {
                "word": "battle",
                "pos": "verb"
            },
            {
                "word": "battleaxe",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a fight between armies, ships or planes, especially during a war; a violent fight between groups of people",
                    "vi": "một cuộc chiến giữa quân đội, tàu hoặc máy bay, đặc biệt là trong chiến tranh; một cuộc chiến bạo lực giữa các nhóm người"
                },
                "examples": [
                    {
                        "en": "Napoleon was defeated at the Battle of Waterloo.",
                        "vi": "Napoléon bị đánh bại trong trận Waterloo."
                    },
                    {
                        "en": "in battle His father had been killed in battle.",
                        "vi": "trong trận chiến Cha anh đã bị giết trong trận chiến."
                    },
                    {
                        "en": "to go into battle",
                        "vi": "đi vào trận chiến"
                    },
                    {
                        "en": "battle with somebody Hundreds of protesters fought running battles with the police.",
                        "vi": "trận chiến với ai đó Hàng trăm người biểu tình đã chiến đấu với cảnh sát."
                    },
                    {
                        "en": "battle against somebody In 1817 Bolivar won a series of battles against Spanish forces.",
                        "vi": "Trận chiến chống lại ai đó Năm 1817, Bolivar đã giành chiến thắng trong một loạt trận chiến chống lại lực lượng Tây Ban Nha."
                    },
                    {
                        "en": "battle between A and B It ended in a gun battle between police and drug smugglers.",
                        "vi": "Trận chiến giữa A và B Nó kết thúc trong một cuộc đấu súng giữa cảnh sát và những kẻ buôn lậu ma túy."
                    }
                ]
            },
            {
                "define": {
                    "en": "a competition, an argument or a struggle between people or groups of people trying to win power or control",
                    "vi": "một cuộc cạnh tranh, một cuộc tranh cãi hoặc một cuộc đấu tranh giữa những người hoặc nhóm người cố gắng giành quyền lực hoặc quyền kiểm soát"
                },
                "examples": [
                    {
                        "en": "battle for something She finally won her six-year battle for compensation.",
                        "vi": "trận chiến vì một thứ gì đó Cuối cùng cô ấy đã chiến thắng trong trận chiến sáu năm của mình để được đền bù."
                    },
                    {
                        "en": "battle with somebody (for something) They are engaged in a legal battle with their competitors.",
                        "vi": "chiến đấu với ai đó (vì điều gì đó) Họ đang tham gia vào một cuộc chiến pháp lý với các đối thủ cạnh tranh của họ."
                    },
                    {
                        "en": "battle against somebody He faces an uphill battle against a hostile press.",
                        "vi": "trận chiến chống lại ai đó Anh ấy phải đối mặt với một cuộc chiến khó khăn chống lại một báo chí thù địch."
                    },
                    {
                        "en": "a battle of wits (= when each side uses their ability to think quickly to try to win)",
                        "vi": "một cuộc đấu trí (= khi mỗi bên sử dụng khả năng suy nghĩ nhanh chóng của mình để cố gắng giành chiến thắng)"
                    },
                    {
                        "en": "a battle of wills (= when each side is very determined to win)",
                        "vi": "một trận chiến của ý chí (= khi mỗi bên đều rất quyết tâm giành chiến thắng)"
                    },
                    {
                        "en": "the battle of the sexes",
                        "vi": "cuộc chiến của hai giới"
                    },
                    {
                        "en": "battle between A and B The essay discusses the endless battle between man and nature.",
                        "vi": "Trận chiến giữa A và B Bài văn bàn về cuộc chiến không hồi kết giữa con người và thiên nhiên."
                    },
                    {
                        "en": "battle over something The government now faces a new battle over tax increases.",
                        "vi": "cuộc chiến về một cái gì đó Chính phủ hiện phải đối mặt với một cuộc chiến mới về việc tăng thuế."
                    }
                ]
            },
            {
                "define": {
                    "en": "a determined effort that somebody makes to solve a difficult problem or succeed in a difficult situation",
                    "vi": "một nỗ lực quyết tâm mà ai đó thực hiện để giải quyết một vấn đề khó khăn hoặc thành công trong một tình huống khó khăn"
                },
                "examples": [
                    {
                        "en": "battle against something She finally lost her long battle against cancer.",
                        "vi": "Trận chiến chống lại thứ gì đó Cuối cùng cô ấy đã thua trận chiến dài chống lại căn bệnh ung thư."
                    },
                    {
                        "en": "He has fought an uphill battle against prejudice.",
                        "vi": "Anh ấy đã chiến đấu một trận chiến khó khăn chống lại định kiến."
                    },
                    {
                        "en": "battle for something Her life had become a battle for survival.",
                        "vi": "cuộc chiến giành lấy một thứ gì đó Cuộc sống của cô ấy đã trở thành một trận chiến để sinh tồn."
                    },
                    {
                        "en": "the battle for human rights",
                        "vi": "cuộc chiến cho quyền con người"
                    },
                    {
                        "en": "battle with something his battle with alcoholism",
                        "vi": "chiến đấu với thứ gì đó trận chiến của anh ấy với chứng nghiện rượu"
                    },
                    {
                        "en": "battle to do something They have been at the forefront of the battle to save the hospital.",
                        "vi": "trận chiến để làm điều gì đó Họ đã đi đầu trong cuộc chiến để cứu bệnh viện."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that people or groups have shown which side they intend to support in an argument or contest that is going to begin",
                    "vi": "được sử dụng để nói rằng mọi người hoặc nhóm đã chỉ ra rằng họ dự định ủng hộ phe nào trong một cuộc tranh cãi hoặc cuộc cạnh tranh sắp bắt đầu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to fight or argue with somebody",
                    "vi": "chiến đấu hoặc tranh luận với ai đó"
                },
                "examples": [
                    {
                        "en": "He was quite prepared to do battle with his boss over his promotion.",
                        "vi": "Anh ấy đã khá chuẩn bị sẵn sàng để chiến đấu với ông chủ của mình để được thăng chức."
                    },
                    {
                        "en": "Are you prepared to do battle with your insurance company over the claim?",
                        "vi": "Bạn đã chuẩn bị để đấu tranh với công ty bảo hiểm của mình về yêu cầu bồi thường chưa?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be able to win an argument or get what you want without anyone’s help",
                    "vi": "để có thể thắng trong một cuộc tranh luận hoặc đạt được những gì bạn muốn mà không cần sự trợ giúp của bất kỳ ai"
                },
                "examples": [
                    {
                        "en": "I wouldn't get involved—he's old enough to fight his own battles.",
                        "vi": "Tôi sẽ không tham gia — anh ấy đủ lớn để chiến đấu trong các trận chiến của riêng mình."
                    },
                    {
                        "en": "My parents believed in leaving me to fight my own battles.",
                        "vi": "Cha mẹ tôi đã tin tưởng khi để tôi chiến đấu trong những trận chiến của chính mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "the most important or difficult part of achieving something",
                    "vi": "phần quan trọng hoặc khó khăn nhất của việc đạt được điều gì đó"
                },
                "examples": [
                    {
                        "en": "When you’ve got a difficult day ahead, getting a good night’s sleep is often half the battle.",
                        "vi": "Khi bạn có một ngày khó khăn phía trước, thì việc ngủ một giấc ngon lành thường là một nửa của trận chiến."
                    }
                ]
            },
            {
                "define": {
                    "en": "to begin fighting somebody",
                    "vi": "bắt đầu chiến đấu với ai đó"
                },
                "examples": [
                    {
                        "en": "The two armies joined battle.",
                        "vi": "Hai đội quân tham chiến."
                    },
                    {
                        "en": "(figurative) Local residents have joined battle with the council over the lack of parking facilities.",
                        "vi": "(nghĩa bóng) Cư dân địa phương đã tham gia cuộc chiến với hội đồng về việc thiếu bãi đậu xe."
                    }
                ]
            },
            {
                "define": {
                    "en": "(to try to do) something that you will probably never succeed in doing",
                    "vi": "(cố gắng làm) điều gì đó mà bạn có thể sẽ không bao giờ thành công khi làm"
                },
                "examples": [
                    {
                        "en": "I’m fighting a losing battle against the mess in this house!",
                        "vi": "Tôi đang chiến đấu một trận thua với mớ hỗn độn trong ngôi nhà này!"
                    },
                    {
                        "en": "She wanted him to take some responsibility for his actions, but she knew it was a losing battle.",
                        "vi": "Cô muốn anh phải chịu trách nhiệm về hành động của mình, nhưng cô biết đó là một trận thua."
                    }
                ]
            }
        ]
    },
    {
        "id": "2a6105c292e14fe893d67aea91b663b8",
        "word": "action",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈækʃn/",
            "us": "/ˈækʃn/"
        },
        "nearby": [
            {
                "word": "acting pilot officer",
                "pos": "noun"
            },
            {
                "word": "actinium",
                "pos": "noun"
            },
            {
                "word": "action",
                "pos": "noun"
            },
            {
                "word": "action",
                "pos": "verb"
            },
            {
                "word": "actionable",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the process of doing something in order to make something happen or to deal with a situation",
                    "vi": "quá trình làm điều gì đó để biến điều gì đó xảy ra hoặc để đối phó với một tình huống"
                },
                "examples": [
                    {
                        "en": "The time has come for action if these beautiful animals are to survive.",
                        "vi": "Đã đến lúc phải hành động nếu những con vật xinh đẹp này muốn tồn tại."
                    },
                    {
                        "en": "to threaten/demand/call for action",
                        "vi": "đe dọa / yêu cầu / kêu gọi hành động"
                    },
                    {
                        "en": "Firefighters took action immediately to stop the blaze spreading.",
                        "vi": "Lực lượng cứu hỏa đã hành động ngay lập tức để ngăn ngọn lửa lan rộng."
                    },
                    {
                        "en": "Divers were close at hand, ready to go into action if the stunt went wrong.",
                        "vi": "Các thợ lặn đã sẵn sàng hành động nếu diễn viên đóng thế gặp trục trặc."
                    },
                    {
                        "en": "What is the best course of action in the circumstances?",
                        "vi": "Cách hành động tốt nhất trong hoàn cảnh nào?"
                    },
                    {
                        "en": "She began to explain her plan of action to the group.",
                        "vi": "Cô bắt đầu giải thích kế hoạch hành động của mình cho cả nhóm."
                    },
                    {
                        "en": "The men face disciplinary action.",
                        "vi": "Những người đàn ông phải đối mặt với hình thức kỷ luật."
                    }
                ]
            },
            {
                "define": {
                    "en": "a thing that somebody does",
                    "vi": "một điều mà ai đó làm"
                },
                "examples": [
                    {
                        "en": "Each of us must take responsibility for our own actions.",
                        "vi": "Mỗi chúng ta phải tự chịu trách nhiệm về những việc làm của mình."
                    },
                    {
                        "en": "They sought to justify their actions.",
                        "vi": "Họ đã tìm cách biện minh cho hành động của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "things that workers do, especially stopping work, to protest to their employers about something",
                    "vi": "những việc mà người lao động làm, đặc biệt là ngừng việc, để phản đối người chủ của họ về điều gì đó"
                },
                "examples": [
                    {
                        "en": "Workers voted in favour of strike action.",
                        "vi": "Công nhân đã bỏ phiếu ủng hộ hành động đình công."
                    },
                    {
                        "en": "They called off their action at 7.40 am after the meeting was arranged.",
                        "vi": "Họ ngừng hành động lúc 7 giờ 40 sáng sau khi cuộc họp được sắp xếp."
                    },
                    {
                        "en": "Unions said the action could be suspended early on Friday if talks between the two sides resumed.",
                        "vi": "Các nghiệp đoàn cho biết hành động này có thể bị đình chỉ vào đầu ngày thứ Sáu nếu các cuộc đàm phán giữa hai bên được nối lại."
                    },
                    {
                        "en": "The government began taking a hard line against labour actions.",
                        "vi": "Chính phủ bắt đầu có đường lối cứng rắn đối với các hành động lao động."
                    }
                ]
            },
            {
                "define": {
                    "en": "a legal process to stop a person or company from doing something, or to make them pay for a mistake, etc.",
                    "vi": "một quy trình pháp lý để ngăn một người hoặc công ty làm điều gì đó hoặc buộc họ phải trả giá cho một sai lầm, v.v."
                },
                "examples": [
                    {
                        "en": "A libel action is being brought against the magazine that published the article.",
                        "vi": "Một hành động bôi nhọ đang được thực hiện chống lại tạp chí đã xuất bản bài báo."
                    },
                    {
                        "en": "action against somebody/something He is considering taking legal action against the hospital.",
                        "vi": "hành động chống lại ai đó / điều gì đó Anh ấy đang xem xét việc thực hiện hành động pháp lý chống lại bệnh viện."
                    }
                ]
            },
            {
                "define": {
                    "en": "fighting in a battle or war",
                    "vi": "chiến đấu trong một trận chiến hoặc chiến tranh"
                },
                "examples": [
                    {
                        "en": "The possibility of taking military action has not been ruled out.",
                        "vi": "Khả năng thực hiện các hành động quân sự vẫn chưa bị loại trừ."
                    },
                    {
                        "en": "I never saw action during the war.",
                        "vi": "Tôi chưa bao giờ thấy hành động trong chiến tranh."
                    },
                    {
                        "en": "in action soldiers killed in action",
                        "vi": "trong hành động những người lính bị giết trong hành động"
                    }
                ]
            },
            {
                "define": {
                    "en": "the events in a story, play, etc.",
                    "vi": "các sự kiện trong một câu chuyện, vở kịch, v.v."
                },
                "examples": [
                    {
                        "en": "The action takes place in France.",
                        "vi": "Hành động diễn ra ở Pháp."
                    }
                ]
            },
            {
                "define": {
                    "en": "exciting events",
                    "vi": "sự kiện thú vị"
                },
                "examples": [
                    {
                        "en": "I like films with plenty of action.",
                        "vi": "Tôi thích những bộ phim có nhiều pha hành động."
                    },
                    {
                        "en": "New York is where the action is.",
                        "vi": "New York là nơi hành động."
                    },
                    {
                        "en": "If you want to know where all the action is around here, just ask Jo.",
                        "vi": "Nếu bạn muốn biết tất cả các hành động xung quanh đây ở đâu, chỉ cần hỏi Jo."
                    }
                ]
            },
            {
                "define": {
                    "en": "the effect that something such as a chemical has on something",
                    "vi": "ảnh hưởng của một thứ gì đó chẳng hạn như hóa chất đối với một thứ gì đó"
                },
                "examples": [
                    {
                        "en": "Vitamin D can be made in the body by the action of sunlight on the skin.",
                        "vi": "Vitamin D có thể được tạo ra trong cơ thể nhờ tác động của ánh nắng mặt trời lên da."
                    },
                    {
                        "en": "The action of the rushing water cleans the gully.",
                        "vi": "Hoạt động của dòng nước chảy xiết sẽ làm sạch rãnh nước."
                    }
                ]
            },
            {
                "define": {
                    "en": "the way a part of the body moves or functions",
                    "vi": "cách một bộ phận của cơ thể di chuyển hoặc hoạt động"
                },
                "examples": [
                    {
                        "en": "a study of the action of the liver",
                        "vi": "một nghiên cứu về hoạt động của gan"
                    }
                ]
            },
            {
                "define": {
                    "en": "the mechanical parts of a piano, gun, clock, etc. or the way the parts move",
                    "vi": "các bộ phận cơ học của đàn piano, súng, đồng hồ, v.v. hoặc cách các bộ phận chuyển động"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "what a person actually does means more than what they say they will do",
                    "vi": "những gì một người thực sự làm có ý nghĩa hơn những gì họ nói rằng họ sẽ làm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "if somebody/something is in action, they are doing the activity or work that is typical for them",
                    "vi": "nếu ai đó / điều gì đó đang hoạt động, họ đang thực hiện hoạt động hoặc công việc tiêu biểu cho họ"
                },
                "examples": [
                    {
                        "en": "Just press the button to see your favourite character in action.",
                        "vi": "Chỉ cần nhấn nút để xem nhân vật yêu thích của bạn đang hoạt động."
                    },
                    {
                        "en": "I've yet to see all the players in action.",
                        "vi": "Tôi vẫn chưa thấy tất cả các cầu thủ thi đấu."
                    },
                    {
                        "en": "I have not yet seen the machines in action.",
                        "vi": "Tôi vẫn chưa nhìn thấy máy móc hoạt động."
                    }
                ]
            },
            {
                "define": {
                    "en": "if you put an idea or a plan into action, you start making it happen or work",
                    "vi": "nếu bạn đưa một ý tưởng hoặc một kế hoạch vào hành động, bạn bắt đầu biến nó thành hiện thực hoặc hoạt động"
                },
                "examples": [
                    {
                        "en": "The new plan for traffic control is being put into action on an experimental basis.",
                        "vi": "Kế hoạch mới để kiểm soát giao thông đang được thực hiện trên cơ sở thử nghiệm."
                    },
                    {
                        "en": "We need to put these ideas into action.",
                        "vi": "Chúng ta cần đưa những ý tưởng này vào hành động."
                    }
                ]
            },
            {
                "define": {
                    "en": "not able to work or be used because of injury or damage",
                    "vi": "không thể làm việc hoặc sử dụng được vì bị thương hoặc bị hư hỏng"
                },
                "examples": [
                    {
                        "en": "Jon will be out of action for weeks with a broken leg.",
                        "vi": "Jon sẽ phải nghỉ thi đấu nhiều tuần vì bị gãy chân."
                    },
                    {
                        "en": "The photocopier is out of action today.",
                        "vi": "Hôm nay máy photocopy không hoạt động."
                    },
                    {
                        "en": "He is out of action following an ankle injury.",
                        "vi": "Anh ấy phải nghỉ thi đấu sau chấn thương mắt cá chân."
                    }
                ]
            },
            {
                "define": {
                    "en": "a share or role in an interesting or exciting activity, especially one that makes money",
                    "vi": "một chia sẻ hoặc vai trò trong một hoạt động thú vị hoặc hấp dẫn, đặc biệt là một hoạt động kiếm tiền"
                },
                "examples": [
                    {
                        "en": "Foreign firms will all want a piece of the action if the new airport goes ahead.",
                        "vi": "Tất cả các công ty nước ngoài sẽ muốn có một phần hành động nếu sân bay mới đi vào hoạt động."
                    }
                ]
            },
            {
                "define": {
                    "en": "to suddenly start working or doing something",
                    "vi": "đột nhiên bắt đầu làm việc hoặc làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "‘Let's go!’ he said, springing into action.",
                        "vi": "Đi nào!' anh ta nói, bắt đầu hành động."
                    },
                    {
                        "en": "The town springs to life (= becomes busy) during the carnival.",
                        "vi": "Thị trấn bừng lên sức sống (= trở nên bận rộn) trong lễ hội hóa trang."
                    }
                ]
            },
            {
                "define": {
                    "en": "to start doing something quickly and with a lot of energy",
                    "vi": "để bắt đầu làm một việc gì đó nhanh chóng và tốn nhiều năng lượng"
                },
                "examples": [
                    {
                        "en": "The ambulance crew swung into action to resuscitate the patient.",
                        "vi": "Đội xe cứu thương đã lao vào hành động để hồi sức cấp cứu cho bệnh nhân."
                    },
                    {
                        "en": "The rescue operation swung into action immediately.",
                        "vi": "Chiến dịch cứu hộ bắt đầu ngay lập tức."
                    },
                    {
                        "en": "The emergency services swung into action as soon as the disaster was reported.",
                        "vi": "Các dịch vụ khẩn cấp bắt đầu hoạt động ngay sau khi thảm họa được báo cáo."
                    }
                ]
            },
            {
                "define": {
                    "en": "to act in order to avoid danger or an unpleasant situation",
                    "vi": "hành động để tránh nguy hiểm hoặc một tình huống khó chịu"
                },
                "examples": [
                    {
                        "en": "The pilot had to take evasive action to avoid a mid-air collision.",
                        "vi": "Phi công đã phải thực hiện hành động né tránh để tránh va chạm giữa không trung."
                    }
                ]
            }
        ]
    },
    {
        "id": "a8f251131cf54c61b87de890b82f5bb4",
        "word": "colony",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈkɒləni/",
            "us": "/ˈkɑːləni/"
        },
        "nearby": [
            {
                "word": "colonnade",
                "pos": "noun"
            },
            {
                "word": "colonnaded",
                "pos": "adjective"
            },
            {
                "word": "colony",
                "pos": "noun"
            },
            {
                "word": "colophon",
                "pos": "noun"
            },
            {
                "word": "color",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a country or an area that is governed by people from another, more powerful, country",
                    "vi": "một quốc gia hoặc một khu vực được quản lý bởi những người từ một quốc gia khác, mạnh hơn,"
                },
                "examples": [
                    {
                        "en": "former British colonies",
                        "vi": "thuộc địa cũ của Anh"
                    },
                    {
                        "en": "the Declaration of Independence of the 13 colonies and the creation of the United States",
                        "vi": "Tuyên ngôn độc lập của 13 thuộc địa và sự thành lập của Hoa Kỳ"
                    }
                ]
            },
            {
                "define": {
                    "en": "a group of people who go to live permanently in a colony",
                    "vi": "một nhóm người đến sống lâu dài trong một thuộc địa"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a group of people from the same place or with the same work or interests who live in a particular city or country or who live together",
                    "vi": "một nhóm người từ cùng một nơi hoặc có cùng công việc hoặc sở thích sống ở một thành phố hoặc quốc gia cụ thể hoặc những người sống cùng nhau"
                },
                "examples": [
                    {
                        "en": "the American colony in Paris",
                        "vi": "thuộc địa của Mỹ ở Paris"
                    },
                    {
                        "en": "an artists’ colony",
                        "vi": "một thuộc địa của nghệ sĩ"
                    }
                ]
            },
            {
                "define": {
                    "en": "a small town set up by an employer or an organization for its workers",
                    "vi": "một thị trấn nhỏ được thành lập bởi một người sử dụng lao động hoặc một tổ chức cho công nhân của họ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a group of plants or animals that live together or grow in the same place",
                    "vi": "một nhóm thực vật hoặc động vật sống cùng nhau hoặc phát triển ở cùng một nơi"
                },
                "examples": [
                    {
                        "en": "a colony of ants",
                        "vi": "một đàn kiến"
                    },
                    {
                        "en": "a bird colony",
                        "vi": "một đàn chim"
                    }
                ]
            }
        ]
    },
    {
        "id": "3afef4f6128d4a8fbe2e8f026f86e0ed",
        "word": "empire",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈempaɪə(r)/",
            "us": "/ˈempaɪər/"
        },
        "nearby": [
            {
                "word": "emphatically",
                "pos": "adverb"
            },
            {
                "word": "emphysema",
                "pos": "noun"
            },
            {
                "word": "empire",
                "pos": "noun"
            },
            {
                "word": "empire-building",
                "pos": "noun"
            },
            {
                "word": "Empire line",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a group of countries or states that are controlled by one leader or government",
                    "vi": "một nhóm các quốc gia hoặc tiểu bang được kiểm soát bởi một nhà lãnh đạo hoặc chính phủ"
                },
                "examples": [
                    {
                        "en": "These invasions almost led to the collapse of the Roman Empire.",
                        "vi": "Những cuộc xâm lược này gần như đã dẫn đến sự sụp đổ của Đế chế La Mã."
                    }
                ]
            },
            {
                "define": {
                    "en": "a group of commercial organizations controlled by one person or company",
                    "vi": "một nhóm các tổ chức thương mại do một người hoặc một công ty kiểm soát"
                },
                "examples": [
                    {
                        "en": "He has built a huge business empire from humble beginnings.",
                        "vi": "Ông đã xây dựng một đế chế kinh doanh khổng lồ từ những khởi đầu khiêm tốn."
                    },
                    {
                        "en": "the staff who help run his hotel empire",
                        "vi": "những nhân viên giúp điều hành đế chế khách sạn của anh ấy"
                    }
                ]
            },
            {
                "define": {
                    "en": "an area of activity controlled by one person or group",
                    "vi": "một lĩnh vực hoạt động do một người hoặc một nhóm kiểm soát"
                },
                "examples": [
                    {
                        "en": "All the bureaucrats jealously guarded their own little empires.",
                        "vi": "Tất cả các quan chức đều ghen tị bảo vệ đế chế nhỏ của họ."
                    }
                ]
            }
        ]
    },
    {
        "id": "b9d34223bdcc4e32b8b98f1dcbb8d7da",
        "word": "found",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/faʊnd/",
            "us": "/faʊnd/"
        },
        "nearby": [
            {
                "word": "foul up",
                "pos": "phrasal verb"
            },
            {
                "word": "foul-up",
                "pos": "noun"
            },
            {
                "word": "found",
                "pos": "verb"
            },
            {
                "word": "foundation",
                "pos": "noun"
            },
            {
                "word": "foundation course",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to start something, such as an organization or an institution, especially by providing money",
                    "vi": "để bắt đầu một cái gì đó, chẳng hạn như một tổ chức hoặc một tổ chức, đặc biệt là bằng cách cung cấp tiền"
                },
                "examples": [
                    {
                        "en": "to found a club/company/school",
                        "vi": "thành lập một câu lạc bộ / công ty / trường học"
                    },
                    {
                        "en": "Her family founded the college in 1895.",
                        "vi": "Gia đình cô thành lập trường vào năm 1895."
                    },
                    {
                        "en": "the founding members of the European Union",
                        "vi": "các thành viên sáng lập của Liên minh Châu Âu"
                    },
                    {
                        "en": "He was a founding editor of the journal.",
                        "vi": "Ông là một biên tập viên sáng lập của tạp chí."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be the first to start building and living in a town or country",
                    "vi": "trở thành người đầu tiên bắt đầu xây dựng và sống ở một thị trấn hoặc quốc gia"
                },
                "examples": [
                    {
                        "en": "The town was founded by English settlers in 1790.",
                        "vi": "Thị trấn được thành lập bởi những người Anh định cư vào năm 1790."
                    },
                    {
                        "en": "French settlers founded New Orleans.",
                        "vi": "Những người Pháp định cư thành lập New Orleans."
                    },
                    {
                        "en": "the founding generation of immigrants",
                        "vi": "thế hệ nhập cư sáng lập"
                    }
                ]
            },
            {
                "define": {
                    "en": "to base something on something",
                    "vi": "để dựa trên một cái gì đó trên một cái gì đó"
                },
                "examples": [
                    {
                        "en": "be founded on something Their marriage was founded on love and mutual respect.",
                        "vi": "được thành lập trên một cái gì đó Cuộc hôn nhân của họ được thành lập trên tình yêu và sự tôn trọng lẫn nhau."
                    }
                ]
            },
            {
                "define": {
                    "en": "to melt metal and pour it into a mould; to make objects using this process",
                    "vi": "để nấu chảy kim loại và đổ vào khuôn; để tạo các đối tượng bằng cách sử dụng quy trình này"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c2351df4970b4e52899a22753da2c008",
        "word": "invasion",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ɪnˈveɪʒn/",
            "us": "/ɪnˈveɪʒn/"
        },
        "nearby": [
            {
                "word": "invariably",
                "pos": "adverb"
            },
            {
                "word": "invariant",
                "pos": "adjective"
            },
            {
                "word": "invasion",
                "pos": "noun"
            },
            {
                "word": "invasive",
                "pos": "adjective"
            },
            {
                "word": "invective",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act of an army entering another country by force in order to take control of it",
                    "vi": "Hành động của một đội quân xâm nhập vào một quốc gia khác bằng vũ lực để kiểm soát nó"
                },
                "examples": [
                    {
                        "en": "the German invasion of Poland in 1939",
                        "vi": "cuộc xâm lược của Đức vào Ba Lan năm 1939"
                    },
                    {
                        "en": "the threat of invasion",
                        "vi": "mối đe dọa xâm lược"
                    },
                    {
                        "en": "an invasion force/fleet",
                        "vi": "một lực lượng xâm lược / hạm đội"
                    }
                ]
            },
            {
                "define": {
                    "en": "the fact of a large number of people or things arriving somewhere, especially people or things that are unpleasant",
                    "vi": "thực tế là một số lượng lớn người hoặc đồ vật đến một nơi nào đó, đặc biệt là những người hoặc những thứ khó chịu"
                },
                "examples": [
                    {
                        "en": "the annual tourist invasion",
                        "vi": "cuộc xâm lược du lịch hàng năm"
                    },
                    {
                        "en": "Farmers are struggling to cope with an invasion of slugs.",
                        "vi": "Những người nông dân đang phải chống chọi với một cuộc xâm lăng của loài sên."
                    },
                    {
                        "en": "Robberies and home invasions are grim facts of daily life.",
                        "vi": "Những vụ cướp và những cuộc xâm lược nhà là những sự thật nghiệt ngã của cuộc sống hàng ngày."
                    }
                ]
            },
            {
                "define": {
                    "en": "an act or a process that affects somebody/something in a way that is not welcome",
                    "vi": "một hành động hoặc một quá trình ảnh hưởng đến ai đó / điều gì đó theo cách không được hoan nghênh"
                },
                "examples": [
                    {
                        "en": "The actress described the photographs of her as an invasion of privacy.",
                        "vi": "Nữ diễn viên mô tả những bức ảnh của cô như một sự xâm phạm quyền riêng tư."
                    }
                ]
            }
        ]
    },
    {
        "id": "873d6a9e15814f55870c90860b7e787d",
        "word": "revolution",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˌrevəˈluːʃn/",
            "us": "/ˌrevəˈluːʃn/"
        },
        "nearby": [
            {
                "word": "revolting",
                "pos": "adjective"
            },
            {
                "word": "revoltingly",
                "pos": "adverb"
            },
            {
                "word": "revolution",
                "pos": "noun"
            },
            {
                "word": "revolutionary",
                "pos": "adjective"
            },
            {
                "word": "revolutionary",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an attempt, by a large number of people, to change the government of a country, especially by violent action",
                    "vi": "một nỗ lực, của một số lượng lớn người, nhằm thay đổi chính phủ của một quốc gia, đặc biệt là bằng hành động bạo lực"
                },
                "examples": [
                    {
                        "en": "a socialist revolution",
                        "vi": "một cuộc cách mạng xã hội chủ nghĩa"
                    },
                    {
                        "en": "the outbreak of the French Revolution in 1789",
                        "vi": "sự bùng nổ của Cách mạng Pháp năm 1789"
                    },
                    {
                        "en": "The shooting and killing of thirty people started a revolution.",
                        "vi": "Việc bắn chết ba mươi người đã bắt đầu một cuộc cách mạng."
                    },
                    {
                        "en": "The country appears to be on the brink of revolution.",
                        "vi": "Đất nước dường như đang trên bờ vực của cuộc cách mạng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a great change in conditions, ways of working, beliefs, etc. that affects large numbers of people",
                    "vi": "một sự thay đổi lớn về điều kiện, cách làm việc, niềm tin, v.v. ảnh hưởng đến số lượng lớn người dân"
                },
                "examples": [
                    {
                        "en": "a cultural/social/scientific, etc. revolution",
                        "vi": "một cuộc cách mạng văn hóa / xã hội / khoa học, v.v."
                    },
                    {
                        "en": "the sexual revolution of the 1960s",
                        "vi": "cuộc cách mạng tình dục những năm 1960"
                    },
                    {
                        "en": "the digital/technological revolution",
                        "vi": "cuộc cách mạng kỹ thuật số / công nghệ"
                    },
                    {
                        "en": "They led the electronics revolution but have been left behind by the IT revolution.",
                        "vi": "Họ đã dẫn đầu cuộc cách mạng điện tử nhưng đã bị cuộc cách mạng CNTT bỏ lại phía sau."
                    },
                    {
                        "en": "revolution in something A revolution in information technology is taking place.",
                        "vi": "cuộc cách mạng trong một cái gì đó Một cuộc cách mạng về công nghệ thông tin đang diễn ra."
                    }
                ]
            },
            {
                "define": {
                    "en": "a complete circular movement around a point",
                    "vi": "một chuyển động tròn hoàn chỉnh xung quanh một điểm"
                },
                "examples": [
                    {
                        "en": "The disk rotates at up to 500 revolutions per minute.",
                        "vi": "Đĩa quay với tốc độ lên đến 500 vòng mỗi phút."
                    },
                    {
                        "en": "revolution around something The revolution of the earth around the sun takes one year.",
                        "vi": "cuộc cách mạng xung quanh một cái gì đó Cuộc cách mạng của trái đất quanh mặt trời diễn ra trong một năm."
                    }
                ]
            }
        ]
    },
    {
        "id": "ee6cd55ea2334d978ee18af23dc5978f",
        "word": "abolition",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌæbəˈlɪʃn/",
            "us": "/ˌæbəˈlɪʃn/"
        },
        "nearby": [
            {
                "word": "abode",
                "pos": "verb"
            },
            {
                "word": "abolish",
                "pos": "verb"
            },
            {
                "word": "abolition",
                "pos": "noun"
            },
            {
                "word": "abolitionism",
                "pos": "noun"
            },
            {
                "word": "abolitionist",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the ending of a law, a system or an institution",
                    "vi": "sự kết thúc của một luật, một hệ thống hoặc một thể chế"
                },
                "examples": [
                    {
                        "en": "the abolition of slavery",
                        "vi": "việc xóa bỏ chế độ nô lệ"
                    },
                    {
                        "en": "The report recommended the complete abolition of the tax.",
                        "vi": "Báo cáo khuyến nghị bãi bỏ hoàn toàn thuế."
                    },
                    {
                        "en": "the abolition of apartheid/the death penalty",
                        "vi": "bãi bỏ chế độ phân biệt chủng tộc / án tử hình"
                    }
                ]
            }
        ]
    },
    {
        "id": "fc459f96220d474eaf960c83d1912591",
        "word": "battlefield",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈbætlfiːld/",
            "us": "/ˈbætlfiːld/"
        },
        "nearby": [
            {
                "word": "battle fatigue",
                "pos": "noun"
            },
            {
                "word": "battle fatigues",
                "pos": "noun"
            },
            {
                "word": "battlefield",
                "pos": "noun"
            },
            {
                "word": "battleground",
                "pos": "noun"
            },
            {
                "word": "battle-hardened",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a place where a battle is being fought or has been fought",
                    "vi": "một nơi mà một trận chiến đang được diễn ra hoặc đã được chiến đấu"
                },
                "examples": [
                    {
                        "en": "heavy casualties on the battlefield",
                        "vi": "thương vong nặng nề trên chiến trường"
                    },
                    {
                        "en": "He was wounded on the battlefield.",
                        "vi": "Anh ta bị thương trên chiến trường."
                    }
                ]
            },
            {
                "define": {
                    "en": "a situation in which people are opposed to each other; a subject that people feel strongly about and argue about",
                    "vi": "một tình huống mà mọi người đối lập với nhau; một chủ đề mà mọi người cảm thấy mạnh mẽ và tranh luận về"
                },
                "examples": [
                    {
                        "en": "Arkansas is among the key electoral battlefields.",
                        "vi": "Arkansas là một trong những chiến trường bầu cử quan trọng."
                    },
                    {
                        "en": "Education policy is an ideological battlefield.",
                        "vi": "Chính sách giáo dục là một chiến trường ý thức hệ."
                    }
                ]
            }
        ]
    },
    {
        "id": "91fd21a04314474a8bff919656ddbe37",
        "word": "civil war",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌsɪvl ˈwɔː(r)/",
            "us": "/ˌsɪvl ˈwɔːr/"
        },
        "nearby": [
            {
                "word": "the civil service",
                "pos": "noun"
            },
            {
                "word": "civil union",
                "pos": "noun"
            },
            {
                "word": "civil war",
                "pos": "noun"
            },
            {
                "word": "civvies",
                "pos": "noun"
            },
            {
                "word": "Civvy Street",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a war between groups of people in the same country",
                    "vi": "một cuộc chiến giữa các nhóm người trong cùng một quốc gia"
                },
                "examples": [
                    {
                        "en": "the Spanish Civil War",
                        "vi": "cuộc nội chiến Tây Ban Nha"
                    },
                    {
                        "en": "30 years of bitter civil war",
                        "vi": "30 năm nội chiến cay đắng"
                    }
                ]
            },
            {
                "define": {
                    "en": "the war fought in the US between the northern and the southern states in the years 1861 to 1865",
                    "vi": "cuộc chiến ở Hoa Kỳ giữa các bang miền bắc và miền nam trong những năm 1861-1865"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "44a7735bc1284b80b1a8a10bff6be1fe",
        "word": "conquer",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈkɒŋkə(r)/",
            "us": "/ˈkɑːŋkər/"
        },
        "nearby": [
            {
                "word": "connote",
                "pos": "verb"
            },
            {
                "word": "connubial",
                "pos": "adjective"
            },
            {
                "word": "conquer",
                "pos": "verb"
            },
            {
                "word": "conqueror",
                "pos": "noun"
            },
            {
                "word": "the Conqueror",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to take control of a country or city and its people by force",
                    "vi": "để kiểm soát một quốc gia hoặc thành phố và người dân của nó bằng vũ lực"
                },
                "examples": [
                    {
                        "en": "The Normans conquered England in 1066.",
                        "vi": "Người Norman chinh phục nước Anh vào năm 1066."
                    },
                    {
                        "en": "In 330 BC Persia was conquered by Alexander the Great.",
                        "vi": "Năm 330 trước Công nguyên, Ba Tư bị chinh phục bởi Alexander Đại đế."
                    },
                    {
                        "en": "conquered territories/subjects/lands",
                        "vi": "lãnh thổ / chủ thể / vùng đất bị chinh phục"
                    },
                    {
                        "en": "The Roman empire offered citizenship to its conquered peoples.",
                        "vi": "Đế chế La Mã trao quyền công dân cho các dân tộc bị chinh phục."
                    }
                ]
            },
            {
                "define": {
                    "en": "to defeat somebody, especially in a competition, race, etc.",
                    "vi": "để đánh bại ai đó, đặc biệt là trong một cuộc thi, cuộc đua, v.v."
                },
                "examples": [
                    {
                        "en": "The world champion conquered yet another challenger last night.",
                        "vi": "Nhà vô địch thế giới đã chinh phục một kẻ thách thức khác vào đêm qua."
                    }
                ]
            },
            {
                "define": {
                    "en": "to succeed in dealing with or controlling something",
                    "vi": "để thành công trong việc đối phó hoặc kiểm soát một cái gì đó"
                },
                "examples": [
                    {
                        "en": "The only way to conquer a fear is to face it.",
                        "vi": "Cách duy nhất để chinh phục nỗi sợ hãi là đối mặt với nó."
                    },
                    {
                        "en": "Mount Everest was conquered (= successfully climbed) in 1953.",
                        "vi": "Đỉnh Everest đã được chinh phục (= đã leo thành công) vào năm 1953."
                    },
                    {
                        "en": "He will need to conquer his nerves to progress in this competition.",
                        "vi": "Anh ấy sẽ cần phải chinh phục thần kinh của mình để tiến bộ trong cuộc thi này."
                    }
                ]
            },
            {
                "define": {
                    "en": "to become very popular or successful in a place",
                    "vi": "trở nên rất nổi tiếng hoặc thành công ở một nơi"
                },
                "examples": [
                    {
                        "en": "The band is now setting out to conquer the world.",
                        "vi": "Ban nhạc hiện đang lên đường chinh phục thế giới."
                    },
                    {
                        "en": "This is a British film which could conquer the US market.",
                        "vi": "Đây là một bộ phim của Anh có thể chinh phục thị trường Mỹ."
                    }
                ]
            }
        ]
    },
    {
        "id": "041a9ece378b40bb83357a1050854f01",
        "word": "crown",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/kraʊn/",
            "us": "/kraʊn/"
        },
        "nearby": [
            {
                "word": "crowdsourcing",
                "pos": "noun"
            },
            {
                "word": "crown",
                "pos": "noun"
            },
            {
                "word": "crown",
                "pos": "verb"
            },
            {
                "word": "Crown Agent",
                "pos": ""
            },
            {
                "word": "Crown Colony",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to put a crown on the head of a new king or queen as a sign of royal power in a ceremony at which they officially become king or queen",
                    "vi": "đội một chiếc vương miện trên đầu của một vị vua hoặc nữ hoàng mới như một dấu hiệu của quyền lực hoàng gia trong một buổi lễ mà họ chính thức trở thành vua hoặc nữ hoàng"
                },
                "examples": [
                    {
                        "en": "be crowned Queen Elizabeth was crowned in 1953.",
                        "vi": "được trao vương miện Nữ hoàng Elizabeth được trao vương miện vào năm 1953."
                    },
                    {
                        "en": "be crowned + noun The prince was soon to be crowned King of England.",
                        "vi": "được đăng quang + danh từ The Prince was soon to be the King of England."
                    }
                ]
            },
            {
                "define": {
                    "en": "to form or cover the top of something",
                    "vi": "để tạo thành hoặc che phủ trên cùng của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "be crowned with something His head was crowned with a mop of brown curls.",
                        "vi": "được đội vương miện bằng một thứ gì đó Đầu anh đội vương miện bằng một lọn tóc nâu lau."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make something complete or perfect, especially by adding an achievement, a success, etc.",
                    "vi": "để làm cho một cái gì đó hoàn chỉnh hoặc hoàn hảo, đặc biệt là bằng cách thêm một thành tích, một thành công, v.v."
                },
                "examples": [
                    {
                        "en": "crown something The award of the Nobel Prize has crowned a glorious career in physics.",
                        "vi": "trao vương miện gì đó Giải thưởng Nobel đã mang lại một sự nghiệp vẻ vang trong ngành vật lý."
                    },
                    {
                        "en": "be crowned with something Their efforts were finally crowned with success.",
                        "vi": "được đăng quang với một cái gì đó Những nỗ lực của họ cuối cùng đã được đăng quang thành công."
                    }
                ]
            },
            {
                "define": {
                    "en": "to hit somebody on the head",
                    "vi": "đánh ai đó vào đầu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to put an artificial cover on a tooth",
                    "vi": "đặt một vỏ bọc nhân tạo trên một chiếc răng"
                },
                "examples": [
                    {
                        "en": "have something/be crowned I've had one of my teeth crowned.",
                        "vi": "có một cái gì đó / được đăng quang Tôi đã có một trong những chiếc răng của tôi đã đăng quang."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that something is the final and worst event in a series of unpleasant or annoying events",
                    "vi": "được sử dụng để nói rằng một cái gì đó là sự kiện cuối cùng và tồi tệ nhất trong một loạt các sự kiện khó chịu hoặc phiền toái"
                },
                "examples": [
                    {
                        "en": "It was cold and raining, and, to crown it all, we had to walk home.",
                        "vi": "Trời lạnh và mưa, và, để hoàn thành tất cả, chúng tôi phải đi bộ về nhà."
                    }
                ]
            }
        ]
    },
    {
        "id": "79ebe610bcd84253a881911f5b371602",
        "word": "imperial",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ɪmˈpɪəriəl/",
            "us": "/ɪmˈpɪriəl/"
        },
        "nearby": [
            {
                "word": "imperfection",
                "pos": "noun"
            },
            {
                "word": "imperfectly",
                "pos": "adverb"
            },
            {
                "word": "imperial",
                "pos": "adjective"
            },
            {
                "word": "Imperial College London",
                "pos": ""
            },
            {
                "word": "imperialism",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "connected with an empire",
                    "vi": "kết nối với một đế chế"
                },
                "examples": [
                    {
                        "en": "the imperial family/palace/army",
                        "vi": "hoàng gia / cung điện / quân đội"
                    },
                    {
                        "en": "imperial power/expansion",
                        "vi": "quyền lực đế quốc / mở rộng"
                    }
                ]
            },
            {
                "define": {
                    "en": "connected with the system for measuring length, weight and volume using pounds, inches, etc.",
                    "vi": "được kết nối với hệ thống đo chiều dài, trọng lượng và thể tích bằng pound, inch, v.v."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "12beba1112a24ad8be7b034434e99079",
        "word": "post-war",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌpəʊst ˈwɔː(r)/",
            "us": "/ˌpəʊst ˈwɔːr/"
        },
        "nearby": [
            {
                "word": "posturing",
                "pos": "noun"
            },
            {
                "word": "postviral syndrome",
                "pos": "noun"
            },
            {
                "word": "post-war",
                "pos": "adjective"
            },
            {
                "word": "postwoman",
                "pos": "noun"
            },
            {
                "word": "posy",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "existing, happening or made in the period after a war, especially the Second World War",
                    "vi": "tồn tại, đang xảy ra hoặc được tạo ra trong thời kỳ sau chiến tranh, đặc biệt là Chiến tranh thế giới thứ hai"
                },
                "examples": [
                    {
                        "en": "the post-war years",
                        "vi": "những năm sau chiến tranh"
                    },
                    {
                        "en": "in post-war Europe",
                        "vi": "ở Châu Âu thời hậu chiến"
                    },
                    {
                        "en": "post-war reconstruction",
                        "vi": "tái thiết sau chiến tranh"
                    }
                ]
            }
        ]
    },
    {
        "id": "ff964808d3dd4f4096dfff2214ee54a8",
        "word": "abdicate",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈæbdɪkeɪt/",
            "us": "/ˈæbdɪkeɪt/"
        },
        "nearby": [
            {
                "word": "ABC",
                "pos": "abbreviation"
            },
            {
                "word": "ABD",
                "pos": "abbreviation"
            },
            {
                "word": "abdicate",
                "pos": "verb"
            },
            {
                "word": "abdication",
                "pos": "noun"
            },
            {
                "word": "the abdication crisis",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to give up the position of being king, queen or emperor",
                    "vi": "từ bỏ vị trí là vua, hoàng hậu hoặc hoàng đế"
                },
                "examples": [
                    {
                        "en": "He abdicated in favour of his son.",
                        "vi": "Ông thoái vị để ủng hộ con trai mình."
                    },
                    {
                        "en": "abdicate something She was forced to abdicate the throne of Spain.",
                        "vi": "thoái vị một cái gì đó Cô bị buộc phải thoái vị ngai vàng của Tây Ban Nha."
                    }
                ]
            },
            {
                "define": {
                    "en": "to fail or refuse to perform a duty",
                    "vi": "không hoặc từ chối thực hiện nhiệm vụ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "be827eb9e57d498a9521ed87b5ff90b8",
        "word": "accede",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/əkˈsiːd/",
            "us": "/əkˈsiːd/"
        },
        "nearby": [
            {
                "word": "a cappella",
                "pos": "adverb"
            },
            {
                "word": "ACAS",
                "pos": "abbreviation"
            },
            {
                "word": "accede",
                "pos": "verb"
            },
            {
                "word": "accelerando",
                "pos": "noun"
            },
            {
                "word": "accelerando",
                "pos": "adverb, adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to agree to a request, proposal, etc.",
                    "vi": "để đồng ý với một yêu cầu, đề xuất, v.v."
                },
                "examples": [
                    {
                        "en": "He acceded to demands for his resignation.",
                        "vi": "Ông đã yêu cầu ông từ chức."
                    },
                    {
                        "en": "Japan had little choice but to accede.",
                        "vi": "Nhật Bản không có lựa chọn nào khác ngoài việc gia nhập."
                    },
                    {
                        "en": "The Planning Committee has finally acceded to growing pressure.",
                        "vi": "Ủy ban Kế hoạch cuối cùng đã phải chịu áp lực ngày càng tăng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to achieve a high position, especially to become king or queen",
                    "vi": "đạt được vị trí cao, đặc biệt là trở thành vua hoặc nữ hoàng"
                },
                "examples": [
                    {
                        "en": "Queen Victoria acceded to the throne in 1837.",
                        "vi": "Nữ hoàng Victoria lên ngôi vào năm 1837."
                    }
                ]
            },
            {
                "define": {
                    "en": "to become a member of an organization",
                    "vi": "trở thành thành viên của một tổ chức"
                },
                "examples": [
                    {
                        "en": "Croatia acceded to the EU in 2013.",
                        "vi": "Croatia gia nhập EU vào năm 2013."
                    }
                ]
            }
        ]
    },
    {
        "id": "6133e0e8b8094127b21a8a91595b74df",
        "word": "accession",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/əkˈseʃn/",
            "us": "/əkˈseʃn/"
        },
        "nearby": [
            {
                "word": "accessibility",
                "pos": "noun"
            },
            {
                "word": "accessible",
                "pos": "adjective"
            },
            {
                "word": "accession",
                "pos": "noun"
            },
            {
                "word": "accessorize",
                "pos": "verb"
            },
            {
                "word": "accessory",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act of getting a position of rank or power",
                    "vi": "hành động có được một vị trí của cấp bậc hoặc quyền lực"
                },
                "examples": [
                    {
                        "en": "the accession of Queen Victoria to the throne",
                        "vi": "sự lên ngôi của Nữ hoàng Victoria"
                    },
                    {
                        "en": "Charles I’s accession to the throne",
                        "vi": "Charles I lên ngôi"
                    },
                    {
                        "en": "on her accession to the leadership",
                        "vi": "về việc gia nhập lãnh đạo của cô ấy"
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of becoming part of an international organization",
                    "vi": "hành động trở thành một phần của một tổ chức quốc tế"
                },
                "examples": [
                    {
                        "en": "the accession of new member states to the EU",
                        "vi": "sự gia nhập của các quốc gia thành viên mới vào EU"
                    },
                    {
                        "en": "the new accession states of the EU",
                        "vi": "các quốc gia gia nhập EU mới"
                    }
                ]
            },
            {
                "define": {
                    "en": "a thing that is added to a collection of objects, paintings, etc. in a library or museum",
                    "vi": "một thứ được thêm vào bộ sưu tập đồ vật, tranh vẽ, v.v. trong thư viện hoặc bảo tàng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "26a00fddf498442f85339936c1ef3eb7",
        "word": "agrarian revolution",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/əˌɡreəriən ˌrevəˈluːʃn/",
            "us": "/əˌɡreriən ˌrevəˈluːʃn/"
        },
        "nearby": [
            {
                "word": "agraphia",
                "pos": "noun"
            },
            {
                "word": "agrarian",
                "pos": "adjective"
            },
            {
                "word": "agrarian revolution",
                "pos": "noun"
            },
            {
                "word": "agree",
                "pos": "verb"
            },
            {
                "word": "agreeable",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a period when farming in a country changes completely as a result of new methods or a change in who owns the land",
                    "vi": "thời kỳ nông nghiệp ở một quốc gia thay đổi hoàn toàn do các phương pháp mới hoặc sự thay đổi về người sở hữu đất"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "f245880cf6eb4065b7b8a9074add44ee",
        "word": "annex",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈæneks/",
            "us": "/ˈæneks/"
        },
        "nearby": [
            {
                "word": "Anne of Cleves",
                "pos": ""
            },
            {
                "word": "Annette",
                "pos": ""
            },
            {
                "word": "annex",
                "pos": "verb"
            },
            {
                "word": "annexation",
                "pos": "noun"
            },
            {
                "word": "annexe",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to take control of a country, region, etc., especially by force",
                    "vi": "để nắm quyền kiểm soát một quốc gia, khu vực, v.v., đặc biệt là bằng vũ lực"
                },
                "examples": [
                    {
                        "en": "Germany annexed Austria in 1938.",
                        "vi": "Đức sáp nhập Áo năm 1938."
                    },
                    {
                        "en": "The territory had been annexed to Poland.",
                        "vi": "Lãnh thổ đã được sát nhập vào Ba Lan."
                    }
                ]
            }
        ]
    },
    {
        "id": "1931f8c72d74487aa0d6c9e2d59862dc",
        "word": "behead",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/bɪˈhed/",
            "us": "/bɪˈhed/"
        },
        "nearby": [
            {
                "word": "behaviourism",
                "pos": "noun"
            },
            {
                "word": "behaviourist",
                "pos": "noun"
            },
            {
                "word": "behead",
                "pos": "verb"
            },
            {
                "word": "be heading for",
                "pos": "phrasal verb"
            },
            {
                "word": "beheld",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to cut off somebody’s head, especially as a punishment",
                    "vi": "chặt đầu ai đó, đặc biệt là như một hình phạt"
                },
                "examples": [
                    {
                        "en": "He was charged with treason and beheaded.",
                        "vi": "Anh ta bị buộc tội phản quốc và bị chặt đầu."
                    }
                ]
            }
        ]
    },
    {
        "id": "c725babe556e46548f8021630e02c2c9",
        "word": "cede",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/siːd/",
            "us": "/siːd/"
        },
        "nearby": [
            {
                "word": "cedar",
                "pos": "noun"
            },
            {
                "word": "Cedar Rapids",
                "pos": ""
            },
            {
                "word": "cede",
                "pos": "verb"
            },
            {
                "word": "cedilla",
                "pos": "noun"
            },
            {
                "word": "Ceefax",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to give somebody control of something or give them power, a right, etc., especially unwillingly",
                    "vi": "trao cho ai đó quyền kiểm soát điều gì đó hoặc trao cho họ quyền lực, quyền, v.v., đặc biệt là một cách miễn cưỡng"
                },
                "examples": [
                    {
                        "en": "Cuba was ceded by Spain to the US in 1898.",
                        "vi": "Cuba được Tây Ban Nha nhượng lại cho Mỹ vào năm 1898."
                    }
                ]
            }
        ]
    },
    {
        "id": "fb0b6054470242f79499e82172ff5689",
        "word": "conquest",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkɒŋkwest/",
            "us": "/ˈkɑːŋkwest/"
        },
        "nearby": [
            {
                "word": "conqueror",
                "pos": "noun"
            },
            {
                "word": "the Conqueror",
                "pos": ""
            },
            {
                "word": "conquest",
                "pos": "noun"
            },
            {
                "word": "the Conquest",
                "pos": ""
            },
            {
                "word": "conquistador",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act of taking control of a country, city, etc. by force",
                    "vi": "hành động giành quyền kiểm soát một quốc gia, thành phố, v.v. bằng vũ lực"
                },
                "examples": [
                    {
                        "en": "the Norman Conquest (= of England in 1066)",
                        "vi": "Cuộc chinh phạt Norman (= của Anh năm 1066)"
                    }
                ]
            },
            {
                "define": {
                    "en": "an area of land taken by force",
                    "vi": "một khu vực đất bị cưỡng bức"
                },
                "examples": [
                    {
                        "en": "the Spanish conquests in South America",
                        "vi": "cuộc chinh phục của người Tây Ban Nha ở Nam Mỹ"
                    }
                ]
            },
            {
                "define": {
                    "en": "a person that somebody has persuaded to love them or to have sex with them",
                    "vi": "một người mà ai đó đã thuyết phục yêu họ hoặc quan hệ tình dục với họ"
                },
                "examples": [
                    {
                        "en": "I'm just one of his many conquests.",
                        "vi": "Tôi chỉ là một trong rất nhiều cuộc chinh phục của anh ấy."
                    },
                    {
                        "en": "I think you’ve made a conquest.",
                        "vi": "Tôi nghĩ bạn đã thực hiện một cuộc chinh phục."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of gaining control over something that is difficult or dangerous",
                    "vi": "hành động giành quyền kiểm soát điều gì đó khó khăn hoặc nguy hiểm"
                },
                "examples": [
                    {
                        "en": "the conquest of inflation",
                        "vi": "sự chinh phục của lạm phát"
                    }
                ]
            }
        ]
    },
    {
        "id": "96586755959c412dbb055998a6ca059c",
        "word": "coronation",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌkɒrəˈneɪʃn/",
            "us": "/ˌkɔːrəˈneɪʃn/"
        },
        "nearby": [
            {
                "word": "coronary artery",
                "pos": "noun"
            },
            {
                "word": "coronary thrombosis",
                "pos": "noun"
            },
            {
                "word": "coronation",
                "pos": "noun"
            },
            {
                "word": "the Coronation Chair",
                "pos": ""
            },
            {
                "word": "coronation chicken",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a ceremony at which a crown (= an object in the shape of a circle, usually made of gold and precious stones) is formally placed on the head of a new king or queen and they officially become king or queen",
                    "vi": "nghi lễ mà tại đó vương miện (= một vật có dạng hình tròn, thường làm bằng vàng và đá quý) chính thức được đội lên đầu của một vị vua hoặc hoàng hậu mới và họ chính thức trở thành vua hoặc hoàng hậu."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a situation in which somebody gains the top position without competition",
                    "vi": "một tình huống trong đó ai đó giành được vị trí hàng đầu mà không có sự cạnh tranh"
                },
                "examples": [
                    {
                        "en": "The finale was a formality, more a coronation than a contest.",
                        "vi": "Đêm chung kết mang tính hình thức, đăng quang nhiều hơn là một cuộc thi."
                    }
                ]
            }
        ]
    },
    {
        "id": "6ad9841a4f4e48a4806d0b52bec96218",
        "word": "crusade",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/kruːˈseɪd/",
            "us": "/kruːˈseɪd/"
        },
        "nearby": [
            {
                "word": "crunchy",
                "pos": "adjective"
            },
            {
                "word": "crunk",
                "pos": "noun"
            },
            {
                "word": "crusade",
                "pos": "noun"
            },
            {
                "word": "crusade",
                "pos": "verb"
            },
            {
                "word": "crusader",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a long and determined effort to achieve something that you believe to be right or to stop something that you believe to be wrong",
                    "vi": "một nỗ lực lâu dài và quyết tâm để đạt được điều gì đó mà bạn tin là đúng hoặc để ngăn chặn điều gì đó mà bạn tin là sai"
                },
                "examples": [
                    {
                        "en": "to lead a crusade against crime",
                        "vi": "dẫn đầu một cuộc thập tự chinh chống tội phạm"
                    },
                    {
                        "en": "Her moral crusade began in 1963.",
                        "vi": "Cuộc thập tự chinh đạo đức của cô bắt đầu vào năm 1963."
                    },
                    {
                        "en": "a crusade to give terminally ill people the right to die",
                        "vi": "một cuộc thập tự chinh để cho những người bị bệnh nan y quyền được chết"
                    }
                ]
            },
            {
                "define": {
                    "en": "any of the wars fought in Palestine by European Christian countries against the Muslims in the Middle Ages",
                    "vi": "bất kỳ cuộc chiến nào do các nước Cơ đốc giáo châu Âu gây ra ở Palestine chống lại người Hồi giáo trong thời Trung cổ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "4cd53a3a3ba74bd6a17cfc52f18051f0",
        "word": "the history books",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈhɪstri/",
            "us": "/ˈhɪstri/"
        },
        "nearby": [
            {
                "word": "historiographical",
                "pos": "adjective"
            },
            {
                "word": "historiography",
                "pos": "noun"
            },
            {
                "word": "history",
                "pos": "noun"
            },
            {
                "word": "history-sheeter",
                "pos": "noun"
            },
            {
                "word": "histrionic",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "all the events that happened in the past",
                    "vi": "tất cả các sự kiện đã xảy ra trong quá khứ"
                },
                "examples": [
                    {
                        "en": "in history The battle was a turning point in human history.",
                        "vi": "trong lịch sử Trận chiến là một bước ngoặt trong lịch sử nhân loại."
                    },
                    {
                        "en": "one of the worst disasters in recent history",
                        "vi": "một trong những thảm họa tồi tệ nhất trong lịch sử gần đây"
                    },
                    {
                        "en": "throughout history Many people throughout history have dreamt of a world without war.",
                        "vi": "Trong suốt lịch sử Nhiều người trong suốt lịch sử đã mơ về một thế giới không có chiến tranh."
                    },
                    {
                        "en": "a people with no sense of history",
                        "vi": "một dân tộc không có cảm giác về lịch sử"
                    },
                    {
                        "en": "The area was inhabited long before the dawn of recorded history (= before people wrote about events).",
                        "vi": "Khu vực này đã có người sinh sống từ rất lâu trước buổi bình minh của lịch sử được ghi lại (= trước khi mọi người viết về các sự kiện)."
                    },
                    {
                        "en": "These events changed the course of history.",
                        "vi": "Những sự kiện này đã thay đổi tiến trình lịch sử."
                    },
                    {
                        "en": "This was her attempt to rewrite history with herself in the role of heroine.",
                        "vi": "Đây là nỗ lực của cô để viết lại lịch sử với chính mình trong vai trò nữ anh hùng."
                    }
                ]
            },
            {
                "define": {
                    "en": "the past events connected with the development of a particular place, subject, etc.",
                    "vi": "các sự kiện trong quá khứ kết nối với sự phát triển của một địa điểm, chủ đề cụ thể, v.v."
                },
                "examples": [
                    {
                        "en": "the history of science/music/philosophy",
                        "vi": "lịch sử khoa học / âm nhạc / triết học"
                    },
                    {
                        "en": "She is an expert in the history of the United States.",
                        "vi": "Cô ấy là một chuyên gia về lịch sử của Hoa Kỳ."
                    },
                    {
                        "en": "The local history of the area is fascinating.",
                        "vi": "Lịch sử địa phương của khu vực này thật hấp dẫn."
                    },
                    {
                        "en": "The museum traces the history of the slave trade.",
                        "vi": "Bảo tàng lưu lại lịch sử buôn bán nô lệ."
                    }
                ]
            },
            {
                "define": {
                    "en": "the study of past events, especially as a subject at school or university",
                    "vi": "nghiên cứu các sự kiện trong quá khứ, đặc biệt là một môn học ở trường học hoặc trường đại học"
                },
                "examples": [
                    {
                        "en": "a history professor/teacher",
                        "vi": "một giáo sư / giáo viên lịch sử"
                    },
                    {
                        "en": "a history lesson/textbook",
                        "vi": "một bài học lịch sử / sách giáo khoa"
                    },
                    {
                        "en": "a degree in History",
                        "vi": "bằng Lịch sử"
                    },
                    {
                        "en": "cultural/social/economic/political history",
                        "vi": "lịch sử văn hóa / xã hội / kinh tế / chính trị"
                    },
                    {
                        "en": "modern/ancient history",
                        "vi": "lịch sử hiện đại / cổ đại"
                    },
                    {
                        "en": "She's studying art history.",
                        "vi": "Cô ấy đang học lịch sử nghệ thuật."
                    },
                    {
                        "en": "She studies history of art.",
                        "vi": "Cô ấy nghiên cứu lịch sử nghệ thuật."
                    }
                ]
            },
            {
                "define": {
                    "en": "a written or spoken account of real past events",
                    "vi": "một tài khoản viết hoặc nói về các sự kiện thực trong quá khứ"
                },
                "examples": [
                    {
                        "en": "She's writing a new history of Europe.",
                        "vi": "Cô ấy đang viết một trang sử mới của Châu Âu."
                    },
                    {
                        "en": "She went on to catalogue a long history of disasters.",
                        "vi": "Cô tiếp tục liệt kê một lịch sử lâu dài về các thảm họa."
                    },
                    {
                        "en": "the oral histories of ordinary people",
                        "vi": "lịch sử truyền miệng của những người bình thường"
                    }
                ]
            },
            {
                "define": {
                    "en": "the set of facts that are known about somebody/something's past",
                    "vi": "tập hợp các sự kiện đã biết về quá khứ của ai đó / điều gì đó"
                },
                "examples": [
                    {
                        "en": "I know nothing about his personal history.",
                        "vi": "Tôi không biết gì về lịch sử cá nhân của anh ấy."
                    },
                    {
                        "en": "The group has quite a history.",
                        "vi": "Nhóm có lịch sử khá lâu đời."
                    },
                    {
                        "en": "The doctor will need some details of your medical history.",
                        "vi": "Bác sĩ sẽ cần một số chi tiết về bệnh sử của bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a record of something happening frequently in the past life of a person, family or place",
                    "vi": "bản ghi về điều gì đó xảy ra thường xuyên trong tiền kiếp của một người, gia đình hoặc địa điểm"
                },
                "examples": [
                    {
                        "en": "He has a history of violent crime.",
                        "vi": "Anh ta có tiền sử tội phạm bạo lực."
                    },
                    {
                        "en": "She has a long history of mental illness.",
                        "vi": "Cô có tiền sử bệnh tâm thần lâu năm."
                    },
                    {
                        "en": "There is a history of heart disease in my family.",
                        "vi": "Có tiền sử bệnh tim trong gia đình tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a record kept by a web browser of the web pages and other files it has been used to access",
                    "vi": "một bản ghi được lưu giữ bởi trình duyệt web về các trang web và các tệp khác mà nó đã được sử dụng để truy cập"
                },
                "examples": [
                    {
                        "en": "Clearing your browser history prevents websites from following and tracking your actions.",
                        "vi": "Xóa lịch sử trình duyệt của bạn ngăn các trang web theo dõi và theo dõi hành động của bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a relationship between two people, groups, companies, etc. that started in the past and continued for a period of time, especially one involving bad or complicated feelings",
                    "vi": "mối quan hệ giữa hai người, nhóm, công ty, v.v. đã bắt đầu trong quá khứ và tiếp tục trong một khoảng thời gian, đặc biệt là mối quan hệ liên quan đến cảm xúc tồi tệ hoặc phức tạp"
                },
                "examples": [
                    {
                        "en": "Sure there's history between Anna Mae and me, like you said.",
                        "vi": "Chắc chắn có lịch sử giữa Anna Mae và tôi, như bạn đã nói."
                    }
                ]
            },
            {
                "define": {
                    "en": "a historical play",
                    "vi": "một vở kịch lịch sử"
                },
                "examples": [
                    {
                        "en": "Shakespeare's comedies, histories and tragedies",
                        "vi": "Phim hài, lịch sử và bi kịch của Shakespeare"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be dead or no longer important",
                    "vi": "chết hoặc không còn quan trọng"
                },
                "examples": [
                    {
                        "en": "Another mistake like that and you're history.",
                        "vi": "Một sai lầm khác như thế và bạn là lịch sử."
                    },
                    {
                        "en": "We won't talk about that—that's history.",
                        "vi": "Chúng ta sẽ không nói về điều đó - đó là lịch sử."
                    },
                    {
                        "en": "That's past history now.",
                        "vi": "Đó là lịch sử quá khứ bây giờ."
                    },
                    {
                        "en": "They had an affair once, but that's past history now.",
                        "vi": "Họ đã ngoại tình một lần, nhưng đó là lịch sử đã qua."
                    }
                ]
            },
            {
                "define": {
                    "en": "the record of great achievements in history",
                    "vi": "kỷ lục của những thành tựu vĩ đại trong lịch sử"
                },
                "examples": [
                    {
                        "en": "She has earned her place in the history books.",
                        "vi": "Cô ấy đã giành được vị trí của mình trong sử sách."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that things often happen later in the same way as before",
                    "vi": "được sử dụng để nói rằng mọi thứ thường xảy ra sau đó giống như trước đây"
                },
                "examples": [
                    {
                        "en": "Years later family history repeated itself with Eve’s daughters.",
                        "vi": "Nhiều năm sau, lịch sử gia đình lặp lại với các cô con gái của Eve."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be or do something so important that it will be recorded in history",
                    "vi": "trở thành hoặc làm điều gì đó quan trọng đến mức nó sẽ được ghi vào lịch sử"
                },
                "examples": [
                    {
                        "en": "a discovery that made medical history",
                        "vi": "một khám phá làm nên lịch sử y học"
                    }
                ]
            },
            {
                "define": {
                    "en": "used when you are telling a story to say that you do not need to tell the end of it, because everyone knows it already",
                    "vi": "được sử dụng khi bạn đang kể một câu chuyện để nói rằng bạn không cần phải kể phần cuối của nó, vì mọi người đều biết điều đó rồi"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "9d1605c9728e4ad39f931402bc4a922d",
        "word": "industrialize",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ɪnˈdʌstriəlaɪz/",
            "us": "/ɪnˈdʌstriəlaɪz/"
        },
        "nearby": [
            {
                "word": "industrialist",
                "pos": "noun"
            },
            {
                "word": "industrialization",
                "pos": "noun"
            },
            {
                "word": "industrialize",
                "pos": "verb"
            },
            {
                "word": "industrialized",
                "pos": "adjective"
            },
            {
                "word": "industrially",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "if a country or an area is industrialized or if it industrializes, industries are developed there",
                    "vi": "nếu một quốc gia hoặc một khu vực được công nghiệp hóa hoặc nếu nó công nghiệp hóa, các ngành công nghiệp được phát triển ở đó"
                },
                "examples": [
                    {
                        "en": "The southern part of the country was slow to industrialize.",
                        "vi": "Phần phía nam của đất nước được công nghiệp hóa chậm."
                    }
                ]
            }
        ]
    },
    {
        "id": "154b69cbbfe948a5b75f3bc7a29770b5",
        "word": "page",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/peɪdʒ/",
            "us": "/peɪdʒ/"
        },
        "nearby": [
            {
                "word": "pagan",
                "pos": "adjective"
            },
            {
                "word": "paganism",
                "pos": "noun"
            },
            {
                "word": "page",
                "pos": "noun"
            },
            {
                "word": "page",
                "pos": "verb"
            },
            {
                "word": "pageant",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "one side or both sides of a sheet of paper in a book, magazine, etc.",
                    "vi": "một mặt hoặc cả hai mặt của tờ giấy trong sách, tạp chí, v.v."
                },
                "examples": [
                    {
                        "en": "Turn to page 64.",
                        "vi": "Chuyển sang trang 64."
                    },
                    {
                        "en": "Someone has torn a page out of this book.",
                        "vi": "Ai đó đã xé một trang của cuốn sách này."
                    },
                    {
                        "en": "She slowly turned the pages of the album.",
                        "vi": "Cô từ từ lật từng trang của cuốn album."
                    },
                    {
                        "en": "a blank page",
                        "vi": "một trang trống"
                    },
                    {
                        "en": "the title/index page",
                        "vi": "trang tiêu đề / chỉ mục"
                    },
                    {
                        "en": "the sports/news pages of the newspaper",
                        "vi": "các trang thể thao / tin tức của tờ báo"
                    },
                    {
                        "en": "the letters/opinion page",
                        "vi": "trang thư / ý kiến"
                    },
                    {
                        "en": "Some newspapers devoted several pages to the scandal.",
                        "vi": "Một số tờ báo dành nhiều trang cho vụ bê bối."
                    },
                    {
                        "en": "on a page The photograph was on the front page of every newspaper.",
                        "vi": "trên một trang Bức ảnh đã xuất hiện trên trang nhất của mọi tờ báo."
                    },
                    {
                        "en": "on the opposite/facing/next page",
                        "vi": "trên trang đối diện / đối mặt / tiếp theo"
                    },
                    {
                        "en": "over the page The address is over the page (= on the next page).",
                        "vi": "trên trang Địa chỉ ở trên trang (= ở trang tiếp theo)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a section of data or information that can be shown on a computer screen at any one time",
                    "vi": "một phần dữ liệu hoặc thông tin có thể được hiển thị trên màn hình máy tính cùng một lúc"
                },
                "examples": [
                    {
                        "en": "to visit/view a page",
                        "vi": "để truy cập / xem một trang"
                    },
                    {
                        "en": "to load/update a page",
                        "vi": "để tải / cập nhật một trang"
                    },
                    {
                        "en": "Press F5 to refresh the page.",
                        "vi": "Nhấn F5 để làm mới trang."
                    },
                    {
                        "en": "The page was really slow to load.",
                        "vi": "Trang tải rất chậm."
                    },
                    {
                        "en": "a Twitter/an Instagram page",
                        "vi": "một trang Twitter / một Instagram"
                    },
                    {
                        "en": "on a page The message was posted on the company's official Facebook page.",
                        "vi": "trên một trang Thông báo được đăng trên trang Facebook chính thức của công ty."
                    },
                    {
                        "en": "This photo will no longer appear on your profile page.",
                        "vi": "Ảnh này sẽ không xuất hiện trên trang cá nhân của bạn nữa."
                    }
                ]
            },
            {
                "define": {
                    "en": "an important event or period of history",
                    "vi": "một sự kiện quan trọng hoặc giai đoạn lịch sử"
                },
                "examples": [
                    {
                        "en": "a glorious page of Arab history",
                        "vi": "một trang huy hoàng của lịch sử Ả Rập"
                    }
                ]
            },
            {
                "define": {
                    "en": "a small boy who helps or follows a bride during a marriage ceremony",
                    "vi": "một cậu bé giúp đỡ hoặc đi theo cô dâu trong hôn lễ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a boy or young man, usually in uniform, employed in a hotel to open doors, deliver messages for people, etc.",
                    "vi": "một cậu bé hoặc thanh niên, thường mặc đồng phục, làm việc trong khách sạn để mở cửa, đưa ra thông điệp cho mọi người, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a student who works as an assistant to a member of the US Congress",
                    "vi": "một sinh viên làm trợ lý cho một thành viên của Quốc hội Hoa Kỳ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a boy or young man who worked for a knight while training to be a knight himself",
                    "vi": "một cậu bé hoặc một người đàn ông trẻ tuổi đã làm việc cho một hiệp sĩ trong khi tự mình đào tạo để trở thành một hiệp sĩ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "if two or more people or groups are on the same page, they agree about what they are trying to achieve",
                    "vi": "nếu hai hoặc nhiều người hoặc nhóm trên cùng một trang, họ đồng ý về những gì họ đang cố gắng đạt được"
                },
                "examples": [
                    {
                        "en": "Are employers and employees on the same page when it comes to retirement benefits?",
                        "vi": "Người sử dụng lao động và người lao động có cùng quan điểm khi nói đến trợ cấp hưu trí không?"
                    },
                    {
                        "en": "It was an effort to get us all on the same page.",
                        "vi": "Đó là một nỗ lực để đưa tất cả chúng ta đến cùng một trang."
                    }
                ]
            },
            {
                "define": {
                    "en": "what is published in books, newspapers, etc.",
                    "vi": "những gì được xuất bản trong sách, báo, v.v."
                },
                "examples": [
                    {
                        "en": "the power of the printed word",
                        "vi": "sức mạnh của từ in"
                    }
                ]
            },
            {
                "define": {
                    "en": "to begin doing things in a different way and thinking in a more positive way after a period of difficulties",
                    "vi": "bắt đầu làm mọi thứ theo một cách khác và suy nghĩ theo hướng tích cực hơn sau một khoảng thời gian khó khăn"
                },
                "examples": [
                    {
                        "en": "It’s time to turn the page and make a fresh start.",
                        "vi": "Đã đến lúc lật trang và bắt đầu lại."
                    },
                    {
                        "en": "He turned the page on that chapter in his life a long time ago.",
                        "vi": "Anh đã lật lại trang đó trong cuộc đời mình từ rất lâu rồi."
                    }
                ]
            }
        ]
    },
    {
        "id": "52762aa2ebef471fad6663d62860a73b",
        "word": "pageant",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpædʒənt/",
            "us": "/ˈpædʒənt/"
        },
        "nearby": [
            {
                "word": "page",
                "pos": "noun"
            },
            {
                "word": "page",
                "pos": "verb"
            },
            {
                "word": "pageant",
                "pos": "noun"
            },
            {
                "word": "pageantry",
                "pos": "noun"
            },
            {
                "word": "pageboy",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a public entertainment in which people dress in historical costumes and give performances of scenes from history",
                    "vi": "một chương trình giải trí công cộng trong đó mọi người mặc trang phục lịch sử và biểu diễn các cảnh trong lịch sử"
                },
                "examples": [
                    {
                        "en": "They were filming a colourful pageant about Scotland’s past.",
                        "vi": "Họ đang quay một cuộc thi đầy màu sắc về quá khứ của Scotland."
                    }
                ]
            },
            {
                "define": {
                    "en": "a competition for young women in which their beauty, personal qualities and skills are judged",
                    "vi": "một cuộc thi dành cho những phụ nữ trẻ, trong đó vẻ đẹp, phẩm chất cá nhân và kỹ năng của họ được đánh giá"
                },
                "examples": [
                    {
                        "en": "a beauty pageant",
                        "vi": "một cuộc thi sắc đẹp"
                    }
                ]
            },
            {
                "define": {
                    "en": "something that is considered as a series of interesting and different events",
                    "vi": "một cái gì đó được coi là một chuỗi các sự kiện thú vị và khác nhau"
                },
                "examples": [
                    {
                        "en": "life’s rich pageant",
                        "vi": "cuộc thi giàu có của cuộc sống"
                    }
                ]
            }
        ]
    }
]