[
    {
        "id": "6c3a066e0f7040699755be7f54f1bf2b",
        "word": "exercise",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/ˈeksəsaɪz/",
            "us": "/ˈeksərsaɪz/"
        },
        "nearby": [
            {
                "word": "exempt",
                "pos": "verb"
            },
            {
                "word": "exemption",
                "pos": "noun"
            },
            {
                "word": "exercise",
                "pos": "noun"
            },
            {
                "word": "exercise",
                "pos": "verb"
            },
            {
                "word": "exercise ball",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "physical or mental activity that you do to stay healthy or become stronger",
                    "vi": "hoạt động thể chất hoặc tinh thần mà bạn làm để giữ sức khỏe hoặc trở nên mạnh mẽ hơn"
                },
                "examples": [
                    {
                        "en": "Swimming is good exercise.",
                        "vi": "Bơi lội là một bài tập thể dục tốt."
                    },
                    {
                        "en": "the importance of regular exercise",
                        "vi": "tầm quan trọng của việc tập thể dục thường xuyên"
                    },
                    {
                        "en": "health problems resulting from a lack of physical exercise",
                        "vi": "các vấn đề sức khỏe do lười vận động"
                    },
                    {
                        "en": "strenuous/vigorous exercise",
                        "vi": "tập thể dục vất vả / mạnh mẽ"
                    },
                    {
                        "en": "gentle/moderate exercise",
                        "vi": "tập thể dục nhẹ nhàng / vừa phải"
                    },
                    {
                        "en": "I don't get much exercise sitting in the office all day.",
                        "vi": "Tôi không tập thể dục nhiều khi ngồi trong văn phòng cả ngày."
                    },
                    {
                        "en": "John never does any exercise.",
                        "vi": "John không bao giờ tập thể dục."
                    },
                    {
                        "en": "(British English) to take exercise",
                        "vi": "(Anh Anh) để tập thể dục"
                    },
                    {
                        "en": "Diet and exercise are equally important.",
                        "vi": "Chế độ ăn uống và tập thể dục đều quan trọng như nhau."
                    },
                    {
                        "en": "The mind needs exercise as well as the body.",
                        "vi": "Tâm trí cũng như cơ thể cần được tập thể dục."
                    }
                ]
            },
            {
                "define": {
                    "en": "a set of movements or activities that you do to stay healthy or develop a skill",
                    "vi": "một tập hợp các chuyển động hoặc hoạt động mà bạn thực hiện để giữ gìn sức khỏe hoặc phát triển kỹ năng"
                },
                "examples": [
                    {
                        "en": "relaxation/stretching exercises",
                        "vi": "bài tập thư giãn / kéo căng"
                    },
                    {
                        "en": "Remember to do your breathing exercises every day.",
                        "vi": "Nhớ thực hiện bài tập thở mỗi ngày."
                    },
                    {
                        "en": "Perform these exercises carefully to avoid injury.",
                        "vi": "Thực hiện các bài tập này một cách cẩn thận để tránh chấn thương."
                    },
                    {
                        "en": "Repeat the exercise ten times on each leg.",
                        "vi": "Lặp lại bài tập mười lần cho mỗi bên chân."
                    },
                    {
                        "en": "an exercise for something exercises for the piano",
                        "vi": "một bài tập cho một cái gì đó bài tập cho piano"
                    }
                ]
            },
            {
                "define": {
                    "en": "a set of questions in a book that tests your knowledge or practises a skill",
                    "vi": "một bộ câu hỏi trong một cuốn sách kiểm tra kiến thức của bạn hoặc thực hành một kỹ năng"
                },
                "examples": [
                    {
                        "en": "grammar exercises",
                        "vi": "bài tập ngữ pháp"
                    },
                    {
                        "en": "I want you to do the next exercise in the book in pairs.",
                        "vi": "Tôi muốn bạn làm bài tập tiếp theo trong sách theo cặp."
                    },
                    {
                        "en": "Do exercise one for homework.",
                        "vi": "Làm bài tập một cho bài tập về nhà."
                    }
                ]
            },
            {
                "define": {
                    "en": "the use of power, a skill, a quality or a right to make something happen",
                    "vi": "việc sử dụng quyền lực, kỹ năng, phẩm chất hoặc quyền để làm điều gì đó xảy ra"
                },
                "examples": [
                    {
                        "en": "the exercise of power by the government",
                        "vi": "việc thực thi quyền lực của chính phủ"
                    },
                    {
                        "en": "One of these powers is the exercise of discretion by police officers.",
                        "vi": "Một trong những quyền hạn này là việc thực thi quyền quyết định của các sĩ quan cảnh sát."
                    }
                ]
            },
            {
                "define": {
                    "en": "an activity that is designed to achieve a particular result",
                    "vi": "một hoạt động được thiết kế để đạt được một kết quả cụ thể"
                },
                "examples": [
                    {
                        "en": "a public consultation exercise",
                        "vi": "một bài tập tham vấn cộng đồng"
                    },
                    {
                        "en": "a communications exercise",
                        "vi": "một bài tập giao tiếp"
                    },
                    {
                        "en": "In the end it proved a pointless exercise.",
                        "vi": "Cuối cùng, nó đã chứng minh một bài tập vô nghĩa."
                    },
                    {
                        "en": "exercise in something an exercise in public relations",
                        "vi": "tập thể dục trong một cái gì đó một bài tập trong quan hệ công chúng"
                    },
                    {
                        "en": "Staying calm was an exercise in self-control.",
                        "vi": "Giữ bình tĩnh là một bài tập trong việc kiểm soát bản thân."
                    }
                ]
            },
            {
                "define": {
                    "en": "a set of activities for training soldiers",
                    "vi": "một tập hợp các hoạt động để huấn luyện binh lính"
                },
                "examples": [
                    {
                        "en": "military exercises",
                        "vi": "bài tập quân sự"
                    },
                    {
                        "en": "He was injured in a training exercise.",
                        "vi": "Anh ấy đã bị thương trong một bài tập huấn luyện."
                    }
                ]
            },
            {
                "define": {
                    "en": "ceremonies",
                    "vi": "nghi lễ"
                },
                "examples": [
                    {
                        "en": "college graduation exercises",
                        "vi": "bài tập tốt nghiệp đại học"
                    }
                ]
            }
        ]
    },
    {
        "id": "40f7b6b96444444dadb21ef6a80ba0d3",
        "word": "fine",
        "pos": "adjective",
        "level": "a1",
        "phonetic": {
            "uk": "/faɪn/",
            "us": "/faɪn/"
        },
        "nearby": [
            {
                "word": "finding",
                "pos": "noun"
            },
            {
                "word": "find out",
                "pos": "phrasal verb"
            },
            {
                "word": "fine",
                "pos": "adjective"
            },
            {
                "word": "fine",
                "pos": "adverb"
            },
            {
                "word": "fine",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "in good health",
                    "vi": "sức khỏe tốt"
                },
                "examples": [
                    {
                        "en": "‘How are you?’ ‘Fine, thanks.’",
                        "vi": "Bạn khỏe không?' 'Tốt cảm ơn.'"
                    },
                    {
                        "en": "I was feeling fine when I got up this morning.",
                        "vi": "Tôi cảm thấy ổn khi tôi thức dậy sáng nay."
                    },
                    {
                        "en": "‘How’s your throat?’ ‘It’s fine as long as I don’t cough.’",
                        "vi": "Cổ họng của bạn thế nào?' 'Miễn là tôi không bị ho.'"
                    }
                ]
            },
            {
                "define": {
                    "en": "of high quality; good",
                    "vi": "chất lượng cao; tốt"
                },
                "examples": [
                    {
                        "en": "a very fine performance",
                        "vi": "một màn trình diễn rất tốt"
                    },
                    {
                        "en": "fine clothes/wines/workmanship",
                        "vi": "quần áo tốt / rượu vang / tay nghề"
                    },
                    {
                        "en": "It's a particularly fine example of Saxon architecture.",
                        "vi": "Đó là một ví dụ đặc biệt tốt về kiến trúc Saxon."
                    },
                    {
                        "en": "the finest collection of paintings in Europe",
                        "vi": "bộ sưu tập tranh đẹp nhất ở châu Âu"
                    },
                    {
                        "en": "She's a fine actor and an even finer dancer.",
                        "vi": "Cô ấy là một diễn viên giỏi và một vũ công giỏi hơn nữa."
                    },
                    {
                        "en": "Jim has made a fine job of the garden.",
                        "vi": "Jim đã làm rất tốt công việc của khu vườn."
                    },
                    {
                        "en": "people who enjoy the finer things in life (= for example art, good food, etc.)",
                        "vi": "những người tận hưởng những điều tốt đẹp hơn trong cuộc sống (= ví dụ: nghệ thuật, đồ ăn ngon, v.v.)"
                    },
                    {
                        "en": "It was his finest hour (= most successful period) as manager of the England team.",
                        "vi": "Đó là giờ tốt nhất của anh ấy (= giai đoạn thành công nhất) với tư cách là người quản lý đội tuyển Anh."
                    },
                    {
                        "en": "This movie features some of her finest work.",
                        "vi": "Bộ phim này có một số tác phẩm hay nhất của cô ấy."
                    },
                    {
                        "en": "He tried to appeal to their finer feelings (= feelings of duty, love, etc.)",
                        "vi": "Anh ấy cố gắng thu hút những cảm xúc tốt đẹp hơn của họ (= cảm giác về nghĩa vụ, tình yêu, v.v.)"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to tell somebody that an action, a suggestion or a decision is acceptable",
                    "vi": "được sử dụng để nói với ai đó rằng một hành động, một đề xuất hoặc một quyết định có thể chấp nhận được"
                },
                "examples": [
                    {
                        "en": "‘I'll leave this here, OK?’ ‘Fine.’",
                        "vi": "Tôi sẽ để cái này ở đây, OK?' 'Tốt.'"
                    },
                    {
                        "en": "fine by somebody ‘Bob wants to know if he can come too.’ ‘That's fine by me.’",
                        "vi": "tốt bởi ai đó 'Bob muốn biết nếu anh ta cũng có thể đến. \" 'Đối với tôi vậy là tốt rồi.'"
                    },
                    {
                        "en": "fine with somebody If you don't agree, that's fine with him.",
                        "vi": "tốt với ai đó Nếu bạn không đồng ý, điều đó tốt với anh ta."
                    },
                    {
                        "en": "fine with something She has been virtually ignoring me but I'm fine with that.",
                        "vi": "tốt với điều gì đó Cô ấy hầu như phớt lờ tôi nhưng tôi ổn với điều đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say you are satisfied with something",
                    "vi": "từng nói rằng bạn hài lòng với điều gì đó"
                },
                "examples": [
                    {
                        "en": "Don't worry. Your speech was fine.",
                        "vi": "Đừng lo lắng. Bài phát biểu của bạn tốt."
                    },
                    {
                        "en": "Other than a few damp spots, the place looked fine.",
                        "vi": "Ngoài một vài chỗ ẩm thấp, nơi này trông vẫn ổn."
                    },
                    {
                        "en": "to sound/seem fine",
                        "vi": "nghe có vẻ ổn"
                    },
                    {
                        "en": "You go on without me. I'll be fine.",
                        "vi": "Bạn đi tiếp mà không có tôi. Tôi sẽ ổn thôi."
                    },
                    {
                        "en": "‘Can I get you another drink?’ ‘No, thanks. I'm fine.’",
                        "vi": "Tôi có thể lấy cho bạn một ly khác được không?' 'Không, cám ơn. Tôi khỏe.'"
                    },
                    {
                        "en": "Never mind, Jake. Everything will be just fine.",
                        "vi": "Đừng bận tâm, Jake. Mọi chuyện sẽ ổn thôi."
                    },
                    {
                        "en": "Your hair is perfectly fine the way it is.",
                        "vi": "Tóc của bạn vẫn hoàn toàn ổn."
                    },
                    {
                        "en": "fine for something This paper's not very good quality, but it's fine for rough work.",
                        "vi": "Tốt cho một cái gì đó Giấy này có chất lượng không tốt lắm, nhưng nó tốt cho công việc thô."
                    },
                    {
                        "en": "(ironic) You're a fine one to talk! (= you are not in a position to criticize, give advice, etc.)",
                        "vi": "(mỉa mai) Bạn là một người tốt để nói chuyện! (= bạn không có tư cách để chỉ trích, đưa ra lời khuyên, v.v.)"
                    },
                    {
                        "en": "(ironic) This is a fine (= terrible) mess we're in!",
                        "vi": "(mỉa mai) Đây là một mớ hỗn độn tốt đẹp (= khủng khiếp) mà chúng ta đang ở!"
                    }
                ]
            },
            {
                "define": {
                    "en": "bright and not raining",
                    "vi": "sáng và không mưa"
                },
                "examples": [
                    {
                        "en": "a fine day/evening",
                        "vi": "một ngày đẹp trời / buổi tối"
                    },
                    {
                        "en": "I hope it stays fine for the picnic.",
                        "vi": "Tôi hy vọng nó vẫn ổn cho chuyến dã ngoại."
                    },
                    {
                        "en": "It was a fine sunny morning.",
                        "vi": "Đó là một buổi sáng nắng đẹp."
                    },
                    {
                        "en": "That summer saw weeks of fine dry weather.",
                        "vi": "Mùa hè năm đó chứng kiến nhiều tuần thời tiết khô ráo."
                    }
                ]
            },
            {
                "define": {
                    "en": "pleasant to look at",
                    "vi": "dễ nhìn"
                },
                "examples": [
                    {
                        "en": "a fine view",
                        "vi": "một khung cảnh đẹp"
                    },
                    {
                        "en": "a fine-looking woman",
                        "vi": "một người phụ nữ đẹp"
                    },
                    {
                        "en": "a fine figure of a man",
                        "vi": "một hình tượng đẹp của một người đàn ông"
                    },
                    {
                        "en": "(informal, especially North American English) The boy looks mighty fine in a uniform.",
                        "vi": "(không chính thức, đặc biệt là tiếng Anh Bắc Mỹ) Cậu bé trông rất đẹp trong bộ đồng phục."
                    }
                ]
            },
            {
                "define": {
                    "en": "made of very small grains",
                    "vi": "làm từ những hạt rất nhỏ"
                },
                "examples": [
                    {
                        "en": "fine sand",
                        "vi": "cát mịn"
                    },
                    {
                        "en": "Use a finer piece of sandpaper to finish.",
                        "vi": "Sử dụng một mảnh giấy nhám mịn hơn để hoàn thành."
                    },
                    {
                        "en": "The top 8 inches of earth is very fine, made up of river sediment.",
                        "vi": "8 inch trên cùng của trái đất rất mịn, được tạo thành từ trầm tích sông."
                    },
                    {
                        "en": "Dip in beaten egg then fine dry breadcrumbs before frying in olive oil.",
                        "vi": "Nhúng vào trứng đã đánh tan, sau đó tẩm vụn bánh mì khô mịn trước khi chiên trong dầu ô liu."
                    }
                ]
            },
            {
                "define": {
                    "en": "attractive and small or thin",
                    "vi": "hấp dẫn và nhỏ hoặc mỏng"
                },
                "examples": [
                    {
                        "en": "fine bone china",
                        "vi": "xương tốt Trung Quốc"
                    },
                    {
                        "en": "She has inherited her mother's fine features (= a small nose, mouth, etc.).",
                        "vi": "Cô được thừa hưởng những nét đẹp của mẹ (= mũi, miệng nhỏ, v.v.)."
                    }
                ]
            },
            {
                "define": {
                    "en": "very thin or narrow; made of very thin or narrow wires or threads",
                    "vi": "rất mỏng hoặc hẹp; làm bằng dây hoặc sợi rất mỏng hoặc hẹp"
                },
                "examples": [
                    {
                        "en": "His fine blond hair came down almost to his shoulders.",
                        "vi": "Mái tóc vàng óng của anh ấy xõa gần đến vai."
                    },
                    {
                        "en": "a fine thread",
                        "vi": "một sợi tốt"
                    },
                    {
                        "en": "I need a brush with a fine tip.",
                        "vi": "Tôi cần một bàn chải có đầu nhỏ."
                    },
                    {
                        "en": "a fine sieve/mesh",
                        "vi": "một sàng / lưới mịn"
                    }
                ]
            },
            {
                "define": {
                    "en": "difficult to see or describe",
                    "vi": "khó nhìn hoặc khó mô tả"
                },
                "examples": [
                    {
                        "en": "You really need a magnifying glass to appreciate all the fine detail.",
                        "vi": "Bạn thực sự cần một chiếc kính lúp để đánh giá cao tất cả các chi tiết nhỏ."
                    },
                    {
                        "en": "There's no need to make such fine distinctions.",
                        "vi": "Không cần phải phân biệt rõ ràng như vậy."
                    },
                    {
                        "en": "There's a fine line between love and hate (= it is easy for one to become the other).",
                        "vi": "Có một ranh giới rõ ràng giữa yêu và ghét (= người này dễ trở thành người kia)."
                    },
                    {
                        "en": "We still have to iron out the finer details.",
                        "vi": "Chúng tôi vẫn phải mài dũa các chi tiết tốt hơn."
                    }
                ]
            },
            {
                "define": {
                    "en": "that you have a lot of respect for",
                    "vi": "mà bạn rất tôn trọng"
                },
                "examples": [
                    {
                        "en": "He was a fine man.",
                        "vi": "Anh ấy là một người đàn ông tốt."
                    }
                ]
            },
            {
                "define": {
                    "en": "sounding important and impressive but unlikely to have any effect",
                    "vi": "nghe có vẻ quan trọng và ấn tượng nhưng không có tác dụng"
                },
                "examples": [
                    {
                        "en": "His speech was full of fine words which meant nothing.",
                        "vi": "Bài phát biểu của anh ấy đầy những mỹ từ chẳng có nghĩa lý gì."
                    }
                ]
            },
            {
                "define": {
                    "en": "containing only a particular metal and no other substances that reduce the quality",
                    "vi": "chỉ chứa một kim loại cụ thể và không chứa các chất khác làm giảm chất lượng"
                },
                "examples": [
                    {
                        "en": "fine gold",
                        "vi": "vàng ròng"
                    }
                ]
            },
            {
                "define": {
                    "en": "people say chance would be a fine thing to show that they would like to do or have the thing that somebody has mentioned, but that they do not think that it is very likely",
                    "vi": "mọi người nói rằng cơ hội sẽ là một điều tốt để thể hiện rằng họ muốn làm hoặc có điều mà ai đó đã đề cập, nhưng họ không nghĩ rằng nó rất có thể"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the more complicated or detailed aspects of something",
                    "vi": "các khía cạnh phức tạp hơn hoặc chi tiết hơn của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "She seems at ease discussing the finer points of foreign policy.",
                        "vi": "Cô ấy có vẻ thoải mái khi thảo luận về những điểm tốt hơn của chính sách đối ngoại."
                    },
                    {
                        "en": "He learnt the finer points of cricket during a trip to London.",
                        "vi": "Anh ấy đã học được những điểm tốt hơn của môn cricket trong một chuyến đi đến London."
                    }
                ]
            },
            {
                "define": {
                    "en": "healthy; in good condition",
                    "vi": "mạnh khỏe; trong điều kiện tốt"
                },
                "examples": [
                    {
                        "en": "The team is in fine fettle.",
                        "vi": "Đội đang hoạt động tốt."
                    },
                    {
                        "en": "Park Foods is in fine fettle after selling off all non-core businesses.",
                        "vi": "Park Foods đang hoạt động tốt sau khi bán hết các mảng kinh doanh không chính."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to emphasize something that is expressed clearly and directly, especially a criticism",
                    "vi": "được sử dụng để nhấn mạnh điều gì đó được diễn đạt rõ ràng và trực tiếp, đặc biệt là một lời chỉ trích"
                },
                "examples": [
                    {
                        "en": "Not to put too fine a point on it, I think you are lying.",
                        "vi": "Không nên đặt nặng vấn đề, tôi nghĩ bạn đang nói dối."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be in a difficult or dangerous situation where you could easily make a mistake",
                    "vi": "ở trong một tình huống khó khăn hoặc nguy hiểm mà bạn có thể dễ dàng mắc sai lầm"
                },
                "examples": [
                    {
                        "en": "He was walking a fine line between being funny and being rude.",
                        "vi": "Anh ấy đang đi đúng ranh giới giữa hài hước và thô lỗ."
                    },
                    {
                        "en": "She often seems to tread a thin line between success and failure.",
                        "vi": "Cô ấy dường như luôn vạch ra một ranh giới mỏng manh giữa thành công và thất bại."
                    }
                ]
            }
        ]
    },
    {
        "id": "c74655228fc347f890065d6f6c001dcf",
        "word": "good",
        "pos": "adjective",
        "level": "a1",
        "phonetic": {
            "uk": "/ɡʊd/",
            "us": "/ɡʊd/"
        },
        "nearby": [
            {
                "word": "goo",
                "pos": "noun"
            },
            {
                "word": "goober",
                "pos": "noun"
            },
            {
                "word": "good",
                "pos": "adjective"
            },
            {
                "word": "good",
                "pos": "noun"
            },
            {
                "word": "good",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "of high quality or an acceptable standard",
                    "vi": "chất lượng cao hoặc tiêu chuẩn có thể chấp nhận được"
                },
                "examples": [
                    {
                        "en": "a good book",
                        "vi": "một cuốn sách hay"
                    },
                    {
                        "en": "good food",
                        "vi": "thức ăn ngon"
                    },
                    {
                        "en": "The piano was in really good condition.",
                        "vi": "Cây đàn piano đã ở trong tình trạng thực sự tốt."
                    },
                    {
                        "en": "Your work is just not good enough.",
                        "vi": "Công việc của bạn chỉ là không đủ tốt."
                    },
                    {
                        "en": "The results were pretty good.",
                        "vi": "Kết quả là khá tốt."
                    },
                    {
                        "en": "Sorry, my English is not very good.",
                        "vi": "Xin lỗi tiếng Anh của tôi không tốt lắm."
                    },
                    {
                        "en": "They've done a reasonably good job.",
                        "vi": "Họ đã hoàn thành một công việc khá tốt."
                    },
                    {
                        "en": "Keep up the good work!",
                        "vi": "Hãy tiếp tục phát huy!"
                    },
                    {
                        "en": "It's a good way to make friends.",
                        "vi": "Đó là một cách tốt để kết bạn."
                    },
                    {
                        "en": "The sound and picture are both of good quality.",
                        "vi": "Âm thanh và hình ảnh đều có chất lượng tốt."
                    },
                    {
                        "en": "Things are looking good at the moment.",
                        "vi": "Mọi thứ đang có vẻ tốt vào lúc này."
                    },
                    {
                        "en": "You'll never marry her—she's much too good for you.",
                        "vi": "Bạn sẽ không bao giờ cưới cô ấy - cô ấy quá tốt với bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "pleasant; that you enjoy or want",
                    "vi": "hài lòng; mà bạn thích hoặc muốn"
                },
                "examples": [
                    {
                        "en": "Did you have a good time in London?",
                        "vi": "Bạn đã có một thời gian vui vẻ ở London?"
                    },
                    {
                        "en": "This is very good news.",
                        "vi": "Đây là một tin rất tốt."
                    },
                    {
                        "en": "Let's hope we have good weather tomorrow.",
                        "vi": "Hãy hy vọng chúng ta có thời tiết tốt vào ngày mai."
                    },
                    {
                        "en": "it is good to do something It's good to see you again.",
                        "vi": "thật tốt khi làm điều gì đó Thật tốt khi gặp lại bạn."
                    },
                    {
                        "en": "There are loads of good things about working here.",
                        "vi": "Có rất nhiều điều tốt khi làm việc ở đây."
                    },
                    {
                        "en": "We are still friends, though, which is good.",
                        "vi": "Tuy nhiên, chúng tôi vẫn là bạn bè, điều đó thật tốt."
                    }
                ]
            },
            {
                "define": {
                    "en": "sensible, logical or strongly supporting what is being discussed",
                    "vi": "hợp lý, hợp lý hoặc ủng hộ mạnh mẽ những gì đang được thảo luận"
                },
                "examples": [
                    {
                        "en": "Thank you, good question.",
                        "vi": "Cảm ơn bạn, câu hỏi hay."
                    },
                    {
                        "en": "Yes, that's a good point.",
                        "vi": "Vâng, đó là một điểm tốt."
                    },
                    {
                        "en": "I have good reason to be suspicious.",
                        "vi": "Tôi có lý do chính đáng để nghi ngờ."
                    },
                    {
                        "en": "What a good idea!",
                        "vi": "Thật là một ý kiến hay!"
                    },
                    {
                        "en": "This is a good example of what I mean.",
                        "vi": "Đây là một ví dụ điển hình về những gì tôi muốn nói."
                    }
                ]
            },
            {
                "define": {
                    "en": "showing or getting approval or respect",
                    "vi": "thể hiện hoặc nhận được sự chấp thuận hoặc tôn trọng"
                },
                "examples": [
                    {
                        "en": "The play had good reviews.",
                        "vi": "Vở kịch đã được đánh giá tốt."
                    },
                    {
                        "en": "The hotel has a good reputation.",
                        "vi": "Khách sạn có một danh tiếng tốt."
                    },
                    {
                        "en": "He comes from a good family.",
                        "vi": "Anh ấy xuất thân trong một gia đình tốt."
                    }
                ]
            },
            {
                "define": {
                    "en": "able to do something well",
                    "vi": "có thể làm tốt điều gì đó"
                },
                "examples": [
                    {
                        "en": "a good player",
                        "vi": "một người chơi giỏi"
                    },
                    {
                        "en": "a good actor/cook",
                        "vi": "một diễn viên / đầu bếp giỏi"
                    },
                    {
                        "en": "good at something to be good at languages/your job",
                        "vi": "giỏi một thứ gì đó để giỏi ngôn ngữ / công việc của bạn"
                    },
                    {
                        "en": "good at doing something Nick has always been good at finding cheap flights.",
                        "vi": "giỏi làm việc gì đó Nick luôn giỏi trong việc tìm kiếm các chuyến bay giá rẻ."
                    }
                ]
            },
            {
                "define": {
                    "en": "able to use something or deal with people well",
                    "vi": "có thể sử dụng một cái gì đó hoặc đối xử tốt với mọi người"
                },
                "examples": [
                    {
                        "en": "She's good with her hands (= able to make things, etc.).",
                        "vi": "Cô ấy giỏi với đôi tay của mình (= có thể làm ra mọi thứ, v.v.)."
                    },
                    {
                        "en": "He's very good with children.",
                        "vi": "Anh ấy rất tốt với trẻ em."
                    },
                    {
                        "en": "She's good with figures.",
                        "vi": "Cô ấy giỏi về số liệu."
                    }
                ]
            },
            {
                "define": {
                    "en": "morally right; behaving in a way that is morally right",
                    "vi": "Đúng đạo đức; cư xử theo cách đúng đắn về mặt đạo đức"
                },
                "examples": [
                    {
                        "en": "She has tried to lead a good life.",
                        "vi": "Cô ấy đã cố gắng để có một cuộc sống tốt đẹp."
                    },
                    {
                        "en": "I took Sarah's children to school so I've done my good deed for the day.",
                        "vi": "Tôi đưa các con của Sarah đến trường vì vậy tôi đã làm việc tốt của mình trong ngày."
                    },
                    {
                        "en": "Giving her that money was a good thing to do.",
                        "vi": "Đưa cho cô ấy số tiền đó là điều nên làm."
                    },
                    {
                        "en": "He is a very good man.",
                        "vi": "Anh ấy là một người đàn ông rất tốt."
                    },
                    {
                        "en": "She prayed that God would make her a better person.",
                        "vi": "Cô cầu nguyện rằng Chúa sẽ biến cô trở thành một người tốt hơn."
                    }
                ]
            },
            {
                "define": {
                    "en": "following strictly a set of rules or principles",
                    "vi": "tuân thủ nghiêm ngặt một bộ quy tắc hoặc nguyên tắc"
                },
                "examples": [
                    {
                        "en": "It is good practice to supply a written report to the buyer.",
                        "vi": "Thông lệ tốt là cung cấp báo cáo bằng văn bản cho người mua."
                    },
                    {
                        "en": "She was a good Catholic girl.",
                        "vi": "Cô ấy là một cô gái Công giáo tốt."
                    }
                ]
            },
            {
                "define": {
                    "en": "willing to help; kind to other people",
                    "vi": "sẵn lòng giúp đỡ; tử tế với người khác"
                },
                "examples": [
                    {
                        "en": "You've always been such a good friend.",
                        "vi": "Bạn luôn là một người bạn tốt."
                    },
                    {
                        "en": "good to somebody He was very good to me when I was ill.",
                        "vi": "tốt với ai đó Anh ấy rất tốt với tôi khi tôi bị ốm."
                    },
                    {
                        "en": "good of somebody She looked into it for me, which was very good of her.",
                        "vi": "tốt của ai đó Cô ấy đã xem xét nó vì tôi, điều đó rất tốt với cô ấy."
                    },
                    {
                        "en": "good of somebody to do something It was very good of you to come.",
                        "vi": "tốt cho ai đó làm điều gì đó Rất tốt cho bạn khi đến."
                    },
                    {
                        "en": "good about something I had to take a week off work but my colleagues were very good about it.",
                        "vi": "tốt về điều gì đó Tôi đã phải nghỉ làm một tuần nhưng các đồng nghiệp của tôi rất tốt về điều đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "behaving well or politely",
                    "vi": "cư xử tốt hoặc lịch sự"
                },
                "examples": [
                    {
                        "en": "You can stay up late if you're good.",
                        "vi": "Bạn có thể thức khuya nếu bạn giỏi."
                    },
                    {
                        "en": "Get dressed now, there's a good girl.",
                        "vi": "Mặc quần áo ngay đi, có một cô gái tốt."
                    },
                    {
                        "en": "‘That's a good dog,’ I said, patting its head.",
                        "vi": "Đó là một con chó tốt, tôi nói, vỗ đầu nó."
                    }
                ]
            },
            {
                "define": {
                    "en": "healthy or strong",
                    "vi": "khỏe mạnh hoặc mạnh mẽ"
                },
                "examples": [
                    {
                        "en": "Can you speak into my good ear?",
                        "vi": "Bạn có thể nói vào tai tốt của tôi?"
                    },
                    {
                        "en": "I don't feel too good today.",
                        "vi": "Tôi không cảm thấy quá tốt hôm nay."
                    },
                    {
                        "en": "‘How are you?’ ‘I'm good.’ (= used as a general reply to a greeting)",
                        "vi": "Bạn khỏe không?' 'Tôi ổn.' (= được sử dụng như một câu trả lời chung cho một lời chào)"
                    }
                ]
            },
            {
                "define": {
                    "en": "having a useful or helpful effect on somebody/something",
                    "vi": "có tác dụng hữu ích hoặc hữu ích đối với ai đó / điều gì đó"
                },
                "examples": [
                    {
                        "en": "Living so close to a chemicals factory can't be good.",
                        "vi": "Sống gần nhà máy hóa chất như vậy không thể tốt được."
                    },
                    {
                        "en": "good for somebody/something Too much sun isn't good for you.",
                        "vi": "tốt cho ai đó / cái gì đó Quá nhiều nắng không tốt cho bạn."
                    },
                    {
                        "en": "Vegetables are good for you.",
                        "vi": "Rau rất tốt cho bạn."
                    },
                    {
                        "en": "policies that are good for business",
                        "vi": "chính sách tốt cho doanh nghiệp"
                    },
                    {
                        "en": "The deal will be good for the country as a whole.",
                        "vi": "Thỏa thuận này sẽ tốt cho đất nước nói chung."
                    },
                    {
                        "en": "it is good for somebody/something to do something It's probably good for you to get some criticism now and then.",
                        "vi": "Nó là tốt cho ai đó / điều gì đó để làm điều gì đó Có thể tốt cho bạn bây giờ và sau đó nhận được một số lời chỉ trích."
                    },
                    {
                        "en": "(informal) Shut your mouth, if you know what's good for you (= used as a threat).",
                        "vi": "(thân mật) Hãy ngậm miệng lại, nếu bạn biết điều gì tốt cho bạn (= được sử dụng như một lời đe dọa)."
                    }
                ]
            },
            {
                "define": {
                    "en": "suitable or appropriate",
                    "vi": "phù hợp hoặc thích hợp"
                },
                "examples": [
                    {
                        "en": "Now is a good time to buy a house.",
                        "vi": "Bây giờ là thời điểm tốt để mua nhà."
                    },
                    {
                        "en": "Do you really think this is a good use of your time?",
                        "vi": "Bạn có thực sự nghĩ rằng đây là cách sử dụng thời gian của bạn tốt không?"
                    },
                    {
                        "en": "Students are not allowed to miss classes without good reason.",
                        "vi": "Học sinh không được nghỉ học mà không có lý do chính đáng."
                    },
                    {
                        "en": "good for something/to do something She would be good for the job.",
                        "vi": "good for something / to do something Cô ấy sẽ tốt cho công việc."
                    },
                    {
                        "en": "good for somebody Can we change our meeting? Monday isn't good (= convenient) for me.",
                        "vi": "tốt cho ai đó Chúng ta có thể thay đổi cuộc họp của mình không? Thứ Hai không tốt (= thuận tiện) đối với tôi."
                    },
                    {
                        "en": "This is as good a place as any to spend the night.",
                        "vi": "Đây là một nơi tốt như bất kỳ nơi nào để nghỉ qua đêm."
                    }
                ]
            },
            {
                "define": {
                    "en": "used in speaking to show that you approve of or are pleased about something that has been said or done, or to show that you want to move on to a new topic of conversation",
                    "vi": "được sử dụng khi nói để thể hiện rằng bạn tán thành hoặc hài lòng về điều gì đó đã được nói hoặc đã làm, hoặc để thể hiện rằng bạn muốn chuyển sang một chủ đề mới của cuộc trò chuyện"
                },
                "examples": [
                    {
                        "en": "‘Dinner's ready.’ ‘Good—I'm starving.’",
                        "vi": "Bữa ăn tối đã sẵn sàng.' 'Tốt - tôi đang đói.'"
                    },
                    {
                        "en": "‘I got the job.’ ‘Oh, good.’",
                        "vi": "Tôi đã nhận được công việc.' 'Tốt.'"
                    },
                    {
                        "en": "Good, I think we've come to a decision.",
                        "vi": "Tốt, tôi nghĩ chúng ta đã đi đến quyết định."
                    }
                ]
            },
            {
                "define": {
                    "en": "used as a form of praise",
                    "vi": "được sử dụng như một hình thức khen ngợi"
                },
                "examples": [
                    {
                        "en": "Good old Jack!",
                        "vi": "Jack già tốt!"
                    },
                    {
                        "en": "‘I've ordered some drinks.’ ‘Good man!’",
                        "vi": "Tôi đã gọi một số đồ uống.' 'Người đàn ông tốt!'"
                    }
                ]
            },
            {
                "define": {
                    "en": "used in exclamations",
                    "vi": "được sử dụng trong câu cảm thán"
                },
                "examples": [
                    {
                        "en": "Good heavens!",
                        "vi": "Lạy trời!"
                    },
                    {
                        "en": "Good God!",
                        "vi": "Chúa ơi!"
                    }
                ]
            },
            {
                "define": {
                    "en": "great in number, amount or degree",
                    "vi": "tuyệt vời về số lượng, số lượng hoặc mức độ"
                },
                "examples": [
                    {
                        "en": "a good number of people",
                        "vi": "một số lượng tốt"
                    },
                    {
                        "en": "The kitchen is a good size.",
                        "vi": "Nhà bếp là một kích thước tốt."
                    },
                    {
                        "en": "We spent a good while (= quite a long time) looking for the house.",
                        "vi": "Chúng tôi đã dành một khoảng thời gian (= khá lâu) để tìm kiếm ngôi nhà."
                    },
                    {
                        "en": "He devoted a good deal of (= a lot of) attention to the problem.",
                        "vi": "Anh ấy đã dành rất nhiều (= rất nhiều) sự chú ý cho vấn đề."
                    },
                    {
                        "en": "There's a good chance (= it is likely) that I won't be here next year.",
                        "vi": "Có một cơ hội tốt (= có khả năng) là tôi sẽ không ở đây vào năm tới."
                    }
                ]
            },
            {
                "define": {
                    "en": "not less than; rather more than",
                    "vi": "không ít hơn; hơn là"
                },
                "examples": [
                    {
                        "en": "We waited for a good hour.",
                        "vi": "Chúng tôi đã chờ một giờ tốt."
                    },
                    {
                        "en": "It's a good three miles to the station.",
                        "vi": "Đó là một ba dặm tốt để đến nhà ga."
                    }
                ]
            },
            {
                "define": {
                    "en": "done to a high level or a great degree; complete",
                    "vi": "được thực hiện ở mức độ cao hoặc mức độ tuyệt vời; hoàn thành"
                },
                "examples": [
                    {
                        "en": "We had a good laugh about it afterwards.",
                        "vi": "Chúng tôi đã có một trận cười sảng khoái về nó sau đó."
                    },
                    {
                        "en": "You'll feel better after a good sleep.",
                        "vi": "Bạn sẽ cảm thấy tốt hơn sau một giấc ngủ ngon."
                    }
                ]
            },
            {
                "define": {
                    "en": "funny or clever",
                    "vi": "hài hước hoặc thông minh"
                },
                "examples": [
                    {
                        "en": "a good story/joke",
                        "vi": "một câu chuyện hay một trò đùa"
                    },
                    {
                        "en": "(informal) That's a good one!",
                        "vi": "(không chính thức) Đó là một điều tốt!"
                    }
                ]
            },
            {
                "define": {
                    "en": "having enough energy, health, strength, etc. to last for a particular length of time or distance",
                    "vi": "có đủ năng lượng, sức khỏe, sức mạnh, v.v. để tồn tại trong một khoảng thời gian hoặc khoảng cách cụ thể"
                },
                "examples": [
                    {
                        "en": "You're good for (= you will live) a few years yet.",
                        "vi": "Bạn còn tốt cho (= bạn sẽ sống) vài năm nữa."
                    }
                ]
            },
            {
                "define": {
                    "en": "acceptable for something",
                    "vi": "chấp nhận được cho một cái gì đó"
                },
                "examples": [
                    {
                        "en": "The ticket is good for three months.",
                        "vi": "Vé tốt cho ba tháng."
                    }
                ]
            },
            {
                "define": {
                    "en": "likely to provide something",
                    "vi": "có khả năng cung cấp một cái gì đó"
                },
                "examples": [
                    {
                        "en": "He's always good for a laugh.",
                        "vi": "Anh ấy luôn vui cười."
                    },
                    {
                        "en": "Bobby should be good for a few drinks.",
                        "vi": "Bobby sẽ tốt cho một vài ly."
                    }
                ]
            },
            {
                "define": {
                    "en": "very nearly",
                    "vi": "rất gần"
                },
                "examples": [
                    {
                        "en": "The matter is as good as settled.",
                        "vi": "Vấn đề là tốt như được giải quyết."
                    },
                    {
                        "en": "He as good as called me a coward (= suggested that I was a coward without actually using the word ‘coward’).",
                        "vi": "Anh ta hay gọi tôi là kẻ hèn nhát (= gợi ý rằng tôi là kẻ hèn nhát mà không thực sự sử dụng từ 'hèn nhát')."
                    },
                    {
                        "en": "She’s as good as won.",
                        "vi": "Cô ấy giỏi như đã thắng."
                    }
                ]
            },
            {
                "define": {
                    "en": "used when you are saying that a situation is not going to get any better",
                    "vi": "được sử dụng khi bạn nói rằng một tình huống sẽ không trở nên tốt hơn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "(of a thing) to be prepared and ready for use; (of a person) to be prepared and ready to do something",
                    "vi": "(của một điều) được chuẩn bị và sẵn sàng để sử dụng; (của một người) để chuẩn bị và sẵn sàng làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "By tomorrow afternoon the document will be good to go.",
                        "vi": "Đến chiều mai, tài liệu sẽ tốt."
                    },
                    {
                        "en": "I’ve spent several months training for this race so now I’m good to go.",
                        "vi": "Tôi đã dành vài tháng để tập luyện cho cuộc đua này nên bây giờ tôi đã sẵn sàng."
                    }
                ]
            },
            {
                "define": {
                    "en": "completely",
                    "vi": "hoàn toàn"
                },
                "examples": [
                    {
                        "en": "I won't go until I'm good and ready.",
                        "vi": "Tôi sẽ không đi cho đến khi tôi tốt và sẵn sàng."
                    }
                ]
            },
            {
                "define": {
                    "en": "several",
                    "vi": "vài"
                },
                "examples": [
                    {
                        "en": "There are still a good few empty seats.",
                        "vi": "Vẫn còn một vài ghế trống tốt."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to praise somebody for doing something well",
                    "vi": "được sử dụng để khen ngợi ai đó đã làm điều gì đó tốt"
                },
                "examples": [
                    {
                        "en": "‘I passed first time.’ ‘Good for you!’",
                        "vi": "Tôi đã vượt qua lần đầu tiên.' 'Tốt cho bạn!'"
                    }
                ]
            },
            {
                "define": {
                    "en": "a lot of somebody/something",
                    "vi": "rất nhiều ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "There were a good many people there.",
                        "vi": "Có rất nhiều người tốt ở đó."
                    }
                ]
            }
        ]
    },
    {
        "id": "4e8e5fd73d3642268e8251b68f7b5f0b",
        "word": "health",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/helθ/",
            "us": "/helθ/"
        },
        "nearby": [
            {
                "word": "healing",
                "pos": "noun"
            },
            {
                "word": "Heal's",
                "pos": ""
            },
            {
                "word": "health",
                "pos": "noun"
            },
            {
                "word": "the Health and Safety at Work Act",
                "pos": ""
            },
            {
                "word": "the Health and Safety Executive",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the condition of a person’s body or mind",
                    "vi": "tình trạng của cơ thể hoặc tâm trí của một người"
                },
                "examples": [
                    {
                        "en": "to be good/bad for your health",
                        "vi": "tốt / xấu cho sức khỏe của bạn"
                    },
                    {
                        "en": "Exhaust fumes are bad for your health.",
                        "vi": "Khí thải có hại cho sức khỏe của bạn."
                    },
                    {
                        "en": "in … health to be in poor/good health",
                        "vi": "trong… sức khỏe kém / sức khỏe tốt"
                    },
                    {
                        "en": "We are both in excellent health.",
                        "vi": "Cả hai chúng tôi đều có sức khỏe tuyệt vời."
                    },
                    {
                        "en": "Grandma is not in the best of health.",
                        "vi": "Bà không có sức khỏe tốt nhất."
                    },
                    {
                        "en": "Here are some simple ways to improve your health and fitness.",
                        "vi": "Dưới đây là một số cách đơn giản để cải thiện sức khỏe và thể chất của bạn."
                    },
                    {
                        "en": "Smoking can seriously damage your health.",
                        "vi": "Hút thuốc có thể gây tổn hại nghiêm trọng đến sức khỏe của bạn."
                    },
                    {
                        "en": "Her mental health began to deteriorate.",
                        "vi": "Sức khỏe tinh thần của cô bắt đầu xấu đi."
                    },
                    {
                        "en": "physical/sexual/reproductive health",
                        "vi": "sức khỏe thể chất / tình dục / sinh sản"
                    },
                    {
                        "en": "There is no threat to public health from this paint.",
                        "vi": "Không có mối đe dọa nào đối với sức khỏe cộng đồng từ loại sơn này."
                    },
                    {
                        "en": "Our concern is to protect human health and the environment.",
                        "vi": "Mối quan tâm của chúng tôi là bảo vệ sức khỏe con người và môi trường."
                    },
                    {
                        "en": "The chance of developing health problems is greater for individuals who are too fat or too thin.",
                        "vi": "Cơ hội phát triển các vấn đề sức khỏe lớn hơn đối với những người quá béo hoặc quá gầy."
                    },
                    {
                        "en": "Air pollution causes significant health risks.",
                        "vi": "Ô nhiễm không khí gây ra những nguy cơ sức khỏe đáng kể."
                    },
                    {
                        "en": "The treatment potentially doubles the health benefits for at-risk patients.",
                        "vi": "Việc điều trị có khả năng tăng gấp đôi lợi ích sức khỏe cho những bệnh nhân có nguy cơ."
                    }
                ]
            },
            {
                "define": {
                    "en": "the state of being physically and mentally healthy",
                    "vi": "trạng thái khỏe mạnh về thể chất và tinh thần"
                },
                "examples": [
                    {
                        "en": "Slowly they nursed him back to health.",
                        "vi": "Từ từ họ đã chăm sóc cho anh ta khỏe mạnh trở lại."
                    },
                    {
                        "en": "Rest and exercise restored her health.",
                        "vi": "Nghỉ ngơi và tập thể dục đã phục hồi sức khỏe cho cô."
                    },
                    {
                        "en": "the role of diet in achieving and maintaining health",
                        "vi": "vai trò của chế độ ăn uống trong việc đạt được và duy trì sức khỏe"
                    }
                ]
            },
            {
                "define": {
                    "en": "the work of providing medical services",
                    "vi": "công việc cung cấp dịch vụ y tế"
                },
                "examples": [
                    {
                        "en": "All parties are promising to increase spending on health.",
                        "vi": "Tất cả các bên đều hứa hẹn sẽ tăng chi tiêu cho y tế."
                    },
                    {
                        "en": "the Health Minister",
                        "vi": "Bộ trưởng Bộ Y tế"
                    },
                    {
                        "en": "the Department of Health",
                        "vi": "Sở Y tế"
                    },
                    {
                        "en": "health professionals/workers",
                        "vi": "chuyên gia y tế / công nhân"
                    },
                    {
                        "en": "health insurance",
                        "vi": "bảo hiểm y tế"
                    },
                    {
                        "en": "health and safety regulations (= laws that protect the health of people at work)",
                        "vi": "các quy định về sức khỏe và an toàn (= luật bảo vệ sức khỏe của mọi người tại nơi làm việc)"
                    }
                ]
            },
            {
                "define": {
                    "en": "how successful something is",
                    "vi": "một cái gì đó thành công như thế nào"
                },
                "examples": [
                    {
                        "en": "the health of the economy",
                        "vi": "sức khỏe của nền kinh tế"
                    },
                    {
                        "en": "the health of your marriage/finances",
                        "vi": "sức khỏe của cuộc hôn nhân / tài chính của bạn"
                    }
                ]
            },
            {
                "define": {
                    "en": "a report that says somebody is healthy or that something is in good condition",
                    "vi": "một báo cáo nói rằng ai đó khỏe mạnh hoặc một cái gì đó đang ở trong tình trạng tốt"
                },
                "examples": [
                    {
                        "en": "Doctors gave him a clean bill of health after a series of tests and examinations.",
                        "vi": "Các bác sĩ đã cho anh ta một sức khỏe sạch sẽ sau một loạt các xét nghiệm và kiểm tra."
                    },
                    {
                        "en": "The building was given a clean bill of health by the surveyor.",
                        "vi": "Tòa nhà đã được một nhà khảo sát đưa ra một hóa đơn sạch về sức khỏe."
                    }
                ]
            },
            {
                "define": {
                    "en": "to wish somebody good health as you lift your glass, and then drink from it",
                    "vi": "để chúc sức khỏe ai đó khi bạn nâng ly của mình, và sau đó uống từ đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "said before drinking alcohol to express good wishes for somebody's health and happiness",
                    "vi": "nói trước khi uống rượu để bày tỏ những lời chúc tốt đẹp cho sức khỏe và hạnh phúc của ai đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "looking or feeling very healthy",
                    "vi": "trông hoặc cảm thấy rất khỏe mạnh"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to ask people to wish somebody health, happiness and success by raising their glasses and drinking",
                    "vi": "để yêu cầu mọi người chúc ai đó sức khỏe, hạnh phúc và thành công bằng cách nâng ly của họ và uống"
                },
                "examples": [
                    {
                        "en": "I'd like to propose a toast to the bride and groom.",
                        "vi": "Tôi muốn nâng cốc chúc mừng cô dâu và chú rể."
                    }
                ]
            }
        ]
    },
    {
        "id": "f776f5a377194d67a28c8a584ea82a76",
        "word": "healthy",
        "pos": "adjective",
        "level": "a1",
        "phonetic": {
            "uk": "/ˈhelθi/",
            "us": "/ˈhelθi/"
        },
        "nearby": [
            {
                "word": "health tourism",
                "pos": "noun"
            },
            {
                "word": "health visitor",
                "pos": "noun"
            },
            {
                "word": "healthy",
                "pos": "adjective"
            },
            {
                "word": "Seamus Heaney",
                "pos": ""
            },
            {
                "word": "heap",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "having good health and not likely to become ill",
                    "vi": "có sức khỏe tốt và không có khả năng bị ốm"
                },
                "examples": [
                    {
                        "en": "a healthy child/baby/adult",
                        "vi": "một đứa trẻ khỏe mạnh / em bé / người lớn"
                    },
                    {
                        "en": "The researchers then measured brain activity in two groups of healthy subjects.",
                        "vi": "Sau đó, các nhà nghiên cứu đo hoạt động của não ở hai nhóm đối tượng khỏe mạnh."
                    },
                    {
                        "en": "a healthy animal/tree",
                        "vi": "động vật / cây khỏe mạnh"
                    },
                    {
                        "en": "Stay healthy by eating well and exercising regularly.",
                        "vi": "Giữ sức khỏe bằng cách ăn uống đầy đủ và tập thể dục thường xuyên."
                    },
                    {
                        "en": "She was finally starting to look healthy again.",
                        "vi": "Cuối cùng cô ấy cũng bắt đầu khỏe mạnh trở lại."
                    },
                    {
                        "en": "The newborn was perfectly healthy.",
                        "vi": "Đứa trẻ sơ sinh hoàn toàn khỏe mạnh."
                    },
                    {
                        "en": "People are living longer and living healthier lives.",
                        "vi": "Mọi người đang sống lâu hơn và sống khỏe mạnh hơn."
                    }
                ]
            },
            {
                "define": {
                    "en": "good for your health",
                    "vi": "tốt cho sức khỏe của bạn"
                },
                "examples": [
                    {
                        "en": "a healthy diet/lifestyle",
                        "vi": "một chế độ ăn uống / lối sống lành mạnh"
                    },
                    {
                        "en": "healthy eating/food/living",
                        "vi": "ăn uống / thực phẩm / sinh hoạt lành mạnh"
                    },
                    {
                        "en": "The farm provides a healthy work environment.",
                        "vi": "Trang trại cung cấp một môi trường làm việc lành mạnh."
                    }
                ]
            },
            {
                "define": {
                    "en": "showing that you are in good health",
                    "vi": "cho thấy rằng bạn có sức khỏe tốt"
                },
                "examples": [
                    {
                        "en": "to have a healthy appetite",
                        "vi": "để có một cảm giác ngon miệng lành mạnh"
                    }
                ]
            },
            {
                "define": {
                    "en": "normal and sensible",
                    "vi": "bình thường và hợp lý"
                },
                "examples": [
                    {
                        "en": "The child showed a healthy curiosity.",
                        "vi": "Đứa trẻ tỏ ra tò mò lành mạnh."
                    },
                    {
                        "en": "She has a healthy respect for her rival's talents.",
                        "vi": "Cô ấy có một sự tôn trọng lành mạnh đối với tài năng của đối thủ của mình."
                    },
                    {
                        "en": "It's not healthy the way she clings to the past.",
                        "vi": "Cách cô ấy bám vào quá khứ không có lợi cho sức khỏe."
                    }
                ]
            },
            {
                "define": {
                    "en": "successful and working well",
                    "vi": "thành công và làm việc tốt"
                },
                "examples": [
                    {
                        "en": "The economy is extremely healthy at the moment.",
                        "vi": "Nền kinh tế đang cực kỳ khỏe mạnh vào thời điểm hiện tại."
                    },
                    {
                        "en": "Your car doesn't sound very healthy.",
                        "vi": "Xe của bạn nghe không được khỏe lắm."
                    }
                ]
            },
            {
                "define": {
                    "en": "large and showing success",
                    "vi": "lớn và thể hiện thành công"
                },
                "examples": [
                    {
                        "en": "a healthy bank balance",
                        "vi": "số dư ngân hàng lành mạnh"
                    },
                    {
                        "en": "a healthy profit",
                        "vi": "một lợi nhuận lành mạnh"
                    }
                ]
            }
        ]
    },
    {
        "id": "f01898fb5a5c4747a1e8c80307280970",
        "word": "strong",
        "pos": "adjective",
        "level": "a1",
        "phonetic": {
            "uk": "/strɒŋ/",
            "us": "/strɔːŋ/"
        },
        "nearby": [
            {
                "word": "stroller",
                "pos": "noun"
            },
            {
                "word": "strolling players",
                "pos": "noun"
            },
            {
                "word": "strong",
                "pos": "adjective"
            },
            {
                "word": "strong-arm",
                "pos": "adjective"
            },
            {
                "word": "strongbox",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "having a lot of physical power so that you can lift heavy weights, do hard physical work, etc.",
                    "vi": "có nhiều thể lực để bạn có thể nâng tạ nặng, tập thể dục nặng nhọc, v.v."
                },
                "examples": [
                    {
                        "en": "He's strong enough to lift a car!",
                        "vi": "Anh ấy đủ khỏe để nâng một chiếc ô tô!"
                    },
                    {
                        "en": "strong muscles",
                        "vi": "cơ bắp khỏe mạnh"
                    },
                    {
                        "en": "She wasn't a strong swimmer (= she could not swim well).",
                        "vi": "Cô ấy không phải là một vận động viên bơi lội mạnh mẽ (= cô ấy không thể bơi giỏi)."
                    }
                ]
            },
            {
                "define": {
                    "en": "having great power",
                    "vi": "có sức mạnh to lớn"
                },
                "examples": [
                    {
                        "en": "Stay indoors in the middle of the day, when the sun is strongest.",
                        "vi": "Ở trong nhà vào giữa ngày, khi mặt trời mạnh nhất."
                    },
                    {
                        "en": "a strong wind",
                        "vi": "Một cơn gió mạnh"
                    },
                    {
                        "en": "a strong magnet/current",
                        "vi": "một nam châm mạnh / dòng điện"
                    }
                ]
            },
            {
                "define": {
                    "en": "having a powerful effect on the body or mind",
                    "vi": "có tác động mạnh mẽ đến cơ thể hoặc tâm trí"
                },
                "examples": [
                    {
                        "en": "a strong drug",
                        "vi": "một loại thuốc mạnh"
                    },
                    {
                        "en": "His imagery made a strong impression on the critics.",
                        "vi": "Hình ảnh của ông đã gây ấn tượng mạnh đối với các nhà phê bình."
                    }
                ]
            },
            {
                "define": {
                    "en": "having a lot of power or influence",
                    "vi": "có nhiều quyền lực hoặc ảnh hưởng"
                },
                "examples": [
                    {
                        "en": "a strong leader",
                        "vi": "một nhà lãnh đạo mạnh mẽ"
                    },
                    {
                        "en": "What the country needs right now is a strong government.",
                        "vi": "Điều đất nước cần ngay bây giờ là một chính phủ mạnh."
                    }
                ]
            },
            {
                "define": {
                    "en": "people who are rich or powerful",
                    "vi": "những người giàu có hoặc quyền lực"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "difficult to attack or criticize",
                    "vi": "khó tấn công hoặc chỉ trích"
                },
                "examples": [
                    {
                        "en": "There is strong evidence of a link between exercise and a healthy heart.",
                        "vi": "Có bằng chứng rõ ràng về mối liên hệ giữa tập thể dục và một trái tim khỏe mạnh."
                    },
                    {
                        "en": "You have a strong case for getting your job back.",
                        "vi": "Bạn có một trường hợp mạnh mẽ để lấy lại công việc của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "very powerful and difficult for people to fight against or defeat",
                    "vi": "rất mạnh mẽ và rất khó để mọi người chống lại hoặc đánh bại"
                },
                "examples": [
                    {
                        "en": "a strong team",
                        "vi": "một đội mạnh"
                    },
                    {
                        "en": "The proposal aroused strong opposition.",
                        "vi": "Đề xuất đã làm dấy lên sự phản đối mạnh mẽ."
                    },
                    {
                        "en": "The temptation to tell her everything was very strong.",
                        "vi": "Sự cám dỗ để nói với cô ấy mọi thứ rất mạnh mẽ."
                    },
                    {
                        "en": "He exerts an extremely strong influence on his classmates.",
                        "vi": "Anh ấy có ảnh hưởng cực kỳ mạnh mẽ đến các bạn cùng lớp của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "very powerful",
                    "vi": "rất mạnh"
                },
                "examples": [
                    {
                        "en": "strong support for the government",
                        "vi": "hỗ trợ mạnh mẽ cho chính phủ"
                    },
                    {
                        "en": "People have strong feelings about this issue.",
                        "vi": "Mọi người có cảm xúc mạnh mẽ về vấn đề này."
                    }
                ]
            },
            {
                "define": {
                    "en": "holding an opinion or a belief very seriously",
                    "vi": "giữ một ý kiến hoặc một niềm tin rất nghiêm túc"
                },
                "examples": [
                    {
                        "en": "a strong supporter of the government",
                        "vi": "một người ủng hộ mạnh mẽ của chính phủ"
                    },
                    {
                        "en": "a strong opponent",
                        "vi": "một đối thủ mạnh"
                    },
                    {
                        "en": "She has long been one of the strongest advocates of sanctions.",
                        "vi": "Cô từ lâu đã là một trong những người ủng hộ mạnh mẽ nhất các biện pháp trừng phạt."
                    }
                ]
            },
            {
                "define": {
                    "en": "easy to see, hear, feel or smell; very great or intense",
                    "vi": "dễ nhìn, nghe, cảm nhận hoặc ngửi thấy; rất tuyệt vời hoặc dữ dội"
                },
                "examples": [
                    {
                        "en": "a strong smell",
                        "vi": "một mùi mạnh"
                    },
                    {
                        "en": "a strong feeling of nausea",
                        "vi": "một cảm giác buồn nôn mạnh mẽ"
                    },
                    {
                        "en": "a strong voice (= loud)",
                        "vi": "một giọng nói mạnh mẽ (= lớn)"
                    },
                    {
                        "en": "strong colours",
                        "vi": "màu sắc mạnh mẽ"
                    },
                    {
                        "en": "a face with strong features (= large and easy to notice)",
                        "vi": "một khuôn mặt với các đặc điểm mạnh mẽ (= lớn và dễ nhận thấy)"
                    },
                    {
                        "en": "She spoke with a strong Australian accent.",
                        "vi": "Cô ấy nói với một giọng Úc mạnh mẽ."
                    },
                    {
                        "en": "He was under strong pressure to resign.",
                        "vi": "Ông đã bị áp lực mạnh mẽ để từ chức."
                    }
                ]
            },
            {
                "define": {
                    "en": "having a lot of taste",
                    "vi": "có rất nhiều hương vị"
                },
                "examples": [
                    {
                        "en": "strong cheese",
                        "vi": "pho mát mạnh"
                    },
                    {
                        "en": "You'll need to use plenty of strong French mustard.",
                        "vi": "Bạn sẽ cần sử dụng nhiều mù tạt Pháp mạnh."
                    }
                ]
            },
            {
                "define": {
                    "en": "containing a lot of a substance",
                    "vi": "chứa nhiều chất"
                },
                "examples": [
                    {
                        "en": "strong black coffee",
                        "vi": "cà phê đen mạnh"
                    }
                ]
            },
            {
                "define": {
                    "en": "not easily broken or damaged; made well",
                    "vi": "không dễ bị vỡ hoặc hư hỏng; làm tốt"
                },
                "examples": [
                    {
                        "en": "The box looks strong enough.",
                        "vi": "Hộp trông đủ mạnh."
                    }
                ]
            },
            {
                "define": {
                    "en": "not easily upset or frightened; not easily influenced by other people",
                    "vi": "không dễ dàng khó chịu hoặc sợ hãi; không dễ bị ảnh hưởng bởi người khác"
                },
                "examples": [
                    {
                        "en": "You need strong nerves to ride a bike in London.",
                        "vi": "Bạn cần có thần kinh mạnh để đi xe đạp ở London."
                    },
                    {
                        "en": "Every child needs to develop a strong sense of identity.",
                        "vi": "Mỗi đứa trẻ cần phát triển một ý thức mạnh mẽ về bản sắc."
                    },
                    {
                        "en": "It's difficult, I know. But be strong!",
                        "vi": "Nó khó, tôi biết. Nhưng hãy mạnh mẽ lên!"
                    },
                    {
                        "en": "a strong personality",
                        "vi": "một cá tính mạnh mẽ"
                    },
                    {
                        "en": "She’s had a strong will since she was a baby.",
                        "vi": "Cô ấy đã có một ý chí mạnh mẽ từ khi còn là một đứa trẻ."
                    },
                    {
                        "en": "We must stand strong in the face of adversity.",
                        "vi": "Chúng ta phải mạnh mẽ đứng lên khi đối mặt với nghịch cảnh."
                    }
                ]
            },
            {
                "define": {
                    "en": "likely to succeed or happen",
                    "vi": "có khả năng thành công hoặc xảy ra"
                },
                "examples": [
                    {
                        "en": "a strong candidate for the job",
                        "vi": "một ứng cử viên sáng giá cho công việc"
                    },
                    {
                        "en": "You're in a strong position to negotiate a deal.",
                        "vi": "Bạn đang ở một vị trí vững chắc để thương lượng một thỏa thuận."
                    },
                    {
                        "en": "There's a strong possibility that we'll lose the game.",
                        "vi": "Có khả năng cao là chúng tôi sẽ thua trận."
                    }
                ]
            },
            {
                "define": {
                    "en": "having existed for a long time and functioning well; difficult to destroy",
                    "vi": "tồn tại lâu đời và hoạt động tốt; khó tiêu diệt"
                },
                "examples": [
                    {
                        "en": "a strong marriage",
                        "vi": "một cuộc hôn nhân bền chặt"
                    },
                    {
                        "en": "The college has strong links with local industry.",
                        "vi": "Trường có liên kết chặt chẽ với các ngành công nghiệp địa phương."
                    },
                    {
                        "en": "I know that their relationship is growing stronger every day.",
                        "vi": "Tôi biết rằng mối quan hệ của họ đang phát triển mạnh mẽ hơn mỗi ngày."
                    }
                ]
            },
            {
                "define": {
                    "en": "having a value that is high or increasing",
                    "vi": "có giá trị cao hoặc ngày càng tăng"
                },
                "examples": [
                    {
                        "en": "strong share prices",
                        "vi": "giá cổ phiếu mạnh"
                    },
                    {
                        "en": "The country is currently experiencing particularly strong economic growth.",
                        "vi": "Đất nước này hiện đang có tốc độ tăng trưởng kinh tế đặc biệt mạnh mẽ."
                    },
                    {
                        "en": "The euro is getting stronger against the dollar.",
                        "vi": "Đồng euro đang trở nên mạnh hơn so với đồng đô la."
                    },
                    {
                        "en": "This news helped keep the dollar relatively strong today.",
                        "vi": "Tin tức này đã giúp giữ cho đồng đô la tương đối mạnh trong ngày hôm nay."
                    }
                ]
            },
            {
                "define": {
                    "en": "in a safe financial position",
                    "vi": "ở một vị trí tài chính an toàn"
                },
                "examples": [
                    {
                        "en": "Their catering business remained strong despite the recession.",
                        "vi": "Hoạt động kinh doanh ăn uống của họ vẫn phát triển mạnh mẽ bất chấp suy thoái kinh tế."
                    }
                ]
            },
            {
                "define": {
                    "en": "good at something; done well",
                    "vi": "giỏi một cái gì đó; thực hiện tốt"
                },
                "examples": [
                    {
                        "en": "The play has a very strong cast.",
                        "vi": "Vở kịch có một dàn diễn viên rất hùng hậu."
                    },
                    {
                        "en": "The actors give extremely strong performances.",
                        "vi": "Các diễn viên cống hiến vô cùng mạnh mẽ."
                    },
                    {
                        "en": "Mathematics was never my strong point (= I was never very good at it).",
                        "vi": "Toán học chưa bao giờ là điểm mạnh của tôi (= Tôi chưa bao giờ giỏi nó)."
                    }
                ]
            },
            {
                "define": {
                    "en": "great in number",
                    "vi": "số lượng lớn"
                },
                "examples": [
                    {
                        "en": "There was a strong police presence at the demonstration.",
                        "vi": "Có một sự hiện diện mạnh mẽ của cảnh sát tại cuộc biểu tình."
                    },
                    {
                        "en": "Sales were surprisingly strong in the second half of the year.",
                        "vi": "Doanh số bán hàng tăng mạnh một cách đáng ngạc nhiên trong nửa cuối năm."
                    }
                ]
            },
            {
                "define": {
                    "en": "used after numbers to show the size of a group",
                    "vi": "được sử dụng sau các số để hiển thị quy mô của một nhóm"
                },
                "examples": [
                    {
                        "en": "a 5 000-strong crowd",
                        "vi": "một đám đông 5000 người"
                    },
                    {
                        "en": "The crowd was 5 000 strong.",
                        "vi": "Đám đông rất mạnh mẽ."
                    }
                ]
            },
            {
                "define": {
                    "en": "not easily affected by disease; healthy",
                    "vi": "không dễ bị ảnh hưởng bởi bệnh tật; mạnh khỏe"
                },
                "examples": [
                    {
                        "en": "These vitamins are meant to keep you healthy and strong.",
                        "vi": "Những loại vitamin này có tác dụng giữ cho bạn khỏe mạnh và cường tráng."
                    }
                ]
            },
            {
                "define": {
                    "en": "having a lot of force, often causing offence to people",
                    "vi": "có nhiều vũ lực, thường xuyên gây phản cảm cho mọi người"
                },
                "examples": [
                    {
                        "en": "The movie has been criticized for strong language (= swearing).",
                        "vi": "Phim bị chỉ trích vì ngôn từ mạnh mẽ (= chửi thề)."
                    }
                ]
            },
            {
                "define": {
                    "en": "forming the past tense and past participle by changing a vowel, not by adding a regular ending, for example sing, sang, sung",
                    "vi": "hình thành thì quá khứ và phân từ quá khứ bằng cách thay đổi một nguyên âm, không phải bằng cách thêm một kết thúc thông thường, ví dụ sing, sing, sing"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to describe the way some words are pronounced when they have stress. For example, the strong form of and is /ænd/.",
                    "vi": "được sử dụng để mô tả cách một số từ được phát âm khi chúng có trọng âm. Ví dụ, dạng mạnh của and is / ænd /."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to say that you think what somebody has said is unfair or too critical",
                    "vi": "từng nói rằng bạn nghĩ những gì ai đó đã nói là không công bằng hoặc quá chỉ trích"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "something that gives somebody an advantage over other people in a particular situation",
                    "vi": "thứ gì đó mang lại cho ai đó lợi thế hơn những người khác trong một tình huống cụ thể"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be good at something",
                    "vi": "trở nên giỏi hơn về cái gì đó"
                },
                "examples": [
                    {
                        "en": "I'm not very strong on dates (= I can't remember the dates of important events).",
                        "vi": "I’m not very strong on date (= Tôi không thể nhớ ngày của những sự kiện quan trọng)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have a lot of something",
                    "vi": "có rất nhiều thứ"
                },
                "examples": [
                    {
                        "en": "The report was strong on criticism, but short on practical suggestions.",
                        "vi": "Báo cáo mạnh về phản biện, nhưng ngắn về đề xuất thực tế."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be a subject that somebody knows a lot about",
                    "vi": "trở thành một chủ đề mà ai đó biết rất nhiều về"
                },
                "examples": [
                    {
                        "en": "I'm afraid geography is not my strong suit.",
                        "vi": "Tôi e rằng địa lý không phải là điểm mạnh của tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make your feelings clear in an aggressive way, especially your sexual feelings towards somebody",
                    "vi": "để làm rõ cảm xúc của bạn một cách hung hăng, đặc biệt là cảm xúc tình dục của bạn đối với ai đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to continue to be healthy, active or successful",
                    "vi": "để tiếp tục khỏe mạnh, năng động hoặc thành công"
                },
                "examples": [
                    {
                        "en": "My grandmother is 90 and still going strong.",
                        "vi": "Bà tôi đã 90 và vẫn còn khỏe."
                    },
                    {
                        "en": "The business is still going strong.",
                        "vi": "Công việc kinh doanh vẫn đang diễn ra mạnh mẽ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be able to see or do unpleasant things without feeling sick or upset",
                    "vi": "để có thể nhìn thấy hoặc làm những điều khó chịu mà không cảm thấy buồn nôn hoặc khó chịu"
                },
                "examples": [
                    {
                        "en": "You need a strong stomach to go on the giant roller coaster.",
                        "vi": "Bạn cần có một cái bụng khỏe để đi trên tàu lượn khổng lồ."
                    }
                ]
            }
        ]
    },
    {
        "id": "330db656f471484aba244bf90cf315bf",
        "word": "well",
        "pos": "adjective",
        "level": "a1",
        "phonetic": {
            "uk": "/wel/",
            "us": "/wel/"
        },
        "nearby": [
            {
                "word": "well",
                "pos": "adverb"
            },
            {
                "word": "we'll",
                "pos": "short form"
            },
            {
                "word": "well",
                "pos": "adjective"
            },
            {
                "word": "well",
                "pos": "exclamation"
            },
            {
                "word": "well",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "in good health",
                    "vi": "sức khỏe tốt"
                },
                "examples": [
                    {
                        "en": "I don't feel very well.",
                        "vi": "Tôi không cảm thấy tốt cho lắm."
                    },
                    {
                        "en": "Is she well enough to travel?",
                        "vi": "Cô ấy có đủ khỏe để đi du lịch không?"
                    },
                    {
                        "en": "Get well soon! (= for example, on a card)",
                        "vi": "Sớm khỏe lại! (= ví dụ: trên thẻ)"
                    },
                    {
                        "en": "I'm better now, thank you.",
                        "vi": "Bây giờ tôi tốt hơn, cảm ơn bạn."
                    },
                    {
                        "en": "(informal) He's not a well man.",
                        "vi": "(thân mật) Anh ấy không phải là một người đàn ông tốt."
                    }
                ]
            },
            {
                "define": {
                    "en": "in a good state or position",
                    "vi": "ở trạng thái hoặc vị trí tốt"
                },
                "examples": [
                    {
                        "en": "It seems that all is not well at home.",
                        "vi": "Có vẻ như tất cả không phải là tốt ở nhà."
                    },
                    {
                        "en": "All's well that ends well (= used when something has ended happily, even though you thought it might not).",
                        "vi": "Tất cả đều tốt mà kết thúc tốt đẹp (= được sử dụng khi điều gì đó đã kết thúc một cách vui vẻ, mặc dù bạn nghĩ rằng nó có thể không)."
                    }
                ]
            },
            {
                "define": {
                    "en": "sensible; a good idea",
                    "vi": "hợp lý; một ý kiến hay"
                },
                "examples": [
                    {
                        "en": "It would be just as well to call and say we might be late.",
                        "vi": "Sẽ tốt hơn nếu bạn gọi điện và nói rằng chúng tôi có thể đến muộn."
                    },
                    {
                        "en": "(formal) It would be well to start early.",
                        "vi": "(chính thức) Sẽ là tốt nếu bắt đầu sớm."
                    }
                ]
            },
            {
                "define": {
                    "en": "still living and not injured or harmed",
                    "vi": "vẫn sống và không bị thương hoặc bị tổn hại"
                },
                "examples": [
                    {
                        "en": "The missing student was found alive and well in Newcastle.",
                        "vi": "Học sinh mất tích được tìm thấy vẫn sống khỏe mạnh ở Newcastle."
                    }
                ]
            },
            {
                "define": {
                    "en": "still popular or successful",
                    "vi": "vẫn phổ biến hoặc thành công"
                },
                "examples": [
                    {
                        "en": "Singapore's literary scene is alive and well.",
                        "vi": "Nền văn học của Singapore đang sống và phát triển."
                    },
                    {
                        "en": "Contrary to popular belief, the tourism industry is alive and well in this part of the world.",
                        "vi": "Trái ngược với suy nghĩ của nhiều người, ngành du lịch đang tồn tại và phát triển ở khu vực này trên thế giới."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to criticize or reject a remark that somebody has made, especially when they were trying to make you feel happier about something",
                    "vi": "được sử dụng để chỉ trích hoặc từ chối một nhận xét mà ai đó đã đưa ra, đặc biệt là khi họ đang cố gắng làm cho bạn cảm thấy hạnh phúc hơn về điều gì đó"
                },
                "examples": [
                    {
                        "en": "It's all very well for you to say it doesn't matter, but I've put a lot of work into this and I want it to be a success.",
                        "vi": "Đối với bạn, tất cả đều rất tốt khi nói rằng điều đó không quan trọng, nhưng tôi đã nỗ lực rất nhiều vào việc này và tôi muốn nó thành công."
                    }
                ]
            },
            {
                "define": {
                    "en": "quite good but not exactly what is wanted",
                    "vi": "khá tốt nhưng không chính xác những gì mong muốn"
                },
                "examples": [
                    {
                        "en": "That's all well and good, but why didn't he call her to say so?",
                        "vi": "Vậy là tốt và tốt, nhưng tại sao anh không gọi cô để nói như vậy?"
                    }
                ]
            }
        ]
    },
    {
        "id": "7665deb4c5d8444e8424fdfab7eb384f",
        "word": "energy",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈenədʒi/",
            "us": "/ˈenərdʒi/"
        },
        "nearby": [
            {
                "word": "energetically",
                "pos": "adverb"
            },
            {
                "word": "energize",
                "pos": "verb"
            },
            {
                "word": "energy",
                "pos": "noun"
            },
            {
                "word": "energy bar",
                "pos": "noun"
            },
            {
                "word": "energy drink",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the strength, effort and enthusiasm required for physical or mental activity, work, etc.",
                    "vi": "sức mạnh, nỗ lực và sự nhiệt tình cần thiết cho hoạt động thể chất hoặc tinh thần, công việc, v.v."
                },
                "examples": [
                    {
                        "en": "It's a waste of time and energy.",
                        "vi": "Thật lãng phí thời gian và năng lượng."
                    },
                    {
                        "en": "She's always full of energy.",
                        "vi": "Cô ấy luôn tràn đầy năng lượng."
                    },
                    {
                        "en": "I don't seem to have any energy these days.",
                        "vi": "Tôi dường như không có chút năng lượng nào trong những ngày này."
                    },
                    {
                        "en": "nervous energy (= energy produced by feeling nervous)",
                        "vi": "năng lượng thần kinh (= năng lượng được tạo ra bởi cảm giác lo lắng)"
                    },
                    {
                        "en": "For five years, she devoted considerable energy to photography.",
                        "vi": "Trong 5 năm, cô đã dành năng lượng đáng kể cho nhiếp ảnh."
                    },
                    {
                        "en": "He expends great energy trying to help them.",
                        "vi": "Anh ấy dành nhiều năng lượng để cố gắng giúp đỡ họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "the physical and mental effort that you use to do something",
                    "vi": "nỗ lực thể chất và tinh thần mà bạn sử dụng để làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "She put all her energies into her work.",
                        "vi": "Cô ấy dồn hết tâm sức cho công việc."
                    },
                    {
                        "en": "He focused his energies on preparing the lectures.",
                        "vi": "Anh ấy tập trung toàn lực vào việc chuẩn bị các bài giảng."
                    },
                    {
                        "en": "Provide a means of channelling your child's creative energies.",
                        "vi": "Cung cấp một phương tiện truyền tải năng lượng sáng tạo của con bạn."
                    },
                    {
                        "en": "I will put all my energies into improving the situation.",
                        "vi": "Tôi sẽ dồn hết tâm sức để cải thiện tình hình."
                    }
                ]
            },
            {
                "define": {
                    "en": "a source of power, such as fuel, used for driving machines, providing heat, etc.",
                    "vi": "một nguồn năng lượng, chẳng hạn như nhiên liệu, được sử dụng cho động cơ máy móc, cung cấp nhiệt, v.v."
                },
                "examples": [
                    {
                        "en": "solar/wind/renewable energy",
                        "vi": "năng lượng mặt trời / gió / tái tạo"
                    },
                    {
                        "en": "to save/conserve energy",
                        "vi": "để tiết kiệm / bảo tồn năng lượng"
                    },
                    {
                        "en": "to generate/produce energy",
                        "vi": "để tạo ra / sản xuất năng lượng"
                    },
                    {
                        "en": "The £500 million programme is centred around energy efficiency and renewable power sources.",
                        "vi": "Chương trình trị giá 500 triệu bảng Anh tập trung vào hiệu quả năng lượng và các nguồn năng lượng tái tạo."
                    },
                    {
                        "en": "the country's total energy consumption",
                        "vi": "tổng mức tiêu thụ năng lượng của đất nước"
                    },
                    {
                        "en": "an energy crisis (= for example when fuel is not freely available)",
                        "vi": "khủng hoảng năng lượng (= ví dụ khi nhiên liệu không có sẵn miễn phí)"
                    },
                    {
                        "en": "energy conservation",
                        "vi": "bảo tồn năng lượng"
                    }
                ]
            },
            {
                "define": {
                    "en": "the ability of matter or radiation to work because of its mass, movement, electric charge, etc.",
                    "vi": "khả năng hoạt động của vật chất hoặc bức xạ do khối lượng, chuyển động, điện tích của nó, v.v."
                },
                "examples": [
                    {
                        "en": "potential/kinetic/electrical energy",
                        "vi": "thế năng / động năng / năng lượng điện"
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who is full of energy and enthusiasm",
                    "vi": "một người tràn đầy năng lượng và nhiệt huyết"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "325c0970234c4e93955595fc9549e791",
        "word": "fit",
        "pos": "adjective",
        "level": "a2",
        "phonetic": {
            "uk": "/fɪt/",
            "us": "/fɪt/"
        },
        "nearby": [
            {
                "word": "fistula",
                "pos": "noun"
            },
            {
                "word": "fit",
                "pos": "verb"
            },
            {
                "word": "fit",
                "pos": "adjective"
            },
            {
                "word": "fit",
                "pos": "noun"
            },
            {
                "word": "fitful",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "healthy and strong, especially because you do regular physical exercise",
                    "vi": "khỏe mạnh và mạnh mẽ, đặc biệt là vì bạn thường xuyên tập thể dục"
                },
                "examples": [
                    {
                        "en": "Top athletes have to be very fit.",
                        "vi": "Các vận động viên hàng đầu phải rất khỏe mạnh."
                    },
                    {
                        "en": "She tries to keep fit by jogging every day.",
                        "vi": "Cô cố gắng giữ dáng bằng cách chạy bộ mỗi ngày."
                    },
                    {
                        "en": "Hiking helps keep him physically fit.",
                        "vi": "Đi bộ đường dài giúp anh ấy có thể lực tốt."
                    },
                    {
                        "en": "All the recruits seemed fit and healthy.",
                        "vi": "Tất cả các tân binh đều có vẻ phù hợp và khỏe mạnh."
                    },
                    {
                        "en": "my new year's resolution to get fit",
                        "vi": "giải pháp năm mới của tôi để có được thân hình"
                    },
                    {
                        "en": "He is back in training after his back injury but is not yet considered match fit (= fit enough to play in a match).",
                        "vi": "Anh ấy đã trở lại tập luyện sau chấn thương lưng nhưng vẫn chưa được coi là phù hợp (= đủ sức khỏe để thi đấu trong một trận đấu)."
                    }
                ]
            },
            {
                "define": {
                    "en": "suitable; of the right quality; with the right qualities or skills",
                    "vi": "phù hợp; đúng chất lượng; với những phẩm chất hoặc kỹ năng phù hợp"
                },
                "examples": [
                    {
                        "en": "fit for somebody/something The food was not fit for human consumption.",
                        "vi": "phù hợp với ai đó / cái gì đó Thức ăn không phù hợp cho con người."
                    },
                    {
                        "en": "It was a meal fit for a king (= of very good quality).",
                        "vi": "Đó là một bữa ăn phù hợp cho một vị vua (= chất lượng rất tốt)."
                    },
                    {
                        "en": "fit for doing something The children seem to think I'm only fit for cooking and washing!",
                        "vi": "thích hợp để làm việc gì đó Bọn trẻ dường như nghĩ rằng tôi chỉ thích nấu ăn và giặt giũ!"
                    },
                    {
                        "en": "fit to do something Your car isn't fit to be on the road!",
                        "vi": "phù hợp để làm việc gì đó Xe của bạn không phù hợp để đi trên đường!"
                    },
                    {
                        "en": "He's so angry he's in no fit state to see anyone.",
                        "vi": "Anh ấy rất tức giận và không có đủ sức khỏe để gặp ai."
                    },
                    {
                        "en": "(formal) This is not a fit place for you to live.",
                        "vi": "(trang trọng) Đây không phải là một nơi thích hợp để bạn sống."
                    },
                    {
                        "en": "He was not considered a fit and proper person to run a bank.",
                        "vi": "Ông không được coi là một người phù hợp và thích hợp để điều hành một ngân hàng."
                    },
                    {
                        "en": "Schools should be allowed to operate as they deem fit.",
                        "vi": "Các trường học nên được phép hoạt động khi chúng thấy phù hợp."
                    }
                ]
            },
            {
                "define": {
                    "en": "ready or likely to do something extreme",
                    "vi": "sẵn sàng hoặc có khả năng làm điều gì đó cực đoan"
                },
                "examples": [
                    {
                        "en": "They worked until they were fit to drop (= so tired that they were likely to fall down).",
                        "vi": "Họ đã làm việc cho đến khi đủ sức khỏe để thả người (= quá mệt mỏi đến nỗi họ có khả năng ngã xuống)."
                    },
                    {
                        "en": "I've eaten so much I'm fit to burst.",
                        "vi": "Tôi đã ăn nhiều đến mức tôi muốn vỡ òa."
                    },
                    {
                        "en": "She was laughing fit to burst (= very much).",
                        "vi": "Cô ấy đã cười đến vỡ òa (= rất nhiều)."
                    }
                ]
            },
            {
                "define": {
                    "en": "sexually attractive",
                    "vi": "hấp dẫn tình dục"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "extremely fit or healthy",
                    "vi": "cực kỳ phù hợp hoặc khỏe mạnh"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "in very good physical condition",
                    "vi": "trong tình trạng thể chất rất tốt"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "(of an institution, a system, a thing, etc.) suitable for the function or purpose that it was designed for",
                    "vi": "(của một tổ chức, một hệ thống, một thứ, v.v.) phù hợp với chức năng hoặc mục đích mà nó được thiết kế cho"
                },
                "examples": [
                    {
                        "en": "The minister argued that the education system wasn’t fit for purpose.",
                        "vi": "Bộ trưởng lập luận rằng hệ thống giáo dục không phù hợp với mục đích."
                    },
                    {
                        "en": "The new executive flats are fully equipped and fit for purpose.",
                        "vi": "Các căn hộ điều hành mới được trang bị đầy đủ và phù hợp với mục đích."
                    },
                    {
                        "en": "I returned the goods as they weren’t fit for purpose.",
                        "vi": "Tôi đã trả lại hàng hóa vì chúng không phù hợp với mục đích."
                    }
                ]
            },
            {
                "define": {
                    "en": "to consider it right or acceptable to do something; to decide or choose to do something",
                    "vi": "để xem xét nó là đúng hoặc được chấp nhận để làm một cái gì đó; để quyết định hoặc chọn làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "You must do as you think fit (= but I don't agree with your decision).",
                        "vi": "Bạn phải làm như bạn nghĩ là phù hợp (= nhưng tôi không đồng ý với quyết định của bạn)."
                    },
                    {
                        "en": "The newspaper did not see fit to publish my letter (= and I criticize it for that).",
                        "vi": "Tờ báo không thấy phù hợp để đăng bức thư của tôi (= và tôi chỉ trích vì điều đó)."
                    }
                ]
            },
            {
                "define": {
                    "en": "the principle that only the people or things that are best adapted to their environment will continue to exist",
                    "vi": "nguyên tắc chỉ những người hoặc những thứ thích nghi tốt nhất với môi trường của họ mới tiếp tục tồn tại"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "e16d8a12038348ed92afe213389414c9",
        "word": "weight",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/weɪt/",
            "us": "/weɪt/"
        },
        "nearby": [
            {
                "word": "weigh on",
                "pos": "phrasal verb"
            },
            {
                "word": "weigh out",
                "pos": "phrasal verb"
            },
            {
                "word": "weight",
                "pos": "noun"
            },
            {
                "word": "weight",
                "pos": "verb"
            },
            {
                "word": "weight belt",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "how heavy somebody/something is, which can be measured in, for example, kilograms or pounds",
                    "vi": "ai đó / cái gì đó nặng bao nhiêu, có thể được đo bằng đơn vị, ví dụ: kilôgam hoặc pound"
                },
                "examples": [
                    {
                        "en": "in weight It is about 76 kilos in weight.",
                        "vi": "về trọng lượng Nó có trọng lượng khoảng 76 kg."
                    },
                    {
                        "en": "by weight Bananas are sold by weight.",
                        "vi": "theo trọng lượng Chuối được bán theo trọng lượng."
                    },
                    {
                        "en": "weight of… In the wild, this fish can reach a weight of 5lbs.",
                        "vi": "trọng lượng của… Trong tự nhiên, loài cá này có thể đạt trọng lượng 5lbs."
                    },
                    {
                        "en": "She is trying to lose weight (= become less heavy and less fat).",
                        "vi": "Cô ấy đang cố gắng giảm cân (= bớt nặng hơn và bớt béo hơn)."
                    },
                    {
                        "en": "He’s put on/gained weight (= become heavier and fatter) since he gave up smoking.",
                        "vi": "Anh ấy đã gầy đi / tăng cân (= trở nên nặng hơn và béo hơn) kể từ khi anh ấy từ bỏ hút thuốc."
                    },
                    {
                        "en": "No more for me. I have to watch my weight.",
                        "vi": "Không còn cho tôi nữa. Tôi phải xem cân nặng của mình."
                    },
                    {
                        "en": "He has now shed the extra weight.",
                        "vi": "Bây giờ anh ấy đã giảm cân."
                    },
                    {
                        "en": "Body fat increases rapidly as body weight increases.",
                        "vi": "Lượng mỡ trong cơ thể tăng nhanh khi trọng lượng cơ thể tăng lên."
                    },
                    {
                        "en": "The point is to achieve permanent weight loss.",
                        "vi": "Mục đích là để giảm cân vĩnh viễn."
                    },
                    {
                        "en": "Stress can cause weight gain.",
                        "vi": "Căng thẳng có thể gây tăng cân."
                    },
                    {
                        "en": "Sam has a weight problem (= is too fat).",
                        "vi": "Sam có vấn đề về cân nặng (= quá béo)."
                    }
                ]
            },
            {
                "define": {
                    "en": "the fact of being heavy",
                    "vi": "thực tế là nặng nề"
                },
                "examples": [
                    {
                        "en": "weight of somebody/something The pillars have to support the weight of the roof.",
                        "vi": "trọng lượng của ai đó / cái gì đó Các cột trụ phải hỗ trợ trọng lượng của mái nhà."
                    },
                    {
                        "en": "I just hoped the branch would take my weight.",
                        "vi": "Tôi chỉ hy vọng cành sẽ giảm cân cho tôi."
                    },
                    {
                        "en": "under the weight He staggered a little under the weight of his backpack.",
                        "vi": "dưới sức nặng Anh loạng choạng một chút dưới sức nặng của ba lô."
                    },
                    {
                        "en": "The table collapsed under their weight.",
                        "vi": "Bàn bị sụp xuống dưới sức nặng của họ."
                    },
                    {
                        "en": "Don't put any weight on that ankle for at least a week.",
                        "vi": "Không đặt bất kỳ trọng lượng nào lên mắt cá chân đó trong ít nhất một tuần."
                    }
                ]
            },
            {
                "define": {
                    "en": "an object that is heavy",
                    "vi": "một vật nặng"
                },
                "examples": [
                    {
                        "en": "The doctor said he should not lift heavy weights.",
                        "vi": "Bác sĩ nói không nên nâng tạ nặng."
                    },
                    {
                        "en": "Heavy weights should be lifted with a straight back.",
                        "vi": "- Nên nâng tạ nặng với tư thế thẳng lưng."
                    },
                    {
                        "en": "Consider adding weight training and aerobic exercises to your routine.",
                        "vi": "Cân nhắc thêm các bài tập tạ và bài tập aerobic vào thói quen của bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "an object used to keep something in position or as part of a machine",
                    "vi": "một đối tượng được sử dụng để giữ một cái gì đó ở vị trí hoặc như một bộ phận của máy móc"
                },
                "examples": [
                    {
                        "en": "weights on a fishing line",
                        "vi": "trọng lượng trên một dây câu"
                    }
                ]
            },
            {
                "define": {
                    "en": "a great responsibility or worry",
                    "vi": "một trách nhiệm lớn hoặc lo lắng"
                },
                "examples": [
                    {
                        "en": "The full weight of responsibility falls on her.",
                        "vi": "Toàn bộ trách nhiệm đổ lên đầu cô ấy."
                    },
                    {
                        "en": "The news was certainly a weight off my mind (= I did not have to worry about it any more).",
                        "vi": "Tin tức đó chắc chắn là một trọng lượng lớn đối với tâm trí của tôi (= Tôi không phải lo lắng về nó nữa)."
                    },
                    {
                        "en": "Finally telling the truth was a great weight off my shoulders.",
                        "vi": "Cuối cùng thì việc nói ra sự thật là một sức nặng đè nặng lên vai tôi."
                    },
                    {
                        "en": "He was buckling under the weight of his responsibilities.",
                        "vi": "Anh ấy đang oằn mình dưới sức nặng của những trách nhiệm của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "importance, influence or strength",
                    "vi": "tầm quan trọng, ảnh hưởng hoặc sức mạnh"
                },
                "examples": [
                    {
                        "en": "The many letters of support added weight to the campaign.",
                        "vi": "Nhiều lá thư ủng hộ đã tăng thêm sức nặng cho chiến dịch."
                    },
                    {
                        "en": "The President has now offered to lend his weight to the project.",
                        "vi": "Tổng thống hiện đã đề nghị cho vay nặng lãi của mình đối với dự án."
                    },
                    {
                        "en": "Your opinion carries weight with the boss.",
                        "vi": "Ý kiến của bạn có sức nặng với sếp."
                    },
                    {
                        "en": "How can you ignore the sheer weight of medical opinion?",
                        "vi": "Làm thế nào bạn có thể bỏ qua trọng lượng tuyệt đối của ý kiến y tế?"
                    },
                    {
                        "en": "The weight of evidence against her is overwhelming.",
                        "vi": "Sức nặng của bằng chứng chống lại cô ấy là quá lớn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a unit or system of units by which weight is measured",
                    "vi": "một đơn vị hoặc hệ thống các đơn vị đo trọng lượng"
                },
                "examples": [
                    {
                        "en": "tables of weights and measures",
                        "vi": "bảng trọng lượng và thước đo"
                    },
                    {
                        "en": "imperial/metric weight",
                        "vi": "trọng lượng theo hệ đo lường Anh / hệ mét"
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of metal that is known to weigh a particular amount and is used to measure the weight of something, or lifted by people to improve their strength and as a sport",
                    "vi": "một mảnh kim loại được biết là có trọng lượng cụ thể và được sử dụng để đo trọng lượng của vật gì đó hoặc được người ta nâng lên để cải thiện sức mạnh của họ và như một môn thể thao"
                },
                "examples": [
                    {
                        "en": "a set of weights",
                        "vi": "một bộ trọng lượng"
                    },
                    {
                        "en": "a light/heavy weight",
                        "vi": "trọng lượng nhẹ / nặng"
                    },
                    {
                        "en": "She lifts weights as part of her training.",
                        "vi": "Cô ấy nâng tạ như một phần của quá trình tập luyện của mình."
                    },
                    {
                        "en": "He does a lot of weight training.",
                        "vi": "Anh ấy tập tạ rất nhiều."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have influence with somebody",
                    "vi": "có ảnh hưởng với ai đó"
                },
                "examples": [
                    {
                        "en": "My views don't carry much weight with the boss.",
                        "vi": "Quan điểm của tôi không có nhiều sức nặng với ông chủ."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that there is too much of something",
                    "vi": "từng nói rằng có quá nhiều thứ"
                },
                "examples": [
                    {
                        "en": "The table groaned under the weight of the biggest buffet they had ever seen.",
                        "vi": "Chiếc bàn rên rỉ dưới sức nặng của bữa tiệc buffet lớn nhất mà họ từng thấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to work as hard as everyone else in a job, an activity, etc.",
                    "vi": "làm việc chăm chỉ như mọi người trong một công việc, một hoạt động, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be or try to be more successful than others in doing something that normally requires more skill, experience, money, etc. than you have",
                    "vi": "để trở thành hoặc cố gắng thành công hơn những người khác khi làm một điều gì đó thường đòi hỏi nhiều kỹ năng, kinh nghiệm, tiền bạc, v.v. hơn bạn có"
                },
                "examples": [
                    {
                        "en": "This player seems to be able to constantly punch above his weight.",
                        "vi": "Cầu thủ này dường như có thể liên tục đấm vượt quá trọng lượng của mình."
                    },
                    {
                        "en": "He punched above his weight as the party’s foreign affairs spokesman.",
                        "vi": "Anh ta đã đấm trên trọng lượng của mình với tư cách là phát ngôn viên đối ngoại của đảng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to sit down and rest, especially when you are tired",
                    "vi": "ngồi xuống và nghỉ ngơi, đặc biệt là khi bạn mệt mỏi"
                },
                "examples": [
                    {
                        "en": "Come and sit down and take the weight off your feet for a while.",
                        "vi": "Hãy đến và ngồi xuống và lấy tạ ra khỏi chân của bạn một lúc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to use your position of authority or power in an aggressive way in order to achieve what you want",
                    "vi": "sử dụng vị trí quyền lực hoặc quyền lực của bạn một cách tích cực để đạt được những gì bạn muốn"
                },
                "examples": [
                    {
                        "en": "She was a good manager, who didn’t find it necessary to throw her weight around.",
                        "vi": "Cô ấy là một người quản lý tốt, người không thấy cần thiết phải xoay xở cân nặng của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to use all your influence and power to support something",
                    "vi": "sử dụng tất cả ảnh hưởng và sức mạnh của bạn để hỗ trợ một cái gì đó"
                },
                "examples": [
                    {
                        "en": "The government has thrown its weight behind the anti-pollution campaign.",
                        "vi": "Chính phủ đã bỏ trọng lượng của mình đằng sau chiến dịch chống ô nhiễm."
                    }
                ]
            },
            {
                "define": {
                    "en": "the combined power, strength or influence of a group",
                    "vi": "sức mạnh tổng hợp, sức mạnh hoặc ảnh hưởng của một nhóm"
                },
                "examples": [
                    {
                        "en": "They won the argument by sheer weight of numbers.",
                        "vi": "Họ đã thắng trong cuộc tranh luận bởi trọng lượng tuyệt đối của các con số."
                    }
                ]
            },
            {
                "define": {
                    "en": "very useful or valuable",
                    "vi": "rất hữu ích hoặc có giá trị"
                },
                "examples": [
                    {
                        "en": "A good mechanic is worth his weight in gold.",
                        "vi": "Một người thợ giỏi đáng giá bằng vàng."
                    }
                ]
            }
        ]
    },
    {
        "id": "aae0feb075964d69abb7f962f4e1d32e",
        "word": "fitness",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈfɪtnəs/",
            "us": "/ˈfɪtnəs/"
        },
        "nearby": [
            {
                "word": "fit into",
                "pos": "phrasal verb"
            },
            {
                "word": "fitment",
                "pos": "noun"
            },
            {
                "word": "fitness",
                "pos": "noun"
            },
            {
                "word": "fitness centre",
                "pos": "noun"
            },
            {
                "word": "fitness tracker",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the state of being physically healthy and strong",
                    "vi": "tình trạng thể chất khỏe mạnh và mạnh mẽ"
                },
                "examples": [
                    {
                        "en": "a magazine on health and fitness",
                        "vi": "tạp chí về sức khỏe và thể dục"
                    },
                    {
                        "en": "He is a qualified fitness instructor.",
                        "vi": "Anh ấy là một huấn luyện viên thể hình có trình độ."
                    },
                    {
                        "en": "She works as a personal fitness trainer.",
                        "vi": "Cô ấy làm việc như một huấn luyện viên thể dục cá nhân."
                    },
                    {
                        "en": "The player failed a fitness test this week.",
                        "vi": "Cầu thủ này đã thất bại trong một bài kiểm tra thể lực trong tuần này."
                    },
                    {
                        "en": "The club runs several fitness classes.",
                        "vi": "Câu lạc bộ tổ chức một số lớp học thể dục."
                    },
                    {
                        "en": "My brother has always been a fitness fanatic.",
                        "vi": "Anh trai tôi luôn là một người đam mê thể dục."
                    },
                    {
                        "en": "I follow a daily fitness routine.",
                        "vi": "Tôi tuân theo một thói quen thể dục hàng ngày."
                    },
                    {
                        "en": "a high level of physical fitness",
                        "vi": "mức độ thể chất cao"
                    }
                ]
            },
            {
                "define": {
                    "en": "the state of being suitable or good enough for something",
                    "vi": "trạng thái phù hợp hoặc đủ tốt cho một cái gì đó"
                },
                "examples": [
                    {
                        "en": "fitness for something He convinced us of his fitness for the task.",
                        "vi": "thể lực cho một cái gì đó Anh ấy thuyết phục chúng tôi về thể lực của anh ấy cho nhiệm vụ."
                    },
                    {
                        "en": "fitness to do something There were doubts about her fitness to hold office.",
                        "vi": "thể dục để làm một cái gì đó Có nghi ngờ về thể lực của cô ấy để giữ chức vụ."
                    }
                ]
            }
        ]
    },
    {
        "id": "27676816ca2e47ec8f68b634d5fbf67a",
        "word": "heart rate",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈhɑːt reɪt/",
            "us": "/ˈhɑːrt reɪt/"
        },
        "nearby": [
            {
                "word": "Heart of Oak",
                "pos": ""
            },
            {
                "word": "heart of palm",
                "pos": "noun"
            },
            {
                "word": "heart rate",
                "pos": "noun"
            },
            {
                "word": "heart-rending",
                "pos": "adjective"
            },
            {
                "word": "heart-searching",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "how fast your heart is beating",
                    "vi": "tim bạn đập nhanh như thế nào"
                },
                "examples": [
                    {
                        "en": "Before the examination, each patient's heart rate was measured.",
                        "vi": "Trước khi khám, nhịp tim của từng bệnh nhân được đo."
                    }
                ]
            }
        ]
    },
    {
        "id": "09b08c4500d842ba8828aab5956c7504",
        "word": "strength",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/streŋkθ/",
            "us": "/streŋkθ/"
        },
        "nearby": [
            {
                "word": "streetwear",
                "pos": "noun"
            },
            {
                "word": "streetwise",
                "pos": "adjective"
            },
            {
                "word": "strength",
                "pos": "noun"
            },
            {
                "word": "strengthen",
                "pos": "verb"
            },
            {
                "word": "strenuous",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the quality of being physically strong",
                    "vi": "phẩm chất của thể chất mạnh mẽ"
                },
                "examples": [
                    {
                        "en": "He pushed against the rock with all his strength.",
                        "vi": "Anh dùng hết sức chống lại tảng đá."
                    },
                    {
                        "en": "It may take a few weeks for you to build up your strength again.",
                        "vi": "Có thể mất một vài tuần để bạn xây dựng lại sức mạnh của mình."
                    },
                    {
                        "en": "She gradually regained strength in her legs.",
                        "vi": "Cô dần lấy lại sức ở chân."
                    },
                    {
                        "en": "He had a physical strength that matched his outward appearance.",
                        "vi": "Anh ta có một sức mạnh thể chất phù hợp với hình dáng bên ngoài của anh ta."
                    },
                    {
                        "en": "strength to do something She didn't have the strength to walk any further.",
                        "vi": "sức mạnh để làm điều gì đó Cô không còn sức để bước đi nữa."
                    }
                ]
            },
            {
                "define": {
                    "en": "the ability that something has to resist force or hold heavy weights without breaking or being damaged",
                    "vi": "khả năng mà một cái gì đó có khả năng chống lại lực hoặc giữ vật nặng mà không bị vỡ hoặc bị hư hỏng"
                },
                "examples": [
                    {
                        "en": "the strength of a rope",
                        "vi": "sức mạnh của một sợi dây"
                    },
                    {
                        "en": "The panels are reinforced with steel for extra strength.",
                        "vi": "Các tấm được gia cố bằng thép để tăng thêm độ bền."
                    }
                ]
            },
            {
                "define": {
                    "en": "the quality of being brave and determined in a difficult situation",
                    "vi": "phẩm chất dũng cảm và kiên định trong hoàn cảnh khó khăn"
                },
                "examples": [
                    {
                        "en": "During this ordeal he was able to draw strength from his faith.",
                        "vi": "Trong thử thách này, anh đã có thể rút ra sức mạnh từ đức tin của mình."
                    },
                    {
                        "en": "She has a remarkable inner strength.",
                        "vi": "Cô ấy có một sức mạnh nội tâm đáng nể."
                    },
                    {
                        "en": "You have shown great strength of character.",
                        "vi": "Bạn đã thể hiện sức mạnh tuyệt vời của nhân vật."
                    }
                ]
            },
            {
                "define": {
                    "en": "the power and influence that somebody/something has",
                    "vi": "sức mạnh và ảnh hưởng mà ai đó / cái gì đó có"
                },
                "examples": [
                    {
                        "en": "Political power depends upon economic strength.",
                        "vi": "Quyền lực chính trị phụ thuộc vào sức mạnh kinh tế."
                    },
                    {
                        "en": "Their superior military strength gives them a huge advantage.",
                        "vi": "Sức mạnh quân sự vượt trội của họ mang lại cho họ một lợi thế rất lớn."
                    },
                    {
                        "en": "to negotiate from a position of strength",
                        "vi": "đàm phán từ một vị thế mạnh"
                    },
                    {
                        "en": "The rally was intended to be a show of strength by the socialists.",
                        "vi": "Cuộc biểu tình nhằm thể hiện sức mạnh của những người theo chủ nghĩa xã hội."
                    }
                ]
            },
            {
                "define": {
                    "en": "how strong or deeply felt an opinion or a feeling is",
                    "vi": "một ý kiến hoặc một cảm giác mạnh mẽ hoặc sâu sắc như thế nào"
                },
                "examples": [
                    {
                        "en": "the strength of public opinion",
                        "vi": "sức mạnh của dư luận"
                    },
                    {
                        "en": "This view has recently gathered strength (= become stronger or more widely held).",
                        "vi": "Quan điểm này gần đây đã tập hợp sức mạnh (= trở nên mạnh mẽ hơn hoặc được tổ chức rộng rãi hơn)."
                    },
                    {
                        "en": "I was surprised by the strength of her feelings.",
                        "vi": "Tôi đã rất ngạc nhiên trước sức mạnh của tình cảm của cô ấy."
                    },
                    {
                        "en": "I have been overwhelmed by the strength of feeling that people have about this issue.",
                        "vi": "Tôi đã bị choáng ngợp bởi sức mạnh của cảm giác mà mọi người có về vấn đề này."
                    }
                ]
            },
            {
                "define": {
                    "en": "a quality or an ability that a person or thing has that gives them an advantage",
                    "vi": "phẩm chất hoặc khả năng mà một người hoặc một vật có mang lại lợi thế cho họ"
                },
                "examples": [
                    {
                        "en": "The ability to keep calm is one of her many strengths.",
                        "vi": "Khả năng giữ bình tĩnh là một trong những điểm mạnh của cô."
                    },
                    {
                        "en": "the strengths and weaknesses of an argument",
                        "vi": "điểm mạnh và điểm yếu của một lập luận"
                    },
                    {
                        "en": "The new weapon's strength lies in its accuracy.",
                        "vi": "Điểm mạnh của vũ khí mới nằm ở độ chính xác của nó."
                    }
                ]
            },
            {
                "define": {
                    "en": "how strong a natural force or a signal is",
                    "vi": "một lực tự nhiên hoặc một tín hiệu mạnh như thế nào"
                },
                "examples": [
                    {
                        "en": "the strength of the sun",
                        "vi": "sức mạnh của mặt trời"
                    },
                    {
                        "en": "wind strength",
                        "vi": "sức gió"
                    },
                    {
                        "en": "the strength and direction of the tide",
                        "vi": "sức mạnh và hướng của thủy triều"
                    },
                    {
                        "en": "The phone company aims to improve signal strength within buildings.",
                        "vi": "Công ty điện thoại đặt mục tiêu cải thiện cường độ tín hiệu trong các tòa nhà."
                    }
                ]
            },
            {
                "define": {
                    "en": "how strong a particular taste or substance is",
                    "vi": "hương vị hoặc chất cụ thể mạnh như thế nào"
                },
                "examples": [
                    {
                        "en": "Add more curry powder depending on the strength required.",
                        "vi": "Cho thêm bột cà ri tùy theo độ đậm đà yêu cầu."
                    },
                    {
                        "en": "a range of beers with different strengths (= with different amounts of alcohol in them)",
                        "vi": "một loạt các loại bia với các độ mạnh khác nhau (= với lượng cồn khác nhau trong đó)"
                    },
                    {
                        "en": "a packet of double-strength mints",
                        "vi": "một gói bạc hà cường độ gấp đôi"
                    },
                    {
                        "en": "These wines vary in strength between 11° and 15°.",
                        "vi": "Các loại rượu này có độ mạnh khác nhau trong khoảng từ 11 ° đến 15 °."
                    }
                ]
            },
            {
                "define": {
                    "en": "how strong a country’s currency is in relation to other countries’ currencies",
                    "vi": "tiền tệ của một quốc gia mạnh như thế nào so với tiền tệ của các quốc gia khác"
                },
                "examples": [
                    {
                        "en": "the relative strength of the euro against the dollar",
                        "vi": "sức mạnh tương đối của đồng euro so với đồng đô la"
                    },
                    {
                        "en": "The euro has continued to gain strength.",
                        "vi": "Đồng euro tiếp tục tăng giá."
                    },
                    {
                        "en": "the continuing strength of the pound",
                        "vi": "sức mạnh tiếp tục của đồng bảng Anh"
                    }
                ]
            },
            {
                "define": {
                    "en": "the number of people in a group, a team or an organization",
                    "vi": "số lượng người trong một nhóm, một đội hoặc một tổ chức"
                },
                "examples": [
                    {
                        "en": "The strength of the workforce is about to be doubled from 3 000 to 6 000.",
                        "vi": "Sức mạnh của lực lượng lao động sắp được tăng gấp đôi từ 3 000 lên 6 000."
                    },
                    {
                        "en": "The team will be back at full strength (= with all the best players) for the next match.",
                        "vi": "Đội sẽ trở lại đầy đủ sức mạnh (= với tất cả các cầu thủ tốt nhất) cho trận đấu tiếp theo."
                    },
                    {
                        "en": "up to strength The Korean team was not up to strength for the final.",
                        "vi": "sức mạnh Đội tuyển Hàn Quốc không có đủ sức mạnh cho trận chung kết."
                    },
                    {
                        "en": "in strength The protesters turned out in strength (= in large numbers).",
                        "vi": "sức mạnh Những người biểu tình đã trở nên mạnh mẽ (= với số lượng lớn)."
                    },
                    {
                        "en": "under/below strength These cuts have left the local police force under strength (= with fewer members than it needs).",
                        "vi": "dưới / dưới sức mạnh Những cắt giảm này đã khiến lực lượng cảnh sát địa phương trở nên thiếu sức mạnh (= với số lượng thành viên ít hơn mức cần thiết)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to become more and more successful",
                    "vi": "để ngày càng thành công hơn"
                },
                "examples": [
                    {
                        "en": "Since her appointment the department has gone from strength to strength.",
                        "vi": "Kể từ khi cô ấy được bổ nhiệm, bộ phận đã đi từ sức mạnh này sang sức mạnh khác."
                    }
                ]
            },
            {
                "define": {
                    "en": "because somebody has been influenced or persuaded by something",
                    "vi": "bởi vì ai đó đã bị ảnh hưởng hoặc bị thuyết phục bởi một cái gì đó"
                },
                "examples": [
                    {
                        "en": "I got the job on the strength of your recommendation.",
                        "vi": "Tôi đã nhận được công việc dựa trên lời giới thiệu của bạn."
                    },
                    {
                        "en": "She hopes to secure a recording contract on the strength of these songs.",
                        "vi": "Cô hy vọng sẽ đạt được hợp đồng thu âm dựa trên sức mạnh của những bài hát này."
                    }
                ]
            },
            {
                "define": {
                    "en": "the quality of being strong because you have a great variety of good people, ideas, etc. that can contribute to the success of something",
                    "vi": "phẩm chất của sự mạnh mẽ bởi vì bạn có rất nhiều người tốt, ý tưởng, v.v. có thể đóng góp vào sự thành công của điều gì đó"
                },
                "examples": [
                    {
                        "en": "The French team does not have the strength in depth that the Australians have.",
                        "vi": "Đội tuyển Pháp không có thế mạnh về chiều sâu như đội tuyển Úc."
                    }
                ]
            },
            {
                "define": {
                    "en": "being in a group gives you more power",
                    "vi": "ở trong một nhóm mang lại cho bạn nhiều quyền lực hơn"
                },
                "examples": [
                    {
                        "en": "There's strength in numbers, so encourage your friends and family to join us.",
                        "vi": "Có sức mạnh về số lượng, vì vậy hãy khuyến khích bạn bè và gia đình của bạn tham gia cùng chúng tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person that you can rely on to help, protect and comfort you when you are in trouble",
                    "vi": "một người mà bạn có thể dựa vào để giúp đỡ, bảo vệ và an ủi bạn khi bạn gặp khó khăn"
                },
                "examples": [
                    {
                        "en": "He was a tower of strength to his sisters when their father died.",
                        "vi": "Anh ấy là ngọn tháp sức mạnh cho các chị gái của mình khi cha của họ qua đời."
                    }
                ]
            }
        ]
    },
    {
        "id": "90d39fe483e6400eaef5b33d5da5f5e1",
        "word": "heartbeat",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈhɑːtbiːt/",
            "us": "/ˈhɑːrtbiːt/"
        },
        "nearby": [
            {
                "word": "heartache",
                "pos": "noun"
            },
            {
                "word": "heart attack",
                "pos": "noun"
            },
            {
                "word": "heartbeat",
                "pos": "noun"
            },
            {
                "word": "heartbreak",
                "pos": "noun"
            },
            {
                "word": "heartbreaking",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the movement or sound of the heart as it sends blood around the body",
                    "vi": "chuyển động hoặc âm thanh của trái tim khi nó đưa máu đi khắp cơ thể"
                },
                "examples": [
                    {
                        "en": "a rapid/regular heartbeat",
                        "vi": "nhịp tim nhanh / đều"
                    },
                    {
                        "en": "She was suddenly aware of her racing heartbeat.",
                        "vi": "Cô đột nhiên nhận thức được nhịp tim đang đập của mình."
                    },
                    {
                        "en": "The first track on the album begins with the sound of a heartbeat.",
                        "vi": "Bài hát đầu tiên trong album bắt đầu bằng âm thanh của nhịp tim."
                    },
                    {
                        "en": "Her heartbeats steadied.",
                        "vi": "Nhịp tim của cô ấy ổn định lại."
                    }
                ]
            },
            {
                "define": {
                    "en": "an important feature of something, that is responsible for making it what it is",
                    "vi": "một tính năng quan trọng của một cái gì đó, chịu trách nhiệm biến nó thành"
                },
                "examples": [
                    {
                        "en": "The candidate said that he understood the heartbeat of the Hispanic community in California.",
                        "vi": "Ứng cử viên nói rằng anh hiểu nhịp tim của cộng đồng người gốc Tây Ban Nha ở California."
                    }
                ]
            },
            {
                "define": {
                    "en": "very close to something",
                    "vi": "rất gần với một cái gì đó"
                },
                "examples": [
                    {
                        "en": "Her game is just a heartbeat away from perfection.",
                        "vi": "Trò chơi của cô ấy chỉ cách sự hoàn hảo trong tích tắc."
                    }
                ]
            },
            {
                "define": {
                    "en": "very quickly, without thinking about it",
                    "vi": "rất nhanh chóng, không cần suy nghĩ về nó"
                },
                "examples": [
                    {
                        "en": "If I was offered another job, I'd leave in a heartbeat.",
                        "vi": "Nếu tôi được đề nghị một công việc khác, tôi sẽ rời đi trong tích tắc."
                    }
                ]
            }
        ]
    },
    {
        "id": "db5a3d3db10741eb9a81f1b169054311",
        "word": "immune",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/ɪˈmjuːn/",
            "us": "/ɪˈmjuːn/"
        },
        "nearby": [
            {
                "word": "immortalize",
                "pos": "verb"
            },
            {
                "word": "immovable",
                "pos": "adjective"
            },
            {
                "word": "immune",
                "pos": "adjective"
            },
            {
                "word": "immune response",
                "pos": "noun"
            },
            {
                "word": "immune system",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "that cannot catch or be affected by a particular disease or illness",
                    "vi": "không thể mắc phải hoặc bị ảnh hưởng bởi một căn bệnh hoặc bệnh tật cụ thể"
                },
                "examples": [
                    {
                        "en": "Adults are often immune to German measles.",
                        "vi": "Người lớn thường được miễn dịch với bệnh sởi Đức."
                    }
                ]
            },
            {
                "define": {
                    "en": "not affected by something, especially something that you might expect to be harmful",
                    "vi": "không bị ảnh hưởng bởi điều gì đó, đặc biệt là thứ mà bạn có thể cho là có hại"
                },
                "examples": [
                    {
                        "en": "You'll eventually become immune to criticism.",
                        "vi": "Cuối cùng bạn sẽ trở nên miễn nhiễm với những lời chỉ trích."
                    },
                    {
                        "en": "Few men are immune to her charms.",
                        "vi": "Rất ít đàn ông miễn nhiễm với sự quyến rũ của cô ấy."
                    },
                    {
                        "en": "Our business is far from immune to economic conditions.",
                        "vi": "Công việc kinh doanh của chúng tôi còn lâu mới miễn nhiễm với các điều kiện kinh tế."
                    }
                ]
            },
            {
                "define": {
                    "en": "protected from something and therefore able to avoid it",
                    "vi": "được bảo vệ khỏi một cái gì đó và do đó có thể tránh nó"
                },
                "examples": [
                    {
                        "en": "No one should be immune from prosecution.",
                        "vi": "Không ai được miễn truy tố."
                    },
                    {
                        "en": "Not even the President’s wife was immune from criticism by the press.",
                        "vi": "Ngay cả phu nhân của Tổng thống cũng không tránh khỏi những lời chỉ trích của báo chí."
                    }
                ]
            }
        ]
    },
    {
        "id": "96fba0e2e76643ef96fd4830091bba77",
        "word": "rested",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈrestɪd/",
            "us": "/ˈrestɪd/"
        },
        "nearby": [
            {
                "word": "restaurateur",
                "pos": "noun"
            },
            {
                "word": "rest cure",
                "pos": "noun"
            },
            {
                "word": "rested",
                "pos": "adjective"
            },
            {
                "word": "restful",
                "pos": "adjective"
            },
            {
                "word": "rest home",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "feeling healthy and full of energy because you have had a rest",
                    "vi": "cảm thấy khỏe mạnh và tràn đầy năng lượng vì bạn đã được nghỉ ngơi"
                },
                "examples": [
                    {
                        "en": "I awoke feeling rested and refreshed.",
                        "vi": "Tôi thức dậy với cảm giác thư thái và sảng khoái."
                    }
                ]
            }
        ]
    },
    {
        "id": "c01ac5b5b0bc4321862e99d401f2af68",
        "word": "self-care",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˌself ˈkeə(r)/",
            "us": "/ˌself ˈker/"
        },
        "nearby": [
            {
                "word": "self-awareness",
                "pos": "noun"
            },
            {
                "word": "self-build",
                "pos": "noun"
            },
            {
                "word": "self-care",
                "pos": "noun"
            },
            {
                "word": "self-catering",
                "pos": "adjective"
            },
            {
                "word": "self-catering",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act of caring for yourself, for example by eating and sleeping well, taking exercise and getting help so that you do not become ill",
                    "vi": "hành động chăm sóc cho bản thân, chẳng hạn bằng cách ăn và ngủ tốt, tập thể dục và nhận được sự giúp đỡ để bạn không bị ốm"
                },
                "examples": [
                    {
                        "en": "I'm a 30-year-old workaholic who has never prioritized self-care.",
                        "vi": "Tôi là một người nghiện công việc 30 tuổi, chưa bao giờ ưu tiên việc chăm sóc bản thân."
                    }
                ]
            }
        ]
    },
    {
        "id": "e41b5eb76b434dbc96e1c403dddd94d3",
        "word": "strengthen",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈstreŋkθn/",
            "us": "/ˈstreŋkθn/"
        },
        "nearby": [
            {
                "word": "streetwise",
                "pos": "adjective"
            },
            {
                "word": "strength",
                "pos": "noun"
            },
            {
                "word": "strengthen",
                "pos": "verb"
            },
            {
                "word": "strenuous",
                "pos": "adjective"
            },
            {
                "word": "strenuously",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to become more powerful or effective; to make somebody/something more powerful or effective",
                    "vi": "để trở nên mạnh mẽ hơn hoặc hiệu quả hơn; để làm cho ai đó / thứ gì đó mạnh mẽ hơn hoặc hiệu quả hơn"
                },
                "examples": [
                    {
                        "en": "Her position in the party has strengthened in recent weeks.",
                        "vi": "Vị trí của bà trong đảng đã được củng cố trong những tuần gần đây."
                    },
                    {
                        "en": "strengthen somebody/something The move is clearly intended to strengthen the president's position as head of state.",
                        "vi": "củng cố ai đó / cái gì đó Động thái này rõ ràng là nhằm củng cố vị trí nguyên thủ quốc gia của tổng thống."
                    },
                    {
                        "en": "The new evidence will strengthen their case.",
                        "vi": "Bằng chứng mới sẽ củng cố trường hợp của họ."
                    },
                    {
                        "en": "The new manager has strengthened the side by bringing in several younger players.",
                        "vi": "Người quản lý mới đã củng cố đội bóng bằng cách mang về một số cầu thủ trẻ hơn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to become physically stronger",
                    "vi": "để trở nên mạnh mẽ hơn về thể chất"
                },
                "examples": [
                    {
                        "en": "The exercises are designed to strengthen your stomach muscles.",
                        "vi": "Các bài tập được thiết kế để tăng cường cơ bụng của bạn."
                    },
                    {
                        "en": "Repairs are necessary to strengthen the bridge.",
                        "vi": "Việc sửa chữa là cần thiết để tăng cường sức mạnh cho cây cầu."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make a feeling, an opinion or a relationship stronger; to become stronger",
                    "vi": "để làm cho một cảm giác, một ý kiến hoặc một mối quan hệ mạnh mẽ hơn; trở nên mạnh mẽ hơn"
                },
                "examples": [
                    {
                        "en": "This temporary setback merely strengthened her resolve.",
                        "vi": "Sự thất bại tạm thời này chỉ đơn thuần củng cố quyết tâm của cô ấy."
                    },
                    {
                        "en": "Their attitude only strengthened his resolve to fight on.",
                        "vi": "Thái độ của họ chỉ củng cố quyết tâm chiến đấu của anh ta."
                    },
                    {
                        "en": "The experience of bereavement can strengthen family ties.",
                        "vi": "Trải nghiệm về sự mất mát có thể củng cố mối quan hệ gia đình."
                    },
                    {
                        "en": "His determination only strengthened in the face of this opposition.",
                        "vi": "Quyết tâm của ông chỉ được củng cố khi đối mặt với sự chống đối này."
                    }
                ]
            },
            {
                "define": {
                    "en": "to become stronger",
                    "vi": "trở nên mạnh mẽ hơn"
                },
                "examples": [
                    {
                        "en": "The wind had strengthened overnight.",
                        "vi": "Gió đã mạnh lên qua đêm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to become stronger; to make a currency or an economy stronger",
                    "vi": "để trở nên mạnh mẽ hơn; để làm cho tiền tệ hoặc một nền kinh tế mạnh hơn"
                },
                "examples": [
                    {
                        "en": "strengthen (against something) Yesterday the pound strengthened against the dollar.",
                        "vi": "củng cố (chống lại điều gì đó) Hôm qua đồng bảng Anh đã mạnh lên so với đồng đô la."
                    },
                    {
                        "en": "The fall in unemployment is a sign of a strengthening economy.",
                        "vi": "Tỷ lệ thất nghiệp giảm là dấu hiệu của một nền kinh tế đang mạnh lên."
                    },
                    {
                        "en": "strengthen something The measures should help create jobs and strengthen the economy.",
                        "vi": "củng cố một cái gì đó Các biện pháp sẽ giúp tạo việc làm và củng cố nền kinh tế."
                    }
                ]
            }
        ]
    },
    {
        "id": "cc5bae357ed04e1f9a32e3129bf6661b",
        "word": "blossom",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈblɒsəm/",
            "us": "/ˈblɑːsəm/"
        },
        "nearby": [
            {
                "word": "blooper",
                "pos": "noun"
            },
            {
                "word": "blossom",
                "pos": "noun"
            },
            {
                "word": "blossom",
                "pos": "verb"
            },
            {
                "word": "blot",
                "pos": "verb"
            },
            {
                "word": "blot",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to produce blossom",
                    "vi": "để tạo ra hoa"
                },
                "examples": [
                    {
                        "en": "The cherry trees blossomed early this year.",
                        "vi": "Những cây anh đào năm nay đã nở hoa sớm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to become more healthy, confident or successful",
                    "vi": "để trở nên khỏe mạnh, tự tin hoặc thành công hơn"
                },
                "examples": [
                    {
                        "en": "She has visibly blossomed over the last few months.",
                        "vi": "Cô ấy đã nở rộ rõ rệt trong vài tháng qua."
                    },
                    {
                        "en": "blossom into something Their friendship blossomed into love.",
                        "vi": "nở rộ thành cái gì đó Tình bạn của họ nảy nở thành tình yêu."
                    }
                ]
            }
        ]
    },
    {
        "id": "675699c29695472bb161f436c41da2fe",
        "word": "circulation",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌsɜːkjəˈleɪʃn/",
            "us": "/ˌsɜːrkjəˈleɪʃn/"
        },
        "nearby": [
            {
                "word": "circular saw",
                "pos": "noun"
            },
            {
                "word": "circulate",
                "pos": "verb"
            },
            {
                "word": "circulation",
                "pos": "noun"
            },
            {
                "word": "circulatory",
                "pos": "adjective"
            },
            {
                "word": "circum-",
                "pos": "prefix"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the movement of blood around the body",
                    "vi": "sự di chuyển của máu xung quanh cơ thể"
                },
                "examples": [
                    {
                        "en": "Regular exercise will improve blood circulation.",
                        "vi": "Tập thể dục thường xuyên sẽ cải thiện lưu thông máu."
                    },
                    {
                        "en": "to have good/bad circulation",
                        "vi": "lưu thông tốt / xấu"
                    }
                ]
            },
            {
                "define": {
                    "en": "the passing or spreading of something from one person or place to another",
                    "vi": "sự truyền hoặc lan truyền của một cái gì đó từ người này sang nơi khác"
                },
                "examples": [
                    {
                        "en": "the circulation of money/information/ideas",
                        "vi": "sự lưu thông của tiền / thông tin / ý tưởng"
                    },
                    {
                        "en": "in circulation A number of forged tickets are in circulation.",
                        "vi": "đang lưu hành Một số vé giả đang được lưu hành."
                    },
                    {
                        "en": "The coins were taken out of circulation.",
                        "vi": "Các đồng tiền đã được đưa ra khỏi lưu thông."
                    },
                    {
                        "en": "Copies of the magazine were withdrawn from circulation.",
                        "vi": "Các bản sao của tạp chí đã bị rút khỏi lưu hành."
                    },
                    {
                        "en": "putting computer viruses into circulation",
                        "vi": "đưa vi rút máy tính vào lưu hành"
                    }
                ]
            },
            {
                "define": {
                    "en": "the usual number of copies of a newspaper or magazine that are sold each day, week, etc.",
                    "vi": "số lượng bản sao thông thường của một tờ báo hoặc tạp chí được bán mỗi ngày, hàng tuần, v.v."
                },
                "examples": [
                    {
                        "en": "a daily circulation of more than one million",
                        "vi": "số lượng phát hành hàng ngày hơn một triệu"
                    },
                    {
                        "en": "The newspaper has a daily circulation of 20 000.",
                        "vi": "Tờ báo có số lượng phát hành hàng ngày là 20 000."
                    }
                ]
            },
            {
                "define": {
                    "en": "the movement of something (for example air, water, gas, etc.) around an area or inside a system or machine",
                    "vi": "chuyển động của một thứ gì đó (ví dụ như không khí, nước, khí, v.v.) xung quanh một khu vực hoặc bên trong một hệ thống hoặc máy móc"
                },
                "examples": [
                    {
                        "en": "Poor air circulation can cause condensation.",
                        "vi": "Không khí lưu thông kém có thể gây ra ngưng tụ."
                    }
                ]
            },
            {
                "define": {
                    "en": "the fact that somebody takes part in social activities at a particular time",
                    "vi": "thực tế là ai đó tham gia vào các hoạt động xã hội tại một thời điểm cụ thể"
                },
                "examples": [
                    {
                        "en": "in circulation Anne has been ill but now she's back in circulation.",
                        "vi": "Đang lưu hành Anne đã bị bệnh nhưng bây giờ cô ấy đã trở lại bình thường."
                    },
                    {
                        "en": "out of circulation I was out of circulation for months after the baby was born.",
                        "vi": "tôi đã bị mất tuần hoàn trong nhiều tháng sau khi đứa trẻ được sinh ra."
                    }
                ]
            }
        ]
    },
    {
        "id": "afd597ef6f784224a573cc27bdb4f5a9",
        "word": "flourish",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈflʌrɪʃ/",
            "us": "/ˈflɜːrɪʃ/"
        },
        "nearby": [
            {
                "word": "flour",
                "pos": "noun"
            },
            {
                "word": "flour",
                "pos": "verb"
            },
            {
                "word": "flourish",
                "pos": "verb"
            },
            {
                "word": "flourish",
                "pos": "noun"
            },
            {
                "word": "floury",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to develop quickly and become successful or common",
                    "vi": "để phát triển nhanh chóng và trở nên thành công hoặc phổ biến"
                },
                "examples": [
                    {
                        "en": "Few businesses are flourishing in the present economic climate.",
                        "vi": "Rất ít doanh nghiệp đang phát triển mạnh mẽ trong bối cảnh kinh tế hiện nay."
                    },
                    {
                        "en": "The arts began to flourish at that time.",
                        "vi": "Các môn nghệ thuật bắt đầu phát triển mạnh mẽ vào thời điểm đó."
                    },
                    {
                        "en": "There was a flourishing black market.",
                        "vi": "Có một thị trường chợ đen phát triển mạnh mẽ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to grow well; to be healthy and happy",
                    "vi": "để phát triển tốt; để được khỏe mạnh và hạnh phúc"
                },
                "examples": [
                    {
                        "en": "These plants flourish in a damp climate.",
                        "vi": "Những loài thực vật này phát triển mạnh mẽ trong khí hậu ẩm ướt."
                    },
                    {
                        "en": "(especially British English) I'm glad to hear you're all flourishing.",
                        "vi": "(đặc biệt là tiếng Anh Anh) Tôi rất vui khi biết rằng tất cả các bạn đều đang phát triển."
                    },
                    {
                        "en": "I hope the grandchildren are flourishing.",
                        "vi": "Tôi mong con đàn cháu đống."
                    }
                ]
            },
            {
                "define": {
                    "en": "to wave something around in a way that makes people look at it",
                    "vi": "vẫy một cái gì đó xung quanh theo cách khiến mọi người nhìn vào nó"
                },
                "examples": [
                    {
                        "en": "He rushed into the room flourishing the newspaper.",
                        "vi": "Anh lao vào phòng hưng thịnh tờ báo."
                    }
                ]
            }
        ]
    },
    {
        "id": "fdad25431efb4e64bcd5e6526556a341",
        "word": "form",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/fɔːm/",
            "us": "/fɔːrm/"
        },
        "nearby": [
            {
                "word": "forlorn",
                "pos": "adjective"
            },
            {
                "word": "forlornly",
                "pos": "adverb"
            },
            {
                "word": "form",
                "pos": "noun"
            },
            {
                "word": "form",
                "pos": "verb"
            },
            {
                "word": "formal",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a type or variety of something",
                    "vi": "một loại hoặc nhiều thứ gì đó"
                },
                "examples": [
                    {
                        "en": "all the millions of different life forms on the planet today",
                        "vi": "tất cả hàng triệu dạng sống khác nhau trên hành tinh ngày nay"
                    },
                    {
                        "en": "form of something forms of transport/government/entertainment",
                        "vi": "hình thức của một cái gì đó hình thức vận tải / chính phủ / giải trí"
                    },
                    {
                        "en": "one of the most common forms of cancer",
                        "vi": "một trong những dạng ung thư phổ biến nhất"
                    },
                    {
                        "en": "Swimming is one of the best forms of exercise.",
                        "vi": "Bơi lội là một trong những hình thức tập thể dục tốt nhất."
                    },
                    {
                        "en": "Along with talking and singing, drawing must be the oldest form of communication.",
                        "vi": "Cùng với nói và hát, vẽ phải là hình thức giao tiếp lâu đời nhất."
                    }
                ]
            },
            {
                "define": {
                    "en": "a way of writing or saying a word that shows, for example, if it is plural or in a particular tense",
                    "vi": "một cách viết hoặc nói một từ cho thấy, ví dụ, nếu nó là số nhiều hoặc ở một thì cụ thể"
                },
                "examples": [
                    {
                        "en": "the infinitive form of the verb",
                        "vi": "dạng nguyên thể của động từ"
                    }
                ]
            },
            {
                "define": {
                    "en": "the particular way something is, seems, looks or is presented",
                    "vi": "cách cụ thể một cái gì đó, có vẻ như, trông hoặc được trình bày"
                },
                "examples": [
                    {
                        "en": "The disease can take several different forms.",
                        "vi": "Bệnh có thể có nhiều dạng khác nhau."
                    },
                    {
                        "en": "The training programme takes the form of a series of workshops.",
                        "vi": "Chương trình đào tạo dưới hình thức một chuỗi hội thảo."
                    },
                    {
                        "en": "We need to come to some form of agreement.",
                        "vi": "Chúng ta cần đi đến một số hình thức thỏa thuận."
                    },
                    {
                        "en": "in the form of somebody/something Help in the form of money will be very welcome.",
                        "vi": "dưới hình thức ai đó / cái gì đó Trợ giúp dưới hình thức tiền sẽ rất được hoan nghênh."
                    },
                    {
                        "en": "Help arrived in the form of two police officers.",
                        "vi": "Hai nhân viên cảnh sát đến giúp đỡ."
                    },
                    {
                        "en": "in… form Most political questions involve morality in some form or other.",
                        "vi": "ở… hình thức Hầu hết các câu hỏi chính trị liên quan đến đạo đức dưới hình thức này hay hình thức khác."
                    },
                    {
                        "en": "We prefer applications in electronic form.",
                        "vi": "Chúng tôi thích các ứng dụng dưới dạng điện tử."
                    },
                    {
                        "en": "Many collections of his cartoons appeared in book form.",
                        "vi": "Nhiều bộ sưu tập phim hoạt hình của ông đã xuất hiện dưới dạng sách."
                    },
                    {
                        "en": "Success can come in many forms.",
                        "vi": "Thành công có thể đến dưới nhiều hình thức."
                    },
                    {
                        "en": "I'm opposed to censorship in any shape or form.",
                        "vi": "Tôi phản đối việc kiểm duyệt dưới mọi hình thức."
                    }
                ]
            },
            {
                "define": {
                    "en": "an official document containing questions and spaces for answers",
                    "vi": "một tài liệu chính thức chứa các câu hỏi và không gian cho câu trả lời"
                },
                "examples": [
                    {
                        "en": "an application/entry/order form",
                        "vi": "một đơn đăng ký / đơn đăng ký / đơn đặt hàng"
                    },
                    {
                        "en": "(especially British English) to fill in a form",
                        "vi": "(đặc biệt là tiếng Anh Anh) để điền vào biểu mẫu"
                    },
                    {
                        "en": "(especially North American English) to fill out a form",
                        "vi": "(đặc biệt là tiếng Anh Bắc Mỹ) để điền vào biểu mẫu"
                    },
                    {
                        "en": "I filled in/out a form on their website.",
                        "vi": "Tôi đã điền / điền vào một biểu mẫu trên trang web của họ."
                    },
                    {
                        "en": "to complete a form",
                        "vi": "để hoàn thành một biểu mẫu"
                    },
                    {
                        "en": "We asked them to read and sign consent forms.",
                        "vi": "Chúng tôi đã yêu cầu họ đọc và ký vào các mẫu đơn đồng ý."
                    },
                    {
                        "en": "(British English) a booking form",
                        "vi": "(Tiếng Anh Anh) một mẫu đặt phòng"
                    },
                    {
                        "en": "(North American English) a reservation form",
                        "vi": "(Tiếng Anh Bắc Mỹ) một biểu mẫu đặt trước"
                    }
                ]
            },
            {
                "define": {
                    "en": "the shape of somebody/something; a person or thing of which only the shape can be seen",
                    "vi": "hình dạng của ai đó / cái gì đó; một người hoặc một vật chỉ có thể nhìn thấy hình dạng"
                },
                "examples": [
                    {
                        "en": "The human form has changed little over the last 30 000 years.",
                        "vi": "Hình dạng con người đã thay đổi rất ít trong 30 000 năm qua."
                    },
                    {
                        "en": "Two weeks later the moth will emerge in its adult form.",
                        "vi": "Hai tuần sau, bướm đêm sẽ xuất hiện ở dạng trưởng thành."
                    },
                    {
                        "en": "They made out a shadowy form in front of them.",
                        "vi": "Họ làm ra một hình dạng mờ mịt trước mặt họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "the arrangement of parts in a whole, especially in a work of art or piece of writing",
                    "vi": "sự sắp xếp của các bộ phận trong một tổng thể, đặc biệt là trong một tác phẩm nghệ thuật hoặc một tác phẩm viết"
                },
                "examples": [
                    {
                        "en": "Shape and form are of greater importance to me than colour.",
                        "vi": "Hình dạng và hình thức quan trọng đối với tôi hơn màu sắc."
                    },
                    {
                        "en": "In a novel, form and content are equally important.",
                        "vi": "Trong một cuốn tiểu thuyết, hình thức và nội dung đều quan trọng như nhau."
                    }
                ]
            },
            {
                "define": {
                    "en": "how fit and healthy somebody is; the state of being fit and healthy",
                    "vi": "ai đó phù hợp và khỏe mạnh như thế nào; trạng thái khỏe mạnh"
                },
                "examples": [
                    {
                        "en": "in… form After six months' training the whole team is in superb form.",
                        "vi": "ở… hình thức Sau sáu tháng tập luyện, toàn đội đang có phong độ tuyệt vời."
                    },
                    {
                        "en": "in form I really need to get back in form.",
                        "vi": "về hình thức, tôi thực sự cần lấy lại phong độ."
                    },
                    {
                        "en": "out of form The horse was clearly out of form.",
                        "vi": "ngoài hình thức Con ngựa rõ ràng là không hình thức."
                    }
                ]
            },
            {
                "define": {
                    "en": "how well somebody/something is performing; the fact that somebody/something is performing well",
                    "vi": "ai đó / cái gì đó đang hoạt động tốt như thế nào; thực tế là ai đó / cái gì đó đang hoạt động tốt"
                },
                "examples": [
                    {
                        "en": "Midfielder Elliott has shown disappointing form recently.",
                        "vi": "Trung vệ Elliott thể hiện phong độ đáng thất vọng trong thời gian gần đây."
                    },
                    {
                        "en": "She signalled her return to form with a convincing victory.",
                        "vi": "Cô báo hiệu sự trở lại phong độ bằng một chiến thắng thuyết phục."
                    },
                    {
                        "en": "on form (British English) He's right on form (= performing well) as a crazy science teacher in his latest movie.",
                        "vi": "về hình thức (tiếng Anh Anh) Anh ấy đúng về hình thức (= hoạt động tốt) với vai một giáo viên khoa học điên rồ trong bộ phim mới nhất của anh ấy."
                    },
                    {
                        "en": "on… form The whole team was on good form and deserved the win.",
                        "vi": "trên… hình thức Toàn đội đã có phong độ tốt và xứng đáng giành chiến thắng."
                    },
                    {
                        "en": "On current/present form the party is heading for another election victory.",
                        "vi": "Ở hình thức hiện tại / hiện tại, đảng đang hướng tới một chiến thắng trong cuộc bầu cử khác."
                    },
                    {
                        "en": "in… form She was in great form (= happy and cheerful and full of energy) at the wedding party.",
                        "vi": "ở… hình thức Cô ấy có phong độ tuyệt vời (= vui vẻ, sảng khoái và tràn đầy năng lượng) tại bữa tiệc cưới."
                    }
                ]
            },
            {
                "define": {
                    "en": "the usual way of doing something",
                    "vi": "cách thông thường để làm một cái gì đó"
                },
                "examples": [
                    {
                        "en": "What's the form when you apply for a research grant?",
                        "vi": "Biểu mẫu khi bạn xin tài trợ nghiên cứu là gì?"
                    },
                    {
                        "en": "conventional social forms",
                        "vi": "các hình thức xã hội thông thường"
                    },
                    {
                        "en": "True to form (= as he usually does) he arrived an hour late.",
                        "vi": "Đúng như hình thức (= như anh ấy thường làm) anh ấy đến muộn một tiếng đồng hồ."
                    },
                    {
                        "en": "Partners of employees are invited as a matter of form (= because that is the usual way things are done).",
                        "vi": "Đối tác của nhân viên được mời như một vấn đề về hình thức (= bởi vì đó là cách thông thường được thực hiện)."
                    }
                ]
            },
            {
                "define": {
                    "en": "the way of doing things that is socially acceptable/not socially acceptable",
                    "vi": "cách làm những việc được xã hội chấp nhận / không được xã hội chấp nhận"
                },
                "examples": [
                    {
                        "en": "When I was a boy it was always considered bad form to talk about food or money.",
                        "vi": "Khi tôi còn là một cậu bé, nói về thức ăn hoặc tiền bạc luôn bị coi là hình thức xấu."
                    },
                    {
                        "en": "Good form dictated that she should dress more casually in the country.",
                        "vi": "Hình thức tốt khiến cô ấy nên ăn mặc giản dị hơn khi ở trong nước."
                    }
                ]
            },
            {
                "define": {
                    "en": "a class in a school",
                    "vi": "một lớp học trong một trường học"
                },
                "examples": [
                    {
                        "en": "Who's your form teacher?",
                        "vi": "Giáo viên dạy mẫu của bạn là ai?"
                    }
                ]
            },
            {
                "define": {
                    "en": "a student in the form mentioned at school",
                    "vi": "một học sinh trong hình thức được đề cập ở trường"
                },
                "examples": [
                    {
                        "en": "a third-former",
                        "vi": "người thứ ba"
                    }
                ]
            },
            {
                "define": {
                    "en": "of any type",
                    "vi": "thuộc bất kỳ loại nào"
                },
                "examples": [
                    {
                        "en": "I don't approve of violence in any shape or form.",
                        "vi": "Tôi không chấp nhận bạo lực dưới mọi hình thức."
                    },
                    {
                        "en": "I can't stand insects in any shape or form.",
                        "vi": "Tôi không thể chịu được côn trùng dưới bất kỳ hình dạng hay hình thức nào."
                    },
                    {
                        "en": "I do not condone bullying in any way, shape or form.",
                        "vi": "Tôi không dung túng cho việc bắt nạt dưới bất kỳ hình thức, hình thức nào."
                    }
                ]
            },
            {
                "define": {
                    "en": "to gradually form into a particular shape; to gradually develop",
                    "vi": "để dần dần hình thành một hình dạng cụ thể; để dần dần phát triển"
                },
                "examples": [
                    {
                        "en": "In her body a new life was taking form.",
                        "vi": "Trong cơ thể cô, một sự sống mới đang hình thành."
                    }
                ]
            }
        ]
    },
    {
        "id": "ea235d9707124d1dbf9200c0ef1041d7",
        "word": "immunity",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ɪˈmjuːnəti/",
            "us": "/ɪˈmjuːnəti/"
        },
        "nearby": [
            {
                "word": "immune response",
                "pos": "noun"
            },
            {
                "word": "immune system",
                "pos": "noun"
            },
            {
                "word": "immunity",
                "pos": "noun"
            },
            {
                "word": "immunization",
                "pos": "noun"
            },
            {
                "word": "immunize",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the body’s ability to avoid or not be affected by infection and disease",
                    "vi": "khả năng của cơ thể để tránh hoặc không bị ảnh hưởng bởi nhiễm trùng và bệnh tật"
                },
                "examples": [
                    {
                        "en": "immunity (to something) immunity to infection",
                        "vi": "miễn dịch (với một cái gì đó) miễn nhiễm với nhiễm trùng"
                    },
                    {
                        "en": "immunity against something The vaccine provides longer immunity against flu.",
                        "vi": "khả năng miễn dịch chống lại thứ gì đó Vắc xin cung cấp khả năng miễn dịch lâu hơn chống lại bệnh cúm."
                    }
                ]
            },
            {
                "define": {
                    "en": "the state of not being affected by something, especially something that you might expect to be harmful",
                    "vi": "trạng thái không bị ảnh hưởng bởi điều gì đó, đặc biệt là điều gì đó mà bạn có thể cho là có hại"
                },
                "examples": [
                    {
                        "en": "the president's seeming immunity to criticism",
                        "vi": "tổng thống dường như miễn nhiễm với những lời chỉ trích"
                    }
                ]
            },
            {
                "define": {
                    "en": "the state of being protected from something",
                    "vi": "trạng thái được bảo vệ khỏi một cái gì đó"
                },
                "examples": [
                    {
                        "en": "The spies were all granted immunity from prosecution.",
                        "vi": "Các điệp viên đều được miễn truy tố."
                    },
                    {
                        "en": "parliamentary/congressional immunity (= protection against particular laws that is given to politicians)",
                        "vi": "quyền miễn trừ của quốc hội / quốc hội (= bảo vệ chống lại các luật cụ thể dành cho các chính trị gia)"
                    },
                    {
                        "en": "Officials of all member states receive certain privileges and immunities.",
                        "vi": "Các quan chức của tất cả các quốc gia thành viên nhận được những đặc quyền và miễn trừ nhất định."
                    }
                ]
            }
        ]
    },
    {
        "id": "dceee7e0a35e4d5b8b4b78565543f98a",
        "word": "resistance",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/rɪˈzɪstəns/",
            "us": "/rɪˈzɪstəns/"
        },
        "nearby": [
            {
                "word": "resinous",
                "pos": "adjective"
            },
            {
                "word": "resist",
                "pos": "verb"
            },
            {
                "word": "resistance",
                "pos": "noun"
            },
            {
                "word": "resistant",
                "pos": "adjective"
            },
            {
                "word": "resister",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "dislike of or opposition to a plan, an idea, etc.; the act of refusing to obey",
                    "vi": "không thích hoặc phản đối một kế hoạch, một ý tưởng, v.v.; hành động từ chối tuân theo"
                },
                "examples": [
                    {
                        "en": "As with all new ideas it met with resistance.",
                        "vi": "Như với tất cả những ý tưởng mới, nó vấp phải sự phản kháng."
                    },
                    {
                        "en": "resistance to somebody/something There has been a lot of resistance to this new law.",
                        "vi": "kháng cự với ai đó / điều gì đó Đã có rất nhiều sự phản đối đối với luật mới này."
                    },
                    {
                        "en": "Resistance to change has nearly destroyed the industry.",
                        "vi": "Sự phản kháng lại sự thay đổi đã gần như phá hủy ngành công nghiệp này."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of using force to oppose somebody/something",
                    "vi": "hành động sử dụng vũ lực để chống lại ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "There were a number of episodes of armed resistance during the early years of occupation.",
                        "vi": "Có một số cuộc kháng chiến vũ trang trong những năm đầu bị chiếm đóng."
                    },
                    {
                        "en": "The defenders put up a strong resistance.",
                        "vi": "Các hậu vệ đã đưa ra một sự kháng cự mạnh mẽ."
                    },
                    {
                        "en": "resistance to somebody/something The demonstrators offered little or no resistance to the police.",
                        "vi": "kháng cự với ai đó / điều gì đó Người biểu tình đề nghị ít hoặc không chống lại cảnh sát."
                    }
                ]
            },
            {
                "define": {
                    "en": "the power not to be affected by something",
                    "vi": "sức mạnh không bị ảnh hưởng bởi một cái gì đó"
                },
                "examples": [
                    {
                        "en": "AIDS lowers the body's resistance to infection.",
                        "vi": "AIDS làm giảm sức đề kháng của cơ thể đối với nhiễm trùng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a force that stops something moving or makes it move more slowly",
                    "vi": "một lực ngăn một thứ gì đó chuyển động hoặc làm cho nó chuyển động chậm hơn"
                },
                "examples": [
                    {
                        "en": "wind/air resistance (= in the design of planes or cars)",
                        "vi": "sức cản của gió / không khí (= trong thiết kế máy bay hoặc ô tô)"
                    }
                ]
            },
            {
                "define": {
                    "en": "the opposition of a substance or device to the flow of an electrical current",
                    "vi": "sự đối lập của một chất hoặc thiết bị với dòng điện"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a secret organization that resists the authorities, especially in a country that an enemy has control of",
                    "vi": "một tổ chức bí mật chống lại chính quyền, đặc biệt là ở một quốc gia mà kẻ thù nắm quyền kiểm soát"
                },
                "examples": [
                    {
                        "en": "resistance fighters",
                        "vi": "người kháng chiến"
                    }
                ]
            },
            {
                "define": {
                    "en": "(to choose, etc.) the easiest way of doing something",
                    "vi": "(để lựa chọn, v.v.) cách dễ nhất để làm điều gì đó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "ebfafaa9f43b462ba436010255bce3b5",
        "word": "resistant",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/rɪˈzɪstənt/",
            "us": "/rɪˈzɪstənt/"
        },
        "nearby": [
            {
                "word": "resist",
                "pos": "verb"
            },
            {
                "word": "resistance",
                "pos": "noun"
            },
            {
                "word": "resistant",
                "pos": "adjective"
            },
            {
                "word": "resister",
                "pos": "noun"
            },
            {
                "word": "resistible",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "not affected by something; able to resist something",
                    "vi": "không bị ảnh hưởng bởi điều gì đó; có thể chống lại một cái gì đó"
                },
                "examples": [
                    {
                        "en": "plants that are resistant to disease",
                        "vi": "cây kháng bệnh"
                    },
                    {
                        "en": "Mosquitoes are becoming resistant to insecticides.",
                        "vi": "Muỗi đang trở nên kháng thuốc diệt côn trùng."
                    }
                ]
            },
            {
                "define": {
                    "en": "opposing something and trying to stop it happening",
                    "vi": "phản đối điều gì đó và cố gắng ngăn chặn nó xảy ra"
                },
                "examples": [
                    {
                        "en": "Elderly people are not always resistant to change.",
                        "vi": "Người cao tuổi không phải lúc nào cũng có khả năng chống lại sự thay đổi."
                    }
                ]
            },
            {
                "define": {
                    "en": "not damaged by the thing mentioned",
                    "vi": "không bị hư hỏng bởi điều được đề cập"
                },
                "examples": [
                    {
                        "en": "disease-resistant plants",
                        "vi": "cây kháng bệnh"
                    },
                    {
                        "en": "fire-resistant materials",
                        "vi": "vật liệu chống cháy"
                    }
                ]
            }
        ]
    },
    {
        "id": "734bf1c31de9410da1452bdd20a70f4c",
        "word": "robust",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/rəʊˈbʌst/",
            "us": "/rəʊˈbʌst/"
        },
        "nearby": [
            {
                "word": "Rob Roy",
                "pos": ""
            },
            {
                "word": "Bobby Robson",
                "pos": ""
            },
            {
                "word": "robust",
                "pos": "adjective"
            },
            {
                "word": "robustly",
                "pos": "adverb"
            },
            {
                "word": "robustness",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "strong and healthy",
                    "vi": "mạnh mẽ và khỏe mạnh"
                },
                "examples": [
                    {
                        "en": "She was almost 90, but still very robust.",
                        "vi": "Bà đã gần 90 nhưng vẫn còn rất tráng kiện."
                    },
                    {
                        "en": "He seems to be in robust (good) health.",
                        "vi": "Anh ta dường như có một sức khỏe dồi dào (tốt)."
                    }
                ]
            },
            {
                "define": {
                    "en": "strong; able to survive being used a lot and not likely to break",
                    "vi": "mạnh; có thể tồn tại được sử dụng nhiều và không có khả năng bị hỏng"
                },
                "examples": [
                    {
                        "en": "a robust piece of equipment",
                        "vi": "một thiết bị mạnh mẽ"
                    }
                ]
            },
            {
                "define": {
                    "en": "strong and not likely to fail or become weak",
                    "vi": "mạnh mẽ và không có khả năng thất bại hoặc trở nên yếu ớt"
                },
                "examples": [
                    {
                        "en": "robust economic growth",
                        "vi": "tăng trưởng kinh tế mạnh mẽ"
                    }
                ]
            },
            {
                "define": {
                    "en": "strong and determined; showing that you are sure about what you are doing or saying",
                    "vi": "mạnh mẽ và quyết tâm; cho thấy rằng bạn chắc chắn về những gì bạn đang làm hoặc nói"
                },
                "examples": [
                    {
                        "en": "The company is taking a more robust approach to management.",
                        "vi": "Công ty đang áp dụng một cách tiếp cận mạnh mẽ hơn để quản lý."
                    }
                ]
            }
        ]
    },
    {
        "id": "c1daf5290ca043d09bc12d6504bff45e",
        "word": "thrive",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/θraɪv/",
            "us": "/θraɪv/"
        },
        "nearby": [
            {
                "word": "thrill ride",
                "pos": "noun"
            },
            {
                "word": "thrill to",
                "pos": "phrasal verb"
            },
            {
                "word": "thrive",
                "pos": "verb"
            },
            {
                "word": "thrive on",
                "pos": "phrasal verb"
            },
            {
                "word": "thriving",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to become, and continue to be, successful, strong, healthy, etc.",
                    "vi": "để trở thành, và tiếp tục, thành công, mạnh mẽ, khỏe mạnh, v.v."
                },
                "examples": [
                    {
                        "en": "New businesses thrive in this area.",
                        "vi": "Các doanh nghiệp mới phát triển mạnh trong lĩnh vực này."
                    },
                    {
                        "en": "These animals rarely thrive in captivity.",
                        "vi": "Những loài động vật này hiếm khi phát triển mạnh trong điều kiện nuôi nhốt."
                    }
                ]
            }
        ]
    },
    {
        "id": "70774811970e44df80f395e6c8497b9c",
        "word": "thrive on",
        "pos": "phrasal verb",
        "level": "c1",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "thrill to",
                "pos": "phrasal verb"
            },
            {
                "word": "thrive",
                "pos": "verb"
            },
            {
                "word": "thrive on",
                "pos": "phrasal verb"
            },
            {
                "word": "thriving",
                "pos": "adjective"
            },
            {
                "word": "throat",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to enjoy something or be successful at something, especially something that other people would not like",
                    "vi": "để tận hưởng điều gì đó hoặc thành công ở điều gì đó, đặc biệt là điều gì đó mà người khác không muốn"
                },
                "examples": [
                    {
                        "en": "He thrives on hard work.",
                        "vi": "Anh ấy phát đạt nhờ làm việc chăm chỉ."
                    },
                    {
                        "en": "She seems to thrive on stress.",
                        "vi": "Cô ấy dường như phát triển mạnh vì căng thẳng."
                    }
                ]
            }
        ]
    },
    {
        "id": "860aa56182cc4d0cbc8203ab5db39aa4",
        "word": "thriving",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈθraɪvɪŋ/",
            "us": "/ˈθraɪvɪŋ/"
        },
        "nearby": [
            {
                "word": "thrive",
                "pos": "verb"
            },
            {
                "word": "thrive on",
                "pos": "phrasal verb"
            },
            {
                "word": "thriving",
                "pos": "adjective"
            },
            {
                "word": "throat",
                "pos": "noun"
            },
            {
                "word": "throatily",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "continuing to be successful, strong, healthy, etc.",
                    "vi": "tiếp tục thành công, mạnh mẽ, khỏe mạnh, v.v."
                },
                "examples": [
                    {
                        "en": "a thriving industry",
                        "vi": "một ngành công nghiệp phát triển mạnh"
                    }
                ]
            }
        ]
    },
    {
        "id": "fd88d741d12d4493a5f1cd753fd686f8",
        "word": "a/one hundred per cent",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈhʌndrəd/",
            "us": "/ˈhʌndrəd/"
        },
        "nearby": [
            {
                "word": "hunchbacked",
                "pos": "adjective"
            },
            {
                "word": "hunched",
                "pos": "adjective"
            },
            {
                "word": "hundred",
                "pos": "number"
            },
            {
                "word": "hundreds and thousands",
                "pos": "noun"
            },
            {
                "word": "hundredth",
                "pos": "ordinal number"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "100",
                    "vi": "100"
                },
                "examples": [
                    {
                        "en": "One hundred (of the children) have already been placed with foster families.",
                        "vi": "Một trăm (trong số trẻ em) đã được đặt cho các gia đình nuôi dưỡng."
                    },
                    {
                        "en": "There were just a hundred of them there.",
                        "vi": "Chỉ có một trăm người trong số họ ở đó."
                    },
                    {
                        "en": "This vase is worth several hundred dollars.",
                        "vi": "Chiếc bình này trị giá vài trăm đô la."
                    },
                    {
                        "en": "She must be over a hundred (= a hundred years old).",
                        "vi": "Cô ấy phải hơn một trăm (= một trăm tuổi)."
                    },
                    {
                        "en": "Hundreds of thousands of people are at risk.",
                        "vi": "Hàng trăm nghìn người đang gặp rủi ro."
                    },
                    {
                        "en": "a hundred-year lease",
                        "vi": "hợp đồng thuê hàng trăm năm"
                    }
                ]
            },
            {
                "define": {
                    "en": "a large amount",
                    "vi": "một số lượng lớn"
                },
                "examples": [
                    {
                        "en": "hundreds of miles away",
                        "vi": "hàng trăm dặm"
                    },
                    {
                        "en": "for hundreds of years",
                        "vi": "hàng trăm năm"
                    },
                    {
                        "en": "If I've said it once, I've said it a hundred times.",
                        "vi": "Nếu tôi đã nói một lần, tôi đã nói cả trăm lần."
                    },
                    {
                        "en": "I have a hundred and one things to do.",
                        "vi": "Tôi có một trăm lẻ một việc phải làm."
                    },
                    {
                        "en": "(formal) Men died in their hundreds.",
                        "vi": "(chính thức) Đàn ông chết hàng trăm."
                    }
                ]
            },
            {
                "define": {
                    "en": "the numbers from 100 to 999",
                    "vi": "các số từ 100 đến 999"
                },
                "examples": [
                    {
                        "en": "We're talking about a figure in the low hundreds.",
                        "vi": "Chúng ta đang nói về một con số trong hàng trăm thấp."
                    }
                ]
            },
            {
                "define": {
                    "en": "the years of a particular century",
                    "vi": "những năm của một thế kỷ cụ thể"
                },
                "examples": [
                    {
                        "en": "the early nineteen hundreds (= written ‘early 1900s’)",
                        "vi": "đầu những năm mười chín hàng trăm (= được viết là 'đầu những năm 1900')"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to express whole hours in the 24-hour system",
                    "vi": "được sử dụng để biểu thị cả giờ trong hệ thống 24 giờ"
                },
                "examples": [
                    {
                        "en": "twelve hundred hours (= 12.00 midday)",
                        "vi": "mười hai trăm giờ (= 12 giờ trưa)"
                    }
                ]
            },
            {
                "define": {
                    "en": "to put as much effort into something as you can; to give even more effort than could be expected",
                    "vi": "nỗ lực hết sức vào việc gì đó mà bạn có thể; nỗ lực nhiều hơn những gì có thể mong đợi"
                },
                "examples": [
                    {
                        "en": "Every player gave a hundred per cent tonight.",
                        "vi": "Mỗi người chơi đã cho một trăm phần trăm tối nay."
                    }
                ]
            },
            {
                "define": {
                    "en": "in every way",
                    "vi": "trong mỗi cách"
                },
                "examples": [
                    {
                        "en": "I'm not a hundred per cent sure.",
                        "vi": "Tôi không chắc một trăm phần trăm."
                    },
                    {
                        "en": "My family supports me one hundred per cent.",
                        "vi": "Gia đình tôi ủng hộ tôi một trăm phần trăm."
                    }
                ]
            },
            {
                "define": {
                    "en": "completely fit and healthy",
                    "vi": "hoàn toàn phù hợp và khỏe mạnh"
                },
                "examples": [
                    {
                        "en": "I still don't feel a hundred per cent.",
                        "vi": "Tôi vẫn không cảm thấy một trăm phần trăm."
                    }
                ]
            },
            {
                "define": {
                    "en": "almost always",
                    "vi": "gần như luôn luôn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "536e480f85fe411ea1632401497eff42",
        "word": "able-bodied",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌeɪbl ˈbɒdid/",
            "us": "/ˌeɪbl ˈbɑːdid/"
        },
        "nearby": [
            {
                "word": "able",
                "pos": "adjective"
            },
            {
                "word": "-able",
                "pos": "suffix"
            },
            {
                "word": "able-bodied",
                "pos": "adjective"
            },
            {
                "word": "ableism",
                "pos": "noun"
            },
            {
                "word": "able seaman",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "physically healthy, fit and strong in contrast to somebody who is weak or disabled",
                    "vi": "thể chất khỏe mạnh, cân đối và mạnh mẽ trái ngược với một số người yếu ớt hoặc tàn tật"
                },
                "examples": [
                    {
                        "en": "Military service is compulsory for every able-bodied male between 18 and 27.",
                        "vi": "Nghĩa vụ quân sự là bắt buộc đối với mọi nam giới từ 18 đến 27 tuổi."
                    },
                    {
                        "en": "Disabled and able-bodied children can enrol on the athletics course.",
                        "vi": "Trẻ em khuyết tật và có thể trạng có thể đăng ký tham gia khóa học điền kinh."
                    }
                ]
            }
        ]
    },
    {
        "id": "995f2180627b4fe1bb5ce770e3efd398",
        "word": "alive and kicking",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/əˈlaɪv/",
            "us": "/əˈlaɪv/"
        },
        "nearby": [
            {
                "word": "Alistair",
                "pos": ""
            },
            {
                "word": "A-lister",
                "pos": "noun"
            },
            {
                "word": "alive",
                "pos": "adjective"
            },
            {
                "word": "alkali",
                "pos": "noun"
            },
            {
                "word": "alkaline",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "living; not dead",
                    "vi": "cuộc sống; không chết"
                },
                "examples": [
                    {
                        "en": "Is your mother still alive?",
                        "vi": "Mẹ của bạn vẫn còn sống?"
                    },
                    {
                        "en": "Doctors kept the baby alive for six weeks.",
                        "vi": "Các bác sĩ đã giữ cho đứa bé sống được trong sáu tuần."
                    },
                    {
                        "en": "She had to steal food just to stay alive.",
                        "vi": "Cô phải ăn trộm thức ăn chỉ để sống sót."
                    },
                    {
                        "en": "He was buried alive in the earthquake.",
                        "vi": "Anh ta đã bị chôn sống trong trận động đất."
                    },
                    {
                        "en": "The police are desperate to catch this man dead or alive.",
                        "vi": "Cảnh sát đang ráo riết bắt sống người đàn ông này."
                    },
                    {
                        "en": "We don't know whether he's alive or dead.",
                        "vi": "Chúng tôi không biết liệu anh ta còn sống hay đã chết."
                    }
                ]
            },
            {
                "define": {
                    "en": "full of emotion, excitement, activity, etc.",
                    "vi": "đầy cảm xúc, phấn khích, hoạt động, v.v."
                },
                "examples": [
                    {
                        "en": "Ed was alive with happiness.",
                        "vi": "Ed đã sống trong hạnh phúc."
                    },
                    {
                        "en": "Her eyes were alive with interest.",
                        "vi": "Đôi mắt cô ấy sống động với sự thích thú."
                    }
                ]
            },
            {
                "define": {
                    "en": "continuing to exist",
                    "vi": "tiếp tục tồn tại"
                },
                "examples": [
                    {
                        "en": "to keep a tradition alive",
                        "vi": "để giữ cho một truyền thống tồn tại"
                    },
                    {
                        "en": "Money from charities is keeping the theatre alive.",
                        "vi": "Tiền từ các tổ chức từ thiện đang giữ cho nhà hát tồn tại."
                    },
                    {
                        "en": "The issue remains alive in the public consciousness.",
                        "vi": "Vấn đề vẫn tồn tại trong tâm thức công chúng."
                    }
                ]
            },
            {
                "define": {
                    "en": "full of living or moving things",
                    "vi": "đầy những thứ sống động hoặc di chuyển"
                },
                "examples": [
                    {
                        "en": "The pool was alive with goldfish.",
                        "vi": "Hồ bơi sống động với cá vàng."
                    }
                ]
            },
            {
                "define": {
                    "en": "aware of something; knowing something exists and is important",
                    "vi": "nhận thức về một cái gì đó; biết một cái gì đó tồn tại và quan trọng"
                },
                "examples": [
                    {
                        "en": "to be alive to the dangers/facts/possibilities",
                        "vi": "sống sót trước những nguy hiểm / sự thật / khả năng"
                    },
                    {
                        "en": "The government should be alive to the problems faced by industry.",
                        "vi": "Chính phủ phải tồn tại trước những vấn đề mà ngành công nghiệp phải đối mặt."
                    }
                ]
            },
            {
                "define": {
                    "en": "very active, healthy or popular",
                    "vi": "rất năng động, lành mạnh hoặc phổ biến"
                },
                "examples": [
                    {
                        "en": "My mother is still alive and kicking.",
                        "vi": "Mẹ tôi vẫn còn sống và đá."
                    }
                ]
            },
            {
                "define": {
                    "en": "still living and not injured or harmed",
                    "vi": "vẫn sống và không bị thương hoặc bị tổn hại"
                },
                "examples": [
                    {
                        "en": "The missing student was found alive and well in Newcastle.",
                        "vi": "Học sinh mất tích được tìm thấy vẫn sống khỏe mạnh ở Newcastle."
                    }
                ]
            },
            {
                "define": {
                    "en": "still popular or successful",
                    "vi": "vẫn phổ biến hoặc thành công"
                },
                "examples": [
                    {
                        "en": "Singapore's literary scene is alive and well.",
                        "vi": "Nền văn học của Singapore đang sống và phát triển."
                    },
                    {
                        "en": "Contrary to popular belief, the tourism industry is alive and well in this part of the world.",
                        "vi": "Trái ngược với suy nghĩ của nhiều người, ngành du lịch đang tồn tại và phát triển ở khu vực này trên thế giới."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make something interesting",
                    "vi": "để làm một cái gì đó thú vị"
                },
                "examples": [
                    {
                        "en": "The pictures bring the book alive.",
                        "vi": "Những hình ảnh làm cho cuốn sách trở nên sống động."
                    },
                    {
                        "en": "The teacher brought history alive with fascinating stories.",
                        "vi": "Người thầy đã mang lịch sử trở nên sống động với những câu chuyện hấp dẫn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to become interesting and exciting",
                    "vi": "trở nên thú vị và hấp dẫn"
                },
                "examples": [
                    {
                        "en": "The game came alive in the second half.",
                        "vi": "Trận đấu trở nên sống động trong hiệp hai."
                    },
                    {
                        "en": "New political issues suddenly came alive after the election.",
                        "vi": "Các vấn đề chính trị mới đột nhiên trở nên sống động sau cuộc bầu cử."
                    }
                ]
            },
            {
                "define": {
                    "en": "to become busy and full of activity",
                    "vi": "trở nên bận rộn và đầy hoạt động"
                },
                "examples": [
                    {
                        "en": "The city starts to come alive after dark.",
                        "vi": "Thành phố bắt đầu trở nên sống động sau khi trời tối."
                    },
                    {
                        "en": "The fishing villages come alive in spring.",
                        "vi": "Những làng chài trở nên sống động vào mùa xuân."
                    }
                ]
            },
            {
                "define": {
                    "en": "to show interest in something and become excited about it",
                    "vi": "thể hiện sự quan tâm đến điều gì đó và trở nên hào hứng với điều đó"
                },
                "examples": [
                    {
                        "en": "She came alive as she talked about her job.",
                        "vi": "Cô ấy trở nên sống động khi nói về công việc của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to criticize or punish somebody severely because you are extremely angry with them",
                    "vi": "chỉ trích hoặc trừng phạt ai đó nghiêm khắc bởi vì bạn cực kỳ tức giận với họ"
                },
                "examples": [
                    {
                        "en": "He’ll eat you alive if he ever finds out.",
                        "vi": "Hắn sẽ ăn tươi nuốt sống bạn nếu hắn phát hiện ra."
                    }
                ]
            },
            {
                "define": {
                    "en": "to defeat somebody completely in an argument, a competition, etc.",
                    "vi": "để đánh bại hoàn toàn ai đó trong một cuộc tranh cãi, một cuộc cạnh tranh, v.v."
                },
                "examples": [
                    {
                        "en": "The defence lawyers are going to eat you alive tomorrow.",
                        "vi": "Các luật sư bào chữa sẽ ăn tươi nuốt sống bạn vào ngày mai."
                    }
                ]
            },
            {
                "define": {
                    "en": "to bite somebody many times",
                    "vi": "cắn ai đó nhiều lần"
                },
                "examples": [
                    {
                        "en": "I was being eaten alive by mosquitoes.",
                        "vi": "Tôi đã bị muỗi ăn thịt."
                    }
                ]
            }
        ]
    },
    {
        "id": "8ec4204bba3449dcaa1db396af97ddd4",
        "word": "beauty sleep",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbjuːti sliːp/",
            "us": "/ˈbjuːti sliːp/"
        },
        "nearby": [
            {
                "word": "beauty salon",
                "pos": "noun"
            },
            {
                "word": "beauty school",
                "pos": "noun"
            },
            {
                "word": "beauty sleep",
                "pos": "noun"
            },
            {
                "word": "beauty spot",
                "pos": "noun"
            },
            {
                "word": "beaux",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "enough sleep at night to make sure that you look and feel healthy and beautiful",
                    "vi": "ngủ đủ giấc vào ban đêm để đảm bảo rằng bạn trông khỏe mạnh và xinh đẹp"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "b84170a4957c4446a24bcec1dfda65f7",
        "word": "bloom",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/bluːm/",
            "us": "/bluːm/"
        },
        "nearby": [
            {
                "word": "Bloody Sunday",
                "pos": ""
            },
            {
                "word": "the Bloody Tower",
                "pos": ""
            },
            {
                "word": "bloom",
                "pos": "noun"
            },
            {
                "word": "bloom",
                "pos": "verb"
            },
            {
                "word": "bloomer",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a flower (usually one on a plant that people admire for its flowers)",
                    "vi": "một bông hoa (thường là một bông hoa trên cây mà mọi người ngưỡng mộ vì những bông hoa của nó)"
                },
                "examples": [
                    {
                        "en": "the exotic blooms of the orchid",
                        "vi": "sự nở hoa kỳ lạ của phong lan"
                    },
                    {
                        "en": "The plant produced a single white bloom.",
                        "vi": "Cây ra hoa đơn màu trắng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a healthy fresh appearance",
                    "vi": "một vẻ ngoài tươi mới khỏe mạnh"
                },
                "examples": [
                    {
                        "en": "the bloom in her cheeks",
                        "vi": "má cô ấy nở"
                    },
                    {
                        "en": "the bloom of youth",
                        "vi": "sự nở rộ của tuổi trẻ"
                    }
                ]
            },
            {
                "define": {
                    "en": "with the flowers fully open",
                    "vi": "với những bông hoa mở hoàn toàn"
                },
                "examples": [
                    {
                        "en": "The roses were in full bloom.",
                        "vi": "Những bông hồng đã nở rộ."
                    },
                    {
                        "en": "He loved watching the garden come into bloom.",
                        "vi": "Anh thích ngắm nhìn khu vườn nở hoa."
                    },
                    {
                        "en": "daffodils in bloom",
                        "vi": "hoa thủy tiên vàng nở"
                    }
                ]
            }
        ]
    },
    {
        "id": "1e2bc9dead334406b542a3a38654c9b6",
        "word": "bloom",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/bluːm/",
            "us": "/bluːm/"
        },
        "nearby": [
            {
                "word": "the Bloody Tower",
                "pos": ""
            },
            {
                "word": "bloom",
                "pos": "noun"
            },
            {
                "word": "bloom",
                "pos": "verb"
            },
            {
                "word": "bloomer",
                "pos": "noun"
            },
            {
                "word": "bloomers",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to produce flowers",
                    "vi": "để sản xuất hoa"
                },
                "examples": [
                    {
                        "en": "Most roses will begin to bloom from late May.",
                        "vi": "Hầu hết hoa hồng sẽ bắt đầu nở từ cuối tháng Năm."
                    },
                    {
                        "en": "Tulips were blooming as far as the eye could see.",
                        "vi": "Những bông hoa tulip đã nở ra xa như những gì mắt thường có thể nhìn thấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to become healthy, happy or confident",
                    "vi": "trở nên khỏe mạnh, hạnh phúc hoặc tự tin"
                },
                "examples": [
                    {
                        "en": "The children had bloomed during their stay on the farm.",
                        "vi": "Những đứa trẻ đã nở rộ trong thời gian ở trang trại."
                    },
                    {
                        "en": "She was blooming with good health.",
                        "vi": "Cô ấy đã nở rộ với một sức khỏe tốt."
                    }
                ]
            }
        ]
    },
    {
        "id": "527a842c431141cc900fa4b6f11ecf13",
        "word": "bouncing",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbaʊnsɪŋ/",
            "us": "/ˈbaʊnsɪŋ/"
        },
        "nearby": [
            {
                "word": "bouncer",
                "pos": "noun"
            },
            {
                "word": "bounce rate",
                "pos": "noun"
            },
            {
                "word": "bouncing",
                "pos": "adjective"
            },
            {
                "word": "bouncy",
                "pos": "adjective"
            },
            {
                "word": "bouncy castle",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "healthy and full of energy",
                    "vi": "khỏe mạnh và tràn đầy năng lượng"
                },
                "examples": [
                    {
                        "en": "a bouncing baby boy",
                        "vi": "một cậu bé đang tung tăng"
                    }
                ]
            }
        ]
    },
    {
        "id": "c1ea263c8dd14dcf855e5dbec9bceecb",
        "word": "bubble",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbʌbl/",
            "us": "/ˈbʌbl/"
        },
        "nearby": [
            {
                "word": "BTW",
                "pos": "abbreviation"
            },
            {
                "word": "bub",
                "pos": "noun"
            },
            {
                "word": "bubble",
                "pos": "noun"
            },
            {
                "word": "bubble",
                "pos": "verb"
            },
            {
                "word": "bubble and squeak",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a ball of air or gas in a liquid, or a ball of air inside a solid substance such as glass",
                    "vi": "một quả cầu không khí hoặc khí trong chất lỏng, hoặc một quả cầu không khí bên trong một chất rắn như thủy tinh"
                },
                "examples": [
                    {
                        "en": "champagne bubbles",
                        "vi": "bong bóng sâm panh"
                    },
                    {
                        "en": "a bubble of oxygen",
                        "vi": "một bong bóng oxy"
                    },
                    {
                        "en": "He blew bubbles into the water through a straw.",
                        "vi": "Anh ta thổi bong bóng vào nước thông qua một ống hút."
                    }
                ]
            },
            {
                "define": {
                    "en": "a round ball of liquid, containing air, produced by soap and water",
                    "vi": "một quả bóng tròn chứa chất lỏng, chứa không khí, được tạo ra bởi xà phòng và nước"
                },
                "examples": [
                    {
                        "en": "The children like to have bubbles in their bath.",
                        "vi": "Những đứa trẻ thích có bong bóng trong bồn tắm của chúng."
                    },
                    {
                        "en": "The children were blowing bubbles.",
                        "vi": "Những đứa trẻ đang thổi bong bóng."
                    },
                    {
                        "en": "They jumped about, bursting the bubbles.",
                        "vi": "Họ nhảy xung quanh, làm vỡ bong bóng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a small amount of a feeling that somebody wants to express",
                    "vi": "một chút cảm giác mà ai đó muốn bày tỏ"
                },
                "examples": [
                    {
                        "en": "a bubble of laughter/hope/enthusiasm",
                        "vi": "bong bóng cười / hy vọng / nhiệt tình"
                    }
                ]
            },
            {
                "define": {
                    "en": "a good or lucky situation that is unlikely to last long",
                    "vi": "một tình huống tốt hoặc may mắn không có khả năng kéo dài"
                },
                "examples": [
                    {
                        "en": "Economists warned of a stock-market bubble.",
                        "vi": "Các nhà kinh tế cảnh báo về bong bóng thị trường chứng khoán."
                    }
                ]
            },
            {
                "define": {
                    "en": "a small group of people with whom you are allowed to have physical contact during a period when social distancing is otherwise required",
                    "vi": "một nhóm nhỏ những người mà bạn được phép tiếp xúc cơ thể trong thời gian mà xã hội cần có sự xa cách"
                },
                "examples": [
                    {
                        "en": "He's been staying with his sister and her husband at weekends since he chose to form a bubble with them.",
                        "vi": "Anh ấy đã ở với em gái và chồng của cô ấy vào cuối tuần kể từ khi anh ấy chọn hình thành bong bóng với họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "there is a sudden end to a good or lucky situation",
                    "vi": "có một kết thúc đột ngột cho một tình huống tốt hoặc may mắn"
                },
                "examples": [
                    {
                        "en": "When the bubble finally burst, hundreds of people lost their jobs.",
                        "vi": "Khi bong bóng cuối cùng đã vỡ, hàng trăm người đã mất việc làm."
                    },
                    {
                        "en": "The optimistic bubble has now burst and economists agree the recession will continue.",
                        "vi": "Bong bóng lạc quan hiện đã vỡ và các nhà kinh tế nhất trí suy thoái sẽ tiếp tục."
                    }
                ]
            },
            {
                "define": {
                    "en": "to bring an end to somebody’s hopes, happiness, etc.",
                    "vi": "để chấm dứt hy vọng, hạnh phúc của ai đó, v.v."
                },
                "examples": [
                    {
                        "en": "He seemed so happy, I couldn’t burst his bubble so soon.",
                        "vi": "Anh ấy có vẻ rất hạnh phúc, tôi không thể làm vỡ bong bóng của anh ấy sớm như vậy."
                    }
                ]
            }
        ]
    },
    {
        "id": "c6fb5bb2e4d3492791c8c14354b7f438",
        "word": "bubble with",
        "pos": "phrasal verb",
        "level": "c2",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "bubble tea",
                "pos": "noun"
            },
            {
                "word": "bubble under",
                "pos": "phrasal verb"
            },
            {
                "word": "bubble with",
                "pos": "phrasal verb"
            },
            {
                "word": "bubble wrap",
                "pos": "noun"
            },
            {
                "word": "bubbly",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to form a support bubble with another household",
                    "vi": "để tạo thành một bong bóng hỗ trợ với một hộ gia đình khác"
                },
                "examples": [
                    {
                        "en": "The rules only allow you to bubble with one other household.",
                        "vi": "Các quy tắc chỉ cho phép bạn bong bóng với một hộ gia đình khác."
                    }
                ]
            }
        ]
    },
    {
        "id": "ce2818e9d93c4f93855843be25e99690",
        "word": "circuit breaker",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsɜːkɪt breɪkə(r)/",
            "us": "/ˈsɜːrkɪt breɪkər/"
        },
        "nearby": [
            {
                "word": "circuit",
                "pos": "noun"
            },
            {
                "word": "circuit board",
                "pos": "noun"
            },
            {
                "word": "circuit breaker",
                "pos": "noun"
            },
            {
                "word": "circuit court",
                "pos": "noun"
            },
            {
                "word": "circuitous",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a device that will stop an electric current if it becomes dangerous",
                    "vi": "một thiết bị sẽ ngăn dòng điện nếu nó trở nên nguy hiểm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a short period during which laws are in place to limit people's movements, especially to require most people to stay at home in order to stop the spread of disease",
                    "vi": "trong thời gian ngắn có luật để hạn chế việc di chuyển của mọi người, đặc biệt là yêu cầu hầu hết mọi người phải ở nhà để ngăn chặn sự lây lan của dịch bệnh"
                },
                "examples": [
                    {
                        "en": "The four-week circuit breaker will come into force tomorrow with the closure of pubs, bars, restaurants and non-essential shops.",
                        "vi": "Việc cắt mạch điện kéo dài 4 tuần sẽ có hiệu lực vào ngày mai với việc đóng cửa các quán rượu, quán bar, nhà hàng và các cửa hàng không thiết yếu."
                    }
                ]
            }
        ]
    },
    {
        "id": "6ac55c41ca4f4084b550a8c51a960563",
        "word": "clean-living",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌkliːn ˈlɪvɪŋ/",
            "us": "/ˌkliːn ˈlɪvɪŋ/"
        },
        "nearby": [
            {
                "word": "clean-limbed",
                "pos": "adjective"
            },
            {
                "word": "cleanliness",
                "pos": "noun"
            },
            {
                "word": "clean-living",
                "pos": "adjective"
            },
            {
                "word": "cleanly",
                "pos": "adverb"
            },
            {
                "word": "clean off",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "living a healthy life, by not drinking alcohol, not having sex with a lot of different people, etc.",
                    "vi": "sống lành mạnh, không uống rượu bia, không quan hệ tình dục với nhiều người, v.v."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "47eba96321594cfdaef0897987fd064a",
        "word": "elbow bump",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈelbəʊ bʌmp/",
            "us": "/ˈelbəʊ bʌmp/"
        },
        "nearby": [
            {
                "word": "elbow",
                "pos": "noun"
            },
            {
                "word": "elbow",
                "pos": "verb"
            },
            {
                "word": "elbow bump",
                "pos": "noun"
            },
            {
                "word": "elbow grease",
                "pos": "noun"
            },
            {
                "word": "elbow room",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an act of briefly touching somebody's elbow with your own to greet them, done to avoid spreading disease through touching each other's hands",
                    "vi": "Hành động chạm nhanh vào khuỷu tay của ai đó bằng cách của bạn để chào họ, được thực hiện để tránh lây bệnh khi chạm vào tay nhau"
                },
                "examples": [
                    {
                        "en": "I was greeted with an elbow bump rather than a handshake.",
                        "vi": "Tôi đã được chào đón bằng một cú thúc cùi chỏ hơn là một cái bắt tay."
                    }
                ]
            }
        ]
    },
    {
        "id": "575c13066c0e4752a9f62012fb6f9a01",
        "word": "elbump",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈelbʌmp/",
            "us": "/ˈelbʌmp/"
        },
        "nearby": [
            {
                "word": "elbow grease",
                "pos": "noun"
            },
            {
                "word": "elbow room",
                "pos": "noun"
            },
            {
                "word": "elbump",
                "pos": "noun"
            },
            {
                "word": "elder",
                "pos": "adjective"
            },
            {
                "word": "elder",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an act of briefly touching somebody's elbow with your own to greet them, done to avoid spreading disease through touching each other's hands",
                    "vi": "Hành động chạm nhanh vào khuỷu tay của ai đó bằng cách của bạn để chào họ, được thực hiện để tránh lây bệnh khi chạm vào tay nhau"
                },
                "examples": [
                    {
                        "en": "We greeted each other with an elbump.",
                        "vi": "Chúng tôi chào nhau bằng một cái cùi chỏ."
                    }
                ]
            }
        ]
    },
    {
        "id": "8aa8379e1c1a4ff4925bad5d4a6facf5",
        "word": "fresh-faced",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌfreʃ ˈfeɪst/",
            "us": "/ˌfreʃ ˈfeɪst/"
        },
        "nearby": [
            {
                "word": "freshen yourself up",
                "pos": "phrasal verb"
            },
            {
                "word": "fresher",
                "pos": "noun"
            },
            {
                "word": "fresh-faced",
                "pos": "adjective"
            },
            {
                "word": "freshly",
                "pos": "adverb"
            },
            {
                "word": "freshman",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "having a young, healthy-looking face",
                    "vi": "có một khuôn mặt trẻ trung, khỏe mạnh"
                },
                "examples": [
                    {
                        "en": "fresh-faced kids",
                        "vi": "những đứa trẻ có khuôn mặt tươi tắn"
                    },
                    {
                        "en": "I tried to imagine my mother as a fresh-faced young woman.",
                        "vi": "Tôi cố hình dung mẹ tôi là một phụ nữ trẻ có gương mặt tươi tắn."
                    }
                ]
            }
        ]
    },
    {
        "id": "6c1f063111c04ab9afc374d8303fd4db",
        "word": "glow",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ɡləʊ/",
            "us": "/ɡləʊ/"
        },
        "nearby": [
            {
                "word": "gloved",
                "pos": "adjective"
            },
            {
                "word": "glove puppet",
                "pos": "noun"
            },
            {
                "word": "glow",
                "pos": "verb"
            },
            {
                "word": "glow",
                "pos": "noun"
            },
            {
                "word": "glower",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to produce a steady light that is not very bright",
                    "vi": "để tạo ra một ánh sáng ổn định nhưng không quá sáng"
                },
                "examples": [
                    {
                        "en": "The embers still glowed in the hearth.",
                        "vi": "Than hồng vẫn rực sáng trong lò sưởi."
                    },
                    {
                        "en": "The lighted candles glowed in the darkness.",
                        "vi": "Những ngọn nến được thắp sáng rực rỡ trong bóng tối."
                    },
                    {
                        "en": "The strap has a fluorescent coating that glows in the dark.",
                        "vi": "Dây đeo có lớp phủ huỳnh quang phát sáng trong bóng tối."
                    },
                    {
                        "en": "+ adj. A cigarette end glowed red in the darkness.",
                        "vi": "Err:509"
                    }
                ]
            },
            {
                "define": {
                    "en": "to look or feel warm or pink, especially after exercise or because you are excited, embarrassed, etc.",
                    "vi": "nhìn hoặc cảm thấy ấm hoặc hồng, đặc biệt là sau khi tập thể dục hoặc vì bạn bị kích thích, xấu hổ, v.v."
                },
                "examples": [
                    {
                        "en": "Her cheeks were glowing.",
                        "vi": "Hai má cô bừng sáng."
                    },
                    {
                        "en": "glow with something His face glowed with embarrassment.",
                        "vi": "bừng sáng với một cái gì đó Khuôn mặt của anh ấy rạng rỡ vì xấu hổ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to look very pleased or satisfied",
                    "vi": "trông rất hài lòng hoặc hài lòng"
                },
                "examples": [
                    {
                        "en": "She was positively glowing with pride.",
                        "vi": "Cô ấy đã tích cực rực rỡ với niềm tự hào."
                    },
                    {
                        "en": "He gave her a warm glowing smile.",
                        "vi": "Anh nở một nụ cười rạng rỡ ấm áp với cô."
                    }
                ]
            },
            {
                "define": {
                    "en": "to appear a strong, warm colour",
                    "vi": "để xuất hiện một màu sắc mạnh mẽ, ấm áp"
                },
                "examples": [
                    {
                        "en": "glow (with something) The countryside glowed with autumn colours.",
                        "vi": "rực rỡ (bằng cái gì) Đồng quê bừng lên sắc thu."
                    },
                    {
                        "en": "+ adj. The brick walls glowed red in the late afternoon sun.",
                        "vi": "Err:509"
                    }
                ]
            }
        ]
    },
    {
        "id": "bd26caf836f947578e54d207bb3b4868",
        "word": "lock down",
        "pos": "phrasal verb",
        "level": "c2",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "lock away",
                "pos": "phrasal verb"
            },
            {
                "word": "lockbox",
                "pos": "noun"
            },
            {
                "word": "lock down",
                "pos": "phrasal verb"
            },
            {
                "word": "lockdown",
                "pos": "noun"
            },
            {
                "word": "John Locke",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to control people's movements within an area because of a dangerous situation, especially in order to prevent the spread of disease",
                    "vi": "để kiểm soát việc di chuyển của người dân trong khu vực vì tình huống nguy hiểm, đặc biệt là để ngăn chặn dịch bệnh lây lan"
                },
                "examples": [
                    {
                        "en": "Those states which locked down most effectively and almost eliminated the virus have done best economically.",
                        "vi": "Những trạng thái khóa hiệu quả nhất và gần như loại bỏ vi rút đã hoạt động tốt nhất về mặt kinh tế."
                    },
                    {
                        "en": "England is being locked down for a third time.",
                        "vi": "Nước Anh đang bị khóa chặt lần thứ ba."
                    }
                ]
            }
        ]
    },
    {
        "id": "f657d2329811455b80d302f0669ad170",
        "word": "physical distancing",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌfɪzɪkl ˈdɪstənsɪŋ/",
            "us": "/ˌfɪzɪkl ˈdɪstənsɪŋ/"
        },
        "nearby": [
            {
                "word": "physical",
                "pos": "adjective"
            },
            {
                "word": "physical",
                "pos": "noun"
            },
            {
                "word": "physical distancing",
                "pos": "noun"
            },
            {
                "word": "physical education",
                "pos": "noun"
            },
            {
                "word": "physical geography",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the practice of keeping a safe distance between yourself and other people in order to prevent the spread of disease",
                    "vi": "thực hành giữ khoảng cách an toàn giữa bạn và người khác để ngăn ngừa sự lây lan của bệnh"
                },
                "examples": [
                    {
                        "en": "The venue can only accommodate 30 people if physical distancing is maintained.",
                        "vi": "Địa điểm chỉ có thể chứa 30 người nếu duy trì sự cân bằng về thể chất."
                    }
                ]
            }
        ]
    },
    {
        "id": "5dae36bcd7ab4db8b6601af8215cc5e8",
        "word": "physically distanced",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌfɪzɪkli ˈdɪstənst/",
            "us": "/ˌfɪzɪkli ˈdɪstənst/"
        },
        "nearby": [
            {
                "word": "physicality",
                "pos": "noun"
            },
            {
                "word": "physically",
                "pos": "adverb"
            },
            {
                "word": "physically distanced",
                "pos": "adjective"
            },
            {
                "word": "physical science",
                "pos": "noun"
            },
            {
                "word": "physical therapist",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "keeping a safe distance between yourself and other people in order to prevent the spread of disease",
                    "vi": "giữ khoảng cách an toàn giữa bạn và những người khác để ngăn ngừa sự lây lan của bệnh"
                },
                "examples": [
                    {
                        "en": "It is important to wear a mask and stay physically distanced from people who are not in your household.",
                        "vi": "Điều quan trọng là phải đeo khẩu trang và tránh xa những người không ở trong gia đình bạn."
                    }
                ]
            }
        ]
    },
    {
        "id": "9a3c791e20f644eab7f4536b1d803b1a",
        "word": "radiance",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈreɪdiəns/",
            "us": "/ˈreɪdiəns/"
        },
        "nearby": [
            {
                "word": "radially",
                "pos": "adverb"
            },
            {
                "word": "radian",
                "pos": "noun"
            },
            {
                "word": "radiance",
                "pos": "noun"
            },
            {
                "word": "radiant",
                "pos": "adjective"
            },
            {
                "word": "radiantly",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a special bright quality that shows in somebody’s face, for example because they are very happy or healthy",
                    "vi": "chất lượng tươi sáng đặc biệt thể hiện trên khuôn mặt của ai đó, chẳng hạn như vì họ rất hạnh phúc hoặc khỏe mạnh"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "warm light shining from something",
                    "vi": "ánh sáng ấm áp chiếu từ một cái gì đó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "9ae76ccdbbf046df854bc9fc4a539fbe",
        "word": "social bubble",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌsəʊʃl ˈbʌbl/",
            "us": "/ˌsəʊʃl ˈbʌbl/"
        },
        "nearby": [
            {
                "word": "social",
                "pos": "noun"
            },
            {
                "word": "social bookmarking",
                "pos": "noun"
            },
            {
                "word": "social bubble",
                "pos": "noun"
            },
            {
                "word": "social capital",
                "pos": "noun"
            },
            {
                "word": "the Social Chapter",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small group of people with whom you are allowed to have physical contact during a period when social distancing is otherwise required",
                    "vi": "một nhóm nhỏ những người mà bạn được phép tiếp xúc cơ thể trong thời gian mà xã hội cần có sự xa cách"
                },
                "examples": [
                    {
                        "en": "Schools have been told to limit classes to social bubbles of up to 15 pupils.",
                        "vi": "Các trường học đã được yêu cầu hạn chế các lớp học trong bong bóng xã hội có tối đa 15 học sinh."
                    }
                ]
            }
        ]
    },
    {
        "id": "fcb0e3988cef45b1989ec4f457142d2b",
        "word": "social distance",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌsəʊʃl ˈdɪstəns/",
            "us": "/ˌsəʊʃl ˈdɪstəns/"
        },
        "nearby": [
            {
                "word": "social democratic",
                "pos": "adjective"
            },
            {
                "word": "the Social Democratic Party",
                "pos": ""
            },
            {
                "word": "social distance",
                "pos": "noun"
            },
            {
                "word": "social distancing",
                "pos": "noun"
            },
            {
                "word": "social engineering",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "physical distance that is kept between people during social and work activities, in order to prevent the spread of disease",
                    "vi": "khoảng cách vật lý được giữ giữa mọi người trong các hoạt động xã hội và công việc, để ngăn ngừa sự lây lan của bệnh"
                },
                "examples": [
                    {
                        "en": "Authorities have called on people to stay at home and maintain social distance when they must go out.",
                        "vi": "Các nhà chức trách đã kêu gọi mọi người ở nhà và duy trì khoảng cách xã hội khi họ phải ra ngoài."
                    }
                ]
            }
        ]
    },
    {
        "id": "e7a25eafbd044899b3d5ef8270410dda",
        "word": "social distancing",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌsəʊʃl ˈdɪstənsɪŋ/",
            "us": "/ˌsəʊʃl ˈdɪstənsɪŋ/"
        },
        "nearby": [
            {
                "word": "the Social Democratic Party",
                "pos": ""
            },
            {
                "word": "social distance",
                "pos": "noun"
            },
            {
                "word": "social distancing",
                "pos": "noun"
            },
            {
                "word": "social engineering",
                "pos": "noun"
            },
            {
                "word": "social enterprise",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the practice of keeping a safe distance between yourself and other people in order to prevent the spread of disease",
                    "vi": "thực hành giữ khoảng cách an toàn giữa bạn và người khác để ngăn ngừa sự lây lan của bệnh"
                },
                "examples": [
                    {
                        "en": "The government called on people to practise social distancing and work from home if possible.",
                        "vi": "Chính phủ kêu gọi mọi người thực hành cách xa xã hội và làm việc tại nhà nếu có thể."
                    }
                ]
            }
        ]
    },
    {
        "id": "c6eae438a07e40c5becd76a64ee5a4cc",
        "word": "socially distanced",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌsəʊʃəli ˈdɪstənst/",
            "us": "/ˌsəʊʃəli ˈdɪstənst/"
        },
        "nearby": [
            {
                "word": "social justice",
                "pos": "noun"
            },
            {
                "word": "socially",
                "pos": "adverb"
            },
            {
                "word": "socially distanced",
                "pos": "adjective"
            },
            {
                "word": "social media",
                "pos": "noun"
            },
            {
                "word": "social media optimization",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "keeping a safe distance between yourself and other people in order to prevent the spread of disease",
                    "vi": "giữ khoảng cách an toàn giữa bạn và những người khác để ngăn ngừa sự lây lan của bệnh"
                },
                "examples": [
                    {
                        "en": "In addition to wearing face masks, the choir was socially distanced on the stage.",
                        "vi": "Ngoài việc đeo khẩu trang, dàn hợp xướng còn bị xa rời xã hội trên sân khấu."
                    },
                    {
                        "en": "We've all been seeking safe, socially distanced outdoor activities.",
                        "vi": "Tất cả chúng ta đều đang tìm kiếm các hoạt động ngoài trời an toàn, xa rời xã hội."
                    }
                ]
            }
        ]
    },
    {
        "id": "0c0c3f725fd6499e98f85bf331b10aa9",
        "word": "sturdy",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈstɜːdi/",
            "us": "/ˈstɜːrdi/"
        },
        "nearby": [
            {
                "word": "sturdily",
                "pos": "adverb"
            },
            {
                "word": "sturdiness",
                "pos": "noun"
            },
            {
                "word": "sturdy",
                "pos": "adjective"
            },
            {
                "word": "sturgeon",
                "pos": "noun"
            },
            {
                "word": "stutter",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "strong and not easily damaged",
                    "vi": "mạnh mẽ và không dễ bị hư hỏng"
                },
                "examples": [
                    {
                        "en": "a sturdy pair of boots",
                        "vi": "một đôi ủng chắc chắn"
                    },
                    {
                        "en": "a sturdy table",
                        "vi": "một cái bàn chắc chắn"
                    },
                    {
                        "en": "The vehicle is sturdy enough to withstand rough terrain.",
                        "vi": "Xe đủ cứng cáp để chịu được những địa hình gồ ghề."
                    }
                ]
            },
            {
                "define": {
                    "en": "physically strong and healthy",
                    "vi": "thể chất mạnh mẽ và khỏe mạnh"
                },
                "examples": [
                    {
                        "en": "a man of sturdy build",
                        "vi": "một người đàn ông của xây dựng vững chắc"
                    },
                    {
                        "en": "sturdy legs",
                        "vi": "đôi chân vững chắc"
                    },
                    {
                        "en": "a sturdy breed of cattle",
                        "vi": "một giống gia súc khỏe mạnh"
                    }
                ]
            },
            {
                "define": {
                    "en": "not easily influenced or changed by other people",
                    "vi": "không dễ bị ảnh hưởng hoặc thay đổi bởi người khác"
                },
                "examples": [
                    {
                        "en": "The village has always maintained a sturdy independence.",
                        "vi": "Làng luôn giữ được nền độc lập vững chắc."
                    },
                    {
                        "en": "a sturdy defence of the government’s position",
                        "vi": "một sự bảo vệ vững chắc cho vị trí của chính phủ"
                    }
                ]
            }
        ]
    },
    {
        "id": "91e2a3e835354f54a0f6bd233f3caaa4",
        "word": "support bubble",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/səˈpɔːt bʌbl/",
            "us": "/səˈpɔːrt bʌbl/"
        },
        "nearby": [
            {
                "word": "support",
                "pos": "verb"
            },
            {
                "word": "support",
                "pos": "noun"
            },
            {
                "word": "support bubble",
                "pos": "noun"
            },
            {
                "word": "supporter",
                "pos": "noun"
            },
            {
                "word": "support group",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "two households who join together and are allowed to visit each other, stay overnight and visit public places together (when these actions are not otherwise allowed under laws to limit the spread of coronavirus)",
                    "vi": "hai hộ gia đình tham gia cùng nhau và được phép đến thăm nhau, ở lại qua đêm và thăm những nơi công cộng cùng nhau (khi những hành động này không được phép theo luật để hạn chế sự lây lan của coronavirus)"
                },
                "examples": [
                    {
                        "en": "Single-adult households may form a support bubble with one other household.",
                        "vi": "Các hộ gia đình chỉ có một người trưởng thành có thể hình thành một bong bóng hỗ trợ với một hộ gia đình khác."
                    }
                ]
            }
        ]
    },
    {
        "id": "fbc41bee1a524cb3befa167d69dfe1fc",
        "word": "trim",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/trɪm/",
            "us": "/trɪm/"
        },
        "nearby": [
            {
                "word": "trim",
                "pos": "verb"
            },
            {
                "word": "trim",
                "pos": "noun"
            },
            {
                "word": "trim",
                "pos": "adjective"
            },
            {
                "word": "trimaran",
                "pos": "noun"
            },
            {
                "word": "trim down",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "looking thin, healthy and attractive",
                    "vi": "trông gầy, khỏe mạnh và hấp dẫn"
                },
                "examples": [
                    {
                        "en": "She has kept very trim.",
                        "vi": "Cô ấy đã giữ rất trang nhã."
                    },
                    {
                        "en": "a trim figure",
                        "vi": "một con số trang trí"
                    }
                ]
            },
            {
                "define": {
                    "en": "neat and well cared for",
                    "vi": "gọn gàng và được chăm sóc tốt"
                },
                "examples": [
                    {
                        "en": "a trim garden",
                        "vi": "một khu vườn cắt tỉa"
                    }
                ]
            }
        ]
    },
    {
        "id": "801c814a1a734ba592c10e21b61b7941",
        "word": "wellness",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈwelnəs/",
            "us": "/ˈwelnəs/"
        },
        "nearby": [
            {
                "word": "well meant",
                "pos": "adjective"
            },
            {
                "word": "We'll Meet Again",
                "pos": ""
            },
            {
                "word": "wellness",
                "pos": "noun"
            },
            {
                "word": "well-nigh",
                "pos": "adverb"
            },
            {
                "word": "well off",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the state of being healthy, especially when you actively try to achieve this",
                    "vi": "trạng thái khỏe mạnh, đặc biệt là khi bạn tích cực cố gắng đạt được điều này"
                },
                "examples": [
                    {
                        "en": "a healthcare system focused on wellness, not sickness",
                        "vi": "một hệ thống chăm sóc sức khỏe tập trung vào sức khỏe chứ không phải bệnh tật"
                    },
                    {
                        "en": "a wellness centre offering yoga and tai chi",
                        "vi": "trung tâm chăm sóc sức khỏe cung cấp yoga và thái cực quyền"
                    }
                ]
            }
        ]
    }
]