[
    {
        "id": "2b77c21ff7c347d58c1b318f8f136843",
        "word": "computer",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/kəmˈpjuːtə(r)/",
            "us": "/kəmˈpjuːtər/"
        },
        "nearby": [
            {
                "word": "computational linguistics",
                "pos": "noun"
            },
            {
                "word": "compute",
                "pos": "verb"
            },
            {
                "word": "computer",
                "pos": "noun"
            },
            {
                "word": "computer game",
                "pos": "noun"
            },
            {
                "word": "computer-generated",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an electronic machine that can store, organize and find information, do processes with numbers and other data, and control other machines",
                    "vi": "một máy điện tử có thể lưu trữ, sắp xếp và tìm kiếm thông tin, thực hiện các quy trình với các con số và dữ liệu khác cũng như điều khiển các máy khác"
                },
                "examples": [
                    {
                        "en": "a home computer",
                        "vi": "một máy tính gia đình"
                    },
                    {
                        "en": "by computer The whole process is run and monitored by computer.",
                        "vi": "bằng máy tính Toàn bộ quá trình được điều hành và giám sát bằng máy tính."
                    },
                    {
                        "en": "on a computer He spends all day playing on his computer.",
                        "vi": "trên máy tính Anh ấy dành cả ngày để chơi trên máy tính của mình."
                    },
                    {
                        "en": "a computer system/program/network",
                        "vi": "một hệ thống máy tính / chương trình / mạng"
                    },
                    {
                        "en": "computer software/graphics/hardware",
                        "vi": "phần mềm máy tính / đồ họa / phần cứng"
                    },
                    {
                        "en": "a computer screen",
                        "vi": "màn hình máy tính"
                    },
                    {
                        "en": "a computer programmer/user",
                        "vi": "một lập trình viên máy tính / người dùng"
                    },
                    {
                        "en": "a computer virus",
                        "vi": "một vi rút máy tính"
                    },
                    {
                        "en": "computer-aided design",
                        "vi": "máy tính hỗ trợ thiết kế"
                    }
                ]
            }
        ]
    },
    {
        "id": "32f91100fb2a407a9c0c695ec5c00a0f",
        "word": "DVD",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/ˌdiː viː ˈdiː/",
            "us": "/ˌdiː viː ˈdiː/"
        },
        "nearby": [
            {
                "word": "duvet day",
                "pos": "noun"
            },
            {
                "word": "dux",
                "pos": "noun"
            },
            {
                "word": "DVD",
                "pos": "noun"
            },
            {
                "word": "DVLA",
                "pos": ""
            },
            {
                "word": "DVR",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a disk on which large amounts of information, especially films, photographs and video, can be stored, for use on a DVD player or computer (the abbreviation for ‘digital versatile disc’ or ‘digital videodisc’)",
                    "vi": "một đĩa có thể lưu trữ một lượng lớn thông tin, đặc biệt là phim, ảnh và video, để sử dụng trên đầu đĩa DVD hoặc máy tính (viết tắt của 'đĩa đa năng kỹ thuật số' hoặc 'video kỹ thuật số')"
                },
                "examples": [
                    {
                        "en": "Let's just stay in and watch a DVD.",
                        "vi": "Hãy chỉ ở trong và xem một đĩa DVD."
                    },
                    {
                        "en": "a DVD recorder",
                        "vi": "một máy ghi DVD"
                    },
                    {
                        "en": "a DVD drive",
                        "vi": "một ổ đĩa DVD"
                    },
                    {
                        "en": "on DVD Is it available on DVD yet?",
                        "vi": "trên DVD Nó đã có trên DVD chưa?"
                    }
                ]
            }
        ]
    },
    {
        "id": "70153b10aebc4bc08c295f38afa091c0",
        "word": "mouse",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/maʊs/",
            "us": "/maʊs/"
        },
        "nearby": [
            {
                "word": "mournfully",
                "pos": "adverb"
            },
            {
                "word": "mourning",
                "pos": "noun"
            },
            {
                "word": "mouse",
                "pos": "noun"
            },
            {
                "word": "mouse",
                "pos": "verb"
            },
            {
                "word": "mouse mat",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small animal that is covered in fur and has a long thin tail. Mice live in fields, in people’s houses or where food is stored.",
                    "vi": "một con vật nhỏ được bao phủ bởi bộ lông và có một cái đuôi dài mỏng. Chuột sống trên đồng ruộng, trong nhà dân hoặc nơi dự trữ thức ăn."
                },
                "examples": [
                    {
                        "en": "a house mouse",
                        "vi": "một con chuột nhà"
                    },
                    {
                        "en": "The stores were overrun with rats and mice.",
                        "vi": "Các cửa hàng tràn ngập chuột và chuột."
                    },
                    {
                        "en": "She crept upstairs, quiet as a mouse.",
                        "vi": "Cô rón rén lên lầu, yên lặng như một con chuột."
                    },
                    {
                        "en": "(figurative) He was a shy little mouse.",
                        "vi": "(nghĩa bóng) Anh ấy là một con chuột nhỏ nhút nhát."
                    }
                ]
            },
            {
                "define": {
                    "en": "a small device that is moved by hand across a surface to control the movement of the cursor on a computer screen",
                    "vi": "một thiết bị nhỏ được di chuyển bằng tay trên bề mặt để điều khiển chuyển động của con trỏ trên màn hình máy tính"
                },
                "examples": [
                    {
                        "en": "Use the mouse to drag the icon to a new position.",
                        "vi": "Sử dụng chuột để kéo biểu tượng đến vị trí mới."
                    },
                    {
                        "en": "I prefer a wireless mouse.",
                        "vi": "Tôi thích một con chuột không dây hơn."
                    },
                    {
                        "en": "The keyboard and mouse are wireless devices.",
                        "vi": "Bàn phím và chuột là thiết bị không dây."
                    },
                    {
                        "en": "Click the left mouse button twice to highlight the program.",
                        "vi": "Nhấn trái chuột hai lần để tô sáng chương trình."
                    },
                    {
                        "en": "With simple mouse clicks, the viewer can navigate the room.",
                        "vi": "Với những cú nhấp chuột đơn giản, người xem có thể điều hướng căn phòng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to play a cruel game with somebody in your power by changing your behaviour very often, so that they become nervous and do not know what to expect",
                    "vi": "chơi một trò chơi tàn ác với ai đó trong quyền lực của bạn bằng cách thay đổi hành vi của bạn rất thường xuyên, để họ trở nên lo lắng và không biết điều gì sẽ xảy ra"
                },
                "examples": [
                    {
                        "en": "He thought the police were playing some elaborate game of cat and mouse and waiting to trap him.",
                        "vi": "Anh ta nghĩ rằng cảnh sát đang chơi trò mèo vờn chuột phức tạp nào đó và chờ đợi để bẫy anh ta."
                    },
                    {
                        "en": "Young car thieves enjoy playing cat and mouse with the police.",
                        "vi": "Những tên trộm xe hơi thích thú chơi trò mèo vờn chuột với cảnh sát."
                    }
                ]
            },
            {
                "define": {
                    "en": "people enjoy themselves more and behave with greater freedom when the person in charge of them is not there",
                    "vi": "mọi người thích thú hơn với bản thân và cư xử tự do hơn khi người phụ trách họ không có ở đó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "1b05f28ec2714c3988d1de27c312299e",
        "word": "laptop",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈlæptɒp/",
            "us": "/ˈlæptɑːp/"
        },
        "nearby": [
            {
                "word": "lapsed",
                "pos": "adjective"
            },
            {
                "word": "lapse into",
                "pos": "phrasal verb"
            },
            {
                "word": "laptop",
                "pos": "noun"
            },
            {
                "word": "lap up",
                "pos": "phrasal verb"
            },
            {
                "word": "lapwing",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small computer that can work with a battery and be easily carried",
                    "vi": "một máy tính nhỏ có thể hoạt động bằng pin và dễ dàng mang theo"
                },
                "examples": [
                    {
                        "en": "I opened my laptop and started typing.",
                        "vi": "Tôi mở máy tính xách tay của mình và bắt đầu nhập."
                    },
                    {
                        "en": "on a laptop She was still working on her laptop.",
                        "vi": "trên máy tính xách tay Cô ấy vẫn đang làm việc trên máy tính xách tay của mình."
                    }
                ]
            }
        ]
    },
    {
        "id": "3fde575845dc4dbf85baeec9490d603d",
        "word": "memory",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈmeməri/",
            "us": "/ˈmeməri/"
        },
        "nearby": [
            {
                "word": "memoriam",
                "pos": ""
            },
            {
                "word": "memorize",
                "pos": "verb"
            },
            {
                "word": "memory",
                "pos": "noun"
            },
            {
                "word": "memory bank",
                "pos": "noun"
            },
            {
                "word": "memory card",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "your ability to remember things",
                    "vi": "khả năng ghi nhớ của bạn"
                },
                "examples": [
                    {
                        "en": "memory for something I have a bad memory for names.",
                        "vi": "trí nhớ cho một cái gì đó Tôi có một trí nhớ tồi tệ cho những cái tên."
                    },
                    {
                        "en": "People have short memories (= they soon forget).",
                        "vi": "Mọi người có ký ức ngắn (= họ sớm quên)."
                    },
                    {
                        "en": "He had a long memory for people who had disappointed him.",
                        "vi": "Anh đã có một trí nhớ rất lâu cho những người đã làm anh thất vọng."
                    },
                    {
                        "en": "He had a great memory for detail.",
                        "vi": "Anh ấy có một trí nhớ tuyệt vời đến từng chi tiết."
                    },
                    {
                        "en": "from memory She can recite the whole poem from memory.",
                        "vi": "từ trí nhớ Cô ấy có thể đọc thuộc lòng toàn bộ bài thơ từ trí nhớ."
                    },
                    {
                        "en": "He suffered memory loss for weeks after the accident.",
                        "vi": "Anh ấy bị mất trí nhớ trong nhiều tuần sau vụ tai nạn."
                    },
                    {
                        "en": "Are you sure? Memory can play tricks on you.",
                        "vi": "Bạn có chắc không? Trí nhớ có thể đánh lừa bạn."
                    },
                    {
                        "en": "The drugs had a severe effect on her short-term memory.",
                        "vi": "Thuốc đã ảnh hưởng nghiêm trọng đến trí nhớ ngắn hạn của cô."
                    },
                    {
                        "en": "I quickly committed the number of the car to memory (= learned and remembered it).",
                        "vi": "Tôi nhanh chóng ghi số của chiếc xe vào bộ nhớ (= đã học và nhớ nó)."
                    },
                    {
                        "en": "Culture is the unit of collective memory, keeping the past alive.",
                        "vi": "Văn hóa là đơn vị của ký ức tập thể, lưu giữ quá khứ sống động."
                    }
                ]
            },
            {
                "define": {
                    "en": "the period of time that a person or group of people is able to remember events",
                    "vi": "khoảng thời gian mà một người hoặc một nhóm người có thể nhớ các sự kiện"
                },
                "examples": [
                    {
                        "en": "in… memory There hasn’t been peace in the country in my memory.",
                        "vi": "trong… ký ức Không có hòa bình trên đất nước trong ký ức của tôi."
                    },
                    {
                        "en": "It was the worst storm in recent memory.",
                        "vi": "Đó là cơn bão tồi tệ nhất trong ký ức gần đây."
                    },
                    {
                        "en": "within… memory This hasn't happened within living memory (= nobody alive now can remember it).",
                        "vi": "trong… bộ nhớ Điều này đã không xảy ra trong bộ nhớ sống (= không ai còn sống bây giờ có thể nhớ nó)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a thought of something that you remember from the past",
                    "vi": "một ý nghĩ về điều gì đó mà bạn nhớ trong quá khứ"
                },
                "examples": [
                    {
                        "en": "Her poems are often based on childhood memories.",
                        "vi": "Những bài thơ của cô thường dựa trên những kỷ niệm thời thơ ấu."
                    },
                    {
                        "en": "memory of something I have vivid memories of my grandparents.",
                        "vi": "ký ức về một cái gì đó Tôi có những ký ức sống động về ông bà của tôi."
                    },
                    {
                        "en": "My mother has fond memories of those days.",
                        "vi": "Mẹ tôi có những kỷ niệm đẹp về những ngày đó."
                    },
                    {
                        "en": "memory of doing something I have many happy memories of working there.",
                        "vi": "kỷ niệm làm việc gì đó Tôi có nhiều kỷ niệm vui khi làm việc ở đó."
                    },
                    {
                        "en": "The snow outside makes summer feel like a distant memory.",
                        "vi": "Bên ngoài tuyết rơi khiến mùa hè như nhớ về một miền ký ức xa xăm."
                    },
                    {
                        "en": "What is your earliest memory?",
                        "vi": "Kí ức gần nhất của bạn là gì?"
                    },
                    {
                        "en": "The photos bring back lots of good memories.",
                        "vi": "Những bức ảnh mang lại rất nhiều kỷ niệm đẹp."
                    },
                    {
                        "en": "This music evokes painful memories.",
                        "vi": "Âm nhạc này gợi lên những ký ức đau buồn."
                    }
                ]
            },
            {
                "define": {
                    "en": "what is remembered about somebody after they have died",
                    "vi": "những gì được nhớ về ai đó sau khi họ chết"
                },
                "examples": [
                    {
                        "en": "Her memory lives on (= we still remember her).",
                        "vi": "Bộ nhớ của cô ấy vẫn tồn tại (= chúng tôi vẫn nhớ cô ấy)."
                    },
                    {
                        "en": "Their behaviour insults the memory of those who died for this country.",
                        "vi": "Hành vi của họ xúc phạm đến ký ức của những người đã chết vì đất nước này."
                    },
                    {
                        "en": "They held a feast to honour the memory of Patroclus, his slain comrade.",
                        "vi": "Họ tổ chức một bữa tiệc để tưởng nhớ Patroclus, người đồng đội đã thiệt mạng của anh ta."
                    }
                ]
            },
            {
                "define": {
                    "en": "the part of a computer where information is stored; the amount of space in a computer for storing information",
                    "vi": "phần của máy tính nơi lưu trữ thông tin; lượng không gian trong máy tính để lưu trữ thông tin"
                },
                "examples": [
                    {
                        "en": "32 gigabytes of memory",
                        "vi": "32 gigabyte bộ nhớ"
                    },
                    {
                        "en": "Have you got enough memory available to run the program?",
                        "vi": "Bạn có đủ bộ nhớ để chạy chương trình không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "if something is etched on your heart, memory, etc. you remember it because it has made a strong impression on you",
                    "vi": "nếu điều gì đó đã khắc sâu vào trái tim, ký ức của bạn, v.v., bạn sẽ nhớ nó vì nó đã gây ấn tượng mạnh mẽ đối với bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to have a very bad memory; to forget things easily",
                    "vi": "có một trí nhớ rất tệ; để quên mọi thứ một cách dễ dàng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "if I remember correctly",
                    "vi": "nếu tôi nhớ không lầm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "intended to show respect and remind people of somebody who has died",
                    "vi": "nhằm thể hiện sự tôn trọng và nhắc nhở mọi người về một người nào đó đã chết"
                },
                "examples": [
                    {
                        "en": "He founded the charity in memory of his late wife.",
                        "vi": "Anh thành lập quỹ từ thiện để tưởng nhớ người vợ quá cố của mình."
                    },
                    {
                        "en": "The statue was erected to the memory of my father.",
                        "vi": "Bức tượng được dựng lên để tưởng nhớ cha tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to say or do something that makes somebody remember something",
                    "vi": "để nói hoặc làm điều gì đó khiến ai đó nhớ điều gì đó"
                },
                "examples": [
                    {
                        "en": "Maybe these letters will help to jog your memory.",
                        "vi": "Có thể những chữ cái này sẽ giúp cải thiện trí nhớ của bạn."
                    }
                ]
            }
        ]
    },
    {
        "id": "487a18e3531545158460a32938f1911e",
        "word": "mobile device",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˌməʊbaɪl dɪˈvaɪs/",
            "us": "/ˌməʊbl dɪˈvaɪs/"
        },
        "nearby": [
            {
                "word": "Mobile",
                "pos": ""
            },
            {
                "word": "the Battle of Mobile Bay",
                "pos": ""
            },
            {
                "word": "mobile device",
                "pos": "noun"
            },
            {
                "word": "mobile home",
                "pos": "noun"
            },
            {
                "word": "mobile learning",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "any small computing device, such as a smartphone or tablet",
                    "vi": "bất kỳ thiết bị máy tính nhỏ nào, chẳng hạn như điện thoại thông minh hoặc máy tính bảng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "ed0f2e44d2c24d178e5116fe341efec4",
        "word": "MP3 player",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˌem piː ˈθriː pleɪə(r)/",
            "us": "/ˌem piː ˈθriː pleɪər/"
        },
        "nearby": [
            {
                "word": "mozzie",
                "pos": "noun"
            },
            {
                "word": "MP3",
                "pos": "noun"
            },
            {
                "word": "MP3 player",
                "pos": "noun"
            },
            {
                "word": "MP4",
                "pos": "noun"
            },
            {
                "word": "MP",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small piece of equipment that can store information taken from the internet and that you can carry with you, for example so that you can listen to music",
                    "vi": "một thiết bị nhỏ có thể lưu trữ thông tin lấy từ internet và bạn có thể mang theo bên mình, chẳng hạn như để bạn có thể nghe nhạc"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "ed0fcf7f392a4cf6b691224806ecf014",
        "word": "network",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈnetwɜːk/",
            "us": "/ˈnetwɜːrk/"
        },
        "nearby": [
            {
                "word": "nettlerash",
                "pos": "noun"
            },
            {
                "word": "nettlesome",
                "pos": "adjective"
            },
            {
                "word": "network",
                "pos": "noun"
            },
            {
                "word": "network",
                "pos": "verb"
            },
            {
                "word": "network effect",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a complicated system of roads, lines, tubes, nerves, etc. that are connected to each other and operate together",
                    "vi": "một hệ thống phức tạp của đường, đường dây, ống, dây thần kinh, v.v. được kết nối với nhau và hoạt động cùng nhau"
                },
                "examples": [
                    {
                        "en": "a rail/road/canal network",
                        "vi": "mạng lưới đường sắt / đường bộ / kênh đào"
                    },
                    {
                        "en": "The new rail services will form a network connecting the capital and major cities.",
                        "vi": "Các dịch vụ đường sắt mới sẽ tạo thành một mạng lưới kết nối thủ đô và các thành phố lớn."
                    },
                    {
                        "en": "Europe's mobile phone networks are controlled by five dominant players.",
                        "vi": "Các mạng điện thoại di động của châu Âu được kiểm soát bởi năm công ty thống trị."
                    },
                    {
                        "en": "network of something a network of veins",
                        "vi": "mạng lưới của một cái gì đó một mạng lưới các tĩnh mạch"
                    },
                    {
                        "en": "an extensive network of underground tunnels",
                        "vi": "một mạng lưới rộng lớn các đường hầm dưới lòng đất"
                    }
                ]
            },
            {
                "define": {
                    "en": "a closely connected group of people, companies, etc. that exchange information, etc.",
                    "vi": "một nhóm người, công ty, v.v. được kết nối chặt chẽ để trao đổi thông tin, v.v."
                },
                "examples": [
                    {
                        "en": "They have one of the most efficient distribution networks in Europe.",
                        "vi": "Họ có một trong những mạng lưới phân phối hiệu quả nhất ở Châu Âu."
                    },
                    {
                        "en": "These corporations control TV, radio and global communications networks.",
                        "vi": "Các tập đoàn này kiểm soát TV, đài phát thanh và mạng lưới truyền thông toàn cầu."
                    },
                    {
                        "en": "to build/create/develop a network",
                        "vi": "xây dựng / tạo / phát triển mạng"
                    },
                    {
                        "en": "network of somebody/something She has a supportive network of close friends.",
                        "vi": "mạng lưới của ai đó / cái gì đó Cô ấy có một mạng lưới hỗ trợ của những người bạn thân."
                    },
                    {
                        "en": "Expand your network of contacts beyond your usual circles.",
                        "vi": "Mở rộng mạng lưới liên hệ của bạn ra ngoài các vòng kết nối thông thường của bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a number of computers and other devices that are connected together so that equipment and information can be shared",
                    "vi": "một số máy tính và các thiết bị khác được kết nối với nhau để có thể chia sẻ thiết bị và thông tin"
                },
                "examples": [
                    {
                        "en": "The office network allows users to share files and software, and to use a central printer.",
                        "vi": "Mạng văn phòng cho phép người dùng chia sẻ tệp và phần mềm cũng như sử dụng máy in trung tâm."
                    },
                    {
                        "en": "across/over/via a network Users can access data across a network.",
                        "vi": "qua / qua / qua mạng Người dùng có thể truy cập dữ liệu qua mạng."
                    },
                    {
                        "en": "The files are accessible over a network.",
                        "vi": "Các tệp có thể truy cập được qua mạng."
                    },
                    {
                        "en": "You can print and scan from your device via a wireless network.",
                        "vi": "Bạn có thể in và quét từ thiết bị của mình qua mạng không dây."
                    }
                ]
            },
            {
                "define": {
                    "en": "a group of radio or television stations in different places that are connected and that broadcast the same programmes at the same time",
                    "vi": "một nhóm các đài phát thanh hoặc đài truyền hình ở những nơi khác nhau được kết nối và phát cùng một lúc các chương trình"
                },
                "examples": [
                    {
                        "en": "the four big US television networks",
                        "vi": "bốn mạng truyền hình lớn của Hoa Kỳ"
                    },
                    {
                        "en": "The report was broadcast across several radio networks.",
                        "vi": "Báo cáo đã được phát trên một số mạng phát thanh."
                    },
                    {
                        "en": "The show was first aired on the cable network Showtime.",
                        "vi": "Chương trình lần đầu tiên được phát sóng trên mạng cáp Showtime."
                    },
                    {
                        "en": "network of something He's chairman of a network of radio stations.",
                        "vi": "mạng lưới của cái gì đó Anh ấy là chủ tịch của một mạng lưới các đài phát thanh."
                    }
                ]
            },
            {
                "define": {
                    "en": "the situation in many British companies, government departments and branches of the armed forces where people give jobs to former students of the school or university that they went to",
                    "vi": "tình hình ở nhiều công ty, cơ quan chính phủ và chi nhánh của lực lượng vũ trang ở Anh, nơi mọi người giao việc cho các sinh viên cũ của trường học hoặc trường đại học mà họ đã theo học"
                },
                "examples": [
                    {
                        "en": "Recruiting staff used to be done by means of the old boy network.",
                        "vi": "Việc tuyển dụng nhân viên từng được thực hiện bởi mạng lưới chàng trai ngày xưa."
                    },
                    {
                        "en": "Most of the managers were chosen by the old boy network and many of them turned out to be incompetent.",
                        "vi": "Hầu hết những người quản lý được chọn bởi mạng lưới chàng trai cũ và nhiều người trong số họ hóa ra không đủ năng lực."
                    }
                ]
            }
        ]
    },
    {
        "id": "422baff1e7334d739d347a2e212280e1",
        "word": "personal computer",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˌpɜːsənl kəmˈpjuːtə(r)/",
            "us": "/ˌpɜːrsənl kəmˈpjuːtər/"
        },
        "nearby": [
            {
                "word": "personal check",
                "pos": "noun"
            },
            {
                "word": "personal column",
                "pos": "noun"
            },
            {
                "word": "personal computer",
                "pos": "noun"
            },
            {
                "word": "personal day",
                "pos": "noun"
            },
            {
                "word": "Personal Equity Plan",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a computer that is designed for one person to use at work or at home",
                    "vi": "một máy tính được thiết kế cho một người sử dụng tại nơi làm việc hoặc ở nhà"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "8c51986e7955471c80268b7ce0ac6a17",
        "word": "printer",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈprɪntə(r)/",
            "us": "/ˈprɪntər/"
        },
        "nearby": [
            {
                "word": "printable",
                "pos": "adjective"
            },
            {
                "word": "printed circuit",
                "pos": "noun"
            },
            {
                "word": "printer",
                "pos": "noun"
            },
            {
                "word": "printing",
                "pos": "noun"
            },
            {
                "word": "printing press",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a machine for printing text on paper, especially one connected to a computer",
                    "vi": "một máy in văn bản trên giấy, đặc biệt là một máy được kết nối với máy tính"
                },
                "examples": [
                    {
                        "en": "a colour printer",
                        "vi": "một máy in màu"
                    },
                    {
                        "en": "a printer cartridge",
                        "vi": "một hộp mực máy in"
                    }
                ]
            },
            {
                "define": {
                    "en": "a person or a company whose job is printing books, etc.",
                    "vi": "một người hoặc một công ty có công việc là in sách, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a place where books, etc. are printed",
                    "vi": "nơi in sách, v.v."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "042cba582cbc4ffeaa9cdb3b8fd40c91",
        "word": "screen",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/skriːn/",
            "us": "/skriːn/"
        },
        "nearby": [
            {
                "word": "screech",
                "pos": "noun"
            },
            {
                "word": "screed",
                "pos": "noun"
            },
            {
                "word": "screen",
                "pos": "noun"
            },
            {
                "word": "screen",
                "pos": "verb"
            },
            {
                "word": "Screen Actors Guild",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the flat surface at the front of a television, computer, or other electronic device, on which you see pictures or information",
                    "vi": "bề mặt phẳng ở phía trước của TV, máy tính hoặc thiết bị điện tử khác mà bạn nhìn thấy hình ảnh hoặc thông tin trên đó"
                },
                "examples": [
                    {
                        "en": "a computer screen",
                        "vi": "màn hình máy tính"
                    },
                    {
                        "en": "a monitor with a 21-inch screen",
                        "vi": "màn hình có màn hình 21 inch"
                    },
                    {
                        "en": "They were staring at the television screen.",
                        "vi": "Họ đang nhìn chằm chằm vào màn hình tivi."
                    },
                    {
                        "en": "Move your cursor to the top of the screen.",
                        "vi": "Di chuyển con trỏ của bạn lên đầu màn hình."
                    },
                    {
                        "en": "Tessa glanced at the phone's little screen.",
                        "vi": "Tessa liếc nhìn màn hình nhỏ của điện thoại."
                    },
                    {
                        "en": "an LCD/plasma screen",
                        "vi": "một màn hình LCD / plasma"
                    },
                    {
                        "en": "Hundreds of fans watched on giant television screens.",
                        "vi": "Hàng trăm người hâm mộ đã theo dõi trên màn hình tivi khổng lồ."
                    },
                    {
                        "en": "on the screen The image came up on the screen for a few seconds.",
                        "vi": "trên màn hình Hình ảnh hiển thị trên màn hình trong vài giây."
                    },
                    {
                        "en": "The birds appear as red dots on the radar screen.",
                        "vi": "Những con chim xuất hiện dưới dạng chấm đỏ trên màn hình radar."
                    },
                    {
                        "en": "on screen Information can be viewed on screen or printed out.",
                        "vi": "trên màn hình Thông tin có thể được xem trên màn hình hoặc in ra."
                    },
                    {
                        "en": "the screen display",
                        "vi": "màn hình hiển thị"
                    },
                    {
                        "en": "The system was designed with a menu bar at the bottom of the screen.",
                        "vi": "Hệ thống được thiết kế với một thanh menu ở cuối màn hình."
                    }
                ]
            },
            {
                "define": {
                    "en": "the large flat surface that films or pictures are shown on",
                    "vi": "bề mặt phẳng lớn mà phim hoặc hình ảnh được chiếu trên"
                },
                "examples": [
                    {
                        "en": "a cinema/movie screen",
                        "vi": "rạp chiếu phim / màn hình chiếu phim"
                    },
                    {
                        "en": "an eight-screen cinema",
                        "vi": "rạp chiếu phim tám màn hình"
                    },
                    {
                        "en": "The movie will be coming to your screens shortly.",
                        "vi": "Bộ phim sẽ sớm ra rạp."
                    },
                    {
                        "en": "This film should keep you glued to the screen (= unable to stop watching) for two hours.",
                        "vi": "Bộ phim này sẽ khiến bạn dán mắt vào màn hình (= không thể ngừng xem) trong hai giờ."
                    },
                    {
                        "en": "The film hits cinema screens in November.",
                        "vi": "Phim sẽ ra rạp vào tháng 11."
                    },
                    {
                        "en": "The film demands to be seen on a big screen.",
                        "vi": "Bộ phim yêu cầu được xem trên màn hình lớn."
                    }
                ]
            },
            {
                "define": {
                    "en": "films or television in general",
                    "vi": "phim hay truyền hình nói chung"
                },
                "examples": [
                    {
                        "en": "He has adapted the play for the screen.",
                        "vi": "Anh ấy đã chuyển thể vở kịch cho màn ảnh."
                    },
                    {
                        "en": "on screen Some actors never watch themselves on screen.",
                        "vi": "trên màn hình Một số diễn viên không bao giờ xem mình trên màn hình."
                    },
                    {
                        "en": "His face never appears on screen.",
                        "vi": "Khuôn mặt của anh ấy không bao giờ xuất hiện trên màn hình."
                    },
                    {
                        "en": "She was a star of stage and screen (= plays and films).",
                        "vi": "Cô ấy là một ngôi sao của sân khấu và màn ảnh (= vở kịch và phim)."
                    },
                    {
                        "en": "a screen actor",
                        "vi": "một diễn viên màn ảnh"
                    },
                    {
                        "en": "She has great screen presence (= she makes a good impression on screen).",
                        "vi": "Cô ấy có sự hiện diện tuyệt vời trên màn ảnh (= cô ấy tạo được ấn tượng tốt trên màn ảnh)."
                    },
                    {
                        "en": "He made his screen debut in 1954 as a stable boy.",
                        "vi": "Anh xuất hiện lần đầu trên màn ảnh vào năm 1954 với tư cách là một cậu bé ổn định."
                    },
                    {
                        "en": "the screen adaptation (= film) of John Steinbeck's novel East of Eden",
                        "vi": "chuyển thể màn ảnh (= phim) từ tiểu thuyết Phía đông vườn địa đàng của John Steinbeck"
                    }
                ]
            },
            {
                "define": {
                    "en": "the data or images shown on a computer screen",
                    "vi": "dữ liệu hoặc hình ảnh được hiển thị trên màn hình máy tính"
                },
                "examples": [
                    {
                        "en": "Press the F1 key to display a help screen.",
                        "vi": "Nhấn phím F1 để hiển thị màn hình trợ giúp."
                    },
                    {
                        "en": "Can you do a printout of this screen for me?",
                        "vi": "Bạn có thể làm một bản in màn hình này cho tôi được không?"
                    },
                    {
                        "en": "I posted the screen grab on Twitter.",
                        "vi": "Tôi đã đăng bức ảnh chụp màn hình trên Twitter."
                    }
                ]
            },
            {
                "define": {
                    "en": "a tall, flat piece of furniture or equipment that is fixed to a wall, etc. or that can be moved to divide a room or to keep one area hidden or separate",
                    "vi": "một món đồ nội thất hoặc thiết bị cao, bằng phẳng được gắn cố định vào tường, v.v. hoặc có thể được di chuyển để chia phòng hoặc để ẩn hoặc tách biệt một khu vực"
                },
                "examples": [
                    {
                        "en": "The nurse put a screen around the bed.",
                        "vi": "Y tá đặt một màn hình xung quanh giường."
                    },
                    {
                        "en": "A wooden screen hid one corner of the room.",
                        "vi": "Một bức bình phong bằng gỗ che khuất một góc phòng."
                    },
                    {
                        "en": "She went behind the screen and changed into the ballet costume.",
                        "vi": "Cô ấy đi ra sau màn hình và thay trang phục múa ba lê."
                    }
                ]
            },
            {
                "define": {
                    "en": "something that prevents somebody from seeing or being aware of something, or that protects somebody/something",
                    "vi": "thứ gì đó ngăn ai đó nhìn thấy hoặc nhận thức được điều gì đó hoặc điều đó bảo vệ ai đó / điều gì đó"
                },
                "examples": [
                    {
                        "en": "screen (of something) We planted a screen of tall trees.",
                        "vi": "màn hình (của cái gì đó) Chúng tôi trồng một màn hình cây cao."
                    },
                    {
                        "en": "A screen of bodyguards protected the President.",
                        "vi": "Một màn vệ sĩ bảo vệ Tổng thống."
                    },
                    {
                        "en": "behind a screen of something (figurative) All the research was conducted behind a screen of secrecy.",
                        "vi": "đằng sau một tấm bình phong của một cái gì đó (nghĩa bóng) Tất cả các nghiên cứu được tiến hành đằng sau một tấm bình phong bí mật."
                    }
                ]
            },
            {
                "define": {
                    "en": "a wire or plastic net that is held in a frame and fastened on a window, or a door, to let in air but keep out insects",
                    "vi": "một dây hoặc lưới nhựa được giữ trong khung và buộc chặt trên cửa sổ hoặc cửa ra vào để không khí vào nhưng ngăn côn trùng"
                },
                "examples": [
                    {
                        "en": "Do you have screens on your windows?",
                        "vi": "Bạn có màn hình trên cửa sổ của mình không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "a wood or stone structure in a church, that partly separates the main area from the altar or choir",
                    "vi": "cấu trúc bằng gỗ hoặc đá trong nhà thờ, phần nào ngăn cách khu vực chính với bàn thờ hoặc dàn hợp xướng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a system of checking a person or thing to find out whether or not something, typically a disease, is present",
                    "vi": "một hệ thống kiểm tra một người hoặc một vật để tìm xem có hay không một thứ gì đó, điển hình là một căn bệnh,"
                },
                "examples": [
                    {
                        "en": "You should get a health screen every couple of years.",
                        "vi": "Bạn nên kiểm tra sức khỏe vài năm một lần."
                    },
                    {
                        "en": "Candidates for this position must be able to pass a drug screen.",
                        "vi": "Các ứng cử viên cho vị trí này phải có khả năng vượt qua màn kiểm tra thuốc."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that people’s attention is on or not on something",
                    "vi": "được sử dụng để nói rằng sự chú ý của mọi người đang tập trung vào hoặc không vào một cái gì đó"
                },
                "examples": [
                    {
                        "en": "The issue of terrorism is back on the radar screen.",
                        "vi": "Vấn đề khủng bố đã trở lại trên màn hình radar."
                    },
                    {
                        "en": "Since the scandal broke, all other issues seem to have disappeared off the radar screen as far as the media is concerned.",
                        "vi": "Kể từ khi vụ bê bối nổ ra, tất cả các vấn đề khác dường như đã biến mất khỏi màn hình radar theo như phương tiện truyền thông quan tâm."
                    }
                ]
            }
        ]
    },
    {
        "id": "d15ef79b0b264c9cb56dd274cb81190f",
        "word": "tablet",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈtæblət/",
            "us": "/ˈtæblət/"
        },
        "nearby": [
            {
                "word": "table napkin",
                "pos": "noun"
            },
            {
                "word": "tablespoon",
                "pos": "noun"
            },
            {
                "word": "tablet",
                "pos": "noun"
            },
            {
                "word": "The Tablet",
                "pos": ""
            },
            {
                "word": "table tennis",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small computer that is easy to carry, with a large touch screen and usually without a physical keyboard",
                    "vi": "một máy tính nhỏ dễ mang theo, với màn hình cảm ứng lớn và thường không có bàn phím vật lý"
                },
                "examples": [
                    {
                        "en": "The company has launched its latest 10-inch tablet.",
                        "vi": "Công ty đã ra mắt máy tính bảng 10 inch mới nhất của mình."
                    },
                    {
                        "en": "Consumers show a growing preference for tablets and smartphones over PCs and laptops.",
                        "vi": "Người tiêu dùng ngày càng ưa chuộng máy tính bảng và điện thoại thông minh hơn PC và máy tính xách tay."
                    }
                ]
            },
            {
                "define": {
                    "en": "a small round solid piece of medicine that you swallow",
                    "vi": "bạn nuốt một miếng thuốc rắn hình tròn nhỏ"
                },
                "examples": [
                    {
                        "en": "Take two tablets with water before meals.",
                        "vi": "Uống hai viên với nước trước bữa ăn."
                    },
                    {
                        "en": "I took the tablets prescribed by my doctor.",
                        "vi": "Tôi đã uống thuốc do bác sĩ kê đơn."
                    },
                    {
                        "en": "The drug is now available in tablet and capsule form.",
                        "vi": "Thuốc hiện có dạng viên nén và viên nang."
                    }
                ]
            },
            {
                "define": {
                    "en": "an amount of a substance in a small, round, solid piece",
                    "vi": "một lượng chất ở dạng mảnh nhỏ, tròn, rắn"
                },
                "examples": [
                    {
                        "en": "water purification tablets",
                        "vi": "viên thuốc lọc nước"
                    }
                ]
            },
            {
                "define": {
                    "en": "a flat piece of stone that has words written on it, especially one that has been fixed to a wall in memory of an important person or event",
                    "vi": "một miếng đá phẳng có viết chữ, đặc biệt là một miếng đá đã được cố định vào tường để tưởng nhớ một người hoặc sự kiện quan trọng"
                },
                "examples": [
                    {
                        "en": "The school has a memorial tablet engraved with the name of the founder.",
                        "vi": "Trường có tấm bia kỷ niệm khắc tên người sáng lập."
                    },
                    {
                        "en": "(figurative) We can be very flexible—our entry requirements are not set in tablets of stone (= they can be changed).",
                        "vi": "(nghĩa bóng) Chúng tôi có thể rất linh hoạt — các yêu cầu đầu vào của chúng tôi không được đặt trong các viên đá (= chúng có thể được thay đổi)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of soap",
                    "vi": "một miếng xà phòng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a number of pieces of paper for writing or drawing on, that are fastened together at one edge",
                    "vi": "một số mảnh giấy để viết hoặc vẽ, được gắn chặt với nhau ở một cạnh"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "d2e0bb4b144b49fda8037d85cca077bf",
        "word": "chip",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/tʃɪp/",
            "us": "/tʃɪp/"
        },
        "nearby": [
            {
                "word": "chin-up",
                "pos": "noun"
            },
            {
                "word": "chinwag",
                "pos": "noun"
            },
            {
                "word": "chip",
                "pos": "noun"
            },
            {
                "word": "chip",
                "pos": "verb"
            },
            {
                "word": "chip and PIN",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a long thin piece of potato fried in oil or fat",
                    "vi": "một miếng khoai tây mỏng dài chiên trong dầu hoặc mỡ"
                },
                "examples": [
                    {
                        "en": "He was eating a burger and chips.",
                        "vi": "Anh ấy đang ăn một chiếc bánh mì kẹp thịt và khoai tây chiên."
                    },
                    {
                        "en": "a bag of chips",
                        "vi": "một túi khoai tây chiên"
                    },
                    {
                        "en": "All main courses are served with chips or baked potato.",
                        "vi": "Tất cả các món chính được phục vụ với khoai tây chiên hoặc khoai tây nướng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a thin round slice of potato that is fried until hard then dried and eaten cold. Chips are sold in bags and are made to taste of many different foods.",
                    "vi": "một lát mỏng khoai tây chiên cho đến khi cứng sau đó sấy khô và ăn lạnh. Khoai tây chiên được bán trong túi và được tạo ra để tạo hương vị của nhiều loại thực phẩm khác nhau."
                },
                "examples": [
                    {
                        "en": "a bag of chips",
                        "vi": "một túi khoai tây chiên"
                    }
                ]
            },
            {
                "define": {
                    "en": "a small flat hard piece of food, often like a triangle in shape, made from maize",
                    "vi": "một miếng thức ăn cứng dẹt nhỏ, thường giống hình tam giác, được làm từ ngô"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the place from which a small piece of wood, glass, etc. has broken from an object",
                    "vi": "nơi mà một mảnh gỗ nhỏ, thủy tinh, v.v. bị vỡ ra từ một vật thể"
                },
                "examples": [
                    {
                        "en": "This mug has a chip in it.",
                        "vi": "Cốc này có một con chip trong đó."
                    },
                    {
                        "en": "She had a slight chip off her front tooth.",
                        "vi": "Cô ấy bị mẻ một chút răng cửa."
                    }
                ]
            },
            {
                "define": {
                    "en": "a small piece of wood, glass, etc. that has broken or been broken off an object",
                    "vi": "một mảnh gỗ nhỏ, thủy tinh, v.v. bị vỡ hoặc bị vỡ ra khỏi một vật thể"
                },
                "examples": [
                    {
                        "en": "chips of wood",
                        "vi": "dăm gỗ"
                    },
                    {
                        "en": "chocolate chip cookies (= biscuits containing small pieces of chocolate)",
                        "vi": "bánh quy sô cô la chip (= bánh quy có chứa các miếng sô cô la nhỏ)"
                    },
                    {
                        "en": "The gutted raw fish are smoked slowly over wood chips.",
                        "vi": "Cá sống đã rút ruột được hun khói từ từ trên dăm gỗ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a small flat piece of plastic used to represent a particular amount of money in some types of gambling",
                    "vi": "một miếng nhựa phẳng nhỏ được sử dụng để đại diện cho một số tiền cụ thể trong một số loại cờ bạc"
                },
                "examples": [
                    {
                        "en": "a poker chip",
                        "vi": "một con chip poker"
                    }
                ]
            },
            {
                "define": {
                    "en": "an act of hitting or kicking a ball high in the air so that it lands within a short distance",
                    "vi": "hành động đánh hoặc đá một quả bóng lên cao để nó hạ cánh trong một khoảng cách ngắn"
                },
                "examples": [
                    {
                        "en": "She left herself with a short chip to the green.",
                        "vi": "Cô ấy để lại cho mình một con chip ngắn ở green."
                    }
                ]
            },
            {
                "define": {
                    "en": "to die",
                    "vi": "chết"
                },
                "examples": [
                    {
                        "en": "He cashed in his chips last summer aged 65.",
                        "vi": "Anh ấy đã kiếm tiền mặt bằng chip của mình vào mùa hè năm ngoái ở tuổi 65."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who is very similar to their mother or father in the way that they look or behave",
                    "vi": "một người rất giống với mẹ hoặc cha của họ trong cách họ nhìn hoặc cư xử"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be sensitive about something that happened in the past and become easily offended if it is mentioned because you think that you were treated unfairly",
                    "vi": "nhạy cảm về điều gì đó đã xảy ra trong quá khứ và dễ bị xúc phạm nếu nó được đề cập vì bạn nghĩ rằng bạn đã bị đối xử bất công"
                },
                "examples": [
                    {
                        "en": "He has a real chip on his shoulder about being adopted.",
                        "vi": "Anh ấy có một con chip thực sự trên vai về việc được nhận làm con nuôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be in a situation in which you are certain to be defeated or killed",
                    "vi": "ở trong một tình huống mà bạn chắc chắn sẽ bị đánh bại hoặc bị giết"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to refer to a difficult situation in which you are forced to decide what is important to you",
                    "vi": "được sử dụng để chỉ một tình huống khó khăn mà bạn buộc phải quyết định điều gì là quan trọng đối với bạn"
                },
                "examples": [
                    {
                        "en": "I'm not sure what I'll do when the chips are down.",
                        "vi": "Tôi không chắc mình sẽ làm gì khi chip giảm giá."
                    },
                    {
                        "en": "When the chips are down he always finds the courage to carry on.",
                        "vi": "Khi số tiền giảm giá, anh ấy luôn tìm thấy can đảm để tiếp tục."
                    }
                ]
            }
        ]
    },
    {
        "id": "5b54348b3c6f44ffa7fd905ce1771b3d",
        "word": "flat-screen",
        "pos": "adjective",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈflæt skriːn/",
            "us": "/ˈflæt skriːn/"
        },
        "nearby": [
            {
                "word": "flat racing",
                "pos": "noun"
            },
            {
                "word": "flat rate",
                "pos": "noun"
            },
            {
                "word": "flat-screen",
                "pos": "adjective"
            },
            {
                "word": "flat spin",
                "pos": "noun"
            },
            {
                "word": "flatten",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a type of television or computer monitor that is very thin when compared with the original type",
                    "vi": "một loại tivi hoặc màn hình máy tính rất mỏng khi so sánh với loại ban đầu"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "2fc86eaebe174466a18d9014ee370e94",
        "word": "iPod™",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈaɪpɒd/",
            "us": "/ˈaɪpɑːd/"
        },
        "nearby": [
            {
                "word": "IPM",
                "pos": "abbreviation"
            },
            {
                "word": "IPO",
                "pos": "abbreviation"
            },
            {
                "word": "iPod",
                "pos": "noun"
            },
            {
                "word": "IPSO",
                "pos": ""
            },
            {
                "word": "ipso facto",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a brand of MP3 player that can store information taken from the internet and that you carry with you, for example so that you can listen to music",
                    "vi": "một thương hiệu máy nghe nhạc MP3 có thể lưu trữ thông tin lấy từ internet và bạn mang theo bên mình, chẳng hạn như để bạn có thể nghe nhạc"
                },
                "examples": [
                    {
                        "en": "The iPod plays audio for up to 20 hours.",
                        "vi": "IPod phát âm thanh lên đến 20 giờ."
                    },
                    {
                        "en": "downloadable subway maps for your iPod",
                        "vi": "bản đồ tàu điện ngầm có thể tải xuống cho iPod của bạn"
                    }
                ]
            }
        ]
    },
    {
        "id": "4e965698966e455bb1b985b29f368eb7",
        "word": "keyboard",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈkiːbɔːd/",
            "us": "/ˈkiːbɔːrd/"
        },
        "nearby": [
            {
                "word": "key",
                "pos": "adjective"
            },
            {
                "word": "key",
                "pos": "verb"
            },
            {
                "word": "keyboard",
                "pos": "noun"
            },
            {
                "word": "keyboard",
                "pos": "verb"
            },
            {
                "word": "keyboarder",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the set of keys for operating a computer or typewriter, or the set of letters that you can touch to write on a smartphone or tablet",
                    "vi": "bộ phím để vận hành máy tính hoặc máy đánh chữ hoặc bộ các chữ cái mà bạn có thể chạm vào để viết trên điện thoại thông minh hoặc máy tính bảng"
                },
                "examples": [
                    {
                        "en": "The program locks the keyboard until a password is given.",
                        "vi": "Chương trình sẽ khóa bàn phím cho đến khi có mật khẩu."
                    },
                    {
                        "en": "keyboard shortcuts",
                        "vi": "các phím tắt bàn phím"
                    }
                ]
            },
            {
                "define": {
                    "en": "the set of black and white keys on a piano or other musical instrument",
                    "vi": "bộ phím đen trắng trên đàn piano hoặc nhạc cụ khác"
                },
                "examples": [
                    {
                        "en": "a piano keyboard",
                        "vi": "bàn phím đàn piano"
                    }
                ]
            },
            {
                "define": {
                    "en": "an electronic musical instrument that has keys like a piano and can be made to play in different styles or to sound like different instruments",
                    "vi": "một nhạc cụ điện tử có các phím như đàn piano và có thể được tạo ra để chơi theo các phong cách khác nhau hoặc để phát ra âm thanh như các nhạc cụ khác nhau"
                },
                "examples": [
                    {
                        "en": "She plays keyboard and guitar.",
                        "vi": "Cô ấy chơi keyboard và guitar."
                    },
                    {
                        "en": "on (a) keyboard He played the song on his keyboard.",
                        "vi": "trên bàn phím (a) Anh ấy đã chơi bài hát trên bàn phím của mình."
                    },
                    {
                        "en": "The recording features Herbie Hancock on keyboard.",
                        "vi": "Bản ghi âm có sự góp mặt của Herbie Hancock trên bàn phím."
                    },
                    {
                        "en": "at a keyboard She sat down at the keyboard and started to play.",
                        "vi": "at a keyboard Cô ấy ngồi xuống bàn phím và bắt đầu chơi."
                    }
                ]
            }
        ]
    },
    {
        "id": "6814798438d3408d824555452c53f733",
        "word": "Wi-Fi™",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈwaɪ faɪ/",
            "us": "/ˈwaɪ faɪ/"
        },
        "nearby": [
            {
                "word": "the Wife of Bath",
                "pos": ""
            },
            {
                "word": "wife-swapping",
                "pos": "noun"
            },
            {
                "word": "Wi-Fi",
                "pos": "noun"
            },
            {
                "word": "wig",
                "pos": "noun"
            },
            {
                "word": "wig",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a system for connecting to the internet or sending data over computer networks using radio waves instead of wires",
                    "vi": "hệ thống kết nối internet hoặc gửi dữ liệu qua mạng máy tính bằng sóng vô tuyến thay vì dây"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a2505a2d6c21402ebf20ce5db32c53dc",
        "word": "wireless",
        "pos": "adjective",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈwaɪələs/",
            "us": "/ˈwaɪərləs/"
        },
        "nearby": [
            {
                "word": "wire fraud",
                "pos": "noun"
            },
            {
                "word": "wireless",
                "pos": "noun"
            },
            {
                "word": "wireless",
                "pos": "adjective"
            },
            {
                "word": "wirelessly",
                "pos": "adverb"
            },
            {
                "word": "wire netting",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "not using wires",
                    "vi": "không sử dụng dây"
                },
                "examples": [
                    {
                        "en": "wireless communications",
                        "vi": "giao tiếp không dây"
                    }
                ]
            }
        ]
    },
    {
        "id": "63ab557568604d889542252ea6c405cb",
        "word": "CD-ROM",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˌsiː diː ˈrɒm/",
            "us": "/ˌsiː diː ˈrɑːm/"
        },
        "nearby": [
            {
                "word": "CD-R",
                "pos": "noun"
            },
            {
                "word": "Cdre",
                "pos": "abbreviation"
            },
            {
                "word": "CD-ROM",
                "pos": "noun"
            },
            {
                "word": "CD-RW",
                "pos": "noun"
            },
            {
                "word": "CDT",
                "pos": "abbreviation"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a type of CD used with a computer on which information, sound and pictures can only be read and not written by the computer (the abbreviation for ‘compact disc read-only memory’)",
                    "vi": "một loại đĩa CD được sử dụng với máy tính mà máy tính chỉ có thể đọc thông tin, âm thanh và hình ảnh (chữ viết tắt của 'bộ nhớ chỉ đọc đĩa compact')"
                },
                "examples": [
                    {
                        "en": "The software package contains 5 CD-ROMs.",
                        "vi": "Gói phần mềm chứa 5 đĩa CD-ROM."
                    },
                    {
                        "en": "on CD-ROM The encyclopedia is available on CD-ROM.",
                        "vi": "trên CD-ROM Bách khoa toàn thư có sẵn trên CD-ROM."
                    },
                    {
                        "en": "a CD-ROM drive (= in a computer)",
                        "vi": "ổ CD-ROM (= trong máy tính)"
                    },
                    {
                        "en": "This is the CD-ROM edition of the encyclopedia.",
                        "vi": "Đây là ấn bản CD-ROM của bách khoa toàn thư."
                    }
                ]
            }
        ]
    },
    {
        "id": "1735c02d51674912ad923e805ac5659b",
        "word": "disk",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/dɪsk/",
            "us": "/dɪsk/"
        },
        "nearby": [
            {
                "word": "disjointed",
                "pos": "adjective"
            },
            {
                "word": "disjunction",
                "pos": "noun"
            },
            {
                "word": "disk",
                "pos": "noun"
            },
            {
                "word": "disk drive",
                "pos": "noun"
            },
            {
                "word": "diskette",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a thin flat round object",
                    "vi": "một vật thể tròn dẹt mỏng"
                },
                "examples": [
                    {
                        "en": "Red blood cells are roughly the shape of a disk.",
                        "vi": "Tế bào hồng cầu có hình dạng gần giống như một chiếc đĩa."
                    }
                ]
            },
            {
                "define": {
                    "en": "a device for storing information on a computer, in the shape of a round flat plate that spins (= turns) to give access to all parts of its magnetic surface, which records information received in electronic form",
                    "vi": "một thiết bị để lưu trữ thông tin trên máy tính, có hình dạng một tấm phẳng tròn quay (= quay) để cho phép truy cập vào tất cả các phần của bề mặt từ tính của nó, thiết bị này ghi lại thông tin nhận được dưới dạng điện tử"
                },
                "examples": [
                    {
                        "en": "I'll copy the disk into a file.",
                        "vi": "Tôi sẽ sao chép đĩa vào một tệp."
                    },
                    {
                        "en": "The information required can then be retrieved from disk.",
                        "vi": "Thông tin được yêu cầu sau đó có thể được truy xuất từ đĩa."
                    },
                    {
                        "en": "I'm running out of disk space on my computer.",
                        "vi": "Tôi sắp hết dung lượng ổ đĩa trên máy tính của mình."
                    }
                ]
            }
        ]
    },
    {
        "id": "b5386035d63345e0981c967ef0786d96",
        "word": "e-reader",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈiː riːdə(r)/",
            "us": "/ˈiː riːdər/"
        },
        "nearby": [
            {
                "word": "erbium",
                "pos": "noun"
            },
            {
                "word": "ere",
                "pos": "conjunction, preposition"
            },
            {
                "word": "e-reader",
                "pos": "noun"
            },
            {
                "word": "erect",
                "pos": "verb"
            },
            {
                "word": "erect",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small device on which you can store and read texts taken from the internet; an application on a device that enables you to do this",
                    "vi": "một thiết bị nhỏ mà bạn có thể lưu trữ và đọc các văn bản lấy từ internet; một ứng dụng trên thiết bị cho phép bạn làm điều này"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "8009650d02054fa4986a2aeb286e824a",
        "word": "handheld",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/ˌhændˈheld/",
            "us": "/ˌhændˈheld/"
        },
        "nearby": [
            {
                "word": "handgun",
                "pos": "noun"
            },
            {
                "word": "handheld",
                "pos": "noun"
            },
            {
                "word": "handheld",
                "pos": "adjective"
            },
            {
                "word": "handhold",
                "pos": "noun"
            },
            {
                "word": "hand-hot",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "small enough to be held in the hand while being used",
                    "vi": "đủ nhỏ để cầm trong tay khi sử dụng"
                },
                "examples": [
                    {
                        "en": "a handheld camera/device",
                        "vi": "một máy ảnh / thiết bị cầm tay"
                    }
                ]
            }
        ]
    },
    {
        "id": "7b829cde7f7442ae85aa74c981ed241b",
        "word": "Memory Stick™",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈmeməri stɪk/",
            "us": "/ˈmeməri stɪk/"
        },
        "nearby": [
            {
                "word": "memory card",
                "pos": "noun"
            },
            {
                "word": "memory lane",
                "pos": "noun"
            },
            {
                "word": "Memory Stick",
                "pos": "noun"
            },
            {
                "word": "Memphis",
                "pos": ""
            },
            {
                "word": "memsahib",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small memory device that can be used to store data from a computer and to move it from one computer to another",
                    "vi": "một thiết bị nhớ nhỏ có thể được sử dụng để lưu trữ dữ liệu từ máy tính và di chuyển dữ liệu từ máy tính này sang máy tính khác"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "80b5e9d06b7042b48b4a76338b0415f8",
        "word": "monitor",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈmɒnɪtə(r)/",
            "us": "/ˈmɑːnɪtər/"
        },
        "nearby": [
            {
                "word": "moniker",
                "pos": "noun"
            },
            {
                "word": "monism",
                "pos": "noun"
            },
            {
                "word": "monitor",
                "pos": "noun"
            },
            {
                "word": "monitor",
                "pos": "verb"
            },
            {
                "word": "Monitor and Merrimack",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a screen that shows information from a computer; a television screen used to show particular kinds of information",
                    "vi": "màn hình hiển thị thông tin từ máy tính; một màn hình tivi được sử dụng để hiển thị các loại thông tin cụ thể"
                },
                "examples": [
                    {
                        "en": "The details of today's flights are displayed on the monitor.",
                        "vi": "Các chi tiết của các chuyến bay ngày hôm nay được hiển thị trên màn hình."
                    },
                    {
                        "en": "The pages are designed to be viewed on a computer monitor.",
                        "vi": "Các trang được thiết kế để xem trên màn hình máy tính."
                    },
                    {
                        "en": "We included the costs of monitor, keyboard, mouse and speakers.",
                        "vi": "Chúng tôi đã bao gồm chi phí của màn hình, bàn phím, chuột và loa."
                    },
                    {
                        "en": "The security staff can see all the outside of the building on their CCTV monitors.",
                        "vi": "Các nhân viên an ninh có thể nhìn thấy tất cả bên ngoài của tòa nhà trên màn hình CCTV của họ."
                    },
                    {
                        "en": "the display quality on LCD monitors has greatly improved.",
                        "vi": "chất lượng hiển thị trên màn hình LCD đã được cải thiện rất nhiều."
                    },
                    {
                        "en": "The laboratory is replete with banks of video monitors.",
                        "vi": "Phòng thí nghiệm được trang bị đầy đủ các ngân hàng màn hình video."
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of equipment used to check or record something",
                    "vi": "một phần của thiết bị được sử dụng để kiểm tra hoặc ghi lại một cái gì đó"
                },
                "examples": [
                    {
                        "en": "He was lying there hooked up to a heart monitor.",
                        "vi": "Anh ta đang nằm đó được nối với một máy đo tim."
                    },
                    {
                        "en": "Mia kept a two-way baby monitor in the living room so Harry's cries could be heard.",
                        "vi": "Mia để một màn hình hai chiều dành cho em bé trong phòng khách để có thể nghe thấy tiếng khóc của Harry."
                    },
                    {
                        "en": "A nurse checked his monitor for changes in ECG rhythms, pulse and oxygen saturation.",
                        "vi": "Một y tá đã kiểm tra màn hình của anh ta để tìm những thay đổi trong nhịp ECG, mạch và độ bão hòa oxy."
                    },
                    {
                        "en": "The heart monitor shows the strength of your pulse.",
                        "vi": "Máy theo dõi tim hiển thị cường độ nhịp đập của bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person whose job is to check that something is done fairly and honestly, especially in a foreign country",
                    "vi": "một người có công việc là kiểm tra xem điều gì đó được thực hiện một cách công bằng và trung thực, đặc biệt là ở nước ngoài"
                },
                "examples": [
                    {
                        "en": "UN monitors declared the referendum fair.",
                        "vi": "Các giám sát viên của LHQ tuyên bố cuộc trưng cầu dân ý là công bằng."
                    },
                    {
                        "en": "The EU has agreed to provide monitors for the crossing.",
                        "vi": "EU đã đồng ý cung cấp các giám sát cho việc vượt biển."
                    },
                    {
                        "en": "Monitors or observers help to build trust between the two sides.",
                        "vi": "Người theo dõi hoặc quan sát giúp xây dựng lòng tin giữa hai bên."
                    }
                ]
            },
            {
                "define": {
                    "en": "a student in a school who performs special duties, such as helping the teacher",
                    "vi": "một học sinh trong trường thực hiện các nhiệm vụ đặc biệt, chẳng hạn như giúp đỡ giáo viên"
                },
                "examples": [
                    {
                        "en": "He was a star pupil and the class monitor.",
                        "vi": "Anh ấy là một học sinh ngôi sao và là người đứng đầu lớp."
                    }
                ]
            },
            {
                "define": {
                    "en": "a large tropical lizard (= a type of reptile)",
                    "vi": "thằn lằn nhiệt đới lớn (= một loại bò sát)"
                },
                "examples": [
                    {
                        "en": "A large monitor lizard, prehistoric in its beauty, stared at us.",
                        "vi": "Một con thằn lằn màn hình lớn, từ thời tiền sử với vẻ đẹp của nó, đang nhìn chằm chằm vào chúng tôi."
                    }
                ]
            }
        ]
    },
    {
        "id": "53e227365aba48708338e6776180e4e3",
        "word": "mouse mat",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈmaʊs mæt/",
            "us": "/ˈmaʊs mæt/"
        },
        "nearby": [
            {
                "word": "mouse",
                "pos": "noun"
            },
            {
                "word": "mouse",
                "pos": "verb"
            },
            {
                "word": "mouse mat",
                "pos": "noun"
            },
            {
                "word": "mouse over",
                "pos": "phrasal verb"
            },
            {
                "word": "mouseover",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small square of material that is the best kind of surface on which to use a computer mouse",
                    "vi": "một hình vuông nhỏ bằng vật liệu là loại bề mặt tốt nhất để sử dụng chuột máy tính"
                },
                "examples": [
                    {
                        "en": "If the surface is not smooth, use a mouse mat.",
                        "vi": "Nếu bề mặt không nhẵn, hãy sử dụng tấm lót chuột."
                    }
                ]
            }
        ]
    },
    {
        "id": "e1bfcee5e4004f51b0b7a7a428ecfb2b",
        "word": "scanner",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈskænə(r)/",
            "us": "/ˈskænər/"
        },
        "nearby": [
            {
                "word": "scan in",
                "pos": "phrasal verb"
            },
            {
                "word": "scan into",
                "pos": "phrasal verb"
            },
            {
                "word": "scanner",
                "pos": "noun"
            },
            {
                "word": "scansion",
                "pos": "noun"
            },
            {
                "word": "scant",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a device for examining something or recording something using light, sound or X-rays",
                    "vi": "một thiết bị để kiểm tra một cái gì đó hoặc ghi lại một cái gì đó bằng ánh sáng, âm thanh hoặc tia X"
                },
                "examples": [
                    {
                        "en": "The identity cards are examined by an electronic scanner.",
                        "vi": "Chứng minh nhân dân được kiểm tra bằng máy quét điện tử."
                    }
                ]
            },
            {
                "define": {
                    "en": "a device which copies pictures and documents so that they can be stored on a computer",
                    "vi": "một thiết bị sao chép hình ảnh và tài liệu để chúng có thể được lưu trữ trên máy tính"
                },
                "examples": [
                    {
                        "en": "a document scanner",
                        "vi": "máy quét tài liệu"
                    }
                ]
            },
            {
                "define": {
                    "en": "a machine used by doctors to produce a picture of the inside of a person’s body on a computer screen",
                    "vi": "một chiếc máy được các bác sĩ sử dụng để tạo ra hình ảnh bên trong cơ thể một người trên màn hình máy tính"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a piece of equipment for receiving and sending radar signals",
                    "vi": "một phần của thiết bị để nhận và gửi tín hiệu radar"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "b67bd409f5ae4e4499543f9d5cd3be9e",
        "word": "touchscreen",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈtʌtʃskriːn/",
            "us": "/ˈtʌtʃskriːn/"
        },
        "nearby": [
            {
                "word": "touchpaper",
                "pos": "noun"
            },
            {
                "word": "touch point",
                "pos": "noun"
            },
            {
                "word": "touchscreen",
                "pos": "noun"
            },
            {
                "word": "touch-sensitive",
                "pos": "adjective"
            },
            {
                "word": "touchstone",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a screen on a computer, phone, etc. that allows you to give instructions to the device by touching areas on it",
                    "vi": "màn hình trên máy tính, điện thoại, v.v. cho phép bạn đưa ra hướng dẫn cho thiết bị bằng cách chạm vào các vùng trên thiết bị"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "033bf5e12d7d4f4a8ae40a2fd0dc733c",
        "word": "unit",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈjuːnɪt/",
            "us": "/ˈjuːnɪt/"
        },
        "nearby": [
            {
                "word": "unison",
                "pos": "noun"
            },
            {
                "word": "UNISON",
                "pos": ""
            },
            {
                "word": "unit",
                "pos": "noun"
            },
            {
                "word": "Unitarian",
                "pos": "adjective"
            },
            {
                "word": "Unitarian",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a single thing, person or group that is complete by itself but can also form part of something larger",
                    "vi": "một thứ đơn lẻ, một người hoặc một nhóm tự nó hoàn chỉnh nhưng cũng có thể tạo thành một phần của thứ gì đó lớn hơn"
                },
                "examples": [
                    {
                        "en": "After 1946 the British Government treated the four territorial divisions as a single unit.",
                        "vi": "Sau năm 1946, Chính phủ Anh coi bốn đơn vị lãnh thổ như một đơn vị duy nhất."
                    },
                    {
                        "en": "The basic unit of society is the family.",
                        "vi": "Đơn vị cơ bản của xã hội là gia đình."
                    },
                    {
                        "en": "The cell is the unit of which all living organisms are composed.",
                        "vi": "Tế bào là đơn vị cấu tạo nên tất cả các cơ thể sống."
                    },
                    {
                        "en": "the role of the family unit in the community",
                        "vi": "vai trò của đơn vị gia đình trong cộng đồng"
                    }
                ]
            },
            {
                "define": {
                    "en": "a single item of the type of product that a company sells",
                    "vi": "một mặt hàng duy nhất của loại sản phẩm mà một công ty bán"
                },
                "examples": [
                    {
                        "en": "The game's selling price was $15 per unit.",
                        "vi": "Giá bán của trò chơi là 15 đô la một chiếc."
                    },
                    {
                        "en": "What's the unit cost?",
                        "vi": "Đơn giá là bao nhiêu?"
                    }
                ]
            },
            {
                "define": {
                    "en": "one of the parts into which a textbook or a series of lessons is divided",
                    "vi": "một trong những phần mà sách giáo khoa hoặc một chuỗi bài học được chia thành"
                },
                "examples": [
                    {
                        "en": "Each unit of the course that we completed felt like a real achievement.",
                        "vi": "Mỗi đơn vị của khóa học mà chúng tôi đã hoàn thành đều cảm thấy như một thành tích thực sự."
                    },
                    {
                        "en": "in a unit The present perfect is covered in Unit 8.",
                        "vi": "in a unit Thì hiện tại hoàn hảo được đề cập trong Unit 8."
                    },
                    {
                        "en": "The university is recruiting staff to teach the new units.",
                        "vi": "Trường đại học đang tuyển dụng nhân viên để giảng dạy cho các đơn vị mới."
                    },
                    {
                        "en": "You learned this in the first unit.",
                        "vi": "Bạn đã học được điều này trong đơn vị đầu tiên."
                    }
                ]
            },
            {
                "define": {
                    "en": "a group of people who work or live together, especially for a particular purpose",
                    "vi": "một nhóm người làm việc hoặc sống cùng nhau, đặc biệt là cho một mục đích cụ thể"
                },
                "examples": [
                    {
                        "en": "army/military/combat/police units",
                        "vi": "quân đội / quân đội / chiến đấu / đơn vị cảnh sát"
                    },
                    {
                        "en": "a special unit of the FBI",
                        "vi": "một đơn vị đặc biệt của FBI"
                    },
                    {
                        "en": "Medical units were operating in the disaster area.",
                        "vi": "Các đơn vị y tế đã hoạt động trong vùng thiên tai."
                    },
                    {
                        "en": "Two members of the unit died on the mission.",
                        "vi": "Hai thành viên của đơn vị đã hy sinh khi thực hiện nhiệm vụ."
                    },
                    {
                        "en": "They formed small units of 15 to 20 people.",
                        "vi": "Họ thành lập các đơn vị nhỏ từ 15 đến 20 người."
                    },
                    {
                        "en": "The marching column encountered large units of the enemy.",
                        "vi": "Cột quân hành quân gặp phải các đơn vị lớn của địch."
                    },
                    {
                        "en": "in a unit Soldiers in the unit are trained to survive in the snow and cold.",
                        "vi": "trong một đơn vị Các binh sĩ trong đơn vị được huấn luyện để tồn tại trong tuyết và lạnh."
                    }
                ]
            },
            {
                "define": {
                    "en": "a department, especially in a hospital, that provides a particular type of care or treatment",
                    "vi": "một bộ phận, đặc biệt là trong bệnh viện, cung cấp một loại hình chăm sóc hoặc điều trị cụ thể"
                },
                "examples": [
                    {
                        "en": "the intensive care unit",
                        "vi": "đơn vị chăm sóc đặc biệt"
                    },
                    {
                        "en": "a maternity unit",
                        "vi": "một đơn vị thai sản"
                    },
                    {
                        "en": "The cancer research unit is attached to the local university.",
                        "vi": "Đơn vị nghiên cứu ung thư trực thuộc trường đại học địa phương."
                    },
                    {
                        "en": "patients in the psychiatric unit",
                        "vi": "bệnh nhân trong đơn vị tâm thần"
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of furniture, especially a cupboard, that fits with and matches others of the same type",
                    "vi": "một món đồ nội thất, đặc biệt là một cái tủ, vừa vặn và phù hợp với những món đồ khác cùng loại"
                },
                "examples": [
                    {
                        "en": "a fitted kitchen with white units",
                        "vi": "một nhà bếp đầy đủ tiện nghi với các đơn vị màu trắng"
                    },
                    {
                        "en": "floor/wall units",
                        "vi": "đơn vị sàn / tường"
                    },
                    {
                        "en": "bedroom/kitchen units",
                        "vi": "phòng ngủ / phòng bếp"
                    }
                ]
            },
            {
                "define": {
                    "en": "a fixed quantity, etc. that is used as a standard measurement",
                    "vi": "một đại lượng cố định, v.v. được sử dụng làm phép đo tiêu chuẩn"
                },
                "examples": [
                    {
                        "en": "a unit of measurement",
                        "vi": "một đơn vị đo lường"
                    },
                    {
                        "en": "Women are advised not to drink more than fourteen units of alcohol per week.",
                        "vi": "Phụ nữ được khuyến cáo không nên uống nhiều hơn 14 đơn vị rượu mỗi tuần."
                    },
                    {
                        "en": "a unit of time/length/weight",
                        "vi": "một đơn vị thời gian / chiều dài / trọng lượng"
                    },
                    {
                        "en": "a unit of currency, such as the euro or the dollar",
                        "vi": "một đơn vị tiền tệ, chẳng hạn như đồng euro hoặc đồng đô la"
                    },
                    {
                        "en": "per unit Electricity is ten pence per unit.",
                        "vi": "mỗi đơn vị Điện là mười pence trên một đơn vị."
                    },
                    {
                        "en": "The law requires almost all federal agencies to use metric units.",
                        "vi": "Luật yêu cầu hầu hết tất cả các cơ quan liên bang sử dụng đơn vị hệ mét."
                    },
                    {
                        "en": "The highest carbon emissions per unit of energy are from coal.",
                        "vi": "Lượng khí thải carbon cao nhất trên một đơn vị năng lượng là từ than đá."
                    }
                ]
            },
            {
                "define": {
                    "en": "a small machine that has a particular purpose or is part of a larger machine",
                    "vi": "một máy nhỏ có mục đích cụ thể hoặc là một phần của máy lớn hơn"
                },
                "examples": [
                    {
                        "en": "a waste disposal unit",
                        "vi": "một đơn vị xử lý chất thải"
                    },
                    {
                        "en": "the central processing unit of a computer",
                        "vi": "đơn vị xử lý trung tâm của máy tính"
                    },
                    {
                        "en": "an air-conditioning unit",
                        "vi": "một đơn vị điều hòa không khí"
                    }
                ]
            },
            {
                "define": {
                    "en": "a single flat, house or section in a building or group of buildings",
                    "vi": "một căn hộ, một ngôi nhà hoặc một phần trong một tòa nhà hoặc một nhóm tòa nhà"
                },
                "examples": [
                    {
                        "en": "a housing/residential unit",
                        "vi": "một nhà ở / đơn vị ở"
                    },
                    {
                        "en": "to build new affordable housing units",
                        "vi": "xây dựng các đơn vị nhà ở giá rẻ mới"
                    },
                    {
                        "en": "(Australian English, New Zealand English) The site is being redeveloped for 62 home units.",
                        "vi": "(Tiếng Anh Úc, Tiếng Anh New Zealand) Trang web đang được phát triển lại cho 62 đơn vị gia đình."
                    },
                    {
                        "en": "a single dwelling unit",
                        "vi": "một đơn vị ở"
                    },
                    {
                        "en": "a retail/business unit",
                        "vi": "một đơn vị bán lẻ / kinh doanh"
                    },
                    {
                        "en": "an industrial unit",
                        "vi": "một đơn vị công nghiệp"
                    }
                ]
            },
            {
                "define": {
                    "en": "any whole number from 0 to 9",
                    "vi": "bất kỳ số nguyên nào từ 0 đến 9"
                },
                "examples": [
                    {
                        "en": "a column for the tens and a column for the units",
                        "vi": "một cột cho hàng chục và một cột cho hàng đơn vị"
                    }
                ]
            }
        ]
    },
    {
        "id": "4adae24daafe42bfaeff6679f6dcaf79",
        "word": "webcam",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈwebkæm/",
            "us": "/ˈwebkæm/"
        },
        "nearby": [
            {
                "word": "webbing",
                "pos": "noun"
            },
            {
                "word": "web browser",
                "pos": "noun"
            },
            {
                "word": "webcam",
                "pos": "noun"
            },
            {
                "word": "webcast",
                "pos": "noun"
            },
            {
                "word": "web chat",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a video camera that is connected to a computer so that what it records can be seen on a website or on another computer as it happens",
                    "vi": "một máy quay video được kết nối với máy tính để những gì nó ghi có thể được nhìn thấy trên một trang web hoặc trên một máy tính khác khi nó xảy ra"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "d92c858ee1594c6ba4e9706a704c92f2",
        "word": "BlackBerry™",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈblækbəri/",
            "us": "/ˈblækberi/"
        },
        "nearby": [
            {
                "word": "black belt",
                "pos": "noun"
            },
            {
                "word": "blackberry",
                "pos": "noun"
            },
            {
                "word": "BlackBerry",
                "pos": "noun"
            },
            {
                "word": "blackberrying",
                "pos": "noun"
            },
            {
                "word": "blackbird",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a type of smartphone or tablet",
                    "vi": "một loại điện thoại thông minh hoặc máy tính bảng"
                },
                "examples": [
                    {
                        "en": "Check your emails via your BlackBerry.",
                        "vi": "Kiểm tra email của bạn qua BlackBerry của bạn."
                    }
                ]
            }
        ]
    },
    {
        "id": "38b7fd8d4642430ebcfcc44cb380527d",
        "word": "Bluetooth™",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈbluːtuːθ/",
            "us": "/ˈbluːtuːθ/"
        },
        "nearby": [
            {
                "word": "Blue Tail Fly",
                "pos": ""
            },
            {
                "word": "blue tit",
                "pos": "noun"
            },
            {
                "word": "Bluetooth",
                "pos": "noun"
            },
            {
                "word": "blue whale",
                "pos": "noun"
            },
            {
                "word": "bluff",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a radio technology that makes it possible for mobile phones, computers and other electronic devices to be linked over short distances, without needing to be connected by wires",
                    "vi": "một công nghệ vô tuyến giúp điện thoại di động, máy tính và các thiết bị điện tử khác có thể được liên kết trong khoảng cách ngắn mà không cần kết nối bằng dây"
                },
                "examples": [
                    {
                        "en": "Bluetooth-enabled devices",
                        "vi": "Thiết bị hỗ trợ Bluetooth"
                    }
                ]
            }
        ]
    },
    {
        "id": "f061544d083b452aa0f9e1dd0b8114c1",
        "word": "Blu-ray",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈbluː reɪ/",
            "us": "/ˈbluː reɪ/"
        },
        "nearby": [
            {
                "word": "blur",
                "pos": "verb"
            },
            {
                "word": "Blur",
                "pos": ""
            },
            {
                "word": "Blu-ray",
                "pos": "noun"
            },
            {
                "word": "Blu-ray Disc",
                "pos": "noun"
            },
            {
                "word": "blurb",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "technology that uses a blue laser (= a very strong line of light) to record and play large amounts of high quality data on a type of DVD",
                    "vi": "công nghệ sử dụng tia laser xanh lam (= một dòng ánh sáng rất mạnh) để ghi và phát một lượng lớn dữ liệu chất lượng cao trên một loại DVD"
                },
                "examples": [
                    {
                        "en": "These high definition movies are all out on Blu-ray.",
                        "vi": "Những bộ phim độ nét cao này đều có trên Blu-ray."
                    }
                ]
            }
        ]
    },
    {
        "id": "b5a4ce59ecef49e9bd19c3711537db62",
        "word": "flash drive",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈflæʃ draɪv/",
            "us": "/ˈflæʃ draɪv/"
        },
        "nearby": [
            {
                "word": "flash by",
                "pos": "phrasal verb"
            },
            {
                "word": "flash card",
                "pos": "noun"
            },
            {
                "word": "flash drive",
                "pos": "noun"
            },
            {
                "word": "flasher",
                "pos": "noun"
            },
            {
                "word": "flash flood",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small memory device that can be used to store data from a computer or digital camera and to move it from one device to another",
                    "vi": "một thiết bị bộ nhớ nhỏ có thể được sử dụng để lưu trữ dữ liệu từ máy tính hoặc máy ảnh kỹ thuật số và di chuyển dữ liệu đó từ thiết bị này sang thiết bị khác"
                },
                "examples": [
                    {
                        "en": "Insert the flash drive into the USB port.",
                        "vi": "Cắm ổ đĩa flash vào cổng USB."
                    },
                    {
                        "en": "The flash drive is compatible with all notebook PCs running Windows.",
                        "vi": "Ổ đĩa flash tương thích với tất cả các máy tính xách tay chạy Windows."
                    }
                ]
            }
        ]
    },
    {
        "id": "3ceb820fb9674e9a9f85dc71f44c24a0",
        "word": "hard disk",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈhɑːd dɪsk/",
            "us": "/ˈhɑːrd dɪsk/"
        },
        "nearby": [
            {
                "word": "hardcover",
                "pos": "noun"
            },
            {
                "word": "hard currency",
                "pos": "noun"
            },
            {
                "word": "hard disk",
                "pos": "noun"
            },
            {
                "word": "hard-drinking",
                "pos": "adjective"
            },
            {
                "word": "hard drive",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a device that stores computer information on a spinning (= turning) disk, either internal or external to the computer",
                    "vi": "một thiết bị lưu trữ thông tin máy tính trên đĩa quay (= quay), bên trong hoặc bên ngoài máy tính"
                },
                "examples": [
                    {
                        "en": "The records will be stored on the computer's hard disk.",
                        "vi": "Các bản ghi sẽ được lưu trữ trên đĩa cứng của máy tính."
                    }
                ]
            }
        ]
    },
    {
        "id": "b7d32b0b6446463d97e2bc550143bd9d",
        "word": "hardware",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈhɑːdweə(r)/",
            "us": "/ˈhɑːrdwer/"
        },
        "nearby": [
            {
                "word": "hardtop",
                "pos": "noun"
            },
            {
                "word": "hard up",
                "pos": "adjective"
            },
            {
                "word": "hardware",
                "pos": "noun"
            },
            {
                "word": "hardware dealer",
                "pos": "noun"
            },
            {
                "word": "hardware store",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the machines and electronic parts in a computer or other electronic system",
                    "vi": "máy móc và các bộ phận điện tử trong máy tính hoặc hệ thống điện tử khác"
                },
                "examples": [
                    {
                        "en": "We supply computer hardware to businesses.",
                        "vi": "Chúng tôi cung cấp phần cứng máy tính cho các doanh nghiệp."
                    },
                    {
                        "en": "The laptop drawing tablet is a very useful piece of hardware.",
                        "vi": "Máy tính bảng vẽ máy tính xách tay là một phần cứng rất hữu ích."
                    },
                    {
                        "en": "This application runs on a wide variety of hardware platforms.",
                        "vi": "Ứng dụng này chạy trên nhiều nền tảng phần cứng."
                    },
                    {
                        "en": "It seems you've got a hardware problem; the disk drive is stuck.",
                        "vi": "Có vẻ như bạn đã gặp sự cố phần cứng; ổ đĩa bị kẹt."
                    }
                ]
            },
            {
                "define": {
                    "en": "tools and equipment that are used in the house and garden",
                    "vi": "dụng cụ và thiết bị được sử dụng trong nhà và vườn"
                },
                "examples": [
                    {
                        "en": "a hardware shop/store",
                        "vi": "một cửa hàng / cửa hàng kim khí"
                    }
                ]
            },
            {
                "define": {
                    "en": "the equipment, machines and vehicles used to do something",
                    "vi": "thiết bị, máy móc và phương tiện được sử dụng để làm một cái gì đó"
                },
                "examples": [
                    {
                        "en": "tanks and other military hardware",
                        "vi": "xe tăng và các khí tài quân sự khác"
                    }
                ]
            }
        ]
    },
    {
        "id": "86fcfb94bafa4f70a4a3a77a5cc3564a",
        "word": "intranet",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈɪntrənet/",
            "us": "/ˈɪntrənet/"
        },
        "nearby": [
            {
                "word": "intramural",
                "pos": "adjective"
            },
            {
                "word": "intramuscular",
                "pos": "adjective"
            },
            {
                "word": "intranet",
                "pos": "noun"
            },
            {
                "word": "intransigence",
                "pos": "noun"
            },
            {
                "word": "intransigent",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a computer network that is private to a company, university, etc. often using the same software as the World Wide Web",
                    "vi": "mạng máy tính dùng riêng cho một công ty, trường đại học, v.v. thường sử dụng cùng một phần mềm với World Wide Web"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "692446176e2e4f0fa6096a9d52ea2cba",
        "word": "memory card",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈmeməri kɑːd/",
            "us": "/ˈmeməri kɑːrd/"
        },
        "nearby": [
            {
                "word": "memory",
                "pos": "noun"
            },
            {
                "word": "memory bank",
                "pos": "noun"
            },
            {
                "word": "memory card",
                "pos": "noun"
            },
            {
                "word": "memory lane",
                "pos": "noun"
            },
            {
                "word": "Memory Stick",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an electronic device that can be used to store data, used especially with digital cameras, mobile phones, music players, etc.",
                    "vi": "một thiết bị điện tử có thể được sử dụng để lưu trữ dữ liệu, được sử dụng đặc biệt với máy ảnh kỹ thuật số, điện thoại di động, máy nghe nhạc, v.v."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "3b4b96f76152433da48004b1e2bc41a4",
        "word": "microchip",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈmaɪkrəʊtʃɪp/",
            "us": "/ˈmaɪkrəʊtʃɪp/"
        },
        "nearby": [
            {
                "word": "microbrew",
                "pos": "noun"
            },
            {
                "word": "microbrewery",
                "pos": "noun"
            },
            {
                "word": "microchip",
                "pos": "noun"
            },
            {
                "word": "microchip",
                "pos": "verb"
            },
            {
                "word": "microclimate",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a very small piece of a material that is a semiconductor, used to carry a complicated electronic circuit",
                    "vi": "một mảnh rất nhỏ của vật liệu là chất bán dẫn, được sử dụng để mang một mạch điện tử phức tạp"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "005e2b9eaf68411f9f72e9851d6691f1",
        "word": "microprocessor",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌmaɪkrəʊˈprəʊsesə(r)/",
            "us": "/ˌmaɪkrəʊˈprɑːsesər/"
        },
        "nearby": [
            {
                "word": "microphone",
                "pos": "noun"
            },
            {
                "word": "microplastic",
                "pos": "noun"
            },
            {
                "word": "microprocessor",
                "pos": "noun"
            },
            {
                "word": "microscope",
                "pos": "noun"
            },
            {
                "word": "microscopic",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small unit of a computer that contains all the functions of the central processing unit",
                    "vi": "một đơn vị nhỏ của máy tính có chứa tất cả các chức năng của đơn vị xử lý trung tâm"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "b5e5030a591c498494f2a551c924ccd4",
        "word": "PC",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌpiː ˈsiː/",
            "us": "/ˌpiː ˈsiː/"
        },
        "nearby": [
            {
                "word": "p-book",
                "pos": "noun"
            },
            {
                "word": "PBS",
                "pos": "abbreviation"
            },
            {
                "word": "PC",
                "pos": "noun"
            },
            {
                "word": "PC",
                "pos": "abbreviation"
            },
            {
                "word": "PCB",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a computer that is designed for one person to use at work or at home (the abbreviation for ‘personal computer’)",
                    "vi": "máy tính được thiết kế cho một người sử dụng tại nơi làm việc hoặc ở nhà (viết tắt của 'máy tính cá nhân')"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "3ada7ddf018e4497b2f8a3f338ca6dab",
        "word": "processor",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈprəʊsesə(r)/",
            "us": "/ˈprɑːsesər/"
        },
        "nearby": [
            {
                "word": "procession",
                "pos": "noun"
            },
            {
                "word": "processional",
                "pos": "adjective"
            },
            {
                "word": "processor",
                "pos": "noun"
            },
            {
                "word": "pro-choice",
                "pos": "adjective"
            },
            {
                "word": "proclaim",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a machine, person or company that processes things",
                    "vi": "một máy móc, con người hoặc công ty xử lý mọi thứ"
                },
                "examples": [
                    {
                        "en": "The company is Ireland's largest dairy processor.",
                        "vi": "Công ty là nhà chế biến sữa lớn nhất Ireland."
                    }
                ]
            },
            {
                "define": {
                    "en": "a part of a computer that controls all the other parts of the system",
                    "vi": "một phần của máy tính điều khiển tất cả các phần khác của hệ thống"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "9b5379fb7c384837b5b9f2e35734d478",
        "word": "RAM",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ræm/",
            "us": "/ræm/"
        },
        "nearby": [
            {
                "word": "ram",
                "pos": "verb"
            },
            {
                "word": "ram",
                "pos": "noun"
            },
            {
                "word": "RAM",
                "pos": "noun"
            },
            {
                "word": "Ramadan",
                "pos": "noun"
            },
            {
                "word": "Rambert",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "computer memory in which data can be changed or removed and can be looked at in any order (the abbreviation for ‘random-access memory’)",
                    "vi": "bộ nhớ máy tính trong đó dữ liệu có thể được thay đổi hoặc xóa và có thể được xem xét theo bất kỳ thứ tự nào (chữ viết tắt của 'bộ nhớ truy cập ngẫu nhiên')"
                },
                "examples": [
                    {
                        "en": "16 gigabytes of RAM",
                        "vi": "16 GB RAM"
                    }
                ]
            }
        ]
    },
    {
        "id": "99a131f6b9964f4aba81b8253371a842",
        "word": "read-only",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌriːd ˈəʊnli/",
            "us": "/ˌriːd ˈəʊnli/"
        },
        "nearby": [
            {
                "word": "readmit",
                "pos": "verb"
            },
            {
                "word": "read on",
                "pos": "phrasal verb"
            },
            {
                "word": "read-only",
                "pos": "adjective"
            },
            {
                "word": "read-only memory",
                "pos": "noun"
            },
            {
                "word": "read out",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "able to be seen and read, but not changed",
                    "vi": "có thể được nhìn thấy và đọc, nhưng không thay đổi"
                },
                "examples": [
                    {
                        "en": "Non-paying users will see these files in read-only mode.",
                        "vi": "Người dùng không trả tiền sẽ thấy các tệp này ở chế độ chỉ đọc."
                    }
                ]
            }
        ]
    },
    {
        "id": "980396044f1546449915e73bf463480a",
        "word": "second screen",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌsekənd ˈskriːn/",
            "us": "/ˌsekənd ˈskriːn/"
        },
        "nearby": [
            {
                "word": "second-rate",
                "pos": "adjective"
            },
            {
                "word": "second reading",
                "pos": "noun"
            },
            {
                "word": "second screen",
                "pos": "noun"
            },
            {
                "word": "second-screen",
                "pos": "verb"
            },
            {
                "word": "second sight",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a mobile device used while watching television, especially to access additional content or apps",
                    "vi": "thiết bị di động được sử dụng khi xem truyền hình, đặc biệt là để truy cập nội dung hoặc ứng dụng bổ sung"
                },
                "examples": [
                    {
                        "en": "The app allows users to use their device as a second screen, offering additional information about the film they're watching on TV.",
                        "vi": "Ứng dụng cho phép người dùng sử dụng thiết bị của họ như một màn hình thứ hai, cung cấp thêm thông tin về bộ phim họ đang xem trên TV."
                    },
                    {
                        "en": "a second-screen app",
                        "vi": "một ứng dụng màn hình thứ hai"
                    },
                    {
                        "en": "a second-screen experience",
                        "vi": "trải nghiệm màn hình thứ hai"
                    }
                ]
            }
        ]
    },
    {
        "id": "31379676030f4dbc8e16c77dbcac7b31",
        "word": "server",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈsɜːvə(r)/",
            "us": "/ˈsɜːrvər/"
        },
        "nearby": [
            {
                "word": "serve",
                "pos": "noun"
            },
            {
                "word": "serve out",
                "pos": "phrasal verb"
            },
            {
                "word": "server",
                "pos": "noun"
            },
            {
                "word": "server farm",
                "pos": "noun"
            },
            {
                "word": "servery",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a computer program that controls or supplies information to several computers connected in a network; the main computer on which this program is run",
                    "vi": "một chương trình máy tính điều khiển hoặc cung cấp thông tin cho một số máy tính được kết nối trong mạng; máy tính chính mà chương trình này được chạy trên đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a player who is serving, for example in tennis",
                    "vi": "một người chơi đang giao bóng, chẳng hạn như trong quần vợt"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a kitchen utensil (= tool) used for putting food onto somebody’s plate",
                    "vi": "một dụng cụ nhà bếp (= công cụ) dùng để bày thức ăn lên đĩa của ai đó"
                },
                "examples": [
                    {
                        "en": "salad servers",
                        "vi": "máy chủ salad"
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who serves food in a restaurant; a waiter or waitress",
                    "vi": "một người phục vụ đồ ăn trong nhà hàng; một người phục vụ bàn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a person who helps a priest during a church service",
                    "vi": "một người giúp đỡ một linh mục trong buổi lễ nhà thờ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "2f34785dc9c14ef98c6939ba256b5788",
        "word": "silicon chip",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌsɪlɪkən ˈtʃɪp/",
            "us": "/ˌsɪlɪkən ˈtʃɪp/"
        },
        "nearby": [
            {
                "word": "silicate",
                "pos": "noun"
            },
            {
                "word": "silicon",
                "pos": "noun"
            },
            {
                "word": "silicon chip",
                "pos": "noun"
            },
            {
                "word": "silicone",
                "pos": "noun"
            },
            {
                "word": "Silicon Valley",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a very small piece of silicon used to carry a complicated electronic circuit",
                    "vi": "một miếng silicon rất nhỏ được sử dụng để mang một mạch điện tử phức tạp"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "3c56d0fb3b6f4e638bec15a7414dd5c8",
        "word": "terminal",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈtɜːmɪnl/",
            "us": "/ˈtɜːrmɪnl/"
        },
        "nearby": [
            {
                "word": "term",
                "pos": "verb"
            },
            {
                "word": "termagant",
                "pos": "noun"
            },
            {
                "word": "terminal",
                "pos": "noun"
            },
            {
                "word": "terminal",
                "pos": "adjective"
            },
            {
                "word": "terminally",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a building or set of buildings at an airport where passengers arrive and leave",
                    "vi": "một tòa nhà hoặc một tập hợp các tòa nhà tại sân bay nơi hành khách đến và đi"
                },
                "examples": [
                    {
                        "en": "A second terminal was opened last year.",
                        "vi": "Một nhà ga thứ hai đã được mở vào năm ngoái."
                    },
                    {
                        "en": "Your flight leaves from Terminal 3.",
                        "vi": "Chuyến bay của bạn khởi hành từ Nhà ga số 3."
                    }
                ]
            },
            {
                "define": {
                    "en": "a place, building or set of buildings where journeys by train, bus or boat begin or end",
                    "vi": "một địa điểm, tòa nhà hoặc tập hợp các tòa nhà nơi các chuyến đi bằng tàu hỏa, xe buýt hoặc thuyền bắt đầu hoặc kết thúc"
                },
                "examples": [
                    {
                        "en": "a railway/bus/ferry terminal",
                        "vi": "một bến xe lửa / xe buýt / phà"
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of equipment, usually consisting of a keyboard and a screen that joins the user to a central computer system",
                    "vi": "một phần của thiết bị, thường bao gồm bàn phím và màn hình kết nối người dùng với một hệ thống máy tính trung tâm"
                },
                "examples": [
                    {
                        "en": "Internet terminals have been installed at most libraries.",
                        "vi": "Các thiết bị đầu cuối Internet đã được cài đặt ở hầu hết các thư viện."
                    },
                    {
                        "en": "All she did was press a few keys on the terminal.",
                        "vi": "Tất cả những gì cô ấy làm là nhấn một vài phím trên thiết bị đầu cuối."
                    },
                    {
                        "en": "The larger financial institutions have over 200 news and data terminals in their offices.",
                        "vi": "Các tổ chức tài chính lớn hơn có hơn 200 thiết bị đầu cuối tin tức và dữ liệu trong văn phòng của họ."
                    },
                    {
                        "en": "There were two students at each terminal.",
                        "vi": "Có hai học sinh ở mỗi đầu cuối."
                    }
                ]
            },
            {
                "define": {
                    "en": "a point at which connections can be made in an electric circuit",
                    "vi": "một điểm mà tại đó các kết nối có thể được thực hiện trong một mạch điện"
                },
                "examples": [
                    {
                        "en": "a positive/negative terminal",
                        "vi": "một thiết bị đầu cuối tích cực / tiêu cực"
                    }
                ]
            }
        ]
    },
    {
        "id": "c350887403bb4d348220a2558c10a155",
        "word": "USB",
        "pos": "abbreviation",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌjuː es ˈbiː/",
            "us": "/ˌjuː es ˈbiː/"
        },
        "nearby": [
            {
                "word": "the USA PATRIOT Act",
                "pos": ""
            },
            {
                "word": "USA Today",
                "pos": ""
            },
            {
                "word": "USB",
                "pos": "abbreviation"
            },
            {
                "word": "USB drive",
                "pos": "noun"
            },
            {
                "word": "USCIS",
                "pos": "abbreviation"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "universal serial bus (the system for connecting other pieces of equipment to a computer)",
                    "vi": "bus nối tiếp đa năng (hệ thống kết nối các thiết bị khác với máy tính)"
                },
                "examples": [
                    {
                        "en": "All new PCs now have USB sockets.",
                        "vi": "Tất cả các PC mới hiện đều có ổ cắm USB."
                    },
                    {
                        "en": "a USB port",
                        "vi": "một cổng USB"
                    }
                ]
            }
        ]
    },
    {
        "id": "dda73c69b8f74c2ab19436315423229f",
        "word": "USB drive",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌjuː es ˈbiː draɪv/",
            "us": "/ˌjuː es ˈbiː draɪv/"
        },
        "nearby": [
            {
                "word": "USA Today",
                "pos": ""
            },
            {
                "word": "USB",
                "pos": "abbreviation"
            },
            {
                "word": "USB drive",
                "pos": "noun"
            },
            {
                "word": "USCIS",
                "pos": "abbreviation"
            },
            {
                "word": "the USDA Forest Service",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small memory device that can be used to store data from a computer or digital camera and to move it from one device to another",
                    "vi": "một thiết bị bộ nhớ nhỏ có thể được sử dụng để lưu trữ dữ liệu từ máy tính hoặc máy ảnh kỹ thuật số và di chuyển dữ liệu đó từ thiết bị này sang thiết bị khác"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "5f7bc3ee1cee4e44ae4dba87c4ee2215",
        "word": "word processor",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈwɜːd prəʊsesə(r)/",
            "us": "/ˈwɜːrd prɑːsesər/"
        },
        "nearby": [
            {
                "word": "wordplay",
                "pos": "noun"
            },
            {
                "word": "word processing",
                "pos": "noun"
            },
            {
                "word": "word processor",
                "pos": "noun"
            },
            {
                "word": "word search",
                "pos": "noun"
            },
            {
                "word": "wordsmith",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a program or machine used to create, edit and store text documents, usually typed from a keyboard",
                    "vi": "một chương trình hoặc máy được sử dụng để tạo, chỉnh sửa và lưu trữ các tài liệu văn bản, thường được nhập từ bàn phím"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "6f9c6c1c553e4da8bd28164889928bc5",
        "word": "workstation",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈwɜːksteɪʃn/",
            "us": "/ˈwɜːrksteɪʃn/"
        },
        "nearby": [
            {
                "word": "workspace",
                "pos": "noun"
            },
            {
                "word": "the Works Progress Administration",
                "pos": ""
            },
            {
                "word": "workstation",
                "pos": "noun"
            },
            {
                "word": "work surface",
                "pos": "noun"
            },
            {
                "word": "work to",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the desk and computer at which a person works; one computer that is part of a computer network",
                    "vi": "bàn và máy tính mà một người làm việc tại đó; một máy tính là một phần của mạng máy tính"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "8ab0363955974723a74339a8f974a653",
        "word": "accelerator board",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/əkˈseləreɪtə bɔːd/",
            "us": "/əkˈseləreɪtər bɔːrd/"
        },
        "nearby": [
            {
                "word": "acceleration",
                "pos": "noun"
            },
            {
                "word": "accelerator",
                "pos": "noun"
            },
            {
                "word": "accelerator board",
                "pos": "noun"
            },
            {
                "word": "accelerometer",
                "pos": "noun"
            },
            {
                "word": "accent",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a circuit board that can be put into a small computer to increase the speed at which it processes information",
                    "vi": "một bảng mạch có thể được đưa vào một máy tính nhỏ để tăng tốc độ xử lý thông tin"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "547e5083a71e4c4095ab80bde1e600f6",
        "word": "bus",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/bʌs/",
            "us": "/bʌs/"
        },
        "nearby": [
            {
                "word": "bury",
                "pos": "verb"
            },
            {
                "word": "bury yourself in",
                "pos": "phrasal verb"
            },
            {
                "word": "bus",
                "pos": "noun"
            },
            {
                "word": "bus",
                "pos": "verb"
            },
            {
                "word": "busboy",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a large road vehicle that carries passengers, especially one that travels along a fixed route and stops regularly to let people get on and off",
                    "vi": "xe phân khối lớn chở khách, nhất là xe chạy tuyến cố định, dừng đỗ thường xuyên để người dân lên xuống xe."
                },
                "examples": [
                    {
                        "en": "by bus Shall we walk or go by bus?",
                        "vi": "bằng xe buýt Chúng ta sẽ đi bộ hay đi bằng xe buýt?"
                    },
                    {
                        "en": "I didn't want to get on the wrong bus.",
                        "vi": "Tôi không muốn lên nhầm xe buýt."
                    },
                    {
                        "en": "Many students board the school bus before 7 a.m.",
                        "vi": "Nhiều học sinh lên xe buýt đến trường trước 7 giờ sáng"
                    },
                    {
                        "en": "He was seriously injured when the band's tour bus crashed.",
                        "vi": "Anh ấy bị thương nặng khi chiếc xe buýt lưu diễn của ban nhạc gặp sự cố."
                    },
                    {
                        "en": "I was going to catch the airport shuttle bus.",
                        "vi": "Tôi sẽ bắt xe buýt đưa đón sân bay."
                    },
                    {
                        "en": "(US English) I ride the city bus every day.",
                        "vi": "(Tiếng Anh Mỹ) Tôi đi xe buýt thành phố mỗi ngày."
                    },
                    {
                        "en": "a bus company/driver",
                        "vi": "một công ty xe buýt / tài xế"
                    },
                    {
                        "en": "A regular bus service connects the train station with the town centre.",
                        "vi": "Dịch vụ xe buýt thường xuyên kết nối ga xe lửa với trung tâm thị trấn."
                    },
                    {
                        "en": "He can't afford the bus fare into the city.",
                        "vi": "Anh ta không đủ tiền mua vé xe buýt vào thành phố."
                    }
                ]
            },
            {
                "define": {
                    "en": "a set of wires that carries information from one part of a computer system to another",
                    "vi": "một bộ dây dẫn thông tin từ phần này sang phần khác của hệ thống máy tính"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to make somebody else suffer in order to save yourself or gain an advantage for yourself",
                    "vi": "làm cho người khác đau khổ để tự cứu mình hoặc đạt được lợi thế cho chính mình"
                },
                "examples": [
                    {
                        "en": "Plenty of my co-workers are satisfied to throw everyone else under the bus as long as they keep their wages.",
                        "vi": "Rất nhiều đồng nghiệp của tôi hài lòng khi ném tất cả những người khác xuống gầm xe buýt miễn là họ giữ được tiền lương của mình."
                    }
                ]
            }
        ]
    },
    {
        "id": "6c31c145656c483396b738063d41d84e",
        "word": "cache",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/kæʃ/",
            "us": "/kæʃ/"
        },
        "nearby": [
            {
                "word": "cabriolet",
                "pos": "noun"
            },
            {
                "word": "cacao",
                "pos": "noun"
            },
            {
                "word": "cache",
                "pos": "noun"
            },
            {
                "word": "cache",
                "pos": "verb"
            },
            {
                "word": "cachet",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a hidden store of things such as weapons",
                    "vi": "một cửa hàng ẩn chứa những thứ như vũ khí"
                },
                "examples": [
                    {
                        "en": "an arms cache",
                        "vi": "một bộ nhớ cache"
                    }
                ]
            },
            {
                "define": {
                    "en": "a part of a computer’s memory that stores copies of data that is often needed while a program is running. This data can be accessed very quickly.",
                    "vi": "một phần của bộ nhớ máy tính lưu trữ các bản sao dữ liệu thường cần thiết trong khi chương trình đang chạy. Dữ liệu này có thể được truy cập rất nhanh chóng."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "165e2f0d6b3647c695b7e12168ed3519",
        "word": "card",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/kɑːd/",
            "us": "/kɑːrd/"
        },
        "nearby": [
            {
                "word": "car coat",
                "pos": "noun"
            },
            {
                "word": "car crash",
                "pos": "noun"
            },
            {
                "word": "card",
                "pos": "noun"
            },
            {
                "word": "card",
                "pos": "verb"
            },
            {
                "word": "cardamom",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "thick, stiff paper; a piece of this for writing on",
                    "vi": "giấy dày, cứng; một phần của điều này để viết về"
                },
                "examples": [
                    {
                        "en": "a piece of card",
                        "vi": "một mảnh thẻ"
                    },
                    {
                        "en": "The model of the building was made of card.",
                        "vi": "Mô hình của tòa nhà được làm bằng thẻ."
                    },
                    {
                        "en": "Each person wrote their question on a card.",
                        "vi": "Mỗi người viết câu hỏi của họ trên một tấm thẻ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of stiff paper that is folded in the middle and has a picture on the front of it, used for sending somebody a message with your good wishes, an invitation, etc.",
                    "vi": "một mảnh giấy cứng được gấp ở giữa và có hình ở mặt trước, được sử dụng để gửi cho ai đó một tin nhắn với những lời chúc tốt đẹp của bạn, một lời mời, v.v."
                },
                "examples": [
                    {
                        "en": "a birthday/get-well/good luck card",
                        "vi": "một tấm thiệp sinh nhật / an khang / chúc may mắn"
                    },
                    {
                        "en": "Everyone at work signed a card for her.",
                        "vi": "Mọi người tại nơi làm việc đã ký thẻ cho cô ấy."
                    },
                    {
                        "en": "When they got engaged I sent them a card.",
                        "vi": "Khi họ đính hôn, tôi đã gửi cho họ một tấm thiệp."
                    }
                ]
            },
            {
                "define": {
                    "en": "a postcard (= a card used for sending messages by post without an envelope, especially one that has a picture on one side)",
                    "vi": "một tấm bưu thiếp (= một tấm thẻ dùng để gửi tin nhắn qua đường bưu điện mà không có phong bì, đặc biệt là một tấm có hình ở một mặt)"
                },
                "examples": [
                    {
                        "en": "Did you get my card from Italy?",
                        "vi": "Bạn đã nhận được thẻ của tôi từ Ý?"
                    }
                ]
            },
            {
                "define": {
                    "en": "a small piece of stiff paper or plastic with information on it, especially information about somebody’s identity",
                    "vi": "một mảnh giấy cứng hoặc nhựa nhỏ với thông tin trên đó, đặc biệt là thông tin về danh tính của ai đó"
                },
                "examples": [
                    {
                        "en": "a membership card",
                        "vi": "thẻ thành viên"
                    },
                    {
                        "en": "an appointment card",
                        "vi": "một phiếu hẹn"
                    },
                    {
                        "en": "She got her first library card at the age of seven.",
                        "vi": "Cô có thẻ thư viện đầu tiên của mình vào năm bảy tuổi."
                    },
                    {
                        "en": "a set of free recipe cards",
                        "vi": "một bộ thẻ công thức miễn phí"
                    }
                ]
            },
            {
                "define": {
                    "en": "a business card (= a small card printed with somebody's name and details of their job and company)",
                    "vi": "danh thiếp (= một tấm danh thiếp nhỏ có in tên của ai đó và thông tin chi tiết về công việc và công ty của họ)"
                },
                "examples": [
                    {
                        "en": "Here's my card if you need to contact me again.",
                        "vi": "Đây là thẻ của tôi nếu bạn cần liên hệ lại với tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a small card with your name on it that you leave with somebody after, or instead of, a formal visit",
                    "vi": "một tấm thiệp nhỏ có tên bạn trên đó để bạn rời đi với ai đó sau đó, hoặc thay vì một chuyến thăm chính thức"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a small piece of plastic, especially one given by a bank or shop, used for buying things or obtaining money",
                    "vi": "một miếng nhựa nhỏ, đặc biệt là miếng nhựa do ngân hàng hoặc cửa hàng tặng, dùng để mua đồ hoặc lấy tiền"
                },
                "examples": [
                    {
                        "en": "I put the meal on (= paid for it using) my card.",
                        "vi": "Tôi đã đặt bữa ăn trên (= đã thanh toán bằng) thẻ của mình."
                    },
                    {
                        "en": "Can I pay with a card?",
                        "vi": "Tôi có thể thanh toán bằng thẻ không?"
                    },
                    {
                        "en": "Thieves used her cards to go on a spending spree.",
                        "vi": "Những tên trộm đã sử dụng thẻ của cô để tiêu xài hoang phí."
                    }
                ]
            },
            {
                "define": {
                    "en": "any one of a set of 52 cards with numbers and pictures printed on one side, which are used to play various card game",
                    "vi": "bất kỳ một trong bộ 52 lá bài có in số và hình ảnh trên một mặt, được sử dụng để chơi các trò chơi bài khác nhau"
                },
                "examples": [
                    {
                        "en": "(British English) a pack of cards",
                        "vi": "(Tiếng Anh Anh) một gói thẻ"
                    },
                    {
                        "en": "(especially North American English) a deck of cards",
                        "vi": "(đặc biệt là tiếng Anh Bắc Mỹ) một bộ bài"
                    },
                    {
                        "en": "Each player in turn must play a card.",
                        "vi": "Mỗi người chơi đến lượt phải chơi một lá bài."
                    }
                ]
            },
            {
                "define": {
                    "en": "a game or games in which playing cards are used",
                    "vi": "một trò chơi hoặc các trò chơi trong đó chơi bài được sử dụng"
                },
                "examples": [
                    {
                        "en": "Who wants to play cards?",
                        "vi": "Ai muốn chơi bài?"
                    },
                    {
                        "en": "I've never been very good at cards.",
                        "vi": "Tôi chưa bao giờ giỏi đánh bài."
                    },
                    {
                        "en": "Let's have a game of cards.",
                        "vi": "Hãy có một trò chơi của thẻ."
                    },
                    {
                        "en": "She won £20 at cards.",
                        "vi": "Cô ấy đã giành được £ 20 khi chơi bài."
                    }
                ]
            },
            {
                "define": {
                    "en": "a small device containing an electronic circuit that is part of a computer or added to it, enabling it to perform particular functions",
                    "vi": "một thiết bị nhỏ có chứa một mạch điện tử là một phần của máy tính hoặc được thêm vào nó, cho phép nó thực hiện các chức năng cụ thể"
                },
                "examples": [
                    {
                        "en": "a printed circuit card",
                        "vi": "một thẻ mạch in"
                    },
                    {
                        "en": "a memory card",
                        "vi": "thẻ nhớ"
                    },
                    {
                        "en": "a graphics/sound/video card",
                        "vi": "card đồ họa / âm thanh / video"
                    }
                ]
            },
            {
                "define": {
                    "en": "an unusual or funny person",
                    "vi": "một người bất thường hoặc vui tính"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a list of all the races at a particular race meeting (= a series of horse races)",
                    "vi": "danh sách tất cả các cuộc đua tại một cuộc họp cuộc đua cụ thể (= một loạt các cuộc đua ngựa)"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a machine or tool used for cleaning and combing wool or cotton before it is spun",
                    "vi": "một máy hoặc dụng cụ được sử dụng để làm sạch và chải len hoặc bông trước khi nó được kéo thành sợi"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "something that gives somebody an advantage over other people in a particular situation",
                    "vi": "thứ gì đó mang lại cho ai đó lợi thế hơn những người khác trong một tình huống cụ thể"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "you are unlikely to succeed because the conditions are not good for you",
                    "vi": "bạn không có khả năng thành công bởi vì các điều kiện không tốt cho bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "you are likely to succeed because the conditions are good and you have an advantage",
                    "vi": "bạn có khả năng thành công vì điều kiện tốt và bạn có lợi thế"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be told to leave a job",
                    "vi": "được yêu cầu để lại một công việc"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to make somebody leave their job",
                    "vi": "để khiến ai đó rời bỏ công việc của họ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to have an idea, a plan, etc. that will give you an advantage in a particular situation and that you keep secret until it is needed",
                    "vi": "để có một ý tưởng, một kế hoạch, v.v. sẽ mang lại lợi thế cho bạn trong một tình huống cụ thể và bạn giữ bí mật cho đến khi cần"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be able to control a particular situation because you have an advantage over other people",
                    "vi": "để có thể kiểm soát một tình huống cụ thể bởi vì bạn có lợi thế hơn những người khác"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to keep your ideas, plans, etc. secret",
                    "vi": "để giữ bí mật về ý tưởng, kế hoạch, v.v. của bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to tell somebody honestly what your plans, ideas, etc. are",
                    "vi": "để nói với ai đó một cách trung thực kế hoạch, ý tưởng, v.v. của bạn là gì"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "likely to happen",
                    "vi": "sắp xảy ra"
                },
                "examples": [
                    {
                        "en": "The merger has been on the cards for some time now.",
                        "vi": "Việc hợp nhất đã nằm trong danh sách một thời gian."
                    }
                ]
            },
            {
                "define": {
                    "en": "to mention a particular subject, idea or quality in order to gain an advantage",
                    "vi": "đề cập đến một chủ đề, ý tưởng hoặc phẩm chất cụ thể để đạt được lợi thế"
                },
                "examples": [
                    {
                        "en": "He accused his opponent of playing the immigration card during the campaign.",
                        "vi": "Ông cáo buộc đối thủ của mình đã chơi bài nhập cư trong chiến dịch tranh cử."
                    }
                ]
            },
            {
                "define": {
                    "en": "to deal successfully with a particular situation so that you achieve some advantage or something that you want",
                    "vi": "đối phó thành công với một tình huống cụ thể để bạn đạt được một số lợi thế hoặc điều gì đó mà bạn muốn"
                },
                "examples": [
                    {
                        "en": "If you play your cards right, the job could be yours when she leaves.",
                        "vi": "Nếu bạn chơi đúng bài của mình, công việc có thể là của bạn khi cô ấy rời đi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make your plans or intentions known",
                    "vi": "để làm cho kế hoạch hoặc ý định của bạn được biết đến"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "d661aff481d743c4acfdae3da9ed8444",
        "word": "CD burner",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌsiː ˈdiː bɜːnə(r)/",
            "us": "/ˌsiː ˈdiː bɜːrnər/"
        },
        "nearby": [
            {
                "word": "CCU",
                "pos": "noun"
            },
            {
                "word": "CD",
                "pos": "noun"
            },
            {
                "word": "CD burner",
                "pos": "noun"
            },
            {
                "word": "CDC",
                "pos": ""
            },
            {
                "word": "Cdr",
                "pos": "abbreviation"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a piece of software or equipment used for copying sound or information from a computer onto a CD",
                    "vi": "một phần mềm hoặc thiết bị dùng để sao chép âm thanh hoặc thông tin từ máy tính vào đĩa CD"
                },
                "examples": [
                    {
                        "en": "Make your own music mixes with a CD burner.",
                        "vi": "Tạo các bản mix nhạc của riêng bạn bằng ổ ghi CD."
                    },
                    {
                        "en": "The arrival of CD burners marked a huge cultural shift.",
                        "vi": "Sự xuất hiện của ổ ghi CD đã đánh dấu một sự thay đổi lớn về văn hóa."
                    }
                ]
            }
        ]
    },
    {
        "id": "425aab2174db42fbb5bced36ca609dc8",
        "word": "CD writer",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌsiː ˈdiː raɪtə(r)/",
            "us": "/ˌsiː ˈdiː raɪtər/"
        },
        "nearby": [
            {
                "word": "CD-RW",
                "pos": "noun"
            },
            {
                "word": "CDT",
                "pos": "abbreviation"
            },
            {
                "word": "CD writer",
                "pos": "noun"
            },
            {
                "word": "CE",
                "pos": "abbreviation"
            },
            {
                "word": "cease",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a piece of software or equipment used for copying sound or information from a computer onto a CD",
                    "vi": "một phần mềm hoặc thiết bị dùng để sao chép âm thanh hoặc thông tin từ máy tính vào đĩa CD"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "ecdf9e76d71840cc9d3b015de1ead100",
        "word": "central processing unit",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌsentrəl ˈprəʊsesɪŋ juːnɪt/",
            "us": "/ˌsentrəl ˈprɑːsesɪŋ juːnɪt/"
        },
        "nearby": [
            {
                "word": "central nervous system",
                "pos": "noun"
            },
            {
                "word": "Central Park",
                "pos": ""
            },
            {
                "word": "central processing unit",
                "pos": "noun"
            },
            {
                "word": "central reservation",
                "pos": "noun"
            },
            {
                "word": "the Central School of Speech and Drama",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the part of a computer that controls all the other parts of the system",
                    "vi": "phần của máy tính điều khiển tất cả các phần khác của hệ thống"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "47159013b6fa46a59abd36a846babd1e",
        "word": "client",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈklaɪənt/",
            "us": "/ˈklaɪənt/"
        },
        "nearby": [
            {
                "word": "click-through",
                "pos": "noun"
            },
            {
                "word": "clicktivism",
                "pos": "noun"
            },
            {
                "word": "client",
                "pos": "noun"
            },
            {
                "word": "clientele",
                "pos": "noun"
            },
            {
                "word": "client-server",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who uses the services or advice of a professional person or organization",
                    "vi": "một người sử dụng các dịch vụ hoặc lời khuyên của một cá nhân hoặc tổ chức chuyên nghiệp"
                },
                "examples": [
                    {
                        "en": "She's a well-known lawyer with many famous clients.",
                        "vi": "Cô ấy là một luật sư nổi tiếng với nhiều khách hàng nổi tiếng."
                    },
                    {
                        "en": "potential/prospective clients",
                        "vi": "khách hàng tiềm năng / tương lai"
                    },
                    {
                        "en": "It is our job to act on behalf of the client.",
                        "vi": "Công việc của chúng tôi là thay mặt khách hàng."
                    },
                    {
                        "en": "We will advise the client on the best way to solve the problem.",
                        "vi": "Chúng tôi sẽ tư vấn cho khách hàng cách tốt nhất để giải quyết vấn đề."
                    },
                    {
                        "en": "Social workers must always consider the best interests of their clients.",
                        "vi": "Nhân viên công tác xã hội phải luôn quan tâm đến lợi ích tốt nhất của thân chủ."
                    },
                    {
                        "en": "Corporate clients usually want their work done much faster than private clients.",
                        "vi": "Khách hàng doanh nghiệp thường muốn công việc của họ hoàn thành nhanh hơn nhiều so với khách hàng tư nhân."
                    }
                ]
            },
            {
                "define": {
                    "en": "a computer that is linked to a server",
                    "vi": "một máy tính được liên kết với một máy chủ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "2ae44890dfb74e5fa4cf9b0970fefefa",
        "word": "clock speed",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈklɒk spiːd/",
            "us": "/ˈklɑːk spiːd/"
        },
        "nearby": [
            {
                "word": "clock out",
                "pos": "phrasal verb"
            },
            {
                "word": "clock radio",
                "pos": "noun"
            },
            {
                "word": "clock speed",
                "pos": "noun"
            },
            {
                "word": "clock tower",
                "pos": "noun"
            },
            {
                "word": "clock up",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the speed at which a computer operates",
                    "vi": "tốc độ máy tính hoạt động"
                },
                "examples": [
                    {
                        "en": "This machine has a clock speed of 2.6GHz.",
                        "vi": "Máy này có tốc độ xung nhịp 2,6GHz."
                    }
                ]
            }
        ]
    },
    {
        "id": "17a055f3a24248a9bab4ba8dbb90dd34",
        "word": "clone",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/kləʊn/",
            "us": "/kləʊn/"
        },
        "nearby": [
            {
                "word": "cloister",
                "pos": "noun"
            },
            {
                "word": "cloistered",
                "pos": "adjective"
            },
            {
                "word": "clone",
                "pos": "noun"
            },
            {
                "word": "clone",
                "pos": "verb"
            },
            {
                "word": "clonk",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a plant or an animal that is produced naturally or artificially from the cells of another plant or animal and is therefore exactly the same as it",
                    "vi": "thực vật hoặc động vật được sản xuất tự nhiên hoặc nhân tạo từ tế bào của một loài thực vật hoặc động vật khác và do đó giống hệt như nó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a person or thing that seems to be an exact copy of another",
                    "vi": "một người hoặc một vật dường như là một bản sao chính xác của người khác"
                },
                "examples": [
                    {
                        "en": "Caroline’s brothers grinned alongside her, clones of their father.",
                        "vi": "Các anh trai của Caroline cười toe toét bên cạnh cô, bản sao của cha họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a computer that is a copy of another more expensive model",
                    "vi": "một máy tính là bản sao của một kiểu máy khác đắt tiền hơn"
                },
                "examples": [
                    {
                        "en": "Once they found that the PC clones were just as good, companies saved a lot.",
                        "vi": "Một khi họ phát hiện ra rằng máy tính nhái cũng tốt như nhau, các công ty đã tiết kiệm được rất nhiều."
                    }
                ]
            }
        ]
    },
    {
        "id": "49b88feef4404c2c8af5d69020dbb080",
        "word": "configuration",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/kənˌfɪɡəˈreɪʃn/",
            "us": "/kənˌfɪɡjəˈreɪʃn/"
        },
        "nearby": [
            {
                "word": "confiding",
                "pos": "adjective"
            },
            {
                "word": "confidingly",
                "pos": "adverb"
            },
            {
                "word": "configuration",
                "pos": "noun"
            },
            {
                "word": "configure",
                "pos": "verb"
            },
            {
                "word": "confine",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an arrangement of the parts of something or a group of things; the form or shape that this arrangement produces",
                    "vi": "sự sắp xếp của các bộ phận của một cái gì đó hoặc một nhóm đồ vật; hình thức hoặc hình dạng mà sự sắp xếp này tạo ra"
                },
                "examples": [
                    {
                        "en": "configuration of something The design is based on four configurations of squares.",
                        "vi": "cấu hình của một cái gì đó Thiết kế dựa trên bốn cấu hình của hình vuông."
                    },
                    {
                        "en": "There was a changing configuration of lights coming from the stadium.",
                        "vi": "Có một cấu hình thay đổi của đèn phát ra từ sân vận động."
                    },
                    {
                        "en": "in a configuration The stars seemed to appear in a different configuration.",
                        "vi": "trong một cấu hình Các ngôi sao dường như xuất hiện trong một cấu hình khác."
                    }
                ]
            },
            {
                "define": {
                    "en": "the equipment and programs that form a computer system and the way that these are set up to run",
                    "vi": "thiết bị và chương trình tạo thành một hệ thống máy tính và cách chúng được thiết lập để chạy"
                },
                "examples": [
                    {
                        "en": "Performance will vary depending on your hardware and software configurations.",
                        "vi": "Hiệu suất sẽ khác nhau tùy thuộc vào cấu hình phần cứng và phần mềm của bạn."
                    }
                ]
            }
        ]
    },
    {
        "id": "c20359db669e419a8f060370d6c311e9",
        "word": "console",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkɒnsəʊl/",
            "us": "/ˈkɑːnsəʊl/"
        },
        "nearby": [
            {
                "word": "consolatory",
                "pos": "adjective"
            },
            {
                "word": "console1",
                "pos": "verb"
            },
            {
                "word": "console2",
                "pos": "noun"
            },
            {
                "word": "consolidate",
                "pos": "verb"
            },
            {
                "word": "consolidation",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a flat surface that contains all the controls and switches for a machine, a piece of electronic equipment, etc.",
                    "vi": "một bề mặt phẳng chứa tất cả các bộ điều khiển và công tắc cho máy móc, thiết bị điện tử, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a small electronic device for playing video games",
                    "vi": "một thiết bị điện tử nhỏ để chơi trò chơi điện tử"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "e3a9fcf57304478da9752a7fee9a89eb",
        "word": "CPU",
        "pos": "abbreviation",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌsiː piː ˈjuː/",
            "us": "/ˌsiː piː ˈjuː/"
        },
        "nearby": [
            {
                "word": "the CPRE",
                "pos": ""
            },
            {
                "word": "the CPS",
                "pos": ""
            },
            {
                "word": "CPU",
                "pos": "abbreviation"
            },
            {
                "word": "the CPUSA",
                "pos": ""
            },
            {
                "word": "CRA",
                "pos": "abbreviation"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "central processing unit (the part of a computer that controls all the other parts of the system)",
                    "vi": "bộ xử lý trung tâm (bộ phận của máy tính điều khiển tất cả các bộ phận khác của hệ thống)"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "7945415db9244e9794c364db29fdcd3e",
        "word": "data centre",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈdeɪtə sentə(r)/",
            "us": "/ˈdeɪtə sentər/"
        },
        "nearby": [
            {
                "word": "datable",
                "pos": "adjective"
            },
            {
                "word": "data capture",
                "pos": "noun"
            },
            {
                "word": "data centre",
                "pos": "noun"
            },
            {
                "word": "datacomms",
                "pos": "noun"
            },
            {
                "word": "data-driven",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a large network of computer servers, typically used by organizations for storing, processing or sharing large amounts of data",
                    "vi": "một mạng lớn các máy chủ máy tính, thường được các tổ chức sử dụng để lưu trữ, xử lý hoặc chia sẻ một lượng lớn dữ liệu"
                },
                "examples": [
                    {
                        "en": "The company is building a new data centre to provide additional computing capacity.",
                        "vi": "Công ty đang xây dựng một trung tâm dữ liệu mới để cung cấp thêm khả năng tính toán."
                    }
                ]
            }
        ]
    },
    {
        "id": "04b8465a5f8441df8b78049ff3b755df",
        "word": "data terminal",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈdeɪtə tɜːmɪnl/",
            "us": "/ˈdeɪtə tɜːrmɪnl/"
        },
        "nearby": [
            {
                "word": "the Data Protection Act",
                "pos": ""
            },
            {
                "word": "data set",
                "pos": "noun"
            },
            {
                "word": "data terminal",
                "pos": "noun"
            },
            {
                "word": "data type",
                "pos": "noun"
            },
            {
                "word": "data warehouse",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a computer that allows you to get into a system in order to get or add information",
                    "vi": "một máy tính cho phép bạn truy cập vào hệ thống để lấy hoặc thêm thông tin"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "03557a44962943a9a38f7dd07b838d06",
        "word": "data warehouse",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈdeɪtə weəhaʊs/",
            "us": "/ˈdeɪtə werhaʊs/"
        },
        "nearby": [
            {
                "word": "data terminal",
                "pos": "noun"
            },
            {
                "word": "data type",
                "pos": "noun"
            },
            {
                "word": "data warehouse",
                "pos": "noun"
            },
            {
                "word": "data warehousing",
                "pos": "noun"
            },
            {
                "word": "date",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a large amount of data that comes from different parts of a business and that is stored together",
                    "vi": "một lượng lớn dữ liệu đến từ các bộ phận khác nhau của doanh nghiệp và được lưu trữ cùng nhau"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "910a69b0901d4460a516e888d71cb085",
        "word": "data warehousing",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌdeɪtə ˈweəhaʊzɪŋ/",
            "us": "/ˌdeɪtə ˈwerhaʊzɪŋ/"
        },
        "nearby": [
            {
                "word": "data type",
                "pos": "noun"
            },
            {
                "word": "data warehouse",
                "pos": "noun"
            },
            {
                "word": "data warehousing",
                "pos": "noun"
            },
            {
                "word": "date",
                "pos": "noun"
            },
            {
                "word": "date",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the practice of storing together a large amount of data from different parts of a business",
                    "vi": "thực hành lưu trữ cùng nhau một lượng lớn dữ liệu từ các bộ phận khác nhau của doanh nghiệp"
                },
                "examples": [
                    {
                        "en": "Expertise in data warehousing would be particularly well regarded.",
                        "vi": "Chuyên môn về kho dữ liệu sẽ được đặc biệt coi trọng."
                    },
                    {
                        "en": "The data warehousing team provides financial and operational reports to all areas of the business.",
                        "vi": "Nhóm kho dữ liệu cung cấp các báo cáo tài chính và hoạt động cho tất cả các lĩnh vực của doanh nghiệp."
                    }
                ]
            }
        ]
    },
    {
        "id": "36ab516341cd4dd488db9479acd2059e",
        "word": "disk drive",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈdɪsk draɪv/",
            "us": "/ˈdɪsk draɪv/"
        },
        "nearby": [
            {
                "word": "disjunction",
                "pos": "noun"
            },
            {
                "word": "disk",
                "pos": "noun"
            },
            {
                "word": "disk drive",
                "pos": "noun"
            },
            {
                "word": "diskette",
                "pos": "noun"
            },
            {
                "word": "disk jockey",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a device that passes data between a disk and the memory of a computer or from one disk or computer to another",
                    "vi": "thiết bị truyền dữ liệu giữa đĩa và bộ nhớ của máy tính hoặc từ đĩa hoặc máy tính này sang đĩa khác"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c573fc13e8364010aa5b566269490991",
        "word": "diskette",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/dɪsˈket/",
            "us": "/dɪsˈket/"
        },
        "nearby": [
            {
                "word": "disk",
                "pos": "noun"
            },
            {
                "word": "disk drive",
                "pos": "noun"
            },
            {
                "word": "diskette",
                "pos": "noun"
            },
            {
                "word": "disk jockey",
                "pos": "noun"
            },
            {
                "word": "dislike",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a flat disk inside a plastic cover, used in the past to store data in the form that a computer could read, and that could be removed from the computer",
                    "vi": "một đĩa phẳng bên trong một nắp nhựa, được sử dụng trước đây để lưu trữ dữ liệu ở dạng máy tính có thể đọc và có thể được lấy ra khỏi máy tính"
                },
                "examples": [
                    {
                        "en": "It was low-tech and unreliable—we had to exchange diskettes with customers.",
                        "vi": "Đó là công nghệ thấp và không đáng tin cậy - chúng tôi phải trao đổi đĩa với khách hàng."
                    }
                ]
            }
        ]
    },
    {
        "id": "01f25668d7a14fd181871ed1b91ee811",
        "word": "docking station",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈdɒkɪŋ steɪʃn/",
            "us": "/ˈdɑːkɪŋ steɪʃn/"
        },
        "nearby": [
            {
                "word": "Dockers",
                "pos": "noun"
            },
            {
                "word": "docket",
                "pos": "noun"
            },
            {
                "word": "docking station",
                "pos": "noun"
            },
            {
                "word": "dockland",
                "pos": "noun"
            },
            {
                "word": "Docklands",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a piece of equipment to which a laptop, smartphone or other mobile device can be connected, to provide access to a power supply or so that it can be used with a printer, a keyboard, speakers, etc.",
                    "vi": "một phần thiết bị có thể kết nối với máy tính xách tay, điện thoại thông minh hoặc thiết bị di động khác, để cung cấp quyền truy cập vào nguồn điện hoặc để có thể sử dụng thiết bị này với máy in, bàn phím, loa, v.v."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "7a696bdbfcad432cb362d1b57b14ae10",
        "word": "dongle",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈdɒŋɡl/",
            "us": "/ˈdɑːŋɡl/"
        },
        "nearby": [
            {
                "word": "doner kebab",
                "pos": "noun"
            },
            {
                "word": "donga",
                "pos": "noun"
            },
            {
                "word": "dongle",
                "pos": "noun"
            },
            {
                "word": "The Dong with a Luminous Nose",
                "pos": ""
            },
            {
                "word": "Don Juan",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small device that is used with a computer, especially to access protected software or the internet",
                    "vi": "một thiết bị nhỏ được sử dụng với máy tính, đặc biệt để truy cập phần mềm được bảo vệ hoặc Internet"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "850ae79b98c24410b4f818ebc68ecfc4",
        "word": "drive",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/draɪv/",
            "us": "/draɪv/"
        },
        "nearby": [
            {
                "word": "drippy",
                "pos": "adjective"
            },
            {
                "word": "drive",
                "pos": "verb"
            },
            {
                "word": "drive",
                "pos": "noun"
            },
            {
                "word": "drive away",
                "pos": "phrasal verb"
            },
            {
                "word": "drive bay",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a journey in a car or other vehicle",
                    "vi": "một cuộc hành trình trên ô tô hoặc phương tiện khác"
                },
                "examples": [
                    {
                        "en": "Let's go for a drive.",
                        "vi": "Đi lái xe thôi."
                    },
                    {
                        "en": "a drive through the mountains",
                        "vi": "lái xe xuyên núi"
                    },
                    {
                        "en": "It's a three-hour drive to London.",
                        "vi": "Mất ba giờ lái xe đến London."
                    }
                ]
            },
            {
                "define": {
                    "en": "the equipment in a vehicle that takes power from the engine to the wheels",
                    "vi": "thiết bị trong một chiếc xe lấy sức mạnh từ động cơ đến các bánh xe"
                },
                "examples": [
                    {
                        "en": "the drive shaft",
                        "vi": "trục truyền động"
                    },
                    {
                        "en": "a car with four-wheel drive",
                        "vi": "một chiếc xe bốn bánh"
                    },
                    {
                        "en": "a left-/right-hand drive car (= a car where the driver and the controls are on the left/right)",
                        "vi": "ô tô đánh lái bên trái / phải (= ô tô mà người lái và người điều khiển ở bên trái / phải)"
                    }
                ]
            },
            {
                "define": {
                    "en": "a wide hard path or a private road that leads from the street to a house",
                    "vi": "một con đường cứng rộng hoặc một con đường riêng dẫn từ đường vào nhà"
                },
                "examples": [
                    {
                        "en": "in/on the drive There were two cars parked in the drive.",
                        "vi": "in / on the drive Có hai chiếc ô tô đang đậu trong ổ."
                    }
                ]
            },
            {
                "define": {
                    "en": "an organized effort by a group of people to achieve something",
                    "vi": "nỗ lực có tổ chức của một nhóm người để đạt được điều gì đó"
                },
                "examples": [
                    {
                        "en": "The company is launching a big recruitment drive.",
                        "vi": "Công ty đang tung ra một đợt tuyển dụng lớn."
                    },
                    {
                        "en": "an export/economy drive",
                        "vi": "động lực xuất khẩu / nền kinh tế"
                    },
                    {
                        "en": "drive for something a drive for greater efficiency",
                        "vi": "lái xe cho một cái gì đó một ổ đĩa để đạt hiệu quả cao hơn"
                    },
                    {
                        "en": "drive to do something the government’s drive to reduce energy consumption",
                        "vi": "thúc đẩy làm điều gì đó mà chính phủ thúc đẩy để giảm tiêu thụ năng lượng"
                    }
                ]
            },
            {
                "define": {
                    "en": "a strong desire or need in people",
                    "vi": "một mong muốn hoặc nhu cầu mạnh mẽ ở con người"
                },
                "examples": [
                    {
                        "en": "The treatment should not affect your sex drive or fertility.",
                        "vi": "Việc điều trị sẽ không ảnh hưởng đến ham muốn tình dục hoặc khả năng sinh sản của bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a strong desire to do things and achieve something; great energy",
                    "vi": "một mong muốn mạnh mẽ để làm mọi thứ và đạt được điều gì đó; năng lượng tuyệt vời"
                },
                "examples": [
                    {
                        "en": "He'll do very well—he has tremendous drive.",
                        "vi": "Anh ấy sẽ làm rất tốt - anh ấy có động lực rất lớn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a long hard hit or kick",
                    "vi": "một cú đánh hoặc cú đá dài"
                },
                "examples": [
                    {
                        "en": "She has a strong forehand drive (= in tennis).",
                        "vi": "Cô ấy có một cú đánh thuận tay mạnh mẽ (= trong quần vợt)."
                    },
                    {
                        "en": "He scored with a brilliant 25-yard drive.",
                        "vi": "Anh ấy đã ghi bàn với một cú đánh lái xuất sắc 25 yard."
                    },
                    {
                        "en": "He hit a line drive straight at me.",
                        "vi": "Anh ta đánh một đường thẳng vào tôi."
                    },
                    {
                        "en": "Cole scored with a thunderous left-foot drive.",
                        "vi": "Cole ghi bàn bằng một cú cứa lòng chân trái sấm sét."
                    }
                ]
            },
            {
                "define": {
                    "en": "a type of computer storage that stores large amounts of data on a spinning (= turning) disk",
                    "vi": "một loại lưu trữ máy tính lưu trữ lượng lớn dữ liệu trên đĩa quay (= quay)"
                },
                "examples": [
                    {
                        "en": "a CD drive",
                        "vi": "một ổ đĩa CD"
                    }
                ]
            },
            {
                "define": {
                    "en": "a social occasion when a lot of people compete in a game such as whist or bingo",
                    "vi": "một dịp xã hội khi nhiều người cạnh tranh trong một trò chơi như huýt sáo hoặc chơi lô tô"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "an act of going after animals or the enemy and making them go into a smaller area, especially in order to kill or capture them",
                    "vi": "một hành động đuổi theo động vật hoặc kẻ thù và khiến chúng đi vào một khu vực nhỏ hơn, đặc biệt là để giết hoặc bắt chúng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used in the names of roads",
                    "vi": "được sử dụng trong tên của các con đường"
                },
                "examples": [
                    {
                        "en": "21 Island Heights Drive",
                        "vi": "Đường đi 21 Island Heights"
                    }
                ]
            }
        ]
    },
    {
        "id": "9d8c72eea6574780a00839e35c52c61f",
        "word": "drive bay",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈdraɪv beɪ/",
            "us": "/ˈdraɪv beɪ/"
        },
        "nearby": [
            {
                "word": "drive",
                "pos": "noun"
            },
            {
                "word": "drive away",
                "pos": "phrasal verb"
            },
            {
                "word": "drive bay",
                "pos": "noun"
            },
            {
                "word": "drive-by",
                "pos": "adjective"
            },
            {
                "word": "drive-by",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a space inside a computer for a disk drive",
                    "vi": "không gian bên trong máy tính cho ổ đĩa"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "b3f3599d8b064dc0b078cd1b05761755",
        "word": "duplex",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈdjuːpleks/",
            "us": "/ˈduːpleks/"
        },
        "nearby": [
            {
                "word": "dupe",
                "pos": "verb"
            },
            {
                "word": "dupe",
                "pos": "noun"
            },
            {
                "word": "duplex",
                "pos": "adjective"
            },
            {
                "word": "duplex",
                "pos": "noun"
            },
            {
                "word": "duplicate",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "with rooms on two floors",
                    "vi": "với các phòng trên hai tầng"
                },
                "examples": [
                    {
                        "en": "a duplex apartment",
                        "vi": "căn hộ 2 tầng"
                    },
                    {
                        "en": "The duplex penthouses cover the top two floors of the building.",
                        "vi": "Các căn hộ thông tầng song lập bao phủ hai tầng trên cùng của tòa nhà."
                    }
                ]
            },
            {
                "define": {
                    "en": "joined to another house by a wall on one side that is shared",
                    "vi": "nối với một ngôi nhà khác bởi một bức tường ở một bên được chia sẻ"
                },
                "examples": [
                    {
                        "en": "a duplex house/villa",
                        "vi": "một ngôi nhà / biệt thự song lập"
                    }
                ]
            },
            {
                "define": {
                    "en": "able to print on both sides of the paper",
                    "vi": "có thể in trên cả hai mặt của giấy"
                },
                "examples": [
                    {
                        "en": "This model comes with nice features such as Wi-Fi and duplex printing.",
                        "vi": "Mô hình này đi kèm với các tính năng tuyệt vời như Wi-Fi và in hai mặt."
                    }
                ]
            },
            {
                "define": {
                    "en": "allowing signals to be sent in both directions at the same time",
                    "vi": "cho phép tín hiệu được gửi theo cả hai hướng cùng một lúc"
                },
                "examples": [
                    {
                        "en": "A common application of duplex communication is in online chat systems.",
                        "vi": "Một ứng dụng phổ biến của giao tiếp song công là trong các hệ thống trò chuyện trực tuyến."
                    }
                ]
            }
        ]
    },
    {
        "id": "f1d6ead0fff74f23b67df147b07372fa",
        "word": "flash memory",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈflæʃ meməri/",
            "us": "/ˈflæʃ meməri/"
        },
        "nearby": [
            {
                "word": "flashlight",
                "pos": "noun"
            },
            {
                "word": "Harry Flashman",
                "pos": ""
            },
            {
                "word": "flash memory",
                "pos": "noun"
            },
            {
                "word": "flash mob",
                "pos": "noun"
            },
            {
                "word": "flash mobber",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "computer memory that does not lose data when the power supply is lost",
                    "vi": "bộ nhớ máy tính không bị mất dữ liệu khi mất nguồn điện"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "f7303451e7e947b6a4b4defe632343b2",
        "word": "flatbed scanner",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌflætbed ˈskænə(r)/",
            "us": "/ˌflætbed ˈskænər/"
        },
        "nearby": [
            {
                "word": "flat",
                "pos": "verb"
            },
            {
                "word": "flatbed",
                "pos": "noun"
            },
            {
                "word": "flatbed scanner",
                "pos": "noun"
            },
            {
                "word": "flatbread",
                "pos": "noun"
            },
            {
                "word": "flat cap",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a scanner (= device for copying pictures and documents so that they can be stored on a computer) on which the picture or document can be laid flat for copying",
                    "vi": "máy quét (= thiết bị sao chép hình ảnh và tài liệu để chúng có thể được lưu trữ trên máy tính) trên đó hình ảnh hoặc tài liệu có thể được đặt phẳng để sao chép"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "0fb5c8c9e5a34a5e9e0a7c90db1814e9",
        "word": "flat-panel",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈflæt pænl/",
            "us": "/ˈflæt pænl/"
        },
        "nearby": [
            {
                "word": "flat-out",
                "pos": "adjective"
            },
            {
                "word": "flat-pack",
                "pos": "noun"
            },
            {
                "word": "flat-panel",
                "pos": "adjective"
            },
            {
                "word": "flat racing",
                "pos": "noun"
            },
            {
                "word": "flat rate",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a type of television or computer monitor that is very thin when compared with the original type",
                    "vi": "một loại tivi hoặc màn hình máy tính rất mỏng khi so sánh với loại ban đầu"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c6e369c555424389ac53097b13b8773a",
        "word": "floppy disk",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌflɒpi ˈdɪsk/",
            "us": "/ˌflɑːpi ˈdɪsk/"
        },
        "nearby": [
            {
                "word": "flophouse",
                "pos": "noun"
            },
            {
                "word": "floppy",
                "pos": "adjective"
            },
            {
                "word": "floppy disk",
                "pos": "noun"
            },
            {
                "word": "flora",
                "pos": "noun"
            },
            {
                "word": "Flora",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a flat disk inside a plastic cover, used in the past to store data in the form that a computer could read, and that could be removed from the computer",
                    "vi": "một đĩa phẳng bên trong một nắp nhựa, được sử dụng trước đây để lưu trữ dữ liệu ở dạng máy tính có thể đọc và có thể được lấy ra khỏi máy tính"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "3aae171b886449ed9fe10089c95d445b",
        "word": "graphics adapter",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɡræfɪks ədæptə(r)/",
            "us": "/ˈɡræfɪks ədæptər/"
        },
        "nearby": [
            {
                "word": "graphic novel",
                "pos": "noun"
            },
            {
                "word": "graphics",
                "pos": "noun"
            },
            {
                "word": "graphics adapter",
                "pos": "noun"
            },
            {
                "word": "graphics card",
                "pos": "noun"
            },
            {
                "word": "graphics tablet",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a device that allows images to be shown on a computer screen",
                    "vi": "một thiết bị cho phép hiển thị hình ảnh trên màn hình máy tính"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "601f5ed582504e359b1852ed13b505be",
        "word": "graphics card",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɡræfɪks kɑːd/",
            "us": "/ˈɡræfɪks kɑːrd/"
        },
        "nearby": [
            {
                "word": "graphics",
                "pos": "noun"
            },
            {
                "word": "graphics adapter",
                "pos": "noun"
            },
            {
                "word": "graphics card",
                "pos": "noun"
            },
            {
                "word": "graphics tablet",
                "pos": "noun"
            },
            {
                "word": "graphite",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a circuit board that allows a computer to show images on its screen",
                    "vi": "bảng mạch cho phép máy tính hiển thị hình ảnh trên màn hình"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "1a0fe9193e3740be92507dc963d10ae8",
        "word": "graphics tablet",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɡræfɪks tæblət/",
            "us": "/ˈɡræfɪks tæblət/"
        },
        "nearby": [
            {
                "word": "graphics adapter",
                "pos": "noun"
            },
            {
                "word": "graphics card",
                "pos": "noun"
            },
            {
                "word": "graphics tablet",
                "pos": "noun"
            },
            {
                "word": "graphite",
                "pos": "noun"
            },
            {
                "word": "graphology",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a flat device connected to a computer that you draw on with a special pen (called a stylus) to create an image on the screen",
                    "vi": "một thiết bị phẳng được kết nối với máy tính mà bạn dùng bút đặc biệt (gọi là bút cảm ứng) để tạo hình ảnh trên màn hình"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "012fd27fb5a442cdbe1a30b81a83de19",
        "word": "interoperability",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌɪntərˌɒpərəˈbɪləti/",
            "us": "/ˌɪntərˌɑːpərəˈbɪləti/"
        },
        "nearby": [
            {
                "word": "internship",
                "pos": "noun"
            },
            {
                "word": "interoffice",
                "pos": "adjective"
            },
            {
                "word": "interoperability",
                "pos": "noun"
            },
            {
                "word": "interoperable",
                "pos": "adjective"
            },
            {
                "word": "interpenetrate",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the ability of computer systems or programs to exchange information",
                    "vi": "khả năng của hệ thống máy tính hoặc chương trình để trao đổi thông tin"
                },
                "examples": [
                    {
                        "en": "This new feature should ensure greater interoperability between devices.",
                        "vi": "Tính năng mới này sẽ đảm bảo khả năng tương tác cao hơn giữa các thiết bị."
                    }
                ]
            },
            {
                "define": {
                    "en": "the ability of military equipment or groups to work together",
                    "vi": "khả năng của các thiết bị quân sự hoặc các nhóm làm việc cùng nhau"
                },
                "examples": [
                    {
                        "en": "They need to achieve higher levels of interoperability with allies.",
                        "vi": "Họ cần đạt được mức độ tương tác cao hơn với các đồng minh."
                    }
                ]
            }
        ]
    },
    {
        "id": "3739ce4dc41341d3bb6fdfd47b88583e",
        "word": "ISA",
        "pos": "abbreviation",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈaɪsə/",
            "us": "/ˈaɪsə/"
        },
        "nearby": [
            {
                "word": "Is.",
                "pos": "abbreviation"
            },
            {
                "word": "ISA1",
                "pos": "noun"
            },
            {
                "word": "ISA2",
                "pos": "abbreviation"
            },
            {
                "word": "Isaac",
                "pos": ""
            },
            {
                "word": "Isabel",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "Industry Standard Architecture (the usual international system used for connecting computers and other devices)",
                    "vi": "Kiến trúc tiêu chuẩn công nghiệp (hệ thống quốc tế thông thường được sử dụng để kết nối máy tính và các thiết bị khác)"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "495efdf418a8492f9db23f80dc93af85",
        "word": "joystick",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈdʒɔɪstɪk/",
            "us": "/ˈdʒɔɪstɪk/"
        },
        "nearby": [
            {
                "word": "joyrider",
                "pos": "noun"
            },
            {
                "word": "joyriding",
                "pos": "noun"
            },
            {
                "word": "joystick",
                "pos": "noun"
            },
            {
                "word": "JP",
                "pos": "noun"
            },
            {
                "word": "JPEG",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a stick with a handle used with some computer games to move images on the screen",
                    "vi": "một cây gậy có tay cầm được sử dụng với một số trò chơi máy tính để di chuyển hình ảnh trên màn hình"
                },
                "examples": [
                    {
                        "en": "There are two joysticks on the console, which you operate with your thumbs.",
                        "vi": "Có hai cần điều khiển trên bảng điều khiển mà bạn thao tác bằng ngón tay cái."
                    },
                    {
                        "en": "You can direct your spaceship around the screen using the mouse, the keyboard or a joystick.",
                        "vi": "Bạn có thể hướng phi thuyền của mình quanh màn hình bằng chuột, bàn phím hoặc cần điều khiển."
                    }
                ]
            },
            {
                "define": {
                    "en": "a stick with a handle in an aircraft that is used to control direction or height",
                    "vi": "một cây gậy có tay cầm trên máy bay được sử dụng để điều khiển hướng hoặc độ cao"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "d8c968ec1d6f497f89b3185c8b74f07f",
        "word": "LAN",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/læn/",
            "us": "/læn/"
        },
        "nearby": [
            {
                "word": "lamprey",
                "pos": "noun"
            },
            {
                "word": "lampshade",
                "pos": "noun"
            },
            {
                "word": "LAN",
                "pos": "noun"
            },
            {
                "word": "Lancashire",
                "pos": ""
            },
            {
                "word": "Lancashire hotpot",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a system for communicating by computer within a large building or group of buildings (the abbreviation for ‘local area network’)",
                    "vi": "một hệ thống giao tiếp bằng máy tính trong một tòa nhà lớn hoặc một nhóm các tòa nhà (viết tắt của 'mạng cục bộ')"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "5c1a353eacf84b418683a216369a302c",
        "word": "local area network",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌləʊkl ˌeəriə ˈnetwɜːk/",
            "us": "/ˌləʊkl ˌeriə ˈnetwɜːrk/"
        },
        "nearby": [
            {
                "word": "lo-cal",
                "pos": "adjective"
            },
            {
                "word": "local",
                "pos": "noun"
            },
            {
                "word": "local area network",
                "pos": "noun"
            },
            {
                "word": "local authority",
                "pos": "noun"
            },
            {
                "word": "local bus",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a system for communicating by computer within a large building or group of buildings",
                    "vi": "một hệ thống giao tiếp bằng máy tính trong một tòa nhà lớn hoặc một nhóm các tòa nhà"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "b15f1d027f214b6c820d98a3b44597e1",
        "word": "local bus",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌləʊkl ˈbʌs/",
            "us": "/ˌləʊkl ˈbʌs/"
        },
        "nearby": [
            {
                "word": "local area network",
                "pos": "noun"
            },
            {
                "word": "local authority",
                "pos": "noun"
            },
            {
                "word": "local bus",
                "pos": "noun"
            },
            {
                "word": "local call",
                "pos": "noun"
            },
            {
                "word": "local colour",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a high-speed data connection that directly links computer devices to the processor and memory",
                    "vi": "kết nối dữ liệu tốc độ cao liên kết trực tiếp các thiết bị máy tính với bộ xử lý và bộ nhớ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "4b08444043fe406db4984d5fbb812412",
        "word": "mainframe",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmeɪnfreɪm/",
            "us": "/ˈmeɪnfreɪm/"
        },
        "nearby": [
            {
                "word": "the main drag",
                "pos": "noun"
            },
            {
                "word": "Maine",
                "pos": ""
            },
            {
                "word": "mainframe",
                "pos": "noun"
            },
            {
                "word": "mainland",
                "pos": "adjective"
            },
            {
                "word": "the mainland",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a large, powerful computer, usually the centre of a network and shared by many users",
                    "vi": "một máy tính lớn, mạnh mẽ, thường là trung tâm của mạng và được nhiều người dùng chia sẻ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "64858b297bc042e29877a7437eb4194f",
        "word": "medium",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmiːdiəm/",
            "us": "/ˈmiːdiəm/"
        },
        "nearby": [
            {
                "word": "(the) Mediterranean Sea",
                "pos": "noun"
            },
            {
                "word": "medium",
                "pos": "adjective"
            },
            {
                "word": "medium",
                "pos": "noun"
            },
            {
                "word": "medium-sized",
                "pos": "adjective"
            },
            {
                "word": "medium-term",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a way of communicating information, etc. to people",
                    "vi": "một cách truyền đạt thông tin, v.v. cho mọi người"
                },
                "examples": [
                    {
                        "en": "the medium of radio/television",
                        "vi": "phương tiện truyền thanh / truyền hình"
                    },
                    {
                        "en": "electronic/audiovisual media",
                        "vi": "phương tiện điện tử / nghe nhìn"
                    },
                    {
                        "en": "medium of something The internet is the modern medium of communication.",
                        "vi": "phương tiện truyền thông Internet là phương tiện truyền thông hiện đại."
                    },
                    {
                        "en": "medium for doing something A T-shirt can be an excellent medium for getting your message across.",
                        "vi": "phương tiện để làm điều gì đó Một chiếc áo phông có thể là một phương tiện tuyệt vời để truyền tải thông điệp của bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "something that is used for a particular purpose",
                    "vi": "một cái gì đó được sử dụng cho một mục đích cụ thể"
                },
                "examples": [
                    {
                        "en": "medium of something English is the medium of instruction (= the language used to teach other subjects).",
                        "vi": "phương tiện của một cái gì đó Tiếng Anh là phương tiện giảng dạy (= ngôn ngữ được sử dụng để dạy các môn học khác)."
                    },
                    {
                        "en": "medium for doing something Video is a good medium for learning a foreign language.",
                        "vi": "phương tiện để làm điều gì đó Video là một phương tiện tốt để học ngoại ngữ."
                    }
                ]
            },
            {
                "define": {
                    "en": "the material used for storing computer files, such as on magnetic tape or discs",
                    "vi": "vật liệu được sử dụng để lưu trữ các tệp máy tính, chẳng hạn như trên băng từ hoặc đĩa"
                },
                "examples": [
                    {
                        "en": "Copy files to and from the device as you would with any other storage medium.",
                        "vi": "Sao chép tệp vào và từ thiết bị như bạn làm với bất kỳ phương tiện lưu trữ nào khác."
                    }
                ]
            },
            {
                "define": {
                    "en": "the material or the form that an artist, a writer or a musician uses",
                    "vi": "tài liệu hoặc hình thức mà một nghệ sĩ, một nhà văn hoặc một nhạc sĩ sử dụng"
                },
                "examples": [
                    {
                        "en": "the medium of paint/poetry/drama",
                        "vi": "phương tiện của sơn / thơ / kịch"
                    },
                    {
                        "en": "Watercolour is his favourite medium.",
                        "vi": "Màu nước là phương tiện yêu thích của anh ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "a substance that something exists or grows in or that it travels through",
                    "vi": "một chất mà một cái gì đó tồn tại hoặc phát triển trong đó hoặc nó đi qua"
                },
                "examples": [
                    {
                        "en": "The bacteria were growing in a sugar medium.",
                        "vi": "Vi khuẩn đã phát triển trong môi trường đường."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who claims to be able to communicate with the spirits of dead people",
                    "vi": "một người tuyên bố có thể giao tiếp với linh hồn của những người đã chết"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "something that is in the middle between two choices or two ways of doing something",
                    "vi": "một cái gì đó ở giữa hai sự lựa chọn hoặc hai cách để làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "She tried to strike a happy medium between making the questions too hard and making them too easy.",
                        "vi": "Cô ấy cố gắng tạo ra một phương tiện hài lòng giữa việc đưa ra các câu hỏi quá khó và làm cho chúng quá dễ."
                    }
                ]
            }
        ]
    },
    {
        "id": "f0a72d0ff32444dbb612a01690baeeae",
        "word": "memory bank",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmeməri bæŋk/",
            "us": "/ˈmeməri bæŋk/"
        },
        "nearby": [
            {
                "word": "memorize",
                "pos": "verb"
            },
            {
                "word": "memory",
                "pos": "noun"
            },
            {
                "word": "memory bank",
                "pos": "noun"
            },
            {
                "word": "memory card",
                "pos": "noun"
            },
            {
                "word": "memory lane",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the memory of a device such as a computer",
                    "vi": "bộ nhớ của một thiết bị như máy tính"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "4acf8aa557f2481d8c4457ad0c618c8f",
        "word": "modem",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈməʊdem/",
            "us": "/ˈməʊdəm/"
        },
        "nearby": [
            {
                "word": "model village",
                "pos": "noun"
            },
            {
                "word": "model yourself on",
                "pos": "phrasal verb"
            },
            {
                "word": "modem",
                "pos": "noun"
            },
            {
                "word": "moderate",
                "pos": "adjective"
            },
            {
                "word": "moderate",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a device that is used at both ends of a connection between two computers to allow data to be sent over phone lines",
                    "vi": "một thiết bị được sử dụng ở cả hai đầu của kết nối giữa hai máy tính để cho phép dữ liệu được gửi qua đường dây điện thoại"
                },
                "examples": [
                    {
                        "en": "Data is transmitted via a modem link to the central office.",
                        "vi": "Dữ liệu được truyền qua liên kết modem đến văn phòng trung tâm."
                    },
                    {
                        "en": "You can send the files to us via modem.",
                        "vi": "Bạn có thể gửi tệp cho chúng tôi qua modem."
                    }
                ]
            }
        ]
    },
    {
        "id": "418ec4f89d9a4705910e5bc653a234c2",
        "word": "motherboard",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmʌðəbɔːd/",
            "us": "/ˈmʌðərbɔːrd/"
        },
        "nearby": [
            {
                "word": "mother",
                "pos": "noun"
            },
            {
                "word": "mother",
                "pos": "verb"
            },
            {
                "word": "motherboard",
                "pos": "noun"
            },
            {
                "word": "Mothercare",
                "pos": ""
            },
            {
                "word": "mother country",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the main board of a computer, containing all the circuits",
                    "vi": "bảng mạch chính của máy tính, chứa tất cả các mạch"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "0df5f52e43464838b239de1a99597715",
        "word": "multiprocessor",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌmʌltiˈprəʊsesə(r)/",
            "us": "/ˌmʌltiˈprɑːsesər/"
        },
        "nearby": [
            {
                "word": "multiplier",
                "pos": "noun"
            },
            {
                "word": "multiply",
                "pos": "verb"
            },
            {
                "word": "multiprocessor",
                "pos": "noun"
            },
            {
                "word": "multipurpose",
                "pos": "adjective"
            },
            {
                "word": "multiracial",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a computer with more than one central processing unit",
                    "vi": "một máy tính có nhiều hơn một đơn vị xử lý trung tâm"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "be9cc3e24c324e93b4da57c9759ab318",
        "word": "netbook",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈnetbʊk/",
            "us": "/ˈnetbʊk/"
        },
        "nearby": [
            {
                "word": "neta",
                "pos": "noun"
            },
            {
                "word": "netball",
                "pos": "noun"
            },
            {
                "word": "netbook",
                "pos": "noun"
            },
            {
                "word": "net curtain",
                "pos": "noun"
            },
            {
                "word": "nether",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small laptop computer, designed especially for using the internet and email",
                    "vi": "một máy tính xách tay nhỏ, được thiết kế đặc biệt để sử dụng Internet và email"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "9dc078244b1e42f39522f724e9225459",
        "word": "notebook",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈnəʊtbʊk/",
            "us": "/ˈnəʊtbʊk/"
        },
        "nearby": [
            {
                "word": "note",
                "pos": "noun"
            },
            {
                "word": "note",
                "pos": "verb"
            },
            {
                "word": "notebook",
                "pos": "noun"
            },
            {
                "word": "notecard",
                "pos": "noun"
            },
            {
                "word": "noted",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small book of plain paper for writing notes in",
                    "vi": "một cuốn sách nhỏ bằng giấy thường để viết ghi chú"
                },
                "examples": [
                    {
                        "en": "The police officer wrote the details down in his notebook.",
                        "vi": "Viên cảnh sát đã ghi chi tiết vào sổ tay của mình."
                    },
                    {
                        "en": "She kept a notebook (= wrote notes in it) during the trip.",
                        "vi": "Cô ấy đã giữ một cuốn sổ (= đã viết các ghi chú trong đó) trong suốt chuyến đi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a small book for students to write their work in",
                    "vi": "một cuốn sách nhỏ cho học sinh viết bài của họ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a small computer that can work with a battery and be easily carried",
                    "vi": "một máy tính nhỏ có thể hoạt động bằng pin và dễ dàng mang theo"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "2a92ddc3dd3341cd828e019983ff8a32",
        "word": "on-board",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌɒn ˈbɔːd/",
            "us": "/ˌɑːn ˈbɔːrd/"
        },
        "nearby": [
            {
                "word": "Jackie Onassis",
                "pos": ""
            },
            {
                "word": "onboard",
                "pos": "verb"
            },
            {
                "word": "on-board",
                "pos": "adjective"
            },
            {
                "word": "onboarding",
                "pos": "noun"
            },
            {
                "word": "on-call",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "on a ship, aircraft or vehicle",
                    "vi": "trên một con tàu, máy bay hoặc phương tiện"
                },
                "examples": [
                    {
                        "en": "an on-board motor",
                        "vi": "một động cơ trên tàu"
                    }
                ]
            },
            {
                "define": {
                    "en": "relating to, or controlled by, part of the main circuit board",
                    "vi": "liên quan đến, hoặc được điều khiển bởi một phần của bảng mạch chính"
                },
                "examples": [
                    {
                        "en": "a PC with onboard sound",
                        "vi": "PC có âm thanh tích hợp"
                    }
                ]
            }
        ]
    },
    {
        "id": "0c7d0011cb284c42938ec5ec7893f59a",
        "word": "palmtop",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpɑːmtɒp/",
            "us": "/ˈpɑːmtɑːp/"
        },
        "nearby": [
            {
                "word": "Palm Springs",
                "pos": ""
            },
            {
                "word": "Palm Sunday",
                "pos": "noun"
            },
            {
                "word": "palmtop",
                "pos": "noun"
            },
            {
                "word": "palmy",
                "pos": "adjective"
            },
            {
                "word": "Mount Palomar",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small computer that can be held in the palm of one hand",
                    "vi": "một chiếc máy tính nhỏ có thể được cầm trong lòng bàn tay"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "829bdfaae8cd471da4134ace8ca6b9d3",
        "word": "parallel port",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpærəlel pɔːt/",
            "us": "/ˈpærəlel pɔːrt/"
        },
        "nearby": [
            {
                "word": "parallelogram",
                "pos": "noun"
            },
            {
                "word": "parallel park",
                "pos": "verb"
            },
            {
                "word": "parallel port",
                "pos": "noun"
            },
            {
                "word": "parallel processing",
                "pos": "noun"
            },
            {
                "word": "parallel ruler",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a point on a computer where you connect a device such as a printer that sends or receives more than one piece of data at a time",
                    "vi": "một điểm trên máy tính nơi bạn kết nối một thiết bị chẳng hạn như máy in để gửi hoặc nhận nhiều phần dữ liệu cùng một lúc"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "6df800be4a764f0cbcd030a0d7e0f625",
        "word": "pen drive",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpen draɪv/",
            "us": "/ˈpen draɪv/"
        },
        "nearby": [
            {
                "word": "pending",
                "pos": "preposition"
            },
            {
                "word": "pending",
                "pos": "adjective"
            },
            {
                "word": "pen drive",
                "pos": "noun"
            },
            {
                "word": "pendulous",
                "pos": "adjective"
            },
            {
                "word": "pendulum",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small memory device that can be used to store data from a computer or digital camera and to move it from one device to another",
                    "vi": "một thiết bị bộ nhớ nhỏ có thể được sử dụng để lưu trữ dữ liệu từ máy tính hoặc máy ảnh kỹ thuật số và di chuyển dữ liệu đó từ thiết bị này sang thiết bị khác"
                },
                "examples": []
            }
        ]
    }
]