[
    {
        "id": "bed4e0df3c794e5a9fc2d2cc4c731e98",
        "word": "ice",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/aɪs/",
            "us": "/aɪs/"
        },
        "nearby": [
            {
                "word": "-ical",
                "pos": "suffix"
            },
            {
                "word": "-ically",
                "pos": "suffix"
            },
            {
                "word": "ice",
                "pos": "noun"
            },
            {
                "word": "ice",
                "pos": "verb"
            },
            {
                "word": "ICE",
                "pos": "abbreviation"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "water that has frozen and become solid",
                    "vi": "nước đã đóng băng và trở nên rắn"
                },
                "examples": [
                    {
                        "en": "There was ice on the windows.",
                        "vi": "Có băng trên cửa sổ."
                    },
                    {
                        "en": "The lake was covered with a sheet of ice.",
                        "vi": "Mặt hồ được bao phủ bởi một lớp băng."
                    },
                    {
                        "en": "the body of a man perfectly preserved in a block of ice",
                        "vi": "cơ thể của một người đàn ông được bảo quản hoàn hảo trong một khối băng"
                    },
                    {
                        "en": "My hands are as cold as ice.",
                        "vi": "Tay tôi lạnh như băng."
                    },
                    {
                        "en": "substantial loss of sea ice in the Arctic Ocean",
                        "vi": "mất đáng kể băng biển ở Bắc Băng Dương"
                    }
                ]
            },
            {
                "define": {
                    "en": "a frozen surface that people skate on",
                    "vi": "bề mặt đóng băng mà mọi người trượt băng"
                },
                "examples": [
                    {
                        "en": "on the ice Both teams are on the ice, waiting for the whistle.",
                        "vi": "trên băng Cả hai đội đang băng lên chờ tiếng còi."
                    },
                    {
                        "en": "The dancers came out onto the ice.",
                        "vi": "Các vũ công bước ra sân băng."
                    },
                    {
                        "en": "People were skating on the ice.",
                        "vi": "Mọi người đang trượt băng trên băng."
                    },
                    {
                        "en": "They held hands as they glided across the ice.",
                        "vi": "Họ nắm tay nhau khi lướt trên mặt băng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of ice used to keep food and drinks cold",
                    "vi": "một miếng đá được sử dụng để giữ lạnh thức ăn và đồ uống"
                },
                "examples": [
                    {
                        "en": "I'll have lemonade please—no ice.",
                        "vi": "Làm ơn cho tôi uống nước chanh — không đá."
                    },
                    {
                        "en": "a glass of water with ice and lemon",
                        "vi": "một ly nước đá và chanh"
                    },
                    {
                        "en": "She ordered a vodka and ice.",
                        "vi": "Cô ấy gọi một vodka và đá."
                    },
                    {
                        "en": "The glass was filled with green liquid and crushed ice.",
                        "vi": "Ly chứa đầy chất lỏng màu xanh lục và đá vụn."
                    }
                ]
            },
            {
                "define": {
                    "en": "an ice cream",
                    "vi": "một cây kem"
                },
                "examples": [
                    {
                        "en": "Drinks, ices and popcorn are all on sale in the foyer.",
                        "vi": "Đồ uống, kem và bỏng ngô đều được bày bán trong tiền sảnh."
                    }
                ]
            },
            {
                "define": {
                    "en": "a type of sweet food that consists of ice that has been crushed (= broken into very small pieces) and given a sweet taste",
                    "vi": "một loại thức ăn ngọt bao gồm đá được nghiền nhỏ (= vỡ thành những miếng rất nhỏ) và có vị ngọt"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be taking a risk",
                    "vi": "mạo hiểm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to say or do something that makes people feel more relaxed, especially at the beginning of a meeting, party, etc.",
                    "vi": "để nói hoặc làm điều gì đó khiến mọi người cảm thấy thoải mái hơn, đặc biệt là khi bắt đầu một cuộc họp, bữa tiệc, v.v."
                },
                "examples": [
                    {
                        "en": "Jim organized a few party games to break the ice when people first arrived.",
                        "vi": "Jim đã tổ chức một vài trò chơi tiệc tùng để phá băng khi mọi người mới đến."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have no influence or effect on somebody",
                    "vi": "không có ảnh hưởng hoặc ảnh hưởng đến ai đó"
                },
                "examples": [
                    {
                        "en": "His excuses cut no ice with me.",
                        "vi": "Những lời bào chữa của anh ấy không hề có chút băng khoăn nào với tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "kept cold by being surrounded by ice",
                    "vi": "giữ lạnh do được bao quanh bởi băng"
                },
                "examples": [
                    {
                        "en": "All the food is laid out and the champagne is on ice.",
                        "vi": "Tất cả thức ăn được bày ra và rượu sâm panh ở trên đá."
                    }
                ]
            },
            {
                "define": {
                    "en": "not being dealt with now; waiting to be dealt with at a later time",
                    "vi": "bây giờ không bị xử lý; chờ được xử lý sau"
                },
                "examples": [
                    {
                        "en": "We've had to put our plans on ice for the time being.",
                        "vi": "Chúng tôi đã phải đặt kế hoạch của mình vào thời điểm hiện tại."
                    }
                ]
            },
            {
                "define": {
                    "en": "performed by skaters on an ice rink",
                    "vi": "biểu diễn của vận động viên trượt băng trên sân băng"
                },
                "examples": [
                    {
                        "en": "Cinderella on ice",
                        "vi": "Cô bé lọ lem trên băng"
                    }
                ]
            }
        ]
    },
    {
        "id": "b73b95a0a0d44b1a88ce4464324680ec",
        "word": "kettle",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈketl/",
            "us": "/ˈketl/"
        },
        "nearby": [
            {
                "word": "ketch",
                "pos": "noun"
            },
            {
                "word": "ketchup",
                "pos": "noun"
            },
            {
                "word": "kettle",
                "pos": "noun"
            },
            {
                "word": "kettle",
                "pos": "verb"
            },
            {
                "word": "kettlebell",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a container with a lid, a handle and a spout, used for boiling water",
                    "vi": "bình có nắp, có tay cầm và có vòi, dùng để đun nước sôi"
                },
                "examples": [
                    {
                        "en": "an electric kettle",
                        "vi": "một ấm điện"
                    },
                    {
                        "en": "(British English) I'll put the kettle on (= start boiling some water) and make some tea.",
                        "vi": "(Tiếng Anh Anh) Tôi sẽ bật ấm đun nước (= bắt đầu đun một ít nước) và pha một ít trà."
                    },
                    {
                        "en": "I'll just boil the kettle.",
                        "vi": "Tôi sẽ chỉ đun sôi cái ấm."
                    },
                    {
                        "en": "She made herself a sandwich while she waited for the kettle to boil.",
                        "vi": "Cô ấy tự làm một chiếc bánh sandwich trong khi đợi ấm đun nước sôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a completely different situation or person from the one previously mentioned",
                    "vi": "một tình huống hoặc một người hoàn toàn khác với tình huống đã đề cập trước đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to say that you should not criticize somebody for a fault that you have yourself",
                    "vi": "đã từng nói rằng bạn không nên chỉ trích ai đó vì lỗi mà bản thân bạn mắc phải"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "97ac0580341a42f69f278f7ec3928e1b",
        "word": "pour",
        "pos": "verb",
        "level": "b1",
        "phonetic": {
            "uk": "/pɔː(r)/",
            "us": "/pɔːr/"
        },
        "nearby": [
            {
                "word": "pound out",
                "pos": "phrasal verb"
            },
            {
                "word": "pound sign",
                "pos": "noun"
            },
            {
                "word": "pour",
                "pos": "verb"
            },
            {
                "word": "pour into",
                "pos": "phrasal verb"
            },
            {
                "word": "pour out",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to make a liquid or other substance flow from a container in a continuous stream, especially by holding the container at an angle",
                    "vi": "để làm cho chất lỏng hoặc chất khác chảy từ vật chứa theo một dòng liên tục, đặc biệt là bằng cách giữ vật chứa ở một góc"
                },
                "examples": [
                    {
                        "en": "pour something + adv./prep. Pour the sauce over the pasta.",
                        "vi": "đổ cái gì đó + adv./prep. Đổ nước sốt lên mì."
                    },
                    {
                        "en": "She poured boiling water down the sink.",
                        "vi": "Cô đổ nước sôi xuống bồn rửa mặt."
                    },
                    {
                        "en": "Pour away as much fat as possible from the roasting pan.",
                        "vi": "Đổ càng nhiều mỡ ra khỏi chảo rang càng tốt."
                    },
                    {
                        "en": "pour something Although I poured it carefully, I still managed to spill some.",
                        "vi": "đổ cái gì đó Mặc dù tôi đã đổ rất cẩn thận, tôi vẫn cố làm đổ một ít."
                    },
                    {
                        "en": "The crew mixed and poured the concrete.",
                        "vi": "Đội thợ trộn và đổ bê tông."
                    }
                ]
            },
            {
                "define": {
                    "en": "to serve a drink by letting it flow from a container into a cup or glass",
                    "vi": "để phục vụ đồ uống bằng cách để nó chảy từ vật chứa vào cốc hoặc ly"
                },
                "examples": [
                    {
                        "en": "pour something Will you pour the coffee?",
                        "vi": "đổ một cái gì đó Bạn sẽ đổ cà phê?"
                    },
                    {
                        "en": "a freshly poured soda",
                        "vi": "một lon nước ngọt mới rót"
                    },
                    {
                        "en": "pour somebody something I've poured you a cup of tea.",
                        "vi": "rót cho ai đó thứ gì đó. Tôi đã rót cho bạn một tách trà."
                    },
                    {
                        "en": "pour something for somebody I've poured a cup of tea for you.",
                        "vi": "rót gì đó cho ai đó. Tôi đã rót một tách trà cho bạn."
                    },
                    {
                        "en": "pour something out I was in the kitchen, pouring out drinks.",
                        "vi": "đổ thứ gì đó ra Tôi đang ở trong bếp, đổ đồ uống ra."
                    },
                    {
                        "en": "Shall I pour?",
                        "vi": "Tôi sẽ đổ?"
                    }
                ]
            },
            {
                "define": {
                    "en": "when rain pours down or when it’s pouring (with) rain, rain is falling heavily",
                    "vi": "khi mưa đổ xuống hoặc khi trời đổ (kèm theo) mưa, mưa rơi nặng hạt"
                },
                "examples": [
                    {
                        "en": "It's pouring outside.",
                        "vi": "Bên ngoài trời đang đổ."
                    },
                    {
                        "en": "pour down The rain continued to pour down.",
                        "vi": "đổ xuống Mưa vẫn tiếp tục đổ xuống."
                    },
                    {
                        "en": "(British English) pour with rain It's pouring with rain.",
                        "vi": "(Tiếng Anh Anh) đổ với mưa Trời đang đổ mưa."
                    },
                    {
                        "en": "(North American English) pour (down) rain It's pouring rain outside.",
                        "vi": "(Tiếng Anh Bắc Mỹ) đổ (xuống) mưa Bên ngoài trời đang đổ mưa."
                    }
                ]
            },
            {
                "define": {
                    "en": "to flow quickly in a continuous stream",
                    "vi": "chảy nhanh trong một dòng liên tục"
                },
                "examples": [
                    {
                        "en": "Tears poured down his cheeks.",
                        "vi": "Nước mắt anh tuôn rơi trên má."
                    },
                    {
                        "en": "Thick black smoke was pouring out of the roof.",
                        "vi": "Khói đen dày đặc bốc ra từ mái nhà."
                    },
                    {
                        "en": "Blood was pouring from the wound.",
                        "vi": "Máu từ vết thương đổ ra."
                    },
                    {
                        "en": "The sweat was pouring off her.",
                        "vi": "Mồ hôi đã đổ ra cho cô."
                    },
                    {
                        "en": "Light poured in.",
                        "vi": "Ánh sáng tràn vào."
                    },
                    {
                        "en": "(figurative) A torrent of words poured from her mouth.",
                        "vi": "(nghĩa bóng) Một loạt lời nói tuôn ra từ miệng cô ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to come or go somewhere continuously in large numbers",
                    "vi": "đến hoặc đi một nơi nào đó liên tục với số lượng lớn"
                },
                "examples": [
                    {
                        "en": "The crowd poured into the streets.",
                        "vi": "Đám đông đổ ra đường."
                    },
                    {
                        "en": "Commuters came pouring out of the station.",
                        "vi": "Hành khách đổ ra khỏi nhà ga."
                    },
                    {
                        "en": "Letters of complaint continue to pour in.",
                        "vi": "Đơn thư phàn nàn tiếp tục đổ về."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that when one bad thing happens to you, other bad things happen soon after",
                    "vi": "thường nói rằng khi một điều tồi tệ xảy ra với bạn, những điều tồi tệ khác sẽ xảy ra ngay sau đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to give reasons for not being in favour of something; to criticize something",
                    "vi": "để đưa ra lý do không ủng hộ điều gì đó; để chỉ trích một cái gì đó"
                },
                "examples": [
                    {
                        "en": "She immediately poured cold water on his plans to expand the business.",
                        "vi": "Cô lập tức dội gáo nước lạnh vào kế hoạch mở rộng kinh doanh của anh."
                    }
                ]
            },
            {
                "define": {
                    "en": "to try to settle an argument",
                    "vi": "để cố gắng giải quyết một cuộc tranh cãi"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to tell somebody all your problems, feelings, etc.",
                    "vi": "để nói với ai đó tất cả các vấn đề, cảm xúc của bạn, v.v."
                },
                "examples": [
                    {
                        "en": "Finally, he broke down in tears and poured out his heart to her.",
                        "vi": "Cuối cùng, anh đã gục ngã trong nước mắt và dốc hết trái tim mình cho cô."
                    }
                ]
            },
            {
                "define": {
                    "en": "to speak about somebody/something in a way that shows that you do not respect them or have a good opinion of them",
                    "vi": "nói về ai đó / điều gì đó theo cách cho thấy rằng bạn không tôn trọng họ hoặc có quan điểm tốt về họ"
                },
                "examples": [
                    {
                        "en": "Opposition politicians poured scorn on the proposals.",
                        "vi": "Các chính trị gia đối lập tỏ ra khinh bỉ các đề xuất này."
                    }
                ]
            }
        ]
    },
    {
        "id": "f4b612c0ee614d1fa2248cbf7b942cae",
        "word": "teapot",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈtiːpɒt/",
            "us": "/ˈtiːpɑːt/"
        },
        "nearby": [
            {
                "word": "teamworking",
                "pos": "noun"
            },
            {
                "word": "tea party",
                "pos": "noun"
            },
            {
                "word": "teapot",
                "pos": "noun"
            },
            {
                "word": "Teapot Dome",
                "pos": ""
            },
            {
                "word": "tear1",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a container with a spout, a handle and a lid (= cover), used for making and serving tea",
                    "vi": "một hộp đựng có vòi, tay cầm và nắp đậy (= nắp), dùng để pha và phục vụ trà"
                },
                "examples": [
                    {
                        "en": "She refilled the teapot with boiling water.",
                        "vi": "Cô đổ đầy nước sôi vào ấm trà."
                    }
                ]
            },
            {
                "define": {
                    "en": "a lot of anger or worry about something that is not important",
                    "vi": "rất nhiều tức giận hoặc lo lắng về điều gì đó không quan trọng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "f2c007305ca04b249f2b771e35c53cfa",
        "word": "ice cube",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈaɪs kjuːb/",
            "us": "/ˈaɪs kjuːb/"
        },
        "nearby": [
            {
                "word": "ice-cold",
                "pos": "adjective"
            },
            {
                "word": "ice cream",
                "pos": "noun"
            },
            {
                "word": "ice cube",
                "pos": "noun"
            },
            {
                "word": "iced",
                "pos": "adjective"
            },
            {
                "word": "ice dancer",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small, usually square, piece of ice used for making drinks cold",
                    "vi": "một miếng đá nhỏ, thường là hình vuông, dùng để làm đồ uống lạnh"
                },
                "examples": [
                    {
                        "en": "She put some ice cubes into her lemonade.",
                        "vi": "Cô cho vài viên đá vào cốc nước chanh của mình."
                    }
                ]
            }
        ]
    },
    {
        "id": "5ebdb3f3d65b472d9374d0a34aefff16",
        "word": "on ice",
        "pos": "idiom",
        "level": "b2",
        "phonetic": {
            "uk": "/aɪs/",
            "us": "/aɪs/"
        },
        "nearby": [
            {
                "word": "-ical",
                "pos": "suffix"
            },
            {
                "word": "-ically",
                "pos": "suffix"
            },
            {
                "word": "ice",
                "pos": "noun"
            },
            {
                "word": "ice",
                "pos": "verb"
            },
            {
                "word": "ICE",
                "pos": "abbreviation"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "water that has frozen and become solid",
                    "vi": "nước đã đóng băng và trở nên rắn"
                },
                "examples": [
                    {
                        "en": "There was ice on the windows.",
                        "vi": "Có băng trên cửa sổ."
                    },
                    {
                        "en": "The lake was covered with a sheet of ice.",
                        "vi": "Mặt hồ được bao phủ bởi một lớp băng."
                    },
                    {
                        "en": "the body of a man perfectly preserved in a block of ice",
                        "vi": "cơ thể của một người đàn ông được bảo quản hoàn hảo trong một khối băng"
                    },
                    {
                        "en": "My hands are as cold as ice.",
                        "vi": "Tay tôi lạnh như băng."
                    },
                    {
                        "en": "substantial loss of sea ice in the Arctic Ocean",
                        "vi": "mất đáng kể băng biển ở Bắc Băng Dương"
                    }
                ]
            },
            {
                "define": {
                    "en": "a frozen surface that people skate on",
                    "vi": "bề mặt đóng băng mà mọi người trượt băng"
                },
                "examples": [
                    {
                        "en": "on the ice Both teams are on the ice, waiting for the whistle.",
                        "vi": "trên băng Cả hai đội đang băng lên chờ tiếng còi."
                    },
                    {
                        "en": "The dancers came out onto the ice.",
                        "vi": "Các vũ công bước ra sân băng."
                    },
                    {
                        "en": "People were skating on the ice.",
                        "vi": "Mọi người đang trượt băng trên băng."
                    },
                    {
                        "en": "They held hands as they glided across the ice.",
                        "vi": "Họ nắm tay nhau khi lướt trên mặt băng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of ice used to keep food and drinks cold",
                    "vi": "một miếng đá được sử dụng để giữ lạnh thức ăn và đồ uống"
                },
                "examples": [
                    {
                        "en": "I'll have lemonade please—no ice.",
                        "vi": "Làm ơn cho tôi uống nước chanh — không đá."
                    },
                    {
                        "en": "a glass of water with ice and lemon",
                        "vi": "một ly nước đá và chanh"
                    },
                    {
                        "en": "She ordered a vodka and ice.",
                        "vi": "Cô ấy gọi một vodka và đá."
                    },
                    {
                        "en": "The glass was filled with green liquid and crushed ice.",
                        "vi": "Ly chứa đầy chất lỏng màu xanh lục và đá vụn."
                    }
                ]
            },
            {
                "define": {
                    "en": "an ice cream",
                    "vi": "một cây kem"
                },
                "examples": [
                    {
                        "en": "Drinks, ices and popcorn are all on sale in the foyer.",
                        "vi": "Đồ uống, kem và bỏng ngô đều được bày bán trong tiền sảnh."
                    }
                ]
            },
            {
                "define": {
                    "en": "a type of sweet food that consists of ice that has been crushed (= broken into very small pieces) and given a sweet taste",
                    "vi": "một loại thức ăn ngọt bao gồm đá được nghiền nhỏ (= vỡ thành những miếng rất nhỏ) và có vị ngọt"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be taking a risk",
                    "vi": "mạo hiểm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to say or do something that makes people feel more relaxed, especially at the beginning of a meeting, party, etc.",
                    "vi": "để nói hoặc làm điều gì đó khiến mọi người cảm thấy thoải mái hơn, đặc biệt là khi bắt đầu một cuộc họp, bữa tiệc, v.v."
                },
                "examples": [
                    {
                        "en": "Jim organized a few party games to break the ice when people first arrived.",
                        "vi": "Jim đã tổ chức một vài trò chơi tiệc tùng để phá băng khi mọi người mới đến."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have no influence or effect on somebody",
                    "vi": "không có ảnh hưởng hoặc ảnh hưởng đến ai đó"
                },
                "examples": [
                    {
                        "en": "His excuses cut no ice with me.",
                        "vi": "Những lời bào chữa của anh ấy không hề có chút băng khoăn nào với tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "kept cold by being surrounded by ice",
                    "vi": "giữ lạnh do được bao quanh bởi băng"
                },
                "examples": [
                    {
                        "en": "All the food is laid out and the champagne is on ice.",
                        "vi": "Tất cả thức ăn được bày ra và rượu sâm panh ở trên đá."
                    }
                ]
            },
            {
                "define": {
                    "en": "not being dealt with now; waiting to be dealt with at a later time",
                    "vi": "bây giờ không bị xử lý; chờ được xử lý sau"
                },
                "examples": [
                    {
                        "en": "We've had to put our plans on ice for the time being.",
                        "vi": "Chúng tôi đã phải đặt kế hoạch của mình vào thời điểm hiện tại."
                    }
                ]
            },
            {
                "define": {
                    "en": "performed by skaters on an ice rink",
                    "vi": "biểu diễn của vận động viên trượt băng trên sân băng"
                },
                "examples": [
                    {
                        "en": "Cinderella on ice",
                        "vi": "Cô bé lọ lem trên băng"
                    }
                ]
            }
        ]
    },
    {
        "id": "c90c240e04b34bcc9699a55682ec4a50",
        "word": "brew",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/bruː/",
            "us": "/bruː/"
        },
        "nearby": [
            {
                "word": "breviary",
                "pos": "noun"
            },
            {
                "word": "brevity",
                "pos": "noun"
            },
            {
                "word": "brew",
                "pos": "verb"
            },
            {
                "word": "brew",
                "pos": "noun"
            },
            {
                "word": "brewer",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to make beer",
                    "vi": "để làm bia"
                },
                "examples": [
                    {
                        "en": "This beer is brewed in the Czech Republic.",
                        "vi": "Loại bia này được ủ tại Cộng hòa Séc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make a hot drink of tea or coffee",
                    "vi": "để pha một ly trà hoặc cà phê nóng"
                },
                "examples": [
                    {
                        "en": "freshly brewed coffee",
                        "vi": "cà phê mới pha"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be mixed with hot water and become ready to drink",
                    "vi": "được pha với nước nóng và trở nên sẵn sàng để uống"
                },
                "examples": [
                    {
                        "en": "Always let tea brew for a few minutes.",
                        "vi": "Luôn để trà ủ trong vài phút."
                    }
                ]
            },
            {
                "define": {
                    "en": "if something unpleasant is brewing or brewing up, it seems likely to happen soon",
                    "vi": "nếu có thứ gì đó khó chịu đang ủ hoặc đang ủ, có vẻ như nó sẽ sớm xảy ra"
                },
                "examples": [
                    {
                        "en": "Trouble has been brewing for some time now.",
                        "vi": "Rắc rối đã xảy ra trong một thời gian."
                    },
                    {
                        "en": "A storm was brewing up out at sea.",
                        "vi": "Một cơn bão đang nổi lên trên biển."
                    }
                ]
            }
        ]
    },
    {
        "id": "12c65c52749d4be4a5bbae2d4d9a938e",
        "word": "brewery",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈbruːəri/",
            "us": "/ˈbruːəri/"
        },
        "nearby": [
            {
                "word": "brewer",
                "pos": "noun"
            },
            {
                "word": "Brewer's Dictionary of Phrase and Fable",
                "pos": ""
            },
            {
                "word": "brewery",
                "pos": "noun"
            },
            {
                "word": "brewhouse",
                "pos": "noun"
            },
            {
                "word": "brewpub",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a factory where beer is made; a company that makes beer",
                    "vi": "một nhà máy sản xuất bia; một công ty sản xuất bia"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "b72f2885a3e3496eb490056faa0fa0f8",
        "word": "corkscrew",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈkɔːkskruː/",
            "us": "/ˈkɔːrkskruː/"
        },
        "nearby": [
            {
                "word": "corked",
                "pos": "adjective"
            },
            {
                "word": "corker",
                "pos": "noun"
            },
            {
                "word": "corkscrew",
                "pos": "noun"
            },
            {
                "word": "corkscrew",
                "pos": "verb"
            },
            {
                "word": "corm",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a tool for pulling corks from bottles. Most corkscrews have a handle and a long twisted piece of metal for pushing into the cork.",
                    "vi": "một công cụ để kéo nút chai từ chai. Hầu hết các loại vặn nút chai đều có tay cầm và một đoạn kim loại dài xoắn để đẩy vào nút chai."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "1ac5166ff24f426eb354513dc6f32022",
        "word": "pint",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/paɪnt/",
            "us": "/paɪnt/"
        },
        "nearby": [
            {
                "word": "pinstripe",
                "pos": "noun"
            },
            {
                "word": "pinstriped",
                "pos": "adjective"
            },
            {
                "word": "pint",
                "pos": "noun"
            },
            {
                "word": "pinta",
                "pos": "noun"
            },
            {
                "word": "Harold Pinter",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a unit for measuring liquids and some dry goods, equal to 0.568 of a litre in the UK and some other countries, and 0.473 of a litre in the US. There are 8 pints in a gallon",
                    "vi": "đơn vị đo lường chất lỏng và một số mặt hàng khô, bằng 0,568 lít ở Anh và một số nước khác, và 0,473 lít ở Mỹ. Có 8 panh trong một gallon"
                },
                "examples": [
                    {
                        "en": "a pint of beer/milk",
                        "vi": "một vại bia / sữa"
                    },
                    {
                        "en": "We'd better get a couple of extra pints (= of milk) tomorrow.",
                        "vi": "Tốt hơn chúng ta nên mua thêm vài panh (= sữa) vào ngày mai."
                    },
                    {
                        "en": "Add half a pint of cream.",
                        "vi": "Thêm nửa lít kem."
                    }
                ]
            },
            {
                "define": {
                    "en": "a pint of beer (especially in a pub)",
                    "vi": "một vại bia (đặc biệt là trong quán rượu)"
                },
                "examples": [
                    {
                        "en": "Do you want to go for a pint later?",
                        "vi": "Bạn có muốn đi uống một chút sau không?"
                    },
                    {
                        "en": "a pint/half-pint glass",
                        "vi": "một ly pint / nửa panh"
                    }
                ]
            }
        ]
    },
    {
        "id": "26a04dab8a7c471199490586e0e13935",
        "word": "distil",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/dɪˈstɪl/",
            "us": "/dɪˈstɪl/"
        },
        "nearby": [
            {
                "word": "distended",
                "pos": "adjective"
            },
            {
                "word": "distension",
                "pos": "noun"
            },
            {
                "word": "distil",
                "pos": "verb"
            },
            {
                "word": "distillate",
                "pos": "noun"
            },
            {
                "word": "distillation",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to make a liquid pure by heating it until it becomes a gas, then cooling it and collecting the drops of liquid that form",
                    "vi": "để làm cho chất lỏng trở nên tinh khiết bằng cách đun nóng nó cho đến khi nó trở thành khí, sau đó làm lạnh nó và thu thập những giọt chất lỏng tạo thành"
                },
                "examples": [
                    {
                        "en": "to distil fresh water from seawater",
                        "vi": "chưng cất nước ngọt từ nước biển"
                    },
                    {
                        "en": "distilled water",
                        "vi": "nước cất"
                    }
                ]
            },
            {
                "define": {
                    "en": "to make something such as a strong alcoholic drink in this way",
                    "vi": "để làm một thứ gì đó chẳng hạn như đồ uống có cồn mạnh theo cách này"
                },
                "examples": [
                    {
                        "en": "The factory distils and bottles whisky.",
                        "vi": "Nhà máy chưng cất và đóng chai rượu whisky."
                    }
                ]
            },
            {
                "define": {
                    "en": "to get the essential meaning or ideas from thoughts, information, experiences, etc.",
                    "vi": "để có được ý nghĩa hoặc ý tưởng thiết yếu từ những suy nghĩ, thông tin, kinh nghiệm, v.v."
                },
                "examples": [
                    {
                        "en": "The notes I made on my travels were distilled into a book.",
                        "vi": "Những ghi chép tôi đã thực hiện trong chuyến đi của mình đã được chắt lọc thành một cuốn sách."
                    }
                ]
            }
        ]
    },
    {
        "id": "fee52f00b3964efe94e846ba939f40b7",
        "word": "distillery",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/dɪˈstɪləri/",
            "us": "/dɪˈstɪləri/"
        },
        "nearby": [
            {
                "word": "distillation",
                "pos": "noun"
            },
            {
                "word": "distiller",
                "pos": "noun"
            },
            {
                "word": "distillery",
                "pos": "noun"
            },
            {
                "word": "distinct",
                "pos": "adjective"
            },
            {
                "word": "distinction",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a factory where strong alcoholic drink is made by the process of distilling",
                    "vi": "một nhà máy sản xuất đồ uống có cồn mạnh bằng quá trình chưng cất"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "5dd54d9f13c148fa92d11afce1bdf2aa",
        "word": "microbrewery",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmaɪkrəʊbruːəri/",
            "us": "/ˈmaɪkrəʊbruːəri/"
        },
        "nearby": [
            {
                "word": "microblogging",
                "pos": "noun"
            },
            {
                "word": "microbrew",
                "pos": "noun"
            },
            {
                "word": "microbrewery",
                "pos": "noun"
            },
            {
                "word": "microchip",
                "pos": "noun"
            },
            {
                "word": "microchip",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small brewery (= a factory where beer is made), that often sells its beer to visitors or only sells it locally",
                    "vi": "một nhà máy bia nhỏ (= nhà máy sản xuất bia), thường bán bia của mình cho du khách hoặc chỉ bán tại địa phương"
                },
                "examples": [
                    {
                        "en": "a microbrewery with a capacity of about 12 000 barrels a year",
                        "vi": "một nhà máy bia nhỏ với công suất khoảng 12 000 thùng một năm"
                    }
                ]
            }
        ]
    },
    {
        "id": "4bd02bead11748b99f5f8fd3b42b1e96",
        "word": "neat",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/niːt/",
            "us": "/niːt/"
        },
        "nearby": [
            {
                "word": "nearsighted",
                "pos": "adjective"
            },
            {
                "word": "nearsightedness",
                "pos": "noun"
            },
            {
                "word": "neat",
                "pos": "adjective"
            },
            {
                "word": "neaten",
                "pos": "verb"
            },
            {
                "word": "neatly",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "tidy and in order; carefully done or arranged",
                    "vi": "ngăn nắp và có thứ tự; được thực hiện hoặc sắp xếp cẩn thận"
                },
                "examples": [
                    {
                        "en": "She kept her desk extremely neat.",
                        "vi": "Cô giữ bàn làm việc của mình vô cùng ngăn nắp."
                    },
                    {
                        "en": "You've got very neat handwriting!",
                        "vi": "Bạn đã có chữ viết tay rất gọn gàng!"
                    },
                    {
                        "en": "neat rows of books",
                        "vi": "hàng sách gọn gàng"
                    },
                    {
                        "en": "She was wearing a neat black suit.",
                        "vi": "Cô ấy mặc một bộ đồ đen gọn gàng."
                    },
                    {
                        "en": "They sat in her neat and tidy kitchen.",
                        "vi": "Họ ngồi trong căn bếp gọn gàng và ngăn nắp của cô."
                    }
                ]
            },
            {
                "define": {
                    "en": "liking to keep things tidy and in order; looking tidy or doing things in a tidy way",
                    "vi": "thích giữ mọi thứ ngăn nắp và có thứ tự; trông ngăn nắp hoặc làm mọi thứ một cách ngăn nắp"
                },
                "examples": [
                    {
                        "en": "Try and be neater!",
                        "vi": "Hãy cố gắng và gọn gàng hơn!"
                    },
                    {
                        "en": "He had a neat methodical mind.",
                        "vi": "Anh ta có một đầu óc có phương pháp gọn gàng."
                    },
                    {
                        "en": "By nature he was clean and neat.",
                        "vi": "Bản chất anh ấy sạch sẽ và gọn gàng."
                    },
                    {
                        "en": "(informal) Don't be a neat freak. Relax. A little clutter won't kill you.",
                        "vi": "(không chính thức) Đừng là một kẻ kỳ quặc gọn gàng. Thư giãn. Một chút lộn xộn sẽ không giết bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "small, with an attractive shape or appearance",
                    "vi": "nhỏ, có hình dạng hoặc vẻ ngoài hấp dẫn"
                },
                "examples": [
                    {
                        "en": "her neat figure",
                        "vi": "dáng người gọn gàng của cô ấy"
                    },
                    {
                        "en": "The puppies’ ears should be neat and in proportion to the head.",
                        "vi": "Tai của chó con phải gọn gàng và cân đối với đầu."
                    }
                ]
            },
            {
                "define": {
                    "en": "simple but clever",
                    "vi": "đơn giản nhưng thông minh"
                },
                "examples": [
                    {
                        "en": "a neat explanation",
                        "vi": "một lời giải thích gọn gàng"
                    },
                    {
                        "en": "a neat solution to the problem",
                        "vi": "một giải pháp gọn gàng cho vấn đề"
                    },
                    {
                        "en": "The film has a lot of neat tricks and clever editing.",
                        "vi": "Phim có nhiều chiêu trò gọn gàng và cách dựng phim khéo léo."
                    },
                    {
                        "en": "We can't put people and events into neat little boxes.",
                        "vi": "Chúng ta không thể đặt mọi người và sự kiện vào những chiếc hộp nhỏ gọn gàng."
                    }
                ]
            },
            {
                "define": {
                    "en": "good; excellent",
                    "vi": "tốt; thông minh"
                },
                "examples": [
                    {
                        "en": "It's a really neat movie.",
                        "vi": "Đó là một bộ phim thực sự gọn gàng."
                    },
                    {
                        "en": "We had a great time—it was pretty neat.",
                        "vi": "Chúng tôi đã có một khoảng thời gian tuyệt vời — nó khá gọn gàng."
                    }
                ]
            },
            {
                "define": {
                    "en": "not mixed with water or anything else",
                    "vi": "không trộn với nước hoặc bất cứ thứ gì khác"
                },
                "examples": [
                    {
                        "en": "neat whisky",
                        "vi": "rượu whisky gọn gàng"
                    }
                ]
            }
        ]
    },
    {
        "id": "d8bbb31fe1df46d8a29ec3986810c529",
        "word": "straight",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/streɪt/",
            "us": "/streɪt/"
        },
        "nearby": [
            {
                "word": "straggly",
                "pos": "adjective"
            },
            {
                "word": "straight",
                "pos": "adverb"
            },
            {
                "word": "straight",
                "pos": "adjective"
            },
            {
                "word": "straight",
                "pos": "noun"
            },
            {
                "word": "straight angle",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "without a bend or curve; going in one direction only",
                    "vi": "không có một khúc quanh hoặc đường cong; chỉ đi theo một hướng"
                },
                "examples": [
                    {
                        "en": "a straight road",
                        "vi": "một con đường thẳng"
                    },
                    {
                        "en": "long, straight hair (= not curly)",
                        "vi": "tóc dài, thẳng (= không xoăn)"
                    },
                    {
                        "en": "a boat sailing in a straight line",
                        "vi": "một con thuyền chèo thuyền trên một đường thẳng"
                    },
                    {
                        "en": "straight-backed chairs",
                        "vi": "ghế tựa thẳng"
                    },
                    {
                        "en": "Keep the car straight when you're backing out.",
                        "vi": "Giữ xe thẳng khi bạn đang lùi xe."
                    }
                ]
            },
            {
                "define": {
                    "en": "positioned in the correct way; level, vertical or parallel to something",
                    "vi": "được định vị theo cách chính xác; cấp độ, thẳng đứng hoặc song song với một cái gì đó"
                },
                "examples": [
                    {
                        "en": "Is my tie straight?",
                        "vi": "Cà vạt của tôi có thẳng không?"
                    },
                    {
                        "en": "He stepped back to make sure that the picture was straight.",
                        "vi": "Anh lùi lại để đảm bảo rằng bức tranh được thẳng hàng."
                    },
                    {
                        "en": "Her teeth were white and perfectly straight.",
                        "vi": "Hàm răng của cô trắng và đều tăm tắp."
                    }
                ]
            },
            {
                "define": {
                    "en": "not fitting close to the body and not curving away from the body",
                    "vi": "không ôm sát cơ thể và không cong ra khỏi cơ thể"
                },
                "examples": [
                    {
                        "en": "a straight skirt",
                        "vi": "váy liền"
                    }
                ]
            },
            {
                "define": {
                    "en": "going directly to the correct place",
                    "vi": "đi thẳng đến địa điểm chính xác"
                },
                "examples": [
                    {
                        "en": "a straight punch to the face",
                        "vi": "một cú đấm thẳng vào mặt"
                    }
                ]
            },
            {
                "define": {
                    "en": "clean and neat, with everything in the correct place",
                    "vi": "sạch sẽ và gọn gàng, với mọi thứ ở đúng vị trí"
                },
                "examples": [
                    {
                        "en": "It took hours to get the house straight.",
                        "vi": "Phải mất hàng giờ đồng hồ mới đưa được ngôi nhà vào thẳng."
                    },
                    {
                        "en": "I'm trying to get the house straight before the weekend.",
                        "vi": "Tôi đang cố gắng nhận nhà ngay trước cuối tuần."
                    }
                ]
            },
            {
                "define": {
                    "en": "honest and direct",
                    "vi": "trung thực và trực tiếp"
                },
                "examples": [
                    {
                        "en": "I expect a straight answer to a straight question.",
                        "vi": "Tôi mong đợi một câu trả lời thẳng thắn cho một câu hỏi thẳng."
                    },
                    {
                        "en": "straight with somebody I don't think you're being straight with me.",
                        "vi": "thẳng thắn với ai đó Tôi không nghĩ rằng bạn đang thẳng thắn với tôi."
                    },
                    {
                        "en": "It's time for some straight talking.",
                        "vi": "Đã đến lúc nói chuyện thẳng thắn."
                    },
                    {
                        "en": "You can trust Ben—he’s (as) straight as a die (= completely honest).",
                        "vi": "Bạn có thể tin tưởng Ben — anh ấy (như) thẳng như một con chết (= hoàn toàn trung thực)."
                    }
                ]
            },
            {
                "define": {
                    "en": "simple; involving only two clear choices",
                    "vi": "giản dị; chỉ liên quan đến hai lựa chọn rõ ràng"
                },
                "examples": [
                    {
                        "en": "It was a straight choice between taking the job and staying out of work.",
                        "vi": "Đó là một sự lựa chọn thẳng thắn giữa việc làm và nghỉ việc."
                    },
                    {
                        "en": "(British English) The election was a straight fight between the two main parties.",
                        "vi": "(Tiếng Anh Anh) Cuộc bầu cử là một cuộc chiến thẳng thắn giữa hai đảng chính."
                    }
                ]
            },
            {
                "define": {
                    "en": "not connected with comedy or musical theatre, but with serious theatre",
                    "vi": "không kết nối với hài kịch hoặc sân khấu âm nhạc, nhưng với rạp hát nghiêm túc"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "one after another in a series that is not interrupted",
                    "vi": "cái này đến cái khác trong một chuỗi không bị gián đoạn"
                },
                "examples": [
                    {
                        "en": "The team has had five straight wins.",
                        "vi": "Đội đã có năm trận thắng liên tiếp."
                    }
                ]
            },
            {
                "define": {
                    "en": "not mixed with water or anything else",
                    "vi": "không trộn với nước hoặc bất cứ thứ gì khác"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "you can use straight to describe a person who is normal and ordinary, but who you consider boring",
                    "vi": "bạn có thể sử dụng thẳng để mô tả một người bình thường và bình thường, nhưng người bạn cho là nhàm chán"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "heterosexual",
                    "vi": "dị tính"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to make a situation clear; to make sure that you or somebody else understands the situation",
                    "vi": "để làm cho một tình huống rõ ràng; để đảm bảo rằng bạn hoặc ai đó khác hiểu được tình hình"
                },
                "examples": [
                    {
                        "en": "Let's get this straight—you really had no idea where he was?",
                        "vi": "Hãy nói thẳng điều này - bạn thực sự không biết anh ta ở đâu?"
                    },
                    {
                        "en": "Let's get this absolutely straight.",
                        "vi": "Hãy làm cho điều này hoàn toàn thẳng thắn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to give people the correct information about something in order to make it clear that what they previously believed was in fact wrong",
                    "vi": "cung cấp cho mọi người thông tin chính xác về điều gì đó để làm rõ rằng những gì họ tin tưởng trước đây trên thực tế là sai"
                },
                "examples": [
                    {
                        "en": "To put the record straight, I do not support that idea and never have done.",
                        "vi": "Nói thẳng ra, tôi không ủng hộ ý kiến đó và chưa bao giờ thực hiện."
                    }
                ]
            },
            {
                "define": {
                    "en": "to correct somebody’s mistake; to make sure that somebody knows the correct facts when they have had the wrong idea or impression",
                    "vi": "để sửa chữa sai lầm của ai đó; để đảm bảo rằng ai đó biết sự thật chính xác khi họ có ý tưởng hoặc ấn tượng sai"
                },
                "examples": [
                    {
                        "en": "She soon set me straight about what had happened.",
                        "vi": "Cô ấy sớm nói thẳng với tôi về những gì đã xảy ra."
                    }
                ]
            },
            {
                "define": {
                    "en": "with a very straight back and looking serious and formal",
                    "vi": "với một cái lưng rất thẳng và trông nghiêm túc và trang trọng"
                },
                "examples": [
                    {
                        "en": "Her back was ramrod straight.",
                        "vi": "Lưng cô thẳng tắp."
                    },
                    {
                        "en": "He stood there straight as a ramrod.",
                        "vi": "Anh ta đứng thẳng ở đó như một con cừu đực."
                    }
                ]
            },
            {
                "define": {
                    "en": "the honest and morally acceptable way of living",
                    "vi": "cách sống trung thực và được chấp nhận về mặt đạo đức"
                },
                "examples": [
                    {
                        "en": "His friends try to keep him on the straight and narrow.",
                        "vi": "Bạn bè của anh ấy cố gắng giữ anh ấy trên đường thẳng và hẹp."
                    }
                ]
            },
            {
                "define": {
                    "en": "if you keep a straight face, you do not laugh or smile, although you find something funny",
                    "vi": "nếu bạn giữ một khuôn mặt thẳng thắn, bạn không cười hoặc không cười, mặc dù bạn thấy điều gì đó buồn cười"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "(to get) the best grades in all your classes",
                    "vi": "(để có được) điểm tốt nhất trong tất cả các lớp học của bạn"
                },
                "examples": [
                    {
                        "en": "a straight A student",
                        "vi": "một học sinh thẳng thắn"
                    }
                ]
            }
        ]
    }
]