[
    {
        "id": "5fc688b4a2a644668dea7ed53017e092",
        "word": "degree",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/dɪˈɡriː/",
            "us": "/dɪˈɡriː/"
        },
        "nearby": [
            {
                "word": "degrading",
                "pos": "adjective"
            },
            {
                "word": "degrease",
                "pos": "verb"
            },
            {
                "word": "degree",
                "pos": "noun"
            },
            {
                "word": "Geoffrey de Havilland",
                "pos": ""
            },
            {
                "word": "dehumanization",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a unit for measuring temperature",
                    "vi": "một đơn vị đo nhiệt độ"
                },
                "examples": [
                    {
                        "en": "at… degrees Water freezes at 32 degrees Fahrenheit (32°F) or zero/nought degrees Celsius (0°C).",
                        "vi": "ở… độ Nước đóng băng ở 32 độ F (32 ° F) hoặc không / không độ C (0 ° C)."
                    },
                    {
                        "en": "above/below… degrees Temperatures are expected to drop below 2 degrees.",
                        "vi": "trên / dưới… độ Nhiệt độ dự kiến sẽ giảm xuống dưới 2 độ."
                    },
                    {
                        "en": "Last weekend temperatures reached 40 degrees.",
                        "vi": "Cuối tuần trước nhiệt độ lên tới 40 độ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a unit for measuring angles",
                    "vi": "một đơn vị đo góc"
                },
                "examples": [
                    {
                        "en": "an angle of ninety degrees (90°)",
                        "vi": "một góc chín mươi độ (90 °)"
                    }
                ]
            },
            {
                "define": {
                    "en": "the amount or level of something",
                    "vi": "số lượng hoặc mức độ của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "degree of something Her job demands a high degree of skill.",
                        "vi": "mức độ của một cái gì đó Công việc của cô ấy đòi hỏi một mức độ kỹ năng cao."
                    },
                    {
                        "en": "with a degree of something The story has been staged several times before, with varying degrees of success.",
                        "vi": "với một mức độ nào đó Câu chuyện đã được dàn dựng nhiều lần trước đó, với mức độ thành công khác nhau."
                    },
                    {
                        "en": "to a degree I agree with you to a certain degree.",
                        "vi": "ở một mức độ, tôi đồng ý với bạn ở một mức độ nhất định."
                    },
                    {
                        "en": "The reaction to his decision has been, to some degree, predictable.",
                        "vi": "Phản ứng đối với quyết định của anh ấy, ở một mức độ nào đó, có thể đoán trước được."
                    },
                    {
                        "en": "These criticisms are, to a degree (= to some extent), well founded.",
                        "vi": "Những lời chỉ trích này, ở một mức độ nào đó (= ở một mức độ nào đó), là có cơ sở."
                    },
                    {
                        "en": "To what degree can parents be held responsible for a child's behaviour?",
                        "vi": "Cha mẹ có thể chịu trách nhiệm về hành vi của trẻ ở mức độ nào?"
                    },
                    {
                        "en": "Most pop music is influenced, to a greater or lesser degree, by the blues.",
                        "vi": "Hầu hết nhạc pop đều bị ảnh hưởng bởi nhạc blues ở mức độ lớn hơn hoặc thấp hơn."
                    }
                ]
            },
            {
                "define": {
                    "en": "the qualification obtained by students who successfully complete a university or college course",
                    "vi": "bằng cấp đạt được của những sinh viên hoàn thành khóa học đại học hoặc cao đẳng"
                },
                "examples": [
                    {
                        "en": "My brother has a master's degree from Harvard.",
                        "vi": "Anh trai tôi có bằng thạc sĩ của Harvard."
                    },
                    {
                        "en": "degree in something She's pursuing a degree in biochemistry.",
                        "vi": "bằng cấp về cái gì đó Cô ấy đang theo đuổi một bằng cấp về hóa sinh."
                    },
                    {
                        "en": "a four-year degree course",
                        "vi": "một khóa học bốn năm cấp bằng"
                    },
                    {
                        "en": "an undergraduate/graduate/doctoral degree",
                        "vi": "bằng đại học / sau đại học / tiến sĩ"
                    },
                    {
                        "en": "a law/medical degree",
                        "vi": "bằng luật / y khoa"
                    }
                ]
            },
            {
                "define": {
                    "en": "a university or college course, normally lasting three years or more",
                    "vi": "một khóa học đại học hoặc cao đẳng, thường kéo dài ba năm trở lên"
                },
                "examples": [
                    {
                        "en": "I'm hoping to do a chemistry degree.",
                        "vi": "Tôi hy vọng sẽ đạt được một mức độ hóa học."
                    },
                    {
                        "en": "He took a degree in law then joined a law firm.",
                        "vi": "Anh lấy bằng luật sau đó gia nhập một công ty luật."
                    }
                ]
            },
            {
                "define": {
                    "en": "a level in a scale of how serious something is",
                    "vi": "một mức trong thang đo mức độ nghiêm trọng của một điều gì đó"
                },
                "examples": [
                    {
                        "en": "murder in the first degree (= of the most serious kind)",
                        "vi": "giết người ở mức độ đầu tiên (= thuộc loại nghiêm trọng nhất)"
                    },
                    {
                        "en": "first-degree murder",
                        "vi": "giết người cấp độ một"
                    },
                    {
                        "en": "third-degree (= very serious) burns",
                        "vi": "bỏng cấp độ ba (= rất nghiêm trọng)"
                    }
                ]
            },
            {
                "define": {
                    "en": "slowly and gradually",
                    "vi": "từ từ và dần dần"
                },
                "examples": [
                    {
                        "en": "By degrees their friendship grew into love.",
                        "vi": "Theo mức độ, tình bạn của họ phát triển thành tình yêu."
                    },
                    {
                        "en": "By slow degrees, the company's turnover dwindled to nothing.",
                        "vi": "Theo mức độ chậm chạp, doanh thu của công ty giảm dần."
                    }
                ]
            },
            {
                "define": {
                    "en": "extremely; to an extreme degree",
                    "vi": "cực kì; đến một mức độ cực đoan"
                },
                "examples": [
                    {
                        "en": "The children tested her patience to the nth degree.",
                        "vi": "Những đứa trẻ đã kiểm tra sự kiên nhẫn của cô đến độ thứ n."
                    }
                ]
            }
        ]
    },
    {
        "id": "4b4cbf695f224607a3f67d369d1b68ed",
        "word": "graduate",
        "pos": "verb",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈɡrædʒueɪt/",
            "us": "/ˈɡrædʒueɪt/"
        },
        "nearby": [
            {
                "word": "graduate",
                "pos": "noun"
            },
            {
                "word": "The Graduate",
                "pos": ""
            },
            {
                "word": "graduate",
                "pos": "verb"
            },
            {
                "word": "graduate assistant",
                "pos": "noun"
            },
            {
                "word": "graduated",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to get a degree, especially your first degree, from a university or college",
                    "vi": "để có được bằng cấp, đặc biệt là bằng cấp đầu tiên của bạn, từ một trường đại học hoặc cao đẳng"
                },
                "examples": [
                    {
                        "en": "She taught in France after she graduated.",
                        "vi": "Cô đã dạy ở Pháp sau khi cô tốt nghiệp."
                    },
                    {
                        "en": "graduate in something Only three students graduated in Czech studies last year.",
                        "vi": "tốt nghiệp chuyên ngành gì đó Chỉ có ba sinh viên tốt nghiệp ngành học ở Séc vào năm ngoái."
                    },
                    {
                        "en": "graduate from something She graduated from Harvard this year.",
                        "vi": "tốt nghiệp từ một cái gì đó Cô ấy đã tốt nghiệp Harvard năm nay."
                    },
                    {
                        "en": "graduate with something He graduated with a BA in English in 2018.",
                        "vi": "tốt nghiệp với cái gì đó Anh ấy đã tốt nghiệp cử nhân tiếng Anh vào năm 2018."
                    },
                    {
                        "en": "He graduated from York with a degree in Psychology.",
                        "vi": "Anh tốt nghiệp ngành Tâm lý học tại York."
                    },
                    {
                        "en": "graduate something (North American English) She graduated college last year.",
                        "vi": "tốt nghiệp cái gì đó (tiếng Anh Bắc Mỹ) Cô ấy đã tốt nghiệp đại học năm ngoái."
                    }
                ]
            },
            {
                "define": {
                    "en": "to complete a course in education, especially at high school",
                    "vi": "để hoàn thành một khóa học về giáo dục, đặc biệt là ở trường trung học"
                },
                "examples": [
                    {
                        "en": "He flunked math and never graduated.",
                        "vi": "Anh ta trượt môn toán và không bao giờ tốt nghiệp."
                    },
                    {
                        "en": "graduate from something Martha graduated from high school two years ago.",
                        "vi": "tốt nghiệp thứ gì đó Martha đã tốt nghiệp trung học hai năm trước."
                    },
                    {
                        "en": "graduate something Martha graduated high school two years ago.",
                        "vi": "tốt nghiệp thứ gì đó Martha đã tốt nghiệp trung học hai năm trước."
                    }
                ]
            },
            {
                "define": {
                    "en": "to give a degree, diploma, etc. to somebody",
                    "vi": "để trao bằng cấp, bằng tốt nghiệp, v.v. cho ai đó"
                },
                "examples": [
                    {
                        "en": "The college graduated 50 students last year.",
                        "vi": "Trường đã tốt nghiệp 50 sinh viên vào năm ngoái."
                    }
                ]
            },
            {
                "define": {
                    "en": "to start doing something more difficult or important than what you were doing before",
                    "vi": "để bắt đầu làm điều gì đó khó hơn hoặc quan trọng hơn những gì bạn đã làm trước đây"
                },
                "examples": [
                    {
                        "en": "She recently graduated from being a dancer to having a small role in a movie.",
                        "vi": "Cô vừa tốt nghiệp diễn viên múa để có một vai nhỏ trong một bộ phim."
                    }
                ]
            }
        ]
    },
    {
        "id": "cd02e07563214c99abae14d3abfe9315",
        "word": "graduation",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˌɡrædʒuˈeɪʃn/",
            "us": "/ˌɡrædʒuˈeɪʃn/"
        },
        "nearby": [
            {
                "word": "Graduate Management Admissions Test",
                "pos": ""
            },
            {
                "word": "graduate school",
                "pos": "noun"
            },
            {
                "word": "graduation",
                "pos": "noun"
            },
            {
                "word": "Graeco-",
                "pos": "combining form"
            },
            {
                "word": "Graeco-Roman wrestling",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act of successfully completing a university degree, or studies at an American high school",
                    "vi": "hành động hoàn thành xuất sắc bằng đại học hoặc học tại một trường trung học ở Mỹ"
                },
                "examples": [
                    {
                        "en": "It was my first job after graduation.",
                        "vi": "Đó là công việc đầu tiên của tôi sau khi tốt nghiệp."
                    }
                ]
            },
            {
                "define": {
                    "en": "a ceremony at which degrees, etc. are officially given out",
                    "vi": "một buổi lễ mà bằng cấp, v.v. chính thức được trao"
                },
                "examples": [
                    {
                        "en": "graduation day",
                        "vi": "ngày lễ tốt nghiệp"
                    },
                    {
                        "en": "My whole family came to my graduation.",
                        "vi": "Cả gia đình tôi đến dự lễ tốt nghiệp của tôi."
                    },
                    {
                        "en": "She was wearing a mortar board and graduation gown.",
                        "vi": "Cô ấy đang mặc một chiếc bảng vữa và áo lễ phục tốt nghiệp."
                    }
                ]
            },
            {
                "define": {
                    "en": "a mark showing a division on a scale",
                    "vi": "một dấu cho thấy một sự phân chia trên một thang điểm"
                },
                "examples": [
                    {
                        "en": "The graduations are marked on the side of the flask.",
                        "vi": "Các vạch chia độ được đánh dấu trên thành bình."
                    }
                ]
            }
        ]
    },
    {
        "id": "39f5c5f4a5df4f178c5a8b01eba18136",
        "word": "master",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈmɑːstə(r)/",
            "us": "/ˈmæstər/"
        },
        "nearby": [
            {
                "word": "mast",
                "pos": "noun"
            },
            {
                "word": "mastectomy",
                "pos": "noun"
            },
            {
                "word": "master",
                "pos": "noun"
            },
            {
                "word": "master",
                "pos": "verb"
            },
            {
                "word": "master",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a man who has people working for him, often as servants in his home",
                    "vi": "một người đàn ông có người làm việc cho anh ta, thường là người hầu trong nhà anh ta"
                },
                "examples": [
                    {
                        "en": "They lived in fear of their master.",
                        "vi": "Họ sống trong sự sợ hãi của chủ nhân của họ."
                    },
                    {
                        "en": "Their relationship was one of master and servant.",
                        "vi": "Mối quan hệ của họ là chủ và tớ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who is in charge of an organization or group",
                    "vi": "một người phụ trách một tổ chức hoặc nhóm"
                },
                "examples": [
                    {
                        "en": "The police had to obey their political masters.",
                        "vi": "Cảnh sát đã phải phục tùng các bậc thầy chính trị của họ."
                    },
                    {
                        "en": "Many nations were trying to shake off their colonial masters.",
                        "vi": "Nhiều quốc gia đang cố gắng loại bỏ những ông chủ thuộc địa của họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who is able to control something",
                    "vi": "một người có thể kiểm soát một cái gì đó"
                },
                "examples": [
                    {
                        "en": "She was no longer master of her own future.",
                        "vi": "Cô không còn là người làm chủ tương lai của chính mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who shows a lot of skill at something",
                    "vi": "một người thể hiện rất nhiều kỹ năng trong một cái gì đó"
                },
                "examples": [
                    {
                        "en": "master of something a master of disguise",
                        "vi": "bậc thầy về điều gì đó bậc thầy về ngụy trang"
                    },
                    {
                        "en": "a master of her craft",
                        "vi": "một bậc thầy về thủ công của cô ấy"
                    },
                    {
                        "en": "a master of the serve-and-volley game",
                        "vi": "một bậc thầy của trò chơi giao bóng và chuyền bóng"
                    },
                    {
                        "en": "master at doing something a master at managing money",
                        "vi": "thành thạo trong việc làm một cái gì đó một bậc thầy về quản lý tiền bạc"
                    }
                ]
            },
            {
                "define": {
                    "en": "a famous painter who lived in the past",
                    "vi": "một họa sĩ nổi tiếng sống trong quá khứ"
                },
                "examples": [
                    {
                        "en": "an exhibition of work by the French master, Monet",
                        "vi": "một cuộc triển lãm tác phẩm của bậc thầy người Pháp, Monet"
                    },
                    {
                        "en": "the great masters of Impressionism",
                        "vi": "những bậc thầy vĩ đại của trường phái ấn tượng"
                    },
                    {
                        "en": "This portrait is the work of an acknowledged master.",
                        "vi": "Bức chân dung này là tác phẩm của một bậc thầy được thừa nhận."
                    }
                ]
            },
            {
                "define": {
                    "en": "a second university degree, or, in Scotland, a first university degree, such as an MA",
                    "vi": "bằng đại học thứ hai, hoặc ở Scotland, bằng đại học đầu tiên, chẳng hạn như MA"
                },
                "examples": [
                    {
                        "en": "He has a Master's in Business Administration.",
                        "vi": "Ông có bằng Thạc sĩ Quản trị Kinh doanh."
                    },
                    {
                        "en": "She holds a master's degree in journalism.",
                        "vi": "Cô có bằng thạc sĩ báo chí."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who has a master’s degree",
                    "vi": "một người đã có bằng thạc sĩ"
                },
                "examples": [
                    {
                        "en": "a Master of Arts/Science",
                        "vi": "một Thạc sĩ Nghệ thuật / Khoa học"
                    }
                ]
            },
            {
                "define": {
                    "en": "the owner of an animal, especially a dog or horse",
                    "vi": "chủ của một con vật, đặc biệt là một con chó hoặc con ngựa"
                },
                "examples": [
                    {
                        "en": "The dog saved its master's life.",
                        "vi": "Con chó đã cứu sống chủ nhân của nó."
                    },
                    {
                        "en": "Even the animals knew their masters were excited.",
                        "vi": "Ngay cả những con vật cũng biết chủ nhân của chúng đang rất phấn khích."
                    },
                    {
                        "en": "The horses watched their masters placidly.",
                        "vi": "Những con ngựa nhìn chủ của chúng một cách điềm tĩnh."
                    }
                ]
            },
            {
                "define": {
                    "en": "a male teacher at a school, especially a private school",
                    "vi": "một giáo viên nam tại một trường học, đặc biệt là một trường tư thục"
                },
                "examples": [
                    {
                        "en": "the physics master",
                        "vi": "thạc sĩ vật lý"
                    },
                    {
                        "en": "He was ballet master at several dance schools.",
                        "vi": "Anh ấy là thạc sĩ múa ba lê tại một số trường dạy múa."
                    }
                ]
            },
            {
                "define": {
                    "en": "the captain of a ship that transports goods",
                    "vi": "thuyền trưởng của một con tàu vận chuyển hàng hóa"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a version of a recording from which copies are made",
                    "vi": "một phiên bản của bản ghi âm mà từ đó các bản sao được tạo ra"
                },
                "examples": [
                    {
                        "en": "the master copy",
                        "vi": "bản chính"
                    }
                ]
            },
            {
                "define": {
                    "en": "a title used when speaking to or about a boy who is too young to be called Mr (also used in front of the name on an envelope, etc.)",
                    "vi": "một tiêu đề được sử dụng khi nói với hoặc về một cậu bé còn quá nhỏ để được gọi là Mr (cũng được sử dụng ở phía trước tên trên phong bì, v.v.)"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "(in the UK) the title of the head of some schools and university colleges",
                    "vi": "(ở Anh) chức danh người đứng đầu một số trường phổ thông và cao đẳng đại học"
                },
                "examples": [
                    {
                        "en": "the Master of Wolfson College",
                        "vi": "Thạc sĩ của Cao đẳng Wolfson"
                    }
                ]
            },
            {
                "define": {
                    "en": "a title used for speaking to or about some religious teachers or leaders",
                    "vi": "một chức danh được sử dụng để nói chuyện với hoặc về một số giáo viên hoặc nhà lãnh đạo tôn giáo"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be free to make your own decisions rather than being told what to do by somebody else",
                    "vi": "được tự do đưa ra quyết định của riêng mình thay vì bị người khác chỉ bảo phải làm gì"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to support two different parties, principles, etc. at the same time",
                    "vi": "để hỗ trợ đồng thời hai đảng phái, nguyên tắc khác nhau, v.v."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "1a6ac49abd1b412cbfa6d8aae7087cae",
        "word": "PhD",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˌpiː eɪtʃ ˈdiː/",
            "us": "/ˌpiː eɪtʃ ˈdiː/"
        },
        "nearby": [
            {
                "word": "phat",
                "pos": "adjective"
            },
            {
                "word": "phatic",
                "pos": "adjective"
            },
            {
                "word": "PhD",
                "pos": "noun"
            },
            {
                "word": "pheasant",
                "pos": "noun"
            },
            {
                "word": "phenol",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a university degree of a very high level that is given to somebody who has done research in a particular subject (the abbreviation for ‘Doctor of Philosophy’)",
                    "vi": "bằng đại học có trình độ rất cao được trao cho một người nào đó đã thực hiện nghiên cứu trong một chủ đề cụ thể (viết tắt của 'Tiến sĩ Triết học')"
                },
                "examples": [
                    {
                        "en": "to be/have/do a PhD",
                        "vi": "trở thành / có / làm tiến sĩ"
                    },
                    {
                        "en": "Anne Thomas, PhD",
                        "vi": "Anne Thomas, Tiến sĩ"
                    }
                ]
            }
        ]
    },
    {
        "id": "b8a036eae1ee4f32b557cb9447d093ed",
        "word": "thesis",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈθiːsɪs/",
            "us": "/ˈθiːsɪs/"
        },
        "nearby": [
            {
                "word": "thesaurus",
                "pos": "noun"
            },
            {
                "word": "these",
                "pos": "determiner, pronoun"
            },
            {
                "word": "thesis",
                "pos": "noun"
            },
            {
                "word": "thespian",
                "pos": "noun"
            },
            {
                "word": "thespian",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a long piece of writing completed by a student as part of a university degree, based on their own research",
                    "vi": "một đoạn văn dài được hoàn thành bởi một sinh viên như một phần của bằng đại học, dựa trên nghiên cứu của riêng họ"
                },
                "examples": [
                    {
                        "en": "Students must submit a thesis on an agreed subject within four years.",
                        "vi": "Sinh viên phải nộp một luận án về một chủ đề đã thỏa thuận trong vòng bốn năm."
                    }
                ]
            },
            {
                "define": {
                    "en": "a statement or an opinion that is discussed in a logical way and presented with evidence in order to prove that it is true",
                    "vi": "một tuyên bố hoặc một ý kiến được thảo luận một cách hợp lý và được trình bày với bằng chứng để chứng minh rằng điều đó là đúng"
                },
                "examples": [
                    {
                        "en": "The basic thesis of the book is fairly simple.",
                        "vi": "Luận điểm cơ bản của cuốn sách khá đơn giản."
                    },
                    {
                        "en": "These latest findings support the thesis that sexuality is determined by nature rather than choice.",
                        "vi": "Những phát hiện mới nhất này ủng hộ luận điểm rằng tình dục là do tự nhiên quyết định chứ không phải do sự lựa chọn."
                    }
                ]
            }
        ]
    },
    {
        "id": "853aec6b88e445bc96ed02b0676fd9c3",
        "word": "award",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/əˈwɔːd/",
            "us": "/əˈwɔːrd/"
        },
        "nearby": [
            {
                "word": "awaken to",
                "pos": "phrasal verb"
            },
            {
                "word": "awake to",
                "pos": "phrasal verb"
            },
            {
                "word": "award",
                "pos": "noun"
            },
            {
                "word": "award",
                "pos": "verb"
            },
            {
                "word": "awardee",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a prize such as money, etc. for something that somebody has done",
                    "vi": "một giải thưởng chẳng hạn như tiền, v.v. cho điều gì đó mà ai đó đã làm"
                },
                "examples": [
                    {
                        "en": "He was nominated for the best actor award.",
                        "vi": "Anh được đề cử giải nam diễn viên chính xuất sắc nhất."
                    },
                    {
                        "en": "the UK's most prestigious literary award",
                        "vi": "giải thưởng văn học danh giá nhất của Vương quốc Anh"
                    },
                    {
                        "en": "the Housing Design Award",
                        "vi": "Giải thưởng Thiết kế Nhà ở"
                    },
                    {
                        "en": "The mayor will present the awards.",
                        "vi": "Thị trưởng sẽ trao giải thưởng."
                    },
                    {
                        "en": "award for something to win/accept an award for something",
                        "vi": "giải thưởng cho một cái gì đó để giành chiến thắng / chấp nhận một giải thưởng cho một cái gì đó"
                    },
                    {
                        "en": "He received numerous awards for excellence in teaching.",
                        "vi": "Ông đã nhận được nhiều giải thưởng cho sự xuất sắc trong giảng dạy."
                    },
                    {
                        "en": "She was recently honoured with a lifetime achievement award.",
                        "vi": "Gần đây cô đã được vinh danh với giải thưởng thành tựu trọn đời."
                    },
                    {
                        "en": "The winners of the awards are picked by the network's viewers.",
                        "vi": "Người chiến thắng giải thưởng do người xem mạng bình chọn."
                    },
                    {
                        "en": "an awards ceremony",
                        "vi": "một lễ trao giải"
                    }
                ]
            },
            {
                "define": {
                    "en": "an increase in the amount of money somebody earns",
                    "vi": "sự gia tăng số tiền mà ai đó kiếm được"
                },
                "examples": [
                    {
                        "en": "an annual pay award",
                        "vi": "một giải thưởng lương hàng năm"
                    },
                    {
                        "en": "The union is unhappy with this year's pay award.",
                        "vi": "Công đoàn không hài lòng với việc trả lương năm nay."
                    }
                ]
            },
            {
                "define": {
                    "en": "an amount of money given as an official payment or grant to somebody",
                    "vi": "một số tiền được đưa ra như một khoản thanh toán hoặc trợ cấp chính thức cho ai đó"
                },
                "examples": [
                    {
                        "en": "an award of £600 000 in libel damages",
                        "vi": "giải thưởng 600 000 bảng Anh cho các thiệt hại do phỉ báng"
                    },
                    {
                        "en": "The judge has the power to make damages awards.",
                        "vi": "Thẩm phán có quyền đưa ra các giải thưởng bồi thường thiệt hại."
                    },
                    {
                        "en": "Students on diploma courses could apply for a discretionary award from their local authority.",
                        "vi": "Sinh viên trong các khóa học lấy bằng tốt nghiệp có thể nộp đơn xin cấp bằng tùy ý từ chính quyền địa phương của họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "the official decision to give something to somebody",
                    "vi": "quyết định chính thức để đưa một cái gì đó cho ai đó"
                },
                "examples": [
                    {
                        "en": "Satisfactory completion of the course will lead to the award of the Diploma of Social Work.",
                        "vi": "Việc hoàn thành khóa học đạt yêu cầu sẽ được nhận Chứng chỉ Công tác xã hội."
                    },
                    {
                        "en": "The court must specify the different elements in its award of compensation.",
                        "vi": "Tòa án phải chỉ rõ các yếu tố khác nhau trong việc đưa ra phán quyết bồi thường."
                    }
                ]
            }
        ]
    },
    {
        "id": "728a3618e4e34abc9eb9806a0aadb2eb",
        "word": "confer",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/kənˈfɜː(r)/",
            "us": "/kənˈfɜːr/"
        },
        "nearby": [
            {
                "word": "the Confederate States",
                "pos": "noun"
            },
            {
                "word": "confederation",
                "pos": "noun"
            },
            {
                "word": "confer",
                "pos": "verb"
            },
            {
                "word": "conference",
                "pos": "noun"
            },
            {
                "word": "conference call",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to discuss something with somebody, in order to exchange opinions or get advice",
                    "vi": "để thảo luận điều gì đó với ai đó, để trao đổi ý kiến hoặc nhận lời khuyên"
                },
                "examples": [
                    {
                        "en": "He wanted to confer with his colleagues before reaching a decision.",
                        "vi": "Anh muốn trao đổi với các đồng nghiệp của mình trước khi đi đến quyết định."
                    }
                ]
            },
            {
                "define": {
                    "en": "to give somebody an award, a university degree or a particular honour or right",
                    "vi": "trao cho ai đó một giải thưởng, một bằng đại học hoặc một danh dự hoặc quyền lợi cụ thể"
                },
                "examples": [
                    {
                        "en": "An honorary degree was conferred on him by Oxford University in 2019.",
                        "vi": "Đại học Oxford đã trao bằng danh dự cho ông vào năm 2019."
                    }
                ]
            }
        ]
    },
    {
        "id": "73e6e952402d4cee845af2e56799e6fe",
        "word": "dissertation",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌdɪsəˈteɪʃn/",
            "us": "/ˌdɪsərˈteɪʃn/"
        },
        "nearby": [
            {
                "word": "dissenter",
                "pos": "noun"
            },
            {
                "word": "dissenting",
                "pos": "adjective"
            },
            {
                "word": "dissertation",
                "pos": "noun"
            },
            {
                "word": "disservice",
                "pos": "noun"
            },
            {
                "word": "dissidence",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a long piece of writing on a particular subject, especially one written for a university degree",
                    "vi": "một đoạn văn dài về một chủ đề cụ thể, đặc biệt là một đoạn viết cho bằng đại học"
                },
                "examples": [
                    {
                        "en": "He wrote his Master's dissertation on rats.",
                        "vi": "Ông đã viết luận văn Thạc sĩ của mình về loài chuột."
                    },
                    {
                        "en": "Students can either do a dissertation or take part in a practical project.",
                        "vi": "Sinh viên có thể làm luận văn hoặc tham gia vào một dự án thực tế."
                    }
                ]
            }
        ]
    },
    {
        "id": "aae3b42826fa4fd4b971b591deedb385",
        "word": "doctorate",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈdɒktərət/",
            "us": "/ˈdɑːktərət/"
        },
        "nearby": [
            {
                "word": "doctor",
                "pos": "verb"
            },
            {
                "word": "doctoral",
                "pos": "adjective"
            },
            {
                "word": "doctorate",
                "pos": "noun"
            },
            {
                "word": "Doctor Dolittle",
                "pos": ""
            },
            {
                "word": "Doctor Faustus",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the highest university degree",
                    "vi": "bằng đại học cao nhất"
                },
                "examples": [
                    {
                        "en": "She's studying for her doctorate.",
                        "vi": "Cô ấy đang học tiến sĩ."
                    }
                ]
            }
        ]
    },
    {
        "id": "1b08c67a0f4549748aa824c79c8b6cac",
        "word": "gown",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ɡaʊn/",
            "us": "/ɡaʊn/"
        },
        "nearby": [
            {
                "word": "go with",
                "pos": "phrasal verb"
            },
            {
                "word": "go without",
                "pos": "phrasal verb"
            },
            {
                "word": "gown",
                "pos": "noun"
            },
            {
                "word": "gowned",
                "pos": "adjective"
            },
            {
                "word": "goy",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a woman’s dress, especially a long one for special occasions",
                    "vi": "áo dài của phụ nữ, đặc biệt là áo dài cho những dịp đặc biệt"
                },
                "examples": [
                    {
                        "en": "an evening/a wedding gown",
                        "vi": "một buổi tối / áo cưới"
                    },
                    {
                        "en": "She was dressed in a long flowing gown.",
                        "vi": "Cô mặc một chiếc váy dài thướt tha."
                    },
                    {
                        "en": "She wore a white satin gown trimmed with lace.",
                        "vi": "Cô mặc một chiếc váy sa tanh trắng được trang trí bằng ren."
                    }
                ]
            },
            {
                "define": {
                    "en": "a long loose piece of clothing that is worn over other clothes by judges and (in the UK) by other lawyers, and by members of universities (at special ceremonies)",
                    "vi": "một bộ quần áo dài rộng rãi được các thẩm phán và các luật sư khác (ở Vương quốc Anh) và các thành viên của các trường đại học mặc bên ngoài quần áo khác (tại các buổi lễ đặc biệt)"
                },
                "examples": [
                    {
                        "en": "a graduation gown",
                        "vi": "một bộ lễ phục tốt nghiệp"
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of clothing worn in a hospital, either by medical staff during surgery or by a patient, especially as protection against infection",
                    "vi": "một bộ quần áo mặc trong bệnh viện của nhân viên y tế trong khi phẫu thuật hoặc của bệnh nhân, đặc biệt là để bảo vệ chống lại nhiễm trùng"
                },
                "examples": [
                    {
                        "en": "a surgeon’s gown",
                        "vi": "áo choàng của bác sĩ phẫu thuật"
                    }
                ]
            }
        ]
    },
    {
        "id": "869f971e49ac4903b9738868ef66aaa1",
        "word": "BA",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌbiː ˈeɪ/",
            "us": "/ˌbiː ˈeɪ/"
        },
        "nearby": [
            {
                "word": "B2B",
                "pos": "abbreviation"
            },
            {
                "word": "B2C",
                "pos": "abbreviation"
            },
            {
                "word": "BA",
                "pos": "noun"
            },
            {
                "word": "Baa, Baa, Black Sheep",
                "pos": ""
            },
            {
                "word": "baa",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a first university degree in an arts subject (the abbreviation for ‘Bachelor of Arts’)",
                    "vi": "bằng đại học đầu tiên về một chủ đề nghệ thuật (viết tắt của 'Bachelor of Arts')"
                },
                "examples": [
                    {
                        "en": "to be/have/do a BA",
                        "vi": "trở thành / có / làm BA"
                    },
                    {
                        "en": "(British English) Darren Green BA",
                        "vi": "(Anh Anh) Darren Green BA"
                    }
                ]
            }
        ]
    },
    {
        "id": "641ec39511964fad86cadab36ed7258d",
        "word": "BSc",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌbiː es ˈsiː/",
            "us": "/ˌbiː es ˈsiː/"
        },
        "nearby": [
            {
                "word": "BS",
                "pos": "abbreviation"
            },
            {
                "word": "BSA",
                "pos": ""
            },
            {
                "word": "BSc",
                "pos": "noun"
            },
            {
                "word": "BSE",
                "pos": "noun"
            },
            {
                "word": "BSI",
                "pos": "abbreviation"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a first university degree in science (the abbreviation for ‘Bachelor of Science’)",
                    "vi": "bằng đại học đầu tiên về khoa học (viết tắt của 'Bachelor of Science')"
                },
                "examples": [
                    {
                        "en": "(British English) to have/do a BSc in Zoology",
                        "vi": "(Tiếng Anh Anh) để có / làm bằng BSc về Động vật học"
                    },
                    {
                        "en": "(British English) Jill Ayres BSc",
                        "vi": "(Anh Anh) Jill Ayres BSc"
                    }
                ]
            }
        ]
    },
    {
        "id": "50ad3349095a4abeb2e43b5b45fd137b",
        "word": "commencement",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/kəˈmensmənt/",
            "us": "/kəˈmensmənt/"
        },
        "nearby": [
            {
                "word": "commemorative",
                "pos": "adjective"
            },
            {
                "word": "commence",
                "pos": "verb"
            },
            {
                "word": "commencement",
                "pos": "noun"
            },
            {
                "word": "commend",
                "pos": "verb"
            },
            {
                "word": "commendable",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "beginning",
                    "vi": "bắt đầu"
                },
                "examples": [
                    {
                        "en": "the commencement of the financial year",
                        "vi": "bắt đầu năm tài chính"
                    },
                    {
                        "en": "You will be required to enrol at the commencement of each academic year.",
                        "vi": "Bạn sẽ được yêu cầu đăng ký khi bắt đầu mỗi năm học."
                    }
                ]
            },
            {
                "define": {
                    "en": "a ceremony at which students receive their academic degrees or diplomas",
                    "vi": "một buổi lễ mà tại đó sinh viên nhận được bằng cấp học thuật hoặc bằng tốt nghiệp của họ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "7a2ff329ab064d348853a242ba4af569",
        "word": "convocation",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌkɒnvəˈkeɪʃn/",
            "us": "/ˌkɑːnvəˈkeɪʃn/"
        },
        "nearby": [
            {
                "word": "convivial",
                "pos": "adjective"
            },
            {
                "word": "conviviality",
                "pos": "noun"
            },
            {
                "word": "convocation",
                "pos": "noun"
            },
            {
                "word": "convoke",
                "pos": "verb"
            },
            {
                "word": "convoluted",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a large formal meeting, especially of Church officials or members of a university",
                    "vi": "một cuộc họp chính thức lớn, đặc biệt là của các quan chức Giáo hội hoặc các thành viên của một trường đại học"
                },
                "examples": [
                    {
                        "en": "the meeting of the university convocation in Oxford on 13 February 1845",
                        "vi": "cuộc họp của hội đồng đại học ở Oxford vào ngày 13 tháng 2 năm 1845"
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of calling together a convocation",
                    "vi": "hành động gọi cùng một tập hợp"
                },
                "examples": [
                    {
                        "en": "the convocation of the second Vatican Council",
                        "vi": "sự triệu tập của Công đồng Vatican II"
                    }
                ]
            },
            {
                "define": {
                    "en": "a ceremony held in a university or college when students receive their degrees",
                    "vi": "một buổi lễ được tổ chức tại một trường đại học hoặc cao đẳng khi sinh viên nhận bằng tốt nghiệp của họ"
                },
                "examples": [
                    {
                        "en": "I recently attended my friend's convocation ceremony.",
                        "vi": "Gần đây tôi đã tham dự buổi lễ triệu tập của bạn tôi."
                    }
                ]
            }
        ]
    },
    {
        "id": "1c3a42d70e5c44aebe09138eed8eca7f",
        "word": "credit",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkredɪt/",
            "us": "/ˈkredɪt/"
        },
        "nearby": [
            {
                "word": "credible",
                "pos": "adjective"
            },
            {
                "word": "credibly",
                "pos": "adverb"
            },
            {
                "word": "credit",
                "pos": "noun"
            },
            {
                "word": "credit",
                "pos": "verb"
            },
            {
                "word": "creditable",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an arrangement that you make, with a shop for example, to pay later for something you buy",
                    "vi": "một thỏa thuận mà bạn thực hiện, với một cửa hàng chẳng hạn, để thanh toán sau cho một thứ bạn mua"
                },
                "examples": [
                    {
                        "en": "to get credit",
                        "vi": "để nhận được tín dụng"
                    },
                    {
                        "en": "on credit We bought the dishwasher on credit.",
                        "vi": "bằng tín dụng Chúng tôi đã mua máy rửa bát theo hình thức tín dụng."
                    },
                    {
                        "en": "to offer interest-free credit (= allow somebody to pay later, without any extra charge)",
                        "vi": "cung cấp tín dụng không tính lãi (= cho phép ai đó thanh toán sau mà không tính thêm phí)"
                    },
                    {
                        "en": "Someone with a bad credit history is less likely to be lent money.",
                        "vi": "Những người có lịch sử tín dụng xấu ít có khả năng được cho vay tiền hơn."
                    },
                    {
                        "en": "a credit agreement",
                        "vi": "một hợp đồng tín dụng"
                    },
                    {
                        "en": "a credit facility",
                        "vi": "một khoản tín dụng"
                    },
                    {
                        "en": "Your credit limit is now £2 000.",
                        "vi": "Hạn mức tín dụng của bạn hiện là £ 2 000."
                    },
                    {
                        "en": "He's a bad credit risk (= he is unlikely to pay the money later).",
                        "vi": "Anh ta là một rủi ro tín dụng xấu (= anh ta không có khả năng trả tiền sau này)."
                    },
                    {
                        "en": "The credit crisis is far from over.",
                        "vi": "Cuộc khủng hoảng tín dụng còn lâu mới kết thúc."
                    }
                ]
            },
            {
                "define": {
                    "en": "money that you borrow from a bank; a loan",
                    "vi": "tiền bạn vay từ ngân hàng; một khoản vay"
                },
                "examples": [
                    {
                        "en": "The bank refused further credit to the company.",
                        "vi": "Ngân hàng đã từ chối cấp thêm tín dụng cho công ty."
                    },
                    {
                        "en": "Local lenders are more likely to extend credit (= lend money) to smaller, more marginal borrowers.",
                        "vi": "Những người cho vay trong nước có nhiều khả năng mở rộng tín dụng (= cho vay tiền) cho những người đi vay nhỏ hơn, cận biên hơn."
                    }
                ]
            },
            {
                "define": {
                    "en": "the status of being trusted to pay back money to somebody who lends it to you",
                    "vi": "tình trạng được tin cậy để trả lại tiền cho ai đó cho bạn vay"
                },
                "examples": [
                    {
                        "en": "Her credit isn't good anywhere now.",
                        "vi": "Tín dụng của cô ấy không tốt ở bất cứ đâu bây giờ."
                    }
                ]
            },
            {
                "define": {
                    "en": "money that you have in your bank account; if you or your bank account are in credit, there is money in the account",
                    "vi": "tiền mà bạn có trong tài khoản ngân hàng của mình; nếu bạn hoặc tài khoản ngân hàng của bạn có tín dụng, có tiền trong tài khoản"
                },
                "examples": [
                    {
                        "en": "You have a credit balance of £250.",
                        "vi": "Bạn có số dư tín dụng là £ 250."
                    },
                    {
                        "en": "My account is in credit.",
                        "vi": "Tài khoản của tôi đang ở trong tình trạng tín dụng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a sum of money paid into a bank account; a record of the payment",
                    "vi": "một khoản tiền được trả vào tài khoản ngân hàng; hồ sơ thanh toán"
                },
                "examples": [
                    {
                        "en": "a credit of £50",
                        "vi": "một khoản tín dụng £ 50"
                    },
                    {
                        "en": "You'll be paid by direct credit into your bank account.",
                        "vi": "Bạn sẽ được thanh toán bằng tín dụng trực tiếp vào tài khoản ngân hàng của mình."
                    },
                    {
                        "en": "I have three credits on my bank statement.",
                        "vi": "Tôi có ba khoản tín dụng trên bảng sao kê ngân hàng của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "the right to use a service up to a certain limit, paid for in advance",
                    "vi": "quyền sử dụng một dịch vụ đến một giới hạn nhất định, được trả trước"
                },
                "examples": [
                    {
                        "en": "My phone's run out of credit.",
                        "vi": "Điện thoại của tôi đã hết tín dụng."
                    },
                    {
                        "en": "to add credit to your phone",
                        "vi": "để thêm tín dụng vào điện thoại của bạn"
                    }
                ]
            },
            {
                "define": {
                    "en": "a payment that somebody has a right to for a particular reason",
                    "vi": "một khoản thanh toán mà ai đó có quyền vì một lý do cụ thể"
                },
                "examples": [
                    {
                        "en": "The child tax credit is subject to strict income limitations.",
                        "vi": "Khoản tín dụng thuế trẻ em có giới hạn thu nhập nghiêm ngặt."
                    },
                    {
                        "en": "Export credits are granted to firms in developing countries to give them a breathing space to pay for goods exported to them.",
                        "vi": "Các khoản tín dụng xuất khẩu được cấp cho các công ty ở các nước đang phát triển để họ có không gian thanh toán cho hàng hóa xuất khẩu sang họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "praise or approval because you are responsible for something good that has happened",
                    "vi": "khen ngợi hoặc tán thành bởi vì bạn chịu trách nhiệm về một điều gì đó tốt đẹp đã xảy ra"
                },
                "examples": [
                    {
                        "en": "to get/deserve/receive/take/claim the credit",
                        "vi": "để có được / xứng đáng / nhận / lấy / yêu cầu tín dụng"
                    },
                    {
                        "en": "He's a player who rarely seems to get the credit he deserves.",
                        "vi": "Anh ấy là một cầu thủ hiếm khi nhận được sự tín nhiệm xứng đáng."
                    },
                    {
                        "en": "We did all the work and she gets all the credit!",
                        "vi": "Chúng tôi đã làm tất cả công việc và cô ấy nhận được tất cả công lao!"
                    },
                    {
                        "en": "credit for (doing) something I can't take all the credit for the show's success—it was a team effort.",
                        "vi": "ghi công cho (đang làm) điều gì đó mà tôi không thể lấy hết công lao cho thành công của buổi biểu diễn — đó là một nỗ lực của cả nhóm."
                    },
                    {
                        "en": "At least give him credit for trying (= praise him because he tried, even if he did not succeed)",
                        "vi": "Ít nhất hãy ghi công cho anh ta vì đã cố gắng (= khen anh ta vì anh ta đã cố gắng, ngay cả khi anh ta không thành công)"
                    },
                    {
                        "en": "Credit will be given in the exam for good spelling and grammar.",
                        "vi": "Tín chỉ sẽ được cung cấp trong kỳ thi kiểm tra chính tả và ngữ pháp tốt."
                    },
                    {
                        "en": "His courage brought great credit to his regiment.",
                        "vi": "Sự dũng cảm của anh đã mang lại công lao to lớn cho trung đoàn của anh."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person or thing whose qualities or achievements are praised and who therefore earns respect for somebody/something else",
                    "vi": "một người hoặc một vật có phẩm chất hoặc thành tích được ca ngợi và do đó người đó nhận được sự tôn trọng đối với ai đó / điều gì đó khác"
                },
                "examples": [
                    {
                        "en": "She is a credit to the school.",
                        "vi": "Cô ấy là một tín dụng cho trường."
                    },
                    {
                        "en": "Your children are a great credit to you.",
                        "vi": "Con cái của bạn là một tín dụng lớn đối với bạn."
                    },
                    {
                        "en": "He's a great credit to the school.",
                        "vi": "Anh ấy là người có công lớn đối với trường."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of mentioning somebody who worked on a project such as a film or a television programme",
                    "vi": "hành động đề cập đến ai đó đã làm việc trong một dự án chẳng hạn như một bộ phim hoặc một chương trình truyền hình"
                },
                "examples": [
                    {
                        "en": "She was given a programme credit for her work on the costumes for the play.",
                        "vi": "Cô ấy đã nhận được tín dụng của chương trình cho công việc của cô ấy về trang phục cho vở kịch."
                    },
                    {
                        "en": "The credits (= the list of all the people involved) seemed to last almost as long as the film!",
                        "vi": "Các khoản tín dụng (= danh sách tất cả những người có liên quan) dường như kéo dài gần như kéo dài cả bộ phim!"
                    },
                    {
                        "en": "From the opening credits, the movie is non-stop action.",
                        "vi": "Từ đoạn mở đầu, bộ phim là những pha hành động không ngừng nghỉ."
                    },
                    {
                        "en": "The end credits came as a welcome relief.",
                        "vi": "Các khoản tín dụng kết thúc đến như một sự cứu trợ chào đón."
                    },
                    {
                        "en": "We left before the final credits began to roll.",
                        "vi": "Chúng tôi rời đi trước khi các khoản tín dụng cuối cùng bắt đầu được tung ra."
                    }
                ]
            },
            {
                "define": {
                    "en": "a film, play, television programme, etc. that somebody has worked on",
                    "vi": "một bộ phim, vở kịch, chương trình truyền hình, v.v. mà ai đó đã làm việc"
                },
                "examples": [
                    {
                        "en": "His film credits included ‘The Witches’ and ‘Halloween III’.",
                        "vi": "Các khoản tín dụng phim của anh ấy bao gồm 'The Witches' và 'Halloween III'."
                    }
                ]
            },
            {
                "define": {
                    "en": "a unit of study at a college or university (in the US, also at a school); the fact of having successfully completed a unit of study",
                    "vi": "một đơn vị học tập tại một trường cao đẳng hoặc đại học (ở Mỹ, cũng tại một trường học); thực tế là đã hoàn thành xuất sắc một đơn vị nghiên cứu"
                },
                "examples": [
                    {
                        "en": "My math class is worth three credits.",
                        "vi": "Lớp toán của tôi có giá trị ba tín chỉ."
                    }
                ]
            },
            {
                "define": {
                    "en": "if something does credit to a person or an organization, they deserve to be praised for it",
                    "vi": "nếu điều gì đó có công với một người hoặc một tổ chức, họ xứng đáng được khen ngợi về điều đó"
                },
                "examples": [
                    {
                        "en": "Your honesty does you great credit.",
                        "vi": "Sự trung thực của bạn làm cho bạn tín dụng lớn."
                    },
                    {
                        "en": "Your concern does you credit.",
                        "vi": "Mối quan tâm của bạn có tín dụng không."
                    }
                ]
            },
            {
                "define": {
                    "en": "to give somebody the praise they deserve, even if you do not really want to",
                    "vi": "để dành cho ai đó những lời khen ngợi mà họ xứng đáng được nhận, ngay cả khi bạn không thực sự muốn"
                },
                "examples": [
                    {
                        "en": "Give credit where credit is due—what the man does, he does well.",
                        "vi": "Cung cấp tín dụng khi tín dụng đến hạn — những gì người đàn ông làm, anh ta làm tốt."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have achieved something",
                    "vi": "để đạt được một cái gì đó"
                },
                "examples": [
                    {
                        "en": "He's only 30, and he already has four novels to his credit.",
                        "vi": "Anh ấy mới 30 tuổi và đã có 4 cuốn tiểu thuyết."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to introduce the good points about somebody/something, especially after the bad points have been mentioned",
                    "vi": "được sử dụng để giới thiệu những điểm tốt về ai đó / điều gì đó, đặc biệt là sau khi những điểm xấu đã được đề cập"
                },
                "examples": [
                    {
                        "en": "On the credit side, she’s always willing to work very late.",
                        "vi": "Về mặt tín dụng, cô ấy luôn sẵn sàng làm việc rất muộn."
                    }
                ]
            },
            {
                "define": {
                    "en": "making somebody deserve praise or respect",
                    "vi": "làm cho ai đó xứng đáng được khen ngợi hoặc tôn trọng"
                },
                "examples": [
                    {
                        "en": "To his credit, Jack never told anyone exactly what had happened.",
                        "vi": "Đối với tín nhiệm của mình, Jack không bao giờ nói cho ai biết chính xác những gì đã xảy ra."
                    },
                    {
                        "en": "It was to her credit that she managed to stay calm.",
                        "vi": "Đó là công lao của cô ấy rằng cô ấy đã giữ được bình tĩnh."
                    }
                ]
            }
        ]
    },
    {
        "id": "fd3c2a2a282c42b9834946a08a7570b4",
        "word": "cum laude",
        "pos": "adverb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌkʊm ˈlɔːdi/",
            "us": "/ˌkʊm ˈlɔːdi/"
        },
        "nearby": [
            {
                "word": "Cumbria",
                "pos": ""
            },
            {
                "word": "cumin",
                "pos": "noun"
            },
            {
                "word": "cum laude",
                "pos": "adverb, adjective"
            },
            {
                "word": "cummerbund",
                "pos": "noun"
            },
            {
                "word": "E E Cummings",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "(in the US) at the third of the three highest levels of achievement that students can reach when they finish their studies at college",
                    "vi": "(ở Mỹ) ở vị trí thứ ba trong số ba cấp độ thành tích cao nhất mà học sinh có thể đạt được khi học xong đại học"
                },
                "examples": [
                    {
                        "en": "He graduated cum laude.",
                        "vi": "Anh ấy tốt nghiệp kiêm laude."
                    }
                ]
            }
        ]
    },
    {
        "id": "db1ce4d7868c4d9d884737acec82817c",
        "word": "extension",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ɪkˈstenʃn/",
            "us": "/ɪkˈstenʃn/"
        },
        "nearby": [
            {
                "word": "extended",
                "pos": "adjective"
            },
            {
                "word": "extended family",
                "pos": "noun"
            },
            {
                "word": "extension",
                "pos": "noun"
            },
            {
                "word": "extension agent",
                "pos": "noun"
            },
            {
                "word": "extension lead",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act of increasing the area of activity, group of people, etc. that is affected by something",
                    "vi": "hành động tăng khu vực hoạt động, nhóm người, v.v. bị ảnh hưởng bởi điều gì đó"
                },
                "examples": [
                    {
                        "en": "the extension of new technology into developing countries",
                        "vi": "sự mở rộng của công nghệ mới vào các nước đang phát triển"
                    },
                    {
                        "en": "a gradual extension of the powers of central government",
                        "vi": "mở rộng dần quyền lực của chính quyền trung ương"
                    },
                    {
                        "en": "The bank plans various extensions to its credit facilities.",
                        "vi": "Ngân hàng có kế hoạch mở rộng khác nhau cho các cơ sở tín dụng của mình."
                    },
                    {
                        "en": "My home life was becoming no more than an extension of my job.",
                        "vi": "Cuộc sống ở nhà của tôi không chỉ là một phần mở rộng của công việc của tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a new room or rooms that are added to a house",
                    "vi": "một căn phòng mới hoặc những căn phòng được thêm vào một ngôi nhà"
                },
                "examples": [
                    {
                        "en": "They're building an extension to their house.",
                        "vi": "Họ đang xây dựng một phần mở rộng cho ngôi nhà của họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a new part that is added to a building",
                    "vi": "một phần mới được thêm vào một tòa nhà"
                },
                "examples": [
                    {
                        "en": "a planned two-storey extension to the hospital",
                        "vi": "dự kiến mở rộng hai tầng cho bệnh viện"
                    }
                ]
            },
            {
                "define": {
                    "en": "an extra period of time allowed for something",
                    "vi": "thêm một khoảng thời gian được phép cho một thứ gì đó"
                },
                "examples": [
                    {
                        "en": "He's been granted an extension of the contract for another year.",
                        "vi": "Anh ấy đã được gia hạn hợp đồng thêm một năm."
                    },
                    {
                        "en": "a visa extension",
                        "vi": "gia hạn thị thực"
                    },
                    {
                        "en": "She was given an extension to finish writing her thesis.",
                        "vi": "Cô ấy đã được gia hạn để hoàn thành việc viết luận án của mình."
                    },
                    {
                        "en": "(British English) The pub had an extension (= was allowed to stay open longer) on Christmas Eve.",
                        "vi": "(Tiếng Anh Anh) Quán rượu đã được mở rộng (= được phép mở cửa lâu hơn) vào đêm Giáng sinh."
                    }
                ]
            },
            {
                "define": {
                    "en": "an extra phone line connected to a central phone in a house or to a switchboard in a large building. In a large building, each extension usually has its own number.",
                    "vi": "một đường dây điện thoại phụ kết nối với điện thoại trung tâm trong nhà hoặc với tổng đài trong một tòa nhà lớn. Trong một tòa nhà lớn, mỗi phần mở rộng thường có số hiệu riêng."
                },
                "examples": [
                    {
                        "en": "We have an extension in the bedroom.",
                        "vi": "Chúng tôi có một phần mở rộng trong phòng ngủ."
                    },
                    {
                        "en": "What's your extension number?",
                        "vi": "Số máy nhánh của bạn là gì?"
                    },
                    {
                        "en": "Can I have extension 4332 please?",
                        "vi": "Cho tôi xin số máy lẻ 4332 được không?"
                    },
                    {
                        "en": "I'll give you my extension number, so you can phone me directly.",
                        "vi": "Tôi sẽ cung cấp cho bạn số máy nhánh của tôi, vì vậy bạn có thể gọi điện trực tiếp cho tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of making something longer or larger; the thing that is made longer and larger",
                    "vi": "hành động làm một cái gì đó dài hơn hoặc lớn hơn; thứ được làm dài hơn và lớn hơn"
                },
                "examples": [
                    {
                        "en": "The extension of the subway will take several months.",
                        "vi": "Việc gia hạn tàu điện ngầm sẽ mất vài tháng."
                    },
                    {
                        "en": "extensions to the original railway track",
                        "vi": "phần mở rộng cho đường ray ban đầu"
                    }
                ]
            },
            {
                "define": {
                    "en": "pieces of artificial hair that are added to somebody's own hair to make it longer",
                    "vi": "những phần tóc nhân tạo được thêm vào tóc của ai đó để làm cho nó dài hơn"
                },
                "examples": [
                    {
                        "en": "These extensions are very easy to use and won't damage your own hair.",
                        "vi": "Những phần mở rộng này rất dễ sử dụng và sẽ không làm hỏng tóc của bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a part of a college or university that offers courses to students who are not studying full-time; a programme of study for these students",
                    "vi": "một phần của trường cao đẳng hoặc đại học cung cấp các khóa học cho sinh viên không học toàn thời gian; một chương trình học cho những sinh viên này"
                },
                "examples": [
                    {
                        "en": "La Salle Extension University",
                        "vi": "Đại học Mở rộng La Salle"
                    },
                    {
                        "en": "extension courses",
                        "vi": "các khóa học mở rộng"
                    }
                ]
            },
            {
                "define": {
                    "en": "the set of three letters that are placed after the dot (= small round mark) at the end of the name of a file and that show what type of file it is",
                    "vi": "bộ ba chữ cái được đặt sau dấu chấm (= dấu tròn nhỏ) ở cuối tên tệp và cho biết loại tệp đó là"
                },
                "examples": [
                    {
                        "en": "The extension .doc indicates a word-processing file.",
                        "vi": "Phần mở rộng .doc chỉ ra một tệp xử lý văn bản."
                    }
                ]
            },
            {
                "define": {
                    "en": "an extra length of electric wire, used when the wire on an electrical device is not long enough",
                    "vi": "thêm chiều dài của dây điện, được sử dụng khi dây trên thiết bị điện không đủ dài"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "taking the argument or situation one stage further",
                    "vi": "đưa lập luận hoặc tình huống lên một giai đoạn nữa"
                },
                "examples": [
                    {
                        "en": "The blame lies with the teachers and, by extension, with the Education Service.",
                        "vi": "Trách nhiệm thuộc về các giáo viên và nói chung là với Sở Giáo dục."
                    }
                ]
            }
        ]
    },
    {
        "id": "17488b88f7144979a1d1e9b9b5f593e1",
        "word": "final",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈfaɪnl/",
            "us": "/ˈfaɪnl/"
        },
        "nearby": [
            {
                "word": "finagle",
                "pos": "verb"
            },
            {
                "word": "final",
                "pos": "adjective"
            },
            {
                "word": "final",
                "pos": "noun"
            },
            {
                "word": "final clause",
                "pos": "noun"
            },
            {
                "word": "finale",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the last of a series of games or competitions, in which the winner is decided",
                    "vi": "trò chơi cuối cùng của một loạt trò chơi hoặc cuộc thi, trong đó người chiến thắng được quyết định"
                },
                "examples": [
                    {
                        "en": "She reached the final of the 100m hurdles.",
                        "vi": "Cô lọt vào chung kết 100m vượt rào."
                    },
                    {
                        "en": "The players met in last year's final.",
                        "vi": "Các cầu thủ đã gặp nhau trong trận chung kết năm ngoái."
                    },
                    {
                        "en": "The winner of each contest goes through to the grand final.",
                        "vi": "Người chiến thắng của mỗi cuộc thi sẽ đi đến trận chung kết lớn."
                    },
                    {
                        "en": "The victory secured them a place in the final.",
                        "vi": "Chiến thắng đã đảm bảo cho họ một suất vào chung kết."
                    },
                    {
                        "en": "final against somebody a nail-biting final against last year's victor",
                        "vi": "trận chung kết chống lại ai đó một trận chung kết đáng sợ với người chiến thắng năm ngoái"
                    }
                ]
            },
            {
                "define": {
                    "en": "a series of games or performances that make up the last stage of a competition",
                    "vi": "một loạt trò chơi hoặc màn trình diễn tạo nên chặng cuối cùng của một cuộc thi"
                },
                "examples": [
                    {
                        "en": "the 2022 World Cup Finals",
                        "vi": "vòng chung kết World Cup 2022"
                    },
                    {
                        "en": "the regional/national finals",
                        "vi": "vòng chung kết khu vực / quốc gia"
                    },
                    {
                        "en": "She has qualified for the Olympic finals.",
                        "vi": "Cô ấy đã vượt qua vòng chung kết Olympic."
                    },
                    {
                        "en": "They got into the finals of a singing competition.",
                        "vi": "Họ đã lọt vào vòng chung kết của một cuộc thi hát."
                    }
                ]
            },
            {
                "define": {
                    "en": "the last exams taken by university students at the end of their final year",
                    "vi": "kỳ thi cuối cùng của sinh viên đại học vào cuối năm cuối của họ"
                },
                "examples": [
                    {
                        "en": "to sit/take your finals",
                        "vi": "ngồi / xem trận chung kết của bạn"
                    }
                ]
            },
            {
                "define": {
                    "en": "an exam taken by school, university or college students at the end of a semester or quarter, usually in a topic that they will not study again",
                    "vi": "một bài kiểm tra của trường, sinh viên đại học hoặc cao đẳng vào cuối học kỳ hoặc quý, thường là một chủ đề mà họ sẽ không học lại"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "4a466d3dc9b740858de5b4fa664d6c12",
        "word": "first",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/fɜːst/",
            "us": "/fɜːrst/"
        },
        "nearby": [
            {
                "word": "first",
                "pos": "determiner, ordinal number"
            },
            {
                "word": "first",
                "pos": "adverb"
            },
            {
                "word": "first",
                "pos": "noun"
            },
            {
                "word": "first aid",
                "pos": "noun"
            },
            {
                "word": "first-aider",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the person or thing that comes or happens before all other similar people or things",
                    "vi": "người hoặc vật đến hoặc xảy ra trước tất cả những người hoặc vật tương tự khác"
                },
                "examples": [
                    {
                        "en": "I was the first in my family to go to college.",
                        "vi": "Tôi là người đầu tiên trong gia đình đi học đại học."
                    },
                    {
                        "en": "Sheila and Jim were the first to arrive.",
                        "vi": "Sheila và Jim là những người đến đầu tiên."
                    }
                ]
            },
            {
                "define": {
                    "en": "the earliest",
                    "vi": "sớm nhất"
                },
                "examples": [
                    {
                        "en": "The first I heard about the wedding (= the first time I became aware of it) was when I saw it in the local paper.",
                        "vi": "Lần đầu tiên tôi nghe về đám cưới (= lần đầu tiên tôi biết về nó) là khi tôi nhìn thấy nó trên báo địa phương."
                    },
                    {
                        "en": "The first I knew of a problem was around 9.30 a.m. last Monday.",
                        "vi": "Lần đầu tiên tôi biết về một vấn đề là vào khoảng 9h30 sáng Thứ Hai tuần trước."
                    }
                ]
            },
            {
                "define": {
                    "en": "the most likely",
                    "vi": "rất có thể"
                },
                "examples": [
                    {
                        "en": "I'd be the first to admit (= I will most willingly admit) I might be wrong.",
                        "vi": "Tôi sẽ là người đầu tiên thừa nhận (= Tôi sẽ sẵn sàng thừa nhận) Tôi có thể sai."
                    },
                    {
                        "en": "The poorest will be the first to suffer.",
                        "vi": "Người nghèo nhất sẽ là người đầu tiên phải chịu đựng."
                    },
                    {
                        "en": "Nurses are often the first to say they feel underappreciated.",
                        "vi": "Y tá thường là người đầu tiên nói rằng họ cảm thấy bị đánh giá thấp."
                    }
                ]
            },
            {
                "define": {
                    "en": "an important achievement, event, etc., never done or experienced before",
                    "vi": "một thành tựu, sự kiện quan trọng, v.v., chưa bao giờ được thực hiện hoặc trải nghiệm trước đây"
                },
                "examples": [
                    {
                        "en": "We went on a cruise, a first for both of us.",
                        "vi": "Chúng tôi đã đi trên một chuyến du thuyền, lần đầu tiên cho cả hai chúng tôi."
                    },
                    {
                        "en": "This meeting between the two presidents is a historic first.",
                        "vi": "Cuộc gặp giữa hai tổng thống này là lần đầu tiên lịch sử."
                    }
                ]
            },
            {
                "define": {
                    "en": "the lowest gear on a car, bicycle, etc. that you use when you are moving slowly",
                    "vi": "hộp số thấp nhất trên ô tô, xe đạp, v.v. mà bạn sử dụng khi đang di chuyển chậm"
                },
                "examples": [
                    {
                        "en": "in first He stuck the car in first and revved.",
                        "vi": "lúc đầu Anh ta cho xe vào trước và rồ ga."
                    }
                ]
            },
            {
                "define": {
                    "en": "the highest level of university degree at British universities",
                    "vi": "trình độ đại học cao nhất tại các trường đại học ở Anh"
                },
                "examples": [
                    {
                        "en": "She got a first in maths at Exeter.",
                        "vi": "Cô ấy đạt giải nhất môn toán tại Exeter."
                    },
                    {
                        "en": "He did Philosophy and English Literature and got a double first.",
                        "vi": "Anh ấy đã làm Triết học và Văn học Anh và có một cú đúp đầu tiên."
                    }
                ]
            },
            {
                "define": {
                    "en": "the person or thing with the highest status in a group",
                    "vi": "người hoặc vật có địa vị cao nhất trong một nhóm"
                },
                "examples": [
                    {
                        "en": "He was regarded as the ‘first among equals’ by the other office clerks.",
                        "vi": "Anh ta được các nhân viên văn phòng khác coi là 'người đầu tiên trong số những người ngang hàng'."
                    }
                ]
            },
            {
                "define": {
                    "en": "from the beginning",
                    "vi": "từ đầu"
                },
                "examples": [
                    {
                        "en": "They were attracted to each other from the first.",
                        "vi": "Họ đã bị thu hút bởi nhau ngay từ lần đầu tiên."
                    }
                ]
            },
            {
                "define": {
                    "en": "from beginning to end; during the whole time",
                    "vi": "từ đầu đến cuối; trong suốt thời gian"
                },
                "examples": [
                    {
                        "en": "It's a fine performance that commands attention from first to last.",
                        "vi": "Đó là một màn trình diễn tốt thu hút sự chú ý từ đầu tiên đến cuối cùng."
                    }
                ]
            }
        ]
    },
    {
        "id": "56b8d21d86ec4966b1867c70e1ad959e",
        "word": "first class",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌfɜːst ˈklɑːs/",
            "us": "/ˌfɜːrst ˈklæs/"
        },
        "nearby": [
            {
                "word": "firstborn",
                "pos": "noun"
            },
            {
                "word": "firstborn",
                "pos": "adjective"
            },
            {
                "word": "first class",
                "pos": "noun"
            },
            {
                "word": "first-class",
                "pos": "adjective"
            },
            {
                "word": "first-class cricket",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the best and most expensive seats or accommodation on a train, plane or ship",
                    "vi": "chỗ ngồi hoặc chỗ ở tốt nhất và đắt nhất trên tàu hỏa, máy bay hoặc tàu thủy"
                },
                "examples": [
                    {
                        "en": "There is more room in first class.",
                        "vi": "Có nhiều chỗ hơn trong khoang hạng nhất."
                    }
                ]
            },
            {
                "define": {
                    "en": "(in the UK) the class of mail that is delivered most quickly",
                    "vi": "(ở Anh) loại thư được chuyển nhanh nhất"
                },
                "examples": [
                    {
                        "en": "First class costs more.",
                        "vi": "Hạng nhất đắt hơn."
                    }
                ]
            },
            {
                "define": {
                    "en": "(in the US) the class of mail that is used for letters",
                    "vi": "(ở Hoa Kỳ) loại thư được sử dụng cho các bức thư"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the highest standard of degree given by a British university",
                    "vi": "tiêu chuẩn cao nhất về bằng cấp của một trường đại học ở Anh"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c6e0500c905046a0aa7bd6f583252c84",
        "word": "GMAT",
        "pos": "abbreviation",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈdʒiːmæt/",
            "us": "/ˈdʒiːmæt/"
        },
        "nearby": [
            {
                "word": "GM",
                "pos": "abbreviation"
            },
            {
                "word": "G-man",
                "pos": "noun"
            },
            {
                "word": "GMAT",
                "pos": "abbreviation"
            },
            {
                "word": "the GMB",
                "pos": ""
            },
            {
                "word": "the GMC",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "Graduate Management Admissions Test (a test taken by graduate students in the US who want to study for a degree in Business)",
                    "vi": "Bài kiểm tra tuyển sinh quản lý sau đại học (bài kiểm tra được thực hiện bởi các sinh viên tốt nghiệp ở Hoa Kỳ muốn học lấy bằng Kinh doanh)"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "7731523fa8414100a670caa40b4c37d8",
        "word": "honor",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɒnə(r)/",
            "us": "/ˈɑːnər/"
        },
        "nearby": [
            {
                "word": "honky-tonk",
                "pos": "noun"
            },
            {
                "word": "Honolulu",
                "pos": ""
            },
            {
                "word": "honor",
                "pos": "noun"
            },
            {
                "word": "honor",
                "pos": "verb"
            },
            {
                "word": "honorable",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "great respect for somebody",
                    "vi": "rất tôn trọng ai đó"
                },
                "examples": [
                    {
                        "en": "the guest of honor (= the most important one)",
                        "vi": "vị khách danh dự (= người quan trọng nhất)"
                    },
                    {
                        "en": "the seat/place of honor (= given to the most important guest)",
                        "vi": "ghế / nơi vinh danh (= được trao cho vị khách quan trọng nhất)"
                    },
                    {
                        "en": "They stood in silence as a mark of honor to her.",
                        "vi": "Họ đứng trong im lặng như một sự tôn vinh đối với cô."
                    },
                    {
                        "en": "do honor to somebody/something This biography does great honor to the poet's achievements.",
                        "vi": "làm vinh dự cho ai đó / cái gì đó Tiểu sử này rất vinh dự đối với những thành tựu của nhà thơ."
                    }
                ]
            },
            {
                "define": {
                    "en": "something that you are very pleased or proud to do because people are showing you great respect",
                    "vi": "điều gì đó mà bạn rất hài lòng hoặc tự hào khi làm vì mọi người đang thể hiện sự tôn trọng của bạn"
                },
                "examples": [
                    {
                        "en": "It was a great honor to be invited here today.",
                        "vi": "Đó là một vinh dự lớn khi được mời đến đây ngày hôm nay."
                    },
                    {
                        "en": "It was my honor and privilege to be Helen's friend.",
                        "vi": "Đó là vinh dự và đặc ân của tôi khi được làm bạn của Helen."
                    },
                    {
                        "en": "It is a great honor to represent my country at the Olympics.",
                        "vi": "Đó là một vinh dự lớn khi đại diện cho đất nước của tôi tại Thế vận hội."
                    }
                ]
            },
            {
                "define": {
                    "en": "the quality of knowing and doing what is morally right",
                    "vi": "phẩm chất của việc biết và làm những gì là đúng đắn về mặt đạo đức"
                },
                "examples": [
                    {
                        "en": "a man of honor",
                        "vi": "một người đàn ông của danh dự"
                    },
                    {
                        "en": "a sense of honor",
                        "vi": "một cảm giác vinh dự"
                    },
                    {
                        "en": "Proving his innocence has become a matter of honor.",
                        "vi": "Chứng minh sự vô tội của mình đã trở thành một vấn đề danh dự."
                    }
                ]
            },
            {
                "define": {
                    "en": "a good reputation; respect from other people",
                    "vi": "một danh tiếng tốt; sự tôn trọng từ những người khác"
                },
                "examples": [
                    {
                        "en": "upholding the honor of your country",
                        "vi": "đề cao danh dự của đất nước bạn"
                    },
                    {
                        "en": "The family honor is at stake.",
                        "vi": "Danh dự của gia đình đang bị đe dọa."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person or thing that causes others to respect and admire something/somebody",
                    "vi": "một người hoặc một điều khiến người khác tôn trọng và ngưỡng mộ điều gì đó / ai đó"
                },
                "examples": [
                    {
                        "en": "She is an honor to the profession.",
                        "vi": "Cô ấy là một vinh dự đối với nghề."
                    }
                ]
            },
            {
                "define": {
                    "en": "an award, official title, etc. given to somebody as a reward for something that they have done",
                    "vi": "một giải thưởng, danh hiệu chính thức, v.v. được trao cho ai đó như một phần thưởng cho điều gì đó mà họ đã làm"
                },
                "examples": [
                    {
                        "en": "to win the highest honor",
                        "vi": "để giành được vinh dự cao nhất"
                    },
                    {
                        "en": "She received nearly every honor bestowed upon a poet.",
                        "vi": "Cô nhận được gần như mọi vinh dự do một nhà thơ ban tặng."
                    },
                    {
                        "en": "He was buried with full military honors (= with a special military service as a sign of respect).",
                        "vi": "Ông được chôn cất với đầy đủ các danh hiệu quân sự (= với một nghĩa vụ quân sự đặc biệt như một dấu hiệu của sự tôn trọng)."
                    },
                    {
                        "en": "He wears his scars like badges of honor (= rewards that you can see).",
                        "vi": "Anh ta đeo những vết sẹo của mình như huy hiệu danh dự (= phần thưởng mà bạn có thể nhìn thấy)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a university course that is of a higher level than a basic course (in the US also used to describe a class in school that is at a higher level than other classes)",
                    "vi": "khóa học đại học ở cấp độ cao hơn khóa học cơ bản (ở Mỹ cũng được sử dụng để mô tả một lớp học trong trường ở cấp độ cao hơn các lớp học khác)"
                },
                "examples": [
                    {
                        "en": "an honors degree/course",
                        "vi": "một bằng cấp danh dự / khóa học"
                    },
                    {
                        "en": "a First Class Honors degree",
                        "vi": "bằng Danh dự Hạng Nhất"
                    },
                    {
                        "en": "(North American English) I took an honors class in English.",
                        "vi": "(Tiếng Anh Bắc Mỹ) Tôi đã học một lớp danh dự bằng tiếng Anh."
                    }
                ]
            },
            {
                "define": {
                    "en": "if you pass an exam or graduate from a university or school with honors, you receive a special grade for having achieved a very high standard",
                    "vi": "nếu bạn vượt qua một kỳ thi hoặc tốt nghiệp từ một trường đại học hoặc trường học xuất sắc, bạn sẽ nhận được điểm đặc biệt vì đã đạt được tiêu chuẩn rất cao"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a title of respect used when talking to or about a judge or a US mayor",
                    "vi": "một danh hiệu tôn trọng được sử dụng khi nói chuyện với hoặc về thẩm phán hoặc thị trưởng Hoa Kỳ"
                },
                "examples": [
                    {
                        "en": "No more questions, Your Honor.",
                        "vi": "Không còn câu hỏi nào nữa, thưa Ngài."
                    }
                ]
            },
            {
                "define": {
                    "en": "the cards that have the highest value",
                    "vi": "thẻ có giá trị cao nhất"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to do something to make somebody feel very proud and pleased",
                    "vi": "làm điều gì đó để khiến ai đó cảm thấy rất tự hào và hài lòng"
                },
                "examples": [
                    {
                        "en": "Would you do me the honor of dining with me?",
                        "vi": "Bạn có thể làm cho tôi vinh dự được ăn tối với tôi không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to perform a social duty or ceremony, such as pouring drinks, making a speech, etc.",
                    "vi": "để thực hiện một nghĩa vụ xã hội hoặc nghi lễ, chẳng hạn như rót đồ uống, phát biểu, v.v."
                },
                "examples": [
                    {
                        "en": "Would you do the honors and draw the winning ticket?",
                        "vi": "Bạn có làm được danh dự và rút được tấm vé chiến thắng không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be given the opportunity to do something that makes you feel proud and happy",
                    "vi": "được trao cơ hội để làm điều gì đó khiến bạn cảm thấy tự hào và hạnh phúc"
                },
                "examples": [
                    {
                        "en": "May I have the honor of the next dance?",
                        "vi": "Tôi có thể có vinh dự của buổi khiêu vũ tiếp theo không?"
                    },
                    {
                        "en": "She had the honor of being the first living artist to have her work exhibited in the Louvre.",
                        "vi": "Cô có vinh dự là nghệ sĩ còn sống đầu tiên được trưng bày tác phẩm của mình tại Louvre."
                    },
                    {
                        "en": "I had the rare honor of being allowed into the artist's studio.",
                        "vi": "Tôi có vinh dự hiếm hoi được phép vào phòng thu của nghệ sĩ."
                    },
                    {
                        "en": "Max was given the dubious honor (= it may not really have made him feel proud and happy) of organizing the children's party.",
                        "vi": "Max đã được trao cho vinh dự không rõ ràng (= nó có thể không thực sự khiến anh ấy cảm thấy tự hào và hạnh phúc) khi tổ chức bữa tiệc cho trẻ em."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that even criminals have standards of behaviour that they respect",
                    "vi": "được sử dụng để nói rằng ngay cả tội phạm cũng có các tiêu chuẩn hành vi mà họ tôn trọng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to feel that you must do something because of your sense of moral duty",
                    "vi": "để cảm thấy rằng bạn phải làm điều gì đó vì ý thức của bạn về nghĩa vụ đạo đức"
                },
                "examples": [
                    {
                        "en": "He felt honor-bound to help her.",
                        "vi": "Anh cảm thấy có vinh dự được giúp đỡ cô ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "no particular person, team, etc. is doing better than the others in a competition, an argument, etc.",
                    "vi": "không có người, đội cụ thể nào, v.v. làm tốt hơn những người khác trong một cuộc thi, một cuộc tranh cãi, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "in order to show great respect for somebody/something",
                    "vi": "để thể hiện sự tôn trọng tuyệt đối với ai đó / điều gì đó"
                },
                "examples": [
                    {
                        "en": "a ceremony in honor of those killed in the explosion",
                        "vi": "một buổi lễ vinh danh những người thiệt mạng trong vụ nổ"
                    },
                    {
                        "en": "A banquet was held in her honor.",
                        "vi": "Một bữa tiệc được tổ chức để vinh danh cô."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to promise very seriously that you will do something or that something is true",
                    "vi": "từng hứa rất nghiêm túc rằng bạn sẽ làm điều gì đó hoặc điều gì đó là sự thật"
                },
                "examples": [
                    {
                        "en": "I swear on my honor that I knew nothing about this.",
                        "vi": "Tôi xin thề trên danh dự của mình rằng tôi không biết gì về điều này."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be trusted to do something",
                    "vi": "được tin tưởng để làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "You're on your honor not to go into my room.",
                        "vi": "Bạn vinh dự không vào phòng tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a thing that somebody considers to be very important for their honour or reputation",
                    "vi": "một điều mà ai đó coi là rất quan trọng đối với danh dự hoặc danh tiếng của họ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c8052062d37a4eb79fef37b906e6c25d",
        "word": "Hons",
        "pos": "abbreviation",
        "level": "c2",
        "phonetic": {
            "uk": "/ɒnz/",
            "us": "/ɑːnz/"
        },
        "nearby": [
            {
                "word": "honouree",
                "pos": "noun"
            },
            {
                "word": "honour killing",
                "pos": "noun"
            },
            {
                "word": "Hons",
                "pos": "abbreviation"
            },
            {
                "word": "hooch",
                "pos": "noun"
            },
            {
                "word": "hood",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "honours (used after the name of a university degree)",
                    "vi": "danh dự (được sử dụng sau tên của bằng đại học)"
                },
                "examples": [
                    {
                        "en": "Tim Smith BA (Hons)",
                        "vi": "Tim Smith BA (Hons)"
                    }
                ]
            }
        ]
    },
    {
        "id": "65193acec4e0481f888672ab28aec8ef",
        "word": "J.D.",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌdʒeɪ ˈdiː/",
            "us": "/ˌdʒeɪ ˈdiː/"
        },
        "nearby": [
            {
                "word": "JCR",
                "pos": "noun"
            },
            {
                "word": "J. Crew",
                "pos": ""
            },
            {
                "word": "J.D.",
                "pos": "noun"
            },
            {
                "word": "jealous",
                "pos": "adjective"
            },
            {
                "word": "jealously",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a degree from a law school (the abbreviation for ‘Juris Doctor’)",
                    "vi": "bằng cấp của một trường luật (viết tắt của 'Juris Doctor')"
                },
                "examples": [
                    {
                        "en": "She has a J.D. from Georgetown University.",
                        "vi": "Cô ấy có bằng JD từ Đại học Georgetown."
                    }
                ]
            }
        ]
    },
    {
        "id": "671d8a19875547a9b093095bd48ad31c",
        "word": "magna cum laude",
        "pos": "adverb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌmæɡnə kʊm ˈlɔːdi/",
            "us": "/ˌmæɡnə kʊm ˈlɔːdi/"
        },
        "nearby": [
            {
                "word": "magma",
                "pos": "noun"
            },
            {
                "word": "Magna Carta",
                "pos": "noun"
            },
            {
                "word": "magna cum laude",
                "pos": "adverb, adjective"
            },
            {
                "word": "magnanimity",
                "pos": "noun"
            },
            {
                "word": "magnanimous",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "(in the US) at the second of the three highest levels of achievement that students can reach when they finish their studies at college",
                    "vi": "(ở Mỹ) ở vị trí thứ hai trong ba mức thành tích cao nhất mà học sinh có thể đạt được khi học xong đại học"
                },
                "examples": [
                    {
                        "en": "She graduated magna cum laude from UCLA.",
                        "vi": "Cô ấy tốt nghiệp đại học hạng ưu từ UCLA."
                    }
                ]
            }
        ]
    },
    {
        "id": "bce3b4c5294a449080dbf5a5df2f6b58",
        "word": "mortar board",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmɔːtə bɔːd/",
            "us": "/ˈmɔːrtər bɔːrd/"
        },
        "nearby": [
            {
                "word": "mortar",
                "pos": "noun"
            },
            {
                "word": "mortar",
                "pos": "verb"
            },
            {
                "word": "mortar board",
                "pos": "noun"
            },
            {
                "word": "Le Morte d'Arthur",
                "pos": ""
            },
            {
                "word": "mortgage",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a black hat with a stiff square top, worn by some university teachers and students at special ceremonies",
                    "vi": "một số giáo viên và sinh viên đại học đội một chiếc mũ đen có chóp vuông cứng trong các buổi lễ đặc biệt"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "7fff49da24914e2dbe97d7c078602923",
        "word": "MSc",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌem es ˈsiː/",
            "us": "/ˌem es ˈsiː/"
        },
        "nearby": [
            {
                "word": "MS",
                "pos": "abbreviation"
            },
            {
                "word": "Ms",
                "pos": "abbreviation"
            },
            {
                "word": "MSc",
                "pos": "noun"
            },
            {
                "word": "MSG",
                "pos": "abbreviation"
            },
            {
                "word": "MSM",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a second university degree in science (the abbreviation for ‘Master of Science’)",
                    "vi": "bằng đại học thứ hai về khoa học (viết tắt của 'Thạc sĩ Khoa học')"
                },
                "examples": [
                    {
                        "en": "(British English) to be/have/do an MSc",
                        "vi": "(Tiếng Anh Anh) để trở thành / có / làm một MSc"
                    },
                    {
                        "en": "(British English) J Stevens MSc",
                        "vi": "(Anh Anh) J Stevens MSc"
                    }
                ]
            }
        ]
    },
    {
        "id": "06b4a9c66c154169ba63d45fb0ec1403",
        "word": "second",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsekənd/",
            "us": "/ˈsekənd/"
        },
        "nearby": [
            {
                "word": "second1",
                "pos": "determiner, ordinal number"
            },
            {
                "word": "second1",
                "pos": "adverb"
            },
            {
                "word": "second1",
                "pos": "noun"
            },
            {
                "word": "second1",
                "pos": "verb"
            },
            {
                "word": "second2",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a unit for measuring time. There are 60 seconds in one minute.",
                    "vi": "một đơn vị đo thời gian. Có 60 giây trong một phút."
                },
                "examples": [
                    {
                        "en": "in… seconds She can run 100 metres in just over 11 seconds.",
                        "vi": "trong… giây Cô ấy có thể chạy 100 mét chỉ trong hơn 11 giây."
                    },
                    {
                        "en": "for… seconds For several seconds he did not reply.",
                        "vi": "trong… giây Trong vài giây anh ấy không trả lời."
                    },
                    {
                        "en": "every… seconds The light flashes every five seconds.",
                        "vi": "mỗi… giây Đèn nhấp nháy sau mỗi năm giây."
                    },
                    {
                        "en": "per second The water flows at about 1.5 metres per second.",
                        "vi": "mỗi giây Nước chảy với tốc độ khoảng 1,5 mét trên giây."
                    },
                    {
                        "en": "The end of the game is only a matter of seconds away.",
                        "vi": "Trò chơi kết thúc chỉ trong tích tắc."
                    },
                    {
                        "en": "Every few seconds, she would turn towards the door.",
                        "vi": "Cứ sau vài giây, cô ấy sẽ quay về phía cửa."
                    },
                    {
                        "en": "The scene lasts six seconds.",
                        "vi": "Cảnh này kéo dài sáu giây."
                    },
                    {
                        "en": "He scored with less than 60 seconds on the clock (= less than 60 seconds after the game started).",
                        "vi": "Anh ta ghi bàn với thời gian chưa đầy 60 giây trên đồng hồ (= chưa đầy 60 giây sau khi trận đấu bắt đầu)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a very short time",
                    "vi": "một thời gian rất ngắn"
                },
                "examples": [
                    {
                        "en": "in a second I'll be with you in a second.",
                        "vi": "trong giây lát, tôi sẽ ở bên bạn trong giây lát."
                    },
                    {
                        "en": "in/within seconds They had finished within seconds.",
                        "vi": "trong / trong vòng vài giây Họ đã hoàn thành trong vòng vài giây."
                    },
                    {
                        "en": "He scored again in the dying seconds (= the last few seconds) of the game.",
                        "vi": "Anh ấy lại ghi bàn trong những giây hấp hối (= vài giây cuối cùng) của trò chơi."
                    },
                    {
                        "en": "He got out with seconds to spare.",
                        "vi": "Anh ấy đã ra ngoài với vài giây rảnh rỗi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a unit for measuring angles. There are 60 seconds in one minute.",
                    "vi": "một đơn vị đo góc. Có 60 giây trong một phút."
                },
                "examples": [
                    {
                        "en": "1° 6′ 10″ (= one degree, six minutes and ten seconds)",
                        "vi": "1 ° 6 ′ 10 ″ (= một độ, sáu phút mười giây)"
                    }
                ]
            },
            {
                "define": {
                    "en": "a second amount of the same food that you have just eaten",
                    "vi": "một lượng thứ hai của cùng một loại thức ăn mà bạn vừa ăn"
                },
                "examples": [
                    {
                        "en": "Seconds, anybody?",
                        "vi": "Giây, có ai không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "an item that is sold at a lower price than usual because it is not perfect",
                    "vi": "một mặt hàng được bán với giá thấp hơn bình thường vì nó không hoàn hảo"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "one of six or seven positions of the gears in a vehicle",
                    "vi": "một trong sáu hoặc bảy vị trí của bánh răng trong xe"
                },
                "examples": [
                    {
                        "en": "to change down from third to second",
                        "vi": "để thay đổi từ thứ ba xuống thứ hai"
                    },
                    {
                        "en": "in second When it's icy, move off in second.",
                        "vi": "thứ hai Khi trời băng giá, hãy di chuyển sau thứ hai."
                    }
                ]
            },
            {
                "define": {
                    "en": "a level of university degree at British universities. An upper second is a good degree and a lower second is average.",
                    "vi": "trình độ đại học tại các trường đại học của Anh. Giây trên là mức độ tốt và giây dưới là mức trung bình."
                },
                "examples": [
                    {
                        "en": "He got a good second in history.",
                        "vi": "Anh ấy đã có một thứ hai tốt trong lịch sử."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person whose role is to help and support somebody else, for example in a boxing match or in a formal duel in the past",
                    "vi": "một người có vai trò là giúp đỡ và hỗ trợ người khác, chẳng hạn như trong một trận đấu quyền anh hoặc trong một trận đấu chính thức trong quá khứ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to ask somebody to wait for a short time",
                    "vi": "từng yêu cầu ai đó đợi một thời gian ngắn"
                },
                "examples": [
                    {
                        "en": "‘Is Mr Burns available?’ ‘Just a second, please, I'll check.’",
                        "vi": "Mr Burns có rảnh không?' \"Vui lòng đợi một chút, tôi sẽ kiểm tra.\""
                    }
                ]
            },
            {
                "define": {
                    "en": "to wait for a short time",
                    "vi": "đợi một thời gian ngắn"
                },
                "examples": [
                    {
                        "en": "Can you wait a second while I make a call?",
                        "vi": "Bạn có thể đợi một chút trong khi tôi gọi điện không?"
                    },
                    {
                        "en": "Hey! Wait a minute! I'll come with you!",
                        "vi": "Này! Đợi tí! Tôi sẽ đi với bạn!"
                    }
                ]
            },
            {
                "define": {
                    "en": "used when you have just noticed or remembered something, or had a sudden idea",
                    "vi": "được sử dụng khi bạn vừa mới nhận ra hoặc nhớ ra điều gì đó, hoặc có một ý tưởng đột ngột"
                },
                "examples": [
                    {
                        "en": "Wait a minute—this isn't the right key.",
                        "vi": "Chờ một chút — đây không phải là chìa khóa phù hợp."
                    }
                ]
            }
        ]
    },
    {
        "id": "8f1ca481afc84bcdb3daee85caa5a08a",
        "word": "second class",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌsekənd ˈklɑːs/",
            "us": "/ˌsekənd ˈklæs/"
        },
        "nearby": [
            {
                "word": "second best",
                "pos": "noun"
            },
            {
                "word": "second chamber",
                "pos": "noun"
            },
            {
                "word": "second class",
                "pos": "noun"
            },
            {
                "word": "second class",
                "pos": "adverb"
            },
            {
                "word": "second-class",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a way of travelling on a train or ship that costs less and is less comfortable than first class. In the UK this is now usually called standard class.",
                    "vi": "một cách đi trên tàu hoặc tàu thủy có chi phí thấp hơn và ít thoải mái hơn so với hạng nhất. Ở Anh, lớp này thường được gọi là lớp tiêu chuẩn."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "(in the UK) the class of mail that costs less and takes longer to arrive than first class",
                    "vi": "(ở Anh) loại thư có chi phí thấp hơn và mất nhiều thời gian hơn để đến nơi so với loại thư đầu tiên"
                },
                "examples": [
                    {
                        "en": "Second class is cheaper.",
                        "vi": "Hạng hai rẻ hơn."
                    }
                ]
            },
            {
                "define": {
                    "en": "(in the US) the system of sending newspapers and magazines by mail",
                    "vi": "(ở Mỹ) hệ thống gửi báo và tạp chí qua đường bưu điện"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the second highest standard of degree given by a British university, often divided into upper second class and lower second class",
                    "vi": "tiêu chuẩn cấp bằng cao thứ hai do một trường đại học ở Anh đưa ra, thường được chia thành hạng hai trên và hạng hai thấp hơn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "7aa92d1faaaa48eab63eff2f210d3775",
        "word": "summa cum laude",
        "pos": "adverb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌsʊmə ˌkʊm ˈlɔːdi/",
            "us": "/ˌsʊmə ˌkʊm ˈlɔːdi/"
        },
        "nearby": [
            {
                "word": "sum",
                "pos": "noun"
            },
            {
                "word": "sum",
                "pos": "verb"
            },
            {
                "word": "summa cum laude",
                "pos": "adverb, adjective"
            },
            {
                "word": "summarily",
                "pos": "adverb"
            },
            {
                "word": "summarize",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "(in the US) at the highest level of achievement that students can reach when they finish their studies at college",
                    "vi": "(ở Mỹ) ở mức thành tích cao nhất mà học sinh có thể đạt được khi học xong đại học"
                },
                "examples": [
                    {
                        "en": "He graduated summa cum laude from Harvard.",
                        "vi": "Anh tốt nghiệp đại học Harvard."
                    }
                ]
            }
        ]
    },
    {
        "id": "9033cddbbbc94b9b9c97e0f112d6a209",
        "word": "third",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/θɜːd/",
            "us": "/θɜːrd/"
        },
        "nearby": [
            {
                "word": "thin-skinned",
                "pos": "adjective"
            },
            {
                "word": "third",
                "pos": "ordinal number"
            },
            {
                "word": "third",
                "pos": "noun"
            },
            {
                "word": "the third age",
                "pos": "noun"
            },
            {
                "word": "third base",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "each of three equal parts of something",
                    "vi": "mỗi ba phần bằng nhau của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "He divided the money into thirds.",
                        "vi": "Anh ta chia số tiền thành một phần ba."
                    },
                    {
                        "en": "third of something Over a third of sales were made over the internet.",
                        "vi": "thứ ba của cái gì đó Hơn một phần ba doanh số được thực hiện qua internet."
                    },
                    {
                        "en": "Two thirds of the population live in the poorer south.",
                        "vi": "2/3 dân số sống ở miền nam nghèo hơn."
                    }
                ]
            },
            {
                "define": {
                    "en": "the lowest standard of degree given by a British university",
                    "vi": "tiêu chuẩn thấp nhất của bằng cấp do một trường đại học ở Anh cung cấp"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "d68ff63f76c74d89842c845818bdd0ed",
        "word": "third class",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌθɜːd ˈklɑːs/",
            "us": "/ˌθɜːrd ˈklæs/"
        },
        "nearby": [
            {
                "word": "the third age",
                "pos": "noun"
            },
            {
                "word": "third base",
                "pos": "noun"
            },
            {
                "word": "third class",
                "pos": "noun"
            },
            {
                "word": "third class",
                "pos": "adverb"
            },
            {
                "word": "third-class",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "(especially in the past) the cheapest and least comfortable part of a train, ship, etc.",
                    "vi": "(đặc biệt là trong quá khứ) phần rẻ nhất và ít tiện nghi nhất của tàu hỏa, tàu thủy, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "(in the US) the class of mail used for sending advertisements, etc.",
                    "vi": "(ở Hoa Kỳ) loại thư được sử dụng để gửi quảng cáo, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the lowest standard of honours degree given by a British university",
                    "vi": "tiêu chuẩn thấp nhất về bằng cấp danh dự do một trường đại học ở Anh cung cấp"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "838cfc00c88440e1ae52054d4fea01ab",
        "word": "third-class",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌθɜːd ˈklɑːs/",
            "us": "/ˌθɜːrd ˈklæs/"
        },
        "nearby": [
            {
                "word": "third class",
                "pos": "noun"
            },
            {
                "word": "third class",
                "pos": "adverb"
            },
            {
                "word": "third-class",
                "pos": "adjective"
            },
            {
                "word": "third degree",
                "pos": "noun"
            },
            {
                "word": "third-degree",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "(especially in the past) connected with the cheapest and least comfortable way of travelling on a train, ship, etc.",
                    "vi": "(đặc biệt là trong quá khứ) được kết nối với cách rẻ nhất và ít thoải mái nhất để đi trên tàu, tàu, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "(in the US) connected with the class of mail used to send advertisements, etc.",
                    "vi": "(ở Hoa Kỳ) được kết nối với loại thư được sử dụng để gửi quảng cáo, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to describe the lowest standard of degree given by a British university",
                    "vi": "được sử dụng để mô tả tiêu chuẩn thấp nhất của bằng cấp do một trường đại học ở Anh đưa ra"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "less important than other people",
                    "vi": "ít quan trọng hơn những người khác"
                },
                "examples": [
                    {
                        "en": "They are treated as third-class citizens.",
                        "vi": "Họ được coi như những công dân hạng ba."
                    }
                ]
            }
        ]
    },
    {
        "id": "b4eb889bb8f84041b207b2d026541ef1",
        "word": "transcript",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈtrænskrɪpt/",
            "us": "/ˈtrænskrɪpt/"
        },
        "nearby": [
            {
                "word": "transcontinental",
                "pos": "adjective"
            },
            {
                "word": "transcribe",
                "pos": "verb"
            },
            {
                "word": "transcript",
                "pos": "noun"
            },
            {
                "word": "transcription",
                "pos": "noun"
            },
            {
                "word": "transducer",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a written or printed copy of words that have been spoken",
                    "vi": "một bản sao bằng văn bản hoặc bản in của những từ đã được nói"
                },
                "examples": [
                    {
                        "en": "a transcript of the interview",
                        "vi": "một bảng điểm của cuộc phỏng vấn"
                    },
                    {
                        "en": "The White House posted a transcript of the speech on its website.",
                        "vi": "Nhà Trắng đã đăng bản ghi lại bài phát biểu trên trang web của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "an official record of a student’s work that shows the courses they have taken and the grades they have achieved",
                    "vi": "một hồ sơ chính thức về công việc của một học sinh cho thấy các khóa học họ đã thực hiện và điểm họ đã đạt được"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "7518ef3517fe4791b8b795a694f4f2ae",
        "word": "viva",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈvaɪvə/",
            "us": "/ˈvaɪvə/"
        },
        "nearby": [
            {
                "word": "vituperative",
                "pos": "adjective"
            },
            {
                "word": "viva1",
                "pos": "exclamation"
            },
            {
                "word": "viva2",
                "pos": "noun"
            },
            {
                "word": "vivace",
                "pos": "adverb"
            },
            {
                "word": "vivace",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a spoken exam, especially in a British university",
                    "vi": "một kỳ thi nói, đặc biệt là ở một trường đại học ở Anh"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "9910f2770ccd401395fbde87a49876ef",
        "word": "viva voce",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌvaɪvə ˈvəʊtʃi/",
            "us": "/ˌvaɪvə ˈvəʊtʃi/"
        },
        "nearby": [
            {
                "word": "vivacity",
                "pos": "noun"
            },
            {
                "word": "vivarium",
                "pos": "noun"
            },
            {
                "word": "viva voce",
                "pos": "noun"
            },
            {
                "word": "vive la difference",
                "pos": "exclamation"
            },
            {
                "word": "Vivian",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a spoken exam, especially in a British university",
                    "vi": "một kỳ thi nói, đặc biệt là ở một trường đại học ở Anh"
                },
                "examples": []
            }
        ]
    }
]