[
    {
        "id": "870c5fffdf604d4abdb30f075709021d",
        "word": "whatever you say",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/seɪ/",
            "us": "/seɪ/"
        },
        "nearby": [
            {
                "word": "saxophone",
                "pos": "noun"
            },
            {
                "word": "saxophonist",
                "pos": "noun"
            },
            {
                "word": "say",
                "pos": "verb"
            },
            {
                "word": "say",
                "pos": "noun"
            },
            {
                "word": "say",
                "pos": "exclamation"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to speak or tell somebody something, using words",
                    "vi": "để nói hoặc nói với ai đó điều gì đó, sử dụng lời nói"
                },
                "examples": [
                    {
                        "en": "+ speech ‘Hello!’ she said.",
                        "vi": "Err:509"
                    },
                    {
                        "en": "‘That was marvellous,’ said Daniel.",
                        "vi": "Daniel nói: “Điều đó thật tuyệt vời."
                    },
                    {
                        "en": "A legendary football coach once said, ‘Winning is everything.’",
                        "vi": "Một huấn luyện viên bóng đá huyền thoại đã từng nói, 'Chiến thắng là tất cả.'"
                    }
                ]
            },
            {
                "define": {
                    "en": "to repeat words, phrases, etc.",
                    "vi": "để lặp lại các từ, cụm từ, v.v."
                },
                "examples": [
                    {
                        "en": "to say a prayer",
                        "vi": "nói một lời cầu nguyện"
                    },
                    {
                        "en": "Try to say that line with more conviction.",
                        "vi": "Cố gắng nói câu đó với niềm tin chắc chắn hơn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to give particular information or instructions",
                    "vi": "để cung cấp thông tin hoặc hướng dẫn cụ thể"
                },
                "examples": [
                    {
                        "en": "+ speech The notice said ‘Keep Out’.",
                        "vi": "Err:509"
                    },
                    {
                        "en": "say something The clock said three o'clock.",
                        "vi": "nói điều gì đó Đồng hồ báo ba giờ."
                    },
                    {
                        "en": "say (that)… The instructions say (that) we should leave it to set for four hours.",
                        "vi": "nói (điều đó)… Các hướng dẫn nói (điều đó) chúng ta nên để nó đặt trong bốn giờ."
                    },
                    {
                        "en": "say where, why, etc… The book doesn't say where he was born.",
                        "vi": "nói ở đâu, tại sao, v.v… Cuốn sách không nói nơi anh ta sinh ra."
                    },
                    {
                        "en": "say to do something The guidebook says to turn left.",
                        "vi": "nói để làm điều gì đó Sách hướng dẫn cho biết rẽ trái."
                    }
                ]
            },
            {
                "define": {
                    "en": "to express an opinion on something",
                    "vi": "để bày tỏ ý kiến về một cái gì đó"
                },
                "examples": [
                    {
                        "en": "say something Say what you like (= although you disagree) about her, she's a fine singer.",
                        "vi": "nói điều gì đó Nói những gì bạn thích (= mặc dù bạn không đồng ý) về cô ấy, cô ấy là một ca sĩ giỏi."
                    },
                    {
                        "en": "I'll say this for them, they're a very efficient company.",
                        "vi": "Tôi sẽ nói điều này cho họ, họ là một công ty rất hiệu quả."
                    },
                    {
                        "en": "Anna thinks I'm lazy—what do you say (= what is your opinion)?",
                        "vi": "Anna nghĩ tôi lười - bạn nói gì (= ý kiến của bạn)?"
                    },
                    {
                        "en": "say (that)… I can't say I blame her for resigning (= I think she was right).",
                        "vi": "nói (điều đó)… Tôi không thể nói rằng tôi đổ lỗi cho cô ấy vì đã từ chức (= Tôi nghĩ cô ấy đã đúng)."
                    },
                    {
                        "en": "I have to say I enjoyed every minute.",
                        "vi": "Tôi phải nói rằng tôi rất thích từng phút."
                    },
                    {
                        "en": "I say (= suggest) we go without them.",
                        "vi": "Tôi nói (= suggest) chúng ta đi mà không có họ."
                    },
                    {
                        "en": "I wouldn't say they were rich (= in my opinion they are not rich).",
                        "vi": "Tôi sẽ không nói rằng họ giàu có (= theo quan điểm của tôi thì họ không giàu)."
                    },
                    {
                        "en": "That's not to say it's a bad movie (= it is good but it is not without faults).",
                        "vi": "Nói như vậy không có nghĩa là phim dở (= hay nhưng không phải là không có lỗi)."
                    },
                    {
                        "en": "say what, how, etc… It's hard to say what caused the accident.",
                        "vi": "nói những gì, như thế nào, vv… Thật khó để nói điều gì đã gây ra vụ tai nạn."
                    },
                    {
                        "en": "It's difficult to say whether the story is true.",
                        "vi": "Thật khó để nói liệu câu chuyện có phải là sự thật hay không."
                    },
                    {
                        "en": "‘When will it be finished?’ ‘I couldn't say (= I don't know).’",
                        "vi": "Khi nào nó được hoàn thành?' 'Tôi không thể nói (= Tôi không biết).'"
                    },
                    {
                        "en": "Is it worth it? I would say not.",
                        "vi": "Nó có đáng không? Tôi sẽ nói là không."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make thoughts, feelings, etc. clear to somebody by using words, looks, movements, etc.",
                    "vi": "để làm rõ những suy nghĩ, cảm xúc, v.v. cho ai đó bằng cách sử dụng lời nói, vẻ ngoài, cử động, v.v."
                },
                "examples": [
                    {
                        "en": "say something His angry glance said it all.",
                        "vi": "nói điều gì đó Cái nhìn giận dữ của anh ấy đã nói lên tất cả."
                    },
                    {
                        "en": "Just what is the artist trying to say in her work?",
                        "vi": "Chỉ là người nghệ sĩ đang muốn nói gì trong tác phẩm của mình?"
                    },
                    {
                        "en": "say something about somebody/something The museum's architects have managed to say something about our national story.",
                        "vi": "nói điều gì đó về ai đó / điều gì đó Các kiến trúc sư của bảo tàng đã cố gắng nói điều gì đó về câu chuyện quốc gia của chúng ta."
                    }
                ]
            },
            {
                "define": {
                    "en": "to show, sometimes indirectly, what somebody/something is like",
                    "vi": "để cho thấy, đôi khi gián tiếp, ai đó / cái gì đó như thế nào"
                },
                "examples": [
                    {
                        "en": "say something That says it all really, doesn't it? (= it shows clearly what is true)",
                        "vi": "nói điều gì đó Điều đó nói lên tất cả thực sự, phải không? (= nó cho thấy rõ ràng điều gì là sự thật)"
                    },
                    {
                        "en": "say something about somebody/something The incident says an awful lot about his character.",
                        "vi": "nói điều gì đó về ai đó / điều gì đó Sự việc nói lên rất nhiều điều khủng khiếp về tính cách của anh ta."
                    },
                    {
                        "en": "say something to somebody This says to me that there is more here than you are letting on.",
                        "vi": "nói điều gì đó với ai đó Điều này nói với tôi rằng ở đây có nhiều thứ hơn là bạn đang cho phép."
                    }
                ]
            },
            {
                "define": {
                    "en": "to suggest or give something as an example or a possibility",
                    "vi": "đề xuất hoặc đưa ra một cái gì đó như một ví dụ hoặc một khả năng"
                },
                "examples": [
                    {
                        "en": "say something/somebody You could learn the basics in, let's say, three months.",
                        "vi": "nói điều gì đó / ai đó Bạn có thể học những điều cơ bản trong ba tháng."
                    },
                    {
                        "en": "Let’s take any writer, say (= for example) Dickens…",
                        "vi": "Hãy lấy bất kỳ nhà văn nào, nói (= ví dụ) Dickens…"
                    },
                    {
                        "en": "say (that)… Say you lose your job: what would you do then?",
                        "vi": "nói (điều đó)… Giả sử bạn mất việc: lúc đó bạn sẽ làm gì?"
                    },
                    {
                        "en": "Just say he refuses to talk to you.",
                        "vi": "Chỉ cần nói rằng anh ấy từ chối nói chuyện với bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be much more difficult to do than to talk about",
                    "vi": "khó làm hơn nhiều so với nói về"
                },
                "examples": [
                    {
                        "en": "‘Why don't you get yourself a job?’ ‘That's easier said than done.’",
                        "vi": "Tại sao bạn không kiếm cho mình một công việc?' 'Điều đó nói dễ hơn là làm.'"
                    }
                ]
            },
            {
                "define": {
                    "en": "very quickly; in a very short time",
                    "vi": "rất nhanh; trong một thời gian rất ngắn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to say that you understand a situation and there is no need to say any more",
                    "vi": "được sử dụng để nói rằng bạn hiểu một tình huống và không cần phải nói thêm nữa"
                },
                "examples": [
                    {
                        "en": "‘He's a politician, remember.’ ‘Enough said.’",
                        "vi": "Anh ấy là một chính trị gia, hãy nhớ.' 'Nói đủ rồi.'"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be very obvious or easy to predict",
                    "vi": "rất rõ ràng hoặc dễ dự đoán"
                },
                "examples": [
                    {
                        "en": "Of course I'll help you. That goes without saying.",
                        "vi": "Tất nhiên tôi sẽ giúp bạn. Mà đi mà không nói."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be ready, unwilling, etc. to talk or give your views on something",
                    "vi": "sẵn sàng, không muốn, v.v. để nói chuyện hoặc đưa ra quan điểm của bạn về điều gì đó"
                },
                "examples": [
                    {
                        "en": "She doesn't have much to say for herself (= doesn't take part in conversation).",
                        "vi": "Cô ấy không có nhiều điều để nói cho riêng mình (= không tham gia vào cuộc trò chuyện)."
                    },
                    {
                        "en": "He had plenty to say for himself (= he had a lot of opinions and was willing to talk).",
                        "vi": "Anh ấy có nhiều điều để nói cho riêng mình (= anh ấy có rất nhiều ý kiến và sẵn sàng nói chuyện)."
                    },
                    {
                        "en": "Late again—what have you got to say for yourself (= what is your excuse)?",
                        "vi": "Lại trễ nữa - bạn phải nói gì cho mình (= bạn lấy cớ gì)?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be angry",
                    "vi": "giận dữ"
                },
                "examples": [
                    {
                        "en": "He knew that if he wasn't back by midnight, his parents would have something to say about it.",
                        "vi": "Anh biết rằng nếu anh không về trước nửa đêm, bố mẹ anh sẽ có điều gì đó để nói về điều đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to introduce an opinion that makes what you have just said seem less strong",
                    "vi": "được sử dụng để đưa ra một ý kiến làm cho những gì bạn vừa nói có vẻ kém mạnh mẽ hơn"
                },
                "examples": [
                    {
                        "en": "I sometimes get worried in this job. Having said that, I enjoy doing it, it's a challenge.",
                        "vi": "Tôi đôi khi cảm thấy lo lắng trong công việc này. Phải nói rằng, tôi thích làm điều đó, đó là một thử thách."
                    }
                ]
            },
            {
                "define": {
                    "en": "used when you are saying that something is likely",
                    "vi": "được sử dụng khi bạn nói rằng điều gì đó có khả năng xảy ra"
                },
                "examples": [
                    {
                        "en": "I dare say you know about it already.",
                        "vi": "Tôi dám chắc rằng bạn đã biết về nó rồi."
                    }
                ]
            },
            {
                "define": {
                    "en": "used when you are going to criticize somebody or say something that might upset them",
                    "vi": "được sử dụng khi bạn định chỉ trích ai đó hoặc nói điều gì đó có thể khiến họ khó chịu"
                },
                "examples": [
                    {
                        "en": "That colour doesn't really suit you, if you don't mind my saying so.",
                        "vi": "Màu đó không thực sự phù hợp với bạn, nếu bạn không phiền khi tôi nói như vậy."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to tell somebody that you have listened to their opinion, especially when you are going to express a different opinion",
                    "vi": "được sử dụng để nói với ai đó rằng bạn đã lắng nghe ý kiến của họ, đặc biệt là khi bạn định bày tỏ ý kiến khác"
                },
                "examples": [
                    {
                        "en": "I hear what you're saying, but you're wrong.",
                        "vi": "Tôi nghe những gì bạn đang nói, nhưng bạn đã sai."
                    }
                ]
            },
            {
                "define": {
                    "en": "used for emphasis to say ‘yes’",
                    "vi": "được sử dụng để nhấn mạnh để nói 'có'"
                },
                "examples": [
                    {
                        "en": "‘Does she see him often?’ ‘I'll say! Nearly every day.’",
                        "vi": "Cô ấy có gặp anh ấy thường xuyên không?' 'Tôi sẽ nói! Gần như mỗi ngày. '"
                    }
                ]
            },
            {
                "define": {
                    "en": "used when you are commenting on a situation and saying that you are happy about it",
                    "vi": "được sử dụng khi bạn đang bình luận về một tình huống và nói rằng bạn hài lòng về nó"
                },
                "examples": [
                    {
                        "en": "Most teachers, I'm glad to say, take their jobs very seriously.",
                        "vi": "Tôi rất vui khi nói rằng hầu hết các giáo viên đều rất coi trọng công việc của họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "used for saying that something is disappointing",
                    "vi": "được sử dụng để nói rằng điều gì đó đáng thất vọng"
                },
                "examples": [
                    {
                        "en": "He didn't accept the job, I'm sorry to say.",
                        "vi": "Anh ấy không nhận công việc, tôi xin lỗi phải nói."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to emphasize an opinion",
                    "vi": "được sử dụng để nhấn mạnh một ý kiến"
                },
                "examples": [
                    {
                        "en": "Well, I must say, that's the funniest thing I've heard all week.",
                        "vi": "Chà, tôi phải nói rằng, đó là điều vui nhất mà tôi đã nghe cả tuần."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to express surprise, shock, etc.",
                    "vi": "được sử dụng để thể hiện sự ngạc nhiên, sốc, v.v."
                },
                "examples": [
                    {
                        "en": "I say! What a huge cake!",
                        "vi": "Tôi nói! Thật là một chiếc bánh khổng lồ!"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to attract somebody’s attention or introduce a new subject of conversation",
                    "vi": "được sử dụng để thu hút sự chú ý của ai đó hoặc giới thiệu một chủ đề mới của cuộc trò chuyện"
                },
                "examples": [
                    {
                        "en": "I say, can you lend me five pounds?",
                        "vi": "Tôi nói, bạn có thể cho tôi mượn năm bảng được không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "it shows a good/bad quality that somebody/something has",
                    "vi": "nó cho thấy chất lượng tốt / xấu mà ai đó / cái gì đó có"
                },
                "examples": [
                    {
                        "en": "It says a lot for her that she never lost her temper.",
                        "vi": "Nó nói lên rất nhiều điều cho cô ấy rằng cô ấy không bao giờ mất bình tĩnh."
                    },
                    {
                        "en": "It didn't say much for their efficiency that the order arrived a week late.",
                        "vi": "Nó không nói lên nhiều điều về hiệu quả của họ khi đơn đặt hàng đến muộn một tuần."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that you would like something or to accept something that is offered",
                    "vi": "được sử dụng để nói rằng bạn muốn một cái gì đó hoặc chấp nhận một cái gì đó được cung cấp"
                },
                "examples": [
                    {
                        "en": "I wouldn't say no to a pizza.",
                        "vi": "Tôi sẽ không nói không với pizza."
                    },
                    {
                        "en": "‘Tea, Brian?’ ‘I wouldn't say no.’",
                        "vi": "Trà, Brian? 'Tôi sẽ không nói không.'"
                    }
                ]
            },
            {
                "define": {
                    "en": "a bad situation will pass or be forgotten most quickly if nothing more is said about it",
                    "vi": "một tình huống tồi tệ sẽ trôi qua hoặc bị lãng quên nhanh nhất nếu không có gì thêm về nó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the best thing to do is say as little as possible about something",
                    "vi": "điều tốt nhất nên làm là nói càng ít càng tốt về điều gì đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used when commenting on a situation to suggest that you could say something more or worse but prefer not to",
                    "vi": "được sử dụng khi nhận xét về một tình huống để gợi ý rằng bạn có thể nói điều gì đó nhiều hơn hoặc tệ hơn nhưng không muốn"
                },
                "examples": [
                    {
                        "en": "Let's just say he wasn't very happy about the decision (= he was very unhappy or angry about it).",
                        "vi": "Hãy chỉ nói rằng anh ấy không hài lòng lắm về quyết định này (= anh ấy rất không hài lòng hoặc tức giận về điều đó)."
                    }
                ]
            },
            {
                "define": {
                    "en": "used when making a suggestion or giving an example",
                    "vi": "được sử dụng khi đưa ra đề xuất hoặc đưa ra ví dụ"
                },
                "examples": [
                    {
                        "en": "I can let you have it for, well let's say £100.",
                        "vi": "Tôi có thể để bạn có nó, giả sử là 100 bảng."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to emphasize what you are saying or to ask somebody if they really mean what they say",
                    "vi": "được sử dụng để nhấn mạnh những gì bạn đang nói hoặc để hỏi ai đó xem họ có thực sự muốn nói gì không"
                },
                "examples": [
                    {
                        "en": "I mean to say, you should have known how he would react!",
                        "vi": "Ý tôi là, bạn nên biết anh ta sẽ phản ứng như thế nào!"
                    },
                    {
                        "en": "Do you mean to say you've lost it?",
                        "vi": "Có phải bạn muốn nói rằng bạn đã đánh mất nó?"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to emphasize that the information you are giving is obvious",
                    "vi": "được sử dụng để nhấn mạnh rằng thông tin bạn đang cung cấp là hiển nhiên"
                },
                "examples": [
                    {
                        "en": "The problem, needless to say, is the cost involved.",
                        "vi": "Vấn đề, không cần phải nói, là chi phí liên quan."
                    }
                ]
            },
            {
                "define": {
                    "en": "do not stop hoping",
                    "vi": "đừng ngừng hy vọng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to say that something was, or will be, done immediately",
                    "vi": "được sử dụng để nói rằng một cái gì đó đã, hoặc sẽ được thực hiện ngay lập tức"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to never say anything good about somebody/something",
                    "vi": "không bao giờ nói bất cứ điều gì tốt về ai đó / điều gì đó"
                },
                "examples": [
                    {
                        "en": "Nobody had a good word to say about him.",
                        "vi": "Không ai có một lời tốt đẹp để nói về anh ta."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be very shy or gentle",
                    "vi": "trở nên rất nhút nhát hoặc nhẹ nhàng"
                },
                "examples": [
                    {
                        "en": "He's so nervous he wouldn't say boo to a goose.",
                        "vi": "Anh ấy lo lắng đến mức sẽ không nói la ó với một con ngỗng."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to introduce a stronger way of describing something",
                    "vi": "được sử dụng để giới thiệu một cách mạnh mẽ hơn để mô tả một cái gì đó"
                },
                "examples": [
                    {
                        "en": "a difficult, not to say impossible, task",
                        "vi": "một nhiệm vụ khó, không phải nói là không thể,"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to ask somebody to smile before you take their photograph",
                    "vi": "từng yêu cầu ai đó mỉm cười trước khi bạn chụp ảnh họ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to say something important",
                    "vi": "để nói điều gì đó quan trọng"
                },
                "examples": [
                    {
                        "en": "You said a mouthful there, buddy.",
                        "vi": "Bạn đã nói một câu ở đó, anh bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to refuse an offer, a suggestion, etc.",
                    "vi": "để từ chối một lời đề nghị, một lời đề nghị, v.v."
                },
                "examples": [
                    {
                        "en": "If you don't invest in this, you're saying no to a potential fortune.",
                        "vi": "Nếu bạn không đầu tư vào điều này, bạn đang nói không với một tài sản tiềm năng."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that you understand exactly what somebody means or is trying to say, so it is unnecessary to say anything more",
                    "vi": "được sử dụng để nói rằng bạn hiểu chính xác ý của ai đó hoặc đang cố gắng nói, vì vậy không cần thiết phải nói thêm bất cứ điều gì"
                },
                "examples": [
                    {
                        "en": "‘They went to Paris together.’ ‘Say no more!’",
                        "vi": "Họ đã đến Paris cùng nhau. 'Đừng nói nữa!'"
                    }
                ]
            },
            {
                "define": {
                    "en": "to say exactly what you feel or think",
                    "vi": "nói chính xác những gì bạn cảm thấy hoặc suy nghĩ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to express surprise at what somebody has just said",
                    "vi": "được sử dụng để bày tỏ sự ngạc nhiên về những gì ai đó vừa nói"
                },
                "examples": [
                    {
                        "en": "‘He's getting married.’ ‘Say what?’",
                        "vi": "Anh ấy sắp kết hôn.' 'Nói gì cơ?'"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to ask somebody to tell you when you should stop pouring a drink or serving food for them because they have enough",
                    "vi": "từng yêu cầu ai đó cho bạn biết khi nào bạn nên ngừng rót đồ uống hoặc phục vụ đồ ăn cho họ vì họ đã có đủ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to give an order; to make a request",
                    "vi": "để đưa ra một đơn đặt hàng; để đưa ra một yêu cầu"
                },
                "examples": [
                    {
                        "en": "Just say the word, and I'll go.",
                        "vi": "Chỉ cần nói từ đó, và tôi sẽ đi."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to suggest that although you could say more, what you do say will be enough to explain what you mean",
                    "vi": "được sử dụng để gợi ý rằng mặc dù bạn có thể nói nhiều hơn, nhưng những gì bạn nói sẽ đủ để giải thích ý bạn"
                },
                "examples": [
                    {
                        "en": "I won’t go into all the details. Suffice it to say that the whole event was a complete disaster.",
                        "vi": "Tôi sẽ không đi vào tất cả các chi tiết. Chỉ cần nói rằng toàn bộ sự kiện là một thảm họa hoàn toàn."
                    }
                ]
            },
            {
                "define": {
                    "en": "in other words",
                    "vi": "nói cách khác"
                },
                "examples": [
                    {
                        "en": "three days from now, that is to say on Friday",
                        "vi": "ba ngày kể từ bây giờ, tức là vào thứ Sáu"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to introduce an opinion that makes what you have just said seem less strong",
                    "vi": "được sử dụng để đưa ra một ý kiến làm cho những gì bạn vừa nói có vẻ kém mạnh mẽ hơn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to say that something is not very unusual or special",
                    "vi": "được sử dụng để nói rằng một cái gì đó không phải là rất bất thường hoặc đặc biệt"
                },
                "examples": [
                    {
                        "en": "She's a better player than me, but that's not saying much (= because I am a very bad player).",
                        "vi": "Cô ấy là một người chơi giỏi hơn tôi, nhưng điều đó không nói lên được nhiều điều (= bởi vì tôi là một người chơi rất tệ)."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that it is impossible to predict what might happen",
                    "vi": "từng nói rằng không thể đoán trước được điều gì có thể xảy ra"
                },
                "examples": [
                    {
                        "en": "There's no saying how he'll react.",
                        "vi": "Không có gì nói trước rằng anh ấy sẽ phản ứng như thế nào."
                    }
                ]
            },
            {
                "define": {
                    "en": "there are/are not good reasons for doing something, believing something or agreeing with something",
                    "vi": "có / không có lý do chính đáng để làm điều gì đó, tin vào điều gì đó hoặc đồng ý với điều gì đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "without making something seem better, worse, more serious, etc. than it really is",
                    "vi": "mà không làm cho điều gì đó có vẻ tốt hơn, tồi tệ hơn, nghiêm trọng hơn, v.v. so với thực tế"
                },
                "examples": [
                    {
                        "en": "I was surprised, to say the least.",
                        "vi": "Tôi đã rất ngạc nhiên, phải nói là ít nhất."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to introduce a further fact or thing in addition to those already mentioned",
                    "vi": "được sử dụng để giới thiệu một sự kiện hoặc điều khác ngoài những điều đã được đề cập"
                },
                "examples": [
                    {
                        "en": "It was too expensive, to say nothing of the time it wasted.",
                        "vi": "Nó quá đắt, không nói gì đến thời gian mà nó đã lãng phí."
                    }
                ]
            },
            {
                "define": {
                    "en": "I agree completely",
                    "vi": "Tôi hoàn toàn đồng ý"
                },
                "examples": [
                    {
                        "en": "‘We must stand up for ourselves.’ ‘Well said, John.’",
                        "vi": "Chúng ta phải tự đứng lên.' \"Nói hay đấy, John.\""
                    }
                ]
            },
            {
                "define": {
                    "en": "would you like something/to do something?",
                    "vi": "bạn có muốn một cái gì đó / để làm một cái gì đó?"
                },
                "examples": [
                    {
                        "en": "What would you say to eating out tonight?",
                        "vi": "Bạn sẽ nói gì khi đi ăn tối nay?"
                    },
                    {
                        "en": "Let's go away for a weekend. What do you say?",
                        "vi": "Cuối tuần đi chơi xa nhé. bạn nói gì?"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to agree to somebody’s suggestion because you do not want to argue",
                    "vi": "từng đồng ý với đề nghị của ai đó vì bạn không muốn tranh luận"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a particular person must be obeyed",
                    "vi": "một người cụ thể phải được tuân theo"
                },
                "examples": [
                    {
                        "en": "Sarah wanted the kitchen painted green, and what she says, goes.",
                        "vi": "Sarah muốn nhà bếp sơn màu xanh lá cây, và những gì cô ấy nói, sẽ đi."
                    }
                ]
            },
            {
                "define": {
                    "en": "when everything is considered",
                    "vi": "khi mọi thứ được xem xét"
                },
                "examples": [
                    {
                        "en": "I know you're upset, but when all's said and done it isn't exactly a disaster.",
                        "vi": "Tôi biết bạn đang buồn, nhưng khi tất cả đã nói và làm thì đó không hẳn là một thảm họa."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that nobody knows the answer to a question",
                    "vi": "thường nói rằng không ai biết câu trả lời cho một câu hỏi"
                },
                "examples": [
                    {
                        "en": "Who can say what will happen next year?",
                        "vi": "Ai có thể nói điều gì sẽ xảy ra trong năm tới?"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to disagree with a statement or an opinion",
                    "vi": "từng không đồng ý với một tuyên bố hoặc một ý kiến"
                },
                "examples": [
                    {
                        "en": "Who says I can't do it?",
                        "vi": "Ai nói rằng tôi không thể làm điều đó?"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that something might happen or might have happened in a particular way, because nobody really knows",
                    "vi": "được sử dụng để nói rằng điều gì đó có thể xảy ra hoặc có thể đã xảy ra theo một cách cụ thể, bởi vì không ai thực sự biết"
                },
                "examples": [
                    {
                        "en": "Who's to say we would not have succeeded if we'd had more time?",
                        "vi": "Ai nói rằng chúng ta sẽ không thành công nếu chúng ta có thêm thời gian?"
                    }
                ]
            },
            {
                "define": {
                    "en": "I agree with you completely",
                    "vi": "tôi hoàn toàn đồng ý với bạn"
                },
                "examples": [
                    {
                        "en": "‘He's in a bad mood today.’ ‘You can say that again!’",
                        "vi": "Hôm nay anh ấy có tâm trạng tồi tệ.' 'Bạn có thể nói điều đó một lần nữa!'"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that you think the offer you are making is reasonable or generous",
                    "vi": "được sử dụng để nói rằng bạn nghĩ rằng đề nghị bạn đang đưa ra là hợp lý hoặc hào phóng"
                },
                "examples": [
                    {
                        "en": "Look, I'll give you £100 for it. You can't say fairer than that.",
                        "vi": "Nghe này, tôi sẽ đưa cho bạn 100 bảng cho nó. Bạn không thể nói công bằng hơn thế."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to express surprise",
                    "vi": "được sử dụng để bày tỏ sự ngạc nhiên"
                },
                "examples": [
                    {
                        "en": "‘They left without us.’ ‘You don't say!’ (= I'm not surprised)",
                        "vi": "Họ rời đi mà không có chúng tôi. 'Bạn không nói!' (= Tôi không ngạc nhiên)"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to agree with somebody when they say something about themselves that you would not have been rude enough to say yourself",
                    "vi": "từng đồng ý với ai đó khi họ nói điều gì đó về bản thân mà bạn sẽ không đến mức thô lỗ khi nói về chính mình"
                },
                "examples": [
                    {
                        "en": "‘I know I'm not the world's greatest cook.’ ‘You said it!’",
                        "vi": "Tôi biết mình không phải là đầu bếp giỏi nhất thế giới.' 'Bạn đã nói như thế!'"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to agree with somebody’s suggestion",
                    "vi": "đã từng đồng ý với đề nghị của ai đó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "51b390f936ca4324b3b3e1b85683497e",
        "word": "wilco",
        "pos": "exclamation",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈwɪlkəʊ/",
            "us": "/ˈwɪlkəʊ/"
        },
        "nearby": [
            {
                "word": "William Wilberforce",
                "pos": ""
            },
            {
                "word": "Wilbur",
                "pos": ""
            },
            {
                "word": "wilco",
                "pos": "exclamation"
            },
            {
                "word": "wild",
                "pos": "adjective"
            },
            {
                "word": "wild",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "people say Wilco! in communication by radio to show that they agree to do something",
                    "vi": "người ta nói Wilco! trong giao tiếp qua radio để thể hiện rằng họ đồng ý làm điều gì đó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "02110e3d3c164f5b8005f41851b4fe42",
        "word": "with one accord",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/əˈkɔːd/",
            "us": "/əˈkɔːrd/"
        },
        "nearby": [
            {
                "word": "accomplished",
                "pos": "adjective"
            },
            {
                "word": "accomplishment",
                "pos": "noun"
            },
            {
                "word": "accord",
                "pos": "noun"
            },
            {
                "word": "accord",
                "pos": "verb"
            },
            {
                "word": "accordance",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a formal agreement between two organizations, countries, etc.",
                    "vi": "một hiệp định chính thức giữa hai tổ chức, quốc gia, v.v."
                },
                "examples": [
                    {
                        "en": "The two sides signed a peace accord last July.",
                        "vi": "Hai bên đã ký một hiệp định hòa bình vào tháng 7 năm ngoái."
                    }
                ]
            },
            {
                "define": {
                    "en": "in agreement with",
                    "vi": "đồng ý với"
                },
                "examples": [
                    {
                        "en": "This action would not be in accord with our policy.",
                        "vi": "Hành động này sẽ không phù hợp với chính sách của chúng tôi."
                    },
                    {
                        "en": "Botanists are not in complete accord about how many species exist.",
                        "vi": "Các nhà thực vật học không hoàn toàn thống nhất về số loài tồn tại."
                    }
                ]
            },
            {
                "define": {
                    "en": "without being asked, forced or helped",
                    "vi": "mà không bị yêu cầu, ép buộc hoặc giúp đỡ"
                },
                "examples": [
                    {
                        "en": "He came back of his own accord.",
                        "vi": "Anh ấy đã trở lại theo cách riêng của mình."
                    },
                    {
                        "en": "The symptoms will clear up of their own accord.",
                        "vi": "Các triệu chứng sẽ tự hết."
                    }
                ]
            },
            {
                "define": {
                    "en": "if people do something with one accord, they do it at the same time, because they agree with each other",
                    "vi": "nếu mọi người làm điều gì đó với một thỏa thuận, họ làm điều đó cùng một lúc, bởi vì họ đồng ý với nhau"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "9291a3ec738f4d6da8667e8eeded20be",
        "word": "with one voice",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/vɔɪs/",
            "us": "/vɔɪs/"
        },
        "nearby": [
            {
                "word": "vogue",
                "pos": "noun"
            },
            {
                "word": "Vogue",
                "pos": ""
            },
            {
                "word": "voice",
                "pos": "noun"
            },
            {
                "word": "voice",
                "pos": "verb"
            },
            {
                "word": "voice-activated",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the sound or sounds produced through the mouth by a person speaking or singing",
                    "vi": "âm thanh hoặc âm thanh phát ra từ miệng của một người đang nói hoặc hát"
                },
                "examples": [
                    {
                        "en": "I could hear voices in the next room.",
                        "vi": "Tôi có thể nghe thấy giọng nói trong phòng bên cạnh."
                    },
                    {
                        "en": "He recognized Sarah's voice.",
                        "vi": "Anh nhận ra giọng của Sarah."
                    },
                    {
                        "en": "in a… voice to speak in a deep/soft/loud voice",
                        "vi": "bằng… giọng nói để nói với giọng trầm / nhẹ / to"
                    },
                    {
                        "en": "‘I promise,’ she said in a small voice (= a quiet, shy voice).",
                        "vi": "“Tôi hứa,” cô ấy nói nhỏ (= một giọng nói nhỏ nhẹ, nhút nhát)."
                    },
                    {
                        "en": "in somebody's voice There was a note of concern in his voice.",
                        "vi": "trong giọng nói của ai đó Có một sự lo lắng trong giọng nói của anh ta."
                    },
                    {
                        "en": "He never raised his voice (= spoke loudly in an angry way) to the children.",
                        "vi": "Ông ấy không bao giờ lớn tiếng (= nói to một cách tức giận) với lũ trẻ."
                    },
                    {
                        "en": "to lower your voice (= to speak more quietly)",
                        "vi": "hạ giọng (= nói nhỏ hơn)"
                    },
                    {
                        "en": "Keep your voice down (= speak quietly).",
                        "vi": "Hạ giọng (= nói nhỏ)."
                    },
                    {
                        "en": "Don't take that tone of voice with me!",
                        "vi": "Đừng mang giọng điệu đó với tôi!"
                    },
                    {
                        "en": "The men turned around at the sound of my voice.",
                        "vi": "Những người đàn ông quay lại khi nghe giọng nói của tôi."
                    },
                    {
                        "en": "Her voice shook with emotion.",
                        "vi": "Giọng cô ấy run lên vì xúc động."
                    },
                    {
                        "en": "‘There you are,’ said a voice behind me.",
                        "vi": "Một giọng nói đằng sau tôi nói: “Em đây rồi."
                    },
                    {
                        "en": "When did his voice break (= become deep like a man's)?",
                        "vi": "Khi nào thì giọng anh ấy bị vỡ (= trở nên trầm như đàn ông)?"
                    },
                    {
                        "en": "Her voice sounded familiar.",
                        "vi": "Giọng cô ấy nghe quen quen."
                    },
                    {
                        "en": "He was suffering from flu and had lost his voice (= could not speak).",
                        "vi": "Anh ấy bị cúm và mất giọng (= không nói được)."
                    },
                    {
                        "en": "She has a good singing voice.",
                        "vi": "Cô ấy có một giọng hát hay."
                    },
                    {
                        "en": "She was in good voice (= singing well) at the concert tonight.",
                        "vi": "Cô ấy có giọng hát tốt (= hát hay) tại buổi hòa nhạc tối nay."
                    }
                ]
            },
            {
                "define": {
                    "en": "having a voice of the type mentioned",
                    "vi": "có một giọng nói thuộc loại được đề cập"
                },
                "examples": [
                    {
                        "en": "low-voiced",
                        "vi": "thấp giọng"
                    },
                    {
                        "en": "squeaky-voiced",
                        "vi": "giọng nói rít"
                    }
                ]
            },
            {
                "define": {
                    "en": "the right to express your opinion and influence decisions",
                    "vi": "quyền bày tỏ ý kiến của bạn và ảnh hưởng đến các quyết định"
                },
                "examples": [
                    {
                        "en": "Employees should have a voice in the decision-making process.",
                        "vi": "Nhân viên nên có tiếng nói trong quá trình ra quyết định."
                    },
                    {
                        "en": "Refugees have been unable to find a voice in politics.",
                        "vi": "Những người tị nạn đã không thể tìm thấy tiếng nói trong chính trị."
                    }
                ]
            },
            {
                "define": {
                    "en": "a particular attitude, opinion or feeling that is expressed; a feeling or an opinion that you become aware of inside yourself",
                    "vi": "một thái độ, quan điểm hoặc cảm giác cụ thể được bày tỏ; một cảm giác hoặc một ý kiến mà bạn nhận thức được bên trong mình"
                },
                "examples": [
                    {
                        "en": "He pledged that his party would listen to the voice of the people.",
                        "vi": "Ông cam kết rằng đảng của ông sẽ lắng nghe tiếng nói của người dân."
                    },
                    {
                        "en": "Very few dissenting voices were heard on the right of the party.",
                        "vi": "Rất ít tiếng nói bất đồng được nghe thấy ở bên phải của bữa tiệc."
                    },
                    {
                        "en": "the voice of reason/sanity/conscience",
                        "vi": "tiếng nói của lý trí / sự tỉnh táo / lương tâm"
                    },
                    {
                        "en": "‘Coward!’ a tiny inner voice insisted.",
                        "vi": "Nhát gan!' một giọng nói nhỏ bên trong nhấn mạnh."
                    }
                ]
            },
            {
                "define": {
                    "en": "an organization that expresses the opinion of a particular section of society",
                    "vi": "một tổ chức bày tỏ quan điểm của một bộ phận cụ thể trong xã hội"
                },
                "examples": [
                    {
                        "en": "The Royal Society is the voice of the British science establishment.",
                        "vi": "Hiệp hội Hoàng gia là tiếng nói của cơ sở khoa học Anh."
                    }
                ]
            },
            {
                "define": {
                    "en": "the form of a verb that shows whether the subject of a sentence performs the action (the active voice) or is affected by it (the passive voice)",
                    "vi": "dạng của một động từ cho biết chủ ngữ của câu thực hiện hành động (giọng chủ động) hay bị tác động bởi nó (giọng bị động)"
                },
                "examples": [
                    {
                        "en": "Can you turn this sentence into the passive voice?",
                        "vi": "Bạn có thể chuyển câu này sang giọng bị động không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "sound produced by movement of the vocal cords used in the pronunciation of vowels and some consonants",
                    "vi": "âm thanh được tạo ra bởi sự chuyển động của dây thanh âm được sử dụng để phát âm các nguyên âm và một số phụ âm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "as loudly as possible",
                    "vi": "càng to càng tốt"
                },
                "examples": [
                    {
                        "en": "She was screaming at the top of her voice.",
                        "vi": "Cô ấy đang hét lên ở đỉnh giọng của mình."
                    },
                    {
                        "en": "I was shouting at the top of my voice but she couldn't hear me.",
                        "vi": "Tôi đã hét lên đến tột cùng của giọng nói của mình nhưng cô ấy không thể nghe thấy tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be able to speak or express your opinion",
                    "vi": "để có thể nói hoặc bày tỏ ý kiến của bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to express your feelings, worries, etc.",
                    "vi": "để bày tỏ cảm xúc, lo lắng của bạn, v.v."
                },
                "examples": [
                    {
                        "en": "Many workers at the meeting gave voice to their fears about job security.",
                        "vi": "Nhiều công nhân tại cuộc họp đã lên tiếng bày tỏ lo ngại của họ về vấn đề đảm bảo việc làm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to like talking a lot or too much, usually without wanting to listen to other people",
                    "vi": "thích nói nhiều hoặc quá nhiều, thường mà không muốn lắng nghe người khác"
                },
                "examples": [
                    {
                        "en": "She’s much too fond of the sound of her own voice.",
                        "vi": "Cô ấy quá thích âm thanh giọng nói của chính mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to express your feelings, opinions, etc. in a way that makes people notice and consider them",
                    "vi": "để bày tỏ cảm xúc, ý kiến của bạn, v.v. theo cách khiến mọi người chú ý và xem xét chúng"
                },
                "examples": [
                    {
                        "en": "The programme gives ordinary viewers a chance to make their voices heard.",
                        "vi": "Chương trình mang đến cho những người xem bình thường một cơ hội để nói lên tiếng nói của họ."
                    },
                    {
                        "en": "a society in which individuals are able to make their voices heard",
                        "vi": "một xã hội trong đó các cá nhân có thể nói lên tiếng nói của họ"
                    }
                ]
            },
            {
                "define": {
                    "en": "the voice of God or your conscience, that tells you to do what is morally right",
                    "vi": "tiếng nói của Chúa hoặc lương tâm của bạn, điều đó bảo bạn làm những gì là đúng về mặt đạo đức"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "as a group; with everyone agreeing",
                    "vi": "như một nhóm; với tất cả mọi người đồng ý"
                },
                "examples": [
                    {
                        "en": "The various opposition parties speak with one voice on this issue.",
                        "vi": "Các đảng đối lập khác nhau nói với một tiếng nói về vấn đề này."
                    },
                    {
                        "en": "The teachers speak with one voice when they demand an end to the cuts.",
                        "vi": "Các giáo viên nói bằng một giọng khi họ yêu cầu chấm dứt việc cắt giảm."
                    }
                ]
            }
        ]
    },
    {
        "id": "e9ae61c9d2704788b766c508edbe7c7f",
        "word": "with pleasure",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpleʒə(r)/",
            "us": "/ˈpleʒər/"
        },
        "nearby": [
            {
                "word": "pleasurable",
                "pos": "adjective"
            },
            {
                "word": "pleasurably",
                "pos": "adverb"
            },
            {
                "word": "pleasure",
                "pos": "noun"
            },
            {
                "word": "pleasure boat",
                "pos": "noun"
            },
            {
                "word": "pleat",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a state of feeling or being happy or satisfied",
                    "vi": "một trạng thái của cảm giác hoặc hạnh phúc hoặc hài lòng"
                },
                "examples": [
                    {
                        "en": "His eyes lit up with pleasure.",
                        "vi": "Mắt anh sáng lên vì sung sướng."
                    },
                    {
                        "en": "for pleasure Encourage your child to read for pleasure.",
                        "vi": "vì niềm vui Khuyến khích con bạn đọc để giải trí."
                    },
                    {
                        "en": "pleasure in something He takes no pleasure in his work.",
                        "vi": "niềm vui trong một cái gì đó Anh ta không có niềm vui trong công việc của mình."
                    },
                    {
                        "en": "pleasure in doing something She took pleasure in shocking her parents.",
                        "vi": "niềm vui khi làm điều gì đó Cô ấy đã làm cho bố mẹ cô ấy thích thú."
                    },
                    {
                        "en": "pleasure from/out of something A large number of people fail to derive any pleasure at all from horror movies.",
                        "vi": "khoái cảm từ / ra khỏi điều gì đó Một số lượng lớn người không có được bất kỳ niềm vui nào từ các bộ phim kinh dị."
                    },
                    {
                        "en": "pleasure from/out of doing something He gets a lot of pleasure out of watching his children perform.",
                        "vi": "niềm vui từ / ngoài việc làm điều gì đó Anh ấy nhận được rất nhiều niềm vui khi xem các con của mình biểu diễn."
                    },
                    {
                        "en": "pleasure of doing something She had the pleasure of seeing him look surprised.",
                        "vi": "niềm vui khi làm điều gì đó Cô rất vui khi thấy anh ta có vẻ ngạc nhiên."
                    },
                    {
                        "en": "pleasure of something (formal) We request the pleasure of your company at the marriage of our daughter Lisa.",
                        "vi": "hân hạnh về điều gì đó (trang trọng) Chúng tôi yêu cầu quý công ty hân hạnh được tổ chức hôn lễ cho con gái Lisa của chúng tôi."
                    },
                    {
                        "en": "(formal) May I have the pleasure of the next dance?",
                        "vi": "(trang trọng) Tôi có thể vui với buổi khiêu vũ tiếp theo không?"
                    },
                    {
                        "en": "the sheer pleasure of performing music",
                        "vi": "niềm vui tuyệt đối khi biểu diễn âm nhạc"
                    },
                    {
                        "en": "pleasure at something I was touched by her genuine pleasure at her mother's present.",
                        "vi": "niềm vui sướng với một cái gì đó Tôi đã được chạm vào niềm vui thực sự của cô ấy với hiện tại của mẹ cô ấy."
                    },
                    {
                        "en": "pleasure at doing something The band's pleasure at being back in Dublin was clear.",
                        "vi": "niềm vui khi làm điều gì đó Niềm vui của ban nhạc khi được trở lại Dublin rất rõ ràng."
                    },
                    {
                        "en": "It gives me great pleasure to introduce our guest speaker.",
                        "vi": "Tôi rất vui được giới thiệu diễn giả khách mời của chúng tôi."
                    },
                    {
                        "en": "Caring for a sick relative is a task that brings both pleasure and pain.",
                        "vi": "Chăm sóc người thân ốm đau là một công việc mang lại cả niềm vui và nỗi đau."
                    },
                    {
                        "en": "(formal) The photographs are now available for your viewing pleasure.",
                        "vi": "(chính thức) Các bức ảnh hiện có sẵn cho bạn xem."
                    }
                ]
            },
            {
                "define": {
                    "en": "the activity of enjoying yourself, especially in contrast to working",
                    "vi": "hoạt động tận hưởng bản thân, đặc biệt là trái ngược với làm việc"
                },
                "examples": [
                    {
                        "en": "Are you in Paris on business or pleasure?",
                        "vi": "Bạn đang ở Paris để công tác hay giải trí?"
                    },
                    {
                        "en": "a pleasure boat/trip",
                        "vi": "một chiếc thuyền / chuyến đi vui vẻ"
                    }
                ]
            },
            {
                "define": {
                    "en": "a thing that makes you happy or satisfied",
                    "vi": "một điều khiến bạn hạnh phúc hoặc hài lòng"
                },
                "examples": [
                    {
                        "en": "pleasure of something the simple pleasures of the countryside",
                        "vi": "niềm vui của một cái gì đó những thú vui đơn giản của vùng nông thôn"
                    },
                    {
                        "en": "the pleasures and pains of everyday life",
                        "vi": "những niềm vui và nỗi đau của cuộc sống hàng ngày"
                    },
                    {
                        "en": "Swimming is one of my greatest pleasures.",
                        "vi": "Bơi lội là một trong những thú vui lớn nhất của tôi."
                    },
                    {
                        "en": "Chocolate is one of life’s little pleasures.",
                        "vi": "Sô cô la là một trong những thú vui nho nhỏ của cuộc sống."
                    },
                    {
                        "en": "This movie was one of the unexpected pleasures of the Film Festival.",
                        "vi": "Bộ phim này là một trong những niềm vui bất ngờ của Liên hoan phim."
                    },
                    {
                        "en": "it is a pleasure to do something It's a pleasure to meet you.",
                        "vi": "rất hân hạnh được làm điều gì đó Rất hân hạnh được gặp bạn."
                    },
                    {
                        "en": "‘Thanks for doing that.’ ‘It's a pleasure.’",
                        "vi": "Cảm ơn vì đã làm điều đó.' 'Đó là một vinh dự.'"
                    }
                ]
            },
            {
                "define": {
                    "en": "as you want; as somebody else wants",
                    "vi": "như bạn muốn; như ai đó muốn"
                },
                "examples": [
                    {
                        "en": "The land can be sold at the owner's pleasure.",
                        "vi": "Đất có thể được bán theo niềm vui của chủ sở hữu."
                    }
                ]
            },
            {
                "define": {
                    "en": "something that you enjoy, even though you feel it is not really a good thing",
                    "vi": "điều gì đó mà bạn thích, mặc dù bạn cảm thấy nó không thực sự là một điều tốt"
                },
                "examples": [
                    {
                        "en": "Daytime TV is one of my guilty pleasures.",
                        "vi": "Truyền hình ban ngày là một trong những thú vui tội lỗi của tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "used as a polite way of replying when somebody thanks you for doing something, to show that you were happy to do it",
                    "vi": "được sử dụng như một cách trả lời lịch sự khi ai đó cảm ơn bạn vì đã làm điều gì đó, để thể hiện rằng bạn rất vui khi làm điều đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used as a polite way of accepting or agreeing to something",
                    "vi": "được sử dụng như một cách lịch sự để chấp nhận hoặc đồng ý với một cái gì đó"
                },
                "examples": [
                    {
                        "en": "‘May I sit here?’ ‘Yes, with pleasure.’",
                        "vi": "Tôi có thể ngồi đây không?' 'Vâng, rất sẵn lòng.'"
                    }
                ]
            }
        ]
    },
    {
        "id": "8bcbde8d9b2a41479e488d653397d0cc",
        "word": "yessir",
        "pos": "exclamation",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈjesə(r)/",
            "us": "/ˈjesər/"
        },
        "nearby": [
            {
                "word": "yes-man",
                "pos": "noun"
            },
            {
                "word": "yes-no question",
                "pos": "noun"
            },
            {
                "word": "yessir",
                "pos": "exclamation"
            },
            {
                "word": "yesterday",
                "pos": "adverb"
            },
            {
                "word": "yesterday",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "used to emphasize your opinion or say that you agree very strongly",
                    "vi": "được sử dụng để nhấn mạnh ý kiến của bạn hoặc nói rằng bạn rất đồng ý"
                },
                "examples": [
                    {
                        "en": "Yessir, she was beautiful.",
                        "vi": "Yessir, cô ấy thật đẹp."
                    }
                ]
            }
        ]
    },
    {
        "id": "d776537ebd92435597082ae4fdd28486",
        "word": "you’re telling me!",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/tel/",
            "us": "/tel/"
        },
        "nearby": [
            {
                "word": "Thomas Telford",
                "pos": ""
            },
            {
                "word": "telic",
                "pos": "adjective"
            },
            {
                "word": "tell",
                "pos": "verb"
            },
            {
                "word": "tell against",
                "pos": "phrasal verb"
            },
            {
                "word": "tell-all",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to give information to somebody by speaking or writing",
                    "vi": "để cung cấp thông tin cho ai đó bằng cách nói hoặc viết"
                },
                "examples": [
                    {
                        "en": "tell something to somebody He told the news to everybody he saw.",
                        "vi": "kể điều gì đó với ai đó Anh ấy đã kể tin tức cho tất cả những người anh ấy đã thấy."
                    },
                    {
                        "en": "tell somebody something He told everybody he saw the news.",
                        "vi": "nói với ai đó điều gì đó Anh ấy nói với mọi người anh ấy đã xem tin tức."
                    },
                    {
                        "en": "Did she tell you her name?",
                        "vi": "Cô ấy có nói cho bạn biết tên của cô ấy không?"
                    },
                    {
                        "en": "What did I tell you? (= you should have listened to my advice)",
                        "vi": "Tôi đã nói gì với bạn? (= bạn nên nghe lời khuyên của tôi)"
                    },
                    {
                        "en": "‘Come closer,’ she said, ‘I want to tell you something’.",
                        "vi": "Hãy đến gần hơn, cô ấy nói, \"Tôi muốn nói với bạn một điều\"."
                    },
                    {
                        "en": "tell somebody about something Why wasn't I told about the accident?",
                        "vi": "nói với ai đó về điều gì đó Tại sao tôi không được kể về vụ tai nạn?"
                    },
                    {
                        "en": "tell somebody/yourself (that)… They’ve told us (that) they’re not coming.",
                        "vi": "nói với ai đó / chính bạn (điều đó)… Họ đã nói với chúng tôi (rằng) họ sẽ không đến."
                    },
                    {
                        "en": "I told him straight (= in a direct way) that I wasn't voting for him.",
                        "vi": "Tôi đã nói thẳng với anh ấy (= một cách trực tiếp) rằng tôi không bỏ phiếu cho anh ấy."
                    },
                    {
                        "en": "He later told the court that he had returned the money.",
                        "vi": "Sau đó anh ta nói với tòa rằng anh ta đã trả lại tiền."
                    },
                    {
                        "en": "I kept telling myself (that) everything was OK.",
                        "vi": "Tôi tiếp tục nói với bản thân (rằng) mọi thứ đều ổn."
                    },
                    {
                        "en": "Are you telling me you didn't have any help with this? (= I don't believe what you have said)",
                        "vi": "Bạn đang nói với tôi rằng bạn không có bất kỳ sự giúp đỡ nào trong việc này? (= Tôi không tin những gì bạn đã nói)"
                    },
                    {
                        "en": "tell somebody where, what, etc… Tell me where you live.",
                        "vi": "nói với ai đó ở đâu, cái gì, v.v. Hãy cho tôi biết bạn sống ở đâu."
                    },
                    {
                        "en": "tell somebody + speech ‘I'm ready to go now,’ he told her.",
                        "vi": "nói với ai đó + bài phát biểu 'Tôi đã sẵn sàng đi ngay bây giờ,' anh ấy nói với cô ấy."
                    },
                    {
                        "en": "'We hope that there will be some progress,' he told reporters.",
                        "vi": "Chúng tôi hy vọng rằng sẽ có một số tiến bộ, ông nói với các phóng viên."
                    }
                ]
            },
            {
                "define": {
                    "en": "to give information about something",
                    "vi": "để cung cấp thông tin về một cái gì đó"
                },
                "examples": [
                    {
                        "en": "tell somebody something The advertisement told us very little about the product.",
                        "vi": "nói với ai đó điều gì đó Quảng cáo cho chúng ta biết rất ít về sản phẩm."
                    },
                    {
                        "en": "tell somebody how, where, etc… This gauge tells you how much fuel you have left.",
                        "vi": "nói cho ai đó biết làm thế nào, ở đâu, v.v. ... Máy đo này cho bạn biết bạn còn lại bao nhiêu nhiên liệu."
                    },
                    {
                        "en": "tell somebody (that)… The sound of his breathing told her (that) he was asleep.",
                        "vi": "nói với ai đó (điều đó)… Tiếng thở của anh ấy nói với cô ấy (rằng) anh ấy đang ngủ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to express something in words",
                    "vi": "để diễn đạt điều gì đó bằng lời"
                },
                "examples": [
                    {
                        "en": "tell something to tell stories/jokes/lies",
                        "vi": "kể điều gì đó để kể chuyện / chuyện cười / nói dối"
                    },
                    {
                        "en": "Are you sure you're telling the truth?",
                        "vi": "Bạn có chắc là bạn đang nói sự thật?"
                    },
                    {
                        "en": "tell somebody how, what, etc… I can't tell you how happy I am.",
                        "vi": "nói cho ai đó biết làm thế nào, điều gì, v.v.… Tôi không thể nói với bạn rằng tôi hạnh phúc như thế nào."
                    },
                    {
                        "en": "tell somebody something We'd go fishing and she'd tell me stories.",
                        "vi": "nói với ai đó điều gì đó Chúng tôi sẽ đi câu cá và cô ấy sẽ kể cho tôi nghe những câu chuyện."
                    },
                    {
                        "en": "All of them had an interesting story to tell.",
                        "vi": "Tất cả họ đều có một câu chuyện thú vị để kể."
                    }
                ]
            },
            {
                "define": {
                    "en": "to let somebody know a secret",
                    "vi": "để cho ai đó biết một bí mật"
                },
                "examples": [
                    {
                        "en": "Promise you won't tell.",
                        "vi": "Hãy hứa là bạn sẽ không nói."
                    },
                    {
                        "en": "‘Who are you going out with tonight?’ ‘That would be telling!’ (= it's a secret)",
                        "vi": "Bạn sẽ đi chơi với ai tối nay?' 'Cái sẽ nói!' (= đó là một bí mật)"
                    }
                ]
            },
            {
                "define": {
                    "en": "to order or advise somebody to do something",
                    "vi": "ra lệnh hoặc khuyên ai đó làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "tell somebody/yourself to do something He was told to sit down and wait.",
                        "vi": "bảo ai đó / bản thân bạn làm điều gì đó Anh ấy được yêu cầu ngồi xuống và đợi."
                    },
                    {
                        "en": "There was a sign telling motorists to slow down.",
                        "vi": "Có một biển báo cho những người lái xe ô tô giảm tốc độ."
                    },
                    {
                        "en": "I kept telling myself to keep calm.",
                        "vi": "Tôi cứ tự nhủ mình phải giữ bình tĩnh."
                    },
                    {
                        "en": "I specifically told you to be here on time.",
                        "vi": "Tôi đặc biệt nói với bạn là phải ở đây đúng giờ."
                    },
                    {
                        "en": "tell somebody something Do what I tell you.",
                        "vi": "nói với ai đó điều gì đó Hãy làm những gì tôi nói với bạn."
                    },
                    {
                        "en": "tell somebody Children must do as they're told.",
                        "vi": "nói với ai đó Trẻ em phải làm như chúng được bảo."
                    },
                    {
                        "en": "tell somebody what, when, etc… Don't tell me what to do!",
                        "vi": "nói với ai đó cái gì, khi nào, v.v. Đừng nói với tôi phải làm gì!"
                    },
                    {
                        "en": "tell somebody (that)… The doctor told me (that) I should eat less fat.",
                        "vi": "nói với ai đó (điều đó)… Bác sĩ nói với tôi (rằng) tôi nên ăn ít chất béo hơn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to know, see or judge something correctly",
                    "vi": "để biết, xem hoặc đánh giá một cái gì đó một cách chính xác"
                },
                "examples": [
                    {
                        "en": "I think he's happy. It's hard to tell.",
                        "vi": "Tôi nghĩ anh ấy hạnh phúc. Nó rất khó để nói."
                    },
                    {
                        "en": "As far as I can tell, she's enjoying the course.",
                        "vi": "Theo như tôi có thể nói, cô ấy thích khóa học."
                    },
                    {
                        "en": "‘That's not an original.’ ‘How can you tell?’",
                        "vi": "Đó không phải là bản gốc.' \"Làm thế nào bạn có thể nói?\""
                    },
                    {
                        "en": "tell (that)… I could tell (that) he was angry from his expression.",
                        "vi": "nói (điều đó)… Tôi có thể nói (điều đó) anh ấy đang tức giận từ biểu hiện của mình."
                    },
                    {
                        "en": "tell how, if, etc… The only way to tell if you like something is by trying it.",
                        "vi": "nói như thế nào, nếu, v.v. ... Cách duy nhất để biết bạn có thích thứ gì đó hay không là thử nó."
                    },
                    {
                        "en": "It's too early to tell how popular this service will be.",
                        "vi": "Còn quá sớm để nói rằng dịch vụ này sẽ phổ biến như thế nào."
                    },
                    {
                        "en": "It's impossible to tell exactly where the problem is.",
                        "vi": "Không thể nói chính xác vấn đề là ở đâu."
                    }
                ]
            },
            {
                "define": {
                    "en": "to recognize the difference between one thing or person and another",
                    "vi": "để nhận ra sự khác biệt giữa vật này hoặc người nọ và vật khác"
                },
                "examples": [
                    {
                        "en": "tell something It was hard to tell the difference between the two versions.",
                        "vi": "nói điều gì đó Thật khó để nhận ra sự khác biệt giữa hai phiên bản."
                    },
                    {
                        "en": "tell A from B Can you tell Tom from his twin brother?",
                        "vi": "nói với A từ B Bạn có thể nói với Tom từ anh trai sinh đôi của anh ấy không?"
                    },
                    {
                        "en": "Can you tell this copy from the original?",
                        "vi": "Bạn có thể cho biết bản sao này từ bản gốc không?"
                    },
                    {
                        "en": "tell A and B apart It's difficult to tell them apart.",
                        "vi": "phân biệt A và B Thật khó để phân biệt chúng."
                    },
                    {
                        "en": "tell which, what, etc… The kittens look exactly alike—how can you tell which is which?",
                        "vi": "nói cái nào, cái gì, v.v."
                    },
                    {
                        "en": "I couldn't tell who was meant to be the chairman.",
                        "vi": "Tôi không thể biết ai được định làm chủ tịch."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have an effect on somebody/something, especially a bad one",
                    "vi": "có ảnh hưởng đến ai đó / điều gì đó, đặc biệt là một người xấu"
                },
                "examples": [
                    {
                        "en": "The strain was beginning to tell on the rescue team.",
                        "vi": "Đội cứu hộ bắt đầu căng thẳng."
                    }
                ]
            },
            {
                "define": {
                    "en": "with all people, etc. counted and included",
                    "vi": "với tất cả mọi người, v.v. được tính và bao gồm"
                },
                "examples": [
                    {
                        "en": "There are 52 people coming, all told.",
                        "vi": "Có 52 người đến, tất cả đã kể."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that you know or can guess what somebody is going to say, especially because it is typical of them",
                    "vi": "được sử dụng để nói rằng bạn biết hoặc có thể đoán những gì ai đó sẽ nói, đặc biệt là vì nó là điển hình của họ"
                },
                "examples": [
                    {
                        "en": "Don't tell me you were late again!",
                        "vi": "Đừng nói với tôi rằng bạn đã đến muộn một lần nữa!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to hear people talking about something",
                    "vi": "để nghe mọi người nói về điều gì đó"
                },
                "examples": [
                    {
                        "en": "I've often heard tell of such things.",
                        "vi": "Tôi thường nghe kể về những điều như vậy."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to tell somebody the true facts about a situation, especially when these are not known by other people",
                    "vi": "được sử dụng để nói cho ai đó sự thật về một tình huống, đặc biệt là khi những sự thật này không được người khác biết"
                },
                "examples": [
                    {
                        "en": "If the truth be known, I was afraid to tell anyone.",
                        "vi": "Nếu sự thật được biết, tôi sợ không dám nói với ai."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that something you have just said is not true or correct",
                    "vi": "được sử dụng để nói rằng điều gì đó bạn vừa nói là không đúng hoặc không đúng"
                },
                "examples": [
                    {
                        "en": "We first met in 2006, no, I tell a lie, it was 2007.",
                        "vi": "Chúng tôi gặp nhau lần đầu tiên vào năm 2006, không, tôi nói dối, đó là năm 2007."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to emphasize what you are saying, especially when it is surprising or difficult to believe",
                    "vi": "được sử dụng để nhấn mạnh những gì bạn đang nói, đặc biệt là khi nó gây ngạc nhiên hoặc khó tin"
                },
                "examples": [
                    {
                        "en": "It isn't cheap, I can tell you!",
                        "vi": "Nó không hề rẻ, tôi có thể nói với bạn!"
                    },
                    {
                        "en": "I'm telling you, that's exactly what she said.",
                        "vi": "Tôi đang nói với bạn, đó chính xác là những gì cô ấy đã nói."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to introduce a suggestion",
                    "vi": "được sử dụng để giới thiệu một gợi ý"
                },
                "examples": [
                    {
                        "en": "I'll tell you what—let's stay in instead.",
                        "vi": "Tôi sẽ cho bạn biết điều gì — thay vào đó hãy ở lại."
                    }
                ]
            },
            {
                "define": {
                    "en": "used when something bad has happened, to remind somebody that you warned them about it and they did not listen to you",
                    "vi": "được sử dụng khi điều gì đó tồi tệ đã xảy ra, để nhắc nhở ai đó rằng bạn đã cảnh báo họ về điều đó và họ không nghe bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a way of referring to somebody talking publicly, usually for money, about a past sexual relationship with somebody famous",
                    "vi": "một cách ám chỉ ai đó đang nói chuyện công khai, thường là vì tiền, về mối quan hệ tình ái trong quá khứ với người nổi tiếng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to know/tell somebody some useful, interesting or surprising information about somebody/something",
                    "vi": "để biết / nói với ai đó một số thông tin hữu ích, thú vị hoặc đáng ngạc nhiên về ai đó / điều gì đó"
                },
                "examples": [
                    {
                        "en": "She's been married five times, so she knows a thing or two about men!",
                        "vi": "Cô ấy đã kết hôn năm lần, vì vậy cô ấy biết một hoặc hai điều về đàn ông!"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that somebody told you something but you do not want to say who it was",
                    "vi": "từng nói rằng ai đó đã nói với bạn điều gì đó nhưng bạn không muốn nói đó là ai"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to survive a difficult or dangerous experience so that you can tell others what really happened",
                    "vi": "để sống sót qua một trải nghiệm khó khăn hoặc nguy hiểm để bạn có thể nói cho người khác biết điều gì đã thực sự xảy ra"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to give some information that is different from what you expect or have been told",
                    "vi": "để cung cấp một số thông tin khác với những gì bạn mong đợi hoặc đã được cho biết"
                },
                "examples": [
                    {
                        "en": "These drugs are widely believed to be effective medications. The data, however, tell a different story.",
                        "vi": "Những loại thuốc này được nhiều người tin rằng là những loại thuốc chữa bệnh hiệu quả. Tuy nhiên, dữ liệu lại kể một câu chuyện khác."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to introduce a question",
                    "vi": "dùng để giới thiệu một câu hỏi"
                },
                "examples": [
                    {
                        "en": "Tell me, have you had lunch yet?",
                        "vi": "Nói cho tôi biết, bạn đã ăn trưa chưa?"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that you understand what somebody is talking about and have had the same experience",
                    "vi": "được sử dụng để nói rằng bạn hiểu những gì ai đó đang nói về và đã có trải nghiệm tương tự"
                },
                "examples": [
                    {
                        "en": "‘I get so annoyed with Steve!’ ‘Tell me about it. He drives me crazy.’",
                        "vi": "Tôi rất khó chịu với Steve!' 'Nói cho tôi nghe về nó đi. Anh ấy khiến tôi phát điên lên.'"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to tell somebody that you do not believe what they have said",
                    "vi": "từng nói với ai đó rằng bạn không tin những gì họ đã nói"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to explain itself, without needing any further explanation or comment",
                    "vi": "để tự giải thích mà không cần giải thích hoặc bình luận gì thêm"
                },
                "examples": [
                    {
                        "en": "Her face told its own story.",
                        "vi": "Khuôn mặt của cô ấy đã kể câu chuyện của chính nó."
                    }
                ]
            },
            {
                "define": {
                    "en": "to tell somebody about something that another person has done wrong",
                    "vi": "để nói với ai đó về điều gì đó mà người khác đã làm sai"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to tell somebody/know some useful, interesting or surprising information about somebody/something",
                    "vi": "để nói với ai đó / biết một số thông tin hữu ích, thú vị hoặc đáng ngạc nhiên về ai đó / điều gì đó"
                },
                "examples": [
                    {
                        "en": "After winning several Oscars, Nick Park can tell you a thing or two about making animated films.",
                        "vi": "Sau khi giành được một số giải Oscar, Nick Park có thể cho bạn biết một hoặc hai điều về việc làm phim hoạt hình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to read the time from a clock, etc.",
                    "vi": "để đọc thời gian từ đồng hồ, v.v."
                },
                "examples": [
                    {
                        "en": "She's only five—she hasn't learnt to tell the time yet.",
                        "vi": "Cô ấy mới năm tuổi — cô ấy chưa học cách nói thời gian."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make it clear to somebody that you will no longer accept their bad behaviour",
                    "vi": "nói rõ với ai đó rằng bạn sẽ không chấp nhận hành vi xấu của họ nữa"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to make it clear to somebody that you are angry and are rejecting what they are offering you",
                    "vi": "để nói rõ với ai đó rằng bạn đang tức giận và đang từ chối những gì họ đang cung cấp cho bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to say that it is impossible to know what happened or will happen",
                    "vi": "được sử dụng để nói rằng không thể biết điều gì đã xảy ra hoặc sẽ xảy ra"
                },
                "examples": [
                    {
                        "en": "There's no telling how they'll react.",
                        "vi": "Không có gì để biết họ sẽ phản ứng như thế nào."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that you will have to wait for some time to find out the result of a situation",
                    "vi": "thường nói rằng bạn sẽ phải đợi một thời gian để tìm ra kết quả của một tình huống"
                },
                "examples": [
                    {
                        "en": "Only time will tell if the treatment has been successful.",
                        "vi": "Chỉ có thời gian mới biết liệu việc điều trị có thành công hay không."
                    }
                ]
            },
            {
                "define": {
                    "en": "used when admitting something",
                    "vi": "được sử dụng khi thừa nhận điều gì đó"
                },
                "examples": [
                    {
                        "en": "To tell the truth, I fell asleep in the middle of her talk.",
                        "vi": "Nói thật là tôi đã ngủ quên giữa buổi nói chuyện của cô ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "you can never be sure, for example because things are not always what they appear to be",
                    "vi": "bạn không bao giờ có thể chắc chắn, chẳng hạn như vì mọi thứ không phải lúc nào cũng giống như"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "I completely agree with you",
                    "vi": "Tôi hoàn toàn đồng ý với bạn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "65a1143767134f369c332bf9705d0285",
        "word": "you said it!",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/seɪ/",
            "us": "/seɪ/"
        },
        "nearby": [
            {
                "word": "saxophone",
                "pos": "noun"
            },
            {
                "word": "saxophonist",
                "pos": "noun"
            },
            {
                "word": "say",
                "pos": "verb"
            },
            {
                "word": "say",
                "pos": "noun"
            },
            {
                "word": "say",
                "pos": "exclamation"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to speak or tell somebody something, using words",
                    "vi": "để nói hoặc nói với ai đó điều gì đó, sử dụng lời nói"
                },
                "examples": [
                    {
                        "en": "+ speech ‘Hello!’ she said.",
                        "vi": "Err:509"
                    },
                    {
                        "en": "‘That was marvellous,’ said Daniel.",
                        "vi": "Daniel nói: “Điều đó thật tuyệt vời."
                    },
                    {
                        "en": "A legendary football coach once said, ‘Winning is everything.’",
                        "vi": "Một huấn luyện viên bóng đá huyền thoại đã từng nói, 'Chiến thắng là tất cả.'"
                    }
                ]
            },
            {
                "define": {
                    "en": "to repeat words, phrases, etc.",
                    "vi": "để lặp lại các từ, cụm từ, v.v."
                },
                "examples": [
                    {
                        "en": "to say a prayer",
                        "vi": "nói một lời cầu nguyện"
                    },
                    {
                        "en": "Try to say that line with more conviction.",
                        "vi": "Cố gắng nói câu đó với niềm tin chắc chắn hơn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to give particular information or instructions",
                    "vi": "để cung cấp thông tin hoặc hướng dẫn cụ thể"
                },
                "examples": [
                    {
                        "en": "+ speech The notice said ‘Keep Out’.",
                        "vi": "Err:509"
                    },
                    {
                        "en": "say something The clock said three o'clock.",
                        "vi": "nói điều gì đó Đồng hồ báo ba giờ."
                    },
                    {
                        "en": "say (that)… The instructions say (that) we should leave it to set for four hours.",
                        "vi": "nói (điều đó)… Các hướng dẫn nói (điều đó) chúng ta nên để nó đặt trong bốn giờ."
                    },
                    {
                        "en": "say where, why, etc… The book doesn't say where he was born.",
                        "vi": "nói ở đâu, tại sao, v.v… Cuốn sách không nói nơi anh ta sinh ra."
                    },
                    {
                        "en": "say to do something The guidebook says to turn left.",
                        "vi": "nói để làm điều gì đó Sách hướng dẫn cho biết rẽ trái."
                    }
                ]
            },
            {
                "define": {
                    "en": "to express an opinion on something",
                    "vi": "để bày tỏ ý kiến về một cái gì đó"
                },
                "examples": [
                    {
                        "en": "say something Say what you like (= although you disagree) about her, she's a fine singer.",
                        "vi": "nói điều gì đó Nói những gì bạn thích (= mặc dù bạn không đồng ý) về cô ấy, cô ấy là một ca sĩ giỏi."
                    },
                    {
                        "en": "I'll say this for them, they're a very efficient company.",
                        "vi": "Tôi sẽ nói điều này cho họ, họ là một công ty rất hiệu quả."
                    },
                    {
                        "en": "Anna thinks I'm lazy—what do you say (= what is your opinion)?",
                        "vi": "Anna nghĩ tôi lười - bạn nói gì (= ý kiến của bạn)?"
                    },
                    {
                        "en": "say (that)… I can't say I blame her for resigning (= I think she was right).",
                        "vi": "nói (điều đó)… Tôi không thể nói rằng tôi đổ lỗi cho cô ấy vì đã từ chức (= Tôi nghĩ cô ấy đã đúng)."
                    },
                    {
                        "en": "I have to say I enjoyed every minute.",
                        "vi": "Tôi phải nói rằng tôi rất thích từng phút."
                    },
                    {
                        "en": "I say (= suggest) we go without them.",
                        "vi": "Tôi nói (= suggest) chúng ta đi mà không có họ."
                    },
                    {
                        "en": "I wouldn't say they were rich (= in my opinion they are not rich).",
                        "vi": "Tôi sẽ không nói rằng họ giàu có (= theo quan điểm của tôi thì họ không giàu)."
                    },
                    {
                        "en": "That's not to say it's a bad movie (= it is good but it is not without faults).",
                        "vi": "Nói như vậy không có nghĩa là phim dở (= hay nhưng không phải là không có lỗi)."
                    },
                    {
                        "en": "say what, how, etc… It's hard to say what caused the accident.",
                        "vi": "nói những gì, như thế nào, vv… Thật khó để nói điều gì đã gây ra vụ tai nạn."
                    },
                    {
                        "en": "It's difficult to say whether the story is true.",
                        "vi": "Thật khó để nói liệu câu chuyện có phải là sự thật hay không."
                    },
                    {
                        "en": "‘When will it be finished?’ ‘I couldn't say (= I don't know).’",
                        "vi": "Khi nào nó được hoàn thành?' 'Tôi không thể nói (= Tôi không biết).'"
                    },
                    {
                        "en": "Is it worth it? I would say not.",
                        "vi": "Nó có đáng không? Tôi sẽ nói là không."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make thoughts, feelings, etc. clear to somebody by using words, looks, movements, etc.",
                    "vi": "để làm rõ những suy nghĩ, cảm xúc, v.v. cho ai đó bằng cách sử dụng lời nói, vẻ ngoài, cử động, v.v."
                },
                "examples": [
                    {
                        "en": "say something His angry glance said it all.",
                        "vi": "nói điều gì đó Cái nhìn giận dữ của anh ấy đã nói lên tất cả."
                    },
                    {
                        "en": "Just what is the artist trying to say in her work?",
                        "vi": "Chỉ là người nghệ sĩ đang muốn nói gì trong tác phẩm của mình?"
                    },
                    {
                        "en": "say something about somebody/something The museum's architects have managed to say something about our national story.",
                        "vi": "nói điều gì đó về ai đó / điều gì đó Các kiến trúc sư của bảo tàng đã cố gắng nói điều gì đó về câu chuyện quốc gia của chúng ta."
                    }
                ]
            },
            {
                "define": {
                    "en": "to show, sometimes indirectly, what somebody/something is like",
                    "vi": "để cho thấy, đôi khi gián tiếp, ai đó / cái gì đó như thế nào"
                },
                "examples": [
                    {
                        "en": "say something That says it all really, doesn't it? (= it shows clearly what is true)",
                        "vi": "nói điều gì đó Điều đó nói lên tất cả thực sự, phải không? (= nó cho thấy rõ ràng điều gì là sự thật)"
                    },
                    {
                        "en": "say something about somebody/something The incident says an awful lot about his character.",
                        "vi": "nói điều gì đó về ai đó / điều gì đó Sự việc nói lên rất nhiều điều khủng khiếp về tính cách của anh ta."
                    },
                    {
                        "en": "say something to somebody This says to me that there is more here than you are letting on.",
                        "vi": "nói điều gì đó với ai đó Điều này nói với tôi rằng ở đây có nhiều thứ hơn là bạn đang cho phép."
                    }
                ]
            },
            {
                "define": {
                    "en": "to suggest or give something as an example or a possibility",
                    "vi": "đề xuất hoặc đưa ra một cái gì đó như một ví dụ hoặc một khả năng"
                },
                "examples": [
                    {
                        "en": "say something/somebody You could learn the basics in, let's say, three months.",
                        "vi": "nói điều gì đó / ai đó Bạn có thể học những điều cơ bản trong ba tháng."
                    },
                    {
                        "en": "Let’s take any writer, say (= for example) Dickens…",
                        "vi": "Hãy lấy bất kỳ nhà văn nào, nói (= ví dụ) Dickens…"
                    },
                    {
                        "en": "say (that)… Say you lose your job: what would you do then?",
                        "vi": "nói (điều đó)… Giả sử bạn mất việc: lúc đó bạn sẽ làm gì?"
                    },
                    {
                        "en": "Just say he refuses to talk to you.",
                        "vi": "Chỉ cần nói rằng anh ấy từ chối nói chuyện với bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be much more difficult to do than to talk about",
                    "vi": "khó làm hơn nhiều so với nói về"
                },
                "examples": [
                    {
                        "en": "‘Why don't you get yourself a job?’ ‘That's easier said than done.’",
                        "vi": "Tại sao bạn không kiếm cho mình một công việc?' 'Điều đó nói dễ hơn là làm.'"
                    }
                ]
            },
            {
                "define": {
                    "en": "very quickly; in a very short time",
                    "vi": "rất nhanh; trong một thời gian rất ngắn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to say that you understand a situation and there is no need to say any more",
                    "vi": "được sử dụng để nói rằng bạn hiểu một tình huống và không cần phải nói thêm nữa"
                },
                "examples": [
                    {
                        "en": "‘He's a politician, remember.’ ‘Enough said.’",
                        "vi": "Anh ấy là một chính trị gia, hãy nhớ.' 'Nói đủ rồi.'"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be very obvious or easy to predict",
                    "vi": "rất rõ ràng hoặc dễ dự đoán"
                },
                "examples": [
                    {
                        "en": "Of course I'll help you. That goes without saying.",
                        "vi": "Tất nhiên tôi sẽ giúp bạn. Mà đi mà không nói."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be ready, unwilling, etc. to talk or give your views on something",
                    "vi": "sẵn sàng, không muốn, v.v. để nói chuyện hoặc đưa ra quan điểm của bạn về điều gì đó"
                },
                "examples": [
                    {
                        "en": "She doesn't have much to say for herself (= doesn't take part in conversation).",
                        "vi": "Cô ấy không có nhiều điều để nói cho riêng mình (= không tham gia vào cuộc trò chuyện)."
                    },
                    {
                        "en": "He had plenty to say for himself (= he had a lot of opinions and was willing to talk).",
                        "vi": "Anh ấy có nhiều điều để nói cho riêng mình (= anh ấy có rất nhiều ý kiến và sẵn sàng nói chuyện)."
                    },
                    {
                        "en": "Late again—what have you got to say for yourself (= what is your excuse)?",
                        "vi": "Lại trễ nữa - bạn phải nói gì cho mình (= bạn lấy cớ gì)?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be angry",
                    "vi": "giận dữ"
                },
                "examples": [
                    {
                        "en": "He knew that if he wasn't back by midnight, his parents would have something to say about it.",
                        "vi": "Anh biết rằng nếu anh không về trước nửa đêm, bố mẹ anh sẽ có điều gì đó để nói về điều đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to introduce an opinion that makes what you have just said seem less strong",
                    "vi": "được sử dụng để đưa ra một ý kiến làm cho những gì bạn vừa nói có vẻ kém mạnh mẽ hơn"
                },
                "examples": [
                    {
                        "en": "I sometimes get worried in this job. Having said that, I enjoy doing it, it's a challenge.",
                        "vi": "Tôi đôi khi cảm thấy lo lắng trong công việc này. Phải nói rằng, tôi thích làm điều đó, đó là một thử thách."
                    }
                ]
            },
            {
                "define": {
                    "en": "used when you are saying that something is likely",
                    "vi": "được sử dụng khi bạn nói rằng điều gì đó có khả năng xảy ra"
                },
                "examples": [
                    {
                        "en": "I dare say you know about it already.",
                        "vi": "Tôi dám chắc rằng bạn đã biết về nó rồi."
                    }
                ]
            },
            {
                "define": {
                    "en": "used when you are going to criticize somebody or say something that might upset them",
                    "vi": "được sử dụng khi bạn định chỉ trích ai đó hoặc nói điều gì đó có thể khiến họ khó chịu"
                },
                "examples": [
                    {
                        "en": "That colour doesn't really suit you, if you don't mind my saying so.",
                        "vi": "Màu đó không thực sự phù hợp với bạn, nếu bạn không phiền khi tôi nói như vậy."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to tell somebody that you have listened to their opinion, especially when you are going to express a different opinion",
                    "vi": "được sử dụng để nói với ai đó rằng bạn đã lắng nghe ý kiến của họ, đặc biệt là khi bạn định bày tỏ ý kiến khác"
                },
                "examples": [
                    {
                        "en": "I hear what you're saying, but you're wrong.",
                        "vi": "Tôi nghe những gì bạn đang nói, nhưng bạn đã sai."
                    }
                ]
            },
            {
                "define": {
                    "en": "used for emphasis to say ‘yes’",
                    "vi": "được sử dụng để nhấn mạnh để nói 'có'"
                },
                "examples": [
                    {
                        "en": "‘Does she see him often?’ ‘I'll say! Nearly every day.’",
                        "vi": "Cô ấy có gặp anh ấy thường xuyên không?' 'Tôi sẽ nói! Gần như mỗi ngày. '"
                    }
                ]
            },
            {
                "define": {
                    "en": "used when you are commenting on a situation and saying that you are happy about it",
                    "vi": "được sử dụng khi bạn đang bình luận về một tình huống và nói rằng bạn hài lòng về nó"
                },
                "examples": [
                    {
                        "en": "Most teachers, I'm glad to say, take their jobs very seriously.",
                        "vi": "Tôi rất vui khi nói rằng hầu hết các giáo viên đều rất coi trọng công việc của họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "used for saying that something is disappointing",
                    "vi": "được sử dụng để nói rằng điều gì đó đáng thất vọng"
                },
                "examples": [
                    {
                        "en": "He didn't accept the job, I'm sorry to say.",
                        "vi": "Anh ấy không nhận công việc, tôi xin lỗi phải nói."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to emphasize an opinion",
                    "vi": "được sử dụng để nhấn mạnh một ý kiến"
                },
                "examples": [
                    {
                        "en": "Well, I must say, that's the funniest thing I've heard all week.",
                        "vi": "Chà, tôi phải nói rằng, đó là điều vui nhất mà tôi đã nghe cả tuần."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to express surprise, shock, etc.",
                    "vi": "được sử dụng để thể hiện sự ngạc nhiên, sốc, v.v."
                },
                "examples": [
                    {
                        "en": "I say! What a huge cake!",
                        "vi": "Tôi nói! Thật là một chiếc bánh khổng lồ!"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to attract somebody’s attention or introduce a new subject of conversation",
                    "vi": "được sử dụng để thu hút sự chú ý của ai đó hoặc giới thiệu một chủ đề mới của cuộc trò chuyện"
                },
                "examples": [
                    {
                        "en": "I say, can you lend me five pounds?",
                        "vi": "Tôi nói, bạn có thể cho tôi mượn năm bảng được không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "it shows a good/bad quality that somebody/something has",
                    "vi": "nó cho thấy chất lượng tốt / xấu mà ai đó / cái gì đó có"
                },
                "examples": [
                    {
                        "en": "It says a lot for her that she never lost her temper.",
                        "vi": "Nó nói lên rất nhiều điều cho cô ấy rằng cô ấy không bao giờ mất bình tĩnh."
                    },
                    {
                        "en": "It didn't say much for their efficiency that the order arrived a week late.",
                        "vi": "Nó không nói lên nhiều điều về hiệu quả của họ khi đơn đặt hàng đến muộn một tuần."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that you would like something or to accept something that is offered",
                    "vi": "được sử dụng để nói rằng bạn muốn một cái gì đó hoặc chấp nhận một cái gì đó được cung cấp"
                },
                "examples": [
                    {
                        "en": "I wouldn't say no to a pizza.",
                        "vi": "Tôi sẽ không nói không với pizza."
                    },
                    {
                        "en": "‘Tea, Brian?’ ‘I wouldn't say no.’",
                        "vi": "Trà, Brian? 'Tôi sẽ không nói không.'"
                    }
                ]
            },
            {
                "define": {
                    "en": "a bad situation will pass or be forgotten most quickly if nothing more is said about it",
                    "vi": "một tình huống tồi tệ sẽ trôi qua hoặc bị lãng quên nhanh nhất nếu không có gì thêm về nó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the best thing to do is say as little as possible about something",
                    "vi": "điều tốt nhất nên làm là nói càng ít càng tốt về điều gì đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used when commenting on a situation to suggest that you could say something more or worse but prefer not to",
                    "vi": "được sử dụng khi nhận xét về một tình huống để gợi ý rằng bạn có thể nói điều gì đó nhiều hơn hoặc tệ hơn nhưng không muốn"
                },
                "examples": [
                    {
                        "en": "Let's just say he wasn't very happy about the decision (= he was very unhappy or angry about it).",
                        "vi": "Hãy chỉ nói rằng anh ấy không hài lòng lắm về quyết định này (= anh ấy rất không hài lòng hoặc tức giận về điều đó)."
                    }
                ]
            },
            {
                "define": {
                    "en": "used when making a suggestion or giving an example",
                    "vi": "được sử dụng khi đưa ra đề xuất hoặc đưa ra ví dụ"
                },
                "examples": [
                    {
                        "en": "I can let you have it for, well let's say £100.",
                        "vi": "Tôi có thể để bạn có nó, giả sử là 100 bảng."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to emphasize what you are saying or to ask somebody if they really mean what they say",
                    "vi": "được sử dụng để nhấn mạnh những gì bạn đang nói hoặc để hỏi ai đó xem họ có thực sự muốn nói gì không"
                },
                "examples": [
                    {
                        "en": "I mean to say, you should have known how he would react!",
                        "vi": "Ý tôi là, bạn nên biết anh ta sẽ phản ứng như thế nào!"
                    },
                    {
                        "en": "Do you mean to say you've lost it?",
                        "vi": "Có phải bạn muốn nói rằng bạn đã đánh mất nó?"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to emphasize that the information you are giving is obvious",
                    "vi": "được sử dụng để nhấn mạnh rằng thông tin bạn đang cung cấp là hiển nhiên"
                },
                "examples": [
                    {
                        "en": "The problem, needless to say, is the cost involved.",
                        "vi": "Vấn đề, không cần phải nói, là chi phí liên quan."
                    }
                ]
            },
            {
                "define": {
                    "en": "do not stop hoping",
                    "vi": "đừng ngừng hy vọng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to say that something was, or will be, done immediately",
                    "vi": "được sử dụng để nói rằng một cái gì đó đã, hoặc sẽ được thực hiện ngay lập tức"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to never say anything good about somebody/something",
                    "vi": "không bao giờ nói bất cứ điều gì tốt về ai đó / điều gì đó"
                },
                "examples": [
                    {
                        "en": "Nobody had a good word to say about him.",
                        "vi": "Không ai có một lời tốt đẹp để nói về anh ta."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be very shy or gentle",
                    "vi": "trở nên rất nhút nhát hoặc nhẹ nhàng"
                },
                "examples": [
                    {
                        "en": "He's so nervous he wouldn't say boo to a goose.",
                        "vi": "Anh ấy lo lắng đến mức sẽ không nói la ó với một con ngỗng."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to introduce a stronger way of describing something",
                    "vi": "được sử dụng để giới thiệu một cách mạnh mẽ hơn để mô tả một cái gì đó"
                },
                "examples": [
                    {
                        "en": "a difficult, not to say impossible, task",
                        "vi": "một nhiệm vụ khó, không phải nói là không thể,"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to ask somebody to smile before you take their photograph",
                    "vi": "từng yêu cầu ai đó mỉm cười trước khi bạn chụp ảnh họ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to say something important",
                    "vi": "để nói điều gì đó quan trọng"
                },
                "examples": [
                    {
                        "en": "You said a mouthful there, buddy.",
                        "vi": "Bạn đã nói một câu ở đó, anh bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to refuse an offer, a suggestion, etc.",
                    "vi": "để từ chối một lời đề nghị, một lời đề nghị, v.v."
                },
                "examples": [
                    {
                        "en": "If you don't invest in this, you're saying no to a potential fortune.",
                        "vi": "Nếu bạn không đầu tư vào điều này, bạn đang nói không với một tài sản tiềm năng."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that you understand exactly what somebody means or is trying to say, so it is unnecessary to say anything more",
                    "vi": "được sử dụng để nói rằng bạn hiểu chính xác ý của ai đó hoặc đang cố gắng nói, vì vậy không cần thiết phải nói thêm bất cứ điều gì"
                },
                "examples": [
                    {
                        "en": "‘They went to Paris together.’ ‘Say no more!’",
                        "vi": "Họ đã đến Paris cùng nhau. 'Đừng nói nữa!'"
                    }
                ]
            },
            {
                "define": {
                    "en": "to say exactly what you feel or think",
                    "vi": "nói chính xác những gì bạn cảm thấy hoặc suy nghĩ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to express surprise at what somebody has just said",
                    "vi": "được sử dụng để bày tỏ sự ngạc nhiên về những gì ai đó vừa nói"
                },
                "examples": [
                    {
                        "en": "‘He's getting married.’ ‘Say what?’",
                        "vi": "Anh ấy sắp kết hôn.' 'Nói gì cơ?'"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to ask somebody to tell you when you should stop pouring a drink or serving food for them because they have enough",
                    "vi": "từng yêu cầu ai đó cho bạn biết khi nào bạn nên ngừng rót đồ uống hoặc phục vụ đồ ăn cho họ vì họ đã có đủ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to give an order; to make a request",
                    "vi": "để đưa ra một đơn đặt hàng; để đưa ra một yêu cầu"
                },
                "examples": [
                    {
                        "en": "Just say the word, and I'll go.",
                        "vi": "Chỉ cần nói từ đó, và tôi sẽ đi."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to suggest that although you could say more, what you do say will be enough to explain what you mean",
                    "vi": "được sử dụng để gợi ý rằng mặc dù bạn có thể nói nhiều hơn, nhưng những gì bạn nói sẽ đủ để giải thích ý bạn"
                },
                "examples": [
                    {
                        "en": "I won’t go into all the details. Suffice it to say that the whole event was a complete disaster.",
                        "vi": "Tôi sẽ không đi vào tất cả các chi tiết. Chỉ cần nói rằng toàn bộ sự kiện là một thảm họa hoàn toàn."
                    }
                ]
            },
            {
                "define": {
                    "en": "in other words",
                    "vi": "nói cách khác"
                },
                "examples": [
                    {
                        "en": "three days from now, that is to say on Friday",
                        "vi": "ba ngày kể từ bây giờ, tức là vào thứ Sáu"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to introduce an opinion that makes what you have just said seem less strong",
                    "vi": "được sử dụng để đưa ra một ý kiến làm cho những gì bạn vừa nói có vẻ kém mạnh mẽ hơn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to say that something is not very unusual or special",
                    "vi": "được sử dụng để nói rằng một cái gì đó không phải là rất bất thường hoặc đặc biệt"
                },
                "examples": [
                    {
                        "en": "She's a better player than me, but that's not saying much (= because I am a very bad player).",
                        "vi": "Cô ấy là một người chơi giỏi hơn tôi, nhưng điều đó không nói lên được nhiều điều (= bởi vì tôi là một người chơi rất tệ)."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that it is impossible to predict what might happen",
                    "vi": "từng nói rằng không thể đoán trước được điều gì có thể xảy ra"
                },
                "examples": [
                    {
                        "en": "There's no saying how he'll react.",
                        "vi": "Không có gì nói trước rằng anh ấy sẽ phản ứng như thế nào."
                    }
                ]
            },
            {
                "define": {
                    "en": "there are/are not good reasons for doing something, believing something or agreeing with something",
                    "vi": "có / không có lý do chính đáng để làm điều gì đó, tin vào điều gì đó hoặc đồng ý với điều gì đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "without making something seem better, worse, more serious, etc. than it really is",
                    "vi": "mà không làm cho điều gì đó có vẻ tốt hơn, tồi tệ hơn, nghiêm trọng hơn, v.v. so với thực tế"
                },
                "examples": [
                    {
                        "en": "I was surprised, to say the least.",
                        "vi": "Tôi đã rất ngạc nhiên, phải nói là ít nhất."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to introduce a further fact or thing in addition to those already mentioned",
                    "vi": "được sử dụng để giới thiệu một sự kiện hoặc điều khác ngoài những điều đã được đề cập"
                },
                "examples": [
                    {
                        "en": "It was too expensive, to say nothing of the time it wasted.",
                        "vi": "Nó quá đắt, không nói gì đến thời gian mà nó đã lãng phí."
                    }
                ]
            },
            {
                "define": {
                    "en": "I agree completely",
                    "vi": "Tôi hoàn toàn đồng ý"
                },
                "examples": [
                    {
                        "en": "‘We must stand up for ourselves.’ ‘Well said, John.’",
                        "vi": "Chúng ta phải tự đứng lên.' \"Nói hay đấy, John.\""
                    }
                ]
            },
            {
                "define": {
                    "en": "would you like something/to do something?",
                    "vi": "bạn có muốn một cái gì đó / để làm một cái gì đó?"
                },
                "examples": [
                    {
                        "en": "What would you say to eating out tonight?",
                        "vi": "Bạn sẽ nói gì khi đi ăn tối nay?"
                    },
                    {
                        "en": "Let's go away for a weekend. What do you say?",
                        "vi": "Cuối tuần đi chơi xa nhé. bạn nói gì?"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to agree to somebody’s suggestion because you do not want to argue",
                    "vi": "từng đồng ý với đề nghị của ai đó vì bạn không muốn tranh luận"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a particular person must be obeyed",
                    "vi": "một người cụ thể phải được tuân theo"
                },
                "examples": [
                    {
                        "en": "Sarah wanted the kitchen painted green, and what she says, goes.",
                        "vi": "Sarah muốn nhà bếp sơn màu xanh lá cây, và những gì cô ấy nói, sẽ đi."
                    }
                ]
            },
            {
                "define": {
                    "en": "when everything is considered",
                    "vi": "khi mọi thứ được xem xét"
                },
                "examples": [
                    {
                        "en": "I know you're upset, but when all's said and done it isn't exactly a disaster.",
                        "vi": "Tôi biết bạn đang buồn, nhưng khi tất cả đã nói và làm thì đó không hẳn là một thảm họa."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that nobody knows the answer to a question",
                    "vi": "thường nói rằng không ai biết câu trả lời cho một câu hỏi"
                },
                "examples": [
                    {
                        "en": "Who can say what will happen next year?",
                        "vi": "Ai có thể nói điều gì sẽ xảy ra trong năm tới?"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to disagree with a statement or an opinion",
                    "vi": "từng không đồng ý với một tuyên bố hoặc một ý kiến"
                },
                "examples": [
                    {
                        "en": "Who says I can't do it?",
                        "vi": "Ai nói rằng tôi không thể làm điều đó?"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that something might happen or might have happened in a particular way, because nobody really knows",
                    "vi": "được sử dụng để nói rằng điều gì đó có thể xảy ra hoặc có thể đã xảy ra theo một cách cụ thể, bởi vì không ai thực sự biết"
                },
                "examples": [
                    {
                        "en": "Who's to say we would not have succeeded if we'd had more time?",
                        "vi": "Ai nói rằng chúng ta sẽ không thành công nếu chúng ta có thêm thời gian?"
                    }
                ]
            },
            {
                "define": {
                    "en": "I agree with you completely",
                    "vi": "tôi hoàn toàn đồng ý với bạn"
                },
                "examples": [
                    {
                        "en": "‘He's in a bad mood today.’ ‘You can say that again!’",
                        "vi": "Hôm nay anh ấy có tâm trạng tồi tệ.' 'Bạn có thể nói điều đó một lần nữa!'"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that you think the offer you are making is reasonable or generous",
                    "vi": "được sử dụng để nói rằng bạn nghĩ rằng đề nghị bạn đang đưa ra là hợp lý hoặc hào phóng"
                },
                "examples": [
                    {
                        "en": "Look, I'll give you £100 for it. You can't say fairer than that.",
                        "vi": "Nghe này, tôi sẽ đưa cho bạn 100 bảng cho nó. Bạn không thể nói công bằng hơn thế."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to express surprise",
                    "vi": "được sử dụng để bày tỏ sự ngạc nhiên"
                },
                "examples": [
                    {
                        "en": "‘They left without us.’ ‘You don't say!’ (= I'm not surprised)",
                        "vi": "Họ rời đi mà không có chúng tôi. 'Bạn không nói!' (= Tôi không ngạc nhiên)"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to agree with somebody when they say something about themselves that you would not have been rude enough to say yourself",
                    "vi": "từng đồng ý với ai đó khi họ nói điều gì đó về bản thân mà bạn sẽ không đến mức thô lỗ khi nói về chính mình"
                },
                "examples": [
                    {
                        "en": "‘I know I'm not the world's greatest cook.’ ‘You said it!’",
                        "vi": "Tôi biết mình không phải là đầu bếp giỏi nhất thế giới.' 'Bạn đã nói như thế!'"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to agree with somebody’s suggestion",
                    "vi": "đã từng đồng ý với đề nghị của ai đó"
                },
                "examples": []
            }
        ]
    }
]