[
    {
        "id": "8cd6d593a750491eb4c384750f8a8ba8",
        "word": "poor",
        "pos": "adjective",
        "level": "a1",
        "phonetic": {
            "uk": "/pɔː(r)/",
            "us": "/pʊr/"
        },
        "nearby": [
            {
                "word": "pooper scooper",
                "pos": "noun"
            },
            {
                "word": "poop out",
                "pos": "phrasal verb"
            },
            {
                "word": "poor",
                "pos": "adjective"
            },
            {
                "word": "poorhouse",
                "pos": "noun"
            },
            {
                "word": "the Poor Law",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "having very little money; not having enough money for basic needs",
                    "vi": "có rất ít tiền; không có đủ tiền cho các nhu cầu cơ bản"
                },
                "examples": [
                    {
                        "en": "They were too poor to buy shoes for the kids.",
                        "vi": "Họ quá nghèo để mua giày cho bọn trẻ."
                    },
                    {
                        "en": "We aim to help the poorest families.",
                        "vi": "Chúng tôi mong muốn giúp đỡ những gia đình nghèo nhất."
                    },
                    {
                        "en": "It's among the poorer countries of the world.",
                        "vi": "Đó là một trong những quốc gia nghèo hơn trên thế giới."
                    },
                    {
                        "en": "This is a relatively poor neighbourhood.",
                        "vi": "Đây là một khu phố tương đối nghèo."
                    },
                    {
                        "en": "Andrew grew up desperately poor.",
                        "vi": "Andrew lớn lên trong nghèo khó một cách tuyệt vọng."
                    },
                    {
                        "en": "They were so poor that they couldn't afford to feed their family.",
                        "vi": "Họ nghèo đến nỗi không đủ tiền nuôi gia đình."
                    }
                ]
            },
            {
                "define": {
                    "en": "people who have very little money",
                    "vi": "những người có rất ít tiền"
                },
                "examples": [
                    {
                        "en": "They provided food and shelter for the poor.",
                        "vi": "Họ cung cấp thức ăn và chỗ ở cho người nghèo."
                    }
                ]
            },
            {
                "define": {
                    "en": "deserving sympathy",
                    "vi": "đáng được thông cảm"
                },
                "examples": [
                    {
                        "en": "Have you heard about poor old Harry? His wife's left him.",
                        "vi": "Bạn đã nghe về Harry già tội nghiệp chưa? Vợ anh đã bỏ anh."
                    },
                    {
                        "en": "It's hungry—the poor little thing.",
                        "vi": "Nó đói - một điều nhỏ bé tội nghiệp."
                    },
                    {
                        "en": "‘I have stacks of homework to do.’ ‘Oh, you poor thing.’",
                        "vi": "Tôi có một đống bài tập về nhà phải làm.' 'Oh bạn điều người nghèo.'"
                    },
                    {
                        "en": "Some poor soul will have to clean the house after the party.",
                        "vi": "Một linh hồn tội nghiệp nào đó sẽ phải dọn dẹp nhà cửa sau bữa tiệc."
                    }
                ]
            },
            {
                "define": {
                    "en": "not good; of a quality that is low or lower than expected",
                    "vi": "không tốt; có chất lượng thấp hoặc thấp hơn mong đợi"
                },
                "examples": [
                    {
                        "en": "the party’s poor performance in the election",
                        "vi": "thành tích kém của đảng trong cuộc bầu cử"
                    },
                    {
                        "en": "The food was of very poor quality.",
                        "vi": "Thức ăn có chất lượng rất kém."
                    },
                    {
                        "en": "She's been in poor health for some time now.",
                        "vi": "Cô ấy có sức khỏe kém một thời gian rồi."
                    },
                    {
                        "en": "The cottage was in poor physical condition.",
                        "vi": "Ngôi nhà tranh trong tình trạng vật chất tồi tệ."
                    },
                    {
                        "en": "It was raining heavily and visibility was poor.",
                        "vi": "Trời mưa to và tầm nhìn kém."
                    },
                    {
                        "en": "poor food/light/soil",
                        "vi": "thức ăn nghèo nàn / ánh sáng / đất"
                    },
                    {
                        "en": "to have a poor opinion of somebody (= to not think well of somebody)",
                        "vi": "có ý kiến không tốt về ai đó (= không nghĩ tốt về ai đó)"
                    }
                ]
            },
            {
                "define": {
                    "en": "not good at something",
                    "vi": "không giỏi một cái gì đó"
                },
                "examples": [
                    {
                        "en": "a poor swimmer",
                        "vi": "một vận động viên bơi lội kém"
                    },
                    {
                        "en": "a poor judge of character",
                        "vi": "một thẩm phán kém về tính cách"
                    },
                    {
                        "en": "She's a good teacher but a poor manager.",
                        "vi": "Cô ấy là một giáo viên giỏi nhưng là một người quản lý kém."
                    },
                    {
                        "en": "a poor sailor (= somebody who easily gets sick at sea)",
                        "vi": "một thủy thủ nghèo (= ai đó dễ bị ốm trên biển)"
                    },
                    {
                        "en": "poor at (doing) something Many companies are poor at dealing with telephone complaints.",
                        "vi": "kém trong (làm) việc gì đó Nhiều công ty kém trong việc giải quyết các khiếu nại qua điện thoại."
                    }
                ]
            },
            {
                "define": {
                    "en": "having very small amounts of something",
                    "vi": "có một số lượng rất nhỏ của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "a country poor in natural resources",
                        "vi": "một đất nước nghèo tài nguyên thiên nhiên"
                    },
                    {
                        "en": "soil poor in nutrients",
                        "vi": "đất nghèo dinh dưỡng"
                    },
                    {
                        "en": "There's very little soil here and it's poor in quality.",
                        "vi": "Ở đây có rất ít đất và chất lượng kém."
                    }
                ]
            },
            {
                "define": {
                    "en": "to finish a long way behind the winner in a race, competition, etc.",
                    "vi": "để hoàn thành một chặng đường dài phía sau người chiến thắng trong một cuộc đua, cuộc thi, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a person or thing that is similar to but of a lower quality than a particular famous person or thing",
                    "vi": "người hoặc vật tương tự nhưng chất lượng thấp hơn người hoặc vật nổi tiếng cụ thể"
                },
                "examples": [
                    {
                        "en": "Sparkling white wine is the poor man's champagne.",
                        "vi": "Rượu vang trắng sủi bọt là sâm panh của người nghèo."
                    }
                ]
            }
        ]
    },
    {
        "id": "b2199e62692548d398423f912a890e3c",
        "word": "rich",
        "pos": "adjective",
        "level": "a1",
        "phonetic": {
            "uk": "/rɪtʃ/",
            "us": "/rɪtʃ/"
        },
        "nearby": [
            {
                "word": "rice paper",
                "pos": "noun"
            },
            {
                "word": "rice pudding",
                "pos": "noun"
            },
            {
                "word": "rich",
                "pos": "adjective"
            },
            {
                "word": "Richard",
                "pos": ""
            },
            {
                "word": "Richard I",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "having a lot of money or property",
                    "vi": "có nhiều tiền hoặc tài sản"
                },
                "examples": [
                    {
                        "en": "She's one of the richest women in the world.",
                        "vi": "Cô ấy là một trong những phụ nữ giàu nhất thế giới."
                    },
                    {
                        "en": "to get/grow/become rich",
                        "vi": "để có được / phát triển / trở nên giàu có"
                    },
                    {
                        "en": "Nobody gets rich from writing nowadays.",
                        "vi": "Ngày nay không ai giàu lên từ việc viết lách."
                    },
                    {
                        "en": "She longed to be rich and famous.",
                        "vi": "Cô khao khát được giàu có và nổi tiếng."
                    },
                    {
                        "en": "He was born in a rich and powerful family.",
                        "vi": "Anh sinh ra trong một gia đình giàu có và quyền lực."
                    },
                    {
                        "en": "(slang) to be filthy/stinking (= extremely) rich",
                        "vi": "(tiếng lóng) bẩn thỉu / hôi thối (= cực kỳ) giàu có"
                    }
                ]
            },
            {
                "define": {
                    "en": "people who have a lot of money or property",
                    "vi": "những người có nhiều tiền hoặc tài sản"
                },
                "examples": [
                    {
                        "en": "It's a favourite resort for the rich and famous.",
                        "vi": "Đó là một khu nghỉ mát yêu thích của những người giàu có và nổi tiếng."
                    }
                ]
            },
            {
                "define": {
                    "en": "producing a lot of wealth so that many of its people can live at a high standard",
                    "vi": "sản xuất nhiều của cải để nhiều người trong số họ có thể sống với mức tiêu chuẩn cao"
                },
                "examples": [
                    {
                        "en": "the richest countries/economies/nations",
                        "vi": "các quốc gia / nền kinh tế / quốc gia giàu nhất"
                    }
                ]
            },
            {
                "define": {
                    "en": "containing or providing a large supply of something",
                    "vi": "chứa hoặc cung cấp một lượng lớn thứ gì đó"
                },
                "examples": [
                    {
                        "en": "rich in something Oranges are rich in vitamin C.",
                        "vi": "giàu chất gì Cam rất giàu vitamin C."
                    },
                    {
                        "en": "The area is rich in wildlife.",
                        "vi": "Khu vực này có nhiều động vật hoang dã."
                    },
                    {
                        "en": "Russia is hugely rich in oil and gas.",
                        "vi": "Nga vô cùng giàu có về dầu khí."
                    },
                    {
                        "en": "The animation is amazingly rich in detail.",
                        "vi": "Hình ảnh động giàu chi tiết một cách đáng kinh ngạc."
                    },
                    {
                        "en": "The country is rich in natural resources.",
                        "vi": "Đất nước giàu tài nguyên thiên nhiên."
                    },
                    {
                        "en": "His novels are a rich source of material for the movie industry.",
                        "vi": "Tiểu thuyết của ông là nguồn tư liệu dồi dào cho ngành điện ảnh."
                    },
                    {
                        "en": "iron-rich rocks",
                        "vi": "đá giàu sắt"
                    },
                    {
                        "en": "the exceptionally rich fishing grounds of the North Pacific",
                        "vi": "các ngư trường đặc biệt phong phú của Bắc Thái Bình Dương"
                    },
                    {
                        "en": "(figurative) Several major US companies have set up in the country in order to tap into the rich vein of talent available.",
                        "vi": "(nghĩa bóng) Một số công ty lớn của Hoa Kỳ đã thành lập ở nước này để khai thác nguồn nhân tài dồi dào sẵn có."
                    },
                    {
                        "en": "Ours is a world rich with possibilities.",
                        "vi": "Của chúng ta là một thế giới phong phú với các khả năng."
                    }
                ]
            },
            {
                "define": {
                    "en": "very interesting and full of variety",
                    "vi": "rất thú vị và đa dạng"
                },
                "examples": [
                    {
                        "en": "the region’s rich history and culture",
                        "vi": "lịch sử và văn hóa phong phú của khu vực"
                    },
                    {
                        "en": "She leads a rich and varied life.",
                        "vi": "Cô ấy có một cuộc sống phong phú và đa dạng."
                    },
                    {
                        "en": "a culturally rich nation",
                        "vi": "một quốc gia giàu văn hóa"
                    },
                    {
                        "en": "the rich architectural heritage of India",
                        "vi": "di sản kiến trúc phong phú của Ấn Độ"
                    },
                    {
                        "en": "This story emphasizes the rich African tradition of oral history.",
                        "vi": "Câu chuyện này nhấn mạnh truyền thống lịch sử truyền miệng phong phú của châu Phi."
                    }
                ]
            },
            {
                "define": {
                    "en": "containing a lot of fat, butter, eggs, etc. and making you feel full quickly",
                    "vi": "chứa nhiều chất béo, bơ, trứng,… và khiến bạn nhanh no"
                },
                "examples": [
                    {
                        "en": "a rich, creamy sauce",
                        "vi": "nước sốt kem béo ngậy"
                    },
                    {
                        "en": "a rich chocolate cake",
                        "vi": "một chiếc bánh sô cô la phong phú"
                    },
                    {
                        "en": "The chocolate orange fondant was too rich for me.",
                        "vi": "Kẹo mềm màu cam sô cô la quá béo đối với tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "containing the substances that make it good for growing plants in",
                    "vi": "chứa các chất tốt cho sự phát triển của cây trồng trong"
                },
                "examples": [
                    {
                        "en": "a rich, well-drained soil",
                        "vi": "đất giàu dinh dưỡng, thoát nước tốt"
                    },
                    {
                        "en": "rich farming land",
                        "vi": "đất canh tác trù phú"
                    }
                ]
            },
            {
                "define": {
                    "en": "strong or deep; very beautiful or attractive",
                    "vi": "mạnh mẽ hoặc sâu sắc; rất đẹp hoặc hấp dẫn"
                },
                "examples": [
                    {
                        "en": "rich dark reds",
                        "vi": "màu đỏ đậm phong phú"
                    },
                    {
                        "en": "the rich sound of the organ",
                        "vi": "âm thanh phong phú của đàn organ"
                    },
                    {
                        "en": "The wine gives the dish a wonderfully rich aroma.",
                        "vi": "Rượu mang đến cho món ăn một hương thơm đậm đà tuyệt vời."
                    }
                ]
            },
            {
                "define": {
                    "en": "expensive and beautiful",
                    "vi": "đắt và đẹp"
                },
                "examples": [
                    {
                        "en": "The rooms were decorated with rich fabrics.",
                        "vi": "Các phòng được trang trí bằng các loại vải phong phú."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that a criticism somebody makes is surprising and not reasonable, because they have the same fault",
                    "vi": "được sử dụng để nói rằng một lời chỉ trích ai đó đưa ra là đáng ngạc nhiên và không hợp lý, bởi vì họ có cùng một lỗi"
                },
                "examples": [
                    {
                        "en": "Me? Lazy? That's rich, coming from you!",
                        "vi": "Tôi? Lười biếng? Đó là sự giàu có, đến từ bạn!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to get a lot of money, especially suddenly or unexpectedly",
                    "vi": "để nhận được nhiều tiền, đặc biệt là đột ngột hoặc bất ngờ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "28f7096a09024ee488896850f2f18436",
        "word": "boss",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/bɒs/",
            "us": "/bɔːs/"
        },
        "nearby": [
            {
                "word": "bosom friend",
                "pos": "noun"
            },
            {
                "word": "bosomy",
                "pos": "adjective"
            },
            {
                "word": "boss",
                "pos": "noun"
            },
            {
                "word": "boss",
                "pos": "verb"
            },
            {
                "word": "boss",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who is in charge of other people at work and tells them what to do",
                    "vi": "một người phụ trách những người khác tại nơi làm việc và chỉ dẫn họ phải làm gì"
                },
                "examples": [
                    {
                        "en": "I'll ask my boss if I can have the day off.",
                        "vi": "Tôi sẽ hỏi sếp xem liệu tôi có thể có ngày nghỉ không."
                    },
                    {
                        "en": "I like being my own boss (= working for myself and making my own decisions).",
                        "vi": "Tôi thích làm ông chủ của chính mình (= làm việc cho bản thân và đưa ra quyết định của riêng tôi)."
                    },
                    {
                        "en": "Who's the boss (= who's in control) in this house?",
                        "vi": "Ai là ông chủ (= người nắm quyền điều hành) trong ngôi nhà này?"
                    },
                    {
                        "en": "He thinks he's impressing the boss by working through lunch.",
                        "vi": "Anh ấy nghĩ rằng anh ấy đang gây ấn tượng với ông chủ bằng cách làm việc suốt bữa trưa."
                    },
                    {
                        "en": "He accused his former boss of being arrogant.",
                        "vi": "Anh ta buộc tội ông chủ cũ của mình là người kiêu ngạo."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who is in charge of a large organization",
                    "vi": "một người phụ trách một tổ chức lớn"
                },
                "examples": [
                    {
                        "en": "the new boss at IBM",
                        "vi": "ông chủ mới tại IBM"
                    },
                    {
                        "en": "Hospital bosses protested at the decision.",
                        "vi": "Các ông chủ bệnh viện phản đối quyết định này."
                    },
                    {
                        "en": "Council bosses have agreed to meet a handful of homeowners today.",
                        "vi": "Các ông chủ của hội đồng đã đồng ý gặp một số ít chủ nhà ngày hôm nay."
                    },
                    {
                        "en": "He's a notorious crime boss.",
                        "vi": "Anh ta là một tên trùm tội phạm khét tiếng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make it clear to somebody that you have more power and authority than they have",
                    "vi": "để nói rõ với ai đó rằng bạn có nhiều quyền lực và thẩm quyền hơn họ có"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "21e176b8f7124c6984e9d450873fb225",
        "word": "head",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/hed/",
            "us": "/hed/"
        },
        "nearby": [
            {
                "word": "he",
                "pos": "noun"
            },
            {
                "word": "HE",
                "pos": "abbreviation"
            },
            {
                "word": "head",
                "pos": "noun"
            },
            {
                "word": "-head",
                "pos": "suffix"
            },
            {
                "word": "head",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the part of the body on top of the neck containing the eyes, nose, mouth and brain",
                    "vi": "phần cơ thể trên cổ có chứa mắt, mũi, miệng và não"
                },
                "examples": [
                    {
                        "en": "She nodded her head in agreement.",
                        "vi": "Cô gật đầu đồng ý."
                    },
                    {
                        "en": "He shook his head in disbelief.",
                        "vi": "Anh lắc đầu không tin."
                    },
                    {
                        "en": "The boys hung their heads in shame.",
                        "vi": "Các chàng trai gục đầu xấu hổ."
                    },
                    {
                        "en": "She turned her head to look at him.",
                        "vi": "Cô quay đầu nhìn anh."
                    },
                    {
                        "en": "They bowed their heads in prayer.",
                        "vi": "Họ cúi đầu cầu nguyện."
                    },
                    {
                        "en": "She tilted her head back and closed her eyes.",
                        "vi": "Cô ấy ngửa đầu ra sau và nhắm mắt lại."
                    },
                    {
                        "en": "to raise/lift/lower your head",
                        "vi": "nâng / nâng / hạ đầu của bạn"
                    },
                    {
                        "en": "He was shot in the head and died ten minutes later.",
                        "vi": "Anh ta bị bắn vào đầu và chết sau đó mười phút."
                    },
                    {
                        "en": "The driver suffered head injuries.",
                        "vi": "Tài xế bị thương ở đầu."
                    },
                    {
                        "en": "He still has a good head of hair (= a lot of hair).",
                        "vi": "Anh ấy vẫn còn đầu tóc tốt (= rất nhiều tóc)."
                    }
                ]
            },
            {
                "define": {
                    "en": "the mind or brain",
                    "vi": "tâm trí hoặc bộ não"
                },
                "examples": [
                    {
                        "en": "I sometimes wonder what goes on in that head of yours.",
                        "vi": "Đôi khi tôi tự hỏi điều gì đang xảy ra trong đầu của bạn."
                    },
                    {
                        "en": "I wish you'd use your head (= think carefully before doing or saying something).",
                        "vi": "Tôi ước bạn sử dụng cái đầu của mình (= suy nghĩ cẩn thận trước khi làm hoặc nói điều gì đó)."
                    },
                    {
                        "en": "The thought never entered my head.",
                        "vi": "Ý nghĩ chưa bao giờ lọt vào đầu tôi."
                    },
                    {
                        "en": "His head was spinning (= he felt dizzy or confused) after only one drink.",
                        "vi": "Đầu anh ấy quay cuồng (= anh ấy cảm thấy chóng mặt hoặc bối rối) chỉ sau một lần uống rượu."
                    },
                    {
                        "en": "in somebody's head I can't work it out in my head—I need a calculator.",
                        "vi": "trong đầu của ai đó, tôi không thể tìm ra nó trong đầu - tôi cần một chiếc máy tính."
                    },
                    {
                        "en": "She started hearing voices in her head.",
                        "vi": "Cô ấy bắt đầu nghe thấy những giọng nói trong đầu mình."
                    },
                    {
                        "en": "into somebody's head Who's been putting such weird ideas into your head (= making you believe that)?",
                        "vi": "vào đầu ai đó Ai đã đưa những ý tưởng kỳ quặc như vậy vào đầu bạn (= khiến bạn tin điều đó)?"
                    },
                    {
                        "en": "out of somebody's head I can't get that tune out of my head.",
                        "vi": "ra khỏi đầu ai đó Tôi không thể lấy giai điệu đó ra khỏi đầu mình."
                    },
                    {
                        "en": "Try to put the exams out of your head (= stop thinking about them).",
                        "vi": "Cố gắng gạt các bài kiểm tra ra khỏi đầu bạn (= ngừng nghĩ về chúng)."
                    }
                ]
            },
            {
                "define": {
                    "en": "the size of a person’s or animal’s head, used as a measurement of distance or height",
                    "vi": "kích thước của đầu người hoặc động vật, được sử dụng để đo khoảng cách hoặc chiều cao"
                },
                "examples": [
                    {
                        "en": "She's a good head taller than her sister.",
                        "vi": "Cô ấy cao hơn em gái mình một cái đầu."
                    },
                    {
                        "en": "The favourite won by a short head (= a distance slightly less than the length of a horse's head).",
                        "vi": "Con thích thắng bằng cái đầu ngắn (= một khoảng cách nhỏ hơn một chút so với chiều dài của đầu con ngựa)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a continuous pain in your head",
                    "vi": "một cơn đau liên tục trong đầu của bạn"
                },
                "examples": [
                    {
                        "en": "I woke up with a really bad head this morning.",
                        "vi": "Tôi thức dậy với một cái đầu thật tồi tệ vào sáng nay."
                    }
                ]
            },
            {
                "define": {
                    "en": "the person in charge of a group of people or an organization",
                    "vi": "người phụ trách một nhóm người hoặc một tổ chức"
                },
                "examples": [
                    {
                        "en": "head of something the heads of government/state",
                        "vi": "người đứng đầu một cái gì đó những người đứng đầu chính phủ / nhà nước"
                    },
                    {
                        "en": "She resigned as head of department.",
                        "vi": "Cô từ chức trưởng phòng."
                    },
                    {
                        "en": "I've asked the department head for an appointment.",
                        "vi": "Tôi đã yêu cầu trưởng bộ phận cho một cuộc hẹn."
                    },
                    {
                        "en": "a former head of the Hong Kong Stock Exchange",
                        "vi": "một cựu lãnh đạo của Sở giao dịch chứng khoán Hồng Kông"
                    },
                    {
                        "en": "He is deputy head of the National Railway Museum.",
                        "vi": "Ông là Phó giám đốc Bảo tàng Đường sắt Quốc gia."
                    },
                    {
                        "en": "the crowned heads (= the kings and queens) of Europe",
                        "vi": "những người đứng đầu được trao vương miện (= các vị vua và nữ hoàng) của Châu Âu"
                    },
                    {
                        "en": "I was head coach of a Little League basketball team in Pittsburgh.",
                        "vi": "Tôi là huấn luyện viên trưởng của một đội bóng rổ Little League ở Pittsburgh."
                    },
                    {
                        "en": "the head gardener/chef/waiter",
                        "vi": "người làm vườn / đầu bếp / bồi bàn"
                    }
                ]
            },
            {
                "define": {
                    "en": "the person in charge of a school or college",
                    "vi": "người phụ trách một trường học hoặc cao đẳng"
                },
                "examples": [
                    {
                        "en": "I've been called in to see the Head.",
                        "vi": "Tôi đã được gọi đến để gặp Thủ trưởng."
                    },
                    {
                        "en": "the deputy head",
                        "vi": "phó trưởng phòng"
                    }
                ]
            },
            {
                "define": {
                    "en": "the side of a coin that has a picture of the head of a person on it, used as one choice when a coin is tossed to decide something",
                    "vi": "mặt của đồng xu có hình ảnh đầu của một người trên đó, được sử dụng như một sự lựa chọn khi tung đồng xu để quyết định điều gì đó"
                },
                "examples": [
                    {
                        "en": "I called heads and it came down tails.",
                        "vi": "Tôi gọi đầu và nó rơi xuống đuôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "the end of a long narrow object that is larger or wider than the rest of it",
                    "vi": "phần cuối của một vật dài hẹp lớn hơn hoặc rộng hơn phần còn lại của nó"
                },
                "examples": [
                    {
                        "en": "the head of a nail",
                        "vi": "đầu đinh"
                    }
                ]
            },
            {
                "define": {
                    "en": "the top or highest part of something",
                    "vi": "phần trên cùng hoặc phần cao nhất của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "at the head of the page",
                        "vi": "ở đầu trang"
                    },
                    {
                        "en": "They finished the season at the head of their league.",
                        "vi": "Họ đã kết thúc mùa giải ở vị trí dẫn đầu giải đấu của họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "the place where a river begins",
                    "vi": "nơi bắt đầu của một con sông"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the most important seat at a table",
                    "vi": "chỗ ngồi quan trọng nhất trên bàn"
                },
                "examples": [
                    {
                        "en": "The President sat at the head of the table.",
                        "vi": "Chủ tịch nước ngồi đầu bàn."
                    }
                ]
            },
            {
                "define": {
                    "en": "the position at the front of a line of people",
                    "vi": "vị trí ở phía trước của một dòng người"
                },
                "examples": [
                    {
                        "en": "The prince rode at the head of his regiment.",
                        "vi": "Hoàng tử cưỡi trên đầu trung đoàn của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "the mass of leaves or flowers at the end of a stem",
                    "vi": "khối lượng của lá hoặc hoa ở cuối thân cây"
                },
                "examples": [
                    {
                        "en": "Remove the dead heads to encourage new growth.",
                        "vi": "Loại bỏ những phần đầu chết để khuyến khích sự phát triển mới."
                    }
                ]
            },
            {
                "define": {
                    "en": "the mass of small bubbles on the top of a glass of beer",
                    "vi": "một khối lượng bọt nhỏ trên đầu của một cốc bia"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the part of a spot on your skin that contains a thick yellow liquid (= pus)",
                    "vi": "phần trên da của bạn có chứa chất lỏng màu vàng đặc (= mủ)"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the component of a sound or video recording system that converts data on the disk or tape into digital electronic data (and the other way round)",
                    "vi": "thành phần của hệ thống ghi âm thanh hoặc video chuyển đổi dữ liệu trên đĩa hoặc băng thành dữ liệu điện tử kỹ thuật số (và ngược lại)"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to say how many animals of a particular type are on a farm, in a herd, etc.",
                    "vi": "được sử dụng để nói có bao nhiêu động vật của một loại cụ thể ở trong một trang trại, trong một đàn, v.v."
                },
                "examples": [
                    {
                        "en": "200 head of sheep",
                        "vi": "200 đầu cừu"
                    }
                ]
            },
            {
                "define": {
                    "en": "the pressure produced by steam in a small space",
                    "vi": "áp suất do hơi nước tạo ra trong một không gian nhỏ"
                },
                "examples": [
                    {
                        "en": "The old engine still manages to build up a good head of steam.",
                        "vi": "Động cơ cũ vẫn tạo ra một đầu hơi tốt."
                    }
                ]
            },
            {
                "define": {
                    "en": "oral sex (= using the mouth to give somebody sexual pleasure)",
                    "vi": "quan hệ tình dục bằng miệng (= dùng miệng để mang lại khoái cảm tình dục cho ai đó)"
                },
                "examples": [
                    {
                        "en": "to give head",
                        "vi": "đưa ra cái đầu"
                    }
                ]
            },
            {
                "define": {
                    "en": "the central part of a phrase, which has the same grammatical function as the whole phrase. In the phrase ‘the tall man in a suit’, man is the head.",
                    "vi": "phần trung tâm của cụm từ, có chức năng ngữ pháp giống như toàn bộ cụm từ. Trong cụm từ 'the high man in a suit', người đàn ông là người đứng đầu."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to force people to stop arguing and behave in a sensible way",
                    "vi": "buộc mọi người ngừng tranh cãi và cư xử một cách hợp lý"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to keep trying to do something that will never be successful",
                    "vi": "tiếp tục cố gắng làm điều gì đó sẽ không bao giờ thành công"
                },
                "examples": [
                    {
                        "en": "Trying to reason with them was like banging my head against a brick wall.",
                        "vi": "Cố gắng lý luận với họ giống như đập đầu tôi vào tường gạch."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be much better than other people or things",
                    "vi": "tốt hơn nhiều so với những người khác hoặc những thứ khác"
                },
                "examples": [
                    {
                        "en": "His performance stood head and shoulders above the rest.",
                        "vi": "Màn trình diễn của anh ấy đứng đầu và vai trên phần còn lại."
                    }
                ]
            },
            {
                "define": {
                    "en": "to shout at somebody in an angry way, especially without reason",
                    "vi": "hét vào mặt ai đó một cách tức giận, đặc biệt là không có lý do"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "if you bring a situation to a head or if a situation comes to a head, you are forced to deal with it quickly because it suddenly becomes very bad",
                    "vi": "nếu bạn đưa một tình huống lên đầu hoặc nếu một tình huống xảy ra đối đầu, bạn buộc phải giải quyết nó nhanh chóng vì nó đột nhiên trở nên rất tồi tệ"
                },
                "examples": [
                    {
                        "en": "The chairman's resignation finally brought matters to a head.",
                        "vi": "Việc từ chức của chủ tịch cuối cùng đã khiến vấn đề trở nên nhức nhối."
                    },
                    {
                        "en": "The dispute finally came to a head in March that year.",
                        "vi": "Cuối cùng, tranh chấp đã đi đến hồi kết vào tháng 3 năm đó."
                    },
                    {
                        "en": "Things came to a head when several of the nurses made a formal complaint.",
                        "vi": "Mọi việc trở nên căng thẳng khi một số y tá đưa ra đơn khiếu nại chính thức."
                    }
                ]
            },
            {
                "define": {
                    "en": "to refuse to admit that a problem exists or refuse to deal with it",
                    "vi": "từ chối thừa nhận rằng một vấn đề tồn tại hoặc từ chối giải quyết nó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be unable to understand something",
                    "vi": "không thể hiểu điều gì đó"
                },
                "examples": [
                    {
                        "en": "I couldn't make head nor tail of what he was saying.",
                        "vi": "Tôi không thể hiểu rõ anh ta đang nói gì."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody feel confused, upset and/or annoyed",
                    "vi": "làm cho ai đó cảm thấy bối rối, khó chịu và / hoặc khó chịu"
                },
                "examples": [
                    {
                        "en": "Shut up! You're doing my head in.",
                        "vi": "Câm miệng! Bạn đang đâm đầu vào của tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be able to do something very easily and without having to think too much",
                    "vi": "để có thể làm điều gì đó rất dễ dàng và không cần phải suy nghĩ quá nhiều"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to make somebody remember something by repeating it a lot of times",
                    "vi": "để làm cho ai đó nhớ điều gì đó bằng cách lặp lại nó nhiều lần"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "covering your whole body",
                    "vi": "che toàn bộ cơ thể của bạn"
                },
                "examples": [
                    {
                        "en": "We were covered from head to foot in mud.",
                        "vi": "Chúng tôi ngập từ đầu đến chân trong bùn."
                    },
                    {
                        "en": "She was dressed from head to toe in red.",
                        "vi": "Cô ấy mặc đồ đỏ từ đầu đến chân."
                    }
                ]
            },
            {
                "define": {
                    "en": "to sleep",
                    "vi": "ngủ"
                },
                "examples": [
                    {
                        "en": "I managed to get my head down for an hour.",
                        "vi": "Tôi cố gắng để có được đầu của tôi trong một giờ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to avoid attracting attention to yourself",
                    "vi": "để tránh thu hút sự chú ý vào bản thân"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be able to understand or accept something",
                    "vi": "để có thể hiểu hoặc chấp nhận điều gì đó"
                },
                "examples": [
                    {
                        "en": "She's dead. I can't get my head round it yet.",
                        "vi": "Cô ấy chết rồi. Tôi vẫn chưa thể quay đầu lại."
                    }
                ]
            },
            {
                "define": {
                    "en": "to start to understand or think something",
                    "vi": "để bắt đầu hiểu hoặc suy nghĩ điều gì đó"
                },
                "examples": [
                    {
                        "en": "When will you get it into your head that I don't want to discuss this any more!",
                        "vi": "Khi nào bạn sẽ hiểu nó vào đầu mà tôi không muốn thảo luận thêm về điều này nữa!"
                    },
                    {
                        "en": "For some reason she's got it into her head that I don't like her.",
                        "vi": "Vì lý do nào đó mà cô ấy nghĩ rằng tôi không thích cô ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to allow somebody to do what they want without trying to stop them",
                    "vi": "để cho phép ai đó làm những gì họ muốn mà không cố gắng ngăn cản họ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to give somebody hopes about something that may not be possible or likely; to make somebody act or think in an unreasonable way",
                    "vi": "để cung cấp cho ai đó hy vọng về một cái gì đó có thể không khả thi hoặc có thể xảy ra; khiến ai đó hành động hoặc suy nghĩ theo cách không hợp lý"
                },
                "examples": [
                    {
                        "en": "Who's been putting ideas into his head?",
                        "vi": "Ai đang đưa ý tưởng vào đầu anh ấy?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to deal with somebody in a very direct and determined way",
                    "vi": "để đối phó với ai đó một cách rất trực tiếp và kiên quyết"
                },
                "examples": [
                    {
                        "en": "The company will be going head to head with the giant of the pharmaceuticals market.",
                        "vi": "Công ty sẽ đối đầu với gã khổng lồ của thị trường dược phẩm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make you feel drunk",
                    "vi": "làm cho bạn cảm thấy say"
                },
                "examples": [
                    {
                        "en": "That glass of wine has gone straight to my head.",
                        "vi": "Ly rượu đó đã xộc thẳng vào đầu tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make you feel too proud of yourself in a way that other people find annoying",
                    "vi": "khiến bạn cảm thấy quá tự hào về bản thân theo cách mà người khác cảm thấy phiền phức"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be aware of everything that is happening around you, even things that seem difficult or impossible to see",
                    "vi": "nhận thức được mọi thứ đang xảy ra xung quanh bạn, ngay cả những điều có vẻ khó hoặc không thể nhìn thấy"
                },
                "examples": [
                    {
                        "en": "You can’t get away with anything in her class. She has eyes in the back of her head.",
                        "vi": "Bạn không thể thoát khỏi bất cứ thứ gì trong lớp của cô ấy. Cô ấy có đôi mắt ở phía sau đầu."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be a sensible person",
                    "vi": "trở thành một người hợp lý"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be good at something",
                    "vi": "trở nên giỏi hơn về cái gì đó"
                },
                "examples": [
                    {
                        "en": "to have a head for figures/business",
                        "vi": "để có một cái đầu cho các số liệu / kinh doanh"
                    }
                ]
            },
            {
                "define": {
                    "en": "if somebody does not have a head for heights, they feel nervous and think they are going to fall when they look down from a high place",
                    "vi": "nếu ai đó không có đầu cho độ cao, họ cảm thấy lo lắng và nghĩ rằng họ sẽ bị ngã khi từ trên cao nhìn xuống"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be reading",
                    "vi": "được đọc"
                },
                "examples": [
                    {
                        "en": "She always has her nose in a book.",
                        "vi": "Cô ấy luôn chúi mũi vào một cuốn sách."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be thinking about something that is not connected with what you are doing",
                    "vi": "suy nghĩ về điều gì đó không liên quan đến những gì bạn đang làm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to have ideas, plans, etc. that are not realistic",
                    "vi": "có những ý tưởng, kế hoạch, v.v. không thực tế"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be a sensible person",
                    "vi": "trở thành một người hợp lý"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to have somewhere to live",
                    "vi": "có một nơi nào đó để sống"
                },
                "examples": [
                    {
                        "en": "Thanks to Bob’s generosity, I still have a roof over my head.",
                        "vi": "Cảm ơn sự hào phóng của Bob, tôi vẫn có một mái nhà trên đầu của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "for each person",
                    "vi": "Cho mỗi người"
                },
                "examples": [
                    {
                        "en": "The meal worked out at $20 a head.",
                        "vi": "Bữa ăn tính ra $ 20 một người."
                    }
                ]
            },
            {
                "define": {
                    "en": "moving forwards or downwards with your head in front of the rest of your body",
                    "vi": "di chuyển lên trên hoặc xuống dưới với đầu của bạn ở phía trước phần còn lại của cơ thể"
                },
                "examples": [
                    {
                        "en": "He fell head first down the stairs.",
                        "vi": "Anh ấy ngã đầu xuống cầu thang."
                    }
                ]
            },
            {
                "define": {
                    "en": "without thinking carefully about something before acting",
                    "vi": "mà không suy nghĩ kỹ về điều gì đó trước khi hành động"
                },
                "examples": [
                    {
                        "en": "She got divorced and rushed head first into another marriage.",
                        "vi": "Cô ấy đã ly hôn và lao đầu vào một cuộc hôn nhân khác."
                    }
                ]
            },
            {
                "define": {
                    "en": "your head feels as though it is going round and round and you cannot balance, especially because you are ill or confused or have had a shock; to make you feel like this",
                    "vi": "đầu của bạn cảm thấy như thể nó quay vòng vòng và bạn không thể giữ thăng bằng, đặc biệt là vì bạn bị ốm hoặc bối rối hoặc bị sốc; để làm cho bạn cảm thấy như thế này"
                },
                "examples": [
                    {
                        "en": "Her head was spinning from the pain.",
                        "vi": "Đầu cô quay cuồng vì cơn đau."
                    },
                    {
                        "en": "His theories on economics are enough to make your head spin.",
                        "vi": "Những lý thuyết của ông về kinh tế học đủ khiến bạn quay cuồng."
                    }
                ]
            },
            {
                "define": {
                    "en": "loving somebody very much",
                    "vi": "yêu ai đó rất nhiều"
                },
                "examples": [
                    {
                        "en": "He's fallen head over heels in love with his boss.",
                        "vi": "Anh ta say đắm sếp của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to ask somebody which side of a coin they think will be facing upwards when it is tossed in order to decide something by chance",
                    "vi": "được sử dụng để hỏi ai đó mặt nào của đồng xu mà họ nghĩ sẽ hướng lên trên khi nó được tung ra để quyết định một điều gì đó tình cờ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to say that some people will be punished because of something that has happened",
                    "vi": "từng nói rằng một số người sẽ bị trừng phạt vì điều gì đó đã xảy ra"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to say something that is exactly right",
                    "vi": "nói điều gì đó chính xác là đúng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to force somebody to do something that they do not want to do, by making threats",
                    "vi": "buộc ai đó làm điều gì đó mà họ không muốn, bằng cách đe dọa"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be proud of or not feel ashamed about something that you have done",
                    "vi": "tự hào hoặc không cảm thấy xấu hổ về điều gì đó bạn đã làm"
                },
                "examples": [
                    {
                        "en": "She managed to hold her head high and ignore what people were saying.",
                        "vi": "Cô ấy cố gắng ngẩng cao đầu và phớt lờ những gì mọi người đang nói."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to threaten somebody that you will hit them",
                    "vi": "từng đe dọa ai đó rằng bạn sẽ đánh họ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "involved in something that is too difficult for you to deal with",
                    "vi": "liên quan đến một cái gì đó quá khó đối với bạn"
                },
                "examples": [
                    {
                        "en": "After a week in the new job, I soon realized that I was in over my head.",
                        "vi": "Sau một tuần làm việc mới, tôi nhanh chóng nhận ra rằng mình đang làm quá sức."
                    }
                ]
            },
            {
                "define": {
                    "en": "to remain calm in a difficult situation",
                    "vi": "giữ bình tĩnh trong một tình huống khó khăn"
                },
                "examples": [
                    {
                        "en": "She needed to keep a clear head if she was to remain in control.",
                        "vi": "Cô ấy cần phải giữ một cái đầu tỉnh táo nếu cô ấy muốn tiếp tục kiểm soát."
                    }
                ]
            },
            {
                "define": {
                    "en": "to deal with a difficult situation, especially one in which you have financial problems, and just manage to survive",
                    "vi": "để đối phó với một tình huống khó khăn, đặc biệt là một tình huống mà bạn gặp vấn đề tài chính và chỉ cần xoay sở để tồn tại"
                },
                "examples": [
                    {
                        "en": "I’m not sure how much longer we’ll be able to keep our heads above water.",
                        "vi": "Tôi không chắc chúng ta sẽ có thể giữ đầu trên mặt nước được bao lâu nữa."
                    }
                ]
            },
            {
                "define": {
                    "en": "to avoid attracting attention to yourself",
                    "vi": "để tránh thu hút sự chú ý vào bản thân"
                },
                "examples": [
                    {
                        "en": "If I were you, I’d keep your head down for a couple of weeks.",
                        "vi": "Nếu tôi là bạn, tôi sẽ giữ đầu bạn trong vài tuần."
                    }
                ]
            },
            {
                "define": {
                    "en": "to laugh very loudly and for a long time",
                    "vi": "cười rất lớn và trong một thời gian dài"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to laugh, etc. a lot and very loudly",
                    "vi": "cười, v.v. rất nhiều và rất lớn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to act according to what you feel rather than to what you think is sensible",
                    "vi": "hành động theo những gì bạn cảm thấy hơn là theo những gì bạn nghĩ là hợp lý"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "in a bad mood; in an angry way",
                    "vi": "trong một tâm trạng tồi tệ; một cách tức giận"
                },
                "examples": [
                    {
                        "en": "I should keep out of his way. He’s like a bear with a sore head this morning.",
                        "vi": "Tôi nên tránh xa anh ta. Sáng nay anh ấy giống như một con gấu bị đau đầu."
                    }
                ]
            },
            {
                "define": {
                    "en": "to become unable to act in a calm or sensible way",
                    "vi": "trở nên không thể hành động một cách bình tĩnh hoặc hợp lý"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to make somebody feel annoyed, anxious or upset",
                    "vi": "để làm cho ai đó cảm thấy khó chịu, lo lắng hoặc khó chịu"
                },
                "examples": [
                    {
                        "en": "When they spend all this time on social media, they are seeing things that mess with their heads.",
                        "vi": "Khi dành toàn bộ thời gian trên mạng xã hội, họ đang nhìn thấy những thứ rối tung lên trong đầu."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be crazy",
                    "vi": "trở nên điên rồ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to not spend time/effort on something, because it is not important or you are not interested in it",
                    "vi": "không dành thời gian / nỗ lực cho việc gì đó, vì nó không quan trọng hoặc bạn không quan tâm đến nó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to not hurt somebody physically in any way",
                    "vi": "để không làm tổn thương ai đó về mặt thể chất theo bất kỳ cách nào"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "just guessing or using your memory, without taking time to think carefully or check the facts",
                    "vi": "chỉ cần đoán hoặc sử dụng trí nhớ của bạn mà không mất thời gian suy nghĩ cẩn thận hoặc kiểm tra sự thật"
                },
                "examples": [
                    {
                        "en": "I can't remember the name off the top of my head, but I can look it up for you.",
                        "vi": "Tôi không thể nhớ ra cái tên trên đỉnh đầu của mình, nhưng tôi có thể tra cứu nó cho bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to describe a young person who acts in a more sensible way than you would expect for a person of their age",
                    "vi": "được sử dụng để mô tả một người trẻ hành động theo cách hợp lý hơn bạn mong đợi đối với một người ở độ tuổi của họ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to tell somebody that they will have to accept any unpleasant results of something that they decide to do",
                    "vi": "được sử dụng để nói với ai đó rằng họ sẽ phải chấp nhận bất kỳ kết quả khó chịu nào của một điều gì đó mà họ quyết định làm"
                },
                "examples": [
                    {
                        "en": "Tell him the truth if you want to, but on your own head be it!",
                        "vi": "Hãy nói cho anh ấy biết sự thật nếu bạn muốn, nhưng bạn phải tự quyết định điều đó!"
                    }
                ]
            },
            {
                "define": {
                    "en": "crazy",
                    "vi": "khùng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "not knowing what you are saying or doing because of the effects of alcohol or drugs",
                    "vi": "không biết mình đang nói gì hoặc làm gì vì ảnh hưởng của rượu hoặc ma túy"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "too difficult or complicated for somebody to understand",
                    "vi": "quá khó hoặc phức tạp để ai đó hiểu"
                },
                "examples": [
                    {
                        "en": "A lot of the jokes went (= were) right over my head.",
                        "vi": "Rất nhiều câu chuyện cười đã xảy ra ngay trong đầu tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to a higher position of authority than somebody",
                    "vi": "lên một vị trí quyền lực cao hơn ai đó"
                },
                "examples": [
                    {
                        "en": "I couldn't help feeling jealous when she was promoted over my head.",
                        "vi": "Tôi không khỏi cảm thấy ghen tị khi cô ấy được thăng chức trên đầu tôi."
                    },
                    {
                        "en": "I’m not happy that you went over my head to ask for this time off.",
                        "vi": "Tôi không hài lòng khi bạn lướt qua đầu tôi để yêu cầu thời gian nghỉ này."
                    }
                ]
            },
            {
                "define": {
                    "en": "an amount of money that is offered for capturing or killing somebody",
                    "vi": "một số tiền được cung cấp để bắt hoặc giết ai đó"
                },
                "examples": [
                    {
                        "en": "Ever since he killed the gang’s leader, there has been a price on his head.",
                        "vi": "Kể từ khi anh ta giết được thủ lĩnh của băng đảng, đã có một cái giá phải trả trên đầu anh ta."
                    }
                ]
            },
            {
                "define": {
                    "en": "to risk losing your job, damaging your reputation, etc. by doing or saying something",
                    "vi": "có nguy cơ mất việc, làm tổn hại danh tiếng của bạn, v.v. bằng cách làm hoặc nói điều gì đó"
                },
                "examples": [
                    {
                        "en": "It's not a matter that I'm prepared to put my head on the block for.",
                        "vi": "Đó không phải là vấn đề mà tôi đã chuẩn bị sẵn sàng để đặt đầu của mình vào khối."
                    }
                ]
            },
            {
                "define": {
                    "en": "to think about or discuss something as a group",
                    "vi": "để suy nghĩ hoặc thảo luận về điều gì đó với tư cách một nhóm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "if something unpleasant rears its head or rears its ugly head, it appears or happens",
                    "vi": "nếu một cái gì đó khó chịu dựng lên đầu nó hoặc che cái đầu xấu xí của nó, nó sẽ xuất hiện hoặc xảy ra"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to make you feel that you can still hear something",
                    "vi": "để làm cho bạn cảm thấy rằng bạn vẫn có thể nghe thấy điều gì đó"
                },
                "examples": [
                    {
                        "en": "His warning was still ringing in my ears.",
                        "vi": "Lời cảnh báo của anh ấy vẫn còn văng vẳng bên tai tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to think hard in order to find an answer to something",
                    "vi": "suy nghĩ kỹ để tìm câu trả lời cho điều gì đó"
                },
                "examples": [
                    {
                        "en": "Experts have been scratching their heads over the increase in teenage crime.",
                        "vi": "Các chuyên gia đã phải gãi đầu trước sự gia tăng tội phạm ở lứa tuổi thanh thiếu niên."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make people think about something in a completely different way",
                    "vi": "để khiến mọi người nghĩ về điều gì đó theo một cách hoàn toàn khác"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be remembered for a long time",
                    "vi": "được ghi nhớ trong một thời gian dài"
                },
                "examples": [
                    {
                        "en": "One of his paintings in particular sticks in my mind.",
                        "vi": "Một trong những bức tranh của anh ấy đặc biệt ghi nhớ trong tâm trí tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to suddenly start thinking something, especially something that other people think is stupid",
                    "vi": "đột nhiên bắt đầu nghĩ điều gì đó, đặc biệt là điều gì đó mà người khác nghĩ là ngu ngốc"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to suddenly decide to do something, especially something that other people think is stupid",
                    "vi": "đột nhiên quyết định làm điều gì đó, đặc biệt là điều mà người khác nghĩ là ngu ngốc"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a physical condition in which your head is painful or you cannot think clearly as a result of an illness or of drinking too much alcohol",
                    "vi": "một tình trạng thể chất mà đầu của bạn bị đau hoặc bạn không thể suy nghĩ rõ ràng do bệnh tật hoặc uống quá nhiều rượu"
                },
                "examples": [
                    {
                        "en": "You’re going to have a thick head in the morning!",
                        "vi": "Bạn sẽ có một cái đầu dày vào buổi sáng!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to make a person feel too proud in a way that other people find annoying",
                    "vi": "làm cho một người cảm thấy quá tự hào theo cách mà người khác cảm thấy phiền phức"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to say that two people can achieve more than one person working alone",
                    "vi": "từng nói rằng hai người có thể đạt được nhiều hơn một người làm việc một mình"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to tell somebody to think about something, especially when they have asked for your opinion or said something stupid",
                    "vi": "được sử dụng để nói với ai đó hãy suy nghĩ về điều gì đó, đặc biệt là khi họ hỏi ý kiến của bạn hoặc nói điều gì đó ngu ngốc"
                },
                "examples": [
                    {
                        "en": "‘Why don't you want to see him again?’ ‘Oh, use your head!’",
                        "vi": "Tại sao bạn không muốn gặp lại anh ấy?' 'Ồ, sử dụng cái đầu của bạn!'"
                    }
                ]
            }
        ]
    },
    {
        "id": "6052437f48a6474380f69906fcf6338a",
        "word": "king",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/kɪŋ/",
            "us": "/kɪŋ/"
        },
        "nearby": [
            {
                "word": "kinetic",
                "pos": "adjective"
            },
            {
                "word": "kinetic art",
                "pos": "noun"
            },
            {
                "word": "king",
                "pos": "noun"
            },
            {
                "word": "the King",
                "pos": ""
            },
            {
                "word": "B B King",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the male ruler of an independent state that has a royal family",
                    "vi": "người cai trị nam giới của một quốc gia độc lập có một gia đình hoàng gia"
                },
                "examples": [
                    {
                        "en": "the kings and queens of England",
                        "vi": "các vị vua và nữ hoàng của nước Anh"
                    },
                    {
                        "en": "the French king",
                        "vi": "vua pháp"
                    },
                    {
                        "en": "to be crowned king",
                        "vi": "lên ngôi vua"
                    },
                    {
                        "en": "King George V",
                        "vi": "Vua George V"
                    }
                ]
            },
            {
                "define": {
                    "en": "a person, an animal or a thing that is thought to be the best or most important of a particular type",
                    "vi": "một người, một con vật hoặc một thứ được cho là tốt nhất hoặc quan trọng nhất của một loại cụ thể"
                },
                "examples": [
                    {
                        "en": "the king of comedy",
                        "vi": "vua hài kịch"
                    },
                    {
                        "en": "The lion is the king of the jungle.",
                        "vi": "Sư tử là vua của rừng già."
                    }
                ]
            },
            {
                "define": {
                    "en": "used in compounds with the names of animals or plants to describe a very large type of the thing mentioned",
                    "vi": "được sử dụng trong các hợp chất với tên của động vật hoặc thực vật để mô tả một loại rất lớn của điều được đề cập"
                },
                "examples": [
                    {
                        "en": "a king penguin",
                        "vi": "một con chim cánh cụt vua"
                    }
                ]
            },
            {
                "define": {
                    "en": "the most important piece used in the game of chess, that can move one square in any direction",
                    "vi": "quân quan trọng nhất được sử dụng trong trò chơi cờ vua, có thể di chuyển một ô vuông theo bất kỳ hướng nào"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a playing card with the picture of a king on it",
                    "vi": "một thẻ chơi với hình ảnh của một vị vua trên đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a very large amount of money",
                    "vi": "một số tiền rất lớn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the person considered to be the best, most famous or successful in a particular place or area of activity",
                    "vi": "người được coi là giỏi nhất, nổi tiếng nhất hoặc thành công ở một địa điểm hoặc lĩnh vực hoạt động cụ thể"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "b721b516363b46158cdccbbbc0ecdb28",
        "word": "leader",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈliːdə(r)/",
            "us": "/ˈliːdər/"
        },
        "nearby": [
            {
                "word": "leaded light",
                "pos": "noun"
            },
            {
                "word": "leaden",
                "pos": "adjective"
            },
            {
                "word": "leader",
                "pos": "noun"
            },
            {
                "word": "leader board",
                "pos": "noun"
            },
            {
                "word": "leaderless",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who leads a group of people, especially the head of a country, an organization, etc.",
                    "vi": "một người lãnh đạo một nhóm người, đặc biệt là người đứng đầu một quốc gia, một tổ chức, v.v."
                },
                "examples": [
                    {
                        "en": "party/world leaders",
                        "vi": "các nhà lãnh đạo đảng / thế giới"
                    },
                    {
                        "en": "a religious/political leader",
                        "vi": "một nhà lãnh đạo tôn giáo / chính trị"
                    },
                    {
                        "en": "He was elected as leader of the Democratic Party.",
                        "vi": "Ông được bầu làm lãnh đạo Đảng Dân chủ."
                    },
                    {
                        "en": "She became leader of the campaign group.",
                        "vi": "Cô trở thành lãnh đạo của nhóm vận động."
                    },
                    {
                        "en": "Union leaders agreed to begin talks with the government.",
                        "vi": "Các nhà lãnh đạo công đoàn đồng ý bắt đầu các cuộc đàm phán với chính phủ."
                    },
                    {
                        "en": "Tomorrow the President will meet with business leaders.",
                        "vi": "Ngày mai Tổng thống sẽ gặp gỡ các lãnh đạo doanh nghiệp."
                    },
                    {
                        "en": "He was not a natural leader.",
                        "vi": "Anh ấy không phải là một nhà lãnh đạo bẩm sinh."
                    },
                    {
                        "en": "She's a born leader.",
                        "vi": "Cô ấy là một nhà lãnh đạo bẩm sinh."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person or thing that is the best, or in first place in a race, business, etc.",
                    "vi": "một người hoặc điều tốt nhất, hoặc ở vị trí đầu tiên trong một cuộc đua, doanh nghiệp, v.v."
                },
                "examples": [
                    {
                        "en": "She was among the leaders of the race from the start.",
                        "vi": "Cô ấy đã nằm trong số những người dẫn đầu cuộc đua ngay từ đầu."
                    },
                    {
                        "en": "The company has emerged as a world leader in the field of precision engineering.",
                        "vi": "Công ty đã nổi lên như một công ty hàng đầu thế giới trong lĩnh vực cơ khí chính xác."
                    }
                ]
            },
            {
                "define": {
                    "en": "the most important violin player in an orchestra",
                    "vi": "người chơi vĩ cầm quan trọng nhất trong dàn nhạc"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "an important article in a newspaper that expresses the editor's opinion about an item of news or an issue; in the US also a comment on radio or television that expresses the opinion of the station or network",
                    "vi": "một bài báo quan trọng trên một tờ báo thể hiện ý kiến của biên tập viên về một mục của tin tức hoặc một vấn đề; ở Mỹ cũng là một bình luận trên đài phát thanh hoặc truyền hình thể hiện quan điểm của đài hoặc mạng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "7a0b7621c70d4725adffc2cc2621d842",
        "word": "president",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈprezɪdənt/",
            "us": "/ˈprezɪdənt/"
        },
        "nearby": [
            {
                "word": "preside",
                "pos": "verb"
            },
            {
                "word": "presidency",
                "pos": "noun"
            },
            {
                "word": "president",
                "pos": "noun"
            },
            {
                "word": "president-elect",
                "pos": "noun"
            },
            {
                "word": "presidential",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the leader of a republic, for example the US",
                    "vi": "lãnh đạo của một nước cộng hòa, ví dụ như Hoa Kỳ"
                },
                "examples": [
                    {
                        "en": "Several presidents attended the funeral.",
                        "vi": "Một số tổng thống đã tham dự lễ tang."
                    },
                    {
                        "en": "the President of the United States",
                        "vi": "tổng thống của nước Mỹ"
                    },
                    {
                        "en": "President Trump is due to visit the country next month.",
                        "vi": "Tổng thống Trump sẽ đến thăm đất nước vào tháng tới."
                    },
                    {
                        "en": "Do you have any comment, Mr President?",
                        "vi": "Ông có bình luận gì không, thưa Tổng thống?"
                    },
                    {
                        "en": "France elected a new president in 2017.",
                        "vi": "Pháp đã bầu một tổng thống mới vào năm 2017."
                    },
                    {
                        "en": "Ford became president following Nixon's resignation.",
                        "vi": "Ford trở thành chủ tịch sau khi Nixon từ chức."
                    },
                    {
                        "en": "She should run for president.",
                        "vi": "Cô ấy nên tranh cử tổng thống."
                    },
                    {
                        "en": "former South African president, Nelson Mandela",
                        "vi": "cựu tổng thống Nam Phi, Nelson Mandela"
                    },
                    {
                        "en": "as president He was sworn in as President on August 31.",
                        "vi": "với tư cách là tổng thống Ông tuyên thệ nhậm chức Tổng thống vào ngày 31 tháng 8."
                    }
                ]
            },
            {
                "define": {
                    "en": "the person in charge of some organizations, clubs, colleges, etc.",
                    "vi": "người phụ trách một số tổ chức, câu lạc bộ, trường cao đẳng, v.v."
                },
                "examples": [
                    {
                        "en": "to be made president of the students’ union",
                        "vi": "được làm chủ tịch hội sinh viên"
                    },
                    {
                        "en": "She travels extensively in her role as President of the World Wide Fund for Nature.",
                        "vi": "Cô ấy đã đi nhiều nơi với vai trò là Chủ tịch của World Wide Fund for Nature."
                    }
                ]
            },
            {
                "define": {
                    "en": "the person in charge of a bank or a commercial organization",
                    "vi": "người phụ trách ngân hàng hoặc tổ chức thương mại"
                },
                "examples": [
                    {
                        "en": "the bank president",
                        "vi": "chủ tịch ngân hàng"
                    },
                    {
                        "en": "the president of Columbia Pictures",
                        "vi": "chủ tịch của Columbia Pictures"
                    }
                ]
            }
        ]
    },
    {
        "id": "2f8ae2dae6814d8bbb03d32ef2824e4a",
        "word": "queen",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/kwiːn/",
            "us": "/kwiːn/"
        },
        "nearby": [
            {
                "word": "Quebec City",
                "pos": ""
            },
            {
                "word": "Quechua",
                "pos": "noun"
            },
            {
                "word": "queen",
                "pos": "noun"
            },
            {
                "word": "Queen",
                "pos": ""
            },
            {
                "word": "Ellery Queen",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the female ruler of an independent state that has a royal family",
                    "vi": "nữ cai trị của một quốc gia độc lập có một gia đình hoàng gia"
                },
                "examples": [
                    {
                        "en": "She was crowned queen at the age of fifteen.",
                        "vi": "Cô lên ngôi hoàng hậu khi mới mười lăm tuổi."
                    },
                    {
                        "en": "kings and queens",
                        "vi": "Những vị vua và hoàng hậu"
                    },
                    {
                        "en": "queen of… the Queen of Norway",
                        "vi": "nữ hoàng của… Nữ hoàng Na Uy"
                    },
                    {
                        "en": "Queen Victoria",
                        "vi": "Nữ hoàng Victoria"
                    }
                ]
            },
            {
                "define": {
                    "en": "the wife of a king",
                    "vi": "vợ của một vị vua"
                },
                "examples": [
                    {
                        "en": "Henry VII and his queen, Elizabeth of York",
                        "vi": "Henry VII và nữ hoàng của ông, Elizabeth of York"
                    },
                    {
                        "en": "queen of… The King and Queen of Denmark attended the wedding.",
                        "vi": "nữ hoàng của… Nhà vua và Nữ hoàng Đan Mạch đã tham dự lễ cưới."
                    }
                ]
            },
            {
                "define": {
                    "en": "a woman, place or thing that is thought to be one of the best in a particular group or area",
                    "vi": "một người phụ nữ, địa điểm hoặc thứ được cho là tốt nhất trong một nhóm hoặc khu vực cụ thể"
                },
                "examples": [
                    {
                        "en": "the queen of fashion",
                        "vi": "nữ hoàng thời trang"
                    },
                    {
                        "en": "a movie queen",
                        "vi": "một nữ hoàng điện ảnh"
                    },
                    {
                        "en": "Venice, queen of the Adriatic",
                        "vi": "Venice, nữ hoàng của Adriatic"
                    }
                ]
            },
            {
                "define": {
                    "en": "a woman or girl chosen to perform official duties at a festival or celebration",
                    "vi": "một phụ nữ hoặc cô gái được chọn để thực hiện nhiệm vụ chính thức tại một lễ hội hoặc lễ kỷ niệm"
                },
                "examples": [
                    {
                        "en": "a carnival queen",
                        "vi": "một nữ hoàng lễ hội"
                    },
                    {
                        "en": "a May queen (= at a festival to celebrate the coming of spring)",
                        "vi": "nữ hoàng tháng 5 (= tại lễ hội mừng mùa xuân sắp đến)"
                    },
                    {
                        "en": "a homecoming queen",
                        "vi": "một nữ hoàng trở về nhà"
                    },
                    {
                        "en": "She was nominated for prom queen in high school.",
                        "vi": "Cô từng được đề cử là nữ hoàng vũ hội ở trường trung học."
                    }
                ]
            },
            {
                "define": {
                    "en": "the most powerful piece used in the game of chess that can move any number of squares in any direction",
                    "vi": "quân cờ mạnh nhất được sử dụng trong trò chơi cờ vua có thể di chuyển bất kỳ số ô vuông nào theo bất kỳ hướng nào"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a playing card with the picture of a queen on it",
                    "vi": "một thẻ chơi với hình ảnh của một nữ hoàng trên đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a large female insect that lays eggs for the whole group",
                    "vi": "một con côn trùng cái lớn đẻ trứng cho cả đàn"
                },
                "examples": [
                    {
                        "en": "a queen bee",
                        "vi": "ong chúa"
                    }
                ]
            },
            {
                "define": {
                    "en": "an offensive word for a gay man who behaves like a woman",
                    "vi": "một từ xúc phạm cho một người đồng tính nam cư xử như một phụ nữ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the person considered to be the best, most famous or successful in a particular place or area of activity",
                    "vi": "người được coi là giỏi nhất, nổi tiếng nhất hoặc thành công ở một địa điểm hoặc lĩnh vực hoạt động cụ thể"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "ab9e0f011df14d31be73ded77f4f71fe",
        "word": "captain",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈkæptɪn/",
            "us": "/ˈkæptɪn/"
        },
        "nearby": [
            {
                "word": "capsule",
                "pos": "noun"
            },
            {
                "word": "Capt.",
                "pos": "abbreviation"
            },
            {
                "word": "captain",
                "pos": "noun"
            },
            {
                "word": "captain",
                "pos": "verb"
            },
            {
                "word": "Captain Beefheart",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the person in charge of a ship or commercial aircraft",
                    "vi": "người phụ trách tàu thủy hoặc máy bay thương mại"
                },
                "examples": [
                    {
                        "en": "Captain Cook",
                        "vi": "Bếp trưởng"
                    },
                    {
                        "en": "The captain gave the order to abandon ship.",
                        "vi": "Thuyền trưởng ra lệnh bỏ tàu."
                    },
                    {
                        "en": "The captain of the ship invited them to dine at his table.",
                        "vi": "Thuyền trưởng của con tàu mời họ dùng bữa tại bàn của mình."
                    },
                    {
                        "en": "The captain of the plane was already announcing our arrival.",
                        "vi": "Cơ trưởng của máy bay đã thông báo về sự xuất hiện của chúng tôi."
                    },
                    {
                        "en": "Her husband had been a ship's captain.",
                        "vi": "Chồng cô đã từng là thuyền trưởng của một con tàu."
                    },
                    {
                        "en": "Captain Jones and her co-pilot",
                        "vi": "Cơ trưởng Jones và phi công phụ của cô ấy"
                    }
                ]
            },
            {
                "define": {
                    "en": "an officer of fairly high rank in the navy, the army and the US air force",
                    "vi": "một sĩ quan có cấp bậc khá cao trong hải quân, lục quân và không quân Hoa Kỳ"
                },
                "examples": [
                    {
                        "en": "Captain Lance Price",
                        "vi": "Giá thuyền trưởng Lance"
                    },
                    {
                        "en": "She has since been promoted to the rank of captain.",
                        "vi": "Cô ấy đã được thăng cấp lên cấp đội trưởng."
                    },
                    {
                        "en": "Her father had been a captain in the army.",
                        "vi": "Cha cô từng là đại úy trong quân đội."
                    }
                ]
            },
            {
                "define": {
                    "en": "the leader of a group of people, especially a sports team",
                    "vi": "lãnh đạo của một nhóm người, đặc biệt là một đội thể thao"
                },
                "examples": [
                    {
                        "en": "She's a former captain of the English national team.",
                        "vi": "Cô ấy là cựu đội trưởng của đội tuyển quốc gia Anh."
                    },
                    {
                        "en": "He has just been made team captain.",
                        "vi": "Anh ấy vừa được làm đội trưởng đội."
                    },
                    {
                        "en": "The appointment of the former England captain as their new manager is bound to boost morale.",
                        "vi": "Việc bổ nhiệm cựu đội trưởng tuyển Anh làm tân HLV trưởng của họ chắc chắn sẽ thúc đẩy tinh thần."
                    }
                ]
            },
            {
                "define": {
                    "en": "an officer of high rank in a US police or fire department",
                    "vi": "một sĩ quan cấp cao trong cảnh sát hoặc sở cứu hỏa Hoa Kỳ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "f0a680f4c88c4ec0b08280631e51bb2e",
        "word": "class",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/klɑːs/",
            "us": "/klæs/"
        },
        "nearby": [
            {
                "word": "clasp",
                "pos": "verb"
            },
            {
                "word": "clasp",
                "pos": "noun"
            },
            {
                "word": "class",
                "pos": "noun"
            },
            {
                "word": "class",
                "pos": "verb"
            },
            {
                "word": "class",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a group of students who are taught together",
                    "vi": "một nhóm học sinh được dạy cùng nhau"
                },
                "examples": [
                    {
                        "en": "in the/your class We were in the same class at school.",
                        "vi": "in the / your class Chúng tôi học cùng lớp ở trường."
                    },
                    {
                        "en": "She is the youngest in her class.",
                        "vi": "Cô ấy là người trẻ nhất trong lớp."
                    },
                    {
                        "en": "He came top of the class.",
                        "vi": "Anh ấy đứng đầu lớp."
                    },
                    {
                        "en": "The whole class was/were told to stay behind after school.",
                        "vi": "Cả lớp được yêu cầu ở lại sau giờ học."
                    }
                ]
            },
            {
                "define": {
                    "en": "an occasion when a group of students meets to be taught",
                    "vi": "một dịp khi một nhóm sinh viên gặp nhau để được dạy"
                },
                "examples": [
                    {
                        "en": "I have a history class at 9 o'clock.",
                        "vi": "Tôi có một lớp học lịch sử lúc 9 giờ."
                    },
                    {
                        "en": "I was late for (a) class.",
                        "vi": "Tôi đã đến muộn cho (a) lớp học."
                    },
                    {
                        "en": "See me after class.",
                        "vi": "Hẹn gặp tôi sau giờ học."
                    },
                    {
                        "en": "in class She works hard in class (= during the class).",
                        "vi": "ở lớp Cô ấy làm việc chăm chỉ trong lớp (= trong giờ học)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a series of classes on a particular subject",
                    "vi": "một loạt các lớp học về một chủ đề cụ thể"
                },
                "examples": [
                    {
                        "en": "Are you still doing your French evening class?",
                        "vi": "Bạn vẫn đang học lớp tiếng Pháp buổi tối chứ?"
                    },
                    {
                        "en": "class in something I've been taking classes in pottery.",
                        "vi": "lớp học về một thứ gì đó Tôi đã tham gia các lớp học về đồ gốm."
                    }
                ]
            },
            {
                "define": {
                    "en": "a group of students who finish their studies at school, college or university in a particular year",
                    "vi": "một nhóm sinh viên hoàn thành việc học ở trường, cao đẳng hoặc đại học trong một năm cụ thể"
                },
                "examples": [
                    {
                        "en": "the class of 2020",
                        "vi": "lớp của năm 2020"
                    },
                    {
                        "en": "the freshman/sophomore/junior/senior class",
                        "vi": "sinh viên năm nhất / năm hai / cơ sở / lớp cao cấp"
                    }
                ]
            },
            {
                "define": {
                    "en": "one of the groups of people in a society that are thought of as being at the same social or economic level",
                    "vi": "một trong những nhóm người trong xã hội được coi là ở cùng cấp độ xã hội hoặc kinh tế"
                },
                "examples": [
                    {
                        "en": "the working/middle/upper class",
                        "vi": "tầng lớp lao động / trung lưu / thượng lưu"
                    },
                    {
                        "en": "The party tries to appeal to all classes of society.",
                        "vi": "Đảng cố gắng kêu gọi mọi tầng lớp trong xã hội."
                    },
                    {
                        "en": "His ideas had an appeal among the wealthy, professional classes.",
                        "vi": "Ý tưởng của ông đã thu hút được sự quan tâm của các tầng lớp giàu có, chuyên nghiệp."
                    }
                ]
            },
            {
                "define": {
                    "en": "the way that people are divided into different social and economic groups",
                    "vi": "cách mà mọi người được chia thành các nhóm xã hội và kinh tế khác nhau"
                },
                "examples": [
                    {
                        "en": "differences of class, race or gender",
                        "vi": "sự khác biệt về giai cấp, chủng tộc hoặc giới tính"
                    },
                    {
                        "en": "The old class system is not appropriate in a modern age.",
                        "vi": "Hệ thống giai cấp cũ không thích hợp trong thời đại hiện đại."
                    },
                    {
                        "en": "a society in which class is more important than ability",
                        "vi": "một xã hội mà giai cấp quan trọng hơn khả năng"
                    }
                ]
            },
            {
                "define": {
                    "en": "each of several different levels of comfort that are available to travellers in a plane, etc.",
                    "vi": "từng mức độ thoải mái khác nhau dành cho khách đi máy bay, v.v."
                },
                "examples": [
                    {
                        "en": "He always travels business class.",
                        "vi": "Anh ấy luôn đi hạng thương gia."
                    },
                    {
                        "en": "The first-class compartment is situated at the front of the train.",
                        "vi": "Khoang hạng nhất nằm ở đầu tàu."
                    }
                ]
            },
            {
                "define": {
                    "en": "a group of people, animals or things that have similar characteristics or qualities",
                    "vi": "một nhóm người, động vật hoặc những thứ có đặc điểm hoặc phẩm chất tương tự"
                },
                "examples": [
                    {
                        "en": "It was good accommodation for a hotel of this class.",
                        "vi": "Đó là chỗ ở tốt cho một khách sạn hạng này."
                    },
                    {
                        "en": "different classes of drugs",
                        "vi": "các loại thuốc khác nhau"
                    },
                    {
                        "en": "Dickens was in a different class from (= was much better than) most of his contemporaries.",
                        "vi": "Dickens ở một tầng lớp khác với (= tốt hơn nhiều so với) hầu hết những người cùng thời với ông."
                    },
                    {
                        "en": "As a jazz singer she's in a class of her own (= better than most others).",
                        "vi": "Là một ca sĩ nhạc jazz, cô ấy thuộc đẳng cấp của riêng mình (= hay hơn hầu hết những người khác)."
                    }
                ]
            },
            {
                "define": {
                    "en": "one of the different groups in a competition",
                    "vi": "một trong những nhóm khác nhau trong một cuộc thi"
                },
                "examples": [
                    {
                        "en": "He came first in his class at every event.",
                        "vi": "Anh ấy đứng đầu trong lớp ở mọi sự kiện."
                    }
                ]
            },
            {
                "define": {
                    "en": "an attractive quality or a high level of skill that is impressive",
                    "vi": "phẩm chất hấp dẫn hoặc trình độ kỹ năng cao gây ấn tượng"
                },
                "examples": [
                    {
                        "en": "She has class all right—she looks like a model.",
                        "vi": "Cô ấy có cả lớp - cô ấy trông giống như một người mẫu."
                    },
                    {
                        "en": "There's a real touch of class about this team.",
                        "vi": "Có một liên hệ thực sự về lớp học về đội này."
                    }
                ]
            },
            {
                "define": {
                    "en": "one of the levels of achievement in a British university degree exam",
                    "vi": "một trong những cấp độ thành tích trong kỳ thi lấy bằng đại học của Anh"
                },
                "examples": [
                    {
                        "en": "a first-/second-/third-class degree",
                        "vi": "văn bằng hạng nhất / hạng nhì / hạng ba"
                    }
                ]
            },
            {
                "define": {
                    "en": "a group into which animals, plants, etc. that have similar characteristics are divided, below a phylum",
                    "vi": "một nhóm trong đó động vật, thực vật, v.v. có các đặc điểm tương tự được phân chia, bên dưới một ngành"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the people in society who like to give their opinions on political or social issues",
                    "vi": "những người trong xã hội thích đưa ra ý kiến của họ về các vấn đề chính trị hoặc xã hội"
                },
                "examples": [
                    {
                        "en": "Constitutional reform is popular among the chattering classes.",
                        "vi": "Cải cách hiến pháp là phổ biến trong các tầng lớp huyên thuyên."
                    },
                    {
                        "en": "topics being discussed at the breakfast tables of the chattering classes",
                        "vi": "chủ đề đang được thảo luận trên bàn ăn sáng của các lớp học nói chuyện phiếm"
                    }
                ]
            }
        ]
    },
    {
        "id": "3281c8a074ce4d06ba934119b25b0336",
        "word": "head",
        "pos": "verb",
        "level": "b1",
        "phonetic": {
            "uk": "/hed/",
            "us": "/hed/"
        },
        "nearby": [
            {
                "word": "head",
                "pos": "noun"
            },
            {
                "word": "-head",
                "pos": "suffix"
            },
            {
                "word": "head",
                "pos": "verb"
            },
            {
                "word": "headache",
                "pos": "noun"
            },
            {
                "word": "Head and Shoulders",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to move in a particular direction",
                    "vi": "để di chuyển theo một hướng cụ thể"
                },
                "examples": [
                    {
                        "en": "Where are we heading?",
                        "vi": "Chúng ta đang tiến về đâu?"
                    },
                    {
                        "en": "Where are you two headed?",
                        "vi": "Hai bạn đang đi đâu?"
                    },
                    {
                        "en": "Let's head back home.",
                        "vi": "Hãy trở về nhà."
                    },
                    {
                        "en": "They woke early and headed off for breakfast.",
                        "vi": "Họ thức dậy sớm và đi ăn sáng."
                    },
                    {
                        "en": "She headed for the door.",
                        "vi": "Cô ấy tiến ra cửa."
                    },
                    {
                        "en": "We headed north.",
                        "vi": "Chúng tôi đi về phía bắc."
                    },
                    {
                        "en": "Head towards the mall.",
                        "vi": "Đi về phía trung tâm mua sắm."
                    },
                    {
                        "en": "The boat was heading out to sea.",
                        "vi": "Con thuyền đang ra khơi."
                    },
                    {
                        "en": "(figurative) Can you forecast where the economy is heading?",
                        "vi": "(nghĩa bóng) Bạn có thể dự báo nền kinh tế đang đi tới đâu không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to lead or be in charge of something",
                    "vi": "lãnh đạo hoặc phụ trách một cái gì đó"
                },
                "examples": [
                    {
                        "en": "She has been appointed to head the research team.",
                        "vi": "Cô ấy đã được chỉ định làm trưởng nhóm nghiên cứu."
                    },
                    {
                        "en": "to head a committee/delegation",
                        "vi": "đứng đầu một ủy ban / phái đoàn"
                    },
                    {
                        "en": "to head an investigation/inquiry",
                        "vi": "đứng đầu một cuộc điều tra / cuộc điều tra"
                    },
                    {
                        "en": "a terrorist group headed by a former army officer",
                        "vi": "một nhóm khủng bố do một cựu sĩ quan quân đội đứng đầu"
                    },
                    {
                        "en": "He heads up the bank's corporate arm.",
                        "vi": "Anh ấy đứng đầu chi nhánh công ty của ngân hàng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be at the top of a list of names or at the front of a line of people",
                    "vi": "đứng đầu danh sách tên hoặc ở đầu dòng người"
                },
                "examples": [
                    {
                        "en": "Italy heads the table after two games.",
                        "vi": "Ý đứng đầu bảng sau hai trận."
                    },
                    {
                        "en": "Orlando, Florida, heads the list of most popular summer destinations.",
                        "vi": "Orlando, Florida, đứng đầu danh sách các điểm đến mùa hè nổi tiếng nhất."
                    },
                    {
                        "en": "to head a march/procession",
                        "vi": "đứng đầu một cuộc diễu hành / đám rước"
                    }
                ]
            },
            {
                "define": {
                    "en": "to put a word or words at the top of a page or section of a book as a title",
                    "vi": "để đặt một từ hoặc các từ ở đầu trang hoặc phần của sách làm tiêu đề"
                },
                "examples": [
                    {
                        "en": "be headed… The chapter was headed ‘My Early Life’.",
                        "vi": "đứng đầu… Chương này đứng đầu là “My Early Life”."
                    }
                ]
            },
            {
                "define": {
                    "en": "to hit a football with your head",
                    "vi": "đánh bóng bằng đầu của bạn"
                },
                "examples": [
                    {
                        "en": "Walsh headed the ball into an empty goal.",
                        "vi": "Walsh đánh đầu đưa bóng đi chệch khung thành trong gang tấc."
                    }
                ]
            }
        ]
    },
    {
        "id": "14a41dccdd114c8ca67fb57a3d54e734",
        "word": "lower class",
        "pos": "adjective",
        "level": "b1",
        "phonetic": {
            "uk": "/ˌləʊə ˈklɑːs/",
            "us": "/ˌləʊər ˈklæs/"
        },
        "nearby": [
            {
                "word": "lower case",
                "pos": "noun"
            },
            {
                "word": "lower chamber",
                "pos": "noun"
            },
            {
                "word": "lower class",
                "pos": "adjective"
            },
            {
                "word": "the lower classes",
                "pos": "noun"
            },
            {
                "word": "the Lower East Side",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "belonging to or typical of groups of people who are considered to have the lowest social status and who have less money and/or power than other people in society",
                    "vi": "Thuộc về hoặc điển hình của những nhóm người được coi là có địa vị xã hội thấp nhất và những người có ít tiền và / hoặc quyền lực hơn những người khác trong xã hội"
                },
                "examples": [
                    {
                        "en": "The new bosses were condemned as ‘too lower class’.",
                        "vi": "Các ông chủ mới bị lên án là 'quá thấp kém'."
                    },
                    {
                        "en": "a lower-class accent",
                        "vi": "giọng hạng thấp hơn"
                    }
                ]
            }
        ]
    },
    {
        "id": "ffc703fb2bc543b9bd2369cd6fdba57e",
        "word": "prince",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/prɪns/",
            "us": "/prɪns/"
        },
        "nearby": [
            {
                "word": "primula",
                "pos": "noun"
            },
            {
                "word": "Primus",
                "pos": "noun"
            },
            {
                "word": "prince",
                "pos": "noun"
            },
            {
                "word": "Prince",
                "pos": ""
            },
            {
                "word": "Prince Charming",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a male member of a royal family who is not king, especially the son or grandson of the king or queen",
                    "vi": "một thành viên nam của gia đình hoàng gia không phải là vua, đặc biệt là con trai hoặc cháu trai của vua hoặc hoàng hậu"
                },
                "examples": [
                    {
                        "en": "the royal princes",
                        "vi": "các hoàng tử"
                    },
                    {
                        "en": "Prince Charles",
                        "vi": "hoàng tử Charles"
                    },
                    {
                        "en": "prince of… the Prince of Wales",
                        "vi": "hoàng tử của… hoàng tử xứ Wales"
                    }
                ]
            },
            {
                "define": {
                    "en": "the male ruler of a small country or state that has a royal family; a male member of this family, especially the son or grandson of the ruler",
                    "vi": "người cai trị nam giới của một quốc gia hoặc nhà nước nhỏ có hoàng gia; một thành viên nam của gia đình này, đặc biệt là con trai hoặc cháu trai của người cai trị"
                },
                "examples": [
                    {
                        "en": "prince of… the prince of Orange",
                        "vi": "hoàng tử của… hoàng tử của Orange"
                    },
                    {
                        "en": "Prince Albert of Monaco",
                        "vi": "Hoàng tử Albert của Monaco"
                    }
                ]
            },
            {
                "define": {
                    "en": "(in some European countries) a nobleman",
                    "vi": "(ở một số nước Châu Âu) một nhà quý tộc"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a man who is thought to be one of the best in a particular field",
                    "vi": "một người đàn ông được cho là một trong những người giỏi nhất trong một lĩnh vực cụ thể"
                },
                "examples": [
                    {
                        "en": "the prince of comedy",
                        "vi": "hoàng tử hài"
                    }
                ]
            }
        ]
    },
    {
        "id": "4dffefc029ed48588d8e1610b9e375e2",
        "word": "princess",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˌprɪnˈses/",
            "us": "/ˈprɪnses/"
        },
        "nearby": [
            {
                "word": "the Princes in the Tower",
                "pos": ""
            },
            {
                "word": "the Prince's Regeneration Trust",
                "pos": ""
            },
            {
                "word": "princess",
                "pos": "noun"
            },
            {
                "word": "Princess of Wales",
                "pos": ""
            },
            {
                "word": "Princess Royal",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a female member of a royal family who is not a queen, especially the daughter or granddaughter of the king or queen",
                    "vi": "một thành viên nữ của gia đình hoàng gia không phải là hoàng hậu, đặc biệt là con gái hoặc cháu gái của vua hoặc hoàng hậu"
                },
                "examples": [
                    {
                        "en": "the royal princesses",
                        "vi": "công chúa hoàng gia"
                    },
                    {
                        "en": "Princess Anne",
                        "vi": "Công chúa Anne"
                    }
                ]
            },
            {
                "define": {
                    "en": "the wife of a prince",
                    "vi": "vợ của hoàng tử"
                },
                "examples": [
                    {
                        "en": "princess of… the Princess of Wales",
                        "vi": "công chúa của… công chúa xứ Wales"
                    }
                ]
            },
            {
                "define": {
                    "en": "a young woman who has always been given everything that she wants, and who thinks that she is better than other people",
                    "vi": "một phụ nữ trẻ luôn được cung cấp mọi thứ mà cô ấy muốn, và người nghĩ rằng cô ấy giỏi hơn những người khác"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used by some men as a form of address to a girl or young woman",
                    "vi": "được một số đàn ông sử dụng như một hình thức xưng hô với một cô gái hoặc phụ nữ trẻ"
                },
                "examples": [
                    {
                        "en": "Is something the matter, princess?",
                        "vi": "Có chuyện gì không, công chúa?"
                    }
                ]
            }
        ]
    },
    {
        "id": "16a76e17e1694bbd90eb543e80657a4d",
        "word": "the upper class",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ði ˌʌpə ˈklɑːs/",
            "us": "/ði ˌʌpər ˈklæs/"
        },
        "nearby": [
            {
                "word": "upper circle",
                "pos": "noun"
            },
            {
                "word": "upper class",
                "pos": "adjective"
            },
            {
                "word": "the upper class",
                "pos": "noun"
            },
            {
                "word": "upperclassman",
                "pos": "noun"
            },
            {
                "word": "upperclasswoman",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the groups of people that are considered to have the highest social status and that have more money and/or power than other people in society",
                    "vi": "những nhóm người được coi là có địa vị xã hội cao nhất và có nhiều tiền và / hoặc quyền lực hơn những người khác trong xã hội"
                },
                "examples": [
                    {
                        "en": "a member of the upper class/upper classes",
                        "vi": "một thành viên của tầng lớp thượng lưu / thượng lưu"
                    },
                    {
                        "en": "The upper classes have no automatic right to rule.",
                        "vi": "Các tầng lớp trên không có quyền tự động để cai trị."
                    }
                ]
            }
        ]
    },
    {
        "id": "c4edfb3c6d63442fbf09c225b1fbfca1",
        "word": "upper class",
        "pos": "adjective",
        "level": "b1",
        "phonetic": {
            "uk": "/ði ˌʌpə ˈklɑːs/",
            "us": "/ði ˌʌpər ˈklæs/"
        },
        "nearby": [
            {
                "word": "upper chamber",
                "pos": "noun"
            },
            {
                "word": "upper circle",
                "pos": "noun"
            },
            {
                "word": "upper class",
                "pos": "adjective"
            },
            {
                "word": "the upper class",
                "pos": "noun"
            },
            {
                "word": "upperclassman",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "belonging to or typical of groups of people that are considered to have the highest social status and that have more money and/or power than other people in society",
                    "vi": "Thuộc về hoặc tiêu biểu của những nhóm người được coi là có địa vị xã hội cao nhất và có nhiều tiền và / hoặc quyền lực hơn những người khác trong xã hội"
                },
                "examples": [
                    {
                        "en": "Her family is very upper class.",
                        "vi": "Gia đình cô rất thượng lưu."
                    },
                    {
                        "en": "an upper-class accent",
                        "vi": "giọng của tầng lớp thượng lưu"
                    }
                ]
            }
        ]
    },
    {
        "id": "d3fb915fe77f4736a9686acc873f6ea3",
        "word": "the working class",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ðə ˌwɜːkɪŋ ˈklɑːs/",
            "us": "/ðə ˌwɜːrkɪŋ ˈklæs/"
        },
        "nearby": [
            {
                "word": "working capital",
                "pos": "noun"
            },
            {
                "word": "working class",
                "pos": "adjective"
            },
            {
                "word": "the working class",
                "pos": "noun"
            },
            {
                "word": "working day",
                "pos": "noun"
            },
            {
                "word": "working girl",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the social class whose members do not have much money or power and are usually employed to do manual work (= physical work using their hands)",
                    "vi": "tầng lớp xã hội mà các thành viên không có nhiều tiền bạc hoặc quyền lực và thường được thuê để làm công việc chân tay (= công việc chân tay)"
                },
                "examples": [
                    {
                        "en": "the political party of the working class",
                        "vi": "chính đảng của giai cấp công nhân"
                    },
                    {
                        "en": "The working class has/have rejected them in the elections.",
                        "vi": "Giai cấp công nhân đã / đã từ chối họ trong các cuộc bầu cử."
                    },
                    {
                        "en": "If you were working class, going to university wasn’t even an option.",
                        "vi": "Nếu bạn là tầng lớp lao động, vào đại học thậm chí không phải là một lựa chọn."
                    },
                    {
                        "en": "sections of the working class",
                        "vi": "các bộ phận của giai cấp công nhân"
                    }
                ]
            }
        ]
    },
    {
        "id": "34ebe7e3c3ea4afba858351df235993f",
        "word": "working class",
        "pos": "adjective",
        "level": "b1",
        "phonetic": {
            "uk": "/ˌwɜːkɪŋ ˈklɑːs/",
            "us": "/ˌwɜːrkɪŋ ˈklæs/"
        },
        "nearby": [
            {
                "word": "working",
                "pos": "noun"
            },
            {
                "word": "working capital",
                "pos": "noun"
            },
            {
                "word": "working class",
                "pos": "adjective"
            },
            {
                "word": "the working class",
                "pos": "noun"
            },
            {
                "word": "working day",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "from or connected with the social class whose members do not have much money or power and are usually employed to do manual work (= physical work using their hands)",
                    "vi": "xuất thân hoặc có mối liên hệ với tầng lớp xã hội mà các thành viên của họ không có nhiều tiền hoặc quyền lực và thường được thuê làm công việc chân tay (= công việc chân tay)"
                },
                "examples": [
                    {
                        "en": "a working-class background",
                        "vi": "giai cấp công nhân nền"
                    }
                ]
            }
        ]
    },
    {
        "id": "5a5d548e35274f83bddcc0bc669c2578",
        "word": "captain",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈkæptɪn/",
            "us": "/ˈkæptɪn/"
        },
        "nearby": [
            {
                "word": "Capt.",
                "pos": "abbreviation"
            },
            {
                "word": "captain",
                "pos": "noun"
            },
            {
                "word": "captain",
                "pos": "verb"
            },
            {
                "word": "Captain Beefheart",
                "pos": ""
            },
            {
                "word": "captaincy",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to be a captain of a sports team or a ship",
                    "vi": "trở thành đội trưởng của một đội thể thao hoặc một con tàu"
                },
                "examples": [
                    {
                        "en": "Ellis is expected to captain the side in next week's friendly against Argentina.",
                        "vi": "Ellis dự kiến sẽ là đội trưởng của đội trong trận giao hữu với Argentina vào tuần tới."
                    },
                    {
                        "en": "He played in the West Indies team captained by Clive Lloyd.",
                        "vi": "Anh ấy đã chơi trong đội West Indies do Clive Lloyd làm đội trưởng."
                    },
                    {
                        "en": "He told us about the ship he had captained during the war.",
                        "vi": "Anh ấy kể cho chúng tôi nghe về con tàu mà anh ấy đã làm thuyền trưởng trong chiến tranh."
                    },
                    {
                        "en": "She will captain England on their tour to Australia.",
                        "vi": "Cô ấy sẽ đội trưởng đội tuyển Anh trong chuyến lưu diễn của họ đến Úc."
                    }
                ]
            }
        ]
    },
    {
        "id": "ad2a13567cc34a758aec770b3e7ad6e7",
        "word": "chief",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/tʃiːf/",
            "us": "/tʃiːf/"
        },
        "nearby": [
            {
                "word": "chide",
                "pos": "verb"
            },
            {
                "word": "chief",
                "pos": "adjective"
            },
            {
                "word": "chief",
                "pos": "noun"
            },
            {
                "word": "chief constable",
                "pos": "noun"
            },
            {
                "word": "the Chief Diplomat",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person with a high rank or the highest rank in a company or an organization",
                    "vi": "một người có cấp bậc cao hoặc cấp bậc cao nhất trong một công ty hoặc một tổ chức"
                },
                "examples": [
                    {
                        "en": "army/police chiefs",
                        "vi": "giám đốc quân đội / cảnh sát"
                    },
                    {
                        "en": "She is Washington bureau chief for ‘USA Today’.",
                        "vi": "Cô ấy là trưởng văn phòng Washington cho 'USA Today'."
                    },
                    {
                        "en": "industry chiefs",
                        "vi": "trưởng ngành"
                    },
                    {
                        "en": "education chiefs at Sheffield Council",
                        "vi": "giám đốc giáo dục tại Sheffield Council"
                    },
                    {
                        "en": "chief of somebody/something He served as chief of police between 2002 and 2009.",
                        "vi": "trưởng của ai đó / cái gì đó Ông từng là cảnh sát trưởng từ năm 2002 đến năm 2009."
                    },
                    {
                        "en": "our new chief of operations",
                        "vi": "giám đốc hoạt động mới của chúng tôi"
                    }
                ]
            },
            {
                "define": {
                    "en": "a leader of a people or community",
                    "vi": "một nhà lãnh đạo của một người dân hoặc cộng đồng"
                },
                "examples": [
                    {
                        "en": "Chief Buthelezi",
                        "vi": "Trưởng Buthelezi"
                    },
                    {
                        "en": "Chief Crazy Horse",
                        "vi": "Trưởng ngựa điên"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to describe a situation in which there are too many people telling other people what to do, and not enough people to do the work",
                    "vi": "được sử dụng để mô tả một tình huống trong đó có quá nhiều người bảo người khác phải làm gì và không có đủ người để thực hiện công việc"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "79c265a26dfb4ed1830aa6910c17dade",
        "word": "class",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/klɑːs/",
            "us": "/klæs/"
        },
        "nearby": [
            {
                "word": "clasp",
                "pos": "noun"
            },
            {
                "word": "class",
                "pos": "noun"
            },
            {
                "word": "class",
                "pos": "verb"
            },
            {
                "word": "class",
                "pos": "adjective"
            },
            {
                "word": "class action",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to think or decide that somebody/something is a particular type of person or thing",
                    "vi": "để suy nghĩ hoặc quyết định rằng ai đó / điều gì đó là một loại người hoặc vật cụ thể"
                },
                "examples": [
                    {
                        "en": "be classed as something Immigrant workers were classed as aliens.",
                        "vi": "được phân loại như một cái gì đó Công nhân nhập cư được phân loại như người ngoài hành tinh."
                    },
                    {
                        "en": "The house could hardly be classed as a desirable property!",
                        "vi": "Ngôi nhà khó có thể được xếp vào loại tài sản đáng mơ ước!"
                    },
                    {
                        "en": "class somebody/something as something I wouldn't have classed you as a Shakespeare fan.",
                        "vi": "phân loại ai đó / cái gì đó như một cái gì đó Tôi sẽ không xếp bạn là một người hâm mộ Shakespeare."
                    }
                ]
            }
        ]
    },
    {
        "id": "0fdbfd02ac9749e9a3beda0a32c8cd62",
        "word": "duke",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/djuːk/",
            "us": "/duːk/"
        },
        "nearby": [
            {
                "word": "DUI",
                "pos": "abbreviation"
            },
            {
                "word": "du jour",
                "pos": "adjective"
            },
            {
                "word": "duke",
                "pos": "noun"
            },
            {
                "word": "duke",
                "pos": "verb"
            },
            {
                "word": "dukedom",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a nobleman of the highest rank",
                    "vi": "một nhà quý tộc có cấp bậc cao nhất"
                },
                "examples": [
                    {
                        "en": "the Duke of Edinburgh",
                        "vi": "Công tước Edinburgh"
                    }
                ]
            },
            {
                "define": {
                    "en": "(in some parts of Europe, especially in the past) a male ruler of a small independent state",
                    "vi": "(ở một số vùng của Châu Âu, đặc biệt là trong quá khứ) một nam giới cai trị một quốc gia độc lập nhỏ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "01973f624f004dc0a59ebda9359018c4",
        "word": "emperor",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈempərə(r)/",
            "us": "/ˈempərər/"
        },
        "nearby": [
            {
                "word": "empathize",
                "pos": "verb"
            },
            {
                "word": "empathy",
                "pos": "noun"
            },
            {
                "word": "emperor",
                "pos": "noun"
            },
            {
                "word": "emperor penguin",
                "pos": "noun"
            },
            {
                "word": "emphasis",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the ruler of an empire",
                    "vi": "người cai trị một đế chế"
                },
                "examples": [
                    {
                        "en": "the Roman emperors",
                        "vi": "các hoàng đế La mã"
                    },
                    {
                        "en": "the Emperor Napoleon",
                        "vi": "Hoàng đế Napoléon"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to describe a situation in which everybody suddenly realizes that they were wrong to believe that somebody/something was very good, important, etc.",
                    "vi": "được sử dụng để mô tả một tình huống mà mọi người đột nhiên nhận ra rằng họ đã sai khi tin rằng ai đó / điều gì đó rất tốt, quan trọng, v.v."
                },
                "examples": [
                    {
                        "en": "Is this artist's white canvas a case of the emperor's new clothes or is it something beautiful, even moving?",
                        "vi": "Tấm vải trắng của nghệ sĩ này là một bộ quần áo mới của hoàng đế hay là một thứ gì đó đẹp đẽ, thậm chí có thể chuyển động?"
                    },
                    {
                        "en": "Soon investors will realize that the emperor has no clothes and there will be a big sell-off in stocks.",
                        "vi": "Các nhà đầu tư sẽ sớm nhận ra rằng hoàng đế không có quần áo và sẽ có một đợt bán tháo cổ phiếu lớn."
                    }
                ]
            }
        ]
    },
    {
        "id": "d0c5b6cf1ba34e9283a3ad5d7165f3a7",
        "word": "homeless",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈhəʊmləs/",
            "us": "/ˈhəʊmləs/"
        },
        "nearby": [
            {
                "word": "homeland",
                "pos": "noun"
            },
            {
                "word": "homeland security",
                "pos": "noun"
            },
            {
                "word": "homeless",
                "pos": "adjective"
            },
            {
                "word": "homelessness",
                "pos": "noun"
            },
            {
                "word": "home loan",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "having no home, and therefore typically living on the streets",
                    "vi": "không có nhà và do đó thường sống trên đường phố"
                },
                "examples": [
                    {
                        "en": "The scheme has been set up to help homeless people.",
                        "vi": "Chương trình đã được thành lập để giúp đỡ những người vô gia cư."
                    },
                    {
                        "en": "The local authority ruled that he had made himself intentionally homeless and was therefore not entitled to be rehoused.",
                        "vi": "Chính quyền địa phương đã phán quyết rằng anh ta đã cố ý biến mình thành vô gia cư và do đó không được phép sử dụng lại."
                    },
                    {
                        "en": "Three hundred people were left homeless by the earthquake.",
                        "vi": "Ba trăm người mất nhà cửa do trận động đất."
                    }
                ]
            },
            {
                "define": {
                    "en": "people who have no home",
                    "vi": "những người không có nhà"
                },
                "examples": [
                    {
                        "en": "helping the homeless",
                        "vi": "giúp đỡ người vô gia cư"
                    }
                ]
            }
        ]
    },
    {
        "id": "7e3c6c4e6f7a4a79afc567b76a55953b",
        "word": "knight",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/naɪt/",
            "us": "/naɪt/"
        },
        "nearby": [
            {
                "word": "knife-edge",
                "pos": "noun"
            },
            {
                "word": "knifepoint",
                "pos": "noun"
            },
            {
                "word": "knight",
                "pos": "noun"
            },
            {
                "word": "knight",
                "pos": "verb"
            },
            {
                "word": "Knight Commander",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "(in the Middle Ages) a man of high social rank who had a duty to fight for his king. Knights are often shown in pictures riding horses and wearing armour.",
                    "vi": "(trong thời Trung Cổ) một người đàn ông có địa vị xã hội cao, người có nhiệm vụ chiến đấu cho vị vua của mình. Các hiệp sĩ thường được thể hiện trong các bức tranh cưỡi ngựa và mặc áo giáp."
                },
                "examples": [
                    {
                        "en": "tales of medieval knights errant, wandering in search of chivalrous adventures",
                        "vi": "câu chuyện về những hiệp sĩ thời trung cổ sai lầm, lang thang tìm kiếm những cuộc phiêu lưu hào hiệp"
                    }
                ]
            },
            {
                "define": {
                    "en": "(in the UK) a man who has been given a special honour by the king or queen and has the title Sir before his name",
                    "vi": "(ở Anh) một người đàn ông được vua hoặc hoàng hậu đặc biệt tôn vinh và có tước hiệu Ngài trước tên"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a piece used in the game of chess that is like a horse’s head in shape",
                    "vi": "một quân cờ được sử dụng trong trò chơi cờ vua giống như hình đầu ngựa"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a man who saves somebody, especially a woman, from a dangerous situation",
                    "vi": "một người đàn ông cứu ai đó, đặc biệt là một người phụ nữ, khỏi một tình huống nguy hiểm"
                },
                "examples": [
                    {
                        "en": "She's still waiting for a knight in shining armour to come and rescue her.",
                        "vi": "Cô ấy vẫn đang chờ một hiệp sĩ trong bộ giáp sáng chói đến và giải cứu cô ấy."
                    }
                ]
            }
        ]
    },
    {
        "id": "b0c903d3e67a4006991802e86da0680d",
        "word": "lady",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈleɪdi/",
            "us": "/ˈleɪdi/"
        },
        "nearby": [
            {
                "word": "la dolce vita",
                "pos": "noun"
            },
            {
                "word": "ladoo",
                "pos": "noun"
            },
            {
                "word": "lady",
                "pos": "noun"
            },
            {
                "word": "ladybird",
                "pos": "noun"
            },
            {
                "word": "Ladybird",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a word used to mean ‘woman’ that some people, especially older people, consider is more polite",
                    "vi": "một từ dùng để chỉ 'phụ nữ' mà một số người, đặc biệt là những người lớn tuổi, coi là lịch sự hơn"
                },
                "examples": [
                    {
                        "en": "There's a lady waiting to see you.",
                        "vi": "Có một phụ nữ đang đợi để gặp bạn."
                    },
                    {
                        "en": "an old/elderly lady",
                        "vi": "một bà già / bà già"
                    },
                    {
                        "en": "He was with an attractive young lady.",
                        "vi": "Anh ta đang ở với một cô gái trẻ hấp dẫn."
                    },
                    {
                        "en": "And who is this lovely lady?",
                        "vi": "Và cô gái đáng yêu này là ai?"
                    },
                    {
                        "en": "the lady with the red hair",
                        "vi": "người phụ nữ có mái tóc đỏ"
                    },
                    {
                        "en": "the lady in the designer dress",
                        "vi": "người phụ nữ mặc váy hàng hiệu"
                    },
                    {
                        "en": "the ladies’ golf championship",
                        "vi": "giải vô địch gôn dành cho phụ nữ"
                    },
                    {
                        "en": "(British English, old-fashioned) a tea lady (= a woman who serves tea in an office)",
                        "vi": "(Tiếng Anh Anh, kiểu cổ) a tea lady (= người phụ nữ phục vụ trà trong văn phòng)"
                    },
                    {
                        "en": "(North American English, approving) She's a tough lady.",
                        "vi": "(Tiếng Anh Bắc Mỹ, tán thành) Cô ấy là một phụ nữ cứng rắn."
                    },
                    {
                        "en": "a lady doctor/golfer",
                        "vi": "một bà bác sĩ / vận động viên chơi gôn"
                    }
                ]
            },
            {
                "define": {
                    "en": "a woman who is polite and well educated, has excellent manners and always behaves well",
                    "vi": "một người phụ nữ lịch sự và được giáo dục tốt, có cách cư xử tuyệt vời và luôn cư xử tốt"
                },
                "examples": [
                    {
                        "en": "His wife was a real lady.",
                        "vi": "Vợ anh là một phụ nữ thực sự."
                    },
                    {
                        "en": "You could at least try to behave like a lady.",
                        "vi": "Ít nhất bạn có thể cố gắng cư xử như một quý cô."
                    }
                ]
            },
            {
                "define": {
                    "en": "used when speaking to or about a girl or woman, especially somebody you do not know",
                    "vi": "được sử dụng khi nói với hoặc về một cô gái hoặc phụ nữ, đặc biệt là người nào đó mà bạn không biết"
                },
                "examples": [
                    {
                        "en": "Can I take your coats, ladies?",
                        "vi": "Tôi có thể lấy áo khoác của cô không?"
                    },
                    {
                        "en": "Could I have your attention, ladies and gentlemen?",
                        "vi": "Tôi có thể có sự chú ý của bạn, thưa quý vị?"
                    }
                ]
            },
            {
                "define": {
                    "en": "an informal way to talk to a woman, showing a lack of respect",
                    "vi": "một cách thân mật để nói chuyện với một phụ nữ, thể hiện sự thiếu tôn trọng"
                },
                "examples": [
                    {
                        "en": "Listen, lady, don't shout at me.",
                        "vi": "Nghe này, cô gái, đừng hét vào mặt tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "(in the UK) a woman belonging to a high social class",
                    "vi": "(ở Anh) một phụ nữ thuộc tầng lớp xã hội cao"
                },
                "examples": [
                    {
                        "en": "the lords and ladies of the court",
                        "vi": "các lãnh chúa và quý bà của triều đình"
                    },
                    {
                        "en": "a lady’s maid",
                        "vi": "một cô hầu gái"
                    }
                ]
            },
            {
                "define": {
                    "en": "(in the UK) a title used by a woman who is a member of the nobility, or by somebody who has been given the title ‘lady’ as an honour. The wives and daughters of some members of the nobility and the wives of knights are also called ‘Lady’.",
                    "vi": "(ở Anh) một danh hiệu được sử dụng bởi một phụ nữ là thành viên của giới quý tộc, hoặc bởi một người nào đó đã được phong danh hiệu 'quý bà' như một sự tôn vinh. Vợ và con gái của một số thành viên trong giới quý tộc và vợ của các hiệp sĩ cũng được gọi là 'Lady'."
                },
                "examples": [
                    {
                        "en": "Lady Howe",
                        "vi": "Quý bà Howe"
                    },
                    {
                        "en": "Lady Jane Grey",
                        "vi": "Lady Jane Grey"
                    }
                ]
            },
            {
                "define": {
                    "en": "a toilet for women in a public building or place",
                    "vi": "nhà vệ sinh cho phụ nữ trong một tòa nhà hoặc nơi công cộng"
                },
                "examples": [
                    {
                        "en": "Could you tell me where the ladies is?",
                        "vi": "Bạn có thể cho tôi biết các phụ nữ ở đâu?"
                    }
                ]
            },
            {
                "define": {
                    "en": "a title used to refer to Mary, the mother of Christ, especially in the Roman Catholic Church",
                    "vi": "một danh hiệu được sử dụng để chỉ Mary, mẹ của Chúa Kitô, đặc biệt là trong Giáo hội Công giáo La mã"
                },
                "examples": [
                    {
                        "en": "Our Lady of Lourdes",
                        "vi": "Đức Mẹ Lộ Đức"
                    }
                ]
            },
            {
                "define": {
                    "en": "a man/woman who does not have to work",
                    "vi": "một người đàn ông / phụ nữ không phải làm việc"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used for saying that a situation may still change, for example that a contest, election, etc. is not finished yet, and somebody still has a chance to win it",
                    "vi": "được sử dụng để nói rằng một tình huống vẫn có thể thay đổi, chẳng hạn như một cuộc thi, cuộc bầu cử, v.v. vẫn chưa kết thúc và ai đó vẫn có cơ hội giành chiến thắng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "ff3c762214cf40c290f389c34eab4b9c",
        "word": "leadership",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈliːdəʃɪp/",
            "us": "/ˈliːdərʃɪp/"
        },
        "nearby": [
            {
                "word": "the Leader of the House",
                "pos": "noun"
            },
            {
                "word": "the Leader of the Opposition",
                "pos": "noun"
            },
            {
                "word": "leadership",
                "pos": "noun"
            },
            {
                "word": "lead-free",
                "pos": "adjective"
            },
            {
                "word": "lead guitar",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the state or position of being a leader",
                    "vi": "trạng thái hoặc vị trí của một nhà lãnh đạo"
                },
                "examples": [
                    {
                        "en": "a leadership role/position",
                        "vi": "một vai trò / vị trí lãnh đạo"
                    },
                    {
                        "en": "a leadership contest",
                        "vi": "một cuộc thi lãnh đạo"
                    },
                    {
                        "en": "the battle for the party leadership",
                        "vi": "cuộc chiến giành quyền lãnh đạo của đảng"
                    },
                    {
                        "en": "Who will take over the leadership of the club?",
                        "vi": "Ai sẽ nắm quyền lãnh đạo câu lạc bộ?"
                    },
                    {
                        "en": "under somebody's leadership The party thrived under his leadership.",
                        "vi": "dưới sự lãnh đạo của ai đó Đảng phát triển mạnh dưới sự lãnh đạo của ông."
                    }
                ]
            },
            {
                "define": {
                    "en": "the ability to be a leader or the qualities a good leader should have",
                    "vi": "khả năng trở thành một nhà lãnh đạo hoặc những phẩm chất mà một nhà lãnh đạo giỏi cần phải có"
                },
                "examples": [
                    {
                        "en": "Strong leadership is needed to captain the team.",
                        "vi": "Cần có khả năng lãnh đạo mạnh mẽ để chỉ huy đội."
                    },
                    {
                        "en": "Many in the party have criticized his lack of leadership.",
                        "vi": "Nhiều người trong đảng đã chỉ trích sự thiếu khả năng lãnh đạo của ông."
                    },
                    {
                        "en": "leadership qualities/skills",
                        "vi": "phẩm chất / kỹ năng lãnh đạo"
                    },
                    {
                        "en": "In his resignation speech he condemned her leadership style.",
                        "vi": "Trong bài phát biểu từ chức của mình, ông đã lên án phong cách lãnh đạo của bà."
                    },
                    {
                        "en": "leadership in something They called on the United State to show greater leadership in the fight against international terrorism.",
                        "vi": "lãnh đạo trong một lĩnh vực nào đó Họ kêu gọi Hoa Kỳ thể hiện vai trò lãnh đạo lớn hơn trong cuộc chiến chống chủ nghĩa khủng bố quốc tế."
                    },
                    {
                        "en": "leadership in doing something She criticized the industrialized nations for failing to provide leadership in tackling climate change.",
                        "vi": "lãnh đạo trong việc thực hiện một điều gì đó Bà chỉ trích các quốc gia công nghiệp phát triển đã không đưa ra được vai trò lãnh đạo trong việc giải quyết vấn đề biến đổi khí hậu."
                    }
                ]
            },
            {
                "define": {
                    "en": "a group of leaders of a particular organization, etc.",
                    "vi": "một nhóm các nhà lãnh đạo của một tổ chức cụ thể, v.v."
                },
                "examples": [
                    {
                        "en": "The party leadership is/are divided.",
                        "vi": "Sự lãnh đạo của đảng đang bị chia rẽ."
                    }
                ]
            }
        ]
    },
    {
        "id": "3a06fd5ec56d4ced93ec9cc7cf1cedcc",
        "word": "lord",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/lɔːd/",
            "us": "/lɔːrd/"
        },
        "nearby": [
            {
                "word": "loquacity",
                "pos": "noun"
            },
            {
                "word": "loquat",
                "pos": "noun"
            },
            {
                "word": "lord",
                "pos": "noun"
            },
            {
                "word": "lord",
                "pos": "verb"
            },
            {
                "word": "the Lord Advocate",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "(in the UK) a man of high rank in the nobility (= people of high social class), or somebody who has been given the title ‘lord’ as an honour",
                    "vi": "(ở Anh) một người đàn ông có địa vị cao trong giới quý tộc (= những người thuộc tầng lớp xã hội cao), hoặc một người nào đó đã được phong tước hiệu 'lãnh chúa' như một sự vinh dự"
                },
                "examples": [
                    {
                        "en": "She's married to a lord.",
                        "vi": "Cô ấy đã kết hôn với một lãnh chúa."
                    },
                    {
                        "en": "The head of the successful construction group became a lord in 1984.",
                        "vi": "Người đứng đầu nhóm xây dựng thành công trở thành lãnh chúa vào năm 1984."
                    },
                    {
                        "en": "They entered a huge hall filled with lords and ladies.",
                        "vi": "Họ bước vào một đại sảnh đầy ắp các lãnh chúa và quý bà."
                    }
                ]
            },
            {
                "define": {
                    "en": "(in the UK) the title used by a lord",
                    "vi": "(ở Anh) danh hiệu được sử dụng bởi một lãnh chúa"
                },
                "examples": [
                    {
                        "en": "Lord Beaverbrook",
                        "vi": "Lord Beaverbrook"
                    },
                    {
                        "en": "He was made a peer and took the title Lord Northcliffe.",
                        "vi": "Anh ta được xếp vào hàng ngang hàng và lấy danh hiệu Chúa tể Northcliffe."
                    }
                ]
            },
            {
                "define": {
                    "en": "a title used for some high official positions in the UK",
                    "vi": "một chức danh được sử dụng cho một số vị trí chính thức cao ở Vương quốc Anh"
                },
                "examples": [
                    {
                        "en": "the Lord Chancellor",
                        "vi": "Chúa tể tể tướng"
                    },
                    {
                        "en": "the Lord Mayor",
                        "vi": "Chúa thị trưởng"
                    },
                    {
                        "en": "Lord Justice Slade",
                        "vi": "Chúa công lý Slade"
                    }
                ]
            },
            {
                "define": {
                    "en": "(in the UK) a title of respect used when speaking to a judge, bishop or some male members of the nobility (= people of high social class)",
                    "vi": "(ở Anh) một danh hiệu tôn trọng được sử dụng khi nói chuyện với thẩm phán, giám mục hoặc một số thành viên nam trong giới quý tộc (= những người thuộc tầng lớp xã hội cao)"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a powerful man in medieval Europe, who owned a lot of land and property",
                    "vi": "một người đàn ông quyền lực ở Châu Âu thời trung cổ, người sở hữu rất nhiều đất đai và tài sản"
                },
                "examples": [
                    {
                        "en": "a feudal lord",
                        "vi": "một lãnh chúa phong kiến"
                    },
                    {
                        "en": "the lord of the manor",
                        "vi": "chúa tể của trang viên"
                    }
                ]
            },
            {
                "define": {
                    "en": "a title used to refer to God or Christ",
                    "vi": "một danh hiệu được sử dụng để chỉ Đức Chúa Trời hoặc Đấng Christ"
                },
                "examples": [
                    {
                        "en": "Love the Lord with all your heart.",
                        "vi": "Hãy hết lòng yêu mến Chúa."
                    }
                ]
            },
            {
                "define": {
                    "en": "a title used to refer to Christ",
                    "vi": "một danh hiệu dùng để chỉ Đấng Christ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "(in the UK) the part of Parliament whose members are not elected by the people of the country",
                    "vi": "(ở Vương quốc Anh) một phần của Nghị viện mà các thành viên không được người dân trong nước bầu chọn"
                },
                "examples": [
                    {
                        "en": "The Lords has/have not yet reached a decision.",
                        "vi": "Các Lãnh chúa vẫn chưa đưa ra quyết định."
                    }
                ]
            },
            {
                "define": {
                    "en": "the building where members of the House of Lords meet",
                    "vi": "tòa nhà nơi các thành viên của House of Lords gặp gỡ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "very drunk",
                    "vi": "rất say"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to show that you are surprised, annoyed or worried about something",
                    "vi": "được sử dụng để cho thấy rằng bạn đang ngạc nhiên, khó chịu hoặc lo lắng về điều gì đó"
                },
                "examples": [
                    {
                        "en": "Good Lord, what have you done to your hair!",
                        "vi": "Lạy Chúa, Chúa đã làm gì với mái tóc của mình!"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to emphasize what you are saying",
                    "vi": "được sử dụng để nhấn mạnh những gì bạn đang nói"
                },
                "examples": [
                    {
                        "en": "Lord knows, I tried to teach her.",
                        "vi": "Chúa biết không, tôi đã cố gắng dạy cô ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that you do not know the answer to something",
                    "vi": "từng nói rằng bạn không biết câu trả lời cho điều gì đó"
                },
                "examples": [
                    {
                        "en": "‘Why did she say that?’ ‘Lord knows!’",
                        "vi": "Tại sao cô ấy lại nói như vậy?' 'Chúa mới biết!'"
                    }
                ]
            },
            {
                "define": {
                    "en": "any particular year after the birth of Christ",
                    "vi": "bất kỳ năm cụ thể nào sau khi Chúa giáng sinh"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "937b435c8acb4e428e26ea160ed2a5f4",
        "word": "the lower classes",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ðə ˌləʊə ˈklɑːsɪz/",
            "us": "/ðə ˌləʊər ˈklæsɪz/"
        },
        "nearby": [
            {
                "word": "lower chamber",
                "pos": "noun"
            },
            {
                "word": "lower class",
                "pos": "adjective"
            },
            {
                "word": "the lower classes",
                "pos": "noun"
            },
            {
                "word": "the Lower East Side",
                "pos": ""
            },
            {
                "word": "lower house",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the groups of people who are considered to have the lowest social status and who have less money and/or power than other people in society",
                    "vi": "những nhóm người được coi là có địa vị xã hội thấp nhất và có ít tiền và / hoặc quyền lực hơn những người khác trong xã hội"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c6094d21723049149b618f83f4029370",
        "word": "middle class",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˌmɪdl ˈklɑːs/",
            "us": "/ˌmɪdl ˈklæs/"
        },
        "nearby": [
            {
                "word": "middlebrow",
                "pos": "adjective"
            },
            {
                "word": "middle C",
                "pos": "noun"
            },
            {
                "word": "middle class",
                "pos": "noun"
            },
            {
                "word": "middle-class",
                "pos": "adjective"
            },
            {
                "word": "middle-distance",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the social class whose members are neither very rich nor very poor and that includes professional and business people",
                    "vi": "tầng lớp xã hội có các thành viên không quá giàu cũng không quá nghèo và bao gồm những người chuyên nghiệp và kinh doanh"
                },
                "examples": [
                    {
                        "en": "the upper/lower middle class",
                        "vi": "tầng lớp trung lưu trên / dưới"
                    },
                    {
                        "en": "the growth of the middle classes",
                        "vi": "sự phát triển của các tầng lớp trung lưu"
                    }
                ]
            }
        ]
    },
    {
        "id": "d990e1a3a98e49c9bc3e54bc8e203865",
        "word": "middle-class",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/ˌmɪdl ˈklɑːs/",
            "us": "/ˌmɪdl ˈklæs/"
        },
        "nearby": [
            {
                "word": "middle C",
                "pos": "noun"
            },
            {
                "word": "middle class",
                "pos": "noun"
            },
            {
                "word": "middle-class",
                "pos": "adjective"
            },
            {
                "word": "middle-distance",
                "pos": "adjective"
            },
            {
                "word": "the middle distance",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "connected with the middle social class",
                    "vi": "kết nối với tầng lớp xã hội trung lưu"
                },
                "examples": [
                    {
                        "en": "a middle-class background/family/suburb",
                        "vi": "xuất thân trung lưu / gia đình / vùng ngoại ô"
                    }
                ]
            },
            {
                "define": {
                    "en": "typical of people from the middle social class, for example having traditional views",
                    "vi": "điển hình của những người thuộc tầng lớp xã hội trung lưu, ví dụ có quan điểm truyền thống"
                },
                "examples": [
                    {
                        "en": "a middle-class attitude",
                        "vi": "một thái độ trung lưu"
                    },
                    {
                        "en": "The magazine is very middle-class.",
                        "vi": "Tạp chí rất trung lưu."
                    },
                    {
                        "en": "The club has become very middle-class.",
                        "vi": "Câu lạc bộ đã trở nên rất trung lưu."
                    }
                ]
            }
        ]
    },
    {
        "id": "dd42c27d15ac40d584b6f042d0c96064",
        "word": "monarch",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈmɒnək/",
            "us": "/ˈmɑːnərk/"
        },
        "nearby": [
            {
                "word": "Monaco",
                "pos": "noun"
            },
            {
                "word": "monad",
                "pos": "noun"
            },
            {
                "word": "monarch",
                "pos": "noun"
            },
            {
                "word": "monarch butterfly",
                "pos": "noun"
            },
            {
                "word": "monarchical",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who rules a country, for example a king or a queen",
                    "vi": "một người cai trị một quốc gia, ví dụ như một vị vua hoặc một nữ hoàng"
                },
                "examples": [
                    {
                        "en": "a new law which limited the power of the monarch",
                        "vi": "một luật mới hạn chế quyền lực của quân vương"
                    },
                    {
                        "en": "Queen Victoria was England's longest reigning monarch.",
                        "vi": "Nữ hoàng Victoria là vị vua trị vì lâu nhất của nước Anh."
                    },
                    {
                        "en": "The constitutional monarch , as head of state, has limited powers.",
                        "vi": "Quân chủ lập hiến, với tư cách là nguyên thủ quốc gia, có quyền hạn hạn chế."
                    }
                ]
            }
        ]
    },
    {
        "id": "5953415e099947ceb43f8a23d59f7eef",
        "word": "rank",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ræŋk/",
            "us": "/ræŋk/"
        },
        "nearby": [
            {
                "word": "rangy",
                "pos": "adjective"
            },
            {
                "word": "rani",
                "pos": "noun"
            },
            {
                "word": "rank",
                "pos": "noun"
            },
            {
                "word": "J Arthur Rank",
                "pos": ""
            },
            {
                "word": "rank",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the position, especially a high position, that somebody has in a particular organization, society, etc.",
                    "vi": "vị trí, đặc biệt là vị trí cao, mà ai đó có trong một tổ chức, xã hội cụ thể, v.v."
                },
                "examples": [
                    {
                        "en": "She was not used to mixing with people of high social rank.",
                        "vi": "Cô không quen hòa mình với những người có địa vị cao trong xã hội."
                    },
                    {
                        "en": "He rose through the ranks to become managing director.",
                        "vi": "Ông đã vượt qua các cấp bậc để trở thành giám đốc điều hành."
                    },
                    {
                        "en": "Within months she was elevated to ministerial rank.",
                        "vi": "Trong vòng vài tháng, cô đã được nâng lên cấp bộ trưởng."
                    },
                    {
                        "en": "in rank Promotion will mean that I’m immediately above him in rank.",
                        "vi": "thăng hạng có nghĩa là tôi ngay lập tức xếp trên anh ta về thứ hạng."
                    },
                    {
                        "en": "rank of something Barons are the lowest rank of the nobility.",
                        "vi": "cấp bậc của một thứ gì đó Nam tước là cấp bậc thấp nhất của giới quý tộc."
                    }
                ]
            },
            {
                "define": {
                    "en": "the position that somebody has in the army, navy, police, etc.",
                    "vi": "vị trí mà ai đó có trong quân đội, hải quân, cảnh sát, v.v."
                },
                "examples": [
                    {
                        "en": "rank of something He was soon promoted to the rank of captain.",
                        "vi": "cấp bậc của một cái gì đó Ông đã sớm được thăng cấp bậc đại đội trưởng."
                    },
                    {
                        "en": "He rose steadily through the ranks and retired as a lieutenant-colonel.",
                        "vi": "Ông thăng tiến đều đặn qua các cấp bậc và nghỉ hưu với quân hàm trung tá."
                    },
                    {
                        "en": "officers of junior/senior rank",
                        "vi": "sĩ quan cấp tá / cấp cao"
                    },
                    {
                        "en": "officers and other ranks (= people who are not officers)",
                        "vi": "sĩ quan và các cấp bậc khác (= những người không phải là sĩ quan)"
                    },
                    {
                        "en": "The colonel was stripped of his rank (= was given a lower position, especially as a punishment).",
                        "vi": "Đại tá bị tước quân hàm (= được trao một chức vụ thấp hơn, đặc biệt là như một hình phạt)."
                    },
                    {
                        "en": "in rank a military commander similar in rank to a modern general",
                        "vi": "trong cấp bậc chỉ huy quân sự tương tự như cấp bậc của một vị tướng hiện đại"
                    }
                ]
            },
            {
                "define": {
                    "en": "the position of ordinary soldiers rather than officers; the army",
                    "vi": "vị trí của những người lính bình thường hơn là sĩ quan; quân đội"
                },
                "examples": [
                    {
                        "en": "He served in the ranks for most of the war.",
                        "vi": "Ông đã phục vụ trong hàng ngũ trong hầu hết thời gian của cuộc chiến."
                    },
                    {
                        "en": "He rose from the ranks (= from being an ordinary soldier) to become a warrant officer.",
                        "vi": "Anh ta đã vượt lên từ hàng ngũ (= từ một người lính bình thường) để trở thành một sĩ quan cảnh sát."
                    },
                    {
                        "en": "a campaign to attract more women into the military ranks",
                        "vi": "một chiến dịch thu hút nhiều phụ nữ hơn vào hàng ngũ quân đội"
                    }
                ]
            },
            {
                "define": {
                    "en": "the degree to which somebody/something is of high quality",
                    "vi": "mức độ mà ai đó / cái gì đó có chất lượng cao"
                },
                "examples": [
                    {
                        "en": "a painter of the first rank",
                        "vi": "một họa sĩ của hạng nhất"
                    },
                    {
                        "en": "Britain is no longer in the front rank of world powers.",
                        "vi": "Nước Anh không còn ở vị trí hàng đầu của các cường quốc trên thế giới."
                    },
                    {
                        "en": "The findings are arranged in rank order according to performance.",
                        "vi": "Các phát hiện được sắp xếp theo thứ tự xếp hạng theo hiệu suất."
                    }
                ]
            },
            {
                "define": {
                    "en": "the members of a particular group or organization",
                    "vi": "các thành viên của một nhóm hoặc tổ chức cụ thể"
                },
                "examples": [
                    {
                        "en": "We have a number of international players in our ranks.",
                        "vi": "Chúng tôi có một số tuyển thủ quốc tế trong hàng ngũ của mình."
                    },
                    {
                        "en": "At 50, he was forced to join the ranks of the unemployed.",
                        "vi": "Ở tuổi 50, ông buộc phải gia nhập hàng ngũ những người thất nghiệp."
                    },
                    {
                        "en": "There were serious divisions within the party's own ranks.",
                        "vi": "Đã có sự chia rẽ nghiêm trọng trong hàng ngũ của đảng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a line or row of soldiers, police, etc. standing next to each other",
                    "vi": "một hàng hoặc hàng lính, cảnh sát, v.v. đứng cạnh nhau"
                },
                "examples": [
                    {
                        "en": "They watched as ranks of marching infantry passed the window.",
                        "vi": "Họ quan sát hàng ngũ bộ binh hành quân đi qua cửa sổ."
                    },
                    {
                        "en": "They fired at random into the enemy ranks.",
                        "vi": "Họ bắn ngẫu nhiên vào hàng ngũ đối phương."
                    }
                ]
            },
            {
                "define": {
                    "en": "a line or row of people or things",
                    "vi": "một dòng hoặc một hàng người hoặc sự vật"
                },
                "examples": [
                    {
                        "en": "massed ranks of spectators",
                        "vi": "hàng ngũ khán giả đông đảo"
                    },
                    {
                        "en": "The trees grew in serried ranks (= very closely together).",
                        "vi": "Các cây mọc thành hàng ngang (= rất gần nhau)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a number that gives the position of a member of a set of numbers",
                    "vi": "một số cung cấp vị trí của một thành viên của một tập hợp các số"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to fail to remain in line",
                    "vi": "không thể xếp hàng"
                },
                "examples": [
                    {
                        "en": "The police broke ranks and started hitting people with their batons.",
                        "vi": "Cảnh sát đã phá vỡ hàng ngũ và bắt đầu đánh mọi người bằng dùi cui của họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to refuse to support the group or the organization of which they are members",
                    "vi": "từ chối hỗ trợ nhóm hoặc tổ chức mà họ là thành viên"
                },
                "examples": [
                    {
                        "en": "Large numbers of MPs felt compelled to break ranks over the issue.",
                        "vi": "Một số lượng lớn các nghị sĩ cảm thấy buộc phải phá bỏ cấp bậc vì vấn đề này."
                    },
                    {
                        "en": "He broke ranks with his fellow Republicans and opposed the war.",
                        "vi": "Anh ta đã phá bỏ hàng ngũ với những người bạn thuộc Đảng Cộng hòa của mình và phản đối chiến tranh."
                    }
                ]
            },
            {
                "define": {
                    "en": "if a group of people close ranks, they work closely together to defend themselves, especially when they are being criticized",
                    "vi": "nếu một nhóm người gần gũi với nhau, họ hợp tác chặt chẽ với nhau để bảo vệ mình, đặc biệt là khi họ đang bị chỉ trích"
                },
                "examples": [
                    {
                        "en": "It's not unusual for the police to close ranks when one of their officers is being investigated.",
                        "vi": "Không có gì lạ khi cảnh sát đóng quân khi một trong những sĩ quan của họ đang bị điều tra."
                    }
                ]
            },
            {
                "define": {
                    "en": "if soldiers close ranks, they move closer together in order to defend themselves",
                    "vi": "nếu binh lính đóng hàng ngũ, họ tiến lại gần nhau hơn để tự vệ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to make use of your place or status in society or at work to make somebody do what you want",
                    "vi": "để sử dụng vị trí hoặc địa vị của bạn trong xã hội hoặc tại nơi làm việc để khiến ai đó làm những gì bạn muốn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "6c9480e19d7745bbae2b02d4c60fcce8",
        "word": "senior",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈsiːniə(r)/",
            "us": "/ˈsiːniər/"
        },
        "nearby": [
            {
                "word": "senile dementia",
                "pos": "noun"
            },
            {
                "word": "senility",
                "pos": "noun"
            },
            {
                "word": "senior",
                "pos": "adjective"
            },
            {
                "word": "senior",
                "pos": "noun"
            },
            {
                "word": "senior aircraftman",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "high in rank or status; higher in rank or status than others",
                    "vi": "cao trong cấp bậc hoặc địa vị; thứ hạng hoặc địa vị cao hơn những người khác"
                },
                "examples": [
                    {
                        "en": "a senior official/officer/manager/executive",
                        "vi": "một quan chức cấp cao / cán bộ / quản lý / điều hành"
                    },
                    {
                        "en": "a senior adviser/analyst/lecturer",
                        "vi": "một cố vấn cao cấp / nhà phân tích / giảng viên"
                    },
                    {
                        "en": "a senior partner in a law firm",
                        "vi": "một đối tác cấp cao trong một công ty luật"
                    },
                    {
                        "en": "She is senior vice president of marketing.",
                        "vi": "Cô ấy là phó chủ tịch cấp cao của bộ phận tiếp thị."
                    },
                    {
                        "en": "senior figures in the Labour party",
                        "vi": "các nhân vật cấp cao trong đảng Lao động"
                    },
                    {
                        "en": "senior members of staff",
                        "vi": "thành viên cấp cao của nhân viên"
                    },
                    {
                        "en": "a senior position",
                        "vi": "một vị trí cao cấp"
                    },
                    {
                        "en": "a senior post/job",
                        "vi": "một bài đăng / công việc cao cấp"
                    },
                    {
                        "en": "I have ten years' experience at senior management level.",
                        "vi": "Tôi có mười năm kinh nghiệm ở cấp quản lý cấp cao."
                    },
                    {
                        "en": "(British English) Junior nurses usually work alongside more senior nurses.",
                        "vi": "(Tiếng Anh Anh) Các y tá nhỏ tuổi thường làm việc cùng với các y tá cao cấp hơn."
                    },
                    {
                        "en": "He is a former senior civil servant who now runs a campaign website.",
                        "vi": "Anh ta là một cựu công chức cấp cao hiện đang điều hành một trang web tranh cử."
                    },
                    {
                        "en": "senior to somebody He is senior to me.",
                        "vi": "cao cấp đối với ai đó Anh ấy là cấp cao đối với tôi."
                    },
                    {
                        "en": "The meeting should be chaired by the most senior person present.",
                        "vi": "Cuộc họp nên được chủ trì bởi người cao cấp nhất có mặt."
                    }
                ]
            },
            {
                "define": {
                    "en": "for adults or people at a more advanced level",
                    "vi": "dành cho người lớn hoặc những người ở trình độ cao hơn"
                },
                "examples": [
                    {
                        "en": "to take part in senior competitions",
                        "vi": "tham gia các cuộc thi cấp cao"
                    },
                    {
                        "en": "his first game of senior football",
                        "vi": "trận đấu đầu tiên của anh ấy trong bóng đá cao cấp"
                    },
                    {
                        "en": "He won the senior men's 400 metres.",
                        "vi": "Anh đã vô địch 400 m nam cao cấp."
                    }
                ]
            },
            {
                "define": {
                    "en": "for senior citizens (= older people, especially those who have retired from work)",
                    "vi": "dành cho người cao tuổi (= người lớn tuổi, đặc biệt là những người đã nghỉ việc)"
                },
                "examples": [
                    {
                        "en": "Get one third off rail fares with a senior railcard.",
                        "vi": "Nhận được một phần ba giá vé đường sắt với thẻ đường sắt cao cấp."
                    },
                    {
                        "en": "senior discounts/concessions",
                        "vi": "chiết khấu / ưu đãi cao cấp"
                    }
                ]
            },
            {
                "define": {
                    "en": "used after the name of a man who has the same name as his son, to make it clear who is being referred to",
                    "vi": "được sử dụng theo tên của một người đàn ông trùng tên với con trai ông ta, để làm rõ ai đang được nhắc đến"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "for children over the age of 11 or 13",
                    "vi": "dành cho trẻ em trên 11 hoặc 13 tuổi"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "connected with the last year in high school or college",
                    "vi": "liên thông với năm cuối trung học hoặc đại học"
                },
                "examples": [
                    {
                        "en": "the senior prom",
                        "vi": "buổi dạ hội cấp cao"
                    }
                ]
            }
        ]
    },
    {
        "id": "733366f4488446e2a1ab6d65a77a3458",
        "word": "status",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈsteɪtəs/",
            "us": "/ˈsteɪtəs/"
        },
        "nearby": [
            {
                "word": "statuette",
                "pos": "noun"
            },
            {
                "word": "stature",
                "pos": "noun"
            },
            {
                "word": "status",
                "pos": "noun"
            },
            {
                "word": "status bar",
                "pos": "noun"
            },
            {
                "word": "status quo",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the legal position of a person, group or country",
                    "vi": "vị trí pháp lý của một người, một nhóm hoặc quốc gia"
                },
                "examples": [
                    {
                        "en": "They were granted refugee status.",
                        "vi": "Họ đã được cấp quy chế tị nạn."
                    },
                    {
                        "en": "The party was denied legal status.",
                        "vi": "Đảng đã bị từ chối tư cách pháp nhân."
                    },
                    {
                        "en": "The company investigated the immigration status of its workers.",
                        "vi": "Công ty đã điều tra tình trạng nhập cư của công nhân."
                    }
                ]
            },
            {
                "define": {
                    "en": "the social or professional position of somebody/something in relation to others",
                    "vi": "vị trí xã hội hoặc nghề nghiệp của ai đó / cái gì đó trong mối quan hệ với những người khác"
                },
                "examples": [
                    {
                        "en": "She achieved celebrity status overnight.",
                        "vi": "Cô ấy đã đạt được vị thế người nổi tiếng chỉ sau một đêm."
                    },
                    {
                        "en": "Women are only asking to be given equal status with men.",
                        "vi": "Phụ nữ chỉ yêu cầu được bình đẳng với nam giới."
                    },
                    {
                        "en": "to have a high social status",
                        "vi": "có địa vị xã hội cao"
                    },
                    {
                        "en": "low status jobs",
                        "vi": "công việc tình trạng thấp"
                    }
                ]
            },
            {
                "define": {
                    "en": "high rank or social position",
                    "vi": "thứ hạng cao hoặc vị trí xã hội"
                },
                "examples": [
                    {
                        "en": "The job brings with it status and a high income.",
                        "vi": "Công việc mang lại địa vị và thu nhập cao."
                    }
                ]
            },
            {
                "define": {
                    "en": "the level of importance that is given to something",
                    "vi": "mức độ quan trọng được trao cho một thứ gì đó"
                },
                "examples": [
                    {
                        "en": "This reflects the high status accorded to science in our culture.",
                        "vi": "Điều này phản ánh vị thế cao dành cho khoa học trong nền văn hóa của chúng ta."
                    }
                ]
            },
            {
                "define": {
                    "en": "the situation at a particular time during a process",
                    "vi": "tình huống tại một thời điểm cụ thể trong một quá trình"
                },
                "examples": [
                    {
                        "en": "What is the current status of our application for funds?",
                        "vi": "Tình trạng hiện tại của đơn xin tiền của chúng tôi là gì?"
                    },
                    {
                        "en": "She updated her Facebook status to ‘in a relationship’.",
                        "vi": "Cô ấy đã cập nhật trạng thái Facebook của mình thành 'đang trong một mối quan hệ'."
                    },
                    {
                        "en": "He has told family and friends of his HIV status.",
                        "vi": "Anh ấy đã nói với gia đình và bạn bè về tình trạng nhiễm HIV của mình."
                    }
                ]
            }
        ]
    },
    {
        "id": "dfe95a5d69fc49ffb4db6a023851b2ba",
        "word": "aristocracy",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌærɪˈstɒkrəsi/",
            "us": "/ˌærɪˈstɑːkrəsi/"
        },
        "nearby": [
            {
                "word": "aright",
                "pos": "adverb"
            },
            {
                "word": "arise",
                "pos": "verb"
            },
            {
                "word": "aristocracy",
                "pos": "noun"
            },
            {
                "word": "aristocrat",
                "pos": "noun"
            },
            {
                "word": "aristocratic",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "(in some countries) people born in the highest social class, who have special titles",
                    "vi": "(ở một số quốc gia) những người sinh ra trong tầng lớp xã hội cao nhất, những người có chức danh đặc biệt"
                },
                "examples": [
                    {
                        "en": "members of the aristocracy",
                        "vi": "thành viên của tầng lớp quý tộc"
                    },
                    {
                        "en": "the landed aristocracy",
                        "vi": "tầng lớp quý tộc đất đai"
                    },
                    {
                        "en": "the shift of power from the aristocracy to the bourgeoisie",
                        "vi": "sự chuyển dịch quyền lực từ giai cấp quý tộc sang giai cấp tư sản"
                    }
                ]
            }
        ]
    },
    {
        "id": "e02044aa124949ef8d0ac424093adfe1",
        "word": "aristocrat",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈærɪstəkræt/",
            "us": "/əˈrɪstəkræt/"
        },
        "nearby": [
            {
                "word": "arise",
                "pos": "verb"
            },
            {
                "word": "aristocracy",
                "pos": "noun"
            },
            {
                "word": "aristocrat",
                "pos": "noun"
            },
            {
                "word": "aristocratic",
                "pos": "adjective"
            },
            {
                "word": "Aristotelian",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a member of the aristocracy",
                    "vi": "một thành viên của tầng lớp quý tộc"
                },
                "examples": [
                    {
                        "en": "The castle has been owned by a succession of wealthy aristocrats.",
                        "vi": "Lâu đài đã được sở hữu bởi một loạt các quý tộc giàu có."
                    },
                    {
                        "en": "At that time, diplomatic posts were filled by aristocrats.",
                        "vi": "Vào thời điểm đó, các chức vụ ngoại giao đã được lấp đầy bởi các nhà quý tộc."
                    },
                    {
                        "en": "He had the air of an aristocrat.",
                        "vi": "Anh ta có khí chất của một quý tộc."
                    },
                    {
                        "en": "He received the patronage of a minor local aristocrat.",
                        "vi": "Anh nhận được sự bảo trợ của một tiểu quý tộc địa phương."
                    },
                    {
                        "en": "The owners are French aristocrats who fled to England.",
                        "vi": "Chủ sở hữu là những quý tộc Pháp chạy sang Anh."
                    }
                ]
            }
        ]
    },
    {
        "id": "07affd75c46c4259837c9faea4363082",
        "word": "baron",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈbærən/",
            "us": "/ˈbærən/"
        },
        "nearby": [
            {
                "word": "barometer",
                "pos": "noun"
            },
            {
                "word": "barometric",
                "pos": "adjective"
            },
            {
                "word": "baron",
                "pos": "noun"
            },
            {
                "word": "baroness",
                "pos": "noun"
            },
            {
                "word": "baronet",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a nobleman of the lowest rank. In the UK, barons use the title Lord; in other countries they use the title Baron.",
                    "vi": "một nhà quý tộc của cấp bậc thấp nhất. Ở Anh, các nam tước sử dụng danh hiệu Lord; ở các quốc gia khác, họ sử dụng danh hiệu Nam tước."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a person who owns or controls a large part of a particular industry",
                    "vi": "một người sở hữu hoặc kiểm soát một phần lớn của một ngành cụ thể"
                },
                "examples": [
                    {
                        "en": "a press baron",
                        "vi": "một nam tước báo chí"
                    },
                    {
                        "en": "the oil barons of Texas",
                        "vi": "các ông trùm dầu mỏ của Texas"
                    }
                ]
            }
        ]
    },
    {
        "id": "b5682cb33cc84fa9946f9e9510b0ee5d",
        "word": "count",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/kaʊnt/",
            "us": "/kaʊnt/"
        },
        "nearby": [
            {
                "word": "counsellor",
                "pos": "noun"
            },
            {
                "word": "count",
                "pos": "verb"
            },
            {
                "word": "count",
                "pos": "noun"
            },
            {
                "word": "countable",
                "pos": "adjective"
            },
            {
                "word": "count against",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an act of counting to find the total number of somebody/something",
                    "vi": "một hành động đếm để tìm tổng số của ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "If the election result is close, there will be a second count.",
                        "vi": "Nếu kết quả bầu cử gần kề, sẽ có cuộc kiểm phiếu thứ hai."
                    },
                    {
                        "en": "The bus driver did a quick count of the empty seats.",
                        "vi": "Tài xế xe buýt đếm nhanh số ghế trống."
                    },
                    {
                        "en": "by somebody's count By my count there are eight tracks here that aren't on the band's three albums.",
                        "vi": "bởi ai đó đếm Theo đếm của tôi, có tám bản nhạc ở đây không có trong ba album của ban nhạc."
                    }
                ]
            },
            {
                "define": {
                    "en": "an act of saying numbers in order beginning with 1",
                    "vi": "hành động nói các số theo thứ tự bắt đầu bằng 1"
                },
                "examples": [
                    {
                        "en": "count of… Raise your leg and hold for a count of ten.",
                        "vi": "đếm… Nâng cao chân của bạn và giữ số đếm là mười."
                    },
                    {
                        "en": "He was knocked to the ground and stayed down for a count of eight (= in boxing).",
                        "vi": "Anh ta bị đánh ngã xuống đất và nằm xuống đếm tám (= trong quyền anh)."
                    },
                    {
                        "en": "The referee didn't even finish the count when he saw that Juarez was unable to continue.",
                        "vi": "Trọng tài thậm chí còn không kết thúc thời gian đếm khi thấy Juarez không thể tiếp tục."
                    },
                    {
                        "en": "on a/the count of… On the count of three, take one step forward.",
                        "vi": "trên a / số đếm… Trên số đếm ba, hãy tiến lên một bước."
                    }
                ]
            },
            {
                "define": {
                    "en": "a measurement of the amount of something contained in a particular substance or area",
                    "vi": "phép đo lượng thứ có trong một chất hoặc khu vực cụ thể"
                },
                "examples": [
                    {
                        "en": "a raised white blood cell count",
                        "vi": "số lượng bạch cầu tăng lên"
                    }
                ]
            },
            {
                "define": {
                    "en": "a crime that somebody is accused of committing",
                    "vi": "một tội ác mà ai đó bị buộc tội đã thực hiện"
                },
                "examples": [
                    {
                        "en": "They were found guilty on all counts.",
                        "vi": "Họ bị kết tội về mọi tội danh."
                    },
                    {
                        "en": "to be charged with two counts of murder",
                        "vi": "bị buộc tội hai tội giết người"
                    },
                    {
                        "en": "She appeared in court on three counts of fraud.",
                        "vi": "Cô hầu tòa với ba tội danh lừa đảo."
                    }
                ]
            },
            {
                "define": {
                    "en": "a point made during a discussion or an argument",
                    "vi": "một điểm được đưa ra trong một cuộc thảo luận hoặc một cuộc tranh luận"
                },
                "examples": [
                    {
                        "en": "I disagree with you on both counts.",
                        "vi": "Tôi không đồng ý với bạn về cả hai quan điểm."
                    }
                ]
            },
            {
                "define": {
                    "en": "a nobleman of high rank, similar to an earl in the UK",
                    "vi": "một nhà quý tộc có cấp bậc cao, tương tự như một bá tước ở Vương quốc Anh"
                },
                "examples": [
                    {
                        "en": "Count Tolstoy",
                        "vi": "Bá tước Tolstoy"
                    }
                ]
            },
            {
                "define": {
                    "en": "according to the latest information about the numbers of something",
                    "vi": "theo thông tin mới nhất về số lượng của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "She'd applied for 30 jobs at the last count.",
                        "vi": "Cô ấy đã nộp đơn cho 30 công việc trong lần đếm cuối cùng."
                    },
                    {
                        "en": "At the last count she had 43 cats!",
                        "vi": "Ở lần đếm cuối cùng cô ấy có 43 con mèo!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to remember or keep a record of numbers or amounts of something over a period of time",
                    "vi": "để ghi nhớ hoặc ghi lại các con số hoặc số lượng của một cái gì đó trong một khoảng thời gian"
                },
                "examples": [
                    {
                        "en": "Keep a count of your calorie intake for one week.",
                        "vi": "Hãy đếm lượng calo của bạn trong một tuần."
                    }
                ]
            },
            {
                "define": {
                    "en": "to forget the total of something before you have finished counting it",
                    "vi": "để quên tổng một cái gì đó trước khi bạn đếm xong"
                },
                "examples": [
                    {
                        "en": "I lost count and had to start again.",
                        "vi": "Tôi đã mất số lượng và phải bắt đầu lại."
                    },
                    {
                        "en": "She had lost count of the number of times she'd told him to be careful (= she could not remember because there were so many).",
                        "vi": "Cô đã không đếm được số lần cô đã dặn anh phải cẩn thận (= cô không thể nhớ vì quá nhiều)."
                    },
                    {
                        "en": "I've lost count of the times I've heard that joke.",
                        "vi": "Tôi đã mất số lần nghe câu nói đùa đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "unable to get up again within ten seconds after being knocked down",
                    "vi": "không thể đứng dậy trở lại trong vòng mười giây sau khi bị đánh gục"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "in a deep sleep",
                    "vi": "trong một giấc ngủ sâu"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "5dad758360ac43ae8bd7ca6a58127239",
        "word": "countess",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈkaʊntəs/",
            "us": "/ˈkaʊntəs/"
        },
        "nearby": [
            {
                "word": "countervailing",
                "pos": "adjective"
            },
            {
                "word": "counterweight",
                "pos": "noun"
            },
            {
                "word": "countess",
                "pos": "noun"
            },
            {
                "word": "count in",
                "pos": "phrasal verb"
            },
            {
                "word": "countless",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a woman who has the rank of a count or an earl",
                    "vi": "một người phụ nữ có cấp bậc bá tước hay bá tước"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the wife of a count or an earl",
                    "vi": "vợ của bá tước hay bá tước"
                },
                "examples": [
                    {
                        "en": "the Earl and Countess of Rosebery",
                        "vi": "Bá tước và Nữ bá tước Rosebery"
                    }
                ]
            }
        ]
    },
    {
        "id": "5f894b6c2ad74b978cb64e704deb6dff",
        "word": "duchess",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈdʌtʃəs/",
            "us": "/ˈdʌtʃəs/"
        },
        "nearby": [
            {
                "word": "ducal",
                "pos": "adjective"
            },
            {
                "word": "ducat",
                "pos": "noun"
            },
            {
                "word": "duchess",
                "pos": "noun"
            },
            {
                "word": "The Duchess of Malfi",
                "pos": ""
            },
            {
                "word": "duchy",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the wife of a duke",
                    "vi": "vợ của một công tước"
                },
                "examples": [
                    {
                        "en": "the Duchess of York",
                        "vi": "Nữ công tước xứ York"
                    }
                ]
            },
            {
                "define": {
                    "en": "a woman who has the rank of a duke",
                    "vi": "một người phụ nữ có cấp bậc của một công tước"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "39023b94773c4ad9ac99ad479b69905b",
        "word": "earl",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ɜːl/",
            "us": "/ɜːrl/"
        },
        "nearby": [
            {
                "word": "Amelia Earhart",
                "pos": ""
            },
            {
                "word": "earhole",
                "pos": "noun"
            },
            {
                "word": "earl",
                "pos": "noun"
            },
            {
                "word": "Earl Grey",
                "pos": "noun"
            },
            {
                "word": "earliest",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a British nobleman of high rank",
                    "vi": "một nhà quý tộc Anh có thứ hạng cao"
                },
                "examples": [
                    {
                        "en": "the Earl of Essex",
                        "vi": "Bá tước Essex"
                    }
                ]
            }
        ]
    },
    {
        "id": "7594b96fa12f4479bf5104e8fbafdd94",
        "word": "the lower middle class",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ðə ˌləʊə mɪdl ˈklɑːs/",
            "us": "/ðə ˌləʊər mɪdl ˈklæs/"
        },
        "nearby": [
            {
                "word": "the Lower East Side",
                "pos": ""
            },
            {
                "word": "lower house",
                "pos": "noun"
            },
            {
                "word": "the lower middle class",
                "pos": "noun"
            },
            {
                "word": "the lower orders",
                "pos": "noun"
            },
            {
                "word": "lower school",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the class of people in society, especially in the past, between the working class and the middle class, such as office workers or shopkeepers, but not professional people",
                    "vi": "các tầng lớp nhân dân trong xã hội, nhất là trước đây, giữa tầng lớp lao động và tầng lớp trung lưu, như nhân viên văn phòng hay chủ tiệm, nhưng không phải dân chuyên nghiệp."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "11172aba8b324d59a7d40492ac963164",
        "word": "noble",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈnəʊbl/",
            "us": "/ˈnəʊbl/"
        },
        "nearby": [
            {
                "word": "Nob Hill",
                "pos": ""
            },
            {
                "word": "nobility",
                "pos": "noun"
            },
            {
                "word": "noble",
                "pos": "adjective"
            },
            {
                "word": "noble",
                "pos": "noun"
            },
            {
                "word": "noble gas",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "having or showing fine personal qualities that people admire, such as courage, honesty and care for others",
                    "vi": "có hoặc thể hiện những phẩm chất cá nhân tốt đẹp mà mọi người ngưỡng mộ, chẳng hạn như lòng dũng cảm, trung thực và quan tâm đến người khác"
                },
                "examples": [
                    {
                        "en": "a noble leader",
                        "vi": "một nhà lãnh đạo cao quý"
                    },
                    {
                        "en": "noble ideals",
                        "vi": "lý tưởng cao đẹp"
                    },
                    {
                        "en": "He died for a noble cause.",
                        "vi": "Anh ấy đã chết vì một mục đích cao cả."
                    },
                    {
                        "en": "She died in a noble cause.",
                        "vi": "Cô ấy chết vì một lý do cao cả."
                    },
                    {
                        "en": "It was very noble of you to go so far to take him home.",
                        "vi": "Bạn đã đi xa như vậy để đưa anh ấy về nhà."
                    }
                ]
            },
            {
                "define": {
                    "en": "belonging to a family of high social rank (= belonging to the nobility)",
                    "vi": "thuộc một gia đình có địa vị xã hội cao (= thuộc giới quý tộc)"
                },
                "examples": [
                    {
                        "en": "He was a young man of noble birth.",
                        "vi": "Anh là một thanh niên xuất thân cao quý."
                    },
                    {
                        "en": "one of the noblest families in Portugal",
                        "vi": "một trong những gia đình cao quý nhất ở Bồ Đào Nha"
                    },
                    {
                        "en": "Intermarriage between the noble families means that all the counts are related.",
                        "vi": "Kết hôn giữa các gia đình quý tộc có nghĩa là tất cả các số lượng đều có quan hệ họ hàng với nhau."
                    }
                ]
            },
            {
                "define": {
                    "en": "very impressive in size or quality",
                    "vi": "rất ấn tượng về kích thước hoặc chất lượng"
                },
                "examples": [
                    {
                        "en": "a noble building",
                        "vi": "một tòa nhà cao quý"
                    }
                ]
            }
        ]
    },
    {
        "id": "f9f135b7f23041138a2be885bb27b9b2",
        "word": "noble",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈnəʊbl/",
            "us": "/ˈnəʊbl/"
        },
        "nearby": [
            {
                "word": "nobility",
                "pos": "noun"
            },
            {
                "word": "noble",
                "pos": "adjective"
            },
            {
                "word": "noble",
                "pos": "noun"
            },
            {
                "word": "noble gas",
                "pos": "noun"
            },
            {
                "word": "nobleman",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who comes from a family of high social rank; a member of the nobility",
                    "vi": "một người xuất thân trong một gia đình có địa vị xã hội cao; một thành viên của giới quý tộc"
                },
                "examples": [
                    {
                        "en": "The cost of the arch was met by Milanese nobles.",
                        "vi": "Chi phí của vòm đã được đáp ứng bởi các quý tộc Milanese."
                    },
                    {
                        "en": "The regime was supported by a group of powerful nobles.",
                        "vi": "Chế độ này được hỗ trợ bởi một nhóm quý tộc quyền lực."
                    }
                ]
            }
        ]
    },
    {
        "id": "b39f57811e49455a991f9c873bc9e3b5",
        "word": "peer",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/pɪə(r)/",
            "us": "/pɪr/"
        },
        "nearby": [
            {
                "word": "peeps",
                "pos": "noun"
            },
            {
                "word": "peep show",
                "pos": "noun"
            },
            {
                "word": "peer",
                "pos": "noun"
            },
            {
                "word": "peer",
                "pos": "verb"
            },
            {
                "word": "peerage",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who is the same age or who has the same social status as you",
                    "vi": "một người bằng tuổi hoặc có cùng địa vị xã hội với bạn"
                },
                "examples": [
                    {
                        "en": "She enjoys the respect of her peers.",
                        "vi": "Cô ấy nhận được sự tôn trọng của các đồng nghiệp của mình."
                    },
                    {
                        "en": "A peer review system is being introduced to help teachers who are experiencing difficulty.",
                        "vi": "Một hệ thống đánh giá đồng đẳng đang được giới thiệu để giúp những giáo viên đang gặp khó khăn."
                    },
                    {
                        "en": "Children are worried about failing in front of their peers.",
                        "vi": "Trẻ lo lắng về việc thất bại trước các bạn đồng trang lứa."
                    },
                    {
                        "en": "Peer pressure is strong among young people (= they want to be like other people of the same age).",
                        "vi": "Áp lực bạn bè rất mạnh ở những người trẻ tuổi (= họ muốn giống như những người cùng tuổi)."
                    }
                ]
            },
            {
                "define": {
                    "en": "(in the UK) a member of the nobility or the House of Lords",
                    "vi": "(ở Vương quốc Anh) một thành viên của giới quý tộc hoặc House of Lords"
                },
                "examples": [
                    {
                        "en": "MPs and peers from all parties met to discuss the issue.",
                        "vi": "Các nghị sĩ và đồng nghiệp của tất cả các bên đã gặp nhau để thảo luận về vấn đề này."
                    }
                ]
            }
        ]
    },
    {
        "id": "e70bc42260dc4f149f72c98495cc3e58",
        "word": "senior",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈsiːniə(r)/",
            "us": "/ˈsiːniər/"
        },
        "nearby": [
            {
                "word": "senility",
                "pos": "noun"
            },
            {
                "word": "senior",
                "pos": "adjective"
            },
            {
                "word": "senior",
                "pos": "noun"
            },
            {
                "word": "senior aircraftman",
                "pos": "noun"
            },
            {
                "word": "senior aircraftwoman",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who is older than somebody else",
                    "vi": "một người lớn tuổi hơn người khác"
                },
                "examples": [
                    {
                        "en": "She was ten years his senior.",
                        "vi": "Cô hơn anh mười tuổi."
                    },
                    {
                        "en": "My brother is my senior by two years.",
                        "vi": "Anh trai tôi là đàn anh của tôi hai năm."
                    }
                ]
            },
            {
                "define": {
                    "en": "an older person, especially somebody who has retired from work. People often call somebody a ‘senior citizen’ to avoid saying that they are old or using the expression ‘old-age pensioner’.",
                    "vi": "một người lớn tuổi, đặc biệt là một số người đã nghỉ việc. Mọi người thường gọi ai đó là 'người cao tuổi' để tránh nói rằng họ đã già hoặc sử dụng cụm từ 'người già hưu trí'."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a person who is higher in rank or status",
                    "vi": "một người có cấp bậc hoặc địa vị cao hơn"
                },
                "examples": [
                    {
                        "en": "She felt unappreciated both by her colleagues and her seniors.",
                        "vi": "Cô cảm thấy không được đánh giá cao bởi cả đồng nghiệp và đàn anh của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "adults or people who have reached an advanced level",
                    "vi": "người lớn hoặc những người đã đạt đến trình độ nâng cao"
                },
                "examples": [
                    {
                        "en": "tennis coaching for juniors and seniors",
                        "vi": "huấn luyện quần vợt cho đàn em và đàn anh"
                    }
                ]
            },
            {
                "define": {
                    "en": "a child at a senior school; an older child in a school",
                    "vi": "một đứa trẻ ở một trường trung học; một đứa trẻ lớn hơn trong một trường học"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "(in the US and some other countries) a student in the last year at a high school or college",
                    "vi": "(ở Mỹ và một số quốc gia khác) học sinh năm cuối tại một trường trung học hoặc đại học"
                },
                "examples": [
                    {
                        "en": "high school seniors",
                        "vi": "Học sinh khóa trên ở trường trung học"
                    }
                ]
            }
        ]
    },
    {
        "id": "4c1a7a1681d645b5a9de26c4ed720d8e",
        "word": "sultan",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈsʌltən/",
            "us": "/ˈsʌltən/"
        },
        "nearby": [
            {
                "word": "sulphuric acid",
                "pos": "noun"
            },
            {
                "word": "sulphurous",
                "pos": "adjective"
            },
            {
                "word": "sultan",
                "pos": "noun"
            },
            {
                "word": "sultana",
                "pos": "noun"
            },
            {
                "word": "sultanate",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the title given to Muslim rulers in some countries",
                    "vi": "tước hiệu được trao cho những người cai trị Hồi giáo ở một số quốc gia"
                },
                "examples": [
                    {
                        "en": "the Sultan of Brunei",
                        "vi": "Quốc vương Brunei"
                    },
                    {
                        "en": "Sultan Qaboos seized power in a coup against his father, Said Bin-Taymur, in 1970.",
                        "vi": "Sultan Qaboos nắm quyền trong một cuộc đảo chính chống lại cha mình, Said Bin-Taymur, vào năm 1970."
                    }
                ]
            }
        ]
    },
    {
        "id": "242f26e7dda84656beb16c8ccc0135f4",
        "word": "superior",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/suːˈpɪəriə(r)/",
            "us": "/suːˈpɪriər/"
        },
        "nearby": [
            {
                "word": "superintendence",
                "pos": "noun"
            },
            {
                "word": "superintendent",
                "pos": "noun"
            },
            {
                "word": "superior",
                "pos": "adjective"
            },
            {
                "word": "Lake Superior",
                "pos": ""
            },
            {
                "word": "superior",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "better in quality than somebody/something else; greater than somebody/something else",
                    "vi": "chất lượng tốt hơn ai đó / cái gì khác; vĩ đại hơn ai đó / cái gì khác"
                },
                "examples": [
                    {
                        "en": "vastly superior",
                        "vi": "Vượt trội"
                    },
                    {
                        "en": "superior intelligence",
                        "vi": "trí thông minh vượt trội"
                    },
                    {
                        "en": "Liverpool were clearly the superior team.",
                        "vi": "Liverpool rõ ràng là đội vượt trội hơn hẳn."
                    },
                    {
                        "en": "superior to somebody/something This model is technically superior to its competitors.",
                        "vi": "vượt trội so với ai đó / cái gì đó Mô hình này vượt trội về mặt kỹ thuật so với các đối thủ cạnh tranh của nó."
                    },
                    {
                        "en": "She felt socially superior to most of her neighbours.",
                        "vi": "Cô cảm thấy mình vượt trội về mặt xã hội so với hầu hết những người hàng xóm của mình."
                    },
                    {
                        "en": "The enemy won because of their superior numbers (= there were more of them).",
                        "vi": "Kẻ thù đã thắng vì số lượng vượt trội của chúng (= có nhiều hơn trong số chúng)."
                    }
                ]
            },
            {
                "define": {
                    "en": "higher in rank, importance or position",
                    "vi": "cao hơn về cấp bậc, tầm quan trọng hoặc vị trí"
                },
                "examples": [
                    {
                        "en": "my superior officer",
                        "vi": "sĩ quan cấp trên của tôi"
                    },
                    {
                        "en": "superior status",
                        "vi": "địa vị cao cấp"
                    },
                    {
                        "en": "a superior court of law",
                        "vi": "một tòa án luật cấp cao"
                    }
                ]
            },
            {
                "define": {
                    "en": "showing by your behaviour that you think you are better than others",
                    "vi": "thể hiện bằng hành vi của bạn rằng bạn nghĩ rằng bạn giỏi hơn những người khác"
                },
                "examples": [
                    {
                        "en": "a superior manner",
                        "vi": "một cách vượt trội"
                    },
                    {
                        "en": "He always looks so superior.",
                        "vi": "Anh ấy luôn trông rất cao cấp."
                    }
                ]
            },
            {
                "define": {
                    "en": "of very good quality; better than other similar things",
                    "vi": "có chất lượng rất tốt; tốt hơn những thứ tương tự khác"
                },
                "examples": [
                    {
                        "en": "superior apartments",
                        "vi": "căn hộ cao cấp"
                    },
                    {
                        "en": "The hotel offers superior accommodation and leisure facilities.",
                        "vi": "Khách sạn cung cấp chỗ ở cao cấp và các tiện nghi giải trí."
                    }
                ]
            }
        ]
    },
    {
        "id": "45367635656e4c1f961b86a4371223bb",
        "word": "the upper middle class",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ði ˌʌpə ˌmɪdl ˈklɑːs/",
            "us": "/ði ˌʌpər ˌmɪdl ˈklæs/"
        },
        "nearby": [
            {
                "word": "uppercut",
                "pos": "noun"
            },
            {
                "word": "upper house",
                "pos": "noun"
            },
            {
                "word": "the upper middle class",
                "pos": "noun"
            },
            {
                "word": "uppermost",
                "pos": "adjective"
            },
            {
                "word": "uppermost",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the class of people in British society between the middle class and the upper class. Its members include people such as company directors, professors or barristers, who have a high social status and may earn a lot of money. In modern Britain, however, it is less common to identify people in this way.",
                    "vi": "tầng lớp nhân dân trong xã hội Anh giữa tầng lớp trung lưu và thượng lưu. Thành viên của nó bao gồm những người như giám đốc công ty, giáo sư hoặc luật sư, những người có địa vị xã hội cao và có thể kiếm được nhiều tiền. Tuy nhiên, ở Anh hiện đại, việc xác định mọi người theo cách này ít phổ biến hơn."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "2b42badd95ae4adba618cafe916d5928",
        "word": "baroness",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbærənəs/",
            "us": "/ˌbærəˈnes/"
        },
        "nearby": [
            {
                "word": "barometric",
                "pos": "adjective"
            },
            {
                "word": "baron",
                "pos": "noun"
            },
            {
                "word": "baroness",
                "pos": "noun"
            },
            {
                "word": "baronet",
                "pos": "noun"
            },
            {
                "word": "baronetcy",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a woman who has the same rank as a baron. In the UK, baronesses use the title Lady or Baroness",
                    "vi": "một người phụ nữ có cùng cấp bậc với một nam tước. Ở Anh, các nam tước sử dụng danh hiệu Quý bà hoặc Nam tước"
                },
                "examples": [
                    {
                        "en": "Baroness Thatcher",
                        "vi": "Nam tước Thatcher"
                    }
                ]
            },
            {
                "define": {
                    "en": "the wife of a baron",
                    "vi": "vợ của một nam tước"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "67a0a39f33d04b919e621037d9a4c6c7",
        "word": "the bourgeoisie",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ðə ˌbʊəʒwɑːˈziː/",
            "us": "/ðə ˌbʊrʒwɑːˈziː/"
        },
        "nearby": [
            {
                "word": "bourgeois",
                "pos": "noun"
            },
            {
                "word": "bourgeois",
                "pos": "adjective"
            },
            {
                "word": "the bourgeoisie",
                "pos": "noun"
            },
            {
                "word": "Bourke",
                "pos": "noun"
            },
            {
                "word": "Bournemouth",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the middle classes in society",
                    "vi": "tầng lớp trung lưu trong xã hội"
                },
                "examples": [
                    {
                        "en": "the rise of the bourgeoisie in the nineteenth century",
                        "vi": "sự nổi lên của giai cấp tư sản trong thế kỷ XIX"
                    }
                ]
            },
            {
                "define": {
                    "en": "the capitalist class",
                    "vi": "giai cấp tư bản"
                },
                "examples": [
                    {
                        "en": "the proletariat and the bourgeoisie",
                        "vi": "giai cấp vô sản và giai cấp tư sản"
                    }
                ]
            }
        ]
    },
    {
        "id": "7f33bf2a6cee4ea582216b38d2be8731",
        "word": "caste",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/kɑːst/",
            "us": "/kæst/"
        },
        "nearby": [
            {
                "word": "cast aside",
                "pos": "phrasal verb"
            },
            {
                "word": "castaway",
                "pos": "noun"
            },
            {
                "word": "caste",
                "pos": "noun"
            },
            {
                "word": "castellated",
                "pos": "adjective"
            },
            {
                "word": "castellations",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "any of the four main divisions of Hindu society, originally those made according to functions in society",
                    "vi": "bất kỳ bộ phận nào trong số bốn bộ phận chính của xã hội Ấn Độ giáo, ban đầu là những bộ phận được thực hiện theo các chức năng trong xã hội"
                },
                "examples": [
                    {
                        "en": "the caste system",
                        "vi": "hệ đẳng cấp"
                    },
                    {
                        "en": "high-caste Brahmins",
                        "vi": "những người Bà la môn đẳng cấp"
                    }
                ]
            },
            {
                "define": {
                    "en": "a social class, especially one whose members do not allow others to join it",
                    "vi": "một tầng lớp xã hội, đặc biệt là tầng lớp mà các thành viên của họ không cho phép người khác tham gia"
                },
                "examples": [
                    {
                        "en": "the ruling caste",
                        "vi": "giai cấp thống trị"
                    }
                ]
            },
            {
                "define": {
                    "en": "the system of dividing society into classes based on differences in family origin, rank or wealth",
                    "vi": "hệ thống phân chia xã hội thành các giai cấp dựa trên sự khác biệt về nguồn gốc gia đình, cấp bậc hoặc sự giàu có"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a1eb1626615747fd82510b3442a81068",
        "word": "chav",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/tʃæv/",
            "us": "/tʃæv/"
        },
        "nearby": [
            {
                "word": "chauvinistic",
                "pos": "adjective"
            },
            {
                "word": "chauvinistically",
                "pos": "adverb"
            },
            {
                "word": "chav",
                "pos": "noun"
            },
            {
                "word": "César Chávez",
                "pos": ""
            },
            {
                "word": "chavvy",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a young person from the working class, usually without a high level of education, who typically behaves in a loud and annoying way and wears designer clothes",
                    "vi": "một thanh niên thuộc tầng lớp lao động, thường không có trình độ học vấn cao, thường cư xử ồn ào và phiền phức và mặc quần áo hàng hiệu"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a0da3a0a5b694a4f8ef7effffe92ceea",
        "word": "class-conscious",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌklɑːs ˈkɒnʃəs/",
            "us": "/ˌklæs ˈkɑːnʃəs/"
        },
        "nearby": [
            {
                "word": "class action",
                "pos": "noun"
            },
            {
                "word": "class A drug",
                "pos": "noun"
            },
            {
                "word": "class-conscious",
                "pos": "adjective"
            },
            {
                "word": "class-consciousness",
                "pos": "noun"
            },
            {
                "word": "classic",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "very aware of belonging to a particular social class and of the differences between social classes",
                    "vi": "rất ý thức về việc thuộc về một tầng lớp xã hội cụ thể và về sự khác biệt giữa các tầng lớp xã hội"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a1d8631ac21045caac39784a82dc63fa",
        "word": "class-consciousness",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌklɑːs ˈkɒnʃəsnəs/",
            "us": "/ˌklæs ˈkɑːnʃəsnəs/"
        },
        "nearby": [
            {
                "word": "class A drug",
                "pos": "noun"
            },
            {
                "word": "class-conscious",
                "pos": "adjective"
            },
            {
                "word": "class-consciousness",
                "pos": "noun"
            },
            {
                "word": "classic",
                "pos": "adjective"
            },
            {
                "word": "classic",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the fact of being very aware of belonging to a particular social class and of the differences between social classes",
                    "vi": "thực tế là nhận thức rất rõ về việc thuộc về một tầng lớp xã hội cụ thể và về sự khác biệt giữa các tầng lớp xã hội"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "92cc6ad613054324bda85722d980ce2e",
        "word": "commoner",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkɒmənə(r)/",
            "us": "/ˈkɑːmənər/"
        },
        "nearby": [
            {
                "word": "common denominator",
                "pos": "noun"
            },
            {
                "word": "Common Entrance",
                "pos": ""
            },
            {
                "word": "commoner",
                "pos": "noun"
            },
            {
                "word": "Common Era",
                "pos": "noun"
            },
            {
                "word": "common fraction",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who does not come from a royal or noble family",
                    "vi": "một người không xuất thân từ gia đình hoàng gia hoặc quý tộc"
                },
                "examples": [
                    {
                        "en": "It was not acceptable for royalty to marry commoners in those days.",
                        "vi": "Những ngày đó, hoàng gia không thể chấp nhận việc kết hôn với thường dân."
                    }
                ]
            }
        ]
    },
    {
        "id": "2635b8471f554f65bfffd433844218cb",
        "word": "czar",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/zɑː(r)/",
            "us": "/zɑːr/"
        },
        "nearby": [
            {
                "word": "cytoplasmic",
                "pos": "adjective"
            },
            {
                "word": "cytosine",
                "pos": "noun"
            },
            {
                "word": "czar",
                "pos": "noun"
            },
            {
                "word": "czarina",
                "pos": "noun"
            },
            {
                "word": "czarism",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the emperor of Russia in the past",
                    "vi": "hoàng đế của Nga trong quá khứ"
                },
                "examples": [
                    {
                        "en": "Czar Nicholas II",
                        "vi": "Sa hoàng Nicholas II"
                    }
                ]
            },
            {
                "define": {
                    "en": "an official whose job is to advise the government on policy in a particular area",
                    "vi": "một quan chức có công việc là cố vấn cho chính phủ về chính sách trong một lĩnh vực cụ thể"
                },
                "examples": [
                    {
                        "en": "(British English) a drugs czar",
                        "vi": "(Tiếng Anh Anh) a ma túy czar"
                    },
                    {
                        "en": "(North American English) a drug czar",
                        "vi": "(Tiếng Anh ở Bắc Mỹ) một sa hoàng ma túy"
                    }
                ]
            }
        ]
    },
    {
        "id": "10053d568e3a4f02976769a3103aa228",
        "word": "disadvantaged",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌdɪsədˈvɑːntɪdʒd/",
            "us": "/ˌdɪsədˈvæntɪdʒd/"
        },
        "nearby": [
            {
                "word": "disadvantage",
                "pos": "verb"
            },
            {
                "word": "disadvantage",
                "pos": "noun"
            },
            {
                "word": "disadvantaged",
                "pos": "adjective"
            },
            {
                "word": "disadvantageous",
                "pos": "adjective"
            },
            {
                "word": "disaffected",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "not having the things, such as education, or enough money, that people need in order to succeed in life",
                    "vi": "không có những thứ, chẳng hạn như giáo dục, hoặc đủ tiền, mà mọi người cần để thành công trong cuộc sống"
                },
                "examples": [
                    {
                        "en": "disadvantaged groups/children",
                        "vi": "nhóm / trẻ em thiệt thòi"
                    },
                    {
                        "en": "a severely disadvantaged area",
                        "vi": "một khu vực khó khăn nghiêm trọng"
                    },
                    {
                        "en": "socially disadvantaged sections of the community",
                        "vi": "các bộ phận xã hội khó khăn của cộng đồng"
                    }
                ]
            },
            {
                "define": {
                    "en": "people who are disadvantaged",
                    "vi": "những người bị thiệt thòi"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "9f5ac5fd091a4a55a20dcf8f07080e51",
        "word": "empress",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈemprəs/",
            "us": "/ˈemprəs/"
        },
        "nearby": [
            {
                "word": "empower",
                "pos": "verb"
            },
            {
                "word": "empowerment",
                "pos": "noun"
            },
            {
                "word": "empress",
                "pos": "noun"
            },
            {
                "word": "empties",
                "pos": "noun"
            },
            {
                "word": "emptily",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a woman who is the ruler of an empire",
                    "vi": "một người phụ nữ là người cai trị một đế chế"
                },
                "examples": [
                    {
                        "en": "the Empress of Egypt",
                        "vi": "Nữ hoàng Ai Cập"
                    }
                ]
            },
            {
                "define": {
                    "en": "the wife of an emperor",
                    "vi": "vợ của hoàng đế"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "37d149c27a3e42c1b8ced144539eb128",
        "word": "inferior",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ɪnˈfɪəriə(r)/",
            "us": "/ɪnˈfɪriər/"
        },
        "nearby": [
            {
                "word": "infer",
                "pos": "verb"
            },
            {
                "word": "inference",
                "pos": "noun"
            },
            {
                "word": "inferior",
                "pos": "adjective"
            },
            {
                "word": "inferior",
                "pos": "noun"
            },
            {
                "word": "inferiority",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "not good or not as good as somebody/something else",
                    "vi": "không tốt hoặc không tốt bằng ai đó / cái gì đó khác"
                },
                "examples": [
                    {
                        "en": "of inferior quality",
                        "vi": "chất lượng kém"
                    },
                    {
                        "en": "inferior goods",
                        "vi": "hàng kém chất lượng"
                    },
                    {
                        "en": "to make somebody feel inferior",
                        "vi": "làm cho ai đó cảm thấy thấp kém"
                    },
                    {
                        "en": "inferior to somebody/something Modern music is often considered inferior to that of the past.",
                        "vi": "kém hơn so với ai đó / cái gì đó Âm nhạc hiện đại thường bị coi là kém hơn so với quá khứ."
                    }
                ]
            },
            {
                "define": {
                    "en": "of lower rank; lower",
                    "vi": "của cấp bậc thấp hơn; thấp hơn"
                },
                "examples": [
                    {
                        "en": "an inferior officer",
                        "vi": "một sĩ quan thấp kém"
                    }
                ]
            }
        ]
    },
    {
        "id": "38244b4860b8478685b971108a8dc0ad",
        "word": "inferior",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ɪnˈfɪəriə(r)/",
            "us": "/ɪnˈfɪriər/"
        },
        "nearby": [
            {
                "word": "inference",
                "pos": "noun"
            },
            {
                "word": "inferior",
                "pos": "adjective"
            },
            {
                "word": "inferior",
                "pos": "noun"
            },
            {
                "word": "inferiority",
                "pos": "noun"
            },
            {
                "word": "inferiority complex",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who is not as good as somebody else; a person who is lower in rank or status",
                    "vi": "một người không tốt bằng người khác; một người có cấp bậc hoặc địa vị thấp hơn"
                },
                "examples": [
                    {
                        "en": "She considered everyone her intellectual inferior.",
                        "vi": "Cô coi mọi người là thấp kém trí tuệ của mình."
                    }
                ]
            }
        ]
    },
    {
        "id": "f796642467cc418bb286db743ee58942",
        "word": "laird",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/leəd/",
            "us": "/lerd/"
        },
        "nearby": [
            {
                "word": "Frankie Laine",
                "pos": ""
            },
            {
                "word": "lair",
                "pos": "noun"
            },
            {
                "word": "laird",
                "pos": "noun"
            },
            {
                "word": "lairy",
                "pos": "adjective"
            },
            {
                "word": "laissez-faire",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "(in Scotland) a person who owns a large area of land",
                    "vi": "(ở Scotland) một người sở hữu một vùng đất rộng lớn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "6ab39b05da184456bb8e09098ad76d9e",
        "word": "the lower orders",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ðə ˌləʊər ˈɔːdəz/",
            "us": "/ðə ˌləʊər ˈɔːrdərz/"
        },
        "nearby": [
            {
                "word": "lower house",
                "pos": "noun"
            },
            {
                "word": "the lower middle class",
                "pos": "noun"
            },
            {
                "word": "the lower orders",
                "pos": "noun"
            },
            {
                "word": "lower school",
                "pos": "noun"
            },
            {
                "word": "lowest common denominator",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "people who are considered to be less important because they belong to groups with a lower social status",
                    "vi": "những người được coi là kém quan trọng hơn vì họ thuộc nhóm có địa vị xã hội thấp hơn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "3a3c0572fd06418480d789a10fc5c71e",
        "word": "marchioness",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌmɑːʃəˈnes/",
            "us": "/ˌmɑːrʃəˈnes/"
        },
        "nearby": [
            {
                "word": "marching season",
                "pos": "noun"
            },
            {
                "word": "Marching Through Georgia",
                "pos": ""
            },
            {
                "word": "marchioness",
                "pos": "noun"
            },
            {
                "word": "March Madness",
                "pos": "noun"
            },
            {
                "word": "the March of Dimes",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a woman who has the rank of a marquess",
                    "vi": "một người phụ nữ có đẳng cấp của một bà hoàng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the wife of a marquess",
                    "vi": "vợ của một hôn nhân"
                },
                "examples": [
                    {
                        "en": "the Marchioness of Bath",
                        "vi": "Marchioness of Bath"
                    }
                ]
            }
        ]
    },
    {
        "id": "b35cb4123fa14338b8cc61c592fc2b7f",
        "word": "marquess",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmɑːkwɪs/",
            "us": "/ˈmɑːrkwɪs/"
        },
        "nearby": [
            {
                "word": "marquee",
                "pos": "noun"
            },
            {
                "word": "marquee",
                "pos": "adjective"
            },
            {
                "word": "marquess",
                "pos": "noun"
            },
            {
                "word": "marquetry",
                "pos": "noun"
            },
            {
                "word": "marquis",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "(in the UK) a nobleman of high rank between an earl and a duke",
                    "vi": "(ở Anh) một nhà quý tộc có cấp bậc cao giữa bá tước và công tước"
                },
                "examples": [
                    {
                        "en": "the Marquess of Bath",
                        "vi": "Marquess of Bath"
                    }
                ]
            }
        ]
    },
    {
        "id": "cbfaeaaf19a9416a9dbefc008869a03b",
        "word": "marquis",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmɑːkwɪs/",
            "us": "/ˈmɑːrkwɪs/"
        },
        "nearby": [
            {
                "word": "marquess",
                "pos": "noun"
            },
            {
                "word": "marquetry",
                "pos": "noun"
            },
            {
                "word": "marquis",
                "pos": "noun"
            },
            {
                "word": "marquise",
                "pos": "noun"
            },
            {
                "word": "marram grass",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "(in some European countries but not the UK) a nobleman of high rank between a count and a duke",
                    "vi": "(ở một số nước châu Âu nhưng không phải ở Anh) một nhà quý tộc có thứ hạng cao giữa bá tước và công tước"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "(in the UK) a nobleman of high rank between an earl and a duke",
                    "vi": "(ở Anh) một nhà quý tộc có cấp bậc cao giữa bá tước và công tước"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "8a75483dc4614667a4b2a2a957923dd9",
        "word": "marquise",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/mɑːˈkiːz/",
            "us": "/mɑːrˈkiːz/"
        },
        "nearby": [
            {
                "word": "marquetry",
                "pos": "noun"
            },
            {
                "word": "marquis",
                "pos": "noun"
            },
            {
                "word": "marquise",
                "pos": "noun"
            },
            {
                "word": "marram grass",
                "pos": "noun"
            },
            {
                "word": "marriage",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the wife of a marquis",
                    "vi": "vợ của một hầu tước"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a woman who has the rank of a marquis",
                    "vi": "một người phụ nữ có cấp bậc hầu tước"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "d6c368bb49004a6b88c37a9e61e43b65",
        "word": "new money",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌnjuː ˈmʌni/",
            "us": "/ˌnuː ˈmʌni/"
        },
        "nearby": [
            {
                "word": "New Mexico",
                "pos": ""
            },
            {
                "word": "the New Model Army",
                "pos": ""
            },
            {
                "word": "new money",
                "pos": "noun"
            },
            {
                "word": "new moon",
                "pos": "noun"
            },
            {
                "word": "New Musical Express",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "wealth that has been made or acquired recently; people who have become wealthy recently",
                    "vi": "của cải đã được tạo ra hoặc có được gần đây; những người đã trở nên giàu có gần đây"
                },
                "examples": [
                    {
                        "en": "Then came the new men with new money.",
                        "vi": "Rồi đến những người đàn ông mới với tiền mới."
                    },
                    {
                        "en": "He's not quite sure who the Joyces are, because they are new money.",
                        "vi": "Anh ấy không chắc Joyces là ai, vì chúng là tiền mới."
                    }
                ]
            }
        ]
    },
    {
        "id": "4e28f6bd3b944556a619fcc9b2c21d57",
        "word": "nobility",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/nəʊˈbɪləti/",
            "us": "/nəʊˈbɪləti/"
        },
        "nearby": [
            {
                "word": "Nobel Prize",
                "pos": "noun"
            },
            {
                "word": "Nob Hill",
                "pos": ""
            },
            {
                "word": "nobility",
                "pos": "noun"
            },
            {
                "word": "noble",
                "pos": "adjective"
            },
            {
                "word": "noble",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "people of high social position who have titles such as that of duke or duchess",
                    "vi": "những người có vị trí xã hội cao có các tước vị như công tước hoặc nữ công tước"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the quality of being noble in character",
                    "vi": "phẩm chất cao quý trong tính cách"
                },
                "examples": [
                    {
                        "en": "The bravery and nobility of these men who died for their country.",
                        "vi": "Bản lĩnh và sự cao thượng của những người đàn ông đã chết vì đất nước của họ."
                    },
                    {
                        "en": "They gave tribute to his courage and nobility.",
                        "vi": "Họ đã dành sự tôn vinh cho lòng dũng cảm và sự cao thượng của anh ấy."
                    }
                ]
            }
        ]
    },
    {
        "id": "71d5808b06db4d9a9d8456d4183e7a4a",
        "word": "nouveau riche",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌnuːvəʊ ˈriːʃ/",
            "us": "/ˌnuːvəʊ ˈriːʃ/"
        },
        "nearby": [
            {
                "word": "nourishment",
                "pos": "noun"
            },
            {
                "word": "nous",
                "pos": "noun"
            },
            {
                "word": "nouveau riche",
                "pos": "adjective"
            },
            {
                "word": "nouveau riche",
                "pos": "noun"
            },
            {
                "word": "nouvelle cuisine",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "typical of people who have recently become rich and like to show how rich they are in a very obvious way",
                    "vi": "điển hình của những người gần đây đã trở nên giàu có và thích thể hiện họ giàu có như thế nào một cách rất rõ ràng"
                },
                "examples": [
                    {
                        "en": "nouveau riche businessmen/tastes",
                        "vi": "doanh nhân / thị hiếu nouveau riche"
                    }
                ]
            }
        ]
    },
    {
        "id": "77ede082fe4145b4825d804accc48f72",
        "word": "nouveau riche",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌnuːvəʊ ˈriːʃ/",
            "us": "/ˌnuːvəʊ ˈriːʃ/"
        },
        "nearby": [
            {
                "word": "nous",
                "pos": "noun"
            },
            {
                "word": "nouveau riche",
                "pos": "adjective"
            },
            {
                "word": "nouveau riche",
                "pos": "noun"
            },
            {
                "word": "nouvelle cuisine",
                "pos": "noun"
            },
            {
                "word": "nova",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who has recently become rich and likes to show how rich they are in a very obvious way",
                    "vi": "một người gần đây đã trở nên giàu có và thích thể hiện họ giàu có như thế nào một cách rất rõ ràng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "ca14112a50c64db4bfc367ec452e57a4",
        "word": "old money",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌəʊld ˈmʌni/",
            "us": "/ˌəʊld ˈmʌni/"
        },
        "nearby": [
            {
                "word": "old man",
                "pos": "noun"
            },
            {
                "word": "old master",
                "pos": "noun"
            },
            {
                "word": "old money",
                "pos": "noun"
            },
            {
                "word": "Old Moore's Almanack",
                "pos": ""
            },
            {
                "word": "Old Mother Hubbard",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "wealth that has been in a family for many generations; people whose families have been wealthy for many generations",
                    "vi": "của cải có từ bao đời nay trong một gia đình; những người có gia đình giàu có trong nhiều thế hệ"
                },
                "examples": [
                    {
                        "en": "Well-spoken and smartly dressed, he creates an aura of privilege and old money.",
                        "vi": "Nói năng tốt và ăn mặc lịch sự, anh ta tạo ra một hào quang của đặc quyền và tiền già."
                    },
                    {
                        "en": "He plays a rich kid whose family is old money in New Orleans.",
                        "vi": "Anh ấy đóng vai một đứa trẻ giàu có có gia đình là tiền già ở New Orleans."
                    }
                ]
            },
            {
                "define": {
                    "en": "a system of money that is no longer used in a particular country",
                    "vi": "một hệ thống tiền tệ không còn được sử dụng ở một quốc gia cụ thể"
                },
                "examples": [
                    {
                        "en": "They used to cost two shillings in old money.",
                        "vi": "Họ từng có giá hai shilling tiền cũ."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to give an amount, a measurement, etc. using older or more traditional units that may be more familiar to some people",
                    "vi": "được sử dụng để đưa ra một số lượng, một phép đo, v.v. bằng cách sử dụng các đơn vị cũ hơn hoặc truyền thống hơn có thể quen thuộc hơn với một số người"
                },
                "examples": [
                    {
                        "en": "The fish measured 29 centimetres (that's a foot in old money).",
                        "vi": "Con cá có kích thước 29 cm (đó là một foot bằng tiền cũ)."
                    }
                ]
            }
        ]
    },
    {
        "id": "a6cc4a46263e43198ea6ae6d3df5a8b3",
        "word": "overlord",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈəʊvəlɔːd/",
            "us": "/ˈəʊvərlɔːrd/"
        },
        "nearby": [
            {
                "word": "overlong",
                "pos": "adjective"
            },
            {
                "word": "overlook",
                "pos": "verb"
            },
            {
                "word": "overlord",
                "pos": "noun"
            },
            {
                "word": "overly",
                "pos": "adverb"
            },
            {
                "word": "overmanned",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "(especially in the past) a person who has power over many other people",
                    "vi": "(đặc biệt là trong quá khứ) một người có quyền lực đối với nhiều người khác"
                },
                "examples": [
                    {
                        "en": "feudal overlords",
                        "vi": "lãnh chúa phong kiến"
                    }
                ]
            }
        ]
    },
    {
        "id": "4b2f1514df4944f18a46b1e0d6da2d4e",
        "word": "pleb",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/pleb/",
            "us": "/pleb/"
        },
        "nearby": [
            {
                "word": "pleated",
                "pos": "adjective"
            },
            {
                "word": "pleather",
                "pos": "noun"
            },
            {
                "word": "pleb",
                "pos": "noun"
            },
            {
                "word": "plebe",
                "pos": "noun"
            },
            {
                "word": "plebeian",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an offensive word for an ordinary person, especially one who is poor or not well educated",
                    "vi": "một từ xúc phạm đối với một người bình thường, đặc biệt là một người nghèo hoặc không được giáo dục tốt"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a762e22c053342f69d5aa9800ba2808e",
        "word": "prefect",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpriːfekt/",
            "us": "/ˈpriːfekt/"
        },
        "nearby": [
            {
                "word": "preface",
                "pos": "verb"
            },
            {
                "word": "prefatory",
                "pos": "adjective"
            },
            {
                "word": "prefect",
                "pos": "noun"
            },
            {
                "word": "prefecture",
                "pos": "noun"
            },
            {
                "word": "prefer",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "(in some British schools) an older student with some authority over younger students and some other responsibilities and advantages",
                    "vi": "(ở một số trường học ở Anh) một học sinh lớn tuổi hơn có một số quyền hạn đối với học sinh nhỏ tuổi hơn và một số trách nhiệm và lợi thế khác"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "an officer responsible for an area of local government in some countries, for example France, Italy and Japan",
                    "vi": "một viên chức chịu trách nhiệm về một lĩnh vực của chính quyền địa phương ở một số quốc gia, chẳng hạn như Pháp, Ý và Nhật Bản"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "ce6e58a78043490699f95945da88b7a7",
        "word": "the rat race",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ðə ˈræt reɪs/",
            "us": "/ðə ˈræt reɪs/"
        },
        "nearby": [
            {
                "word": "rat out",
                "pos": "phrasal verb"
            },
            {
                "word": "rat pack",
                "pos": "noun"
            },
            {
                "word": "the rat race",
                "pos": "noun"
            },
            {
                "word": "rat run",
                "pos": "noun"
            },
            {
                "word": "rats",
                "pos": "exclamation"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the way of life of people living and working in a large city where people compete in an aggressive way with each other in order to be more successful, earn more money, etc.",
                    "vi": "cách sống của những người sống và làm việc trong một thành phố rộng lớn, nơi mọi người cạnh tranh một cách tích cực với nhau để thành công hơn, kiếm được nhiều tiền hơn, v.v."
                },
                "examples": [
                    {
                        "en": "It’s very easy to get caught up in the rat race.",
                        "vi": "Rất dễ bị cuốn vào cuộc đua chuột."
                    },
                    {
                        "en": "The novel is about a couple who get out of the rat race and buy a farm in France.",
                        "vi": "Cuốn tiểu thuyết kể về một cặp vợ chồng thoát ra khỏi cuộc đua chuột và mua một trang trại ở Pháp."
                    }
                ]
            }
        ]
    },
    {
        "id": "094175450563444591b3feef0e6c1b37",
        "word": "shaikh",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ʃeɪk/",
            "us": "/ʃeɪk/"
        },
        "nearby": [
            {
                "word": "shah",
                "pos": "noun"
            },
            {
                "word": "shahada",
                "pos": "noun"
            },
            {
                "word": "shaikh",
                "pos": "noun"
            },
            {
                "word": "shake",
                "pos": "verb"
            },
            {
                "word": "shake",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an Arab prince or leader; the head of an Arab family, village, etc.",
                    "vi": "một hoàng tử hoặc nhà lãnh đạo Ả Rập; người đứng đầu một gia đình Ả Rập, làng, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a leader in a Muslim community or organization",
                    "vi": "một nhà lãnh đạo trong một cộng đồng hoặc tổ chức Hồi giáo"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "fa6869cf3bae44c08217f3cf11534cee",
        "word": "sheikh",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ʃeɪk/",
            "us": "/ʃeɪk/"
        },
        "nearby": [
            {
                "word": "Sheffield plate",
                "pos": "noun"
            },
            {
                "word": "Sheffield Wednesday",
                "pos": ""
            },
            {
                "word": "sheikh",
                "pos": "noun"
            },
            {
                "word": "sheikhdom",
                "pos": "noun"
            },
            {
                "word": "sheila",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an Arab prince or leader; the head of an Arab family, village, etc.",
                    "vi": "một hoàng tử hoặc nhà lãnh đạo Ả Rập; người đứng đầu một gia đình Ả Rập, làng, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a leader in a Muslim community or organization",
                    "vi": "một nhà lãnh đạo trong một cộng đồng hoặc tổ chức Hồi giáo"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a3d78e316cc14a20b80764704d609e01",
        "word": "sovereign",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsɒvrɪn/",
            "us": "/ˈsɑːvrɪn/"
        },
        "nearby": [
            {
                "word": "souvlaki",
                "pos": "noun"
            },
            {
                "word": "sou'wester",
                "pos": "noun"
            },
            {
                "word": "sovereign",
                "pos": "noun"
            },
            {
                "word": "sovereign",
                "pos": "adjective"
            },
            {
                "word": "sovereign debt",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a king or queen",
                    "vi": "một vị vua hoặc nữ hoàng"
                },
                "examples": [
                    {
                        "en": "The Tongan sovereign is head of state and exercises executive power.",
                        "vi": "Chủ quyền Tongan là nguyên thủ quốc gia và thực hiện quyền hành pháp."
                    },
                    {
                        "en": "The islands are ruled by a governor, representing the British sovereign.",
                        "vi": "Các hòn đảo được cai trị bởi một thống đốc, đại diện cho chủ quyền của Anh."
                    }
                ]
            },
            {
                "define": {
                    "en": "an old British gold coin worth one pound",
                    "vi": "một đồng tiền vàng cũ của Anh trị giá một bảng Anh"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "ec67c532b63a47a998aada24def18006",
        "word": "sovereign",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsɒvrɪn/",
            "us": "/ˈsɑːvrɪn/"
        },
        "nearby": [
            {
                "word": "sou'wester",
                "pos": "noun"
            },
            {
                "word": "sovereign",
                "pos": "noun"
            },
            {
                "word": "sovereign",
                "pos": "adjective"
            },
            {
                "word": "sovereign debt",
                "pos": "noun"
            },
            {
                "word": "the Sovereign Grant",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "free to govern itself; completely independent",
                    "vi": "tự do quản lý chính nó; hoàn toàn độc lập"
                },
                "examples": [
                    {
                        "en": "a sovereign state",
                        "vi": "một quốc gia có chủ quyền"
                    },
                    {
                        "en": "to be given sovereign rights",
                        "vi": "được trao quyền chủ quyền"
                    }
                ]
            },
            {
                "define": {
                    "en": "having complete power or the greatest power in the country",
                    "vi": "có quyền lực hoàn toàn hoặc quyền lực lớn nhất trong nước"
                },
                "examples": [
                    {
                        "en": "a sovereign ruler",
                        "vi": "một người cai trị có chủ quyền"
                    },
                    {
                        "en": "Parliament must always remain sovereign.",
                        "vi": "Nghị viện phải luôn luôn có chủ quyền."
                    }
                ]
            }
        ]
    },
    {
        "id": "321fd0a5158b496e8ebaffa89b0b031b",
        "word": "stratum",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈstrɑːtəm/",
            "us": "/ˈstreɪtəm/"
        },
        "nearby": [
            {
                "word": "the stratosphere",
                "pos": "noun"
            },
            {
                "word": "stratospheric",
                "pos": "adjective"
            },
            {
                "word": "stratum",
                "pos": "noun"
            },
            {
                "word": "stratus",
                "pos": "noun"
            },
            {
                "word": "stravaig",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a layer or set of layers of rock, earth, etc.",
                    "vi": "một lớp hoặc tập hợp các lớp đất đá, v.v."
                },
                "examples": [
                    {
                        "en": "a thick stratum of flint",
                        "vi": "một tầng đá lửa dày"
                    },
                    {
                        "en": "limestone strata",
                        "vi": "địa tầng đá vôi"
                    },
                    {
                        "en": "Excavated coins can often be dated from other objects in the same stratum.",
                        "vi": "Các đồng tiền được khai quật thường có thể được xác định niên đại từ các vật thể khác trong cùng địa tầng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a class in a society",
                    "vi": "một tầng lớp trong xã hội"
                },
                "examples": [
                    {
                        "en": "people from all social strata",
                        "vi": "mọi người từ mọi tầng lớp xã hội"
                    }
                ]
            }
        ]
    },
    {
        "id": "87dd13d5fa5441e988cb99aaaf7b445a",
        "word": "subordinate",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/səˈbɔːdɪnət/",
            "us": "/səˈbɔːrdɪnət/"
        },
        "nearby": [
            {
                "word": "suboptimally",
                "pos": "adverb"
            },
            {
                "word": "subordinate",
                "pos": "adjective"
            },
            {
                "word": "subordinate",
                "pos": "noun"
            },
            {
                "word": "subordinate",
                "pos": "verb"
            },
            {
                "word": "subordinate clause",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who has a position with less authority and power than somebody else in an organization",
                    "vi": "một người có vị trí với quyền hạn và quyền lực kém hơn người khác trong tổ chức"
                },
                "examples": [
                    {
                        "en": "the relationship between subordinates and superiors",
                        "vi": "mối quan hệ giữa cấp dưới và cấp trên"
                    },
                    {
                        "en": "He always confers with his subordinates before making decisions.",
                        "vi": "Anh luôn trao đổi với cấp dưới trước khi đưa ra quyết định."
                    }
                ]
            }
        ]
    },
    {
        "id": "9d36fbb1b8f5496083e712270075a235",
        "word": "superior",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/suːˈpɪəriə(r)/",
            "us": "/suːˈpɪriər/"
        },
        "nearby": [
            {
                "word": "superior",
                "pos": "adjective"
            },
            {
                "word": "Lake Superior",
                "pos": ""
            },
            {
                "word": "superior",
                "pos": "noun"
            },
            {
                "word": "superiority",
                "pos": "noun"
            },
            {
                "word": "superiority complex",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person of higher rank, status or position",
                    "vi": "một người có cấp bậc, địa vị hoặc chức vụ cao hơn"
                },
                "examples": [
                    {
                        "en": "your social superiors",
                        "vi": "cấp trên xã hội của bạn"
                    },
                    {
                        "en": "He's my immediate superior (= the person directly above me).",
                        "vi": "Anh ấy là cấp trên trực tiếp của tôi (= người trực tiếp phía trên tôi)."
                    },
                    {
                        "en": "I'm going to complain to your superiors.",
                        "vi": "Tôi sẽ khiếu nại với cấp trên của bạn."
                    },
                    {
                        "en": "She threatened to report the assistant to his superiors.",
                        "vi": "Cô ta dọa sẽ báo trợ lý cho cấp trên của anh ta."
                    }
                ]
            },
            {
                "define": {
                    "en": "used in titles for the head of a religious community",
                    "vi": "được sử dụng trong các chức danh cho người đứng đầu một cộng đồng tôn giáo"
                },
                "examples": [
                    {
                        "en": "Mother Superior",
                        "vi": "Mẹ siêu nhân"
                    }
                ]
            }
        ]
    },
    {
        "id": "b4fd2a0286eb43adb59c6bb6e15b75e3",
        "word": "tsar",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/zɑː(r)/",
            "us": "/zɑːr/"
        },
        "nearby": [
            {
                "word": "try out for",
                "pos": "phrasal verb"
            },
            {
                "word": "tryst",
                "pos": "noun"
            },
            {
                "word": "tsar",
                "pos": "noun"
            },
            {
                "word": "tsarina",
                "pos": "noun"
            },
            {
                "word": "tsarism",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the emperor of Russia in the past",
                    "vi": "hoàng đế của Nga trong quá khứ"
                },
                "examples": [
                    {
                        "en": "Tsar Nicholas II",
                        "vi": "Sa hoàng Nicholas II"
                    }
                ]
            },
            {
                "define": {
                    "en": "an official whose job is to advise the government on policy in a particular area",
                    "vi": "một quan chức có công việc là cố vấn cho chính phủ về chính sách trong một lĩnh vực cụ thể"
                },
                "examples": [
                    {
                        "en": "(British English) a drugs tsar",
                        "vi": "(Tiếng Anh Anh) một sa hoàng ma túy"
                    },
                    {
                        "en": "(North American English) a drug tsar",
                        "vi": "(Tiếng Anh Bắc Mỹ) một sa hoàng ma túy"
                    }
                ]
            }
        ]
    },
    {
        "id": "2e7b3ffee3dc4a909a5e391e5b6f970c",
        "word": "tsarina",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/zɑːˈriːnə/",
            "us": "/zɑːˈriːnə/"
        },
        "nearby": [
            {
                "word": "tryst",
                "pos": "noun"
            },
            {
                "word": "tsar",
                "pos": "noun"
            },
            {
                "word": "tsarina",
                "pos": "noun"
            },
            {
                "word": "tsarism",
                "pos": "noun"
            },
            {
                "word": "tsarist",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the empress of Russia in the past",
                    "vi": "nữ hoàng của Nga trong quá khứ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "74300631345f4e7d912c629ca4d4f7c4",
        "word": "tzar",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/zɑː(r)/",
            "us": "/zɑːr/"
        },
        "nearby": [
            {
                "word": "tyre",
                "pos": "noun"
            },
            {
                "word": "tyro",
                "pos": "noun"
            },
            {
                "word": "tzar",
                "pos": "noun"
            },
            {
                "word": "tzarina",
                "pos": "noun"
            },
            {
                "word": "tzarism",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the emperor of Russia in the past",
                    "vi": "hoàng đế của Nga trong quá khứ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "an official whose job is to advise the government on policy in a particular area",
                    "vi": "một quan chức có công việc là cố vấn cho chính phủ về chính sách trong một lĩnh vực cụ thể"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "31489256fc8e474da6c3191f1d424a33",
        "word": "underclass",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈʌndəklɑːs/",
            "us": "/ˈʌndərklæs/"
        },
        "nearby": [
            {
                "word": "undercarriage",
                "pos": "noun"
            },
            {
                "word": "undercharge",
                "pos": "verb"
            },
            {
                "word": "underclass",
                "pos": "noun"
            },
            {
                "word": "underclassman",
                "pos": "noun"
            },
            {
                "word": "underclasswoman",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a social class that is very poor and has no status",
                    "vi": "một tầng lớp xã hội rất nghèo và không có địa vị"
                },
                "examples": [
                    {
                        "en": "The long-term unemployed are becoming a new underclass.",
                        "vi": "Những người thất nghiệp dài hạn đang trở thành một tầng lớp mới."
                    }
                ]
            }
        ]
    }
]