[
    {
        "id": "d31ee47251064408acca6cfedea508c0",
        "word": "maybe",
        "pos": "adverb",
        "level": "a1",
        "phonetic": {
            "uk": "/ˈmeɪbi/",
            "us": "/ˈmeɪbi/"
        },
        "nearby": [
            {
                "word": "May",
                "pos": "noun"
            },
            {
                "word": "Maya",
                "pos": ""
            },
            {
                "word": "maybe",
                "pos": "adverb"
            },
            {
                "word": "maybe",
                "pos": "noun"
            },
            {
                "word": "May bug",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "used when you are not certain that something will happen or that something is true or is a correct number",
                    "vi": "được sử dụng khi bạn không chắc chắn rằng điều gì đó sẽ xảy ra hoặc điều gì đó là đúng hoặc là một con số chính xác"
                },
                "examples": [
                    {
                        "en": "Maybe he'll come, maybe he won't.",
                        "vi": "Có thể anh ấy sẽ đến, có thể anh ấy sẽ không."
                    },
                    {
                        "en": "‘Are you going to sell your house?’ ‘Maybe.’",
                        "vi": "Bạn định bán nhà của bạn?' 'Có lẽ.'"
                    },
                    {
                        "en": "Is she right? Maybe, maybe not.",
                        "vi": "Cô ấy có đúng không? Co le không."
                    },
                    {
                        "en": "Maybe it will do me some good to go for a run.",
                        "vi": "Có lẽ nó sẽ giúp tôi một số tốt để chạy."
                    },
                    {
                        "en": "It will cost two, maybe three hundred pounds.",
                        "vi": "Nó sẽ có giá hai, có thể là ba trăm bảng Anh."
                    },
                    {
                        "en": "We go there maybe once or twice a month.",
                        "vi": "Chúng tôi đến đó có thể một hoặc hai lần một tháng."
                    },
                    {
                        "en": "There are two sides to every story, maybe even more in this case.",
                        "vi": "Mọi câu chuyện đều có hai mặt, thậm chí có thể nhiều hơn trong trường hợp này."
                    }
                ]
            },
            {
                "define": {
                    "en": "used when making a suggestion",
                    "vi": "được sử dụng khi đưa ra đề xuất"
                },
                "examples": [
                    {
                        "en": "I thought maybe we could go together.",
                        "vi": "Tôi nghĩ có lẽ chúng ta có thể đi cùng nhau."
                    },
                    {
                        "en": "Maybe you should tell her.",
                        "vi": "Có lẽ bạn nên nói với cô ấy."
                    },
                    {
                        "en": "Maybe we can meet for lunch next week sometime.",
                        "vi": "Có lẽ chúng ta có thể gặp nhau vào bữa trưa vào tuần sau vào một lúc nào đó."
                    },
                    {
                        "en": "Maybe readers should be warned.",
                        "vi": "Có lẽ độc giả nên được cảnh báo."
                    },
                    {
                        "en": "I've just got a new laptop, so maybe you can use my old one.",
                        "vi": "Tôi vừa có một máy tính xách tay mới, vì vậy có thể bạn có thể sử dụng máy tính xách tay cũ của tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "used when replying to a question or an idea, especially when you are not sure whether to agree or disagree",
                    "vi": "được sử dụng khi trả lời một câu hỏi hoặc một ý tưởng, đặc biệt là khi bạn không chắc chắn nên đồng ý hay không đồng ý"
                },
                "examples": [
                    {
                        "en": "‘I think he should resign.’ ‘Maybe.’",
                        "vi": "Tôi nghĩ anh ấy nên từ chức.' 'Có lẽ.'"
                    },
                    {
                        "en": "‘Am I nervous? Well, maybe just a little.’",
                        "vi": "Tôi có lo lắng không? Chà, có lẽ chỉ một chút thôi. '"
                    },
                    {
                        "en": "‘You should stop work when you have the baby.’ ‘Maybe, but I can't afford to.’",
                        "vi": "Bạn nên dừng công việc khi bạn có em bé.' 'Có thể, nhưng tôi không đủ khả năng.'"
                    }
                ]
            }
        ]
    },
    {
        "id": "97a5f77250454f16a1f0f356e6d619d0",
        "word": "impossible",
        "pos": "adjective",
        "level": "a2",
        "phonetic": {
            "uk": "/ɪmˈpɒsəbl/",
            "us": "/ɪmˈpɑːsəbl/"
        },
        "nearby": [
            {
                "word": "imposition",
                "pos": "noun"
            },
            {
                "word": "impossibility",
                "pos": "noun"
            },
            {
                "word": "impossible",
                "pos": "adjective"
            },
            {
                "word": "impossibly",
                "pos": "adverb"
            },
            {
                "word": "impostor",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "that cannot exist or be done; not possible",
                    "vi": "điều đó không thể tồn tại hoặc không thể thực hiện được; không thể"
                },
                "examples": [
                    {
                        "en": "almost/virtually/nearly impossible",
                        "vi": "hầu như / hầu như / gần như không thể"
                    },
                    {
                        "en": "Only a year ago and this would have seemed impossible.",
                        "vi": "Chỉ một năm trước và điều này dường như là không thể."
                    },
                    {
                        "en": "Getting any kind of decent job was proving impossible.",
                        "vi": "Kiếm được bất kỳ loại công việc tử tế nào được chứng minh là không thể."
                    },
                    {
                        "en": "an impossible dream/goal",
                        "vi": "một giấc mơ / mục tiêu không thể"
                    },
                    {
                        "en": "impossible for somebody Going downstairs would be impossible for him with his sprained ankle.",
                        "vi": "Không thể đối với ai đó Đi xuống cầu thang sẽ không thể đối với anh ta với mắt cá chân bị bong gân."
                    },
                    {
                        "en": "impossible to do The outcome is impossible to predict.",
                        "vi": "không thể làm được Kết quả là không thể đoán trước."
                    },
                    {
                        "en": "It's impossible to prove.",
                        "vi": "Không thể chứng minh được."
                    },
                    {
                        "en": "Cheap rental accommodation was impossible to find.",
                        "vi": "Không thể tìm thấy chỗ ở cho thuê giá rẻ."
                    },
                    {
                        "en": "it is impossible to do something It's impossible to say which is the best.",
                        "vi": "không thể làm điều gì đó Không thể nói điều gì là tốt nhất."
                    },
                    {
                        "en": "It is impossible to tell whether it will actually work.",
                        "vi": "Không thể nói liệu nó có thực sự hoạt động hay không."
                    },
                    {
                        "en": "I find it impossible to lie to her.",
                        "vi": "Tôi thấy không thể nói dối cô ấy."
                    },
                    {
                        "en": "it is impossible for somebody to do something It's impossible for me to be there before eight.",
                        "vi": "không thể để ai đó làm điều gì đó Không thể để tôi có mặt ở đó trước tám giờ."
                    }
                ]
            },
            {
                "define": {
                    "en": "very difficult to deal with",
                    "vi": "rất khó để đối phó với"
                },
                "examples": [
                    {
                        "en": "I've been placed in an impossible position.",
                        "vi": "Tôi đã bị đặt vào một vị trí không thể."
                    },
                    {
                        "en": "Honestly, you're impossible at times!",
                        "vi": "Thành thật mà nói, đôi khi bạn không thể!"
                    }
                ]
            },
            {
                "define": {
                    "en": "a thing that is or seems impossible",
                    "vi": "một điều có thể hoặc dường như không thể"
                },
                "examples": [
                    {
                        "en": "to attempt the impossible",
                        "vi": "cố gắng điều không thể"
                    }
                ]
            },
            {
                "define": {
                    "en": "a difficult or impossible task",
                    "vi": "một nhiệm vụ khó khăn hoặc bất khả thi"
                },
                "examples": [
                    {
                        "en": "Many regard this task as mission impossible.",
                        "vi": "Nhiều người coi nhiệm vụ này là nhiệm vụ bất khả thi."
                    }
                ]
            }
        ]
    },
    {
        "id": "1c316065ca76479085fa9cf7fbc631b7",
        "word": "that depends",
        "pos": "idiom",
        "level": "a2",
        "phonetic": {
            "uk": "/dɪˈpend/",
            "us": "/dɪˈpend/"
        },
        "nearby": [
            {
                "word": "department store",
                "pos": "noun"
            },
            {
                "word": "departure",
                "pos": "noun"
            },
            {
                "word": "depend",
                "pos": "verb"
            },
            {
                "word": "dependability",
                "pos": "noun"
            },
            {
                "word": "dependable",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "according to",
                    "vi": "dựa theo"
                },
                "examples": [
                    {
                        "en": "Starting salary varies from £26 000 to £30 500, depending on experience.",
                        "vi": "Mức lương khởi điểm dao động từ £ 26 000 đến £ 30 500, tùy thuộc vào kinh nghiệm."
                    },
                    {
                        "en": "He either resigned or was sacked, depending on who you talk to.",
                        "vi": "Anh ta từ chức hoặc bị sa thải, tùy thuộc vào người bạn nói chuyện với."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that you are not certain about something because other things have to be considered",
                    "vi": "được sử dụng để nói rằng bạn không chắc chắn về một cái gì đó bởi vì những thứ khác phải được xem xét"
                },
                "examples": [
                    {
                        "en": "‘Is he coming?’ ‘That depends. He may not have the time.’",
                        "vi": "Anh ấy đến?' 'Mà phụ thuộc. Anh ấy có thể không có thời gian. '"
                    },
                    {
                        "en": "I don't know if we can help—it all depends.",
                        "vi": "Tôi không biết liệu chúng tôi có thể giúp gì không - tất cả đều phụ thuộc."
                    },
                    {
                        "en": "I might not go. It depends how tired I am.",
                        "vi": "Tôi có thể không đi. Nó phụ thuộc vào mức độ mệt mỏi của tôi."
                    },
                    {
                        "en": "‘Your job sounds fun.’ ‘It depends what you mean by “fun”.’",
                        "vi": "Công việc của bạn nghe có vẻ thú vị.' 'Điều đó phụ thuộc vào ý bạn muốn nói \"vui vẻ\". \""
                    },
                    {
                        "en": "I shouldn't be too late. But it depends if the traffic's bad.",
                        "vi": "Tôi không nên quá muộn. Nhưng nó phụ thuộc nếu giao thông của xấu."
                    }
                ]
            }
        ]
    },
    {
        "id": "6e799adac1914f7597f4751eb08d6df8",
        "word": "doubt",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/daʊt/",
            "us": "/daʊt/"
        },
        "nearby": [
            {
                "word": "doubloon",
                "pos": "noun"
            },
            {
                "word": "doubly",
                "pos": "adverb"
            },
            {
                "word": "doubt",
                "pos": "noun"
            },
            {
                "word": "doubt",
                "pos": "verb"
            },
            {
                "word": "doubter",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a feeling of being uncertain about something or not believing something",
                    "vi": "cảm giác không chắc chắn về điều gì đó hoặc không tin vào điều gì đó"
                },
                "examples": [
                    {
                        "en": "a feeling of doubt and uncertainty",
                        "vi": "một cảm giác nghi ngờ và không chắc chắn"
                    },
                    {
                        "en": "New evidence has cast doubt on the guilt of the man jailed for the crime.",
                        "vi": "Bằng chứng mới đã làm dấy lên nghi ngờ về tội của người đàn ông bị bỏ tù vì tội ác này."
                    },
                    {
                        "en": "He was starting to have some serious doubts.",
                        "vi": "Anh bắt đầu có một số nghi ngờ nghiêm trọng."
                    },
                    {
                        "en": "to have lingering/grave/nagging doubts",
                        "vi": "có những nghi ngờ kéo dài / nghiêm trọng / dai dẳng"
                    },
                    {
                        "en": "doubt about something The article raised doubts about how effective the new drug really was.",
                        "vi": "nghi ngờ về điều gì đó Bài báo nêu lên những nghi ngờ về hiệu quả thực sự của loại thuốc mới."
                    },
                    {
                        "en": "There is some doubt about the best way to do it.",
                        "vi": "Có một số nghi ngờ về cách tốt nhất để làm điều đó."
                    },
                    {
                        "en": "doubt (that)… There is no doubt at all that we did the right thing.",
                        "vi": "nghi ngờ (điều đó)… Không còn nghi ngờ gì nữa rằng chúng tôi đã làm đúng."
                    },
                    {
                        "en": "There's little doubt in my mind that he's going to go right to the top.",
                        "vi": "Tôi có chút nghi ngờ rằng anh ấy sẽ đi ngay đến đỉnh."
                    },
                    {
                        "en": "doubt as to something She leaves no doubt as to her own view of Picasso's work.",
                        "vi": "nghi ngờ về điều gì đó Cô ấy không nghi ngờ gì về quan điểm của chính mình về tác phẩm của Picasso."
                    },
                    {
                        "en": "doubt as to who, what, etc… If you are in any doubt as to whether you should be doing these exercises, consult your doctor.",
                        "vi": "nghi ngờ về ai, cái gì, v.v.… Nếu bạn có bất kỳ nghi ngờ nào về việc liệu bạn có nên thực hiện các bài tập này hay không, hãy tham khảo ý kiến bác sĩ của bạn."
                    },
                    {
                        "en": "doubt over something Medical experts have expressed doubt over how the scientist died.",
                        "vi": "nghi ngờ về điều gì đó Các chuyên gia y tế đã bày tỏ sự nghi ngờ về việc nhà khoa học đã chết như thế nào."
                    },
                    {
                        "en": "She knew without a shadow of a doubt that he was lying to her.",
                        "vi": "Cô không chút nghi ngờ rằng anh đang nói dối cô."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be uncertain",
                    "vi": "không chắc chắn"
                },
                "examples": [
                    {
                        "en": "The success of the system is not in doubt.",
                        "vi": "Sự thành công của hệ thống không có gì phải nghi ngờ."
                    },
                    {
                        "en": "The arrangements for the event still seemed to be in doubt.",
                        "vi": "Việc sắp xếp cho sự kiện dường như vẫn còn đang bị nghi ngờ."
                    }
                ]
            },
            {
                "define": {
                    "en": "in a way that shows that something is completely certain",
                    "vi": "theo cách cho thấy rằng có điều gì đó hoàn toàn chắc chắn"
                },
                "examples": [
                    {
                        "en": "The research showed beyond doubt that smoking contributes to heart disease.",
                        "vi": "Nghiên cứu đã chỉ ra rằng hút thuốc lá góp phần gây ra bệnh tim."
                    },
                    {
                        "en": "(law) The prosecution was able to establish beyond reasonable doubt that the woman had been lying.",
                        "vi": "(luật) Việc truy tố có thể đưa ra nghi ngờ hợp lý rằng người phụ nữ đã nói dối."
                    },
                    {
                        "en": "The evidence proves beyond doubt that he is innocent.",
                        "vi": "Các bằng chứng chứng minh rằng anh ta vô tội."
                    }
                ]
            },
            {
                "define": {
                    "en": "to accept that somebody has told the truth or behaved well because you cannot prove that they have not",
                    "vi": "chấp nhận rằng ai đó đã nói sự thật hoặc cư xử tốt bởi vì bạn không thể chứng minh rằng họ không"
                },
                "examples": [
                    {
                        "en": "She may have been lying, but I felt I had to give her the benefit of the doubt.",
                        "vi": "Cô ấy có thể đã nói dối, nhưng tôi cảm thấy tôi phải cho cô ấy lợi ích của sự nghi ngờ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have reasons why you are not certain about whether something is good or whether something good will happen",
                    "vi": "để có lý do tại sao bạn không chắc chắn về việc liệu điều gì đó tốt hay điều gì đó tốt sẽ xảy ra"
                },
                "examples": [
                    {
                        "en": "I've had my doubts about his work since he joined the firm.",
                        "vi": "Tôi đã nghi ngờ về công việc của anh ấy kể từ khi anh ấy gia nhập công ty."
                    },
                    {
                        "en": "It may be all right. Personally, I have my doubts.",
                        "vi": "Nó có thể ổn. Cá nhân tôi có những nghi ngờ của tôi."
                    },
                    {
                        "en": "They say they'll be here on time, but I have my doubts about that.",
                        "vi": "Họ nói rằng họ sẽ đến đây đúng giờ, nhưng tôi nghi ngờ về điều đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to give advice to somebody who cannot decide what to do",
                    "vi": "được sử dụng để đưa ra lời khuyên cho ai đó không thể quyết định phải làm gì"
                },
                "examples": [
                    {
                        "en": "If in doubt, wear black.",
                        "vi": "Nếu nghi ngờ, hãy mặc đồ đen."
                    },
                    {
                        "en": "If in doubt, consult your doctor.",
                        "vi": "Nếu nghi ngờ, hãy hỏi ý kiến bác sĩ của bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "used when you are saying that something is likely",
                    "vi": "được sử dụng khi bạn nói rằng điều gì đó có khả năng xảy ra"
                },
                "examples": [
                    {
                        "en": "No doubt she'll call us when she gets there.",
                        "vi": "Không nghi ngờ gì nữa, cô ấy sẽ gọi cho chúng tôi khi cô ấy đến đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "used when you are saying that something is certainly true",
                    "vi": "được sử dụng khi bạn đang nói rằng điều gì đó chắc chắn là đúng"
                },
                "examples": [
                    {
                        "en": "He's made some great movies. There's no doubt about it.",
                        "vi": "Anh ấy đã làm một số bộ phim tuyệt vời. Không có nghi ngờ gì về điều đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make something uncertain",
                    "vi": "để làm cho một cái gì đó không chắc chắn"
                },
                "examples": [
                    {
                        "en": "The proposed development has been thrown into doubt by the decision.",
                        "vi": "Sự phát triển được đề xuất đã bị nghi ngờ bởi quyết định."
                    }
                ]
            },
            {
                "define": {
                    "en": "used when you are giving your opinion and emphasizing the point that you are making",
                    "vi": "được sử dụng khi bạn đưa ra ý kiến của mình và nhấn mạnh quan điểm mà bạn đang đưa ra"
                },
                "examples": [
                    {
                        "en": "This meeting has been, without doubt, one of the most useful we have had so far.",
                        "vi": "Không nghi ngờ gì, cuộc họp này là một trong những cuộc gặp gỡ hữu ích nhất mà chúng tôi có được cho đến nay."
                    },
                    {
                        "en": "Without the slightest doubt this is a remarkable exhibition.",
                        "vi": "Không nghi ngờ gì nữa, đây là một cuộc triển lãm đáng chú ý."
                    },
                    {
                        "en": "She is without a doubt the best player I know.",
                        "vi": "Cô ấy chắc chắn là cầu thủ xuất sắc nhất mà tôi biết."
                    }
                ]
            }
        ]
    },
    {
        "id": "8e575576072b407b8f31c698116d5923",
        "word": "doubt",
        "pos": "verb",
        "level": "b1",
        "phonetic": {
            "uk": "/daʊt/",
            "us": "/daʊt/"
        },
        "nearby": [
            {
                "word": "doubly",
                "pos": "adverb"
            },
            {
                "word": "doubt",
                "pos": "noun"
            },
            {
                "word": "doubt",
                "pos": "verb"
            },
            {
                "word": "doubter",
                "pos": "noun"
            },
            {
                "word": "doubtful",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to feel uncertain about something; to feel that something is not true, will probably not happen, etc.",
                    "vi": "cảm thấy không chắc chắn về điều gì đó; để cảm thấy rằng điều gì đó không đúng, có thể sẽ không xảy ra, v.v."
                },
                "examples": [
                    {
                        "en": "doubt something There seems no reason to doubt her story.",
                        "vi": "nghi ngờ điều gì đó Dường như không có lý do gì để nghi ngờ câu chuyện của cô ấy."
                    },
                    {
                        "en": "to doubt the sincerity/wisdom/existence of something",
                        "vi": "nghi ngờ sự chân thành / khôn ngoan / tồn tại của một cái gì đó"
                    },
                    {
                        "en": "‘Do you think England will win?’—‘I doubt it.’",
                        "vi": "Bạn có nghĩ rằng Anh sẽ thắng? - \"Tôi nghi ngờ điều đó.\""
                    },
                    {
                        "en": "doubt (that)… I never doubted (that) she would come.",
                        "vi": "nghi ngờ (điều đó)… Tôi không bao giờ nghi ngờ (điều đó) cô ấy sẽ đến."
                    },
                    {
                        "en": "She seriously doubted he would still be waiting for her.",
                        "vi": "Cô thực sự nghi ngờ anh vẫn đợi cô."
                    },
                    {
                        "en": "doubt whether, if, etc… I doubt whether the new one will be any better.",
                        "vi": "nghi ngờ liệu, nếu, vv… Tôi nghi ngờ liệu cái mới sẽ tốt hơn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to not trust somebody/something; to not believe somebody",
                    "vi": "không tin ai đó / cái gì đó; không tin ai đó"
                },
                "examples": [
                    {
                        "en": "I had no reason to doubt him.",
                        "vi": "Tôi không có lý do gì để nghi ngờ anh ta."
                    }
                ]
            }
        ]
    },
    {
        "id": "48067ff6dc9f45ef97ffd9ca51b0cee8",
        "word": "not necessarily",
        "pos": "idiom",
        "level": "b1",
        "phonetic": {
            "uk": "/ˌnesəˈserəli/",
            "us": "/ˌnesəˈserəli/"
        },
        "nearby": [
            {
                "word": "NEC",
                "pos": ""
            },
            {
                "word": "necessaries",
                "pos": "noun"
            },
            {
                "word": "necessarily",
                "pos": "adverb"
            },
            {
                "word": "necessary",
                "pos": "adjective"
            },
            {
                "word": "necessitate",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "used to say that something cannot be avoided",
                    "vi": "được sử dụng để nói rằng một cái gì đó không thể tránh được"
                },
                "examples": [
                    {
                        "en": "The number of places available is necessarily limited.",
                        "vi": "Số lượng nơi có sẵn nhất thiết phải có giới hạn."
                    },
                    {
                        "en": "Servants necessarily had close contact with their employers.",
                        "vi": "Những người phục vụ nhất thiết phải có liên hệ chặt chẽ với người sử dụng lao động của họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that something is possibly true but not definitely or always true",
                    "vi": "được sử dụng để nói rằng điều gì đó có thể đúng nhưng không chắc chắn hoặc luôn đúng"
                },
                "examples": [
                    {
                        "en": "Biggest doesn't necessarily mean best.",
                        "vi": "Lớn nhất không nhất thiết có nghĩa là tốt nhất."
                    },
                    {
                        "en": "It isn't necessarily true that sugar is bad for you.",
                        "vi": "Không hẳn là đường có hại cho sức khỏe của bạn."
                    },
                    {
                        "en": "The more expensive articles are not necessarily better.",
                        "vi": "Các bài báo đắt hơn chưa chắc đã tốt hơn."
                    },
                    {
                        "en": "‘We're going to lose.’ ‘Not necessarily.’",
                        "vi": "Chúng ta sẽ thua.' 'Không cần thiết.'"
                    },
                    {
                        "en": "The views in this article do not necessarily reflect those of the college.",
                        "vi": "Các quan điểm trong bài viết này không nhất thiết phản ánh quan điểm của trường đại học."
                    }
                ]
            }
        ]
    },
    {
        "id": "ff4b31d4b5b545f985fd0712c723aa2d",
        "word": "or somebody/something/somewhere",
        "pos": "idiom",
        "level": "b1",
        "phonetic": {
            "uk": "/ɔː(r)/",
            "us": "/ɔːr/"
        },
        "nearby": [
            {
                "word": "opulently",
                "pos": "adverb"
            },
            {
                "word": "opus",
                "pos": "noun"
            },
            {
                "word": "or",
                "pos": "conjunction"
            },
            {
                "word": "-or",
                "pos": "suffix"
            },
            {
                "word": "oracle",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "used to introduce another possibility",
                    "vi": "được sử dụng để giới thiệu một khả năng khác"
                },
                "examples": [
                    {
                        "en": "Is your sister older or younger than you?",
                        "vi": "Chị gái của bạn lớn hơn hay nhỏ hơn bạn?"
                    },
                    {
                        "en": "Are you coming or not?",
                        "vi": "Bạn có đến hay không?"
                    },
                    {
                        "en": "Is it a boy or a girl?",
                        "vi": "Đó là trai hay gái?"
                    }
                ]
            },
            {
                "define": {
                    "en": "used in negative sentences when mentioning two or more things",
                    "vi": "được sử dụng trong câu phủ định khi đề cập đến hai hoặc nhiều điều"
                },
                "examples": [
                    {
                        "en": "He can't read or write.",
                        "vi": "Anh ấy không thể đọc hoặc viết."
                    },
                    {
                        "en": "There are people without homes, jobs or family.",
                        "vi": "Có những người không có nhà cửa, công việc hoặc gia đình."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to warn or advise somebody that something bad could happen; otherwise",
                    "vi": "được sử dụng để cảnh báo hoặc khuyên ai đó rằng điều gì đó tồi tệ có thể xảy ra; nếu không thì"
                },
                "examples": [
                    {
                        "en": "Turn the heat down or it'll burn.",
                        "vi": "Giảm nhiệt độ xuống nếu không nó sẽ bị cháy."
                    }
                ]
            },
            {
                "define": {
                    "en": "used between two numbers to show approximately how many",
                    "vi": "được sử dụng giữa hai số để hiển thị gần đúng bao nhiêu"
                },
                "examples": [
                    {
                        "en": "There were six or seven of us there.",
                        "vi": "Có sáu hoặc bảy người chúng tôi ở đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to introduce a word or phrase that explains or means the same as another",
                    "vi": "được sử dụng để giới thiệu một từ hoặc cụm từ giải thích hoặc có nghĩa giống với một từ hoặc cụm từ khác"
                },
                "examples": [
                    {
                        "en": "geology, or the science of the earth’s crust",
                        "vi": "địa chất, hay khoa học về vỏ trái đất"
                    },
                    {
                        "en": "It weighs a kilo, or just over two pounds.",
                        "vi": "Nó nặng một kg, hoặc chỉ hơn hai pound."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say why something must be true",
                    "vi": "được sử dụng để nói tại sao một cái gì đó phải là sự thật"
                },
                "examples": [
                    {
                        "en": "He must like her, or he wouldn't keep calling her.",
                        "vi": "Anh ấy phải thích cô ấy, nếu không anh ấy sẽ không tiếp tục gọi cho cô ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to introduce a different or opposite idea",
                    "vi": "được sử dụng để giới thiệu một ý tưởng khác hoặc đối lập"
                },
                "examples": [
                    {
                        "en": "He was lying—or was he?",
                        "vi": "Anh ta đang nói dối - hay là anh ta?"
                    }
                ]
            },
            {
                "define": {
                    "en": "about; approximately",
                    "vi": "xung quanh; xấp xỉ"
                },
                "examples": [
                    {
                        "en": "It'll cost €100 or so.",
                        "vi": "Nó sẽ có giá € 100 hoặc hơn."
                    }
                ]
            },
            {
                "define": {
                    "en": "used when you are not exactly sure about a person, thing or place",
                    "vi": "được sử dụng khi bạn không chắc chắn chính xác về một người, sự vật hoặc địa điểm"
                },
                "examples": [
                    {
                        "en": "He's a factory supervisor or something.",
                        "vi": "Anh ấy là giám sát nhà máy hay gì đó."
                    },
                    {
                        "en": "‘Who said so?’ ‘Oh, somebody or other. I can't remember who it was.’",
                        "vi": "Ai đã nói vậy?' 'Ồ, ai đó hay người khác. Tôi không thể nhớ đó là ai. '"
                    }
                ]
            }
        ]
    },
    {
        "id": "5d4cbe7b1b2244a3be495edf93e1534b",
        "word": "possibly",
        "pos": "adverb",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈpɒsəbli/",
            "us": "/ˈpɑːsəbli/"
        },
        "nearby": [
            {
                "word": "possible",
                "pos": "adjective"
            },
            {
                "word": "possible",
                "pos": "noun"
            },
            {
                "word": "possibly",
                "pos": "adverb"
            },
            {
                "word": "possum",
                "pos": "noun"
            },
            {
                "word": "post-",
                "pos": "prefix"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "used to say that something might exist, happen or be true, but you are not certain",
                    "vi": "được sử dụng để nói rằng điều gì đó có thể tồn tại, xảy ra hoặc đúng, nhưng bạn không chắc chắn"
                },
                "examples": [
                    {
                        "en": "It was possibly their worst performance ever.",
                        "vi": "Đó có thể là màn trình diễn tồi tệ nhất của họ từ trước đến nay."
                    },
                    {
                        "en": "She found it difficult to get on with her, possibly because of the difference in their ages.",
                        "vi": "Cô ấy cảm thấy rất khó để hòa nhập với cô ấy, có thể vì sự khác biệt về tuổi tác của họ."
                    },
                    {
                        "en": "‘Will you be around next week?’ ‘Possibly.’",
                        "vi": "Bạn có ở đó vào tuần tới không?' 'Có khả năng.'"
                    },
                    {
                        "en": "‘I’m sure he didn’t mean to be rude.’ ‘Quite possibly (= you may be right), but the damage has been done.’",
                        "vi": "Tôi chắc rằng anh ấy không cố ý thô lỗ.' 'Hoàn toàn có thể (= bạn có thể đúng), nhưng thiệt hại đã được thực hiện.'"
                    },
                    {
                        "en": "Last year, his mother died, possibly due to heart failure.",
                        "vi": "Năm ngoái, mẹ anh mất, có thể do suy tim."
                    },
                    {
                        "en": "a popular but possibly dangerous type of extreme diet",
                        "vi": "một kiểu ăn kiêng cực đoan phổ biến nhưng có thể nguy hiểm"
                    }
                ]
            },
            {
                "define": {
                    "en": "used with can/could to emphasize that you are surprised, annoyed, etc. about something",
                    "vi": "được sử dụng với can / could để nhấn mạnh rằng bạn đang ngạc nhiên, khó chịu, v.v. về điều gì đó"
                },
                "examples": [
                    {
                        "en": "You can't possibly mean that!",
                        "vi": "Bạn không thể có ý đó!"
                    },
                    {
                        "en": "How could you possibly think that I had anything to do with it!",
                        "vi": "Làm thế nào bạn có thể nghĩ rằng tôi có bất cứ điều gì để làm với nó!"
                    },
                    {
                        "en": "He turned out to be the nicest guy you could possibly imagine.",
                        "vi": "Anh ấy hóa ra là người đàn ông đẹp nhất mà bạn có thể tưởng tượng."
                    },
                    {
                        "en": "(usually ironic) What could possibly go wrong?",
                        "vi": "(thường là mỉa mai) Điều gì có thể xảy ra?"
                    }
                ]
            },
            {
                "define": {
                    "en": "used with could to ask somebody politely to do something",
                    "vi": "được sử dụng với can để yêu cầu ai đó lịch sự làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "Could you possibly open that window?",
                        "vi": "Bạn có thể mở cửa sổ đó không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "used with can/could to say that somebody will do or has done as much as they can in order to make something happen",
                    "vi": "được sử dụng với can / could để nói rằng ai đó sẽ làm hoặc đã làm nhiều nhất có thể để biến điều gì đó xảy ra"
                },
                "examples": [
                    {
                        "en": "I will come as soon as I possibly can.",
                        "vi": "Tôi sẽ đến ngay khi có thể."
                    },
                    {
                        "en": "They tried everything they possibly could to improve the situation.",
                        "vi": "Họ đã thử mọi cách có thể để cải thiện tình hình."
                    },
                    {
                        "en": "We don’t want these rumours to spread if we can possibly avoid it.",
                        "vi": "Chúng tôi không muốn những tin đồn này lan truyền nếu chúng tôi có thể tránh được nó."
                    },
                    {
                        "en": "I don't see what more he could possibly do.",
                        "vi": "Tôi không biết anh ấy có thể làm được gì nữa."
                    }
                ]
            },
            {
                "define": {
                    "en": "used with negatives, especially can't/couldn't, to say strongly that you cannot do something or that something cannot or could not happen or be done",
                    "vi": "Được sử dụng với từ phủ định, đặc biệt là không thể / không thể, để nói mạnh rằng bạn không thể làm điều gì đó hoặc điều gì đó không thể hoặc không thể xảy ra hoặc được thực hiện"
                },
                "examples": [
                    {
                        "en": "I can't possibly tell you that!",
                        "vi": "Tôi không thể nói với bạn điều đó!"
                    },
                    {
                        "en": "You can't possibly carry all those bags.",
                        "vi": "Bạn không thể mang tất cả những chiếc túi đó."
                    },
                    {
                        "en": "‘Let me buy it for you.’ ‘That's very kind of you, but I couldn't possibly (= accept).’",
                        "vi": "Hãy để tôi mua nó cho bạn.' \"Bạn rất tốt, nhưng tôi không thể (= chấp nhận).\""
                    }
                ]
            }
        ]
    },
    {
        "id": "4569eeb58aae46bcbcdf761f4ea84034",
        "word": "uncertain",
        "pos": "adjective",
        "level": "b1",
        "phonetic": {
            "uk": "/ʌnˈsɜːtn/",
            "us": "/ʌnˈsɜːrtn/"
        },
        "nearby": [
            {
                "word": "unceremonious",
                "pos": "adjective"
            },
            {
                "word": "unceremoniously",
                "pos": "adverb"
            },
            {
                "word": "uncertain",
                "pos": "adjective"
            },
            {
                "word": "uncertainly",
                "pos": "adverb"
            },
            {
                "word": "uncertainty",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "feeling doubt about something; not sure",
                    "vi": "cảm thấy nghi ngờ về điều gì đó; không chắc"
                },
                "examples": [
                    {
                        "en": "They're both uncertain about what to do.",
                        "vi": "Cả hai đều không chắc chắn về những gì phải làm."
                    },
                    {
                        "en": "I'm still uncertain of my feelings for him.",
                        "vi": "Tôi vẫn chưa chắc chắn về tình cảm của mình dành cho anh ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "likely to change, especially in a negative or unpleasant way",
                    "vi": "có khả năng thay đổi, đặc biệt là theo cách tiêu cực hoặc khó chịu"
                },
                "examples": [
                    {
                        "en": "Our future looks uncertain.",
                        "vi": "Tương lai của chúng tôi có vẻ không chắc chắn."
                    },
                    {
                        "en": "a man of uncertain temper",
                        "vi": "một người đàn ông nóng nảy không chắc chắn"
                    }
                ]
            },
            {
                "define": {
                    "en": "not definite or decided",
                    "vi": "không xác định hoặc quyết định"
                },
                "examples": [
                    {
                        "en": "It is uncertain what his role in the company will be.",
                        "vi": "Không chắc chắn vai trò của anh ấy trong công ty sẽ như thế nào."
                    }
                ]
            },
            {
                "define": {
                    "en": "not confident",
                    "vi": "không chắc chắn"
                },
                "examples": [
                    {
                        "en": "The baby took its first uncertain steps.",
                        "vi": "Em bé bước những bước đầu tiên đầy bỡ ngỡ."
                    }
                ]
            },
            {
                "define": {
                    "en": "clearly and strongly",
                    "vi": "rõ ràng và mạnh mẽ"
                },
                "examples": [
                    {
                        "en": "I told him what I thought of him in no uncertain terms.",
                        "vi": "Tôi nói với anh ấy những gì tôi nghĩ về anh ấy mà không có điều kiện chắc chắn."
                    }
                ]
            }
        ]
    },
    {
        "id": "143ea79740e64999b74b8d8a7e9da7ab",
        "word": "unclear",
        "pos": "adjective",
        "level": "b1",
        "phonetic": {
            "uk": "/ˌʌnˈklɪə(r)/",
            "us": "/ˌʌnˈklɪr/"
        },
        "nearby": [
            {
                "word": "uncle",
                "pos": "noun"
            },
            {
                "word": "unclean",
                "pos": "adjective"
            },
            {
                "word": "unclear",
                "pos": "adjective"
            },
            {
                "word": "Uncle Ben's",
                "pos": ""
            },
            {
                "word": "Uncle Remus",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "not clear or definite; difficult to understand or be sure about",
                    "vi": "không rõ ràng hoặc xác định; khó hiểu hoặc chắc chắn về"
                },
                "examples": [
                    {
                        "en": "His motives are unclear.",
                        "vi": "Động cơ của anh ta không rõ ràng."
                    },
                    {
                        "en": "Our plans are unclear at the moment.",
                        "vi": "Kế hoạch của chúng tôi không rõ ràng vào lúc này."
                    },
                    {
                        "en": "It is unclear whether there is any damage.",
                        "vi": "Hiện chưa rõ có thiệt hại gì không."
                    },
                    {
                        "en": "Your diagrams are unclear.",
                        "vi": "Sơ đồ của bạn không rõ ràng."
                    }
                ]
            },
            {
                "define": {
                    "en": "not fully understanding something",
                    "vi": "không hoàn toàn hiểu một cái gì đó"
                },
                "examples": [
                    {
                        "en": "I'm unclear about what you want me to do.",
                        "vi": "Tôi không rõ về những gì bạn muốn tôi làm."
                    }
                ]
            }
        ]
    },
    {
        "id": "998549f0fb5f4c37871b4249e53c8cf9",
        "word": "unlikely",
        "pos": "adjective",
        "level": "b1",
        "phonetic": {
            "uk": "/ʌnˈlaɪkli/",
            "us": "/ʌnˈlaɪkli/"
        },
        "nearby": [
            {
                "word": "unlikelihood",
                "pos": "noun"
            },
            {
                "word": "unlikeliness",
                "pos": "noun"
            },
            {
                "word": "unlikely",
                "pos": "adjective"
            },
            {
                "word": "unlimited",
                "pos": "adjective"
            },
            {
                "word": "unlined",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "not likely to happen; not probable",
                    "vi": "không có khả năng xảy ra; không thể xảy ra"
                },
                "examples": [
                    {
                        "en": "unlikely to do something The project seemed unlikely to succeed.",
                        "vi": "không chắc sẽ làm được điều gì đó Dự án dường như không thể thành công."
                    },
                    {
                        "en": "Of course, such an event is very unlikely to happen.",
                        "vi": "Tất nhiên, một sự kiện như vậy là rất khó xảy ra."
                    },
                    {
                        "en": "it is unlikely (that…) It was highly unlikely that the gunshot wound was self-inflicted.",
                        "vi": "điều đó không chắc (điều đó…) Rất ít khả năng vết thương do đạn bắn là do tự gây ra."
                    },
                    {
                        "en": "It is extremely unlikely that the new owner would want to make people redundant.",
                        "vi": "Chủ nhân mới muốn làm cho người ta dư thừa là điều cực kỳ khó xảy ra."
                    },
                    {
                        "en": "It looks unlikely that prices will fall.",
                        "vi": "Có vẻ như giá sẽ không giảm."
                    },
                    {
                        "en": "It's most (= very) unlikely that she'll arrive before seven.",
                        "vi": "Hầu hết (= rất) không chắc rằng cô ấy sẽ đến trước bảy giờ."
                    },
                    {
                        "en": "Problems with the evidence made it unlikely that he would ever be prosecuted.",
                        "vi": "Các vấn đề với bằng chứng khiến anh ta khó có thể bị truy tố."
                    },
                    {
                        "en": "In the unlikely event of a problem arising, please contact the hotel manager.",
                        "vi": "Trong trường hợp không may có vấn đề phát sinh, vui lòng liên hệ với quản lý khách sạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "not the person, thing or place that you would normally think of or expect",
                    "vi": "không phải người, vật hoặc địa điểm mà bạn thường nghĩ đến hoặc mong đợi"
                },
                "examples": [
                    {
                        "en": "He seems a most unlikely candidate for the job.",
                        "vi": "Anh ta dường như là một ứng cử viên không có khả năng nhất cho công việc."
                    },
                    {
                        "en": "They have built hotels in the most unlikely places.",
                        "vi": "Họ đã xây dựng các khách sạn ở những nơi khó xảy ra nhất."
                    }
                ]
            },
            {
                "define": {
                    "en": "difficult to believe",
                    "vi": "khó tin"
                },
                "examples": [
                    {
                        "en": "She gave me an unlikely explanation for her behaviour.",
                        "vi": "Cô ấy đã đưa cho tôi một lời giải thích khó có thể xảy ra cho hành vi của cô ấy."
                    }
                ]
            }
        ]
    },
    {
        "id": "bdd398071ac748cd8fb03304684da48b",
        "word": "unsure",
        "pos": "adjective",
        "level": "b1",
        "phonetic": {
            "uk": "/ˌʌnˈʃʊə(r)/",
            "us": "/ˌʌnˈʃʊr/"
        },
        "nearby": [
            {
                "word": "unsupervised",
                "pos": "adjective"
            },
            {
                "word": "unsupported",
                "pos": "adjective"
            },
            {
                "word": "unsure",
                "pos": "adjective"
            },
            {
                "word": "unsurpassed",
                "pos": "adjective"
            },
            {
                "word": "unsurprised",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "not certain of something; having doubts",
                    "vi": "không chắc chắn về một cái gì đó; có nghi ngờ"
                },
                "examples": [
                    {
                        "en": "unsure about/of something There were a lot of things I was unsure about.",
                        "vi": "không chắc về / về điều gì đó Có rất nhiều điều tôi không chắc chắn về điều đó."
                    },
                    {
                        "en": "unsure how, what, etc… I was unsure how to reply to this question.",
                        "vi": "không chắc bằng cách nào, cái gì, v.v.… Tôi không chắc làm thế nào để trả lời câu hỏi này."
                    },
                    {
                        "en": "unsure of how, what, etc… He was unsure of what to do next.",
                        "vi": "không chắc bằng cách nào, cái gì, v.v.… Anh ta không chắc mình phải làm gì tiếp theo."
                    },
                    {
                        "en": "unsure as to how, what, etc… They were unsure as to what the next move should be.",
                        "vi": "không chắc về cách thức, điều gì, v.v.… Họ không chắc về động thái tiếp theo nên là gì."
                    }
                ]
            },
            {
                "define": {
                    "en": "not having enough confidence in yourself",
                    "vi": "không có đủ tự tin vào bản thân"
                },
                "examples": [
                    {
                        "en": "Like many women, deep down she was unsure of herself.",
                        "vi": "Giống như nhiều phụ nữ, trong sâu thẳm cô ấy không chắc chắn về bản thân mình."
                    }
                ]
            }
        ]
    },
    {
        "id": "1ace645a62024548825ffb1f40c4a21f",
        "word": "confusion",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/kənˈfjuːʒn/",
            "us": "/kənˈfjuːʒn/"
        },
        "nearby": [
            {
                "word": "confusing",
                "pos": "adjective"
            },
            {
                "word": "confusingly",
                "pos": "adverb"
            },
            {
                "word": "confusion",
                "pos": "noun"
            },
            {
                "word": "confute",
                "pos": "verb"
            },
            {
                "word": "conga",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a state of not being certain about what is happening, what you should do, what something means, etc.",
                    "vi": "trạng thái không chắc chắn về những gì đang xảy ra, bạn nên làm gì, điều gì đó có nghĩa là gì, v.v."
                },
                "examples": [
                    {
                        "en": "The announcement caused a lot of confusion.",
                        "vi": "Thông báo đã gây ra rất nhiều nhầm lẫn."
                    },
                    {
                        "en": "confusion about/over something There is some confusion about what the correct procedure should be.",
                        "vi": "nhầm lẫn về / về điều gì đó Có một số nhầm lẫn về quy trình chính xác phải là gì."
                    },
                    {
                        "en": "confusion as to something There was a confusion as to what to do next.",
                        "vi": "bối rối về điều gì đó Có sự bối rối không biết phải làm gì tiếp theo."
                    }
                ]
            },
            {
                "define": {
                    "en": "the fact of making a mistake about who somebody is or what something is",
                    "vi": "thực tế là phạm sai lầm về ai đó là ai hoặc cái gì đó là gì"
                },
                "examples": [
                    {
                        "en": "To avoid confusion, please write the children's names clearly on all their school clothes.",
                        "vi": "Để tránh nhầm lẫn, vui lòng viết rõ tên của trẻ trên tất cả quần áo đi học của chúng."
                    },
                    {
                        "en": "confusion between A and B confusion between letters of the alphabet like ‘o’ or ‘a’",
                        "vi": "nhầm lẫn giữa A và B nhầm lẫn giữa các chữ cái trong bảng chữ cái như 'o' hoặc 'a'"
                    }
                ]
            },
            {
                "define": {
                    "en": "a situation in which you feel embarrassed because you do not understand something and are not sure what to do",
                    "vi": "một tình huống mà bạn cảm thấy xấu hổ vì bạn không hiểu điều gì đó và không biết phải làm gì"
                },
                "examples": [
                    {
                        "en": "in confusion He looked at me in confusion and did not answer the question.",
                        "vi": "trong bối rối Anh ấy nhìn tôi bối rối và không trả lời câu hỏi."
                    },
                    {
                        "en": "Sacha felt confusion sweeping over her as she read the letter.",
                        "vi": "Sacha cảm thấy bối rối bao trùm khi cô đọc bức thư."
                    }
                ]
            },
            {
                "define": {
                    "en": "a confused situation in which people do not know what action to take",
                    "vi": "một tình huống bối rối mà mọi người không biết phải làm gì"
                },
                "examples": [
                    {
                        "en": "Fighting had broken out and all was chaos and confusion.",
                        "vi": "Giao tranh đã nổ ra và tất cả chỉ là hỗn loạn và lộn xộn."
                    },
                    {
                        "en": "Her unexpected arrival threw us into total confusion.",
                        "vi": "Sự xuất hiện bất ngờ của cô ấy khiến chúng tôi vô cùng bối rối."
                    }
                ]
            }
        ]
    },
    {
        "id": "8f87bd9d225c437d99d55589d717310d",
        "word": "hesitate",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈhezɪteɪt/",
            "us": "/ˈhezɪteɪt/"
        },
        "nearby": [
            {
                "word": "hesitant",
                "pos": "adjective"
            },
            {
                "word": "hesitantly",
                "pos": "adverb"
            },
            {
                "word": "hesitate",
                "pos": "verb"
            },
            {
                "word": "hesitation",
                "pos": "noun"
            },
            {
                "word": "hessian",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to be slow to speak or act because you feel uncertain or nervous",
                    "vi": "chậm nói hoặc hành động vì bạn cảm thấy không chắc chắn hoặc lo lắng"
                },
                "examples": [
                    {
                        "en": "She hesitated before replying.",
                        "vi": "Cô ấy ngập ngừng trước khi trả lời."
                    },
                    {
                        "en": "He seemed to hesitate a second.",
                        "vi": "Anh ta dường như do dự một giây."
                    },
                    {
                        "en": "hesitate about/over something When she hesitated over her order, the waiter gave her an impatient look.",
                        "vi": "do dự về / về điều gì đó Khi cô ấy do dự về món ăn của mình, người phục vụ nhìn cô ấy một cách thiếu kiên nhẫn."
                    },
                    {
                        "en": "hesitate about/over doing something I didn't hesitate for a moment about taking the job.",
                        "vi": "do dự về / quá mức khi làm một việc gì đó Tôi đã không do dự một lúc về việc nhận việc."
                    },
                    {
                        "en": "hesitate about/over whether, how, etc… She stood there, hesitating over whether or not to tell him the truth.",
                        "vi": "do dự về / về việc liệu, làm thế nào, vv… Cô ấy đứng đó, do dự về việc có nên nói cho anh ta biết sự thật hay không."
                    },
                    {
                        "en": "+ speech ‘I'm not sure,’ she hesitated.",
                        "vi": "Err:509"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be worried about doing something, especially because you are not sure that it is right or appropriate",
                    "vi": "lo lắng về việc làm điều gì đó, đặc biệt là vì bạn không chắc rằng điều đó là đúng hoặc thích hợp"
                },
                "examples": [
                    {
                        "en": "Please do not hesitate to contact me if you have any queries.",
                        "vi": "Vui lòng liên hệ với tôi nếu bạn có bất kỳ thắc mắc nào."
                    },
                    {
                        "en": "If you'd like me to send you the book, then please don't hesitate to ask.",
                        "vi": "Nếu bạn muốn tôi gửi sách cho bạn, vui lòng hỏi."
                    },
                    {
                        "en": "She never hesitated to speak her mind.",
                        "vi": "Cô ấy không bao giờ ngần ngại nói ra suy nghĩ của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "if you delay in doing something you may lose a good opportunity",
                    "vi": "nếu bạn chậm trễ trong việc làm điều gì đó, bạn có thể mất một cơ hội tốt"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "729ce5560312412db8ad979e6df43c92",
        "word": "should",
        "pos": "modal verb",
        "level": "b2",
        "phonetic": {
            "uk": "/ʃəd/",
            "us": "/ʃəd/"
        },
        "nearby": [
            {
                "word": "Shotokan",
                "pos": "noun"
            },
            {
                "word": "shot-put",
                "pos": "noun"
            },
            {
                "word": "should",
                "pos": "modal verb"
            },
            {
                "word": "shoulder",
                "pos": "noun"
            },
            {
                "word": "shoulder",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "used to show what is right, appropriate, etc., especially when criticizing somebody’s actions",
                    "vi": "được sử dụng để chỉ ra điều gì là đúng, phù hợp, v.v., đặc biệt là khi chỉ trích hành động của ai đó"
                },
                "examples": [
                    {
                        "en": "You shouldn't drink and drive.",
                        "vi": "Bạn không nên uống rượu và lái xe."
                    },
                    {
                        "en": "He should have been more careful.",
                        "vi": "Anh ấy lẽ ra phải cẩn thận hơn."
                    },
                    {
                        "en": "A present for me? You shouldn't have! (= used to thank somebody politely)",
                        "vi": "Một món quà cho tôi? Bạn không nên có! (= dùng để cảm ơn ai đó một cách lịch sự)"
                    }
                ]
            },
            {
                "define": {
                    "en": "used for giving or asking for advice",
                    "vi": "được sử dụng để đưa ra hoặc yêu cầu lời khuyên"
                },
                "examples": [
                    {
                        "en": "You should stop worrying about it.",
                        "vi": "Bạn nên ngừng lo lắng về nó."
                    },
                    {
                        "en": "Should I call him and apologize?",
                        "vi": "Tôi có nên gọi cho anh ấy và xin lỗi không?"
                    },
                    {
                        "en": "I should wait a little longer, if I were you.",
                        "vi": "Tôi nên đợi thêm một thời gian nữa, nếu tôi là bạn."
                    },
                    {
                        "en": "(ironic) ‘She doesn't think she'll get a job.’ ‘She should worry, with all her qualifications (= she does not need to worry).’",
                        "vi": "(mỉa mai) 'Cô ấy không nghĩ mình sẽ kiếm được việc làm.' 'Cô ấy nên lo lắng, với tất cả khả năng của mình (= cô ấy không cần phải lo lắng).'"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that you expect something is true or will happen",
                    "vi": "được sử dụng để nói rằng bạn mong đợi điều gì đó là sự thật hoặc sẽ xảy ra"
                },
                "examples": [
                    {
                        "en": "We should arrive before dark.",
                        "vi": "Chúng ta nên đến trước khi trời tối."
                    },
                    {
                        "en": "I should have finished the book by Friday.",
                        "vi": "Tôi đáng lẽ phải hoàn thành cuốn sách trước thứ sáu."
                    },
                    {
                        "en": "The roads should be less crowded today.",
                        "vi": "Các con đường nên ít đông đúc hơn ngày hôm nay."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that something that was expected has not happened",
                    "vi": "được sử dụng để nói rằng một cái gì đó được mong đợi đã không xảy ra"
                },
                "examples": [
                    {
                        "en": "It should be snowing now, according to the weather forecast.",
                        "vi": "Theo dự báo thời tiết, bây giờ trời sẽ có tuyết."
                    },
                    {
                        "en": "The bus should have arrived ten minutes ago.",
                        "vi": "Xe buýt lẽ ra đã đến cách đây mười phút."
                    }
                ]
            },
            {
                "define": {
                    "en": "used as the past form of shall when reporting what somebody has said",
                    "vi": "được sử dụng như dạng quá khứ của will khi báo cáo những gì ai đó đã nói"
                },
                "examples": [
                    {
                        "en": "He asked me what time he should come. (= His words were: ‘What time shall I come?’)",
                        "vi": "Anh ấy hỏi tôi mấy giờ anh ấy nên đến. (= Lời nói của anh ấy là: 'Mấy giờ tôi sẽ đến?')"
                    },
                    {
                        "en": "(British English, formal) I said (that) I should be glad to help.",
                        "vi": "(Anh Anh, trang trọng) Tôi đã nói (điều đó) Tôi rất vui được giúp đỡ."
                    }
                ]
            },
            {
                "define": {
                    "en": "used after that when something is suggested or arranged",
                    "vi": "được sử dụng sau đó khi một cái gì đó được đề xuất hoặc sắp xếp"
                },
                "examples": [
                    {
                        "en": "She recommended that I should take some time off.",
                        "vi": "Cô ấy khuyên rằng tôi nên dành thời gian nghỉ ngơi."
                    },
                    {
                        "en": "In order that training should be effective it must be planned systematically.",
                        "vi": "Để việc đào tạo có hiệu quả, nó phải được lập kế hoạch một cách có hệ thống."
                    }
                ]
            },
            {
                "define": {
                    "en": "used with I and we to give opinions that you are not certain about",
                    "vi": "được sử dụng với tôi và chúng tôi đưa ra ý kiến mà bạn không chắc chắn về"
                },
                "examples": [
                    {
                        "en": "I should imagine it will take about three hours.",
                        "vi": "Tôi nên tưởng tượng nó sẽ mất khoảng ba giờ."
                    },
                    {
                        "en": "‘Is this enough food for everyone?’ ‘I should think so.’",
                        "vi": "Cái này có đủ thức ăn cho mọi người không?' 'Tôi nên nghĩ như vậy.'"
                    },
                    {
                        "en": "‘Will it matter?’ ‘I shouldn't think so.’",
                        "vi": "Liệu nó có quan trọng không?' 'Tôi không nên nghĩ như vậy.'"
                    }
                ]
            },
            {
                "define": {
                    "en": "used for expressing strong agreement",
                    "vi": "được sử dụng để bày tỏ sự đồng ý mạnh mẽ"
                },
                "examples": [
                    {
                        "en": "‘I know it's expensive but it will last for years.’ ‘I should hope so too!’",
                        "vi": "Tôi biết nó đắt nhưng nó sẽ tồn tại trong nhiều năm.' 'Tôi cũng nên hy vọng như vậy!'"
                    },
                    {
                        "en": "‘Nobody will oppose it.’ ‘I should think not!’",
                        "vi": "Không ai phản đối nó.' 'Tôi không nên nghĩ là không!'"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to refuse something or to show that you are annoyed at a request; used to express surprise about an event or a situation",
                    "vi": "được sử dụng để từ chối một cái gì đó hoặc để cho thấy rằng bạn đang khó chịu trước một yêu cầu; được sử dụng để bày tỏ sự ngạc nhiên về một sự kiện hoặc một tình huống"
                },
                "examples": [
                    {
                        "en": "Why should I help him? He's never done anything for me.",
                        "vi": "Tại sao tôi phải giúp anh ta? Anh ấy chưa bao giờ làm bất cứ điều gì cho tôi."
                    },
                    {
                        "en": "How should I know where you've left your bag?",
                        "vi": "Làm sao tôi biết bạn đã để túi ở đâu?"
                    },
                    {
                        "en": "I got on the bus and who should be sitting in front of me but Tony!",
                        "vi": "Tôi đã lên xe buýt và người nên ngồi trước mặt tôi ngoài Tony!"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to tell somebody that something would surprise them or make them laugh if they saw or experienced it",
                    "vi": "từng nói với ai đó rằng điều gì đó sẽ làm họ ngạc nhiên hoặc khiến họ bật cười nếu họ nhìn thấy hoặc trải nghiệm nó"
                },
                "examples": [
                    {
                        "en": "You should have seen her face when she found out!",
                        "vi": "Bạn nên nhìn thấy khuôn mặt của cô ấy khi cô ấy phát hiện ra!"
                    }
                ]
            },
            {
                "define": {
                    "en": "used after that after many adjectives that describe feelings",
                    "vi": "được sử dụng sau đó sau nhiều tính từ miêu tả cảm giác"
                },
                "examples": [
                    {
                        "en": "I'm anxious that we should allow plenty of time.",
                        "vi": "Tôi lo lắng rằng chúng ta nên có nhiều thời gian."
                    },
                    {
                        "en": "I find it astonishing that he should be so rude to you.",
                        "vi": "Tôi thấy thật ngạc nhiên khi anh ta lại cư xử thô lỗ với bạn như vậy."
                    }
                ]
            },
            {
                "define": {
                    "en": "used with I and we in polite requests",
                    "vi": "được sử dụng với tôi và chúng tôi trong các yêu cầu lịch sự"
                },
                "examples": [
                    {
                        "en": "I should like to call my lawyer.",
                        "vi": "Tôi nên gọi cho luật sư của tôi."
                    },
                    {
                        "en": "We should be grateful for your help.",
                        "vi": "Chúng tôi nên biết ơn sự giúp đỡ của bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "used after I or we instead of would for describing what you would do if something else happened first",
                    "vi": "được sử dụng sau khi tôi hoặc chúng tôi thay vì sẽ để mô tả những gì bạn sẽ làm nếu điều gì đó xảy ra trước"
                },
                "examples": [
                    {
                        "en": "If I were asked to work on Sundays, I should resign.",
                        "vi": "Nếu tôi được yêu cầu làm việc vào Chủ nhật, tôi nên từ chức."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to refer to a possible event or situation",
                    "vi": "được sử dụng để chỉ một sự kiện hoặc tình huống có thể xảy ra"
                },
                "examples": [
                    {
                        "en": "If you should change your mind, do let me know.",
                        "vi": "Nếu bạn nên thay đổi quyết định của mình, hãy cho tôi biết."
                    },
                    {
                        "en": "In case you should need any help, here's my number.",
                        "vi": "Trong trường hợp bạn cần trợ giúp, đây là số của tôi."
                    },
                    {
                        "en": "Should anyone call (= if anyone calls), please tell them I'm busy.",
                        "vi": "Nếu có ai gọi (= nếu có ai gọi), vui lòng cho họ biết tôi đang bận."
                    }
                ]
            }
        ]
    },
    {
        "id": "d967053c72eb4eb8bc7356e4a6e3335c",
        "word": "somehow",
        "pos": "adverb",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈsʌmhaʊ/",
            "us": "/ˈsʌmhaʊ/"
        },
        "nearby": [
            {
                "word": "somebody",
                "pos": "pronoun"
            },
            {
                "word": "some day",
                "pos": "adverb"
            },
            {
                "word": "somehow",
                "pos": "adverb"
            },
            {
                "word": "someone",
                "pos": "pronoun"
            },
            {
                "word": "someplace",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "in a way that is not known or certain",
                    "vi": "theo một cách nào đó không được biết đến hoặc chắc chắn"
                },
                "examples": [
                    {
                        "en": "We must stop him from seeing her somehow.",
                        "vi": "Chúng ta phải ngăn anh ta gặp cô ấy bằng cách nào đó."
                    },
                    {
                        "en": "Somehow or other I must get a new job.",
                        "vi": "Bằng cách này hay cách khác, tôi phải kiếm một công việc mới."
                    }
                ]
            },
            {
                "define": {
                    "en": "for a reason that you do not know or understand",
                    "vi": "vì một lý do mà bạn không biết hoặc không hiểu"
                },
                "examples": [
                    {
                        "en": "Somehow, I don't feel I can trust him.",
                        "vi": "Bằng cách nào đó, tôi không cảm thấy mình có thể tin tưởng anh ấy."
                    },
                    {
                        "en": "She looked different somehow.",
                        "vi": "Bằng cách nào đó, cô ấy trông khác hẳn."
                    }
                ]
            }
        ]
    },
    {
        "id": "e9907990d4ac4f90a956caa3e6476be2",
        "word": "unconvinced",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/ˌʌnkənˈvɪnst/",
            "us": "/ˌʌnkənˈvɪnst/"
        },
        "nearby": [
            {
                "word": "unconventionality",
                "pos": "noun"
            },
            {
                "word": "unconventionally",
                "pos": "adverb"
            },
            {
                "word": "unconvinced",
                "pos": "adjective"
            },
            {
                "word": "unconvincing",
                "pos": "adjective"
            },
            {
                "word": "unconvincingly",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "not believing or not certain about something despite what you have been told",
                    "vi": "không tin hoặc không chắc chắn về điều gì đó bất chấp những gì bạn đã được nói"
                },
                "examples": [
                    {
                        "en": "unconvinced (of something) I remain unconvinced of the need for change.",
                        "vi": "không bị thuyết phục (về điều gì đó) Tôi vẫn không bị thuyết phục về nhu cầu thay đổi."
                    },
                    {
                        "en": "unconvinced (by something) She seemed unconvinced by their promises.",
                        "vi": "không bị thuyết phục (bởi điều gì đó) Cô ấy dường như không bị thuyết phục bởi những lời hứa của họ."
                    },
                    {
                        "en": "unconvinced (that…) The jury were unconvinced that he was innocent.",
                        "vi": "không thuyết phục (điều đó…) Bồi thẩm đoàn không thuyết phục rằng anh ta vô tội."
                    }
                ]
            }
        ]
    },
    {
        "id": "c8f7352afbfd461bb305ef1c65c32259",
        "word": "would",
        "pos": "modal verb",
        "level": "b2",
        "phonetic": {
            "uk": "/wʊd/",
            "us": "/wʊd/"
        },
        "nearby": [
            {
                "word": "wot",
                "pos": ""
            },
            {
                "word": "wotcha",
                "pos": "exclamation"
            },
            {
                "word": "would",
                "pos": "modal verb"
            },
            {
                "word": "would-be",
                "pos": "adjective"
            },
            {
                "word": "wound1",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "used in polite offers or invitations",
                    "vi": "được sử dụng trong lời mời hoặc lời mời lịch sự"
                },
                "examples": [
                    {
                        "en": "Would you like a sandwich?",
                        "vi": "Bạn muốn ăn sandwich không?"
                    },
                    {
                        "en": "Would you have dinner with me on Friday?",
                        "vi": "Bạn có thể ăn tối với tôi vào thứ sáu không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say what you like, love, hate, etc.",
                    "vi": "được sử dụng để nói những gì bạn thích, yêu, ghét, v.v."
                },
                "examples": [
                    {
                        "en": "would like, love, hate, prefer, etc. something I'd love a coffee.",
                        "vi": "muốn, yêu, ghét, thích, v.v. một cái gì đó tôi thích một ly cà phê."
                    },
                    {
                        "en": "would like, etc. to do something I'd be only too glad to help.",
                        "vi": "muốn, v.v. để làm điều gì đó, tôi chỉ rất vui khi được giúp đỡ."
                    },
                    {
                        "en": "would like, etc. somebody to do something I'd hate you to think I was criticizing you.",
                        "vi": "muốn, v.v. ai đó làm điều gì đó Tôi ghét bạn nghĩ rằng tôi đang chỉ trích bạn."
                    },
                    {
                        "en": "would rather do something I'd rather come with you.",
                        "vi": "thà làm điều gì đó tôi thà đi cùng bạn."
                    },
                    {
                        "en": "would rather somebody did something I'd rather you came with us.",
                        "vi": "thà ai đó đã làm điều gì đó tôi thà rằng bạn đi cùng chúng tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "used as the past form of will when reporting what somebody has said or thought",
                    "vi": "được sử dụng như một dạng ý chí trong quá khứ khi báo cáo những gì ai đó đã nói hoặc nghĩ"
                },
                "examples": [
                    {
                        "en": "He said he would be here at eight o'clock (= His words were: ‘I will be there at eight o'clock.’).",
                        "vi": "Anh ấy nói anh ấy sẽ ở đây lúc tám giờ (= Lời anh ấy nói là: 'Tôi sẽ ở đó lúc tám giờ.')."
                    },
                    {
                        "en": "She asked if I would help.",
                        "vi": "Cô ấy hỏi tôi có giúp không."
                    },
                    {
                        "en": "They told me that they probably wouldn't come.",
                        "vi": "Họ nói với tôi rằng họ có thể sẽ không đến."
                    }
                ]
            },
            {
                "define": {
                    "en": "used for talking about the result of an event that you imagine",
                    "vi": "được sử dụng để nói về kết quả của một sự kiện mà bạn tưởng tượng"
                },
                "examples": [
                    {
                        "en": "She'd look better with shorter hair.",
                        "vi": "Cô ấy sẽ trông đẹp hơn với mái tóc ngắn hơn."
                    },
                    {
                        "en": "If you went to see him, he would be delighted.",
                        "vi": "Nếu bạn đến gặp anh ấy, anh ấy sẽ rất vui."
                    },
                    {
                        "en": "Hurry up! It would be a shame to miss the beginning of the play.",
                        "vi": "Nhanh lên! Sẽ thật tiếc nếu bỏ lỡ phần đầu của vở kịch."
                    },
                    {
                        "en": "She'd be a fool to accept it (= if she accepted).",
                        "vi": "Cô ấy sẽ là một kẻ ngốc khi chấp nhận nó (= nếu cô ấy chấp nhận)."
                    }
                ]
            },
            {
                "define": {
                    "en": "used for describing a possible action or event that did not in fact happen, because something else did not happen first",
                    "vi": "được sử dụng để mô tả một hành động hoặc sự kiện có thể xảy ra mà trên thực tế không xảy ra, bởi vì điều gì đó khác đã không xảy ra trước"
                },
                "examples": [
                    {
                        "en": "If I had seen the advertisement in time, I would have applied for the job.",
                        "vi": "Nếu tôi nhìn thấy quảng cáo kịp thời, tôi đã nộp đơn xin việc."
                    },
                    {
                        "en": "They would never have met if she hadn't gone to Emma's party.",
                        "vi": "Họ sẽ không bao giờ gặp nhau nếu cô không đến bữa tiệc của Emma."
                    }
                ]
            },
            {
                "define": {
                    "en": "used for saying why somebody does something",
                    "vi": "được sử dụng để nói tại sao ai đó làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "so that somebody/something would do something She burned the letters so that her husband would never read them.",
                        "vi": "để ai đó / điều gì đó sẽ làm điều gì đó Cô ấy đốt những bức thư để chồng cô ấy sẽ không bao giờ đọc chúng."
                    },
                    {
                        "en": "in order that somebody/something would do something He worked hard in order that he would pass all his exams.",
                        "vi": "để ai đó / điều gì đó sẽ làm điều gì đó Anh ấy đã làm việc chăm chỉ để anh ấy sẽ vượt qua tất cả các kỳ thi của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "used for saying what you want to happen",
                    "vi": "được sử dụng để nói những gì bạn muốn xảy ra"
                },
                "examples": [
                    {
                        "en": "I wish that you'd be quiet for a minute.",
                        "vi": "Tôi ước rằng bạn yên lặng trong một phút."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to show that somebody/something was not willing or refused to do something",
                    "vi": "được sử dụng để cho thấy rằng ai đó / điều gì đó không sẵn lòng hoặc từ chối làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "She wouldn't change it, even though she knew it was wrong.",
                        "vi": "Cô ấy sẽ không thay đổi nó, mặc dù cô ấy biết điều đó là sai."
                    },
                    {
                        "en": "My car wouldn't start this morning.",
                        "vi": "Xe của tôi sẽ không khởi động sáng nay."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to ask somebody politely to do something",
                    "vi": "được sử dụng để yêu cầu ai đó lịch sự làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "Would you mind leaving us alone for a few minutes?",
                        "vi": "Bạn có phiền để chúng tôi một mình trong vài phút không?"
                    },
                    {
                        "en": "Would you open the door for me, please?",
                        "vi": "Làm ơn mở cửa cho tôi được không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to give opinions that you are not certain about",
                    "vi": "được sử dụng để đưa ra ý kiến mà bạn không chắc chắn về"
                },
                "examples": [
                    {
                        "en": "I would imagine the job will take about two days.",
                        "vi": "Tôi tưởng tượng công việc sẽ mất khoảng hai ngày."
                    },
                    {
                        "en": "I'd say he was about fifty.",
                        "vi": "Tôi muốn nói rằng anh ấy khoảng năm mươi."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to give advice",
                    "vi": "đã từng đưa ra lời khuyên"
                },
                "examples": [
                    {
                        "en": "I wouldn't have any more to drink, if I were you.",
                        "vi": "Tôi sẽ không uống thêm chút nào nữa, nếu tôi là bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "used for talking about things that often happened in the past",
                    "vi": "được sử dụng để nói về những điều thường xảy ra trong quá khứ"
                },
                "examples": [
                    {
                        "en": "When my parents were away, my grandmother would take care of me.",
                        "vi": "Khi bố mẹ đi vắng, bà nội sẽ chăm sóc tôi."
                    },
                    {
                        "en": "He'd always be the first to offer to help.",
                        "vi": "Anh ấy luôn là người đầu tiên đề nghị giúp đỡ."
                    }
                ]
            },
            {
                "define": {
                    "en": "used for talking about behaviour that you think is typical",
                    "vi": "được sử dụng để nói về hành vi mà bạn nghĩ là điển hình"
                },
                "examples": [
                    {
                        "en": "‘She said it was your fault.’ ‘Well, she would say that, wouldn't she? She's never liked me.’",
                        "vi": "Cô ấy nói đó là lỗi của bạn.' 'Chà, cô ấy sẽ nói như vậy, phải không? Cô ấy chưa bao giờ thích tôi. '"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to express a strong wish",
                    "vi": "được sử dụng để bày tỏ một mong muốn mạnh mẽ"
                },
                "examples": [
                    {
                        "en": "Would that he had lived to see it.",
                        "vi": "Liệu rằng anh đã sống để nhìn thấy nó."
                    }
                ]
            }
        ]
    },
    {
        "id": "f29ba95bf7f54c7c964010d713523abb",
        "word": "debatable",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/dɪˈbeɪtəbl/",
            "us": "/dɪˈbeɪtəbl/"
        },
        "nearby": [
            {
                "word": "debase",
                "pos": "verb"
            },
            {
                "word": "debasement",
                "pos": "noun"
            },
            {
                "word": "debatable",
                "pos": "adjective"
            },
            {
                "word": "debate",
                "pos": "noun"
            },
            {
                "word": "debate",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "not certain because people can have different ideas and opinions about the thing being discussed",
                    "vi": "không chắc chắn vì mọi người có thể có ý kiến và quan điểm khác nhau về vấn đề đang được thảo luận"
                },
                "examples": [
                    {
                        "en": "a debatable point",
                        "vi": "một điểm gây tranh cãi"
                    },
                    {
                        "en": "it is debatable whether… It is highly debatable whether conditions have improved for low-income families.",
                        "vi": "còn đang tranh cãi liệu… Vẫn còn nhiều tranh cãi về việc liệu điều kiện của các gia đình có thu nhập thấp đã được cải thiện hay chưa."
                    }
                ]
            }
        ]
    },
    {
        "id": "066ac991d2764e47ac3308ecc8269864",
        "word": "doubtful",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈdaʊtfl/",
            "us": "/ˈdaʊtfl/"
        },
        "nearby": [
            {
                "word": "doubt",
                "pos": "verb"
            },
            {
                "word": "doubter",
                "pos": "noun"
            },
            {
                "word": "doubtful",
                "pos": "adjective"
            },
            {
                "word": "doubtfully",
                "pos": "adverb"
            },
            {
                "word": "doubting Thomas",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "not sure; uncertain and feeling doubt",
                    "vi": "không chắc; không chắc chắn và cảm thấy nghi ngờ"
                },
                "examples": [
                    {
                        "en": "doubtful (about something) Rose was doubtful about the whole idea.",
                        "vi": "nghi ngờ (về điều gì đó) Rose đã nghi ngờ về toàn bộ ý tưởng."
                    },
                    {
                        "en": "doubtful (about doing something) He was doubtful about accepting extra work.",
                        "vi": "nghi ngờ (về việc làm gì đó) Anh ấy nghi ngờ về việc nhận làm thêm."
                    }
                ]
            },
            {
                "define": {
                    "en": "unlikely; not probable",
                    "vi": "không có khả năng xảy ra; không thể xảy ra"
                },
                "examples": [
                    {
                        "en": "doubtful (if…) It's doubtful if this painting is a Picasso.",
                        "vi": "nghi ngờ (nếu…) Thật nghi ngờ nếu bức tranh này là của Picasso."
                    },
                    {
                        "en": "doubtful (that…) With her injuries it's doubtful that she'll ever walk again.",
                        "vi": "nghi ngờ (điều đó…) Với những vết thương của cô ấy, không thể nghi ngờ rằng cô ấy sẽ đi lại được nữa."
                    },
                    {
                        "en": "doubtful (whether…) It's doubtful whether the car will last another year.",
                        "vi": "nghi ngờ (liệu…) Thật nghi ngờ liệu chiếc xe có tồn tại được một năm nữa hay không."
                    },
                    {
                        "en": "doubtful (for something) He is injured and is doubtful for the game tomorrow (= unlikely to play).",
                        "vi": "nghi ngờ (vì điều gì đó) Anh ấy bị thương và nghi ngờ cho trận đấu ngày mai (= không chắc sẽ chơi)."
                    }
                ]
            },
            {
                "define": {
                    "en": "uncertain and likely to get worse",
                    "vi": "không chắc chắn và có khả năng trở nên tồi tệ hơn"
                },
                "examples": [
                    {
                        "en": "At the beginning of the war things were looking very doubtful.",
                        "vi": "Vào đầu cuộc chiến, mọi thứ trông rất đáng ngờ."
                    }
                ]
            },
            {
                "define": {
                    "en": "of low value; probably not what somebody claims it is or of a quality that you can rely on",
                    "vi": "có giá trị thấp; có thể không phải những gì ai đó tuyên bố nó là hoặc chất lượng mà bạn có thể tin tưởng"
                },
                "examples": [
                    {
                        "en": "This wine is of doubtful quality.",
                        "vi": "Rượu này có chất lượng đáng ngờ."
                    }
                ]
            }
        ]
    },
    {
        "id": "d0806169f3f04edbb58c977ec51dd1db",
        "word": "dubious",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈdjuːbiəs/",
            "us": "/ˈduːbiəs/"
        },
        "nearby": [
            {
                "word": "dubbin",
                "pos": "noun"
            },
            {
                "word": "dubiety",
                "pos": "noun"
            },
            {
                "word": "dubious",
                "pos": "adjective"
            },
            {
                "word": "dubiously",
                "pos": "adverb"
            },
            {
                "word": "Dublin",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "not certain about something and suspecting that something may be wrong; not knowing whether something is good or bad",
                    "vi": "không chắc chắn về điều gì đó và nghi ngờ rằng điều gì đó có thể sai; không biết liệu điều gì đó là tốt hay xấu"
                },
                "examples": [
                    {
                        "en": "I was rather dubious about the whole idea.",
                        "vi": "Tôi khá nghi ngờ về toàn bộ ý tưởng."
                    },
                    {
                        "en": "Kate looked dubious, but did as she was asked.",
                        "vi": "Kate trông có vẻ nghi ngờ, nhưng đã làm theo lời cô ấy được yêu cầu."
                    }
                ]
            },
            {
                "define": {
                    "en": "probably not honest",
                    "vi": "có lẽ không trung thực"
                },
                "examples": [
                    {
                        "en": "They indulged in some highly dubious business practices to obtain their current position in the market.",
                        "vi": "Họ đã tham gia vào một số hoạt động kinh doanh đáng ngờ vực để có được vị trí hiện tại trên thị trường."
                    },
                    {
                        "en": "The man who sold it to him was known to be of dubious character.",
                        "vi": "Người đàn ông đã bán nó cho anh ta được biết đến là một nhân vật đáng ngờ."
                    }
                ]
            },
            {
                "define": {
                    "en": "that you cannot be sure about; that is probably not good",
                    "vi": "mà bạn không thể chắc chắn về; điều đó có lẽ không tốt"
                },
                "examples": [
                    {
                        "en": "They consider the plan to be of dubious benefit to most families.",
                        "vi": "Họ coi kế hoạch này mang lại lợi ích không rõ ràng cho hầu hết các gia đình."
                    },
                    {
                        "en": "(ironic) She had the dubious honour of being the last woman to be hanged in England (= it was not an honour at all).",
                        "vi": "(mỉa mai) Cô ấy có vinh dự đáng ngờ là người phụ nữ cuối cùng bị treo cổ ở Anh (= đó không phải là một vinh dự nào cả)."
                    }
                ]
            }
        ]
    },
    {
        "id": "c33722f2666f4a2687f6a9cd157c5618",
        "word": "hesitation",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌhezɪˈteɪʃn/",
            "us": "/ˌhezɪˈteɪʃn/"
        },
        "nearby": [
            {
                "word": "hesitantly",
                "pos": "adverb"
            },
            {
                "word": "hesitate",
                "pos": "verb"
            },
            {
                "word": "hesitation",
                "pos": "noun"
            },
            {
                "word": "hessian",
                "pos": "noun"
            },
            {
                "word": "Charlton Heston",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act of being slow to speak or act because you feel uncertain or nervous",
                    "vi": "hành động chậm nói hoặc hành động vì bạn cảm thấy không chắc chắn hoặc lo lắng"
                },
                "examples": [
                    {
                        "en": "She agreed without the slightest hesitation.",
                        "vi": "Cô ấy đồng ý mà không một chút do dự."
                    },
                    {
                        "en": "He spoke fluently and without unnecessary hesitations.",
                        "vi": "Anh ấy nói một cách trôi chảy và không có những do dự không cần thiết."
                    }
                ]
            },
            {
                "define": {
                    "en": "the fact of being worried about doing something, especially because you are not sure that it is right or appropriate",
                    "vi": "thực tế là lo lắng về việc làm một cái gì đó, đặc biệt là vì bạn không chắc rằng nó là đúng hoặc thích hợp"
                },
                "examples": [
                    {
                        "en": "I have no hesitation in recommending her for the job.",
                        "vi": "Tôi không ngần ngại giới thiệu cô ấy cho công việc."
                    }
                ]
            }
        ]
    },
    {
        "id": "4692124bdbe9434db3e12527def6a160",
        "word": "inconclusive",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌɪnkənˈkluːsɪv/",
            "us": "/ˌɪnkənˈkluːsɪv/"
        },
        "nearby": [
            {
                "word": "inconceivable",
                "pos": "adjective"
            },
            {
                "word": "inconceivably",
                "pos": "adverb"
            },
            {
                "word": "inconclusive",
                "pos": "adjective"
            },
            {
                "word": "inconclusively",
                "pos": "adverb"
            },
            {
                "word": "incongruity",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "not leading to a definite decision or result",
                    "vi": "không dẫn đến một quyết định hoặc kết quả chắc chắn"
                },
                "examples": [
                    {
                        "en": "inconclusive evidence/results/tests",
                        "vi": "bằng chứng / kết quả / thử nghiệm không thể kết luận"
                    },
                    {
                        "en": "inconclusive discussions",
                        "vi": "thảo luận bất phân thắng bại"
                    },
                    {
                        "en": "A coalition government was formed following an inconclusive general election.",
                        "vi": "Một chính phủ liên hiệp được thành lập sau cuộc tổng tuyển cử bất phân thắng bại."
                    },
                    {
                        "en": "The volume ends on a somewhat inconclusive note.",
                        "vi": "Âm lượng kết thúc trên một lưu ý hơi khó thuyết phục."
                    },
                    {
                        "en": "the curiously inconclusive finish to the symphony",
                        "vi": "kết thúc tò mò không thể thuyết phục cho bản giao hưởng"
                    }
                ]
            }
        ]
    },
    {
        "id": "d4f1870c6d574cecb6650a47bbc1b28a",
        "word": "it’s just/only a matter of time (before…)",
        "pos": "idiom",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈmætə(r)/",
            "us": "/ˈmætər/"
        },
        "nearby": [
            {
                "word": "Matt",
                "pos": ""
            },
            {
                "word": "matted",
                "pos": "adjective"
            },
            {
                "word": "matter",
                "pos": "noun"
            },
            {
                "word": "matter",
                "pos": "verb"
            },
            {
                "word": "matter-of-fact",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "used (to ask) if somebody is upset, unhappy, etc. or if there is a problem",
                    "vi": "được sử dụng (để hỏi) nếu ai đó đang buồn, không vui, v.v. hoặc nếu có vấn đề"
                },
                "examples": [
                    {
                        "en": "What's the matter? Is there something wrong?",
                        "vi": "Có chuyện gì vậy? Có điều gì sai không?"
                    },
                    {
                        "en": "Is anything the matter?",
                        "vi": "Có vấn đề gì không?"
                    },
                    {
                        "en": "matter with somebody/something Is something the matter with Bob? He seems very down.",
                        "vi": "vấn đề với ai đó / cái gì đó Có vấn đề gì với Bob không? Anh ấy có vẻ rất xuống tinh thần."
                    },
                    {
                        "en": "There's something the matter with my eyes.",
                        "vi": "Có vấn đề gì đó với mắt tôi."
                    },
                    {
                        "en": "‘We've bought a new TV.’ ‘What was the matter with the old one?’",
                        "vi": "Chúng tôi đã mua một chiếc TV mới.' 'Chuyện cũ là gì vậy?'"
                    },
                    {
                        "en": "What's the matter with you today (= why are you behaving like this)?",
                        "vi": "Có chuyện gì với bạn hôm nay (= tại sao bạn lại cư xử như thế này)?"
                    },
                    {
                        "en": "What on earth was the matter with her, she wondered. She’d come here to enjoy herself and here she was, stuck on her own in the hotel.",
                        "vi": "Cô tự hỏi chuyện quái quỷ gì với cô ấy. Cô ấy đến đây để tận hưởng bản thân và ở đây, cô ấy đã bị mắc kẹt một mình trong khách sạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a subject or situation that you must consider or deal with",
                    "vi": "một chủ đề hoặc tình huống mà bạn phải xem xét hoặc giải quyết"
                },
                "examples": [
                    {
                        "en": "It's a private matter.",
                        "vi": "Đó là một vấn đề riêng tư."
                    },
                    {
                        "en": "They had important matters to discuss.",
                        "vi": "Họ có những vấn đề quan trọng cần thảo luận."
                    },
                    {
                        "en": "She may need your help with some business matters.",
                        "vi": "Cô ấy có thể cần bạn giúp đỡ trong một số vấn đề kinh doanh."
                    },
                    {
                        "en": "financial/legal/political matters",
                        "vi": "các vấn đề tài chính / pháp lý / chính trị"
                    },
                    {
                        "en": "They've agreed in theory, but now we need to discuss practical matters.",
                        "vi": "Họ đã đồng ý về mặt lý thuyết, nhưng bây giờ chúng ta cần thảo luận về các vấn đề thực tế."
                    },
                    {
                        "en": "The matter should be referred to a senior manager.",
                        "vi": "Vấn đề nên được chuyển đến một quản lý cấp cao."
                    },
                    {
                        "en": "Do I have any choice in the matter?",
                        "vi": "Tôi có lựa chọn nào trong vấn đề này không?"
                    },
                    {
                        "en": "I always consulted him on matters of policy.",
                        "vi": "Tôi luôn hỏi ý kiến anh ấy về các vấn đề chính sách."
                    },
                    {
                        "en": "matter for somebody It's a matter for the police (= for them to deal with).",
                        "vi": "vấn đề đối với ai Đó là vấn đề đối với cảnh sát (= để họ giải quyết)."
                    },
                    {
                        "en": "matter of something (formal) It was a matter of some concern to most of those present (= something they were worried about).",
                        "vi": "vấn đề của một cái gì đó (trang trọng) Đó là một vấn đề đáng quan tâm đối với hầu hết những người có mặt (= một cái gì đó họ lo lắng về)."
                    },
                    {
                        "en": "It should have been a simple matter to check.",
                        "vi": "Nó đáng lẽ phải là một vấn đề đơn giản để kiểm tra."
                    },
                    {
                        "en": "It was no easy matter getting him to change his mind.",
                        "vi": "Không dễ gì bắt anh ta thay đổi ý định."
                    },
                    {
                        "en": "Let's get on with the matter in hand (= what we need to deal with now).",
                        "vi": "Hãy tiếp tục vấn đề trong tay (= những gì chúng ta cần giải quyết bây giờ)."
                    },
                    {
                        "en": "I wasn't prepared to let the matter drop (= stop discussing it).",
                        "vi": "Tôi đã không chuẩn bị để bỏ qua vấn đề (= ngừng thảo luận về nó)."
                    },
                    {
                        "en": "We have sent these concerns to Professor Tribe, and now consider the matter closed (= it is finished).",
                        "vi": "Chúng tôi đã gửi những lo ngại này đến Giáo sư Tribe và bây giờ coi như vấn đề đã kết thúc (= nó đã kết thúc)."
                    },
                    {
                        "en": "I did not feel that we had got to the heart of the matter (= the most important part).",
                        "vi": "Tôi không cảm thấy rằng chúng tôi đã đi vào trọng tâm của vấn đề (= phần quan trọng nhất)."
                    },
                    {
                        "en": "And that is the crux of the matter (= the most important thing about the situation).",
                        "vi": "Và đó là mấu chốt của vấn đề (= điều quan trọng nhất của tình hình)."
                    },
                    {
                        "en": "(ironic) And then there's the little matter of the fifty pounds you owe me.",
                        "vi": "(mỉa mai) Và sau đó, vấn đề nhỏ là năm mươi bảng Anh nợ tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "the present situation, or the situation that you are talking about",
                    "vi": "tình huống hiện tại hoặc tình huống mà bạn đang nói về"
                },
                "examples": [
                    {
                        "en": "Unfortunately, there is nothing we can do to improve matters.",
                        "vi": "Thật không may, chúng tôi không thể làm gì để cải thiện vấn đề."
                    },
                    {
                        "en": "I'd forgotten the keys, which didn't help matters.",
                        "vi": "Tôi đã quên chìa khóa, điều này không giúp ích được gì."
                    },
                    {
                        "en": "And then, to make matters worse, his parents turned up.",
                        "vi": "Và sau đó, để làm cho vấn đề tồi tệ hơn, cha mẹ anh ta đã từ chối."
                    },
                    {
                        "en": "I decided to take matters into my own hands (= deal with the situation myself).",
                        "vi": "Tôi quyết định tự mình giải quyết vấn đề (= tự mình giải quyết tình huống)."
                    },
                    {
                        "en": "Matters came to a head (= the situation became very difficult) with his resignation.",
                        "vi": "Các vấn đề nảy sinh (= tình hình trở nên rất khó khăn) với sự từ chức của anh ta."
                    }
                ]
            },
            {
                "define": {
                    "en": "a situation that involves something or depends on something",
                    "vi": "một tình huống liên quan đến một cái gì đó hoặc phụ thuộc vào một cái gì đó"
                },
                "examples": [
                    {
                        "en": "matter of something Learning to drive is all a matter of coordination.",
                        "vi": "vấn đề gì đó Học cách lái xe là tất cả vấn đề của sự phối hợp."
                    },
                    {
                        "en": "Some people prefer the older version to the new one. It's a matter of taste.",
                        "vi": "Một số người thích phiên bản cũ hơn phiên bản mới. Đó là một vấn đề của hương vị."
                    },
                    {
                        "en": "She resigned over a matter of principle.",
                        "vi": "Cô ấy đã từ chức vì một vấn đề nguyên tắc."
                    },
                    {
                        "en": "The government must deal with this as a matter of urgency.",
                        "vi": "Chính phủ phải giải quyết vấn đề này như một vấn đề cấp bách."
                    },
                    {
                        "en": "Just as a matter of interest (= because it is interesting, not because it is important), how much did you pay for it?",
                        "vi": "Cũng giống như vấn đề quan tâm (= vì nó thú vị, không phải vì nó quan trọng), bạn đã trả bao nhiêu cho nó?"
                    },
                    {
                        "en": "‘I think this is the best so far.’ ‘Well, that's a matter of opinion (= other people may think differently).’",
                        "vi": "Tôi nghĩ đây là điều tốt nhất cho đến nay.' 'Chà, đó là vấn đề của ý kiến (= người khác có thể nghĩ khác).'"
                    },
                    {
                        "en": "It's not pure fantasy ! It's a plain matter of fact.",
                        "vi": "Đó không phải là tưởng tượng thuần túy! Đó là một vấn đề đơn giản của thực tế."
                    },
                    {
                        "en": "Getting the effect you want is a matter of trial and error.",
                        "vi": "Để có được hiệu quả bạn muốn là một vấn đề của thử và sai."
                    },
                    {
                        "en": "matter of doing something That's not a problem. It's simply a matter of letting people know in time.",
                        "vi": "vấn đề của việc làm một cái gì đó Đó không phải là một vấn đề. Nó chỉ đơn giản là vấn đề để mọi người biết kịp thời."
                    },
                    {
                        "en": "Planning a project is just a matter of working out the right order to do things in.",
                        "vi": "Lập kế hoạch cho một dự án chỉ là vấn đề tìm ra thứ tự phù hợp để thực hiện các công việc."
                    }
                ]
            },
            {
                "define": {
                    "en": "physical substance that everything in the world is made of; not mind or spirit",
                    "vi": "chất vật chất mà mọi thứ trên thế giới đều được tạo ra; không phải tâm trí hay tinh thần"
                },
                "examples": [
                    {
                        "en": "to study the properties of matter",
                        "vi": "để nghiên cứu các thuộc tính của vật chất"
                    },
                    {
                        "en": "This swirling mass of energy and matter is classed as a spiral galaxy.",
                        "vi": "Khối năng lượng và vật chất xoáy này được xếp vào loại thiên hà xoắn ốc."
                    }
                ]
            },
            {
                "define": {
                    "en": "a substance or things of a particular sort",
                    "vi": "một chất hoặc những thứ thuộc một loại cụ thể"
                },
                "examples": [
                    {
                        "en": "Add plenty of organic matter to improve the soil.",
                        "vi": "Bổ sung nhiều chất hữu cơ để cải tạo đất."
                    },
                    {
                        "en": "elimination of waste matter from the body",
                        "vi": "loại bỏ chất thải ra khỏi cơ thể"
                    },
                    {
                        "en": "She didn't approve of their choice of reading matter.",
                        "vi": "Cô ấy không tán thành sự lựa chọn của họ về vấn đề đọc."
                    },
                    {
                        "en": "There were small lumps of matter floating on the surface.",
                        "vi": "Có những cục vật chất nhỏ nổi trên bề mặt."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to add a comment on something that you have just said, usually adding something that you think the other person will be interested in",
                    "vi": "được sử dụng để thêm nhận xét về điều gì đó bạn vừa nói, thường là thêm điều gì đó mà bạn nghĩ rằng người kia sẽ quan tâm"
                },
                "examples": [
                    {
                        "en": "It's a nice place. We've stayed there ourselves, as a matter of fact.",
                        "vi": "Đó là một nơi tốt đẹp. Thực tế là chúng tôi đã ở lại đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to disagree with something that somebody has just said",
                    "vi": "từng không đồng ý với điều gì đó mà ai đó vừa nói"
                },
                "examples": [
                    {
                        "en": "‘I suppose you'll be leaving soon, then?’ ‘No, as a matter of fact I'll be staying for another two years.’",
                        "vi": "Tôi cho rằng bạn sẽ sớm rời đi, sau đó?' \"Không, thực tế là tôi sẽ ở lại thêm hai năm nữa.\""
                    }
                ]
            },
            {
                "define": {
                    "en": "to be very different",
                    "vi": "trở nên rất khác biệt"
                },
                "examples": [
                    {
                        "en": "I know which area they live in, but whether I can find their house is a different matter.",
                        "vi": "Tôi biết họ sống ở khu vực nào, nhưng liệu tôi có thể tìm thấy nhà của họ hay không lại là chuyện khác."
                    },
                    {
                        "en": "That's a whole different matter.",
                        "vi": "Đó là một vấn đề hoàn toàn khác."
                    },
                    {
                        "en": "I don't mind lizards, but snakes are a different matter.",
                        "vi": "Tôi không bận tâm đến thằn lằn, nhưng rắn là một vấn đề khác."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be something serious that you should not joke about",
                    "vi": "trở thành một cái gì đó nghiêm trọng mà bạn không nên nói đùa"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to emphasize a statement, especially one that is the opposite of what has just been mentioned",
                    "vi": "được sử dụng để nhấn mạnh một tuyên bố, đặc biệt là một câu đối lập với những gì vừa được đề cập"
                },
                "examples": [
                    {
                        "en": "A new car would be wonderful but the fact of the matter is that we can't afford one.",
                        "vi": "Một chiếc ô tô mới sẽ thật tuyệt vời nhưng thực tế của vấn đề là chúng ta không thể mua được một chiếc."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to add a comment on something that you have just said",
                    "vi": "được sử dụng để thêm nhận xét về điều gì đó mà bạn vừa nói"
                },
                "examples": [
                    {
                        "en": "I didn't like it much. Nor did the kids, for that matter.",
                        "vi": "Tôi không thích nó nhiều. Những đứa trẻ cũng vậy, vì vấn đề đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that something will definitely happen, although you are not sure when",
                    "vi": "được sử dụng để nói rằng điều gì đó chắc chắn sẽ xảy ra, mặc dù bạn không chắc khi nào"
                },
                "examples": [
                    {
                        "en": "It's only a matter of time before they bring out their own version of the software.",
                        "vi": "Chỉ còn là vấn đề thời gian trước khi họ đưa ra phiên bản phần mềm của riêng mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "(as) the usual and correct thing to do",
                    "vi": "(như) điều bình thường và đúng đắn cần làm"
                },
                "examples": [
                    {
                        "en": "We always check people's addresses as a matter of course.",
                        "vi": "Chúng tôi luôn kiểm tra địa chỉ của mọi người như một điều tất nhiên."
                    }
                ]
            },
            {
                "define": {
                    "en": "only a few hours, minutes, etc.",
                    "vi": "chỉ vài giờ, vài phút, v.v."
                },
                "examples": [
                    {
                        "en": "It was all over in a matter of minutes.",
                        "vi": "Tất cả đã kết thúc trong vài phút."
                    },
                    {
                        "en": "The bullet missed her by a matter of inches.",
                        "vi": "Viên đạn đã bắn trượt cô ấy trong gang tấc."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to describe a situation that is very important or serious",
                    "vi": "được sử dụng để mô tả một tình huống rất quan trọng hoặc nghiêm trọng"
                },
                "examples": [
                    {
                        "en": "You mustn't let anyone know— it's a matter of life and death.",
                        "vi": "Bạn không được để bất kỳ ai biết - đó là vấn đề sống chết."
                    },
                    {
                        "en": "These talks are a matter of life or death for the factory.",
                        "vi": "Những cuộc đàm phán này là vấn đề sống chết của nhà máy."
                    }
                ]
            },
            {
                "define": {
                    "en": "something that has been recorded as being true",
                    "vi": "một cái gì đó đã được ghi lại là sự thật"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to say that something is not important",
                    "vi": "được sử dụng để nói rằng một cái gì đó không quan trọng"
                },
                "examples": [
                    {
                        "en": "If that doesn't work out, no matter, I'll rent for another year or two.",
                        "vi": "Nếu không được, tôi sẽ thuê thêm một hoặc hai năm nữa."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that something is always true, whatever the situation is, or that somebody should certainly do something",
                    "vi": "được sử dụng để nói rằng điều gì đó luôn đúng, bất kể tình huống là gì, hoặc ai đó chắc chắn nên làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "They don't last long no matter how careful you are.",
                        "vi": "Chúng không tồn tại lâu cho dù bạn có cẩn thận đến đâu."
                    },
                    {
                        "en": "Call me when you get there, no matter what the time is.",
                        "vi": "Hãy gọi cho tôi khi bạn đến đó, bất kể thời gian là bao nhiêu."
                    }
                ]
            }
        ]
    },
    {
        "id": "38c22c85fcba47309f8c171f5355c198",
        "word": "or what",
        "pos": "idiom",
        "level": "c1",
        "phonetic": {
            "uk": "/wɒt/",
            "us": "/wʌt/"
        },
        "nearby": [
            {
                "word": "Edith Wharton",
                "pos": ""
            },
            {
                "word": "whassup",
                "pos": "exclamation"
            },
            {
                "word": "what",
                "pos": "pronoun, determiner"
            },
            {
                "word": "whatchamacallit",
                "pos": "noun"
            },
            {
                "word": "whatev",
                "pos": "exclamation, adverb, pronoun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "used in questions to ask for particular information about somebody/something",
                    "vi": "được sử dụng trong các câu hỏi để hỏi thông tin cụ thể về ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "What is your name?",
                        "vi": "Tên của bạn là gì?"
                    },
                    {
                        "en": "What (= what job) does he do?",
                        "vi": "Anh ấy làm gì (= công việc gì)?"
                    },
                    {
                        "en": "What time is it?",
                        "vi": "Mấy giờ rồi?"
                    },
                    {
                        "en": "What kind of music do you like?",
                        "vi": "Bạn thích thể loại nhạc nào?"
                    }
                ]
            },
            {
                "define": {
                    "en": "the thing or things that; whatever",
                    "vi": "điều hoặc những thứ mà; sao cũng được"
                },
                "examples": [
                    {
                        "en": "What you need is a good meal.",
                        "vi": "Những gì bạn cần là một bữa ăn ngon."
                    },
                    {
                        "en": "Nobody knows what will happen next.",
                        "vi": "Không ai biết điều gì sẽ xảy ra tiếp theo."
                    },
                    {
                        "en": "I spent what little time I had with my family.",
                        "vi": "Tôi đã dành những khoảng thời gian ít ỏi mà tôi có cho gia đình."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that you think that something is especially good, bad, etc.",
                    "vi": "được sử dụng để nói rằng bạn nghĩ rằng một cái gì đó đặc biệt tốt, xấu, v.v."
                },
                "examples": [
                    {
                        "en": "What awful weather!",
                        "vi": "Thời tiết thật tồi tệ!"
                    },
                    {
                        "en": "What a beautiful house!",
                        "vi": "Thật là một ngôi nhà đẹp!"
                    }
                ]
            },
            {
                "define": {
                    "en": "and other things of the same type",
                    "vi": "và những thứ khác cùng loại"
                },
                "examples": [
                    {
                        "en": "It's full of old toys, books and what not.",
                        "vi": "Nó chứa đầy đồ chơi cũ, sách và những thứ không có."
                    }
                ]
            },
            {
                "define": {
                    "en": "despite any problems or difficulties you may have",
                    "vi": "bất chấp bất kỳ vấn đề hoặc khó khăn nào bạn có thể gặp phải"
                },
                "examples": [
                    {
                        "en": "He promised to support her come what may.",
                        "vi": "Anh ấy hứa sẽ hỗ trợ cô ấy nếu có thể."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be punished/punish somebody severely",
                    "vi": "bị trừng phạt / trừng phạt ai đó nghiêm khắc"
                },
                "examples": [
                    {
                        "en": "I'll give her what for if she does that again.",
                        "vi": "Tôi sẽ cho cô ấy những gì để làm nếu cô ấy làm điều đó một lần nữa."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to emphasize your opinion",
                    "vi": "được sử dụng để nhấn mạnh ý kiến của bạn"
                },
                "examples": [
                    {
                        "en": "Is he stupid or what?",
                        "vi": "Anh ta ngốc hay sao?"
                    }
                ]
            },
            {
                "define": {
                    "en": "used when you are not sure about something",
                    "vi": "được sử dụng khi bạn không chắc chắn về điều gì đó"
                },
                "examples": [
                    {
                        "en": "I don't know if he's a teacher or what.",
                        "vi": "Tôi không biết anh ấy có phải là giáo viên hay không."
                    },
                    {
                        "en": "Are we going now or what?",
                        "vi": "Bây giờ chúng ta đi hay sao?"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to express surprise at what somebody has just said",
                    "vi": "được sử dụng để bày tỏ sự ngạc nhiên về những gì ai đó vừa nói"
                },
                "examples": [
                    {
                        "en": "‘He's getting married.’ ‘Say what?’",
                        "vi": "Anh ấy sắp kết hôn.' 'Nói gì cơ?'"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to show that you think something is not important, especially after somebody has criticized you for it",
                    "vi": "được sử dụng để cho thấy rằng bạn nghĩ điều gì đó không quan trọng, đặc biệt là sau khi ai đó đã chỉ trích bạn về điều đó"
                },
                "examples": [
                    {
                        "en": "‘He's fifteen years younger than you!’ ‘So what?’",
                        "vi": "Anh ấy trẻ hơn bạn mười lăm tuổi!' 'Vậy thì sao?'"
                    },
                    {
                        "en": "So what if nobody else agrees with me?",
                        "vi": "Vậy nếu không ai khác đồng ý với tôi thì sao?"
                    }
                ]
            },
            {
                "define": {
                    "en": "used when you have not heard or have not understood something",
                    "vi": "được sử dụng khi bạn chưa nghe hoặc chưa hiểu điều gì đó"
                },
                "examples": [
                    {
                        "en": "What? I can't hear you.",
                        "vi": "Gì? Tôi không thể nghe thấy bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to show that you have heard somebody and to ask what they want",
                    "vi": "được sử dụng để cho thấy rằng bạn đã nghe ai đó và hỏi họ muốn gì"
                },
                "examples": [
                    {
                        "en": "‘Mummy!’ ‘What?’ ‘I'm thirsty.’",
                        "vi": "Xác ướp!' 'Gì?' 'Tôi khát nước.'"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to express surprise or anger",
                    "vi": "được sử dụng để bày tỏ sự ngạc nhiên hoặc tức giận"
                },
                "examples": [
                    {
                        "en": "‘It will cost $500.’ ‘What?’",
                        "vi": "Nó sẽ có giá 500 đô la.' 'Gì?'"
                    },
                    {
                        "en": "‘I asked her to marry me.’ ‘You what?’",
                        "vi": "Tôi đã yêu cầu cô ấy kết hôn với tôi.' 'Bạn là gì?'"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to make a suggestion",
                    "vi": "được sử dụng để đưa ra một đề xuất"
                },
                "examples": [
                    {
                        "en": "What about a trip to France?",
                        "vi": "Còn về một chuyến đi đến Pháp?"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to introduce somebody/something into the conversation",
                    "vi": "được sử dụng để giới thiệu ai đó / điều gì đó vào cuộc trò chuyện"
                },
                "examples": [
                    {
                        "en": "What about you, Joe? Do you like football?",
                        "vi": "Còn bạn thì sao, Joe? Bạn có thích bóng đá không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "used instead of a name that you cannot remember",
                    "vi": "được sử dụng thay cho một cái tên mà bạn không thể nhớ"
                },
                "examples": [
                    {
                        "en": "She's just gone out with old what-d'you-call-him.",
                        "vi": "Cô ấy vừa đi chơi với cái-bạn-gọi-là-anh ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "for what purpose or reason?",
                    "vi": "cho mục đích hay lý do gì?"
                },
                "examples": [
                    {
                        "en": "What is this tool for?",
                        "vi": "Công cụ này để làm gì?"
                    },
                    {
                        "en": "What did you do that for (= why did you do that)?",
                        "vi": "Bạn đã làm điều đó để làm gì (= tại sao bạn làm điều đó)?"
                    },
                    {
                        "en": "‘I need to see a doctor.’ ‘What for?’",
                        "vi": "Tôi cần gặp bác sĩ.' 'Để làm gì?'"
                    }
                ]
            },
            {
                "define": {
                    "en": "what would happen if?",
                    "vi": "điều gì sẽ xảy ra nếu?"
                },
                "examples": [
                    {
                        "en": "What if the train is late?",
                        "vi": "Nếu tàu bị trễ thì sao?"
                    },
                    {
                        "en": "What if she forgets to bring it?",
                        "vi": "Nếu cô ấy quên mang nó thì sao?"
                    }
                ]
            },
            {
                "define": {
                    "en": "used when admitting that something is true, to ask why it should be considered important",
                    "vi": "được sử dụng khi thừa nhận điều gì đó là đúng, để hỏi tại sao điều đó nên được coi là quan trọng"
                },
                "examples": [
                    {
                        "en": "Yes, I wrote the article. What of it?",
                        "vi": "Vâng, tôi đã viết bài báo. Của nó là gì?"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to suggest that something you have heard is a stupid idea or does not make sense",
                    "vi": "được sử dụng để gợi ý rằng điều gì đó bạn đã nghe là một ý tưởng ngu ngốc hoặc không có ý nghĩa"
                },
                "examples": [
                    {
                        "en": "They dropped their best player. What's all that about?",
                        "vi": "Họ đã đánh rơi cầu thủ xuất sắc nhất của mình. Tất cả những điều đó về cái gì?"
                    }
                ]
            },
            {
                "define": {
                    "en": "(know) what things are useful, important, etc.",
                    "vi": "(biết) những thứ nào hữu ích, quan trọng, v.v."
                },
                "examples": [
                    {
                        "en": "She certainly knows what's what.",
                        "vi": "Cô ấy chắc chắn biết những gì là gì."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to ask why somebody is behaving in a strange way",
                    "vi": "đã từng hỏi tại sao ai đó lại cư xử theo một cách kỳ lạ"
                },
                "examples": [
                    {
                        "en": "What's with you? You haven't said a word all morning.",
                        "vi": "Có gì với bạn? Bạn đã không nói một lời nào cả buổi sáng."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to ask the reason for something",
                    "vi": "được sử dụng để hỏi lý do cho một cái gì đó"
                },
                "examples": [
                    {
                        "en": "What's with all this walking? Can't we take a cab?",
                        "vi": "Điều gì với tất cả những gì đi bộ này? Chúng ta không thể bắt taxi?"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to list the various reasons for something",
                    "vi": "được sử dụng để liệt kê các lý do khác nhau cho một cái gì đó"
                },
                "examples": [
                    {
                        "en": "What with the cold weather and my bad leg, I haven't been out for weeks.",
                        "vi": "Trời lạnh và cái chân xấu của tôi thì sao, tôi đã không đi ngoài nhiều tuần rồi."
                    }
                ]
            }
        ]
    },
    {
        "id": "37c79015d7b84fa7ab5344004677cf4e",
        "word": "supposedly",
        "pos": "adverb",
        "level": "c1",
        "phonetic": {
            "uk": "/səˈpəʊzɪdli/",
            "us": "/səˈpəʊzɪdli/"
        },
        "nearby": [
            {
                "word": "suppose",
                "pos": "verb"
            },
            {
                "word": "supposed",
                "pos": "adjective"
            },
            {
                "word": "supposedly",
                "pos": "adverb"
            },
            {
                "word": "supposing",
                "pos": "conjunction"
            },
            {
                "word": "supposition",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "according to what is generally thought or believed but not known for certain",
                    "vi": "theo những gì thường được nghĩ hoặc tin nhưng không được biết chắc chắn"
                },
                "examples": [
                    {
                        "en": "The novel is supposedly based on a true story.",
                        "vi": "Cuốn tiểu thuyết được cho là dựa trên một câu chuyện có thật."
                    },
                    {
                        "en": "a poem supposedly written by Shakespeare",
                        "vi": "một bài thơ được cho là do Shakespeare viết"
                    },
                    {
                        "en": "Police have found the supposedly stolen car.",
                        "vi": "Cảnh sát đã tìm thấy chiếc xe được cho là bị đánh cắp."
                    }
                ]
            }
        ]
    },
    {
        "id": "a9dd949b626940cfbd76a5ad11a3085c",
        "word": "tentative",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈtentətɪv/",
            "us": "/ˈtentətɪv/"
        },
        "nearby": [
            {
                "word": "tent",
                "pos": "noun"
            },
            {
                "word": "tentacle",
                "pos": "noun"
            },
            {
                "word": "tentative",
                "pos": "adjective"
            },
            {
                "word": "tentatively",
                "pos": "adverb"
            },
            {
                "word": "tentativeness",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "not definite or certain because you may want to change it later",
                    "vi": "không xác định hoặc chắc chắn vì bạn có thể muốn thay đổi nó sau"
                },
                "examples": [
                    {
                        "en": "We made a tentative arrangement to meet on Friday.",
                        "vi": "Chúng tôi đã sắp xếp dự kiến để gặp nhau vào thứ Sáu."
                    },
                    {
                        "en": "tentative conclusions",
                        "vi": "kết luận dự kiến"
                    }
                ]
            },
            {
                "define": {
                    "en": "not behaving or done with confidence",
                    "vi": "không cư xử hoặc thực hiện một cách tự tin"
                },
                "examples": [
                    {
                        "en": "a tentative greeting",
                        "vi": "một lời chào thăm dò"
                    },
                    {
                        "en": "Her English is correct but tentative.",
                        "vi": "Tiếng Anh của cô ấy là chính xác nhưng không nhiều."
                    },
                    {
                        "en": "I'm taking the first tentative steps towards fitness.",
                        "vi": "Tôi đang thực hiện những bước dự kiến đầu tiên về thể dục."
                    }
                ]
            }
        ]
    },
    {
        "id": "62e150f66ae94ac49a75010bf163dcf4",
        "word": "tentatively",
        "pos": "adverb",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈtentətɪvli/",
            "us": "/ˈtentətɪvli/"
        },
        "nearby": [
            {
                "word": "tentacle",
                "pos": "noun"
            },
            {
                "word": "tentative",
                "pos": "adjective"
            },
            {
                "word": "tentatively",
                "pos": "adverb"
            },
            {
                "word": "tentativeness",
                "pos": "noun"
            },
            {
                "word": "tented",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "in a way that is not definite or certain because you may want to change it later",
                    "vi": "theo một cách không xác định hoặc chắc chắn vì bạn có thể muốn thay đổi nó sau này"
                },
                "examples": [
                    {
                        "en": "They have tentatively agreed to our proposal.",
                        "vi": "Họ đã tạm thời đồng ý với đề xuất của chúng tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "in a way that is not done with confidence",
                    "vi": "theo một cách không được thực hiện một cách tự tin"
                },
                "examples": [
                    {
                        "en": "She smiled tentatively.",
                        "vi": "Cô mỉm cười ngập ngừng."
                    }
                ]
            }
        ]
    },
    {
        "id": "4d595f44a19848e8a6b2ca2877079a95",
        "word": "there is/was no question of something happening/of somebody doing something",
        "pos": "idiom",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈkwestʃən/",
            "us": "/ˈkwestʃən/"
        },
        "nearby": [
            {
                "word": "quest",
                "pos": "noun"
            },
            {
                "word": "quest",
                "pos": "verb"
            },
            {
                "word": "question",
                "pos": "noun"
            },
            {
                "word": "question",
                "pos": "verb"
            },
            {
                "word": "questionable",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a sentence, phrase or word that asks for information",
                    "vi": "một câu, cụm từ hoặc từ yêu cầu thông tin"
                },
                "examples": [
                    {
                        "en": "You didn't answer my question.",
                        "vi": "Bạn đã không trả lời câu hỏi của tôi."
                    },
                    {
                        "en": "You will have the opportunity to ask questions.",
                        "vi": "Bạn sẽ có cơ hội để đặt câu hỏi."
                    },
                    {
                        "en": "Does anyone have any questions?",
                        "vi": "người nào nữa có câu hỏi khác không?"
                    },
                    {
                        "en": "(formal) I would now like to pose two questions:…",
                        "vi": "(chính thức) Bây giờ tôi muốn đặt ra hai câu hỏi:…"
                    },
                    {
                        "en": "That's a very interesting question.",
                        "vi": "Đó là một câu hỏi rất thú vị."
                    },
                    {
                        "en": "The question is, how much are they going to pay you?",
                        "vi": "Câu hỏi đặt ra là họ sẽ trả cho bạn bao nhiêu?"
                    },
                    {
                        "en": "The big question is, why did they do it?",
                        "vi": "Câu hỏi lớn là, tại sao họ làm điều đó?"
                    },
                    {
                        "en": "(formal) The question arises as to whether or not he knew of the situation.",
                        "vi": "(chính thức) Câu hỏi đặt ra là liệu anh ta có biết về tình huống này hay không."
                    },
                    {
                        "en": "question of something The key question of what caused the leak remains unanswered.",
                        "vi": "câu hỏi về điều gì đó Câu hỏi quan trọng về điều gì đã gây ra vụ rò rỉ vẫn chưa được trả lời."
                    },
                    {
                        "en": "question about something Can I ask you a question about your first novel?",
                        "vi": "câu hỏi về điều gì đó Tôi có thể hỏi bạn một câu hỏi về cuốn tiểu thuyết đầu tiên của bạn được không?"
                    },
                    {
                        "en": "(formal) He put a question to the minister about the recent reforms.",
                        "vi": "(chính thức) Ông đặt câu hỏi với Bộ trưởng về những cải cách gần đây."
                    },
                    {
                        "en": "I hope the police don't ask any awkward questions.",
                        "vi": "Tôi hy vọng cảnh sát không hỏi bất kỳ câu hỏi khó xử nào."
                    },
                    {
                        "en": "This is a difficult question to answer.",
                        "vi": "Đây là một câu hỏi khó trả lời."
                    },
                    {
                        "en": "The short answer to your question is yes.",
                        "vi": "Câu trả lời ngắn gọn cho câu hỏi của bạn là có."
                    },
                    {
                        "en": "The government doesn’t have the answers to these difficult questions.",
                        "vi": "Chính phủ không có câu trả lời cho những câu hỏi khó này."
                    },
                    {
                        "en": "In an interview try to ask open questions that don't just need ‘Yes’ or ‘No’ as an answer.",
                        "vi": "Trong một cuộc phỏng vấn, hãy cố gắng đặt những câu hỏi mở không chỉ cần câu trả lời là 'Có' hoặc 'Không'."
                    },
                    {
                        "en": "I paid cash, no questions asked.",
                        "vi": "Tôi đã trả tiền mặt, không có câu hỏi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a task or request for information that is intended to test your knowledge or understanding, for example in an exam or a competition",
                    "vi": "một nhiệm vụ hoặc yêu cầu thông tin nhằm mục đích kiểm tra kiến thức hoặc hiểu biết của bạn, chẳng hạn như trong một kỳ thi hoặc một cuộc thi"
                },
                "examples": [
                    {
                        "en": "Question 3 was very difficult.",
                        "vi": "Câu hỏi 3 rất khó."
                    },
                    {
                        "en": "I couldn't do Question 6.",
                        "vi": "Tôi không làm được Câu hỏi 6."
                    },
                    {
                        "en": "You must answer all ten questions.",
                        "vi": "Bạn phải trả lời tất cả mười câu hỏi."
                    },
                    {
                        "en": "question on something In the exam there's sure to be a question on energy.",
                        "vi": "câu hỏi về điều gì đó Trong kỳ thi chắc chắn có một câu hỏi về năng lượng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a matter or topic that needs to be discussed or dealt with",
                    "vi": "một vấn đề hoặc chủ đề cần được thảo luận hoặc xử lý"
                },
                "examples": [
                    {
                        "en": "This is an issue that raises many important questions.",
                        "vi": "Đây là một vấn đề đặt ra nhiều câu hỏi quan trọng."
                    },
                    {
                        "en": "question of something Let's look at the question of security.",
                        "vi": "câu hỏi về điều gì đó Hãy xem xét câu hỏi về bảo mật."
                    },
                    {
                        "en": "Finally we shall deal with the question of cost.",
                        "vi": "Cuối cùng, chúng ta sẽ giải quyết câu hỏi về chi phí."
                    },
                    {
                        "en": "The question that needs to be addressed is one of funding.",
                        "vi": "Câu hỏi cần được giải quyết là một trong những vấn đề kinh phí."
                    },
                    {
                        "en": "question about something Questions remain about how she was appointed.",
                        "vi": "câu hỏi về điều gì đó Câu hỏi vẫn còn về cách cô ấy được bổ nhiệm."
                    },
                    {
                        "en": "The case raises serious questions about the company's conduct.",
                        "vi": "Vụ việc đặt ra câu hỏi nghiêm trọng về hành vi của công ty."
                    },
                    {
                        "en": "Which route is better remains an open question (= it is not decided).",
                        "vi": "Con đường nào tốt hơn vẫn còn là một câu hỏi mở (= nó chưa được quyết định)."
                    },
                    {
                        "en": "The film doesn't answer all the questions it raises.",
                        "vi": "Bộ phim không trả lời tất cả các câu hỏi mà nó đặt ra."
                    },
                    {
                        "en": "The research is asking the wrong questions.",
                        "vi": "Nghiên cứu đang đặt ra những câu hỏi sai."
                    },
                    {
                        "en": "The new play poses some challenging questions.",
                        "vi": "Trò chơi mới đặt ra một số câu hỏi thử thách."
                    }
                ]
            },
            {
                "define": {
                    "en": "doubt or not being certain about something",
                    "vi": "nghi ngờ hoặc không chắc chắn về điều gì đó"
                },
                "examples": [
                    {
                        "en": "His suitability for the job is open to question.",
                        "vi": "Sự phù hợp của anh ấy đối với công việc vẫn còn là một câu hỏi."
                    },
                    {
                        "en": "beyond question Her honesty is beyond question.",
                        "vi": "Ngoài câu hỏi Sự trung thực của cô ấy là không thể nghi ngờ."
                    },
                    {
                        "en": "without question Her version of events was accepted without question.",
                        "vi": "không có câu hỏi Phiên bản của sự kiện của cô ấy đã được chấp nhận mà không có câu hỏi."
                    },
                    {
                        "en": "This case brings into question the whole purpose of the law.",
                        "vi": "Trường hợp này đặt ra câu hỏi về toàn bộ mục đích của luật."
                    },
                    {
                        "en": "The authenticity of the painting has been thrown into question.",
                        "vi": "Tính xác thực của bức tranh đã được đặt ra nghi vấn."
                    },
                    {
                        "en": "The safety of the system has recently come into question.",
                        "vi": "Sự an toàn của hệ thống gần đây đã được đặt ra."
                    },
                    {
                        "en": "His ability has never been called into question.",
                        "vi": "Khả năng của anh ấy chưa bao giờ được đặt ra."
                    },
                    {
                        "en": "question as to/about something I did have some questions as to his motive in coming.",
                        "vi": "câu hỏi về / về điều gì đó Tôi đã có một số câu hỏi về động cơ của anh ấy trong việc đến."
                    },
                    {
                        "en": "She's a great dancer, there's no question about that.",
                        "vi": "Cô ấy là một vũ công tuyệt vời, không có nghi ngờ gì về điều đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody want to ask a question that has not yet been answered",
                    "vi": "để khiến ai đó muốn hỏi một câu hỏi chưa được trả lời"
                },
                "examples": [
                    {
                        "en": "All of which begs the question as to who will fund the project.",
                        "vi": "Tất cả những điều đó đặt ra câu hỏi là ai sẽ tài trợ cho dự án."
                    }
                ]
            },
            {
                "define": {
                    "en": "to talk about something as if it were definitely true, even though it might not be",
                    "vi": "để nói về điều gì đó như thể nó chắc chắn là sự thật, mặc dù nó có thể không"
                },
                "examples": [
                    {
                        "en": "These assumptions beg the question that children learn languages more easily than adults.",
                        "vi": "Những giả định này đặt ra câu hỏi rằng trẻ em học ngôn ngữ dễ dàng hơn người lớn."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to show that you do not know the answer to a question",
                    "vi": "được sử dụng để cho thấy rằng bạn không biết câu trả lời cho một câu hỏi"
                },
                "examples": [
                    {
                        "en": "‘How much is all this going to cost?’ ‘Good question!’",
                        "vi": "Tất cả những thứ này sẽ tốn bao nhiêu tiền?' 'Câu hỏi hay!'"
                    }
                ]
            },
            {
                "define": {
                    "en": "that is being discussed",
                    "vi": "điều đó đang được thảo luận"
                },
                "examples": [
                    {
                        "en": "On the day in question we were in Cardiff.",
                        "vi": "Vào ngày được đề cập, chúng tôi đã ở Cardiff."
                    }
                ]
            },
            {
                "define": {
                    "en": "in doubt; uncertain",
                    "vi": "nghi ngờ; không chắc chắn"
                },
                "examples": [
                    {
                        "en": "The future of public transport is not in question.",
                        "vi": "Tương lai của giao thông công cộng không có gì phải bàn cãi."
                    },
                    {
                        "en": "His sincerity is not in question.",
                        "vi": "Sự chân thành của anh ấy là điều không cần bàn cãi."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that something is not difficult to predict, explain, do, etc.",
                    "vi": "được sử dụng để nói rằng một cái gì đó không khó dự đoán, giải thích, làm, v.v."
                },
                "examples": [
                    {
                        "en": "It's merely a question of time before the business collapses.",
                        "vi": "Nó chỉ đơn thuần là một câu hỏi về thời gian trước khi doanh nghiệp sụp đổ."
                    },
                    {
                        "en": "It's just a question of deciding what you really want.",
                        "vi": "Vấn đề chỉ là quyết định xem bạn thực sự muốn gì."
                    },
                    {
                        "en": "Now it's just a question of getting the wording right.",
                        "vi": "Bây giờ nó chỉ là một câu hỏi về việc sử dụng đúng từ ngữ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a matter about which there may be difference of opinion or a lack of understanding",
                    "vi": "một vấn đề mà có thể có sự khác biệt về quan điểm hoặc sự thiếu hiểu biết"
                },
                "examples": [
                    {
                        "en": "Whether this should be enforced by law or not is a moot point.",
                        "vi": "Liệu điều này có nên được thực thi theo luật hay không là một vấn đề cần bàn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a matter about which there may be difference of opinion or a lack of understanding",
                    "vi": "một vấn đề mà có thể có sự khác biệt về quan điểm hoặc sự thiếu hiểu biết"
                },
                "examples": [
                    {
                        "en": "Whether this should be enforced by law or not is a moot question.",
                        "vi": "Liệu điều này có nên được thực thi theo luật hay không là một câu hỏi tranh luận."
                    }
                ]
            },
            {
                "define": {
                    "en": "impossible or not allowed and therefore not worth discussing",
                    "vi": "không thể hoặc không được phép và do đó không đáng thảo luận"
                },
                "examples": [
                    {
                        "en": "Another trip abroad this year is out of the question.",
                        "vi": "Một chuyến đi nước ngoài khác trong năm nay không có gì đáng bàn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to ask somebody to marry you",
                    "vi": "để hỏi ai đó kết hôn với bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "there is/was no possibility of something",
                    "vi": "không có / không có khả năng xảy ra một cái gì đó"
                },
                "examples": [
                    {
                        "en": "There was no question of his/him cancelling the trip so near the departure date.",
                        "vi": "Không có chuyện anh ấy / anh ấy hủy chuyến đi gần ngày khởi hành."
                    }
                ]
            }
        ]
    },
    {
        "id": "1fa7291533d44f258ad4a0bb98aa5eb2",
        "word": "uncertainty",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ʌnˈsɜːtnti/",
            "us": "/ʌnˈsɜːrtnti/"
        },
        "nearby": [
            {
                "word": "uncertain",
                "pos": "adjective"
            },
            {
                "word": "uncertainly",
                "pos": "adverb"
            },
            {
                "word": "uncertainty",
                "pos": "noun"
            },
            {
                "word": "unchallengeable",
                "pos": "adjective"
            },
            {
                "word": "unchallenged",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the state of being uncertain",
                    "vi": "trạng thái không chắc chắn"
                },
                "examples": [
                    {
                        "en": "There is considerable uncertainty about the company's future.",
                        "vi": "Có sự không chắc chắn đáng kể về tương lai của công ty."
                    },
                    {
                        "en": "He had an air of uncertainty about him.",
                        "vi": "Anh ta có một bầu không khí không chắc chắn về anh ta."
                    }
                ]
            },
            {
                "define": {
                    "en": "something that you cannot be sure about; a situation that makes you not be or feel certain",
                    "vi": "điều gì đó mà bạn không thể chắc chắn về nó; một tình huống khiến bạn không hoặc cảm thấy chắc chắn"
                },
                "examples": [
                    {
                        "en": "life’s uncertainties",
                        "vi": "những bất ổn của cuộc sống"
                    },
                    {
                        "en": "the uncertainties of war",
                        "vi": "những bất ổn của chiến tranh"
                    }
                ]
            }
        ]
    },
    {
        "id": "b5fb0d93bd804a9388541b99cd59426c",
        "word": "weaken",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈwiːkən/",
            "us": "/ˈwiːkən/"
        },
        "nearby": [
            {
                "word": "we",
                "pos": "pronoun"
            },
            {
                "word": "weak",
                "pos": "adjective"
            },
            {
                "word": "weaken",
                "pos": "verb"
            },
            {
                "word": "The Weakest Link",
                "pos": ""
            },
            {
                "word": "weak force",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to make somebody/something less strong or powerful; to become less strong or powerful",
                    "vi": "để làm cho ai đó / cái gì đó kém mạnh mẽ hơn hoặc mạnh mẽ hơn; trở nên kém mạnh mẽ hơn hoặc mạnh mẽ hơn"
                },
                "examples": [
                    {
                        "en": "The team has been weakened by injury.",
                        "vi": "Đội đã bị suy yếu do chấn thương."
                    },
                    {
                        "en": "The new evidence weakens the case against her.",
                        "vi": "Bằng chứng mới làm suy yếu vụ kiện chống lại cô ấy."
                    },
                    {
                        "en": "This new story has severely weakened the President’s position.",
                        "vi": "Câu chuyện mới này đã khiến vị thế của Tổng thống bị suy yếu nghiêm trọng."
                    },
                    {
                        "en": "His authority is steadily weakening.",
                        "vi": "Quyền lực của ông đang dần suy yếu."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make something less physically strong; to become less physically strong",
                    "vi": "để làm cho một cái gì đó kém mạnh mẽ hơn về thể chất; trở nên kém mạnh mẽ hơn về thể chất"
                },
                "examples": [
                    {
                        "en": "The explosion had weakened the building's foundations.",
                        "vi": "Vụ nổ đã làm suy yếu nền móng của tòa nhà."
                    },
                    {
                        "en": "His health was weakened by overwork.",
                        "vi": "Sức khỏe của anh bị suy yếu do làm việc quá sức."
                    },
                    {
                        "en": "She felt her legs weaken.",
                        "vi": "Cô cảm thấy chân mình yếu dần đi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to become or make somebody become less determined or certain about something",
                    "vi": "trở thành hoặc làm cho ai đó trở nên kém quyết tâm hoặc chắc chắn về điều gì đó"
                },
                "examples": [
                    {
                        "en": "You must not agree to do it. Don't weaken.",
                        "vi": "Bạn không được đồng ý làm điều đó. Đừng suy yếu."
                    },
                    {
                        "en": "weaken something Nothing could weaken his resolve to continue.",
                        "vi": "làm suy yếu điều gì đó Không gì có thể làm suy yếu quyết tâm tiếp tục của anh ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to become less strong",
                    "vi": "trở nên kém mạnh mẽ hơn"
                },
                "examples": [
                    {
                        "en": "The storm eventually weakened.",
                        "vi": "Cơn bão cuối cùng cũng suy yếu."
                    }
                ]
            },
            {
                "define": {
                    "en": "to become less strong; to make a currency or economy less strong",
                    "vi": "trở nên kém mạnh mẽ hơn; để làm cho tiền tệ hoặc nền kinh tế kém mạnh mẽ hơn"
                },
                "examples": [
                    {
                        "en": "weaken (against something) The dollar has weakened against the euro.",
                        "vi": "làm suy yếu (chống lại điều gì đó) Đồng đô la đã suy yếu so với đồng euro."
                    },
                    {
                        "en": "weaken something measures that could weaken the economy",
                        "vi": "làm suy yếu một số biện pháp có thể làm suy yếu nền kinh tế"
                    }
                ]
            }
        ]
    },
    {
        "id": "c7e6a48b5f6545ca98d4694737f8d910",
        "word": "apocryphal",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/əˈpɒkrɪfl/",
            "us": "/əˈpɑːkrɪfl/"
        },
        "nearby": [
            {
                "word": "apocope",
                "pos": "noun"
            },
            {
                "word": "apocrypha",
                "pos": "noun"
            },
            {
                "word": "apocryphal",
                "pos": "adjective"
            },
            {
                "word": "apogee",
                "pos": "noun"
            },
            {
                "word": "apolitical",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "well known, but probably not true",
                    "vi": "nổi tiếng, nhưng có lẽ không đúng"
                },
                "examples": [
                    {
                        "en": "Most of the stories about him are apocryphal.",
                        "vi": "Hầu hết những câu chuyện về anh ta là ngụy tạo."
                    }
                ]
            }
        ]
    },
    {
        "id": "ed75bee411c844a08614588ee09b424e",
        "word": "a question mark over/against something",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkwestʃən mɑːk/",
            "us": "/ˈkwestʃən mɑːrk/"
        },
        "nearby": [
            {
                "word": "questioning",
                "pos": "adjective"
            },
            {
                "word": "questioningly",
                "pos": "adverb"
            },
            {
                "word": "question mark",
                "pos": "noun"
            },
            {
                "word": "question master",
                "pos": "noun"
            },
            {
                "word": "questionnaire",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the mark ( ? ) used in writing after a question",
                    "vi": "dấu (?) được sử dụng trong văn bản sau một câu hỏi"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to say that something is not certain",
                    "vi": "được sử dụng để nói rằng một cái gì đó không chắc chắn"
                },
                "examples": [
                    {
                        "en": "There's still a big question mark hanging over his future with the team.",
                        "vi": "Vẫn còn một dấu hỏi lớn về tương lai của anh ấy với đội bóng."
                    }
                ]
            }
        ]
    },
    {
        "id": "d5f40e15e89746c4a2a5623e49b24732",
        "word": "arguable",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɑːɡjuəbl/",
            "us": "/ˈɑːrɡjuəbl/"
        },
        "nearby": [
            {
                "word": "Argos",
                "pos": ""
            },
            {
                "word": "argot",
                "pos": "noun"
            },
            {
                "word": "arguable",
                "pos": "adjective"
            },
            {
                "word": "arguably",
                "pos": "adverb"
            },
            {
                "word": "argue",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "that you can give good reasons for",
                    "vi": "mà bạn có thể đưa ra lý do chính đáng cho"
                },
                "examples": [
                    {
                        "en": "He had a good arguable case.",
                        "vi": "Anh ấy đã có một trường hợp đáng tranh luận."
                    },
                    {
                        "en": "it is arguable that… It is arguable that giving too much detail may actually be confusing.",
                        "vi": "nó được cho là… Có thể nói rằng đưa ra quá nhiều chi tiết có thể thực sự gây nhầm lẫn."
                    }
                ]
            },
            {
                "define": {
                    "en": "not certain; that you do not accept without question",
                    "vi": "không chắc chắn; mà bạn không chấp nhận mà không có câu hỏi"
                },
                "examples": [
                    {
                        "en": "it is arguable whether… It is arguable whether the case should ever have gone to trial (= perhaps it should not have).",
                        "vi": "nó được tranh luận liệu… Có thể tranh luận rằng liệu vụ án có nên được đưa ra xét xử hay không (= có lẽ nó không nên có)."
                    }
                ]
            }
        ]
    },
    {
        "id": "ccd6cce5f451404a8fbc11d397a6c094",
        "word": "halting",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈhɔːltɪŋ/",
            "us": "/ˈhɔːltɪŋ/"
        },
        "nearby": [
            {
                "word": "halt",
                "pos": "noun"
            },
            {
                "word": "halter",
                "pos": "noun"
            },
            {
                "word": "halting",
                "pos": "adjective"
            },
            {
                "word": "haltingly",
                "pos": "adverb"
            },
            {
                "word": "halve",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "stopping and starting often, especially because you are not certain or are not very confident",
                    "vi": "dừng lại và bắt đầu thường xuyên, đặc biệt là vì bạn không chắc chắn hoặc không tự tin lắm"
                },
                "examples": [
                    {
                        "en": "We carried on a halting conversation.",
                        "vi": "Chúng tôi tiếp tục cuộc trò chuyện tạm dừng."
                    },
                    {
                        "en": "a toddler’s first few halting steps",
                        "vi": "vài bước tạm dừng đầu tiên của trẻ mới biết đi"
                    },
                    {
                        "en": "Europe’s halting progress towards greater unity",
                        "vi": "Châu Âu đang ngừng tiến bộ hướng tới sự thống nhất lớn hơn"
                    }
                ]
            }
        ]
    },
    {
        "id": "02e80a047750409f84f2d7a5d42924da",
        "word": "haltingly",
        "pos": "adverb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈhɔːltɪŋli/",
            "us": "/ˈhɔːltɪŋli/"
        },
        "nearby": [
            {
                "word": "halter",
                "pos": "noun"
            },
            {
                "word": "halting",
                "pos": "adjective"
            },
            {
                "word": "haltingly",
                "pos": "adverb"
            },
            {
                "word": "halve",
                "pos": "verb"
            },
            {
                "word": "halves",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "if you speak or move haltingly, you stop and start often, especially because you are not certain or are not very confident",
                    "vi": "nếu bạn nói hoặc di chuyển dừng lại, bạn dừng lại và bắt đầu thường xuyên, đặc biệt là vì bạn không chắc chắn hoặc không tự tin lắm"
                },
                "examples": [
                    {
                        "en": "‘Well…’ she began haltingly.",
                        "vi": "“Chà…” cô ấy bắt đầu ngập ngừng."
                    }
                ]
            }
        ]
    },
    {
        "id": "e5372f8b7d7548f18a24d9c7522bdd2d",
        "word": "have a good mind to do something",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/maɪnd/",
            "us": "/maɪnd/"
        },
        "nearby": [
            {
                "word": "mincer",
                "pos": "noun"
            },
            {
                "word": "mincing",
                "pos": "adjective"
            },
            {
                "word": "mind",
                "pos": "noun"
            },
            {
                "word": "mind",
                "pos": "verb"
            },
            {
                "word": "Mind",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the part of a person that makes them able to be aware of things, to think and to feel",
                    "vi": "phần của một người khiến họ có thể nhận thức về mọi thứ, suy nghĩ và cảm nhận"
                },
                "examples": [
                    {
                        "en": "the conscious/subconscious mind",
                        "vi": "ý thức / tiềm thức"
                    },
                    {
                        "en": "There were all kinds of thoughts running through my mind.",
                        "vi": "Có đủ loại suy nghĩ chạy qua tâm trí tôi."
                    },
                    {
                        "en": "There was no doubt in his mind that he'd get the job.",
                        "vi": "Không nghi ngờ gì trong đầu anh ấy rằng anh ấy sẽ nhận được công việc."
                    },
                    {
                        "en": "‘Drugs’ are associated in most people's minds with drug abuse.",
                        "vi": "Ma túy' gắn liền với tâm trí của hầu hết mọi người với việc lạm dụng ma túy."
                    },
                    {
                        "en": "She was in a disturbed state of mind.",
                        "vi": "Cô ấy đang ở trong một trạng thái tâm trí bị xáo trộn."
                    },
                    {
                        "en": "I could not have complete peace of mind before they returned.",
                        "vi": "Tôi không thể hoàn toàn yên tâm trước khi họ quay trở lại."
                    },
                    {
                        "en": "The campaign to win the hearts and minds of the public continues.",
                        "vi": "Chiến dịch để giành được trái tim và khối óc của công chúng vẫn tiếp tục."
                    },
                    {
                        "en": "I felt refreshed in mind and body.",
                        "vi": "Tôi cảm thấy sảng khoái trong tâm trí và cơ thể."
                    }
                ]
            },
            {
                "define": {
                    "en": "your ability to think and reason; your intelligence; the particular way that somebody thinks",
                    "vi": "khả năng suy nghĩ và lập luận của bạn; trí thông minh của bạn; theo cách cụ thể mà ai đó nghĩ"
                },
                "examples": [
                    {
                        "en": "to have a brilliant/good/keen mind",
                        "vi": "có một trí tuệ thông minh / tốt / sắc sảo"
                    },
                    {
                        "en": "a creative/evil/suspicious mind",
                        "vi": "một đầu óc sáng tạo / xấu xa / nghi ngờ"
                    },
                    {
                        "en": "She had a lively and enquiring mind.",
                        "vi": "Cô ấy có một tâm hồn sôi nổi và ham học hỏi."
                    },
                    {
                        "en": "His mind is as sharp as ever.",
                        "vi": "Đầu óc anh vẫn nhạy bén như mọi khi."
                    },
                    {
                        "en": "I've no idea how her mind works!",
                        "vi": "Tôi không biết tâm trí cô ấy hoạt động như thế nào!"
                    },
                    {
                        "en": "He had the body of a man and the mind of a child.",
                        "vi": "Anh ta có cơ thể của một người đàn ông và tâm trí của một đứa trẻ."
                    },
                    {
                        "en": "Their evidence might give us some insights into the criminal mind.",
                        "vi": "Bằng chứng của họ có thể cung cấp cho chúng ta một số hiểu biết sâu sắc về tâm trí tội phạm."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who is very intelligent",
                    "vi": "một người rất thông minh"
                },
                "examples": [
                    {
                        "en": "She was one of the greatest minds of her generation.",
                        "vi": "Cô ấy là một trong những bộ óc vĩ đại nhất trong thế hệ của mình."
                    },
                    {
                        "en": "a problem that has defeated the world's finest minds",
                        "vi": "một vấn đề đã đánh bại những bộ óc tài giỏi nhất thế giới"
                    },
                    {
                        "en": "Larry is one of the best trained minds in the industry.",
                        "vi": "Larry là một trong những bộ óc được đào tạo tốt nhất trong ngành."
                    }
                ]
            },
            {
                "define": {
                    "en": "your thoughts, interest, etc.",
                    "vi": "suy nghĩ của bạn, sở thích, v.v."
                },
                "examples": [
                    {
                        "en": "Keep your mind on your work!",
                        "vi": "Giữ tâm trí của bạn trên công việc của bạn!"
                    },
                    {
                        "en": "Your mind’s not on the job.",
                        "vi": "Tâm trí của bạn không ở trên công việc."
                    },
                    {
                        "en": "Her mind is completely occupied by the new baby.",
                        "vi": "Tâm trí của cô ấy hoàn toàn bị chiếm đóng bởi đứa bé mới sinh."
                    },
                    {
                        "en": "The lecture dragged on and my mind wandered.",
                        "vi": "Bài giảng kéo dài và tâm trí tôi quay cuồng."
                    },
                    {
                        "en": "He gave his mind to the arrangements for the next day.",
                        "vi": "Anh dành hết tâm trí cho việc sắp xếp cho ngày hôm sau."
                    },
                    {
                        "en": "As for avoiding you, nothing could be further from my mind (= I was not thinking of it at all).",
                        "vi": "Đối với việc tránh mặt bạn, không gì có thể xa hơn được trong tâm trí tôi (= Tôi không hề nghĩ đến điều đó)."
                    }
                ]
            },
            {
                "define": {
                    "en": "your ability to remember things",
                    "vi": "khả năng ghi nhớ của bạn"
                },
                "examples": [
                    {
                        "en": "When I saw the exam questions my mind just went blank (= I couldn't remember anything).",
                        "vi": "Khi tôi nhìn thấy đề thi, đầu óc tôi trở nên trống rỗng (= Tôi không nhớ được gì)."
                    },
                    {
                        "en": "Sorry—your name has gone right out of my mind.",
                        "vi": "Xin lỗi - tên của bạn đã biến mất khỏi tâm trí tôi."
                    },
                    {
                        "en": "terrible images that will be imprinted on our minds forever",
                        "vi": "những hình ảnh khủng khiếp sẽ in sâu vào tâm trí chúng ta mãi mãi"
                    }
                ]
            },
            {
                "define": {
                    "en": "if a thought, etc. is at the back of your mind, you are aware of it but it is not what you are mainly thinking about",
                    "vi": "nếu một ý nghĩ, v.v. ở phía sau tâm trí của bạn, bạn nhận thức được nó nhưng nó không phải là điều bạn chủ yếu nghĩ về"
                },
                "examples": [
                    {
                        "en": "At the back of my mind was a small, warning voice, telling me it was wrong.",
                        "vi": "Ở phía sau tâm trí tôi là một giọng nói nhỏ, cảnh báo, nói rằng tôi đã sai."
                    },
                    {
                        "en": "The problem was always at the back of my mind.",
                        "vi": "Vấn đề luôn ở trong tâm trí tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be something that only exists in somebody’s imagination",
                    "vi": "trở thành thứ chỉ tồn tại trong trí tưởng tượng của ai đó"
                },
                "examples": [
                    {
                        "en": "These problems are all in your mind, you know.",
                        "vi": "Những vấn đề này đều nằm trong tâm trí bạn, bạn biết đấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to remember somebody/something; to remember or consider that…",
                    "vi": "để nhớ ai đó / cái gì đó; để ghi nhớ hoặc xem xét điều đó…"
                },
                "examples": [
                    {
                        "en": "You don't have to do anything about it now… just bear it in mind.",
                        "vi": "Bạn không cần phải làm bất cứ điều gì về nó bây giờ ... chỉ cần ghi nhớ nó."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be extremely bored, etc.",
                    "vi": "để cực kỳ buồn chán, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "if something is etched on your heart, memory, etc. you remember it because it has made a strong impression on you",
                    "vi": "nếu điều gì đó đã khắc sâu vào trái tim, ký ức của bạn, v.v., bạn sẽ nhớ nó vì nó đã gây ấn tượng mạnh mẽ đối với bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "if something is etched on your mind, heart, etc. you remember it because it has made a strong impression on you",
                    "vi": "nếu điều gì đó khắc sâu vào tâm trí, trái tim bạn, v.v. thì bạn sẽ nhớ nó bởi vì nó đã gây ấn tượng mạnh mẽ đối với bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be unable to decide what you think about somebody/something, or whether to do something or not",
                    "vi": "không thể quyết định bạn nghĩ gì về ai đó / điều gì đó, hoặc có nên làm điều gì đó hay không"
                },
                "examples": [
                    {
                        "en": "I was in two minds about the book (= I didn't know if I liked it or not).",
                        "vi": "Tôi luôn nghĩ về cuốn sách (= Tôi không biết mình có thích nó hay không)."
                    },
                    {
                        "en": "She's in two minds about accepting his invitation.",
                        "vi": "Cô ấy đang suy nghĩ về việc chấp nhận lời mời của anh ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to think very hard about one particular thing",
                    "vi": "suy nghĩ rất kỹ về một điều cụ thể"
                },
                "examples": [
                    {
                        "en": "She bent her mind to the problem of escape.",
                        "vi": "Cô dồn tâm trí vào vấn đề trốn thoát."
                    }
                ]
            },
            {
                "define": {
                    "en": "to think very hard about or put a lot of effort into one particular thing",
                    "vi": "suy nghĩ rất kỹ hoặc nỗ lực rất nhiều vào một điều cụ thể"
                },
                "examples": [
                    {
                        "en": "She bent her mind to the problem of escape.",
                        "vi": "Cô dồn tâm trí vào vấn đề trốn thoát."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have the same opinion about somebody/something",
                    "vi": "có cùng quan điểm về ai đó / điều gì đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be unable to think or behave in a normal way; to become crazy",
                    "vi": "không thể suy nghĩ hoặc hành xử theo cách bình thường; trở nên điên rồ"
                },
                "examples": [
                    {
                        "en": "(informal) You're lending them money? You must be out of your tiny mind!",
                        "vi": "(không chính thức) Bạn đang cho họ vay tiền? Bạn phải ra khỏi tâm trí nhỏ bé của bạn!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be extremely worried, etc.",
                    "vi": "cực kỳ lo lắng, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to produce a very strong feeling of pleasure or shock",
                    "vi": "để tạo ra một cảm giác rất mạnh của niềm vui hoặc sự sốc"
                },
                "examples": [
                    {
                        "en": "Wait till you hear this. It'll blow your mind.",
                        "vi": "Chờ cho đến khi bạn nghe thấy điều này. Nó sẽ thổi bay tâm trí của bạn."
                    },
                    {
                        "en": "a collection of photographs that will blow your mind",
                        "vi": "một bộ sưu tập những bức ảnh sẽ thổi hồn bạn"
                    }
                ]
            },
            {
                "define": {
                    "en": "if something boggles the mind or the mind boggles at it, it is so unusual that people find it hard to imagine or accept",
                    "vi": "nếu có điều gì đó làm tâm trí bối rối hoặc tâm trí bối rối trước nó, thì điều đó thật bất thường đến mức mọi người khó hình dung hoặc khó chấp nhận"
                },
                "examples": [
                    {
                        "en": "The vastness of space really boggles the mind.",
                        "vi": "Không gian rộng lớn thực sự làm bủn rủn tâm trí."
                    },
                    {
                        "en": "‘He says he's married to his cats!’ ‘The mind boggles!’",
                        "vi": "Anh ấy nói rằng anh ấy đã kết hôn với những con mèo của mình!' 'Tâm trí bùm bùm!'"
                    }
                ]
            },
            {
                "define": {
                    "en": "to remember somebody/something",
                    "vi": "để nhớ ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "She couldn't call to mind where she had seen him before.",
                        "vi": "Cô không thể nhớ được nơi cô đã gặp anh trước đây."
                    }
                ]
            },
            {
                "define": {
                    "en": "to remind you of somebody/something",
                    "vi": "để nhắc bạn về ai đó / điều gì đó"
                },
                "examples": [
                    {
                        "en": "The painting brings to mind some of Picasso's early works.",
                        "vi": "Bức tranh gợi nhớ đến một số tác phẩm đầu tiên của Picasso."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make yourself think about something that happened in the past",
                    "vi": "để khiến bản thân suy nghĩ về điều gì đó đã xảy ra trong quá khứ"
                },
                "examples": [
                    {
                        "en": "I want you to cast your minds back to the first time you met.",
                        "vi": "Tôi muốn bạn hồi tưởng lại lần đầu tiên gặp mặt."
                    }
                ]
            },
            {
                "define": {
                    "en": "to change a decision or an opinion",
                    "vi": "để thay đổi một quyết định hoặc một ý kiến"
                },
                "examples": [
                    {
                        "en": "Nothing will make me change my mind.",
                        "vi": "Sẽ không có gì khiến tôi thay đổi suy nghĩ."
                    },
                    {
                        "en": "What made you change your mind?",
                        "vi": "Điều làm cho bạn đổi ý?"
                    }
                ]
            },
            {
                "define": {
                    "en": "an act of changing what you think about a situation, etc.",
                    "vi": "một hành động thay đổi suy nghĩ của bạn về một tình huống, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to refuse to think about something as a possibility",
                    "vi": "từ chối nghĩ về điều gì đó như một khả năng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "if something comes/springs to mind, you suddenly remember or think of it",
                    "vi": "nếu điều gì đó đến / nảy sinh trong tâm trí, bạn chợt nhớ hoặc nghĩ về nó"
                },
                "examples": [
                    {
                        "en": "When discussing influential modern artists, three names immediately come to mind.",
                        "vi": "Khi thảo luận về các nghệ sĩ hiện đại có ảnh hưởng, người ta nghĩ ngay đến ba cái tên."
                    },
                    {
                        "en": "I'm sure someone can help you, but no one immediately springs to mind.",
                        "vi": "Tôi chắc rằng ai đó có thể giúp bạn, nhưng không ai ngay lập tức nghĩ đến điều đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "to come into your mind",
                    "vi": "xuất hiện trong tâm trí bạn"
                },
                "examples": [
                    {
                        "en": "It never crossed my mind that she might lose (= I was sure that she would win).",
                        "vi": "Tôi chưa bao giờ nghĩ đến việc cô ấy có thể thua (= Tôi chắc chắn rằng cô ấy sẽ thắng)."
                    },
                    {
                        "en": "The thought never crossed my mind!",
                        "vi": "Ý nghĩ đó không bao giờ xuất hiện trong đầu tôi!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to tell somebody that you think their behaviour is bad or are angry with them",
                    "vi": "nói với ai đó rằng bạn nghĩ hành vi của họ là xấu hoặc đang tức giận với họ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to say that you and another person must both be very clever because you have had the same idea or agree about something",
                    "vi": "đã từng nói rằng bạn và một người khác phải rất khéo léo vì bạn đã có cùng ý tưởng hoặc đồng ý về điều gì đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to say that you think you will do something, although you are not sure",
                    "vi": "từng nói rằng bạn nghĩ bạn sẽ làm được điều gì đó, mặc dù bạn không chắc chắn"
                },
                "examples": [
                    {
                        "en": "I've half a mind to come with you tomorrow.",
                        "vi": "Tôi nửa tâm trí để đi với bạn vào ngày mai."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that you think that what somebody has done is bad and should do something about it, although you probably will not",
                    "vi": "từng nói rằng bạn nghĩ rằng những gì ai đó đã làm là xấu và nên làm điều gì đó về nó, mặc dù bạn có thể sẽ không"
                },
                "examples": [
                    {
                        "en": "I've a good mind to write and tell your parents about it.",
                        "vi": "Tôi rất muốn viết và nói với bố mẹ của bạn về điều đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be thinking of somebody/something, especially for a particular job, etc.",
                    "vi": "đang nghĩ về ai đó / điều gì đó, đặc biệt là cho một công việc cụ thể, v.v."
                },
                "examples": [
                    {
                        "en": "Do you have anyone in mind for this job?",
                        "vi": "Bạn có ai trong tâm trí cho công việc này?"
                    },
                    {
                        "en": "Watching TV all evening wasn't exactly what I had in mind!",
                        "vi": "Xem TV cả buổi tối không phải là điều tôi nghĩ!"
                    },
                    {
                        "en": "What kind of party do you have in mind?",
                        "vi": "Bạn nghĩ đến loại tiệc nào?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to intend to do something",
                    "vi": "dự định làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "For a long time he had it in mind to write a novel about his experiences.",
                        "vi": "Từ lâu, anh đã có ý định viết một cuốn tiểu thuyết về những trải nghiệm của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have a very bad memory; to forget things easily",
                    "vi": "có một trí nhớ rất tệ; để quên mọi thứ một cách dễ dàng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to have your own opinion and make your own decisions without being influenced by other people",
                    "vi": "có ý kiến riêng của bạn và đưa ra quyết định của riêng bạn mà không bị ảnh hưởng bởi người khác"
                },
                "examples": [
                    {
                        "en": "She has a mind of her own and isn't afraid to say what she thinks.",
                        "vi": "Cô ấy có suy nghĩ của riêng mình và không ngại nói ra những gì mình nghĩ."
                    },
                    {
                        "en": "(humorous) My computer seems to have a mind of its own!",
                        "vi": "(hài hước) Máy tính của tôi dường như có một đầu óc riêng!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be willing to listen to or accept new ideas or suggestions",
                    "vi": "sẵn sàng lắng nghe hoặc chấp nhận những ý tưởng hoặc đề xuất mới"
                },
                "examples": [
                    {
                        "en": "Try to keep an open mind until you've heard all the facts.",
                        "vi": "Cố gắng giữ một tâm trí cởi mở cho đến khi bạn nghe thấy tất cả sự thật."
                    }
                ]
            },
            {
                "define": {
                    "en": "(not) mentally normal",
                    "vi": "(không) tinh thần bình thường"
                },
                "examples": [
                    {
                        "en": "Who in their right mind would want to marry a murderer?",
                        "vi": "Ai trong tâm trí họ muốn kết hôn với một kẻ giết người?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to have very clear and definite ideas about what you want to do",
                    "vi": "để có những ý tưởng rất rõ ràng và dứt khoát về những gì bạn muốn làm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to become mentally ill",
                    "vi": "bị bệnh tâm thần"
                },
                "examples": [
                    {
                        "en": "He feared he was losing his mind.",
                        "vi": "Anh sợ mình mất trí."
                    }
                ]
            },
            {
                "define": {
                    "en": "to decide something",
                    "vi": "để quyết định một cái gì đó"
                },
                "examples": [
                    {
                        "en": "They're both beautiful—I can't make up my mind.",
                        "vi": "Cả hai đều đẹp - tôi không thể quyết định được."
                    },
                    {
                        "en": "Have you made up your minds where to go for your honeymoon?",
                        "vi": "Bạn đã quyết định đi đâu cho tuần trăng mật của mình chưa?"
                    },
                    {
                        "en": "You'll never persuade him to stay—his mind's made up (= he has definitely decided to go).",
                        "vi": "Bạn sẽ không bao giờ thuyết phục anh ta ở lại — tâm trí của anh ta đã quyết định (= anh ta chắc chắn đã quyết định đi)."
                    },
                    {
                        "en": "Come on—it's make your mind up time!",
                        "vi": "Cố lên — đó là thời gian giúp bạn đầu óc!"
                    }
                ]
            },
            {
                "define": {
                    "en": "a close understanding between people with similar ideas, especially when they meet to do something or meet for the first time",
                    "vi": "sự hiểu biết chặt chẽ giữa những người có cùng ý tưởng, đặc biệt là khi họ gặp nhau để làm việc gì đó hoặc gặp nhau lần đầu tiên"
                },
                "examples": [
                    {
                        "en": "a meeting of minds between the two artists",
                        "vi": "cuộc gặp gỡ tâm đầu ý hợp giữa hai nghệ sĩ"
                    }
                ]
            },
            {
                "define": {
                    "en": "the use of the power of your mind to deal with physical problems",
                    "vi": "sử dụng sức mạnh của tâm trí bạn để đối phó với các vấn đề thể chất"
                },
                "examples": [
                    {
                        "en": "He said that keeping running in spite of the pain was just a question of mind over matter.",
                        "vi": "Anh ấy nói rằng việc tiếp tục chạy bất chấp nỗi đau chỉ là vấn đề của tâm trí đối với vật chất."
                    }
                ]
            },
            {
                "define": {
                    "en": "your imagination",
                    "vi": "trí tưởng tượng của bạn"
                },
                "examples": [
                    {
                        "en": "He pictured the scene in his mind's eye.",
                        "vi": "Anh hình dung ra khung cảnh trong mắt mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to give no attention to somebody/something",
                    "vi": "không chú ý đến ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "People call him names sometimes, but he doesn't pay them any mind.",
                        "vi": "Đôi khi người ta gọi tên anh ấy, nhưng anh ấy không để tâm đến họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "not responsible for your actions because of a mental illness",
                    "vi": "không chịu trách nhiệm về hành động của bạn vì bệnh tâm thần"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "if somebody/something is on your mind, you are thinking and worrying about them/it a lot",
                    "vi": "nếu ai đó / điều gì đó đang ở trong tâm trí bạn, bạn đang suy nghĩ và lo lắng về họ / điều đó rất nhiều"
                },
                "examples": [
                    {
                        "en": "You've been on my mind all day.",
                        "vi": "Bạn đã ở trong tâm trí tôi cả ngày."
                    },
                    {
                        "en": "Don't bother your father tonight—he's got a lot on his mind.",
                        "vi": "Đừng làm phiền bố bạn tối nay - ông ấy đang bận tâm rất nhiều việc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to become or make somebody aware of new ideas or experiences",
                    "vi": "trở thành hoặc làm cho ai đó biết về những ý tưởng hoặc kinh nghiệm mới"
                },
                "examples": [
                    {
                        "en": "He’s eager to open the minds of his audience to different kinds of music.",
                        "vi": "Anh ấy mong muốn được mở mang tâm trí của khán giả đến các thể loại âm nhạc khác nhau."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say somebody will quickly be forgotten when they are no longer with you",
                    "vi": "từng nói ai đó sẽ nhanh chóng bị lãng quên khi họ không còn ở bên bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to make somebody think and worry about it all the time",
                    "vi": "khiến ai đó luôn suy nghĩ và lo lắng về điều đó"
                },
                "examples": [
                    {
                        "en": "The thought that he could have helped more preyed on his mind.",
                        "vi": "Ý nghĩ rằng anh ta có thể giúp được nhiều con mồi hơn trong tâm trí anh ta."
                    },
                    {
                        "en": "It's been preying on my mind ever since it happened.",
                        "vi": "Nó đã rình rập tâm trí tôi kể từ khi nó xảy ra."
                    }
                ]
            },
            {
                "define": {
                    "en": "to try to forget about something unpleasant",
                    "vi": "cố gắng quên đi điều gì đó khó chịu"
                },
                "examples": [
                    {
                        "en": "I tried to push the thought to the back of my mind.",
                        "vi": "Tôi cố gắng đẩy ý nghĩ về phía sau tâm trí của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody think of somebody/something; to remind somebody of somebody/something",
                    "vi": "để làm cho ai đó nghĩ về ai đó / cái gì đó; để nhắc ai đó về ai đó / điều gì đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to do or say something to make somebody stop worrying about something",
                    "vi": "làm hoặc nói điều gì đó để khiến ai đó ngừng lo lắng về điều gì đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to decide you want to achieve something and give this all your attention",
                    "vi": "để quyết định bạn muốn đạt được điều gì đó và dành tất cả sự chú ý cho điều này"
                },
                "examples": [
                    {
                        "en": "She could have been a brilliant pianist if she'd put her mind to it.",
                        "vi": "Cô ấy đã có thể là một nghệ sĩ dương cầm xuất sắc nếu cô ấy đặt tâm trí của mình vào nó."
                    },
                    {
                        "en": "You can do whatever you set your mind to.",
                        "vi": "Bạn có thể làm bất cứ điều gì bạn muốn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to stop thinking about somebody/something; to deliberately forget somebody/something",
                    "vi": "ngừng nghĩ về ai đó / điều gì đó; cố tình quên ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "I just can't get her out of my mind.",
                        "vi": "Tôi chỉ không thể gạt cô ấy ra khỏi tâm trí của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "if something slips your mind, you forget it or forget to do it",
                    "vi": "nếu điều gì đó thoáng qua trong tâm trí bạn, bạn sẽ quên nó hoặc quên làm điều đó"
                },
                "examples": [
                    {
                        "en": "I’m sorry I didn’t tell you. It completely slipped my mind.",
                        "vi": "Tôi xin lỗi vì tôi đã không nói với bạn. Nó hoàn toàn đánh trượt tâm trí tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to say exactly what you think, in a very direct way",
                    "vi": "nói chính xác những gì bạn nghĩ, một cách rất trực tiếp"
                },
                "examples": [
                    {
                        "en": "She’s never hesitated about speaking her mind.",
                        "vi": "Cô ấy không bao giờ do dự về việc nói ra suy nghĩ của mình."
                    },
                    {
                        "en": "Everyone should have the right to speak their mind.",
                        "vi": "Mọi người nên có quyền nói lên suy nghĩ của họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be remembered for a long time",
                    "vi": "được ghi nhớ trong một thời gian dài"
                },
                "examples": [
                    {
                        "en": "One of his paintings in particular sticks in my mind.",
                        "vi": "Một trong những bức tranh của anh ấy đặc biệt ghi nhớ trong tâm trí tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make you forget about something unpleasant for a short time",
                    "vi": "để làm cho bạn quên đi điều gì đó khó chịu trong một thời gian ngắn"
                },
                "examples": [
                    {
                        "en": "Painting helped take her mind off her troubles.",
                        "vi": "Hội họa đã giúp cô ấy cởi bỏ những muộn phiền."
                    }
                ]
            },
            {
                "define": {
                    "en": "in my opinion",
                    "vi": "Theo tôi"
                },
                "examples": [
                    {
                        "en": "It was a ridiculous thing to do, to my mind.",
                        "vi": "Đó là một điều nực cười để làm, đối với tâm trí của tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a particular way of thinking about things",
                    "vi": "một cách suy nghĩ cụ thể về mọi thứ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "fdd039b247d641d78a2dff8513761c1a",
        "word": "if",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ɪf/",
            "us": "/ɪf/"
        },
        "nearby": [
            {
                "word": "IELTS",
                "pos": "abbreviation"
            },
            {
                "word": "if",
                "pos": "conjunction"
            },
            {
                "word": "if",
                "pos": "noun"
            },
            {
                "word": "If",
                "pos": ""
            },
            {
                "word": "iff",
                "pos": "conjunction"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a situation that is not certain",
                    "vi": "một tình huống không chắc chắn"
                },
                "examples": [
                    {
                        "en": "If he wins—and it's a big if—he'll be the first Englishman to win for fifty years.",
                        "vi": "Nếu anh ấy thắng - và thật là lớn nếu - anh ấy sẽ là người Anh đầu tiên giành chiến thắng trong 50 năm."
                    },
                    {
                        "en": "There are still a lot of ifs and buts before everything's settled.",
                        "vi": "Vẫn còn rất nhiều ifs và buts trước khi mọi thứ được giải quyết."
                    }
                ]
            }
        ]
    },
    {
        "id": "5af95e45e5a2407dac3dfe074598901b",
        "word": "iffy",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɪfi/",
            "us": "/ˈɪfi/"
        },
        "nearby": [
            {
                "word": "If",
                "pos": ""
            },
            {
                "word": "iff",
                "pos": "conjunction"
            },
            {
                "word": "iffy",
                "pos": "adjective"
            },
            {
                "word": "iftar",
                "pos": "noun"
            },
            {
                "word": "-ify",
                "pos": "suffix"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "not in perfect condition; bad in some way",
                    "vi": "không ở trong tình trạng hoàn hảo; xấu theo một cách nào đó"
                },
                "examples": [
                    {
                        "en": "That meat smells a bit iffy to me.",
                        "vi": "Thịt đó có mùi hơi cay đối với tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "not certain",
                    "vi": "không chắc chắn"
                },
                "examples": [
                    {
                        "en": "The weather looks slightly iffy.",
                        "vi": "Thời tiết có vẻ hơi lạnh."
                    }
                ]
            }
        ]
    },
    {
        "id": "8708e23a600147e5a3a25bc1a0b89414",
        "word": "the jury is (still) out on something",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈdʒʊəri/",
            "us": "/ˈdʒʊri/"
        },
        "nearby": [
            {
                "word": "jurist",
                "pos": "noun"
            },
            {
                "word": "juror",
                "pos": "noun"
            },
            {
                "word": "jury",
                "pos": "noun"
            },
            {
                "word": "jury duty",
                "pos": "noun"
            },
            {
                "word": "juryman",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a group of members of the public who listen to the facts of a case in a court and decide whether or not somebody is guilty of a crime, or whether a claim has been proved",
                    "vi": "một nhóm công chúng lắng nghe sự thật của một vụ án tại tòa án và quyết định xem ai đó có phạm tội hay không hoặc liệu yêu cầu bồi thường đã được chứng minh hay chưa"
                },
                "examples": [
                    {
                        "en": "members of the jury",
                        "vi": "thành viên ban giám khảo"
                    },
                    {
                        "en": "The jury has/have returned a verdict of guilty.",
                        "vi": "Bồi thẩm đoàn đã / đã trả lại bản án có tội."
                    },
                    {
                        "en": "on a jury to be/sit/serve on a jury",
                        "vi": "trên bồi thẩm đoàn để trở thành / ngồi / phục vụ trong bồi thẩm đoàn"
                    },
                    {
                        "en": "by jury the right to trial by jury",
                        "vi": "của bồi thẩm đoàn quyền được xét xử bởi bồi thẩm đoàn"
                    }
                ]
            },
            {
                "define": {
                    "en": "a group of people who decide who is the winner of a competition",
                    "vi": "một nhóm người quyết định ai là người chiến thắng trong một cuộc thi"
                },
                "examples": [
                    {
                        "en": "on a jury He was on the jury for this year's Booker Prize.",
                        "vi": "trên ban giám khảo Anh ấy là thành viên ban giám khảo cho Giải thưởng Booker năm nay."
                    }
                ]
            },
            {
                "define": {
                    "en": "used when you are saying that something is still not certain",
                    "vi": "được sử dụng khi bạn đang nói rằng điều gì đó vẫn chưa chắc chắn"
                },
                "examples": [
                    {
                        "en": "The jury is still out on whether wine can be good for you.",
                        "vi": "Ban giám khảo vẫn chưa biết liệu rượu có tốt cho bạn hay không."
                    }
                ]
            }
        ]
    },
    {
        "id": "1061f52c9fe8489cbb708395272f434f",
        "word": "reputed",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/rɪˈpjuːtɪd/",
            "us": "/rɪˈpjuːtɪd/"
        },
        "nearby": [
            {
                "word": "reputation",
                "pos": "noun"
            },
            {
                "word": "repute",
                "pos": "noun"
            },
            {
                "word": "reputed",
                "pos": "adjective"
            },
            {
                "word": "reputedly",
                "pos": "adverb"
            },
            {
                "word": "request",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "generally thought to be something or to have done something, although this is not certain",
                    "vi": "thường được cho là một cái gì đó hoặc đã làm một cái gì đó, mặc dù điều này không chắc chắn"
                },
                "examples": [
                    {
                        "en": "reputed (to be something) He is reputed to be the best heart surgeon in the country.",
                        "vi": "có uy tín (trở thành một cái gì đó) Ông ấy được coi là bác sĩ phẫu thuật tim giỏi nhất trong nước."
                    },
                    {
                        "en": "reputed (to have done something) The house is wrongly reputed to have been the poet's birthplace.",
                        "vi": "danh tiếng (đã làm được điều gì đó) Ngôi nhà bị cho là nơi sinh của nhà thơ một cách sai lầm."
                    },
                    {
                        "en": "She sold her share of the company for a reputed £7 million.",
                        "vi": "Cô đã bán cổ phần của mình trong công ty với giá 7 triệu bảng Anh."
                    }
                ]
            }
        ]
    },
    {
        "id": "58d98e8d7d2d49ecbfe40a9563cc2293",
        "word": "reputedly",
        "pos": "adverb",
        "level": "c2",
        "phonetic": {
            "uk": "/rɪˈpjuːtɪdli/",
            "us": "/rɪˈpjuːtɪdli/"
        },
        "nearby": [
            {
                "word": "repute",
                "pos": "noun"
            },
            {
                "word": "reputed",
                "pos": "adjective"
            },
            {
                "word": "reputedly",
                "pos": "adverb"
            },
            {
                "word": "request",
                "pos": "noun"
            },
            {
                "word": "request",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "used to say that something is generally thought to be true, although this is not certain",
                    "vi": "được sử dụng để nói rằng một cái gì đó thường được cho là đúng, mặc dù điều này không chắc chắn"
                },
                "examples": [
                    {
                        "en": "He was reputedly a millionaire.",
                        "vi": "Ông được cho là một triệu phú."
                    },
                    {
                        "en": "It is reputedly the best hotel in the country.",
                        "vi": "Nó có uy tín là khách sạn tốt nhất trong nước."
                    }
                ]
            }
        ]
    },
    {
        "id": "de62f9844a7f49b9ad9959df993d808b",
        "word": "shake",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ʃeɪk/",
            "us": "/ʃeɪk/"
        },
        "nearby": [
            {
                "word": "shahada",
                "pos": "noun"
            },
            {
                "word": "shaikh",
                "pos": "noun"
            },
            {
                "word": "shake",
                "pos": "verb"
            },
            {
                "word": "shake",
                "pos": "noun"
            },
            {
                "word": "shake down",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to move or make somebody/something move with short quick movements from side to side or up and down",
                    "vi": "để di chuyển hoặc làm cho ai đó / cái gì đó di chuyển bằng các chuyển động nhanh ngắn từ bên này sang bên kia hoặc lên và xuống"
                },
                "examples": [
                    {
                        "en": "The whole house shakes when a train goes past.",
                        "vi": "Cả ngôi nhà rung chuyển khi một đoàn tàu chạy qua."
                    },
                    {
                        "en": "shake somebody/something Shake the bottle well before use.",
                        "vi": "lắc ai đó / cái gì đó Lắc kỹ chai trước khi sử dụng."
                    },
                    {
                        "en": "The explosion shook windows miles from the site.",
                        "vi": "Vụ nổ làm rung chuyển các cửa sổ cách khu vực này hàng km."
                    },
                    {
                        "en": "shake somebody/something by something He shook her violently by the shoulders.",
                        "vi": "lắc ai đó / cái gì đó bởi một cái gì đó Anh ta lắc cô ấy một cách thô bạo bằng vai."
                    },
                    {
                        "en": "shake somebody/something + adj. He knelt and gently shook her awake.",
                        "vi": "lắc ai đó / cái gì đó + adj. Anh quỳ xuống và nhẹ nhàng lay cô tỉnh giấc."
                    },
                    {
                        "en": "She shook her hair loose.",
                        "vi": "Cô rũ tóc xõa."
                    }
                ]
            },
            {
                "define": {
                    "en": "to move something in a particular direction by shaking",
                    "vi": "để di chuyển một cái gì đó theo một hướng cụ thể bằng cách lắc"
                },
                "examples": [
                    {
                        "en": "She bent down to shake a pebble out of her shoe.",
                        "vi": "Cô cúi xuống để giũ một viên sỏi ra khỏi giày."
                    },
                    {
                        "en": "His father used to come home and shake the dust off his work clothes.",
                        "vi": "Cha anh thường về nhà và rũ bỏ lớp bụi trên bộ quần áo đi làm của mình."
                    },
                    {
                        "en": "He stood up, shaking sand everywhere.",
                        "vi": "Anh đứng dậy, làm rung chuyển cát khắp nơi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to take somebody’s hand and move it up and down as a way of saying hello or to show that you agree about something",
                    "vi": "nắm lấy tay ai đó và di chuyển lên xuống như một cách chào hỏi hoặc để thể hiện rằng bạn đồng ý về điều gì đó"
                },
                "examples": [
                    {
                        "en": "shake hands Do people in Italy shake hands when they meet?",
                        "vi": "bắt tay Mọi người ở Ý có bắt tay nhau khi gặp nhau không?"
                    },
                    {
                        "en": "shake hands with somebody She refused to shake hands with him.",
                        "vi": "bắt tay với ai đó Cô từ chối bắt tay với anh ta."
                    },
                    {
                        "en": "shake somebody’s hand He stepped forward and shook my hand.",
                        "vi": "bắt tay ai đó Anh ấy bước tới và bắt tay tôi."
                    },
                    {
                        "en": "shake somebody by the hand Our host shook each of us warmly by the hand.",
                        "vi": "bắt tay ai đó Chủ nhà của chúng tôi bắt tay nồng nhiệt từng người chúng tôi."
                    },
                    {
                        "en": "shake hands on something They shook hands on the deal (= to show that they had reached an agreement).",
                        "vi": "bắt tay vào một cái gì đó Họ đã bắt tay vào thỏa thuận (= để cho thấy rằng họ đã đạt được một thỏa thuận)."
                    },
                    {
                        "en": "shake on something They shook on the deal (= shook hands to show the deal was agreed).",
                        "vi": "lắc về cái gì đó Họ đã bắt tay vào thỏa thuận (= bắt tay để thể hiện rằng thỏa thuận đã được đồng ý)."
                    },
                    {
                        "en": "Let's shake on it.",
                        "vi": "Hãy bắt tay vào nó."
                    }
                ]
            },
            {
                "define": {
                    "en": "to turn your head from side to side as a way of saying ‘no’ or to show that you are sad, feel doubt, etc.",
                    "vi": "quay đầu từ bên này sang bên kia như một cách để nói 'không' hoặc để thể hiện rằng bạn đang buồn, cảm thấy nghi ngờ, v.v."
                },
                "examples": [
                    {
                        "en": "‘Drink?’ he offered. She shook her head.",
                        "vi": "Uống?' anh ấy đề nghị. Cô ta lắc đầu."
                    },
                    {
                        "en": "The old man watched them walk off into the night, shaking his head sadly.",
                        "vi": "Ông lão nhìn họ đi vào bóng đêm, buồn bã lắc đầu."
                    },
                    {
                        "en": "She shook her head in disbelief.",
                        "vi": "Cô lắc đầu không tin."
                    },
                    {
                        "en": "He shook his head at the thought.",
                        "vi": "Anh lắc đầu với ý nghĩ đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "to show that you are angry with somebody; to threaten somebody by shaking your fist (= closed hand)",
                    "vi": "để cho thấy rằng bạn đang tức giận với ai đó; đe dọa ai đó bằng cách lắc nắm tay của bạn (= bàn tay khép lại)"
                },
                "examples": [
                    {
                        "en": "The man shook his fist at the court after he was sentenced.",
                        "vi": "Người đàn ông bắt tay trước tòa sau khi bị tuyên án."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make short quick movements that you cannot control, for example because you are cold or afraid",
                    "vi": "để thực hiện các chuyển động nhanh ngắn mà bạn không thể kiểm soát, chẳng hạn như vì bạn lạnh hoặc sợ"
                },
                "examples": [
                    {
                        "en": "Her hands had started to shake.",
                        "vi": "Tay cô bắt đầu run."
                    },
                    {
                        "en": "shake with something He was shaking with fear.",
                        "vi": "run rẩy với một cái gì đó Anh ấy đang run rẩy vì sợ hãi."
                    },
                    {
                        "en": "He saw his mother turn away, her shoulders shaking with laughter.",
                        "vi": "Anh thấy mẹ quay đi, đôi vai rung lên vì cười."
                    },
                    {
                        "en": "His whole body shook with rage.",
                        "vi": "Toàn thân anh rung lên vì thịnh nộ."
                    },
                    {
                        "en": "I was shaking like a leaf.",
                        "vi": "Tôi run như một chiếc lá."
                    }
                ]
            },
            {
                "define": {
                    "en": "to sound unsteady, usually because you are nervous, upset or angry",
                    "vi": "nghe không ổn định, thường là do bạn đang lo lắng, khó chịu hoặc tức giận"
                },
                "examples": [
                    {
                        "en": "‘Who are you?’ he asked, his voice shaking.",
                        "vi": "Bạn là ai?' anh hỏi, giọng run run."
                    },
                    {
                        "en": "Her voice shook with emotion.",
                        "vi": "Giọng cô ấy run lên vì xúc động."
                    }
                ]
            },
            {
                "define": {
                    "en": "to shock or upset somebody very much",
                    "vi": "gây sốc hoặc làm ai đó buồn rất nhiều"
                },
                "examples": [
                    {
                        "en": "shake somebody He was badly shaken by the news of her death.",
                        "vi": "rung chuyển ai đó Anh ấy bị chấn động nặng nề trước tin cô ấy qua đời."
                    },
                    {
                        "en": "shake somebody up The accident really shook her up.",
                        "vi": "lay động ai đó Vụ tai nạn thực sự làm cô ấy rung động."
                    },
                    {
                        "en": "Shaken up by the early goal against them, the team began to fight back.",
                        "vi": "Bị chấn động bởi bàn thua sớm chống lại họ, cả đội bắt đầu chống trả."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make a belief or an idea less certain",
                    "vi": "để làm cho một niềm tin hoặc một ý tưởng ít chắc chắn hơn"
                },
                "examples": [
                    {
                        "en": "The incident had shaken her faith in him.",
                        "vi": "Sự việc đã làm lung lay niềm tin của cô đối với anh."
                    },
                    {
                        "en": "This announcement is bound to shake the confidence of the industry.",
                        "vi": "Thông báo này chắc chắn sẽ làm lung lay niềm tin của ngành công nghiệp."
                    }
                ]
            },
            {
                "define": {
                    "en": "to get rid of something",
                    "vi": "bỏ một thứ gì đó"
                },
                "examples": [
                    {
                        "en": "shake something off I can't seem to shake off this cold.",
                        "vi": "rũ bỏ thứ gì đó Tôi dường như không thể rũ bỏ được cái lạnh này."
                    },
                    {
                        "en": "She has finally managed to shake off her old wrist injury.",
                        "vi": "Cuối cùng cô ấy cũng đã thoát khỏi vết thương ở cổ tay cũ của mình."
                    },
                    {
                        "en": "shake something He couldn't shake the feeling that there was something wrong.",
                        "vi": "lắc một cái gì đó Anh không thể lay chuyển cảm giác rằng có điều gì đó không ổn."
                    },
                    {
                        "en": "She never seemed to completely shake off the dumb blonde image.",
                        "vi": "Cô dường như chưa bao giờ rũ bỏ hoàn toàn hình ảnh tóc vàng hoe."
                    }
                ]
            },
            {
                "define": {
                    "en": "to cause people to question their basic beliefs about something",
                    "vi": "khiến mọi người đặt câu hỏi về niềm tin cơ bản của họ về điều gì đó"
                },
                "examples": [
                    {
                        "en": "This issue has shaken the foundations of French politics.",
                        "vi": "Vấn đề này đã làm lung lay nền tảng của chính trị Pháp."
                    },
                    {
                        "en": "an event which rocked the foundations of British politics",
                        "vi": "một sự kiện làm rung chuyển nền chính trị của Anh"
                    },
                    {
                        "en": "The scandal rocked the legal establishment to its foundations.",
                        "vi": "Vụ bê bối đã làm rung chuyển cơ sở pháp lý về nền tảng của nó."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be very frightened or nervous",
                    "vi": "rất sợ hãi hoặc lo lắng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to tell somebody to start to do something or to hurry",
                    "vi": "được sử dụng để nói với ai đó bắt đầu làm điều gì đó hoặc nhanh lên"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "84bea7d9d8c34e4397c4b78d44f95fbc",
        "word": "shaky",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈʃeɪki/",
            "us": "/ˈʃeɪki/"
        },
        "nearby": [
            {
                "word": "shaking",
                "pos": "noun"
            },
            {
                "word": "Tupac Shakur",
                "pos": ""
            },
            {
                "word": "shaky",
                "pos": "adjective"
            },
            {
                "word": "shale",
                "pos": "noun"
            },
            {
                "word": "shale gas",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "shaking and feeling weak because you are ill, emotional or old",
                    "vi": "run và cảm thấy yếu vì bạn bị ốm, xúc động hoặc già yếu"
                },
                "examples": [
                    {
                        "en": "Her voice sounded shaky on the phone.",
                        "vi": "Giọng cô ấy có vẻ run rẩy trên điện thoại."
                    },
                    {
                        "en": "The old man was very shaky on his feet.",
                        "vi": "Ông già đã rất run rẩy trên đôi chân của mình."
                    },
                    {
                        "en": "My legs still felt quite shaky.",
                        "vi": "Chân tôi vẫn còn khá run."
                    }
                ]
            },
            {
                "define": {
                    "en": "not stable, steady or safe; not certain",
                    "vi": "không ổn định, ổn định hoặc an toàn; không chắc chắn"
                },
                "examples": [
                    {
                        "en": "That ladder looks a little shaky.",
                        "vi": "Cái thang đó trông hơi run."
                    },
                    {
                        "en": "(figurative) Her memories of the accident are a little shaky.",
                        "vi": "(nghĩa bóng) Ký ức của cô ấy về vụ tai nạn hơi run rẩy."
                    },
                    {
                        "en": "(figurative) The protesters are on shaky ground (= it is not certain that their claims are valid).",
                        "vi": "(nghĩa bóng) Những người biểu tình đang ở trên mặt đất rung chuyển (= không chắc rằng yêu sách của họ là hợp lệ)."
                    }
                ]
            },
            {
                "define": {
                    "en": "not seeming very successful; likely to fail",
                    "vi": "có vẻ không thành công lắm; có khả năng thất bại"
                },
                "examples": [
                    {
                        "en": "Business is looking shaky at the moment.",
                        "vi": "Công việc kinh doanh đang có vẻ lung lay vào lúc này."
                    },
                    {
                        "en": "After a shaky start, they fought back to win 3–2.",
                        "vi": "Sau một khởi đầu không ổn định, họ đã chiến đấu trở lại để giành chiến thắng 3–2."
                    },
                    {
                        "en": "The future looks shaky for the present government.",
                        "vi": "Tương lai có vẻ lung lay đối với chính phủ hiện tại."
                    }
                ]
            }
        ]
    },
    {
        "id": "149950f4166d4c4ba3b672f51f71ed11",
        "word": "someway",
        "pos": "adverb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsʌmweɪ/",
            "us": "/ˈsʌmweɪ/"
        },
        "nearby": [
            {
                "word": "sometime",
                "pos": "adjective"
            },
            {
                "word": "sometimes",
                "pos": "adverb"
            },
            {
                "word": "someway",
                "pos": "adverb"
            },
            {
                "word": "somewhat",
                "pos": "adverb"
            },
            {
                "word": "somewhere",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "in a way that is not known or certain",
                    "vi": "theo một cách nào đó không được biết đến hoặc chắc chắn"
                },
                "examples": [
                    {
                        "en": "We need to make this work someway.",
                        "vi": "Chúng ta cần phải làm cho việc này thành công."
                    },
                    {
                        "en": "Somehow, someway, the impossible happened.",
                        "vi": "Bằng cách nào đó, bằng một cách nào đó, điều không thể đã xảy ra."
                    }
                ]
            }
        ]
    },
    {
        "id": "9901de7fd15b43f5ace3282193e144bf",
        "word": "there’s many a slip ’twixt cup and lip",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/slɪp/",
            "us": "/slɪp/"
        },
        "nearby": [
            {
                "word": "slinky",
                "pos": "adjective"
            },
            {
                "word": "slip",
                "pos": "verb"
            },
            {
                "word": "slip",
                "pos": "noun"
            },
            {
                "word": "slip away",
                "pos": "phrasal verb"
            },
            {
                "word": "slipcase",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small mistake, usually made by being careless or not paying attention",
                    "vi": "một lỗi nhỏ, thường do bất cẩn hoặc không chú ý"
                },
                "examples": [
                    {
                        "en": "He recited the whole poem without making a single slip.",
                        "vi": "Anh đọc thuộc lòng cả bài thơ mà không sót một dấu nào."
                    },
                    {
                        "en": "There were a few slips in the translation.",
                        "vi": "Có một vài lỗi trong bản dịch."
                    }
                ]
            },
            {
                "define": {
                    "en": "a small piece of paper, especially one for writing on or with something printed on it",
                    "vi": "một mảnh giấy nhỏ, đặc biệt là một mảnh để viết lên hoặc có gì đó in trên đó"
                },
                "examples": [
                    {
                        "en": "I wrote it down on a slip of paper.",
                        "vi": "Tôi đã viết nó ra một tờ giấy."
                    },
                    {
                        "en": "a betting slip",
                        "vi": "phiếu cá cược"
                    }
                ]
            },
            {
                "define": {
                    "en": "an act of slipping",
                    "vi": "một hành động trượt"
                },
                "examples": [
                    {
                        "en": "One slip and you could fall to your death.",
                        "vi": "Một cú trượt chân và bạn có thể ngã xuống chết."
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of underwear like a thin dress or skirt, worn under a dress",
                    "vi": "một mảnh đồ lót như áo hoặc váy mỏng, mặc dưới váy"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a player who stands behind and to one side of the batsman and tries to catch the ball; the position on the field where this player stands",
                    "vi": "một cầu thủ đứng phía sau và ở một bên của người đánh bóng và cố gắng bắt bóng; vị trí trên sân mà người chơi này đứng"
                },
                "examples": [
                    {
                        "en": "fielding in the slips",
                        "vi": "cố định trong vết trượt"
                    }
                ]
            },
            {
                "define": {
                    "en": "to get away from somebody who is following or running after you",
                    "vi": "để tránh xa ai đó đang theo dõi hoặc chạy theo bạn"
                },
                "examples": [
                    {
                        "en": "I managed to give him the slip by hiding behind a wall.",
                        "vi": "Tôi cố gắng cho anh ta trượt bằng cách trốn sau một bức tường."
                    }
                ]
            },
            {
                "define": {
                    "en": "a small or thin, usually young, person",
                    "vi": "một người nhỏ hoặc gầy, thường là trẻ"
                },
                "examples": [
                    {
                        "en": "I was only a slip of a thing at the time.",
                        "vi": "Tôi chỉ là một thứ gì đó trượt dài vào thời điểm đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "a small mistake in something that you write or say",
                    "vi": "một lỗi nhỏ trong một cái gì đó mà bạn viết hoặc nói"
                },
                "examples": [
                    {
                        "en": "Did I call you Richard? Sorry, Robert, just a slip of the tongue.",
                        "vi": "Tôi đã gọi bạn là Richard? Xin lỗi, Robert, chỉ là một cái sơ suất."
                    },
                    {
                        "en": "I didn't mean to say that—it was just a slip of the tongue.",
                        "vi": "Tôi không cố ý nói điều đó — đó chỉ là một cái trượt lưỡi."
                    }
                ]
            },
            {
                "define": {
                    "en": "nothing is completely certain until it really happens because things can easily go wrong",
                    "vi": "không có gì là hoàn toàn chắc chắn cho đến khi nó thực sự xảy ra bởi vì mọi thứ có thể dễ dàng đi sai"
                },
                "examples": []
            }
        ]
    }
]