[
    {
        "id": "b2bddf741c0141a2b78a723b85bacc26",
        "word": "poor",
        "pos": "adjective",
        "level": "a1",
        "phonetic": {
            "uk": "/pɔː(r)/",
            "us": "/pʊr/"
        },
        "nearby": [
            {
                "word": "pooper scooper",
                "pos": "noun"
            },
            {
                "word": "poop out",
                "pos": "phrasal verb"
            },
            {
                "word": "poor",
                "pos": "adjective"
            },
            {
                "word": "poorhouse",
                "pos": "noun"
            },
            {
                "word": "the Poor Law",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "having very little money; not having enough money for basic needs",
                    "vi": "có rất ít tiền; không có đủ tiền cho các nhu cầu cơ bản"
                },
                "examples": [
                    {
                        "en": "They were too poor to buy shoes for the kids.",
                        "vi": "Họ quá nghèo để mua giày cho bọn trẻ."
                    },
                    {
                        "en": "We aim to help the poorest families.",
                        "vi": "Chúng tôi mong muốn giúp đỡ những gia đình nghèo nhất."
                    },
                    {
                        "en": "It's among the poorer countries of the world.",
                        "vi": "Đó là một trong những quốc gia nghèo hơn trên thế giới."
                    },
                    {
                        "en": "This is a relatively poor neighbourhood.",
                        "vi": "Đây là một khu phố tương đối nghèo."
                    },
                    {
                        "en": "Andrew grew up desperately poor.",
                        "vi": "Andrew lớn lên trong nghèo khó một cách tuyệt vọng."
                    },
                    {
                        "en": "They were so poor that they couldn't afford to feed their family.",
                        "vi": "Họ nghèo đến nỗi không đủ tiền nuôi gia đình."
                    }
                ]
            },
            {
                "define": {
                    "en": "people who have very little money",
                    "vi": "những người có rất ít tiền"
                },
                "examples": [
                    {
                        "en": "They provided food and shelter for the poor.",
                        "vi": "Họ cung cấp thức ăn và chỗ ở cho người nghèo."
                    }
                ]
            },
            {
                "define": {
                    "en": "deserving sympathy",
                    "vi": "đáng được thông cảm"
                },
                "examples": [
                    {
                        "en": "Have you heard about poor old Harry? His wife's left him.",
                        "vi": "Bạn đã nghe về Harry già tội nghiệp chưa? Vợ anh đã bỏ anh."
                    },
                    {
                        "en": "It's hungry—the poor little thing.",
                        "vi": "Nó đói - một điều nhỏ bé tội nghiệp."
                    },
                    {
                        "en": "‘I have stacks of homework to do.’ ‘Oh, you poor thing.’",
                        "vi": "Tôi có một đống bài tập về nhà phải làm.' 'Oh bạn điều người nghèo.'"
                    },
                    {
                        "en": "Some poor soul will have to clean the house after the party.",
                        "vi": "Một linh hồn tội nghiệp nào đó sẽ phải dọn dẹp nhà cửa sau bữa tiệc."
                    }
                ]
            },
            {
                "define": {
                    "en": "not good; of a quality that is low or lower than expected",
                    "vi": "không tốt; có chất lượng thấp hoặc thấp hơn mong đợi"
                },
                "examples": [
                    {
                        "en": "the party’s poor performance in the election",
                        "vi": "thành tích kém của đảng trong cuộc bầu cử"
                    },
                    {
                        "en": "The food was of very poor quality.",
                        "vi": "Thức ăn có chất lượng rất kém."
                    },
                    {
                        "en": "She's been in poor health for some time now.",
                        "vi": "Cô ấy có sức khỏe kém một thời gian rồi."
                    },
                    {
                        "en": "The cottage was in poor physical condition.",
                        "vi": "Ngôi nhà tranh trong tình trạng vật chất tồi tệ."
                    },
                    {
                        "en": "It was raining heavily and visibility was poor.",
                        "vi": "Trời mưa to và tầm nhìn kém."
                    },
                    {
                        "en": "poor food/light/soil",
                        "vi": "thức ăn nghèo nàn / ánh sáng / đất"
                    },
                    {
                        "en": "to have a poor opinion of somebody (= to not think well of somebody)",
                        "vi": "có ý kiến không tốt về ai đó (= không nghĩ tốt về ai đó)"
                    }
                ]
            },
            {
                "define": {
                    "en": "not good at something",
                    "vi": "không giỏi một cái gì đó"
                },
                "examples": [
                    {
                        "en": "a poor swimmer",
                        "vi": "một vận động viên bơi lội kém"
                    },
                    {
                        "en": "a poor judge of character",
                        "vi": "một thẩm phán kém về tính cách"
                    },
                    {
                        "en": "She's a good teacher but a poor manager.",
                        "vi": "Cô ấy là một giáo viên giỏi nhưng là một người quản lý kém."
                    },
                    {
                        "en": "a poor sailor (= somebody who easily gets sick at sea)",
                        "vi": "một thủy thủ nghèo (= ai đó dễ bị ốm trên biển)"
                    },
                    {
                        "en": "poor at (doing) something Many companies are poor at dealing with telephone complaints.",
                        "vi": "kém trong (làm) việc gì đó Nhiều công ty kém trong việc giải quyết các khiếu nại qua điện thoại."
                    }
                ]
            },
            {
                "define": {
                    "en": "having very small amounts of something",
                    "vi": "có một số lượng rất nhỏ của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "a country poor in natural resources",
                        "vi": "một đất nước nghèo tài nguyên thiên nhiên"
                    },
                    {
                        "en": "soil poor in nutrients",
                        "vi": "đất nghèo dinh dưỡng"
                    },
                    {
                        "en": "There's very little soil here and it's poor in quality.",
                        "vi": "Ở đây có rất ít đất và chất lượng kém."
                    }
                ]
            },
            {
                "define": {
                    "en": "to finish a long way behind the winner in a race, competition, etc.",
                    "vi": "để hoàn thành một chặng đường dài phía sau người chiến thắng trong một cuộc đua, cuộc thi, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a person or thing that is similar to but of a lower quality than a particular famous person or thing",
                    "vi": "người hoặc vật tương tự nhưng chất lượng thấp hơn người hoặc vật nổi tiếng cụ thể"
                },
                "examples": [
                    {
                        "en": "Sparkling white wine is the poor man's champagne.",
                        "vi": "Rượu vang trắng sủi bọt là sâm panh của người nghèo."
                    }
                ]
            }
        ]
    },
    {
        "id": "90a3ed42dcdf442c9e094e8451b005ff",
        "word": "problem",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/ˈprɒbləm/",
            "us": "/ˈprɑːbləm/"
        },
        "nearby": [
            {
                "word": "probiotic",
                "pos": "adjective"
            },
            {
                "word": "probity",
                "pos": "noun"
            },
            {
                "word": "problem",
                "pos": "noun"
            },
            {
                "word": "problem",
                "pos": "adjective"
            },
            {
                "word": "problematic",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a thing that is difficult to deal with or to understand",
                    "vi": "một điều khó giải quyết hoặc khó hiểu"
                },
                "examples": [
                    {
                        "en": "big/serious/major problems",
                        "vi": "vấn đề lớn / nghiêm trọng / lớn"
                    },
                    {
                        "en": "She has a lot of health problems.",
                        "vi": "Cô ấy gặp rất nhiều vấn đề về sức khỏe."
                    },
                    {
                        "en": "financial/social/technical problems",
                        "vi": "vấn đề tài chính / xã hội / kỹ thuật"
                    },
                    {
                        "en": "Let me know if you have any problems.",
                        "vi": "Hãy cho tôi biết nếu bạn có bất kỳ vấn đề."
                    },
                    {
                        "en": "The government must address the problem of child poverty.",
                        "vi": "Chính phủ phải giải quyết vấn đề trẻ em nghèo."
                    },
                    {
                        "en": "We cannot tackle this problem effectively on our own.",
                        "vi": "Chúng ta không thể tự mình giải quyết vấn đề này một cách hiệu quả."
                    },
                    {
                        "en": "We are dealing with a serious problem here.",
                        "vi": "Chúng tôi đang giải quyết một vấn đề nghiêm trọng ở đây."
                    },
                    {
                        "en": "Money isn't going to solve the problem.",
                        "vi": "Tiền sẽ không giải quyết được vấn đề."
                    },
                    {
                        "en": "(especially North American English) to fix a problem",
                        "vi": "(đặc biệt là tiếng Anh Bắc Mỹ) để khắc phục sự cố"
                    },
                    {
                        "en": "If he chooses Mary it's bound to cause problems.",
                        "vi": "Nếu anh ta chọn Mary, điều đó chắc chắn sẽ gây ra vấn đề."
                    },
                    {
                        "en": "to pose/create a problem",
                        "vi": "đặt ra / tạo ra một vấn đề"
                    },
                    {
                        "en": "The problem first arose in 2018.",
                        "vi": "Vấn đề lần đầu tiên phát sinh vào năm 2018."
                    },
                    {
                        "en": "problem with something There is a problem with this argument.",
                        "vi": "vấn đề với một cái gì đó Có một vấn đề với đối số này."
                    },
                    {
                        "en": "problem of something the problem of drug abuse",
                        "vi": "vấn đề gì đó vấn đề lạm dụng ma túy"
                    },
                    {
                        "en": "problem of doing something Most students face the problem of funding themselves while they are studying.",
                        "vi": "vấn đề của việc làm gì đó Hầu hết sinh viên phải đối mặt với vấn đề kinh phí của chính họ trong khi họ đang học."
                    },
                    {
                        "en": "problem for somebody Unemployment is a very real problem for graduates now.",
                        "vi": "vấn đề đối với ai đó Thất nghiệp là một vấn đề rất thực tế đối với sinh viên mới tốt nghiệp hiện nay."
                    },
                    {
                        "en": "It’s a nice table! The only problem is (that) it’s too big for our room.",
                        "vi": "Đó là một cái bàn đẹp! Vấn đề duy nhất là (đó) nó quá lớn đối với căn phòng của chúng tôi."
                    },
                    {
                        "en": "Part of the problem is the shape of the room.",
                        "vi": "Một phần của vấn đề là hình dạng của căn phòng."
                    },
                    {
                        "en": "Stop worrying about their marriage—it isn't your problem.",
                        "vi": "Đừng lo lắng về cuộc hôn nhân của họ - đó không phải là vấn đề của bạn."
                    },
                    {
                        "en": "There's no history of heart problems (= disease connected with the heart) in our family.",
                        "vi": "Không có tiền sử bệnh tim (= bệnh liên quan đến tim) trong gia đình chúng tôi."
                    },
                    {
                        "en": "the magazine’s problem page (= containing letters about readers’ problems and advice about how to solve them)",
                        "vi": "trang vấn đề của tạp chí (= chứa các bức thư về các vấn đề của độc giả và lời khuyên về cách giải quyết chúng)"
                    }
                ]
            },
            {
                "define": {
                    "en": "a question that can be answered by using logical thought or mathematics",
                    "vi": "một câu hỏi có thể được trả lời bằng cách sử dụng tư duy logic hoặc toán học"
                },
                "examples": [
                    {
                        "en": "mathematical problems",
                        "vi": "vấn đề toán học"
                    },
                    {
                        "en": "to find the answer to the problem",
                        "vi": "để tìm câu trả lời cho vấn đề"
                    },
                    {
                        "en": "The teacher set us 50 problems to do.",
                        "vi": "Giáo viên đặt ra cho chúng tôi 50 bài toán phải làm."
                    },
                    {
                        "en": "I have five problems to do for homework.",
                        "vi": "Tôi có năm vấn đề phải làm cho bài tập về nhà."
                    }
                ]
            },
            {
                "define": {
                    "en": "to disagree with or object to something/somebody",
                    "vi": "không đồng ý với hoặc phản đối điều gì đó / ai đó"
                },
                "examples": [
                    {
                        "en": "I have no problem with you working at home tomorrow.",
                        "vi": "Tôi không có vấn đề gì với bạn làm việc ở nhà vào ngày mai."
                    },
                    {
                        "en": "(informal) We are going to do this my way. Do you have a problem with that? (= showing that you are impatient with the person that you are speaking to)",
                        "vi": "(không chính thức) Chúng tôi sẽ làm điều này theo cách của tôi. Bạn đã có một vấn đề với điều đó? (= cho thấy bạn không kiên nhẫn với người mà bạn đang nói chuyện)"
                    },
                    {
                        "en": "Do you have a problem with her?",
                        "vi": "Bạn có vấn đề với cô ấy?"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to show that you do not care about somebody else’s difficulties",
                    "vi": "được sử dụng để cho thấy rằng bạn không quan tâm đến khó khăn của người khác"
                },
                "examples": [
                    {
                        "en": "If they can't afford to go, that's not my problem.",
                        "vi": "Nếu họ không đủ khả năng để đi, đó không phải là vấn đề của tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to show that you are happy to help somebody or that something will be easy to do",
                    "vi": "được sử dụng để thể hiện rằng bạn rất vui khi được giúp đỡ ai đó hoặc điều gì đó sẽ dễ dàng thực hiện"
                },
                "examples": [
                    {
                        "en": "‘Can I pay by credit card?’ ‘Yes, no problem.’",
                        "vi": "Tôi có thể trả bằng thẻ tín dụng?' 'Ừ, không vấn đề gì.'"
                    }
                ]
            },
            {
                "define": {
                    "en": "used after somebody has thanked you or said they are sorry for something",
                    "vi": "được sử dụng sau khi ai đó đã cảm ơn bạn hoặc nói rằng họ xin lỗi vì điều gì đó"
                },
                "examples": [
                    {
                        "en": "‘Thanks for the ride.’ ‘No problem.’",
                        "vi": "Cảm ơn vì cho đi nhờ.' 'Không có gì.'"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to show that you think a person should deal with their own difficulties",
                    "vi": "được sử dụng để cho thấy rằng bạn nghĩ rằng một người nên đối phó với những khó khăn của chính họ"
                },
                "examples": [
                    {
                        "en": "‘My parents will be furious!’ ‘That’s your problem.’",
                        "vi": "Bố mẹ tôi sẽ rất tức giận!' 'Đó là vấn đề của bạn.'"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to show that you think somebody is being unreasonable",
                    "vi": "được sử dụng để cho thấy rằng bạn nghĩ rằng ai đó đang vô lý"
                },
                "examples": [
                    {
                        "en": "What's your problem?—I only asked if you could help me for ten minutes.",
                        "vi": "Vấn đề của bạn là gì? —Tôi chỉ hỏi nếu bạn có thể giúp tôi trong vòng mười phút."
                    }
                ]
            }
        ]
    },
    {
        "id": "ce25354d7e5c49eea7e5ed2bbd8bc866",
        "word": "poverty",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈpɒvəti/",
            "us": "/ˈpɑːvərti/"
        },
        "nearby": [
            {
                "word": "poutine",
                "pos": "noun"
            },
            {
                "word": "pouty",
                "pos": "adjective"
            },
            {
                "word": "poverty",
                "pos": "noun"
            },
            {
                "word": "the poverty line",
                "pos": "noun"
            },
            {
                "word": "poverty-stricken",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the state of being poor",
                    "vi": "tình trạng nghèo nàn"
                },
                "examples": [
                    {
                        "en": "conditions of extreme/abject poverty",
                        "vi": "điều kiện cực đoan / nghèo đói"
                    },
                    {
                        "en": "to alleviate poverty",
                        "vi": "xóa đói giảm nghèo"
                    },
                    {
                        "en": "in poverty Many elderly people live in poverty.",
                        "vi": "trong tình trạng nghèo đói Nhiều người cao tuổi sống trong cảnh nghèo đói."
                    },
                    {
                        "en": "For him music was the way out of poverty.",
                        "vi": "Đối với anh, âm nhạc là con đường thoát nghèo."
                    },
                    {
                        "en": "He was born into poverty and political chaos.",
                        "vi": "Ông sinh ra trong cảnh nghèo đói và hỗn loạn chính trị."
                    },
                    {
                        "en": "More than 1.5 million Americans fell into poverty last year.",
                        "vi": "Hơn 1,5 triệu người Mỹ rơi vào cảnh nghèo đói vào năm ngoái."
                    },
                    {
                        "en": "The government is aiming to reduce child poverty (= the number of children living below the poverty line).",
                        "vi": "Chính phủ đang hướng tới mục tiêu giảm nghèo ở trẻ em (= số trẻ em sống dưới mức nghèo khổ)."
                    },
                    {
                        "en": "to tackle/combat/fight poverty",
                        "vi": "để giải quyết / chiến đấu / chống lại đói nghèo"
                    },
                    {
                        "en": "to escape/flee poverty",
                        "vi": "thoát khỏi nghèo đói"
                    }
                ]
            },
            {
                "define": {
                    "en": "a lack of something; poor quality",
                    "vi": "thiếu một cái gì đó; chất lượng kém"
                },
                "examples": [
                    {
                        "en": "There is a poverty of colour in her work.",
                        "vi": "Có một sự nghèo nàn về màu sắc trong công việc của cô ấy."
                    },
                    {
                        "en": "His work displays a poverty of imagination.",
                        "vi": "Công việc của anh ấy thể hiện sự nghèo nàn về trí tưởng tượng."
                    }
                ]
            }
        ]
    },
    {
        "id": "918fae46bab440ef88fcc03aa5b1c788",
        "word": "beg",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/beɡ/",
            "us": "/beɡ/"
        },
        "nearby": [
            {
                "word": "befriend",
                "pos": "verb"
            },
            {
                "word": "befuddled",
                "pos": "adjective"
            },
            {
                "word": "beg",
                "pos": "verb"
            },
            {
                "word": "begad",
                "pos": "exclamation"
            },
            {
                "word": "began",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to ask somebody for something especially in an anxious way because you want or need it very much",
                    "vi": "để hỏi ai đó về điều gì đó đặc biệt là một cách lo lắng bởi vì bạn muốn hoặc rất cần nó"
                },
                "examples": [
                    {
                        "en": "Now you have to beg and plead.",
                        "vi": "Bây giờ bạn phải cầu xin và cầu xin."
                    },
                    {
                        "en": "beg for something He wants to see them beg for mercy.",
                        "vi": "cầu xin điều gì đó Ngài muốn thấy họ cầu xin lòng thương xót."
                    },
                    {
                        "en": "beg somebody for something They begged him for help.",
                        "vi": "cầu xin ai đó cho một cái gì đó Họ cầu xin anh ta giúp đỡ."
                    },
                    {
                        "en": "beg somebody Forgive me, I beg you!",
                        "vi": "cầu xin ai đó Thứ lỗi cho tôi, tôi cầu xin bạn!"
                    },
                    {
                        "en": "beg something She begged permission to leave.",
                        "vi": "cầu xin một cái gì đó Cô ấy xin phép được rời đi."
                    },
                    {
                        "en": "beg something of/from somebody I managed to beg a lift from a passing motorist.",
                        "vi": "cầu xin một cái gì đó của / từ một người nào đó Tôi đã cố gắng cầu xin một sự nâng đỡ từ một người lái xe đi qua."
                    },
                    {
                        "en": "Can I beg a favour of you?",
                        "vi": "Tôi có thể cầu xin một đặc ân của bạn?"
                    },
                    {
                        "en": "beg (somebody) + speech ‘Give me one more chance,’ he begged (her).",
                        "vi": "cầu xin (ai đó) + bài phát biểu 'Hãy cho tôi một cơ hội nữa,' anh ấy cầu xin (cô ấy)."
                    },
                    {
                        "en": "beg somebody to do something She begged him not to go.",
                        "vi": "cầu xin ai đó làm điều gì đó Cô cầu xin anh ta đừng đi."
                    },
                    {
                        "en": "beg to do something He begged to be told the truth.",
                        "vi": "cầu xin để làm điều gì đó Ông cầu xin để được nói sự thật."
                    },
                    {
                        "en": "beg that… (formal) She begged that she be allowed to go.",
                        "vi": "cầu xin điều đó… (trang trọng) Cô ấy cầu xin rằng cô ấy được phép đi."
                    },
                    {
                        "en": "(British English also) She begged that she should be allowed to go.",
                        "vi": "(Anh Anh cũng vậy) Cô ấy cầu xin rằng cô ấy nên được phép đi."
                    },
                    {
                        "en": "beg of somebody (formal) Don't leave me here, I beg of you!",
                        "vi": "cầu xin của ai đó (trang trọng) Đừng bỏ tôi ở đây, tôi cầu xin bạn!"
                    },
                    {
                        "en": "beg somebody's something I have come to apologize and to beg your forgiveness.",
                        "vi": "cầu xin ai đó là điều mà tôi đã đến để xin lỗi và cầu xin sự tha thứ của bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to ask somebody for money, food, etc., especially in the street",
                    "vi": "để yêu cầu ai đó cho tiền, thức ăn, v.v., đặc biệt là trên đường phố"
                },
                "examples": [
                    {
                        "en": "London is full of homeless people begging in the streets.",
                        "vi": "London đầy rẫy những người vô gia cư ăn xin trên đường phố."
                    },
                    {
                        "en": "a begging letter (= one that asks somebody for money)",
                        "vi": "một lá thư van xin (= một lá thư yêu cầu ai đó cho tiền)"
                    },
                    {
                        "en": "a begging bowl (= used to beg for money with)",
                        "vi": "một cái bát ăn xin (= dùng để xin tiền bằng)"
                    },
                    {
                        "en": "beg for something The children were begging for food.",
                        "vi": "cầu xin một cái gì đó Những đứa trẻ đã xin ăn."
                    },
                    {
                        "en": "beg for something from somebody They will have to beg for money from tourists.",
                        "vi": "cầu xin một cái gì đó từ ai đó Họ sẽ phải cầu xin tiền từ khách du lịch."
                    },
                    {
                        "en": "beg something from somebody We managed to beg a meal from the cafe owner.",
                        "vi": "cầu xin điều gì đó từ ai đó Chúng tôi đã cố gắng cầu xin một bữa ăn từ chủ quán cà phê."
                    },
                    {
                        "en": "beg something They went off to beg food.",
                        "vi": "cầu xin một cái gì đó Họ đã đi xin ăn."
                    }
                ]
            },
            {
                "define": {
                    "en": "if a dog begs, it sits on its back legs with its front legs in the air, waiting to be given something",
                    "vi": "nếu một con chó cầu xin, nó sẽ ngồi trên hai chân sau và hai chân trước trên không, chờ được cho một thứ gì đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to ask somebody for permission to do something",
                    "vi": "để xin phép ai đó làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "I beg leave to add a few comments of my own.",
                        "vi": "Tôi xin phép để lại để thêm một vài nhận xét của riêng tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "if something is going begging, it is available because nobody else wants it",
                    "vi": "nếu một cái gì đó đang ăn xin, nó có sẵn bởi vì không ai khác muốn nó"
                },
                "examples": [
                    {
                        "en": "I’ll have that last cake if it’s going begging.",
                        "vi": "Tôi sẽ có chiếc bánh cuối cùng đó nếu nó đi ăn xin."
                    }
                ]
            },
            {
                "define": {
                    "en": "to ask somebody to forgive you for something you have said or done",
                    "vi": "để yêu cầu ai đó tha thứ cho bạn vì điều gì đó bạn đã nói hoặc làm"
                },
                "examples": [
                    {
                        "en": "He returned to beg her pardon for his sudden outburst.",
                        "vi": "Anh quay lại cầu xin cô tha thứ cho hành động bộc phát đột ngột của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody want to ask a question that has not yet been answered",
                    "vi": "để khiến ai đó muốn hỏi một câu hỏi chưa được trả lời"
                },
                "examples": [
                    {
                        "en": "All of which begs the question as to who will fund the project.",
                        "vi": "Tất cả những điều đó đặt ra câu hỏi là ai sẽ tài trợ cho dự án."
                    }
                ]
            },
            {
                "define": {
                    "en": "to talk about something as if it were definitely true, even though it might not be",
                    "vi": "để nói về điều gì đó như thể nó chắc chắn là sự thật, mặc dù nó có thể không"
                },
                "examples": [
                    {
                        "en": "These assumptions beg the question that children learn languages more easily than adults.",
                        "vi": "Những giả định này đặt ra câu hỏi rằng trẻ em học ngôn ngữ dễ dàng hơn người lớn."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to tell somebody that you are sorry for something you have said or done",
                    "vi": "được sử dụng để nói với ai đó rằng bạn xin lỗi vì điều gì đó bạn đã nói hoặc làm"
                },
                "examples": [
                    {
                        "en": "I beg your pardon, I thought that was my coat.",
                        "vi": "Tôi cầu xin sự tha thứ của bạn, tôi đã nghĩ rằng đó là áo khoác của tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to ask somebody to repeat what they have just said because you did not hear",
                    "vi": "từng yêu cầu ai đó lặp lại những gì họ vừa nói bởi vì bạn không nghe thấy"
                },
                "examples": [
                    {
                        "en": "‘It's on Duke Street.’ ‘I beg your pardon.’ ‘Duke Street.’",
                        "vi": "Nó ở phố Duke. 'Tôi cầu xin sự thứ lỗi của bạn.' 'Phố Duke.'"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to tell somebody that you are offended by what they have just said or by the way that they have said it",
                    "vi": "được sử dụng để nói với ai đó rằng bạn bị xúc phạm bởi những gì họ vừa nói hoặc bằng cách họ đã nói điều đó"
                },
                "examples": [
                    {
                        "en": "‘Just go away.’ ‘I beg your pardon!’",
                        "vi": "Cứ đi đi. 'Tôi cầu xin sự thứ lỗi của bạn!'"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say politely that you do not agree with something that has just been said",
                    "vi": "được sử dụng để nói một cách lịch sự rằng bạn không đồng ý với điều gì đó vừa được nói"
                },
                "examples": [
                    {
                        "en": "‘At least she is good at her job.’ ‘Oh, I beg to differ.’",
                        "vi": "Ít nhất thì cô ấy cũng làm tốt công việc của mình.' 'Ồ, tôi cầu xin sự khác biệt.'"
                    }
                ]
            }
        ]
    },
    {
        "id": "975c8865041042adb3d19acddee92bb2",
        "word": "beggar",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈbeɡə(r)/",
            "us": "/ˈbeɡər/"
        },
        "nearby": [
            {
                "word": "beget",
                "pos": "verb"
            },
            {
                "word": "begetter",
                "pos": "noun"
            },
            {
                "word": "beggar",
                "pos": "noun"
            },
            {
                "word": "beggar",
                "pos": "verb"
            },
            {
                "word": "beggarly",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who lives by asking people for money or food",
                    "vi": "một người sống bằng cách xin tiền hoặc thức ăn của mọi người"
                },
                "examples": [
                    {
                        "en": "beggars sleeping on the pavement",
                        "vi": "người ăn xin ngủ trên vỉa hè"
                    }
                ]
            },
            {
                "define": {
                    "en": "used with an adjective to describe somebody in a particular way",
                    "vi": "được sử dụng với một tính từ để mô tả ai đó theo một cách cụ thể"
                },
                "examples": [
                    {
                        "en": "Aren't you dressed yet, you lazy beggar?",
                        "vi": "Anh vẫn chưa mặc quần áo sao, đồ ăn xin lười biếng?"
                    }
                ]
            },
            {
                "define": {
                    "en": "people say beggars can’t be choosers when there is no choice and somebody must be satisfied with what is available",
                    "vi": "người ta nói người ăn xin không thể là người lựa chọn khi không có sự lựa chọn và ai đó phải hài lòng với những gì hiện có"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "wishing for something does not make it happen",
                    "vi": "ước gì điều gì đó không thành hiện thực"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "09b0209ddc3f416cac890b5b275526a5",
        "word": "child labour",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˌtʃaɪld ˈleɪbə(r)/",
            "us": "/ˌtʃaɪld ˈleɪbər/"
        },
        "nearby": [
            {
                "word": "childishly",
                "pos": "adverb"
            },
            {
                "word": "childishness",
                "pos": "noun"
            },
            {
                "word": "child labour",
                "pos": "noun"
            },
            {
                "word": "childless",
                "pos": "adjective"
            },
            {
                "word": "childlike",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the employment of children in an industry or business, especially when it is illegal",
                    "vi": "sử dụng trẻ em trong một ngành công nghiệp hoặc doanh nghiệp, đặc biệt là khi việc làm đó là bất hợp pháp"
                },
                "examples": [
                    {
                        "en": "Although child labour is illegal in this country, the laws are not enforced.",
                        "vi": "Mặc dù lao động trẻ em là bất hợp pháp ở quốc gia này, nhưng luật không được thực thi."
                    }
                ]
            }
        ]
    },
    {
        "id": "c3af359fde2a4fd2893c99ff2a6847b6",
        "word": "famine",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈfæmɪn/",
            "us": "/ˈfæmɪn/"
        },
        "nearby": [
            {
                "word": "family tree",
                "pos": "noun"
            },
            {
                "word": "family values",
                "pos": "noun"
            },
            {
                "word": "famine",
                "pos": "noun"
            },
            {
                "word": "famished",
                "pos": "adjective"
            },
            {
                "word": "famous",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a lack of food during a long period of time in a region",
                    "vi": "thiếu lương thực trong một thời gian dài ở một vùng"
                },
                "examples": [
                    {
                        "en": "a severe famine",
                        "vi": "một nạn đói nghiêm trọng"
                    },
                    {
                        "en": "disasters such as floods and famine",
                        "vi": "thiên tai như lũ lụt và nạn đói"
                    },
                    {
                        "en": "the threat of widespread famine in the area",
                        "vi": "mối đe dọa của nạn đói lan rộng trong khu vực"
                    },
                    {
                        "en": "to raise money for famine relief",
                        "vi": "quyên góp tiền cứu trợ nạn đói"
                    }
                ]
            }
        ]
    },
    {
        "id": "120b03e7578a44f6afc2b79248381e54",
        "word": "homeless",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈhəʊmləs/",
            "us": "/ˈhəʊmləs/"
        },
        "nearby": [
            {
                "word": "homeland",
                "pos": "noun"
            },
            {
                "word": "homeland security",
                "pos": "noun"
            },
            {
                "word": "homeless",
                "pos": "adjective"
            },
            {
                "word": "homelessness",
                "pos": "noun"
            },
            {
                "word": "home loan",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "having no home, and therefore typically living on the streets",
                    "vi": "không có nhà và do đó thường sống trên đường phố"
                },
                "examples": [
                    {
                        "en": "The scheme has been set up to help homeless people.",
                        "vi": "Chương trình đã được thành lập để giúp đỡ những người vô gia cư."
                    },
                    {
                        "en": "The local authority ruled that he had made himself intentionally homeless and was therefore not entitled to be rehoused.",
                        "vi": "Chính quyền địa phương đã phán quyết rằng anh ta đã cố ý biến mình thành vô gia cư và do đó không được phép sử dụng lại."
                    },
                    {
                        "en": "Three hundred people were left homeless by the earthquake.",
                        "vi": "Ba trăm người mất nhà cửa do trận động đất."
                    }
                ]
            },
            {
                "define": {
                    "en": "people who have no home",
                    "vi": "những người không có nhà"
                },
                "examples": [
                    {
                        "en": "helping the homeless",
                        "vi": "giúp đỡ người vô gia cư"
                    }
                ]
            }
        ]
    },
    {
        "id": "d596e8a93700470e897cbd5daa2120d7",
        "word": "hunger",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈhʌŋɡə(r)/",
            "us": "/ˈhʌŋɡər/"
        },
        "nearby": [
            {
                "word": "Hungarian",
                "pos": "noun, adjective"
            },
            {
                "word": "Hungary",
                "pos": "noun"
            },
            {
                "word": "hunger",
                "pos": "noun"
            },
            {
                "word": "hunger",
                "pos": "verb"
            },
            {
                "word": "hunger after",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the state of not having enough food to eat, especially when this causes illness or death",
                    "vi": "tình trạng không có đủ thức ăn để ăn, đặc biệt khi điều này gây ra bệnh tật hoặc tử vong"
                },
                "examples": [
                    {
                        "en": "Around fifty people die of hunger every day in the camp.",
                        "vi": "Khoảng năm mươi người chết đói mỗi ngày trong trại."
                    },
                    {
                        "en": "The organization works to alleviate world hunger and disease.",
                        "vi": "Tổ chức này hoạt động để giảm bớt nạn đói và bệnh tật trên thế giới."
                    }
                ]
            },
            {
                "define": {
                    "en": "the feeling caused by a need to eat",
                    "vi": "cảm giác do nhu cầu ăn uống"
                },
                "examples": [
                    {
                        "en": "If you feel hunger pangs between meals, eat some fruit or nuts.",
                        "vi": "Nếu bạn cảm thấy đói giữa các bữa ăn, hãy ăn một số loại trái cây hoặc các loại hạt."
                    },
                    {
                        "en": "I felt faint with hunger.",
                        "vi": "Tôi cảm thấy muốn xỉu vì đói."
                    }
                ]
            },
            {
                "define": {
                    "en": "a strong desire for something",
                    "vi": "một mong muốn mạnh mẽ cho một cái gì đó"
                },
                "examples": [
                    {
                        "en": "She has an insatiable hunger for knowledge.",
                        "vi": "Cô ấy khao khát kiến thức vô độ."
                    },
                    {
                        "en": "Nothing seemed to satisfy their hunger for truth.",
                        "vi": "Dường như không có gì có thể làm họ thỏa mãn cơn đói sự thật."
                    }
                ]
            }
        ]
    },
    {
        "id": "e4a6416545024eb888cb08b123459f71",
        "word": "low-paid",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/ˌləʊ ˈpeɪd/",
            "us": "/ˌləʊ ˈpeɪd/"
        },
        "nearby": [
            {
                "word": "low-lying",
                "pos": "adjective"
            },
            {
                "word": "low-maintenance",
                "pos": "adjective"
            },
            {
                "word": "low-paid",
                "pos": "adjective"
            },
            {
                "word": "low-pitched",
                "pos": "adjective"
            },
            {
                "word": "low point",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "earning or providing very little money",
                    "vi": "kiếm được hoặc cung cấp rất ít tiền"
                },
                "examples": [
                    {
                        "en": "low-paid workers",
                        "vi": "công nhân lương thấp"
                    },
                    {
                        "en": "It is one of the lowest-paid jobs.",
                        "vi": "Đây là một trong những công việc được trả lương thấp nhất."
                    }
                ]
            }
        ]
    },
    {
        "id": "d0df1e94405748678f3438adb24d790a",
        "word": "quality of life",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˌkwɒləti əv ˈlaɪf/",
            "us": "/ˌkwɑːləti əv ˈlaɪf/"
        },
        "nearby": [
            {
                "word": "quality control",
                "pos": "noun"
            },
            {
                "word": "quality newspaper",
                "pos": "noun"
            },
            {
                "word": "quality of life",
                "pos": "noun"
            },
            {
                "word": "quality time",
                "pos": "noun"
            },
            {
                "word": "qualm",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the level of health, comfort and happiness that a particular person or group has",
                    "vi": "mức độ sức khỏe, sự thoải mái và hạnh phúc mà một người hoặc một nhóm cụ thể có"
                },
                "examples": [
                    {
                        "en": "Their quality of life improved dramatically when they moved to France.",
                        "vi": "Chất lượng cuộc sống của họ được cải thiện đáng kể khi họ chuyển đến Pháp."
                    },
                    {
                        "en": "He gave up his high-flying job and now enjoys a better quality of life.",
                        "vi": "Anh ấy đã từ bỏ công việc bay bổng của mình và hiện đang tận hưởng cuộc sống chất lượng hơn."
                    }
                ]
            }
        ]
    },
    {
        "id": "ec0b934cc0184547952d1b21b858c63c",
        "word": "slum",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/slʌm/",
            "us": "/slʌm/"
        },
        "nearby": [
            {
                "word": "sluice",
                "pos": "noun"
            },
            {
                "word": "sluice",
                "pos": "verb"
            },
            {
                "word": "slum",
                "pos": "noun"
            },
            {
                "word": "slum",
                "pos": "verb"
            },
            {
                "word": "slumber",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an area of a city that is very poor and where the houses are dirty and in bad condition",
                    "vi": "một khu vực của một thành phố rất nghèo và nơi những ngôi nhà bẩn thỉu và tồi tệ"
                },
                "examples": [
                    {
                        "en": "a slum area",
                        "vi": "một khu ổ chuột"
                    },
                    {
                        "en": "city/urban slums",
                        "vi": "thành phố / khu ổ chuột đô thị"
                    },
                    {
                        "en": "She was brought up in the slums of Leeds.",
                        "vi": "Cô được nuôi dưỡng trong khu ổ chuột của Leeds."
                    },
                    {
                        "en": "slum clearance schemes",
                        "vi": "chương trình giải tỏa khu ổ chuột"
                    },
                    {
                        "en": "a plan to rehouse slum dwellers",
                        "vi": "một kế hoạch để xây dựng lại những cư dân ổ chuột"
                    },
                    {
                        "en": "a kid from the slums",
                        "vi": "một đứa trẻ từ khu ổ chuột"
                    },
                    {
                        "en": "born in the slums of East London",
                        "vi": "sinh ra ở khu ổ chuột ở phía đông London"
                    }
                ]
            }
        ]
    },
    {
        "id": "e4ab4ff0c86c4977a30aa089e144b36d",
        "word": "standard of living",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˌstændəd əv ˈlɪvɪŋ/",
            "us": "/ˌstændərd əv ˈlɪvɪŋ/"
        },
        "nearby": [
            {
                "word": "standardize",
                "pos": "verb"
            },
            {
                "word": "standard lamp",
                "pos": "noun"
            },
            {
                "word": "standard of living",
                "pos": "noun"
            },
            {
                "word": "Standard Oil",
                "pos": ""
            },
            {
                "word": "standard time",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the amount of money and level of comfort that a particular person or group has",
                    "vi": "số tiền và mức độ thoải mái mà một người hoặc một nhóm cụ thể có"
                },
                "examples": [
                    {
                        "en": "As a result of the redundancies, most families suffered a fall in their standard of living.",
                        "vi": "Hậu quả của tình trạng dôi dư, hầu hết các gia đình đều bị giảm mức sống."
                    },
                    {
                        "en": "the fall in their standard of living caused by redundancy",
                        "vi": "mức sống của họ giảm do dư thừa"
                    },
                    {
                        "en": "a decent standard of living",
                        "vi": "một mức sống tốt"
                    }
                ]
            }
        ]
    },
    {
        "id": "8ee5d58d3dd0470eb70f713f32a837f9",
        "word": "starve",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/stɑːv/",
            "us": "/stɑːrv/"
        },
        "nearby": [
            {
                "word": "star turn",
                "pos": "noun"
            },
            {
                "word": "starvation",
                "pos": "noun"
            },
            {
                "word": "starve",
                "pos": "verb"
            },
            {
                "word": "starve into",
                "pos": "phrasal verb"
            },
            {
                "word": "starve into doing",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to suffer or die because you do not have enough food to eat; to make somebody suffer or die in this way",
                    "vi": "đau khổ hoặc chết vì bạn không có đủ thức ăn để ăn; làm cho ai đó đau khổ hoặc chết theo cách này"
                },
                "examples": [
                    {
                        "en": "The animals were left to starve to death.",
                        "vi": "Những con vật bị bỏ đói cho đến chết."
                    },
                    {
                        "en": "pictures of starving children",
                        "vi": "hình ảnh trẻ em chết đói"
                    },
                    {
                        "en": "The new job doesn't pay as much but we won't starve!",
                        "vi": "Công việc mới không được trả nhiều nhưng chúng tôi sẽ không chết đói!"
                    },
                    {
                        "en": "starve somebody/yourself She's starving herself to try to lose weight.",
                        "vi": "bỏ đói ai đó / chính mình Cô ấy đang bỏ đói bản thân để cố gắng giảm cân."
                    },
                    {
                        "en": "Many of the prisoners looked half starved.",
                        "vi": "Nhiều tù nhân trông chết đói một nửa."
                    }
                ]
            },
            {
                "define": {
                    "en": "not having something that you need",
                    "vi": "không có một cái gì đó mà bạn cần"
                },
                "examples": [
                    {
                        "en": "supply-starved rebels",
                        "vi": "những kẻ nổi loạn bị bỏ đói bởi nguồn cung cấp"
                    }
                ]
            },
            {
                "define": {
                    "en": "to feel very hungry",
                    "vi": "cảm thấy rất đói"
                },
                "examples": [
                    {
                        "en": "When's the food coming? I'm starving!",
                        "vi": "Khi nào đồ ăn đến? Tôi đang đói!"
                    }
                ]
            }
        ]
    },
    {
        "id": "4cff1dfcd5904772a6e6cd14263c6253",
        "word": "depression",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/dɪˈpreʃn/",
            "us": "/dɪˈpreʃn/"
        },
        "nearby": [
            {
                "word": "depressing",
                "pos": "adjective"
            },
            {
                "word": "depressingly",
                "pos": "adverb"
            },
            {
                "word": "depression",
                "pos": "noun"
            },
            {
                "word": "the Depression",
                "pos": ""
            },
            {
                "word": "depressive",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a medical condition in which a person feels very sad and anxious and often has physical symptoms such as being unable to sleep, etc.",
                    "vi": "Một tình trạng bệnh mà một người cảm thấy rất buồn và lo lắng và thường có các triệu chứng về thể chất như không thể ngủ, v.v."
                },
                "examples": [
                    {
                        "en": "She was diagnosed as having clinical depression.",
                        "vi": "Cô được chẩn đoán là mắc chứng trầm cảm lâm sàng."
                    },
                    {
                        "en": "She suffered from severe depression after losing her job.",
                        "vi": "Cô bị trầm cảm nặng sau khi mất việc."
                    }
                ]
            },
            {
                "define": {
                    "en": "the state of feeling very sad and without hope",
                    "vi": "trạng thái cảm thấy rất buồn và không có hy vọng"
                },
                "examples": [
                    {
                        "en": "There was a feeling of gloom and depression in the office when the news of the job cuts was announced.",
                        "vi": "Có một cảm giác u ám và chán nản trong văn phòng khi tin tức về việc cắt giảm việc làm được thông báo."
                    }
                ]
            },
            {
                "define": {
                    "en": "a period when there is little economic activity and many people are poor or without jobs",
                    "vi": "thời kỳ có ít hoạt động kinh tế và nhiều người nghèo hoặc không có việc làm"
                },
                "examples": [
                    {
                        "en": "The country was in the grip of (an) economic depression.",
                        "vi": "Đất nước đang trong vòng xoáy của (một) suy thoái kinh tế."
                    },
                    {
                        "en": "the great Depression of the 1930s",
                        "vi": "cuộc đại suy thoái những năm 1930"
                    },
                    {
                        "en": "He grew up during the Great Depression of the 1930s.",
                        "vi": "Ông lớn lên trong cuộc Đại suy thoái những năm 1930."
                    }
                ]
            },
            {
                "define": {
                    "en": "a part of a surface that is lower than the parts around it",
                    "vi": "một phần của bề mặt thấp hơn các phần xung quanh nó"
                },
                "examples": [
                    {
                        "en": "Rainwater collects in shallow depressions on the ground.",
                        "vi": "Nước mưa đọng lại ở những chỗ trũng nông trên mặt đất."
                    },
                    {
                        "en": "From the air, the photos show a shallow depression on the planet's surface.",
                        "vi": "Từ trên không, các bức ảnh cho thấy một vùng lõm nông trên bề mặt hành tinh."
                    }
                ]
            },
            {
                "define": {
                    "en": "a weather condition in which the pressure of the air becomes lower, often causing rain",
                    "vi": "một điều kiện thời tiết trong đó áp suất của không khí trở nên thấp hơn, thường gây ra mưa"
                },
                "examples": [
                    {
                        "en": "an atmospheric depression moving east from the Atlantic",
                        "vi": "một áp thấp khí quyển di chuyển về phía đông từ Đại Tây Dương"
                    }
                ]
            }
        ]
    },
    {
        "id": "c051d953d049464cb95a5c6617a2b5ed",
        "word": "disadvantaged",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌdɪsədˈvɑːntɪdʒd/",
            "us": "/ˌdɪsədˈvæntɪdʒd/"
        },
        "nearby": [
            {
                "word": "disadvantage",
                "pos": "verb"
            },
            {
                "word": "disadvantage",
                "pos": "noun"
            },
            {
                "word": "disadvantaged",
                "pos": "adjective"
            },
            {
                "word": "disadvantageous",
                "pos": "adjective"
            },
            {
                "word": "disaffected",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "not having the things, such as education, or enough money, that people need in order to succeed in life",
                    "vi": "không có những thứ, chẳng hạn như giáo dục, hoặc đủ tiền, mà mọi người cần để thành công trong cuộc sống"
                },
                "examples": [
                    {
                        "en": "disadvantaged groups/children",
                        "vi": "nhóm / trẻ em thiệt thòi"
                    },
                    {
                        "en": "a severely disadvantaged area",
                        "vi": "một khu vực khó khăn nghiêm trọng"
                    },
                    {
                        "en": "socially disadvantaged sections of the community",
                        "vi": "các bộ phận xã hội khó khăn của cộng đồng"
                    }
                ]
            },
            {
                "define": {
                    "en": "people who are disadvantaged",
                    "vi": "những người bị thiệt thòi"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "98884bb8d0cc4b86833d961f64dd6186",
        "word": "distress",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/dɪˈstres/",
            "us": "/dɪˈstres/"
        },
        "nearby": [
            {
                "word": "distractor",
                "pos": "noun"
            },
            {
                "word": "distraught",
                "pos": "adjective"
            },
            {
                "word": "distress",
                "pos": "noun"
            },
            {
                "word": "distress",
                "pos": "verb"
            },
            {
                "word": "distressed",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a feeling of great worry or unhappiness; great mental pain",
                    "vi": "cảm giác vô cùng lo lắng hoặc không vui; nỗi đau tinh thần lớn"
                },
                "examples": [
                    {
                        "en": "The newspaper article caused the actor considerable distress.",
                        "vi": "Bài báo trên báo đã khiến nam diễn viên xót xa đáng kể."
                    },
                    {
                        "en": "She sensed his deep emotional distress.",
                        "vi": "Cô cảm nhận được tình cảm sâu sắc của anh."
                    },
                    {
                        "en": "in distress She was obviously in distress after the attack.",
                        "vi": "gặp nạn Cô ấy rõ ràng đã gặp nạn sau cuộc tấn công."
                    }
                ]
            },
            {
                "define": {
                    "en": "severe problems caused by not having enough money, food, etc.",
                    "vi": "các vấn đề nghiêm trọng do không có đủ tiền, thức ăn, v.v."
                },
                "examples": [
                    {
                        "en": "economic/financial distress",
                        "vi": "khó khăn kinh tế / tài chính"
                    },
                    {
                        "en": "The charity aims to relieve poverty and distress caused by natural disasters.",
                        "vi": "Tổ chức từ thiện nhằm giảm bớt đói nghèo và khốn khó do thiên tai gây ra."
                    }
                ]
            },
            {
                "define": {
                    "en": "a situation in which a ship, plane, etc. is in danger or difficulty and needs help",
                    "vi": "một tình huống trong đó một con tàu, máy bay, v.v. đang gặp nguy hiểm hoặc khó khăn và cần được giúp đỡ"
                },
                "examples": [
                    {
                        "en": "a distress signal (= a message asking for help)",
                        "vi": "một tín hiệu cấp cứu (= một thông báo yêu cầu giúp đỡ)"
                    },
                    {
                        "en": "in distress It is a rule of the sea to help another boat in distress.",
                        "vi": "gặp nạn Đó là một quy luật của biển cả để giúp đỡ một con thuyền khác gặp nạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a state of physical pain and effort, especially difficulty in breathing",
                    "vi": "trạng thái đau đớn về thể chất và gắng sức, đặc biệt là khó thở"
                },
                "examples": [
                    {
                        "en": "The patient was suffering serious respiratory distress.",
                        "vi": "Bệnh nhân suy hô hấp nặng."
                    },
                    {
                        "en": "in distress The baby was clearly in distress.",
                        "vi": "gặp nạn Em bé rõ ràng đang gặp nạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a woman who needs help",
                    "vi": "một người phụ nữ cần giúp đỡ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "9e9f502a78374f959e3a6a03649180e5",
        "word": "food insecurity",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌfuːd ɪnsɪˈkjʊərəti/",
            "us": "/ˌfuːd ɪnsɪˈkjʊrəti/"
        },
        "nearby": [
            {
                "word": "foodie",
                "pos": "noun"
            },
            {
                "word": "foodie",
                "pos": "adjective"
            },
            {
                "word": "food insecurity",
                "pos": "noun"
            },
            {
                "word": "food mile",
                "pos": "noun"
            },
            {
                "word": "food pantry",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the state of not having reliable access to enough healthy food that you can afford",
                    "vi": "tình trạng không có khả năng tiếp cận đáng tin cậy với đủ thực phẩm lành mạnh mà bạn có thể mua được"
                },
                "examples": [
                    {
                        "en": "Households that experience food insecurity have reduced quality or variety of meals.",
                        "vi": "Các hộ gia đình xảy ra tình trạng mất an toàn vệ sinh thực phẩm thì bữa ăn bị giảm chất lượng hoặc đa dạng."
                    },
                    {
                        "en": "It is estimated 64 per cent of the population is already exposed to chronic food insecurity.",
                        "vi": "Theo ước tính, 64% dân số đã phải chịu cảnh mất an ninh lương thực thường xuyên."
                    }
                ]
            }
        ]
    },
    {
        "id": "0f2fe86ee7ee461ba1e6bf975e865f61",
        "word": "food security",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌfuːd sɪˈkjʊərəti/",
            "us": "/ˌfuːd sɪˈkjʊrəti/"
        },
        "nearby": [
            {
                "word": "The Food Programme",
                "pos": ""
            },
            {
                "word": "food science",
                "pos": "noun"
            },
            {
                "word": "food security",
                "pos": "noun"
            },
            {
                "word": "food stamp",
                "pos": "noun"
            },
            {
                "word": "the Food Standards Agency",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the state of having reliable access to enough healthy food that you can afford",
                    "vi": "tình trạng tiếp cận đáng tin cậy với đủ thực phẩm lành mạnh mà bạn có thể mua được"
                },
                "examples": [
                    {
                        "en": "The minister said that the proposed changes to the agriculture sector would ensure food security in the country.",
                        "vi": "Bộ trưởng nói rằng những thay đổi được đề xuất đối với ngành nông nghiệp sẽ đảm bảo an ninh lương thực của đất nước."
                    }
                ]
            }
        ]
    },
    {
        "id": "251716a02cba4467b92c226b44cff471",
        "word": "hardship",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈhɑːdʃɪp/",
            "us": "/ˈhɑːrdʃɪp/"
        },
        "nearby": [
            {
                "word": "hardscrabble",
                "pos": "adjective"
            },
            {
                "word": "hard sell",
                "pos": "noun"
            },
            {
                "word": "hardship",
                "pos": "noun"
            },
            {
                "word": "hard shoulder",
                "pos": "noun"
            },
            {
                "word": "Hard Times",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a situation that is difficult and unpleasant because you do not have enough money, food, clothes, etc.",
                    "vi": "một hoàn cảnh khó khăn và khó chịu vì bạn không có đủ tiền, thức ăn, quần áo, v.v."
                },
                "examples": [
                    {
                        "en": "economic/financial, etc. hardship",
                        "vi": "khó khăn về kinh tế / tài chính, v.v."
                    },
                    {
                        "en": "People suffered many hardships during that long winter.",
                        "vi": "Con người đã phải chịu nhiều gian khổ trong suốt mùa đông dài đằng đẵng đó."
                    },
                    {
                        "en": "The two men endured great hardship during their trek across Antarctica.",
                        "vi": "Hai người đàn ông đã phải chịu đựng rất nhiều khó khăn trong chuyến đi xuyên Nam Cực."
                    },
                    {
                        "en": "It was no hardship to walk home on such a lovely evening.",
                        "vi": "Không có gì khó khăn khi đi bộ về nhà vào một buổi tối tuyệt vời như thế này."
                    }
                ]
            }
        ]
    },
    {
        "id": "03eebef01a114101b519c7bf4ecb11ff",
        "word": "hard up",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌhɑːd ˈʌp/",
            "us": "/ˌhɑːrd ˈʌp/"
        },
        "nearby": [
            {
                "word": "Hard Times",
                "pos": ""
            },
            {
                "word": "hardtop",
                "pos": "noun"
            },
            {
                "word": "hard up",
                "pos": "adjective"
            },
            {
                "word": "hardware",
                "pos": "noun"
            },
            {
                "word": "hardware dealer",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "having very little money, especially for a short period of time",
                    "vi": "có rất ít tiền, đặc biệt là trong một khoảng thời gian ngắn"
                },
                "examples": [
                    {
                        "en": "They’re not really as hard up as they say they are.",
                        "vi": "Họ không thực sự khó khăn như họ nói."
                    },
                    {
                        "en": "After he lost his job he was so hard up he couldn’t afford the price of a beer.",
                        "vi": "Sau khi mất việc, anh ấy đã rất vất vả đến mức không thể mua nổi một cốc bia."
                    }
                ]
            },
            {
                "define": {
                    "en": "having nothing interesting to do, talk about, etc.",
                    "vi": "không có gì thú vị để làm, nói về, v.v."
                },
                "examples": [
                    {
                        "en": "‘You could always go out with Steve.’ ‘I'm not that hard up!’",
                        "vi": "Bạn luôn có thể hẹn hò với Steve.' 'Tôi không khó đến vậy!'"
                    },
                    {
                        "en": "The newspapers must be hard up for news if they’ve got to publish stories like that (= they must have very little real news).",
                        "vi": "Các tờ báo phải khó đưa tin nếu họ phải đăng những câu chuyện như thế (= họ phải có rất ít tin tức thực tế)."
                    }
                ]
            }
        ]
    },
    {
        "id": "4ba384fb074840bdba3cfc5d3cdb9370",
        "word": "homelessness",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈhəʊmləsnəs/",
            "us": "/ˈhəʊmləsnəs/"
        },
        "nearby": [
            {
                "word": "homeland security",
                "pos": "noun"
            },
            {
                "word": "homeless",
                "pos": "adjective"
            },
            {
                "word": "homelessness",
                "pos": "noun"
            },
            {
                "word": "home loan",
                "pos": "noun"
            },
            {
                "word": "homely",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the state of having no home",
                    "vi": "tình trạng không có nhà"
                },
                "examples": [
                    {
                        "en": "Homelessness amongst young people has risen to record levels.",
                        "vi": "Tình trạng vô gia cư trong giới trẻ đã tăng lên mức kỷ lục."
                    }
                ]
            }
        ]
    },
    {
        "id": "e935a4ac38224e0a86262db009567488",
        "word": "penniless",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈpeniləs/",
            "us": "/ˈpeniləs/"
        },
        "nearby": [
            {
                "word": "pennant",
                "pos": "noun"
            },
            {
                "word": "penne",
                "pos": "noun"
            },
            {
                "word": "penniless",
                "pos": "adjective"
            },
            {
                "word": "the Pennines",
                "pos": ""
            },
            {
                "word": "the Pennine Way",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "having no money; very poor",
                    "vi": "không có tiền; rất nghèo"
                },
                "examples": [
                    {
                        "en": "a penniless student",
                        "vi": "một sinh viên không một xu dính túi"
                    }
                ]
            }
        ]
    },
    {
        "id": "fcd81a91261c4839b2f7850ff386ae62",
        "word": "starvation",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/stɑːˈveɪʃn/",
            "us": "/stɑːrˈveɪʃn/"
        },
        "nearby": [
            {
                "word": "start-up",
                "pos": "adjective"
            },
            {
                "word": "star turn",
                "pos": "noun"
            },
            {
                "word": "starvation",
                "pos": "noun"
            },
            {
                "word": "starve",
                "pos": "verb"
            },
            {
                "word": "starve into",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the state in which somebody suffers or dies because they have no food",
                    "vi": "trạng thái mà ai đó đau khổ hoặc chết vì không có thức ăn"
                },
                "examples": [
                    {
                        "en": "to die of/from starvation",
                        "vi": "chết vì / vì đói"
                    },
                    {
                        "en": "Millions will face starvation next year as a result of the drought.",
                        "vi": "Hàng triệu người sẽ phải đối mặt với nạn đói trong năm tới do hậu quả của hạn hán."
                    },
                    {
                        "en": "a starvation diet (= one in which you do not have much to eat)",
                        "vi": "chế độ ăn kiêng đói (= chế độ ăn kiêng mà bạn không có nhiều để ăn)"
                    },
                    {
                        "en": "The pilot had lost consciousness because of oxygen starvation.",
                        "vi": "Phi công đã bất tỉnh vì đói oxy."
                    },
                    {
                        "en": "They were on starvation wages (= extremely low wages).",
                        "vi": "Họ bị chết đói (= lương cực thấp)."
                    },
                    {
                        "en": "The workers lived in poor conditions and were paid starvation wages.",
                        "vi": "Các công nhân sống trong điều kiện tồi tệ và bị trả lương chết đói."
                    }
                ]
            }
        ]
    },
    {
        "id": "68af3de279fb4058a41b44a2c0aa969a",
        "word": "street people",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈstriːt piːpl/",
            "us": "/ˈstriːt piːpl/"
        },
        "nearby": [
            {
                "word": "street light",
                "pos": "noun"
            },
            {
                "word": "street party",
                "pos": "noun"
            },
            {
                "word": "street people",
                "pos": "noun"
            },
            {
                "word": "streetscape",
                "pos": "noun"
            },
            {
                "word": "street-smart",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "people who have no home and who live outside in a town",
                    "vi": "những người không có nhà và những người sống bên ngoài trong một thị trấn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "96bc1dd861c044688c8a7a60e506df61",
        "word": "tramp",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/træmp/",
            "us": "/træmp/"
        },
        "nearby": [
            {
                "word": "tramlines",
                "pos": "noun"
            },
            {
                "word": "trammel",
                "pos": "verb"
            },
            {
                "word": "tramp",
                "pos": "noun"
            },
            {
                "word": "tramp",
                "pos": "verb"
            },
            {
                "word": "tramper",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person with no home or job who travels from place to place, usually asking people in the street for food or money",
                    "vi": "một người không có nhà hoặc không có việc làm, đi hết nơi này đến nơi khác, thường hỏi những người trên đường phố về thức ăn hoặc tiền"
                },
                "examples": [
                    {
                        "en": "An old tramp was sitting on a bench.",
                        "vi": "Một người lang thang già đang ngồi trên một chiếc ghế dài."
                    }
                ]
            },
            {
                "define": {
                    "en": "the sound of somebody’s heavy steps",
                    "vi": "âm thanh của những bước chân nặng nhọc của ai đó"
                },
                "examples": [
                    {
                        "en": "the tramp of marching feet",
                        "vi": "những đôi chân diễu hành"
                    }
                ]
            },
            {
                "define": {
                    "en": "a long walk",
                    "vi": "một đoạn đường dài"
                },
                "examples": [
                    {
                        "en": "We had a long tramp home.",
                        "vi": "Chúng tôi đã có một nhà lang thang dài."
                    }
                ]
            },
            {
                "define": {
                    "en": "a woman who has many sexual partners",
                    "vi": "một phụ nữ có nhiều bạn tình"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "1f48c14416e94c07af92f3e377983761",
        "word": "bag lady",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbæɡ leɪdi/",
            "us": "/ˈbæɡ leɪdi/"
        },
        "nearby": [
            {
                "word": "baggy",
                "pos": "adjective"
            },
            {
                "word": "bagh",
                "pos": "noun"
            },
            {
                "word": "bag lady",
                "pos": "noun"
            },
            {
                "word": "bag lunch",
                "pos": "noun"
            },
            {
                "word": "bagpipe",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a woman who has no home and who walks around carrying her possessions with her",
                    "vi": "một người phụ nữ không có nhà và đi vòng quanh mang theo tài sản của mình"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "fa9c9e59f5fa4e3fb75723a7990d880c",
        "word": "begging bowl",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbeɡɪŋ bəʊl/",
            "us": "/ˈbeɡɪŋ bəʊl/"
        },
        "nearby": [
            {
                "word": "beggar-my-neighbour",
                "pos": "noun"
            },
            {
                "word": "The Beggar's Opera",
                "pos": ""
            },
            {
                "word": "begging bowl",
                "pos": "noun"
            },
            {
                "word": "begin",
                "pos": "verb"
            },
            {
                "word": "beginner",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a bowl held out by somebody asking for food or money",
                    "vi": "một cái bát được đưa ra bởi ai đó xin thức ăn hoặc tiền"
                },
                "examples": [
                    {
                        "en": "(figurative) He is taking round the begging bowl on behalf of the party's campaign fund.",
                        "vi": "(nghĩa bóng) Anh ta đang thay mặt quỹ vận động tranh cử của đảng đi lấy bát ăn xin."
                    },
                    {
                        "en": "(figurative) The school is always having to get out the begging bowl for books and basic equipment.",
                        "vi": "(nghĩa bóng) Nhà trường luôn phải thoát ra khỏi cái bát ăn xin để có sách và thiết bị cơ bản."
                    }
                ]
            }
        ]
    },
    {
        "id": "c351eb1e756445a88fa4ba87fbc7ad89",
        "word": "deprivation",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌdeprɪˈveɪʃn/",
            "us": "/ˌdeprɪˈveɪʃn/"
        },
        "nearby": [
            {
                "word": "depressurization",
                "pos": "noun"
            },
            {
                "word": "depressurize",
                "pos": "verb"
            },
            {
                "word": "deprivation",
                "pos": "noun"
            },
            {
                "word": "deprive",
                "pos": "verb"
            },
            {
                "word": "deprived",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the fact of not having something that you need, like enough food, money or a home; the process that causes this",
                    "vi": "thực tế là không có một thứ gì đó mà bạn cần, như đủ thức ăn, tiền bạc hoặc một ngôi nhà; quá trình gây ra điều này"
                },
                "examples": [
                    {
                        "en": "In the inner cities you will find neglected children suffering from social deprivation.",
                        "vi": "Trong các thành phố bên trong, bạn sẽ thấy những đứa trẻ bị bỏ rơi phải chịu cảnh thiếu thốn của xã hội."
                    },
                    {
                        "en": "a study of the effects of sleep deprivation",
                        "vi": "một nghiên cứu về ảnh hưởng của việc thiếu ngủ"
                    },
                    {
                        "en": "the deprivation of war (= the suffering caused by not having enough of some things)",
                        "vi": "sự thiếu thốn của chiến tranh (= sự đau khổ do không có đủ thứ)"
                    },
                    {
                        "en": "the deprivations and hardships resulting from the blockade",
                        "vi": "những thiếu thốn và khó khăn do phong tỏa"
                    }
                ]
            }
        ]
    },
    {
        "id": "6bfa609631df4aa78c73d46c5fb40069",
        "word": "deprived",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/dɪˈpraɪvd/",
            "us": "/dɪˈpraɪvd/"
        },
        "nearby": [
            {
                "word": "deprivation",
                "pos": "noun"
            },
            {
                "word": "deprive",
                "pos": "verb"
            },
            {
                "word": "deprived",
                "pos": "adjective"
            },
            {
                "word": "deprive of",
                "pos": "phrasal verb"
            },
            {
                "word": "De Profundis",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "without enough food, education, and all the things that are necessary for people to live a happy and comfortable life",
                    "vi": "không có đủ thức ăn, giáo dục và tất cả những thứ cần thiết để mọi người có thể sống một cuộc sống hạnh phúc và thoải mái"
                },
                "examples": [
                    {
                        "en": "a deprived childhood/background/area",
                        "vi": "một tuổi thơ thiếu thốn / bối cảnh / khu vực"
                    },
                    {
                        "en": "economically/emotionally/socially deprived",
                        "vi": "thiếu thốn về kinh tế / tình cảm / xã hội"
                    }
                ]
            },
            {
                "define": {
                    "en": "suffering from a lack of the thing mentioned",
                    "vi": "bị thiếu thứ đã đề cập"
                },
                "examples": [
                    {
                        "en": "The American adult population is chronically sleep-deprived.",
                        "vi": "Dân số trưởng thành ở Mỹ thường xuyên bị thiếu ngủ."
                    },
                    {
                        "en": "This movie is seriously humour-deprived.",
                        "vi": "Bộ phim này thiếu tính hài hước nghiêm trọng."
                    }
                ]
            }
        ]
    },
    {
        "id": "7e992b27416c4242b145c00176652902",
        "word": "dirt farmer",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈdɜːt fɑːmə(r)/",
            "us": "/ˈdɜːrt fɑːrmər/"
        },
        "nearby": [
            {
                "word": "dirt bike",
                "pos": "noun"
            },
            {
                "word": "dirt cheap",
                "pos": "adjective, adverb"
            },
            {
                "word": "dirt farmer",
                "pos": "noun"
            },
            {
                "word": "dirt poor",
                "pos": "adjective"
            },
            {
                "word": "dirt road",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a farmer who has poor land and does not make much money, and who does not pay anyone else to work on the farm",
                    "vi": "một người nông dân có đất nghèo và không kiếm được nhiều tiền, và người không trả tiền cho ai khác để làm việc trong trang trại"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "246915ec89b646ae9985a1b2d81a19fd",
        "word": "dosser",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈdɒsə(r)/",
            "us": "/ˈdɑːsər/"
        },
        "nearby": [
            {
                "word": "doss",
                "pos": "verb"
            },
            {
                "word": "doss",
                "pos": "noun"
            },
            {
                "word": "dosser",
                "pos": "noun"
            },
            {
                "word": "dosshouse",
                "pos": "noun"
            },
            {
                "word": "dossier",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who has no permanent home and who lives and sleeps on the streets or in cheap hostels",
                    "vi": "một người không có nhà cố định và sống và ngủ trên đường phố hoặc trong ký túc xá rẻ tiền"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a person who is very lazy",
                    "vi": "một người rất lười biếng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "6c6147d77ac24476b147842c37dbe2e5",
        "word": "emaciated",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ɪˈmeɪsieɪtɪd/",
            "us": "/ɪˈmeɪsieɪtɪd/"
        },
        "nearby": [
            {
                "word": "em-",
                "pos": "prefix"
            },
            {
                "word": "'em",
                "pos": "pronoun"
            },
            {
                "word": "emaciated",
                "pos": "adjective"
            },
            {
                "word": "emaciation",
                "pos": "noun"
            },
            {
                "word": "email",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "thin and weak, usually because of illness or lack of food",
                    "vi": "gầy và yếu, thường là do bệnh tật hoặc thiếu ăn"
                },
                "examples": [
                    {
                        "en": "He was thirty, but looked fifty, with pale skin, hopeless eyes and an emaciated body, covered in sores.",
                        "vi": "Anh ta đã ba mươi, nhưng trông đã năm mươi, với làn da nhợt nhạt, đôi mắt vô vọng và thân hình tiều tụy, đầy vết loét."
                    }
                ]
            }
        ]
    },
    {
        "id": "bcb279bd140b4bde86b129c378bdfa67",
        "word": "favela",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/fəˈvelə/",
            "us": "/fəˈvelə/"
        },
        "nearby": [
            {
                "word": "fave",
                "pos": "adjective"
            },
            {
                "word": "fave",
                "pos": "noun"
            },
            {
                "word": "favela",
                "pos": "noun"
            },
            {
                "word": "favicon",
                "pos": "noun"
            },
            {
                "word": "favour",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a poor area in or near a Brazilian city, with many small houses that are close together and in bad condition",
                    "vi": "một khu vực nghèo trong hoặc gần một thành phố của Brazil, với nhiều ngôi nhà nhỏ nằm san sát nhau và trong tình trạng tồi tệ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "130e825bbf844483ad838b03451a2c94",
        "word": "fuel poverty",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈfjuːəl pɒvəti/",
            "us": "/ˈfjuːəl pɑːvərti/"
        },
        "nearby": [
            {
                "word": "fuel cell",
                "pos": "noun"
            },
            {
                "word": "fuel injection",
                "pos": "noun"
            },
            {
                "word": "fuel poverty",
                "pos": "noun"
            },
            {
                "word": "fuel rod",
                "pos": "noun"
            },
            {
                "word": "fufu",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the state of not being able to afford to heat your home",
                    "vi": "tình trạng không đủ khả năng sưởi ấm ngôi nhà của bạn"
                },
                "examples": [
                    {
                        "en": "This initiative aims to tackle fuel poverty by cutting household bills.",
                        "vi": "Sáng kiến này nhằm mục đích giải quyết tình trạng nghèo đói bằng cách cắt giảm hóa đơn gia đình."
                    }
                ]
            }
        ]
    },
    {
        "id": "b76c6df0582a4d1d836d77a51ba850d9",
        "word": "impoverish",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ɪmˈpɒvərɪʃ/",
            "us": "/ɪmˈpɑːvərɪʃ/"
        },
        "nearby": [
            {
                "word": "impotently",
                "pos": "adverb"
            },
            {
                "word": "impound",
                "pos": "verb"
            },
            {
                "word": "impoverish",
                "pos": "verb"
            },
            {
                "word": "impoverished",
                "pos": "adjective"
            },
            {
                "word": "impoverishment",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to make somebody poor",
                    "vi": "làm cho ai đó nghèo"
                },
                "examples": [
                    {
                        "en": "These changes are likely to impoverish single-parent families even further.",
                        "vi": "Những thay đổi này có khả năng làm nghèo các gia đình đơn thân hơn nữa."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make something worse in quality",
                    "vi": "để làm cho một cái gì đó kém hơn về chất lượng"
                },
                "examples": [
                    {
                        "en": "Intensive cultivation has impoverished the soil.",
                        "vi": "Thâm canh đã làm nghèo kiệt đất."
                    }
                ]
            }
        ]
    },
    {
        "id": "998c1174a9704c2e90540610ba519174",
        "word": "impoverished",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ɪmˈpɒvərɪʃt/",
            "us": "/ɪmˈpɑːvərɪʃt/"
        },
        "nearby": [
            {
                "word": "impound",
                "pos": "verb"
            },
            {
                "word": "impoverish",
                "pos": "verb"
            },
            {
                "word": "impoverished",
                "pos": "adjective"
            },
            {
                "word": "impoverishment",
                "pos": "noun"
            },
            {
                "word": "impracticability",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "very poor; without money",
                    "vi": "rất nghèo; không có tiền"
                },
                "examples": [
                    {
                        "en": "impoverished peasants",
                        "vi": "nông dân nghèo khổ"
                    },
                    {
                        "en": "the impoverished areas of the city",
                        "vi": "những khu vực nghèo khó của thành phố"
                    }
                ]
            },
            {
                "define": {
                    "en": "poor in quality, because something is missing",
                    "vi": "chất lượng kém, bởi vì một cái gì đó bị thiếu"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "352fdd64026340869410ec9c8c74c6b5",
        "word": "indigent",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɪndɪdʒənt/",
            "us": "/ˈɪndɪdʒənt/"
        },
        "nearby": [
            {
                "word": "indifferently",
                "pos": "adverb"
            },
            {
                "word": "indigenous",
                "pos": "adjective"
            },
            {
                "word": "indigent",
                "pos": "adjective"
            },
            {
                "word": "indigestible",
                "pos": "adjective"
            },
            {
                "word": "indigestion",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "very poor",
                    "vi": "rất nghèo"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "2115ff7fe9d04e469097d452742bddc3",
        "word": "in rags",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/ræɡ/",
            "us": "/ræɡ/"
        },
        "nearby": [
            {
                "word": "rafter",
                "pos": "noun"
            },
            {
                "word": "rafting",
                "pos": "noun"
            },
            {
                "word": "rag",
                "pos": "noun"
            },
            {
                "word": "rag",
                "pos": "verb"
            },
            {
                "word": "raga",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a piece of old, often torn, cloth used especially for cleaning things",
                    "vi": "một mảnh vải cũ, thường bị rách, được sử dụng đặc biệt để lau đồ đạc"
                },
                "examples": [
                    {
                        "en": "I wiped the window with a damp rag.",
                        "vi": "Tôi lau cửa sổ bằng giẻ ẩm."
                    },
                    {
                        "en": "Use a piece of old rag.",
                        "vi": "Sử dụng một mảnh giẻ cũ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a newspaper that you believe to be of low quality",
                    "vi": "một tờ báo mà bạn cho là có chất lượng thấp"
                },
                "examples": [
                    {
                        "en": "the local rag",
                        "vi": "giẻ rách địa phương"
                    },
                    {
                        "en": "I don't know how you can bear to read that awful rag!",
                        "vi": "Tôi không biết làm thế nào bạn có thể chịu được khi đọc cái giẻ rách khủng khiếp đó!"
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of ragtime music",
                    "vi": "một bản nhạc ragtime"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "an event or a series of events organized by students each year to raise money for charity",
                    "vi": "một sự kiện hoặc một chuỗi các sự kiện do sinh viên tổ chức hàng năm để gây quỹ từ thiện"
                },
                "examples": [
                    {
                        "en": "rag week",
                        "vi": "tuần lễ giẻ rách"
                    }
                ]
            },
            {
                "define": {
                    "en": "wearing very old torn clothes",
                    "vi": "mặc quần áo rách rất cũ"
                },
                "examples": [
                    {
                        "en": "The children were dressed in rags.",
                        "vi": "Những đứa trẻ ăn mặc rách rưới."
                    },
                    {
                        "en": "I saw people dressed in rags begging on the street.",
                        "vi": "Tôi nhìn thấy những người ăn mặc rách rưới ăn xin trên đường phố."
                    }
                ]
            },
            {
                "define": {
                    "en": "to get angry",
                    "vi": "trở nên giận dữ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "from being extremely poor to being very rich",
                    "vi": "từ cực nghèo trở thành rất giàu"
                },
                "examples": [
                    {
                        "en": "a rags-to-riches story",
                        "vi": "câu chuyện giầu có"
                    },
                    {
                        "en": "Hers was a classic tale of rags to riches.",
                        "vi": "Hers là một câu chuyện kinh điển về sự giầu có."
                    }
                ]
            },
            {
                "define": {
                    "en": "something that is likely to make somebody very angry",
                    "vi": "điều gì đó có thể khiến ai đó rất tức giận"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "67545ad7d5d0410badd0367e22016c3e",
        "word": "malnourished",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌmælˈnʌrɪʃt/",
            "us": "/ˌmælˈnɜːrɪʃt/"
        },
        "nearby": [
            {
                "word": "mallow",
                "pos": "noun"
            },
            {
                "word": "mall rat",
                "pos": "noun"
            },
            {
                "word": "malnourished",
                "pos": "adjective"
            },
            {
                "word": "malnutrition",
                "pos": "noun"
            },
            {
                "word": "malodorous",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "in bad health because of a lack of food or a lack of the right type of food",
                    "vi": "sức khỏe không tốt vì ăn uống thiếu chất hoặc ăn không đúng loại"
                },
                "examples": [
                    {
                        "en": "Tired, malnourished people are prone to infection.",
                        "vi": "Người mệt mỏi, suy dinh dưỡng dễ bị nhiễm trùng."
                    }
                ]
            }
        ]
    },
    {
        "id": "11dd0e2e7ef040f4b2d2af90e3bffc74",
        "word": "malnutrition",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌmælnjuˈtrɪʃn/",
            "us": "/ˌmælnuˈtrɪʃn/"
        },
        "nearby": [
            {
                "word": "mall rat",
                "pos": "noun"
            },
            {
                "word": "malnourished",
                "pos": "adjective"
            },
            {
                "word": "malnutrition",
                "pos": "noun"
            },
            {
                "word": "malodorous",
                "pos": "adjective"
            },
            {
                "word": "Thomas Malory",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a poor condition of health caused by a lack of food or a lack of the right type of food",
                    "vi": "tình trạng sức khỏe kém do ăn uống thiếu chất hoặc ăn không đúng loại"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "0f9553c7b7d5455db75e3c864a09e24b",
        "word": "means test",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmiːnz test/",
            "us": "/ˈmiːnz test/"
        },
        "nearby": [
            {
                "word": "meanness",
                "pos": "noun"
            },
            {
                "word": "means",
                "pos": "noun"
            },
            {
                "word": "means test",
                "pos": "noun"
            },
            {
                "word": "means-test",
                "pos": "verb"
            },
            {
                "word": "means-tested",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an official check of somebody’s wealth or income in order to decide if they are poor enough to receive money from the government, etc. for a particular purpose",
                    "vi": "một cuộc kiểm tra chính thức về sự giàu có hoặc thu nhập của một người nào đó để quyết định xem họ có đủ nghèo để nhận tiền từ chính phủ, v.v. cho một mục đích cụ thể hay không"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "bd23104a8601476eaa79d768c1976506",
        "word": "means-test",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmiːnz test/",
            "us": "/ˈmiːnz test/"
        },
        "nearby": [
            {
                "word": "means",
                "pos": "noun"
            },
            {
                "word": "means test",
                "pos": "noun"
            },
            {
                "word": "means-test",
                "pos": "verb"
            },
            {
                "word": "means-tested",
                "pos": "adjective"
            },
            {
                "word": "Mean Streets",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to officially check somebody's wealth or income in order to decide if they are poor enough to receive money from the government, etc. for a particular purpose",
                    "vi": "để chính thức kiểm tra tài sản hoặc thu nhập của ai đó để quyết định xem họ có đủ nghèo để nhận tiền từ chính phủ, v.v. cho một mục đích cụ thể hay không"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to give out a government benefit only to people who qualify after a means test",
                    "vi": "chỉ cung cấp lợi ích của chính phủ cho những người đủ tiêu chuẩn sau khi kiểm tra phương tiện"
                },
                "examples": [
                    {
                        "en": "means-tested benefits",
                        "vi": "lợi ích được kiểm tra phương tiện"
                    }
                ]
            }
        ]
    },
    {
        "id": "3f9a3220ca9b41c083a7e8216fd78c11",
        "word": "on your uppers",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈʌpə(r)/",
            "us": "/ˈʌpər/"
        },
        "nearby": [
            {
                "word": "upon",
                "pos": "preposition"
            },
            {
                "word": "upper",
                "pos": "adjective"
            },
            {
                "word": "upper",
                "pos": "noun"
            },
            {
                "word": "upper case",
                "pos": "noun"
            },
            {
                "word": "upper chamber",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the top part of a shoe that is attached to the sole",
                    "vi": "phần trên cùng của giày được gắn vào đế"
                },
                "examples": [
                    {
                        "en": "shoes with leather uppers",
                        "vi": "giày có mũ da"
                    }
                ]
            },
            {
                "define": {
                    "en": "a drug that makes you feel excited and full of energy",
                    "vi": "một loại thuốc làm cho bạn cảm thấy hưng phấn và tràn đầy năng lượng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "having very little money",
                    "vi": "có rất ít tiền"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "42cd6d7c1138400a8577ca3ccc924931",
        "word": "pauper",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpɔːpə(r)/",
            "us": "/ˈpɔːpər/"
        },
        "nearby": [
            {
                "word": "paunch",
                "pos": "noun"
            },
            {
                "word": "paunchy",
                "pos": "adjective"
            },
            {
                "word": "pauper",
                "pos": "noun"
            },
            {
                "word": "pause",
                "pos": "verb"
            },
            {
                "word": "pause",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a very poor person",
                    "vi": "một người rất nghèo"
                },
                "examples": [
                    {
                        "en": "He died a pauper.",
                        "vi": "Anh ta chết một kẻ khốn nạn."
                    },
                    {
                        "en": "She was buried in a pauper’s grave.",
                        "vi": "Cô được chôn cất trong một ngôi mộ của một người nghèo."
                    }
                ]
            }
        ]
    },
    {
        "id": "3eb3abb956b744efb76f51a6536d9f5b",
        "word": "penurious",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/pəˈnjʊəriəs/",
            "us": "/pəˈnʊriəs/"
        },
        "nearby": [
            {
                "word": "penultimate",
                "pos": "adjective"
            },
            {
                "word": "penumbra",
                "pos": "noun"
            },
            {
                "word": "penurious",
                "pos": "adjective"
            },
            {
                "word": "penury",
                "pos": "noun"
            },
            {
                "word": "Penzance",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "very poor",
                    "vi": "rất nghèo"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "f0f44fad5dc241ba8d1fe25356c1010d",
        "word": "penury",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpenjəri/",
            "us": "/ˈpenjəri/"
        },
        "nearby": [
            {
                "word": "penumbra",
                "pos": "noun"
            },
            {
                "word": "penurious",
                "pos": "adjective"
            },
            {
                "word": "penury",
                "pos": "noun"
            },
            {
                "word": "Penzance",
                "pos": ""
            },
            {
                "word": "peon",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the state of being very poor",
                    "vi": "tình trạng rất nghèo"
                },
                "examples": [
                    {
                        "en": "He died in penury.",
                        "vi": "Anh ta chết trong tình trạng nặng nề."
                    },
                    {
                        "en": "They were reduced to penury.",
                        "vi": "Chúng đã được giảm xuống thành penury."
                    }
                ]
            }
        ]
    },
    {
        "id": "d86438aee4a747c0b1784229dc2dc282",
        "word": "poverty-stricken",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpɒvəti strɪkən/",
            "us": "/ˈpɑːvərti strɪkən/"
        },
        "nearby": [
            {
                "word": "poverty",
                "pos": "noun"
            },
            {
                "word": "the poverty line",
                "pos": "noun"
            },
            {
                "word": "poverty-stricken",
                "pos": "adjective"
            },
            {
                "word": "poverty trap",
                "pos": "noun"
            },
            {
                "word": "pow",
                "pos": "exclamation"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "extremely poor; with very little money",
                    "vi": "cực kì nghèo; với rất ít tiền"
                },
                "examples": [
                    {
                        "en": "poverty-stricken families/countries",
                        "vi": "các gia đình / quốc gia nghèo đói"
                    },
                    {
                        "en": "He came from a poverty-stricken family in turn of the century Brooklyn.",
                        "vi": "Anh đến từ một gia đình nghèo khó lần lượt vào thế kỷ Brooklyn."
                    },
                    {
                        "en": "The organization works in many war-torn and poverty-stricken countries",
                        "vi": "Tổ chức hoạt động ở nhiều quốc gia bị chiến tranh tàn phá và nghèo đói"
                    }
                ]
            }
        ]
    },
    {
        "id": "be664d077e6842d1ac235e019c2622ec",
        "word": "poverty trap",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpɒvəti træp/",
            "us": "/ˈpɑːvərti træp/"
        },
        "nearby": [
            {
                "word": "the poverty line",
                "pos": "noun"
            },
            {
                "word": "poverty-stricken",
                "pos": "adjective"
            },
            {
                "word": "poverty trap",
                "pos": "noun"
            },
            {
                "word": "pow",
                "pos": "exclamation"
            },
            {
                "word": "POW",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a situation in which a person stays poor even when they get a job because the money they receive from the government is reduced",
                    "vi": "một tình huống trong đó một người vẫn nghèo ngay cả khi họ kiếm được việc làm vì số tiền họ nhận được từ chính phủ bị giảm"
                },
                "examples": [
                    {
                        "en": "The poorest families remained caught in the poverty trap.",
                        "vi": "Các gia đình nghèo nhất vẫn mắc vào bẫy nghèo."
                    }
                ]
            }
        ]
    },
    {
        "id": "07124896df5e49cbb0aec791244b706a",
        "word": "precariat",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/prɪˈkeəriət/",
            "us": "/prɪˈkeriət/"
        },
        "nearby": [
            {
                "word": "prebuttal",
                "pos": "noun"
            },
            {
                "word": "precancerous",
                "pos": "adjective"
            },
            {
                "word": "precariat",
                "pos": "noun"
            },
            {
                "word": "precarious",
                "pos": "adjective"
            },
            {
                "word": "precariously",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "people whose employment and income are not secure, especially when considered as a class",
                    "vi": "những người có việc làm và thu nhập không được đảm bảo, đặc biệt khi được coi là một tầng lớp"
                },
                "examples": [
                    {
                        "en": "The precariat, the poorest and most deprived grouping, made up 15% of the population.",
                        "vi": "Người nghèo nhất và thiếu thốn nhất, chiếm 15% dân số."
                    },
                    {
                        "en": "Members of the precariat are generally so worried about keeping their jobs that they will take wage cuts and give up all employment rights.",
                        "vi": "Các thành viên của khu vực phòng ngừa nói chung lo lắng về việc duy trì công việc của họ đến mức họ sẽ cắt giảm lương và từ bỏ tất cả các quyền làm việc."
                    }
                ]
            }
        ]
    },
    {
        "id": "cccfd4cbb79f4410b4c97e91443b73d8",
        "word": "rough sleeper",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌrʌf ˈsliːpə(r)/",
            "us": "/ˌrʌf ˈsliːpər/"
        },
        "nearby": [
            {
                "word": "the Rough Riders",
                "pos": "noun"
            },
            {
                "word": "roughshod",
                "pos": "adverb"
            },
            {
                "word": "rough sleeper",
                "pos": "noun"
            },
            {
                "word": "rough up",
                "pos": "phrasal verb"
            },
            {
                "word": "roulette",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who has no home and sleeps outside, especially on the streets of a town or city",
                    "vi": "một người không có nhà và ngủ bên ngoài, đặc biệt là trên đường phố của một thị trấn hoặc thành phố"
                },
                "examples": [
                    {
                        "en": "The charity provides shelter for rough sleepers.",
                        "vi": "Tổ chức từ thiện cung cấp chỗ ở cho những người ngủ gật."
                    }
                ]
            }
        ]
    },
    {
        "id": "7c19beef38b64cb591089c573b2607ec",
        "word": "shanty",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈʃænti/",
            "us": "/ˈʃænti/"
        },
        "nearby": [
            {
                "word": "shan't",
                "pos": "short form"
            },
            {
                "word": "shanti",
                "pos": "noun"
            },
            {
                "word": "shanty",
                "pos": "noun"
            },
            {
                "word": "shanty town",
                "pos": "noun"
            },
            {
                "word": "shape",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small house, built of pieces of wood, metal and cardboard, where very poor people live, especially on the edge of a big city",
                    "vi": "một ngôi nhà nhỏ, được xây bằng những mảnh gỗ, kim loại và bìa cứng, nơi những người rất nghèo sống, đặc biệt là ở rìa của một thành phố lớn"
                },
                "examples": [
                    {
                        "en": "Nearly 20% of the city’s inhabitants live in shanty towns.",
                        "vi": "Gần 20% cư dân của thành phố sống trong các thị trấn tồi tàn."
                    },
                    {
                        "en": "The whole family lives in a shanty made of wood, mud and tin.",
                        "vi": "Cả gia đình sống trong một khu ổ chuột làm bằng gỗ, bùn và thiếc."
                    }
                ]
            },
            {
                "define": {
                    "en": "a song that sailors traditionally used to sing while pulling ropes, etc.",
                    "vi": "một bài hát mà các thủy thủ thường hát trong khi kéo dây thừng, v.v."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "164636fb49ee48989818ef0086931055",
        "word": "shanty town",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈʃænti taʊn/",
            "us": "/ˈʃænti taʊn/"
        },
        "nearby": [
            {
                "word": "shanti",
                "pos": "noun"
            },
            {
                "word": "shanty",
                "pos": "noun"
            },
            {
                "word": "shanty town",
                "pos": "noun"
            },
            {
                "word": "shape",
                "pos": "noun"
            },
            {
                "word": "shape",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an area in or near a town where poor people live in shanties",
                    "vi": "một khu vực trong hoặc gần một thị trấn nơi người nghèo sống trong shanties"
                },
                "examples": [
                    {
                        "en": "Nearly 20% of the city’s inhabitants live in shanty towns.",
                        "vi": "Gần 20% cư dân của thành phố sống trong các thị trấn tồi tàn."
                    }
                ]
            }
        ]
    },
    {
        "id": "f841d422950140539abb08d77f951f5f",
        "word": "slumlord",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈslʌmlɔːd/",
            "us": "/ˈslʌmlɔːrd/"
        },
        "nearby": [
            {
                "word": "slumber",
                "pos": "verb"
            },
            {
                "word": "slumber party",
                "pos": "noun"
            },
            {
                "word": "slumlord",
                "pos": "noun"
            },
            {
                "word": "slump",
                "pos": "verb"
            },
            {
                "word": "slump",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who owns houses or apartments in a poor area and who charges very high rent for them even though they are in bad condition",
                    "vi": "một người sở hữu những ngôi nhà hoặc căn hộ trong một khu vực nghèo và người tính tiền thuê chúng rất cao mặc dù chúng đang ở trong tình trạng tồi tệ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "31472650e8c049c8b344de266c43a598",
        "word": "subsistence",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/səbˈsɪstəns/",
            "us": "/səbˈsɪstəns/"
        },
        "nearby": [
            {
                "word": "subsidy",
                "pos": "noun"
            },
            {
                "word": "subsist",
                "pos": "verb"
            },
            {
                "word": "subsistence",
                "pos": "noun"
            },
            {
                "word": "subsoil",
                "pos": "noun"
            },
            {
                "word": "subsonic",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the state of having just enough money or food to stay alive",
                    "vi": "tình trạng chỉ có đủ tiền hoặc thức ăn để sống"
                },
                "examples": [
                    {
                        "en": "Many families are living below the level of subsistence.",
                        "vi": "Nhiều gia đình đang sống dưới mức đủ sống."
                    },
                    {
                        "en": "to live below (the) subsistence level",
                        "vi": "sống dưới (mức) sinh hoạt"
                    },
                    {
                        "en": "They had no visible means of subsistence.",
                        "vi": "Họ không có phương tiện sinh sống hữu hình."
                    },
                    {
                        "en": "subsistence agriculture/farming (= growing enough only to live on, not to sell)",
                        "vi": "nông nghiệp / canh tác tự cung tự cấp (= chỉ đủ để sống chứ không phải để bán)"
                    },
                    {
                        "en": "subsistence crops",
                        "vi": "cây trồng tự cung tự cấp"
                    },
                    {
                        "en": "Our ancestors lived in basic subsistence economies where cash never changed hands.",
                        "vi": "Tổ tiên của chúng ta sống trong các nền kinh tế tự cung tự cấp cơ bản, nơi tiền mặt không bao giờ đổi chủ."
                    },
                    {
                        "en": "He worked a 16-hour day for a subsistence wage (= enough money to buy only basic items).",
                        "vi": "Anh ấy đã làm việc 16 giờ một ngày với mức lương đủ sống (= chỉ đủ tiền để mua những món đồ cơ bản)."
                    }
                ]
            }
        ]
    },
    {
        "id": "cf283978b5f34021ba8ae1be6a40faac",
        "word": "sweated labour",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌswetɪd ˈleɪbə(r)/",
            "us": "/ˌswetɪd ˈleɪbər/"
        },
        "nearby": [
            {
                "word": "sweat",
                "pos": "verb"
            },
            {
                "word": "sweatband",
                "pos": "noun"
            },
            {
                "word": "sweated labour",
                "pos": "noun"
            },
            {
                "word": "sweater",
                "pos": "noun"
            },
            {
                "word": "sweat it out",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "hard work that is done for low wages in poor conditions; the people who do this work",
                    "vi": "công việc nặng nhọc được thực hiện với mức lương thấp trong điều kiện tồi tệ; những người làm công việc này"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "81dbd49551b4454e84206495ecfbc060",
        "word": "tenement",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈtenəmənt/",
            "us": "/ˈtenəmənt/"
        },
        "nearby": [
            {
                "word": "tendon",
                "pos": "noun"
            },
            {
                "word": "tendril",
                "pos": "noun"
            },
            {
                "word": "tenement",
                "pos": "noun"
            },
            {
                "word": "tenet",
                "pos": "noun"
            },
            {
                "word": "tenfold",
                "pos": "adjective, adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a large building divided into flats, especially in a poor area of a city",
                    "vi": "một tòa nhà lớn được chia thành các căn hộ, đặc biệt là trong một khu vực nghèo nàn của một thành phố"
                },
                "examples": [
                    {
                        "en": "a tenement block",
                        "vi": "một khối nhà"
                    },
                    {
                        "en": "families living in overcrowded tenements",
                        "vi": "các gia đình sống trong những căn nhà chung cư quá đông đúc"
                    },
                    {
                        "en": "living in a crowded tenement",
                        "vi": "sống trong một khu tập thể đông đúc"
                    }
                ]
            }
        ]
    },
    {
        "id": "0bb455988b084349b3a438760076b736",
        "word": "underclass",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈʌndəklɑːs/",
            "us": "/ˈʌndərklæs/"
        },
        "nearby": [
            {
                "word": "undercarriage",
                "pos": "noun"
            },
            {
                "word": "undercharge",
                "pos": "verb"
            },
            {
                "word": "underclass",
                "pos": "noun"
            },
            {
                "word": "underclassman",
                "pos": "noun"
            },
            {
                "word": "underclasswoman",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a social class that is very poor and has no status",
                    "vi": "một tầng lớp xã hội rất nghèo và không có địa vị"
                },
                "examples": [
                    {
                        "en": "The long-term unemployed are becoming a new underclass.",
                        "vi": "Những người thất nghiệp dài hạn đang trở thành một tầng lớp mới."
                    }
                ]
            }
        ]
    },
    {
        "id": "7f252d5f0850496f9e3fa693caefbf1a",
        "word": "vagrancy",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈveɪɡrənsi/",
            "us": "/ˈveɪɡrənsi/"
        },
        "nearby": [
            {
                "word": "vaginal",
                "pos": "adjective"
            },
            {
                "word": "vaginally",
                "pos": "adverb"
            },
            {
                "word": "vagrancy",
                "pos": "noun"
            },
            {
                "word": "vagrant",
                "pos": "noun"
            },
            {
                "word": "vagrant",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the crime of living on the streets and begging (= asking for money) from people",
                    "vi": "tội sống trên đường phố và ăn xin (= xin tiền) từ mọi người"
                },
                "examples": [
                    {
                        "en": "He was convicted of drunkenness and vagrancy.",
                        "vi": "Anh ta bị kết tội say rượu và sống mơ hồ."
                    }
                ]
            }
        ]
    },
    {
        "id": "87da08365c0645a68744c09e70cad279",
        "word": "vagrant",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈveɪɡrənt/",
            "us": "/ˈveɪɡrənt/"
        },
        "nearby": [
            {
                "word": "vaginally",
                "pos": "adverb"
            },
            {
                "word": "vagrancy",
                "pos": "noun"
            },
            {
                "word": "vagrant",
                "pos": "noun"
            },
            {
                "word": "vagrant",
                "pos": "adjective"
            },
            {
                "word": "vague",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who has no home or job, especially one who begs (= asks for money) from people",
                    "vi": "một người không có nhà hoặc không có việc làm, đặc biệt là người ăn xin (= xin tiền) từ mọi người"
                },
                "examples": [
                    {
                        "en": "The accused was a vagrant who travelled around, sleeping in parks and bus shelters.",
                        "vi": "Bị cáo là một kẻ lang thang, đi khắp nơi, ngủ trong công viên và nhà chờ xe buýt."
                    }
                ]
            }
        ]
    },
    {
        "id": "88398bbbaafc4179a4220d6e85a489b8",
        "word": "workhouse",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈwɜːkhaʊs/",
            "us": "/ˈwɜːrkhaʊs/"
        },
        "nearby": [
            {
                "word": "the Work Foundation",
                "pos": ""
            },
            {
                "word": "workhorse",
                "pos": "noun"
            },
            {
                "word": "workhouse",
                "pos": "noun"
            },
            {
                "word": "work in",
                "pos": "phrasal verb"
            },
            {
                "word": "working",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "(in England and Wales in the past) a building where very poor people were sent to live and given work to do",
                    "vi": "(ở Anh và xứ Wales trong quá khứ) một tòa nhà nơi những người rất nghèo được gửi đến sống và có công việc để làm"
                },
                "examples": []
            }
        ]
    }
]