[
    {
        "id": "90ff591a17d04352a0173138b0ffaf14",
        "word": "blood",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/blʌd/",
            "us": "/blʌd/"
        },
        "nearby": [
            {
                "word": "blonde",
                "pos": "noun"
            },
            {
                "word": "Blondie",
                "pos": ""
            },
            {
                "word": "blood",
                "pos": "noun"
            },
            {
                "word": "blood",
                "pos": "verb"
            },
            {
                "word": "blood bank",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the red liquid that flows through the bodies of humans and animals",
                    "vi": "chất lỏng màu đỏ chảy qua cơ thể người và động vật"
                },
                "examples": [
                    {
                        "en": "He lost a lot of blood in the accident.",
                        "vi": "Anh ấy mất rất nhiều máu trong vụ tai nạn."
                    },
                    {
                        "en": "Blood was pouring out of a cut on her head.",
                        "vi": "Máu tuôn ra từ một vết cắt trên đầu cô."
                    },
                    {
                        "en": "His hands were covered in blood.",
                        "vi": "Tay anh bê bết máu."
                    },
                    {
                        "en": "to give blood (= to have blood taken from you so that it can be used in the medical treatment of other people)",
                        "vi": "cho máu (= lấy máu từ bạn để nó có thể được sử dụng trong việc điều trị y tế cho người khác)"
                    },
                    {
                        "en": "After the attacks, people donated blood in record numbers.",
                        "vi": "Sau các vụ tấn công, người dân đã hiến máu với số lượng kỷ lục."
                    },
                    {
                        "en": "He was a hot-headed warrior, always too quick to shed blood (= attack and injure or kill somebody).",
                        "vi": "Anh ta là một chiến binh nóng nảy, luôn đổ máu quá nhanh (= tấn công và làm bị thương hoặc giết ai đó)."
                    },
                    {
                        "en": "to draw blood (= to wound a person so that they lose blood)",
                        "vi": "để lấy máu (= làm vết thương một người để họ mất máu)"
                    },
                    {
                        "en": "a drop/pool of blood",
                        "vi": "một giọt / vũng máu"
                    },
                    {
                        "en": "There was dried blood on her cheek.",
                        "vi": "Có vết máu khô trên má cô."
                    },
                    {
                        "en": "a blood cell/sample",
                        "vi": "một tế bào máu / mẫu"
                    },
                    {
                        "en": "to improve blood flow to the heart",
                        "vi": "cải thiện lưu lượng máu đến tim"
                    },
                    {
                        "en": "the blood supply to the brain",
                        "vi": "cung cấp máu cho não"
                    }
                ]
            },
            {
                "define": {
                    "en": "having the type of blood mentioned",
                    "vi": "có nhóm máu được đề cập"
                },
                "examples": [
                    {
                        "en": "cold-blooded reptiles",
                        "vi": "loài bò sát máu lạnh"
                    }
                ]
            },
            {
                "define": {
                    "en": "family origins",
                    "vi": "nguồn gốc gia đình"
                },
                "examples": [
                    {
                        "en": "She is of noble blood.",
                        "vi": "Cô ấy thuộc dòng máu quý tộc."
                    },
                    {
                        "en": "There is some Polish blood on his father's side.",
                        "vi": "Có chút dòng máu Ba Lan bên cha anh."
                    },
                    {
                        "en": "I doubt if I have a single drop of aristocratic blood in my veins.",
                        "vi": "Tôi nghi ngờ liệu mình có một giọt máu quý tộc trong huyết quản hay không."
                    }
                ]
            },
            {
                "define": {
                    "en": "a rich and fashionable man",
                    "vi": "một người đàn ông giàu có và thời trang"
                },
                "examples": [
                    {
                        "en": "a young blood",
                        "vi": "một dòng máu trẻ"
                    }
                ]
            },
            {
                "define": {
                    "en": "feelings of hate or strong dislike",
                    "vi": "cảm giác ghét hoặc không thích mạnh mẽ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be angry with somebody and want to hurt or punish them",
                    "vi": "tức giận với ai đó và muốn làm tổn thương hoặc trừng phạt họ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be a natural part of your character and of the character of other members of your family",
                    "vi": "trở thành một phần tự nhiên trong tính cách của bạn và tính cách của các thành viên khác trong gia đình bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "family relationships are stronger than any others",
                    "vi": "mối quan hệ gia đình bền chặt hơn bất kỳ mối quan hệ nào khác"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "somebody is very angry and ready to argue or fight",
                    "vi": "ai đó rất tức giận và sẵn sàng tranh luận hoặc chiến đấu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "very hard work; a lot of effort",
                    "vi": "làm việc rất chăm chỉ; nhiều sự cố gắng"
                },
                "examples": [
                    {
                        "en": "The only way to succeed is through old-fashioned blood, sweat and tears.",
                        "vi": "Cách duy nhất để thành công là thông qua máu, mồ hôi và nước mắt của người già."
                    }
                ]
            },
            {
                "define": {
                    "en": "when you say that somebody is flesh and blood, you mean that they are a normal human with needs, emotions and weaknesses",
                    "vi": "Khi bạn nói rằng ai đó bằng xương bằng thịt, bạn có nghĩa là họ là một con người bình thường với những nhu cầu, cảm xúc và điểm yếu"
                },
                "examples": [
                    {
                        "en": "Listening to the cries was more than flesh and blood could stand.",
                        "vi": "Nghe tiếng kêu đau đớn hơn cả máu thịt."
                    },
                    {
                        "en": "She wasn't a ghost. She was flesh and blood.",
                        "vi": "Cô ấy không phải là ma. Cô ấy bằng xương bằng thịt."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person that you are related to",
                    "vi": "một người mà bạn có liên quan"
                },
                "examples": [
                    {
                        "en": "You can’t do that to your own flesh and blood!",
                        "vi": "Bạn không thể làm điều đó với máu thịt của mình!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to make you extremely frightened or shocked",
                    "vi": "khiến bạn vô cùng sợ hãi hoặc bị sốc"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be responsible for somebody’s death",
                    "vi": "chịu trách nhiệm về cái chết của ai đó"
                },
                "examples": [
                    {
                        "en": "a dictator with the blood of thousands on his hands",
                        "vi": "một kẻ độc tài với hàng ngàn máu trên tay của mình"
                    }
                ]
            },
            {
                "define": {
                    "en": "acting in a way that is deliberately cruel",
                    "vi": "hành động theo cách cố tình tàn nhẫn"
                },
                "examples": [
                    {
                        "en": "to kill somebody in cold blood",
                        "vi": "giết ai đó trong máu lạnh"
                    }
                ]
            },
            {
                "define": {
                    "en": "almost impossible to obtain",
                    "vi": "hầu như không thể có được"
                },
                "examples": [
                    {
                        "en": "Getting an apology from him was like getting blood from a stone.",
                        "vi": "Nhận được một lời xin lỗi từ anh ấy giống như nhận được một hòn đá hộc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody extremely angry",
                    "vi": "làm cho ai đó cực kỳ tức giận"
                },
                "examples": [
                    {
                        "en": "The way he treats his employees really makes my blood boil.",
                        "vi": "Cách anh ấy đối xử với nhân viên thực sự khiến tôi sôi máu."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody very frightened or fill them with horror",
                    "vi": "để làm cho ai đó rất sợ hãi hoặc khiến họ kinh hoàng"
                },
                "examples": [
                    {
                        "en": "The sound of laughter in the empty house made my blood run cold.",
                        "vi": "Tiếng cười nói trong căn nhà trống trải khiến máu tôi lạnh toát."
                    },
                    {
                        "en": "Our blood ran cold at the thought of how easily we could have been killed.",
                        "vi": "Máu chúng tôi lạnh toát khi nghĩ đến việc chúng tôi có thể bị giết một cách dễ dàng như thế nào."
                    }
                ]
            },
            {
                "define": {
                    "en": "new members or employees, especially young ones, with new ideas or ways of doing things",
                    "vi": "các thành viên hoặc nhân viên mới, đặc biệt là những người trẻ tuổi, với những ý tưởng hoặc cách làm mới"
                },
                "examples": [
                    {
                        "en": "This company badly needs to bring in some new blood.",
                        "vi": "Công ty này thực sự cần phải mang lại một lượng máu mới."
                    }
                ]
            },
            {
                "define": {
                    "en": "to kill or wound somebody",
                    "vi": "giết hoặc làm bị thương ai đó"
                },
                "examples": [
                    {
                        "en": "Nothing can justify spilling innocent blood.",
                        "vi": "Không gì có thể biện minh cho việc đổ máu vô tội."
                    }
                ]
            },
            {
                "define": {
                    "en": "to show that you are very angry; to speak in an angry way",
                    "vi": "để cho thấy rằng bạn đang rất tức giận; nói một cách tức giận"
                },
                "examples": [
                    {
                        "en": "She looked at him with eyes that spat venom.",
                        "vi": "Cô nhìn anh với đôi mắt phun nọc độc."
                    },
                    {
                        "en": "She surveyed him coldly with eyes that spat venom.",
                        "vi": "Cô lạnh lùng quan sát anh với đôi mắt phun nọc độc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody excited",
                    "vi": "để làm cho ai đó phấn khích"
                },
                "examples": [
                    {
                        "en": "The atmosphere in a theatre never failed to stir her blood.",
                        "vi": "Bầu không khí trong rạp chiếu phim không bao giờ không khuấy động được máu của cô."
                    }
                ]
            },
            {
                "define": {
                    "en": "to work very hard",
                    "vi": "làm việc rất chăm chỉ"
                },
                "examples": [
                    {
                        "en": "I sweated blood to get everything ready in time.",
                        "vi": "Tôi đổ mồ hôi máu để kịp thời chuẩn bị mọi thứ."
                    }
                ]
            }
        ]
    },
    {
        "id": "2b2b31a04bef4e8e991163f8c438392f",
        "word": "bone",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/bəʊn/",
            "us": "/bəʊn/"
        },
        "nearby": [
            {
                "word": "bond paper",
                "pos": "noun"
            },
            {
                "word": "Bond Street",
                "pos": ""
            },
            {
                "word": "bone",
                "pos": "noun"
            },
            {
                "word": "bone",
                "pos": "verb"
            },
            {
                "word": "bone china",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "any of the hard parts that form the skeleton of the body of a human or an animal",
                    "vi": "bất kỳ bộ phận cứng nào tạo thành bộ xương của cơ thể người hoặc động vật"
                },
                "examples": [
                    {
                        "en": "He survived the accident with no broken bones.",
                        "vi": "Anh ta sống sót sau vụ tai nạn mà không bị gãy xương."
                    },
                    {
                        "en": "This fish has a lot of bones in it.",
                        "vi": "Con cá này có rất nhiều xương trong đó."
                    },
                    {
                        "en": "She went for a bone density scan.",
                        "vi": "Cô ấy đã đi chụp mật độ xương."
                    },
                    {
                        "en": "The dog was gnawing at a bone.",
                        "vi": "Con chó đang gặm xương."
                    },
                    {
                        "en": "She had a beautiful face with very good bone structure.",
                        "vi": "Cô có một khuôn mặt đẹp với cấu trúc xương rất tốt."
                    }
                ]
            },
            {
                "define": {
                    "en": "the hard substance that bones are made of",
                    "vi": "chất cứng mà xương được tạo thành"
                },
                "examples": [
                    {
                        "en": "knives with bone handles",
                        "vi": "dao có cán xương"
                    }
                ]
            },
            {
                "define": {
                    "en": "having bones of the type mentioned",
                    "vi": "có xương thuộc loại được đề cập"
                },
                "examples": [
                    {
                        "en": "fine-boned",
                        "vi": "xương tốt"
                    }
                ]
            },
            {
                "define": {
                    "en": "a very thin person or animal",
                    "vi": "một người hoặc động vật rất gầy"
                },
                "examples": [
                    {
                        "en": "The cat hadn’t been fed for weeks and was just a bag of bones.",
                        "vi": "Con mèo đã không được cho ăn trong nhiều tuần và chỉ là một cái túi xương."
                    }
                ]
            },
            {
                "define": {
                    "en": "the basic facts",
                    "vi": "những sự thật cơ bản"
                },
                "examples": [
                    {
                        "en": "the bare bones of the story",
                        "vi": "cốt truyện trần trụi"
                    }
                ]
            },
            {
                "define": {
                    "en": "a subject that causes people to disagree",
                    "vi": "một chủ đề khiến mọi người không đồng ý"
                },
                "examples": [
                    {
                        "en": "Where to go on holiday is always a bone of contention in our family.",
                        "vi": "Đi đâu vào kỳ nghỉ luôn là vấn đề nhức nhối trong gia đình chúng tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "so honest or clearly expressed that it is likely to cause offence to some people",
                    "vi": "trung thực hoặc thể hiện rõ ràng đến mức có thể gây phản cảm cho một số người"
                },
                "examples": [
                    {
                        "en": "His comments about her size were a bit close to the bone.",
                        "vi": "Nhận xét của anh ta về kích thước của cô ấy là một chút gần xương."
                    },
                    {
                        "en": "Some of the sex scenes in the play were judged by critics to be too close to the bone.",
                        "vi": "Một số cảnh ân ái trong vở kịch bị giới phê bình đánh giá là quá sát xương."
                    }
                ]
            },
            {
                "define": {
                    "en": "to reduce something, such as costs, as much as you possibly can",
                    "vi": "để giảm bớt thứ gì đó, chẳng hạn như chi phí, nhiều nhất có thể"
                },
                "examples": [
                    {
                        "en": "Their annual budget has already been pared to the bone.",
                        "vi": "Ngân sách hàng năm của họ đã được chi tiêu đến tận xương."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be certain about something even though you do not have any direct proof and cannot explain why you are certain",
                    "vi": "để chắc chắn về điều gì đó mặc dù bạn không có bất kỳ bằng chứng trực tiếp nào và không thể giải thích tại sao bạn chắc chắn"
                },
                "examples": [
                    {
                        "en": "I know I'm going to fail this exam—I can feel it in my bones.",
                        "vi": "Tôi biết mình sẽ trượt kỳ thi này - tôi có thể cảm nhận được điều đó trong tận xương tủy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be angry with somebody about something and want to discuss it with them",
                    "vi": "tức giận với ai đó về điều gì đó và muốn thảo luận với họ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "very determined and refusing to give up",
                    "vi": "rất quyết tâm và không chịu bỏ cuộc"
                },
                "examples": [
                    {
                        "en": "When she sensed a good story she was like a dog with a bone.",
                        "vi": "Khi cảm nhận được một câu chuyện hay, cô ấy như một con chó bị hóc xương."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be honest and open about something; to not hesitate to do something",
                    "vi": "trung thực và cởi mở về điều gì đó; không ngần ngại làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "She made no bones about telling him exactly what she thought of him.",
                        "vi": "Cô không ngại nói cho anh biết chính xác những gì cô nghĩ về anh."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have none of the quality mentioned",
                    "vi": "không có chất lượng được đề cập"
                },
                "examples": [
                    {
                        "en": "She was honest and hard-working, and didn't have an unkind bone in her body.",
                        "vi": "Cô ấy thật thà và chăm chỉ, không có một mảnh xương xẩu trong người."
                    }
                ]
            },
            {
                "define": {
                    "en": "to develop a basic idea, etc. by giving more details to make it more complete",
                    "vi": "để phát triển một ý tưởng cơ bản, v.v. bằng cách cung cấp thêm chi tiết để làm cho nó hoàn thiện hơn"
                },
                "examples": [
                    {
                        "en": "The strength of the book is that it puts flesh on the bare bones of this argument.",
                        "vi": "Điểm mạnh của cuốn sách là nó đặt da thịt vào phần xương trần của lập luận này."
                    }
                ]
            },
            {
                "define": {
                    "en": "extremely thin in a way that is not attractive or healthy",
                    "vi": "cực kỳ gầy theo cách không hấp dẫn hoặc không tốt cho sức khỏe"
                },
                "examples": [
                    {
                        "en": "The dog lost more and more weight, and was soon little more than skin and bone.",
                        "vi": "Con chó ngày càng sụt cân, chẳng mấy chốc chỉ còn da bọc xương."
                    },
                    {
                        "en": "He's all skin and bone after his illness.",
                        "vi": "Anh ấy chỉ còn da bọc xương sau trận ốm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to give somebody a small part of what they want as a way of showing that you want to help them, without offering them the main thing they want",
                    "vi": "cung cấp cho ai đó một phần nhỏ những gì họ muốn như một cách thể hiện rằng bạn muốn giúp họ, mà không cung cấp cho họ điều chính họ muốn"
                },
                "examples": [
                    {
                        "en": "She feels this new energy bill is just throwing a bone to the environmentalists.",
                        "vi": "Cô ấy cảm thấy dự luật năng lượng mới này chỉ là một cái xương cho các nhà bảo vệ môi trường."
                    }
                ]
            },
            {
                "define": {
                    "en": "affecting you very strongly",
                    "vi": "ảnh hưởng đến bạn rất mạnh mẽ"
                },
                "examples": [
                    {
                        "en": "His threats chilled her to the bone.",
                        "vi": "Những lời đe dọa của anh khiến cô lạnh xương sống."
                    }
                ]
            },
            {
                "define": {
                    "en": "to work very hard",
                    "vi": "làm việc rất chăm chỉ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "34cdd9f576a74d1392768b007fa02b0f",
        "word": "brain",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/breɪn/",
            "us": "/breɪn/"
        },
        "nearby": [
            {
                "word": "braid",
                "pos": "verb"
            },
            {
                "word": "Braille",
                "pos": "noun"
            },
            {
                "word": "brain",
                "pos": "noun"
            },
            {
                "word": "Dennis Brain",
                "pos": ""
            },
            {
                "word": "brain",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the organ inside the head that controls movement, thought, memory and feeling",
                    "vi": "cơ quan bên trong đầu điều khiển chuyển động, suy nghĩ, trí nhớ và cảm giác"
                },
                "examples": [
                    {
                        "en": "The human brain is a complex organ.",
                        "vi": "Bộ não con người là một cơ quan phức tạp."
                    },
                    {
                        "en": "My tired brain couldn't cope with such a complex problem.",
                        "vi": "Bộ não mệt mỏi của tôi không thể đối phó với một vấn đề phức tạp như vậy."
                    },
                    {
                        "en": "There may have been some brain damage.",
                        "vi": "Có thể đã có một số tổn thương não."
                    },
                    {
                        "en": "brain cells/tissue",
                        "vi": "tế bào não / mô"
                    },
                    {
                        "en": "a brain tumour/haemorrhage/injury",
                        "vi": "một khối u não / xuất huyết / chấn thương"
                    },
                    {
                        "en": "Sometimes the doctor will also do a brain scan.",
                        "vi": "Đôi khi bác sĩ cũng sẽ chụp não."
                    },
                    {
                        "en": "brain surgery",
                        "vi": "phẫu thuật não"
                    }
                ]
            },
            {
                "define": {
                    "en": "the brain of an animal, eaten as food",
                    "vi": "não của động vật, được ăn làm thức ăn"
                },
                "examples": [
                    {
                        "en": "sheep’s brains",
                        "vi": "não cừu"
                    }
                ]
            },
            {
                "define": {
                    "en": "the ability to learn quickly and think about things in a logical and intelligent way",
                    "vi": "khả năng học hỏi nhanh chóng và suy nghĩ về mọi thứ một cách hợp lý và thông minh"
                },
                "examples": [
                    {
                        "en": "It doesn't take much brain to work out that both stories can't be true.",
                        "vi": "Không cần nhiều trí não để phát hiện ra rằng cả hai câu chuyện đều không thể là sự thật."
                    },
                    {
                        "en": "Teachers spotted that he had a good brain at an early age.",
                        "vi": "Các giáo viên đã phát hiện ra rằng anh ấy có một bộ não tốt ngay từ khi còn nhỏ."
                    },
                    {
                        "en": "You need brains as well as brawn (= intelligence as well as strength) to do this job.",
                        "vi": "Bạn cần bộ não cũng như sức mạnh (= trí thông minh cũng như sức mạnh) để làm công việc này."
                    }
                ]
            },
            {
                "define": {
                    "en": "an intelligent person",
                    "vi": "một người thông minh"
                },
                "examples": [
                    {
                        "en": "one of the best scientific brains in the country",
                        "vi": "một trong những bộ não khoa học tốt nhất trong nước"
                    },
                    {
                        "en": "We have the best scientific brains in the country working on this.",
                        "vi": "Chúng tôi có những bộ não khoa học giỏi nhất trong nước đang làm việc này."
                    }
                ]
            },
            {
                "define": {
                    "en": "the most intelligent person in a particular group; the person who is responsible for thinking of and organizing something",
                    "vi": "người thông minh nhất trong một nhóm cụ thể; người chịu trách nhiệm nghĩ ra và tổ chức một cái gì đó"
                },
                "examples": [
                    {
                        "en": "He's always been the brains of the family.",
                        "vi": "Anh ấy luôn là bộ não của gia đình."
                    },
                    {
                        "en": "the brains behind something The band's drummer is the brains behind their latest venture.",
                        "vi": "những bộ não đằng sau một cái gì đó Tay trống của ban nhạc là bộ não đằng sau dự án mới nhất của họ."
                    },
                    {
                        "en": "He was the brains behind the robberies.",
                        "vi": "Anh ta là đầu não đứng sau các vụ cướp."
                    }
                ]
            },
            {
                "define": {
                    "en": "to think very hard about something for a long time",
                    "vi": "suy nghĩ rất nhiều về điều gì đó trong một thời gian dài"
                },
                "examples": [
                    {
                        "en": "I’ve been beating my brains out all weekend to get this script written.",
                        "vi": "Tôi đã vắt óc suy nghĩ cả cuối tuần để viết kịch bản này."
                    }
                ]
            },
            {
                "define": {
                    "en": "to kill yourself/somebody by shooting yourself/them in the head",
                    "vi": "tự giết mình / ai đó bằng cách bắn vào đầu mình / họ"
                },
                "examples": [
                    {
                        "en": "He put a gun to his head and threatened to blow his brains out.",
                        "vi": "Anh ta dí súng vào đầu và dọa nổ não."
                    },
                    {
                        "en": "While cleaning his shotgun he had accidentally blown his own brains out.",
                        "vi": "Trong khi lau khẩu súng ngắn của mình, anh ta đã vô tình làm nổ não của chính mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to think very hard",
                    "vi": "suy nghĩ rất nhiều"
                },
                "examples": [
                    {
                        "en": "I had to cudgel my brains to remember her name.",
                        "vi": "Tôi phải cố gắng trí óc để nhớ tên cô ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to think about something all the time, especially in a way that is annoying",
                    "vi": "luôn nghĩ về điều gì đó, đặc biệt là theo cách gây khó chịu"
                },
                "examples": [
                    {
                        "en": "He's got football on the brain.",
                        "vi": "Anh ấy có bóng đá trên bộ não."
                    }
                ]
            },
            {
                "define": {
                    "en": "to ask somebody a lot of questions about something because they know more about the subject than you do",
                    "vi": "để hỏi ai đó rất nhiều câu hỏi về điều gì đó bởi vì họ biết nhiều hơn về chủ đề này hơn bạn"
                },
                "examples": [
                    {
                        "en": "I need to pick your brains: what can you tell me about credit unions?",
                        "vi": "Tôi cần phải chọn bộ não của bạn: bạn có thể cho tôi biết điều gì về các công đoàn tín dụng?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to think very hard or for a long time about something",
                    "vi": "suy nghĩ rất nhiều hoặc trong một thời gian dài về một cái gì đó"
                },
                "examples": [
                    {
                        "en": "She racked her brains, trying to remember exactly what she had said.",
                        "vi": "Cô vắt óc cố gắng nhớ lại chính xác những gì mình đã nói."
                    },
                    {
                        "en": "We racked our brains but we couldn't come up with a solution.",
                        "vi": "Chúng tôi vắt óc suy nghĩ nhưng không thể tìm ra giải pháp."
                    }
                ]
            }
        ]
    },
    {
        "id": "8ffade0dc8c34679895237e0ee6ca8ce",
        "word": "heart",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/hɑːt/",
            "us": "/hɑːrt/"
        },
        "nearby": [
            {
                "word": "hearse",
                "pos": "noun"
            },
            {
                "word": "William Randolph Hearst",
                "pos": ""
            },
            {
                "word": "heart",
                "pos": "noun"
            },
            {
                "word": "heart",
                "pos": "verb"
            },
            {
                "word": "heartache",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the organ in the chest that sends blood around the body, usually on the left in humans",
                    "vi": "cơ quan trong lồng ngực đưa máu đi khắp cơ thể, thường ở bên trái ở người"
                },
                "examples": [
                    {
                        "en": "The patient's heart stopped beating for a few seconds.",
                        "vi": "Tim bệnh nhân ngừng đập trong vài giây."
                    },
                    {
                        "en": "I could feel my heart pounding in my chest (= because of excitement, etc.).",
                        "vi": "Tôi có thể cảm thấy tim mình đập thình thịch trong lồng ngực (= vì phấn khích, v.v.)."
                    },
                    {
                        "en": "to have a weak heart",
                        "vi": "có một trái tim yếu ớt"
                    },
                    {
                        "en": "heart disease/problems",
                        "vi": "bệnh tim / vấn đề"
                    },
                    {
                        "en": "to have a heart condition",
                        "vi": "để có một tình trạng tim"
                    },
                    {
                        "en": "heart patients/surgery",
                        "vi": "bệnh nhân tim / phẫu thuật"
                    },
                    {
                        "en": "a heart transplant",
                        "vi": "cấy ghép tim"
                    }
                ]
            },
            {
                "define": {
                    "en": "the outside part of the chest where the heart is",
                    "vi": "phần bên ngoài của lồng ngực nơi có trái tim"
                },
                "examples": [
                    {
                        "en": "She clasped the photo to her heart.",
                        "vi": "Cô ôm chặt bức ảnh vào lòng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a thing that is like a heart in shape, often red and used as a symbol of love; a symbol like a heart used to mean the verb ‘love’",
                    "vi": "một thứ giống như hình trái tim, thường có màu đỏ và được dùng làm biểu tượng của tình yêu; một biểu tượng như trái tim được sử dụng để có nghĩa là động từ 'tình yêu'"
                },
                "examples": [
                    {
                        "en": "The words ‘I love you’ were written inside a big red heart.",
                        "vi": "Dòng chữ 'I love you' được viết bên trong một trái tim lớn màu đỏ."
                    },
                    {
                        "en": "She was drawing hearts on the cover of a loose-leaf binder.",
                        "vi": "Cô ấy đang vẽ những trái tim trên bìa một tờ bìa rời."
                    }
                ]
            },
            {
                "define": {
                    "en": "the place in a person where the feelings and emotions are thought to be, especially those connected with love",
                    "vi": "nơi con người được cho là cảm xúc và tình cảm, đặc biệt là những cảm xúc được kết nối với tình yêu"
                },
                "examples": [
                    {
                        "en": "She has a kind heart.",
                        "vi": "Cô ấy có một trái tim nhân hậu."
                    },
                    {
                        "en": "Have you no heart?",
                        "vi": "Bạn không có trái tim?"
                    },
                    {
                        "en": "He returned with a heavy heart (= sad).",
                        "vi": "Anh trở về với lòng nặng trĩu (= buồn)."
                    },
                    {
                        "en": "Her novels tend to deal with affairs of the heart.",
                        "vi": "Tiểu thuyết của cô có xu hướng giải quyết các vấn đề của trái tim."
                    },
                    {
                        "en": "The story captured the hearts and minds of a generation.",
                        "vi": "Câu chuyện đã chiếm được trái tim và tâm trí của cả một thế hệ."
                    },
                    {
                        "en": "His sad story touched her heart.",
                        "vi": "Câu chuyện buồn của anh khiến trái tim cô cảm động."
                    },
                    {
                        "en": "the mysteries of the human heart",
                        "vi": "những bí ẩn của trái tim con người"
                    }
                ]
            },
            {
                "define": {
                    "en": "having the type of character or personality mentioned",
                    "vi": "có loại nhân vật hoặc tính cách được đề cập"
                },
                "examples": [
                    {
                        "en": "simple-hearted",
                        "vi": "giản dị"
                    },
                    {
                        "en": "pure-hearted",
                        "vi": "trong sáng"
                    },
                    {
                        "en": "black-hearted",
                        "vi": "trái tim đen"
                    }
                ]
            },
            {
                "define": {
                    "en": "the most important part of something",
                    "vi": "phần quan trọng nhất của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "heart of something the heart of the matter/problem",
                        "vi": "trung tâm của một cái gì đó trung tâm của vấn đề / vấn đề"
                    },
                    {
                        "en": "The committee's report went to the heart of the government's dilemma.",
                        "vi": "Báo cáo của ủy ban đã đi vào trọng tâm của tình thế khó xử của chính phủ."
                    },
                    {
                        "en": "at the heart of something The distinction between right and wrong lies at the heart of all questions of morality.",
                        "vi": "ở trung tâm của điều gì đó Sự phân biệt giữa đúng và sai nằm ở trung tâm của tất cả các câu hỏi về đạo đức."
                    },
                    {
                        "en": "the issue at the heart of modern government",
                        "vi": "vấn đề trọng tâm của chính phủ hiện đại"
                    },
                    {
                        "en": "at the/its heart The story, at its heart, is a simple tale of loss and rediscovery.",
                        "vi": "tại / trái tim của nó Câu chuyện, ở trung tâm của nó, là một câu chuyện đơn giản về mất mát và khám phá lại."
                    },
                    {
                        "en": "Buddhism, at the heart, is about harmony.",
                        "vi": "Đạo Phật, ở trung tâm, là về sự hài hòa."
                    }
                ]
            },
            {
                "define": {
                    "en": "the part that is in the centre of something",
                    "vi": "phần nằm ở trung tâm của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "heart of something a quiet hotel in the very heart of the city",
                        "vi": "trung tâm của một cái gì đó một khách sạn yên tĩnh ở trung tâm của thành phố"
                    },
                    {
                        "en": "at the/its heart an open space with a small arena at the heart",
                        "vi": "tại / trái tim của nó một không gian rộng mở với một đấu trường nhỏ ở trung tâm"
                    },
                    {
                        "en": "Manchester contains at its heart a rather extended commercial district.",
                        "vi": "Manchester có trung tâm là một khu thương mại khá mở rộng."
                    }
                ]
            },
            {
                "define": {
                    "en": "the smaller leaves in the middle of a cabbage, lettuce, etc.",
                    "vi": "những chiếc lá nhỏ hơn ở giữa bắp cải, rau diếp, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "one of the four suits (= sets) in a pack of cards, with red heart symbols on them",
                    "vi": "một trong bốn bộ quần áo (= bộ) trong một gói thẻ, với biểu tượng trái tim màu đỏ trên chúng"
                },
                "examples": [
                    {
                        "en": "the queen of hearts",
                        "vi": "nữ hoàng của trái tim"
                    },
                    {
                        "en": "Hearts is/are trumps.",
                        "vi": "Hearts là / là át chủ bài."
                    }
                ]
            },
            {
                "define": {
                    "en": "one card from the suit called hearts",
                    "vi": "một thẻ từ bộ đồ được gọi là trái tim"
                },
                "examples": [
                    {
                        "en": "Who played that heart?",
                        "vi": "Ai đã chơi trái tim đó?"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that when you are away from somebody that you love, you love them even more",
                    "vi": "từng nói rằng khi bạn xa người mà bạn yêu thương, bạn thậm chí còn yêu họ nhiều hơn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to say what somebody is really like even though they may seem to be something different",
                    "vi": "được sử dụng để nói ai đó thực sự như thế nào mặc dù họ có vẻ là một cái gì đó khác nhau"
                },
                "examples": [
                    {
                        "en": "He's still a socialist at heart.",
                        "vi": "Anh ấy vẫn là một nhà xã hội chủ nghĩa trong trái tim."
                    }
                ]
            },
            {
                "define": {
                    "en": "if something is etched on your heart, memory, etc. you remember it because it has made a strong impression on you",
                    "vi": "nếu điều gì đó đã khắc sâu vào trái tim, ký ức của bạn, v.v., bạn sẽ nhớ nó vì nó đã gây ấn tượng mạnh mẽ đối với bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to make somebody feel very unhappy",
                    "vi": "làm cho ai đó cảm thấy rất không vui"
                },
                "examples": [
                    {
                        "en": "She broke his heart when she called off the engagement.",
                        "vi": "Cô đã làm tan nát trái tim anh khi cô hủy bỏ lời đính hôn."
                    },
                    {
                        "en": "It breaks my heart to see you like this.",
                        "vi": "Tôi tan nát trái tim khi nhìn thấy bạn như thế này."
                    }
                ]
            },
            {
                "define": {
                    "en": "using only your memory",
                    "vi": "chỉ sử dụng trí nhớ của bạn"
                },
                "examples": [
                    {
                        "en": "I've seen the show so often I know all the songs by heart.",
                        "vi": "Tôi đã xem chương trình thường xuyên nên tôi biết thuộc lòng tất cả các bài hát."
                    },
                    {
                        "en": "She's learnt the whole speech off by heart.",
                        "vi": "Cô ấy đã học thuộc lòng toàn bộ bài phát biểu."
                    }
                ]
            },
            {
                "define": {
                    "en": "if you have a change of heart, your attitude towards something changes, usually making you feel more friendly, helpful, etc.",
                    "vi": "nếu bạn thay đổi trái tim, thái độ của bạn đối với điều gì đó thay đổi, thường khiến bạn cảm thấy thân thiện, hữu ích hơn, v.v."
                },
                "examples": [
                    {
                        "en": "Dan did not want to get married but recently he’s had a change of heart.",
                        "vi": "Dan không muốn kết hôn nhưng gần đây anh ấy đã thay đổi tình cảm."
                    },
                    {
                        "en": "He said he's not coming, but he might have a change of heart.",
                        "vi": "Anh ấy nói rằng anh ấy sẽ không đến, nhưng anh ấy có thể đã thay đổi trái tim."
                    }
                ]
            },
            {
                "define": {
                    "en": "having a lot of importance and interest for somebody",
                    "vi": "có rất nhiều tầm quan trọng và sự quan tâm đối với ai đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to emphasize that you are telling the truth or will do what you promise",
                    "vi": "được sử dụng để nhấn mạnh rằng bạn đang nói sự thật hoặc sẽ làm những gì bạn hứa"
                },
                "examples": [
                    {
                        "en": "I saw him do it—cross my heart.",
                        "vi": "Tôi đã thấy anh ấy làm điều đó - trái tim tôi rất vui."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to compare two things and say that one of them is better",
                    "vi": "được sử dụng để so sánh hai thứ và nói rằng một trong số chúng tốt hơn"
                },
                "examples": [
                    {
                        "en": "Look at him dance! Eat your heart out, Fred Astaire (= he dances even better than Fred Astaire).",
                        "vi": "Nhìn anh ấy nhảy! Hãy tận hưởng trái tim của bạn, Fred Astaire (= anh ấy còn nhảy giỏi hơn Fred Astaire)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be able or willing to do something",
                    "vi": "để có thể hoặc sẵn sàng làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "Can you find it in your heart to forgive her?",
                        "vi": "Bạn có thể tìm thấy nó trong trái tim của bạn để tha thứ cho cô ấy?"
                    },
                    {
                        "en": "He couldn't find it in himself to trust anyone again.",
                        "vi": "Anh không thể tin tưởng bất cứ ai một lần nữa."
                    }
                ]
            },
            {
                "define": {
                    "en": "in a way that is sincere",
                    "vi": "theo một cách chân thành"
                },
                "examples": [
                    {
                        "en": "I beg you, from the bottom of my heart, to spare his life.",
                        "vi": "Tôi cầu xin bạn, từ tận đáy lòng, hãy tha mạng cho anh ấy."
                    },
                    {
                        "en": "It was clearly an offer that came from the heart.",
                        "vi": "Đó rõ ràng là một lời đề nghị xuất phát từ trái tim."
                    },
                    {
                        "en": "I could tell he spoke from the heart.",
                        "vi": "Tôi có thể nói rằng anh ấy đã nói từ trái tim."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody feel positive, especially when they thought that they had no chance of achieving something",
                    "vi": "để làm cho ai đó cảm thấy tích cực, đặc biệt là khi họ nghĩ rằng họ không có cơ hội đạt được điều gì đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to give your love to one person",
                    "vi": "trao tình yêu của bạn cho một người"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to ask somebody to be kind and/or reasonable",
                    "vi": "được sử dụng để yêu cầu ai đó tử tế và / hoặc hợp lý"
                },
                "examples": [
                    {
                        "en": "Have a heart! I’ve nowhere else to stay!",
                        "vi": "Có một trái tim! Tôi không còn nơi nào khác để ở!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be a very kind person",
                    "vi": "trở thành một người rất tốt bụng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be a person who does not show other people sympathy",
                    "vi": "trở thành một người không thể hiện sự đồng cảm của người khác"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to want somebody to be happy and successful even though your actions may not show this",
                    "vi": "muốn ai đó hạnh phúc và thành công mặc dù hành động của bạn có thể không cho thấy điều này"
                },
                "examples": [
                    {
                        "en": "Although he was sometimes too strict with his children, he had their best interests at heart.",
                        "vi": "Mặc dù đôi khi ông quá nghiêm khắc với con cái, nhưng ông luôn hướng tới lợi ích tốt nhất của chúng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be very dear to somebody",
                    "vi": "rất thân thiết với ai đó"
                },
                "examples": [
                    {
                        "en": "He'll always have a place in my heart.",
                        "vi": "Anh ấy sẽ luôn có một vị trí trong trái tim tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "with a lot of energy and enthusiasm",
                    "vi": "với rất nhiều năng lượng và nhiệt huyết"
                },
                "examples": [
                    {
                        "en": "They threw themselves heart and soul into the project.",
                        "vi": "Họ đã ném hết trái tim và tâm hồn vào dự án."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that you do not feel sympathy for somebody",
                    "vi": "từng nói rằng bạn không có thiện cảm với ai đó"
                },
                "examples": [
                    {
                        "en": "‘I have to go to Brazil on business.’ ‘My heart bleeds for you!’",
                        "vi": "Tôi phải đi công tác ở Brazil.' 'Trái tim tôi rỉ máu vì bạn!'"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that you feel a lot of sympathy for somebody",
                    "vi": "từng nói rằng bạn cảm thấy có nhiều thiện cảm với ai đó"
                },
                "examples": [
                    {
                        "en": "Our hearts go out to the families of the victims.",
                        "vi": "Trái tim của chúng tôi hướng về gia đình của các nạn nhân."
                    }
                ]
            },
            {
                "define": {
                    "en": "somebody feels nervous or frightened about something",
                    "vi": "ai đó cảm thấy lo lắng hoặc sợ hãi về điều gì đó"
                },
                "examples": [
                    {
                        "en": "My heart was in my mouth as I opened the envelope.",
                        "vi": "Trái tim tôi đang ở trong miệng khi tôi mở phong bì."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that somebody’s intentions are kind and sincere even though they sometimes do the wrong thing",
                    "vi": "được sử dụng để nói rằng ý định của ai đó là tử tế và chân thành mặc dù đôi khi họ làm điều sai trái"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to say that you are not very interested in or enthusiastic about something",
                    "vi": "đã từng nói rằng bạn không hứng thú hoặc không nhiệt tình với điều gì đó"
                },
                "examples": [
                    {
                        "en": "Her heart isn't in her job.",
                        "vi": "Trái tim của cô ấy không ở trong công việc của cô ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that somebody has a sudden feeling of happiness or excitement",
                    "vi": "thường nói rằng ai đó có cảm giác hạnh phúc hoặc phấn khích đột ngột"
                },
                "examples": [
                    {
                        "en": "My heart leapt at the news.",
                        "vi": "Trái tim tôi nhảy lên khi nghe tin này."
                    },
                    {
                        "en": "Her heart leaped with joy.",
                        "vi": "Trái tim cô nhảy lên vì sung sướng."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that somebody has a sudden feeling of fear, excitement, etc.",
                    "vi": "được sử dụng để nói rằng ai đó đột nhiên có cảm giác sợ hãi, phấn khích, v.v."
                },
                "examples": [
                    {
                        "en": "My heart missed a beat when I saw who it was.",
                        "vi": "Trái tim tôi lỡ một nhịp khi tôi nhìn thấy đó là ai."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that somebody suddenly feels sad or depressed about something",
                    "vi": "được sử dụng để nói rằng ai đó đột nhiên cảm thấy buồn hoặc chán nản về điều gì đó"
                },
                "examples": [
                    {
                        "en": "My heart sank when I saw how much work there was left.",
                        "vi": "Trái tim tôi chùng xuống khi tôi thấy bao nhiêu công việc còn lại."
                    },
                    {
                        "en": "She watched him go with a sinking heart.",
                        "vi": "Cô nhìn anh ra đi với trái tim chìm đắm."
                    }
                ]
            },
            {
                "define": {
                    "en": "a home is where the people you love are",
                    "vi": "nhà là nơi có những người bạn yêu thương"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "happy and cheerful",
                    "vi": "vui vẻ và vui vẻ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "if you know something in your heart, you have a strong feeling that it is true",
                    "vi": "nếu bạn biết điều gì đó trong trái tim mình, bạn có cảm giác mạnh mẽ rằng đó là sự thật"
                },
                "examples": [
                    {
                        "en": "She knew in her heart of hearts that she was making the wrong decision.",
                        "vi": "Trong thâm tâm cô biết rằng mình đã quyết định sai lầm."
                    },
                    {
                        "en": "In my heart, I knew it wasn't true.",
                        "vi": "Trong thâm tâm, tôi biết đó không phải là sự thật."
                    }
                ]
            },
            {
                "define": {
                    "en": "it makes somebody feel happy when they see or hear something",
                    "vi": "nó làm cho ai đó cảm thấy hạnh phúc khi họ nhìn thấy hoặc nghe thấy điều gì đó"
                },
                "examples": [
                    {
                        "en": "It does my heart good to see the old place being taken care of so well.",
                        "vi": "Thật là chạnh lòng khi thấy nơi ở cũ được chăm sóc chu đáo như vậy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to act according to what you feel rather than to what you think is sensible",
                    "vi": "hành động theo những gì bạn cảm thấy hơn là theo những gì bạn nghĩ là hợp lý"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to stop hoping for something or trying to do something because you no longer feel confident",
                    "vi": "ngừng hy vọng về điều gì đó hoặc cố gắng làm điều gì đó bởi vì bạn không còn cảm thấy tự tin"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to fall in love with somebody/something",
                    "vi": "phải lòng ai đó / cái gì đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a man/woman who likes the same things or has the same opinions as you",
                    "vi": "một người đàn ông / phụ nữ thích những thứ giống nhau hoặc có cùng quan điểm với bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be unable to do something because you know that it will make somebody sad or upset",
                    "vi": "không thể làm điều gì đó bởi vì bạn biết rằng điều đó sẽ khiến ai đó buồn hoặc khó chịu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "using only your memory",
                    "vi": "chỉ sử dụng trí nhớ của bạn"
                },
                "examples": [
                    {
                        "en": "She's learnt the whole speech off by heart.",
                        "vi": "Cô ấy đã học thuộc lòng toàn bộ bài phát biểu."
                    },
                    {
                        "en": "I've seen the show so often I know all the songs by heart.",
                        "vi": "Tôi đã xem chương trình thường xuyên nên tôi biết thuộc lòng tất cả các bài hát."
                    }
                ]
            },
            {
                "define": {
                    "en": "because of kind feelings, without thinking about what advantage there will be for you",
                    "vi": "vì tình cảm tốt bụng mà không nghĩ đến việc bạn sẽ có lợi gì"
                },
                "examples": [
                    {
                        "en": "You're not telling me he offered to lend you the money out of the goodness of his heart?",
                        "vi": "Bạn không nói với tôi rằng anh ta đề nghị cho bạn vay tiền vì lòng tốt của anh ta?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to tell somebody all your problems, feelings, etc.",
                    "vi": "để nói với ai đó tất cả các vấn đề, cảm xúc của bạn, v.v."
                },
                "examples": [
                    {
                        "en": "Finally, he broke down in tears and poured out his heart to her.",
                        "vi": "Cuối cùng, anh đã gục ngã trong nước mắt và dốc hết trái tim mình cho cô."
                    }
                ]
            },
            {
                "define": {
                    "en": "to want something very much",
                    "vi": "muốn một cái gì đó rất nhiều"
                },
                "examples": [
                    {
                        "en": "They’ve set their heart on a house in the country.",
                        "vi": "Họ đã đặt trái tim của họ vào một ngôi nhà trong nước."
                    }
                ]
            },
            {
                "define": {
                    "en": "very unhappy or disappointed",
                    "vi": "rất không vui hoặc thất vọng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to cry noisily for a long time because you are very sad",
                    "vi": "khóc thật lâu vì bạn rất buồn"
                },
                "examples": [
                    {
                        "en": "She flung herself at his chest and sobbed her heart out.",
                        "vi": "Cô ném mình vào ngực anh và thổn thức trái tim mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody fall in love with you",
                    "vi": "để làm cho ai đó yêu bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to make somebody be afraid, etc.",
                    "vi": "để làm cho ai đó sợ hãi, v.v."
                },
                "examples": [
                    {
                        "en": "The sound of gunfire struck fear into the hearts of the villagers.",
                        "vi": "Tiếng súng đánh vào lòng dân làng nỗi sợ hãi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to feel more positive about something, especially when you thought that you had no chance of achieving something",
                    "vi": "để cảm thấy tích cực hơn về điều gì đó, đặc biệt là khi bạn nghĩ rằng bạn không có cơ hội đạt được điều gì đó"
                },
                "examples": [
                    {
                        "en": "The government can take heart from the latest opinion polls.",
                        "vi": "Chính phủ có thể lấy lòng từ các cuộc thăm dò dư luận mới nhất."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be very upset by something that somebody says or does",
                    "vi": "rất khó chịu bởi điều gì đó mà ai đó nói hoặc làm"
                },
                "examples": [
                    {
                        "en": "You shouldn’t take everything he says to heart.",
                        "vi": "Bạn không nên ghi tất cả những gì anh ấy nói vào lòng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to strongly affect you in an emotional way",
                    "vi": "ảnh hưởng mạnh mẽ đến bạn theo cách cảm xúc"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to destroy the most important part or aspect of something",
                    "vi": "để phá hủy phần hoặc khía cạnh quan trọng nhất của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "Closing the factory tore the heart out of the community.",
                        "vi": "Đóng cửa nhà máy xé nát trái tim của cộng đồng."
                    }
                ]
            },
            {
                "define": {
                    "en": "as much as you want",
                    "vi": "Nhiều như bạn muốn"
                },
                "examples": [
                    {
                        "en": "a supervised play area where children can run around to their heart’s content",
                        "vi": "một khu vực vui chơi có giám sát, nơi trẻ em có thể chạy xung quanh để theo dõi nội dung của trái tim mình"
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody feel happy or sympathetic",
                    "vi": "để làm cho ai đó cảm thấy hạnh phúc hoặc cảm thông"
                },
                "examples": [
                    {
                        "en": "Doesn’t that story just warm the cockles of your heart?",
                        "vi": "Câu chuyện đó chẳng phải chỉ làm ấm lòng bạn sao?"
                    }
                ]
            },
            {
                "define": {
                    "en": "the way to make somebody like or love you",
                    "vi": "cách để làm cho ai đó thích hoặc yêu bạn"
                },
                "examples": [
                    {
                        "en": "The way to a man's heart is through his stomach (= by giving him good food).",
                        "vi": "Đường đến trái tim của một người đàn ông là thông qua dạ dày của anh ta (= cho anh ta thức ăn ngon)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to allow your feelings to be seen by other people",
                    "vi": "để cho phép người khác nhìn thấy cảm xúc của bạn"
                },
                "examples": [
                    {
                        "en": "He’s not one to wear his heart on his sleeve.",
                        "vi": "Anh ấy không phải là người để mặc trái tim của mình trên tay áo của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "if a person does not know about something that they would normally think was bad, then it cannot hurt them",
                    "vi": "nếu một người không biết về điều gì đó mà họ thường nghĩ là tồi tệ, thì điều đó không thể làm tổn thương họ"
                },
                "examples": [
                    {
                        "en": "What does it matter if I use his flat while he’s away? What the eye doesn’t see…!",
                        "vi": "Có vấn đề gì nếu tôi sử dụng căn hộ của anh ấy khi anh ấy đi vắng? Những gì mắt không thấy…!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody love you",
                    "vi": "để làm cho ai đó yêu bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "completely",
                    "vi": "hoàn toàn"
                },
                "examples": [
                    {
                        "en": "I hope with all my heart that things work out for you.",
                        "vi": "Tôi hy vọng với tất cả trái tim của tôi rằng mọi thứ sẽ thuận lợi cho bạn."
                    },
                    {
                        "en": "I wish you well with all my heart.",
                        "vi": "Tôi cầu chúc bạn khỏe mạnh với tất cả trái tim của tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "thinking and behaving like a young person even when you are old",
                    "vi": "suy nghĩ và hành xử như một người trẻ ngay cả khi bạn đã già"
                },
                "examples": [
                    {
                        "en": "My father is 76 but he’s still young at heart.",
                        "vi": "Cha tôi đã 76 nhưng trái tim ông vẫn còn trẻ."
                    },
                    {
                        "en": "He's over 70, but he's young at heart.",
                        "vi": "Ông ấy đã ngoài 70, nhưng tâm hồn còn trẻ."
                    }
                ]
            }
        ]
    },
    {
        "id": "dc61a95f66ca42e9816d0751035600b1",
        "word": "breath",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/breθ/",
            "us": "/breθ/"
        },
        "nearby": [
            {
                "word": "breast pump",
                "pos": "noun"
            },
            {
                "word": "breaststroke",
                "pos": "noun"
            },
            {
                "word": "breath",
                "pos": "noun"
            },
            {
                "word": "breathable",
                "pos": "adjective"
            },
            {
                "word": "breathalyse",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the air that you take into your lungs and send out again",
                    "vi": "không khí bạn hút vào phổi và thải ra ngoài"
                },
                "examples": [
                    {
                        "en": "His breath smelt of garlic.",
                        "vi": "Hơi thở anh thơm mùi tỏi."
                    },
                    {
                        "en": "bad breath (= that smells bad)",
                        "vi": "hôi miệng (= có mùi hôi)"
                    },
                    {
                        "en": "She was very short of breath (= had difficulty breathing).",
                        "vi": "Cô ấy rất khó thở (= khó thở)."
                    },
                    {
                        "en": "Patients develop a cough and shortness of breath.",
                        "vi": "Bệnh nhân xuất hiện ho và khó thở."
                    },
                    {
                        "en": "There was a sharp intake of breath in the courtroom.",
                        "vi": "Có một luồng hơi thở dồn dập trong phòng xử án."
                    },
                    {
                        "en": "We had to stop for breath before we got to the top.",
                        "vi": "Chúng tôi phải ngừng thở trước khi lên đến đỉnh."
                    },
                    {
                        "en": "While there is breath left in my body, I will refuse.",
                        "vi": "Trong khi còn hơi thở trong cơ thể, tôi sẽ từ chối."
                    }
                ]
            },
            {
                "define": {
                    "en": "an amount of air that enters the lungs at one time",
                    "vi": "một lượng không khí đi vào phổi cùng một lúc"
                },
                "examples": [
                    {
                        "en": "Take a deep breath and try to relax.",
                        "vi": "Hít thở sâu và cố gắng thư giãn."
                    },
                    {
                        "en": "He recited the whole poem in one breath.",
                        "vi": "Anh đọc thuộc lòng cả bài thơ trong một hơi."
                    },
                    {
                        "en": "He sucked in a deep breath.",
                        "vi": "Anh hít một hơi thật sâu."
                    }
                ]
            },
            {
                "define": {
                    "en": "a small amount of something; slight evidence of something",
                    "vi": "một số lượng nhỏ của một cái gì đó; bằng chứng nhẹ về điều gì đó"
                },
                "examples": [
                    {
                        "en": "a breath of suspicion/scandal",
                        "vi": "hơi thở của sự nghi ngờ / bê bối"
                    }
                ]
            },
            {
                "define": {
                    "en": "a slight movement of air",
                    "vi": "một chuyển động nhẹ của không khí"
                },
                "examples": [
                    {
                        "en": "It was a still day, without a breath of wind.",
                        "vi": "Đó là một ngày tĩnh lặng, không một chút gió."
                    }
                ]
            },
            {
                "define": {
                    "en": "clean air breathed in after being indoors or in a dirty atmosphere",
                    "vi": "không khí sạch được hít vào sau khi ở trong nhà hoặc trong bầu không khí bẩn"
                },
                "examples": [
                    {
                        "en": "We'll get a breath of fresh air at lunchtime.",
                        "vi": "Chúng ta sẽ được hít thở không khí trong lành vào giờ ăn trưa."
                    },
                    {
                        "en": "I'm going outside for a breath of fresh air.",
                        "vi": "Tôi ra ngoài hít thở không khí trong lành."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person, thing or place that is new and different and therefore interesting and exciting",
                    "vi": "một người, sự vật hoặc địa điểm mới và khác biệt và do đó thú vị và hấp dẫn"
                },
                "examples": [
                    {
                        "en": "The new secretary is a breath of fresh air.",
                        "vi": "Thư ký mới là một luồng gió mới."
                    }
                ]
            },
            {
                "define": {
                    "en": "an essential part of a person’s existence",
                    "vi": "một phần thiết yếu của sự tồn tại của một người"
                },
                "examples": [
                    {
                        "en": "Playing the violin has been the breath of life to her for over 20 years.",
                        "vi": "Chơi violin đã là hơi thở cuộc sống của cô trong hơn 20 năm qua."
                    }
                ]
            },
            {
                "define": {
                    "en": "to stop breathing for a moment because of fear, shock, etc.",
                    "vi": "tắt thở trong giây lát vì sợ hãi, choáng váng, v.v."
                },
                "examples": [
                    {
                        "en": "When he said he had resigned, I caught my breath in surprise.",
                        "vi": "Khi anh ấy nói rằng anh ấy đã từ chức, tôi đã thở phào vì ngạc nhiên."
                    }
                ]
            },
            {
                "define": {
                    "en": "to start to be able to breathe normally again after running or doing exercise that makes you tired",
                    "vi": "bắt đầu có thể thở bình thường trở lại sau khi chạy hoặc tập thể dục khiến bạn mệt mỏi"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to stop doing something and rest",
                    "vi": "ngừng làm điều gì đó và nghỉ ngơi"
                },
                "examples": [
                    {
                        "en": "She talks all the time and hardly stops to draw breath.",
                        "vi": "Cô ấy nói liên tục và hầu như không dừng lại để thở."
                    },
                    {
                        "en": "He spoke solidly for twenty minutes, barely pausing to draw breath.",
                        "vi": "Anh ta nói chắc nịch trong hai mươi phút, gần như không ngừng thở."
                    }
                ]
            },
            {
                "define": {
                    "en": "to live; to be alive",
                    "vi": "sống; được sống"
                },
                "examples": [
                    {
                        "en": "He was as kind a man as ever drew breath.",
                        "vi": "Anh ấy là một người đàn ông tốt bụng như đã từng thở."
                    }
                ]
            },
            {
                "define": {
                    "en": "to breathe normally again after running or doing exercise that makes you tired",
                    "vi": "thở bình thường trở lại sau khi chạy hoặc tập thể dục khiến bạn mệt mỏi"
                },
                "examples": [
                    {
                        "en": "I needed a few minutes to get my breath back after the run.",
                        "vi": "Tôi cần một vài phút để lấy lại hơi thở sau khi chạy."
                    },
                    {
                        "en": "She paused to catch her breath.",
                        "vi": "Cô dừng lại để lấy lại hơi thở."
                    }
                ]
            },
            {
                "define": {
                    "en": "to stop breathing for a short time",
                    "vi": "ngừng thở trong một thời gian ngắn"
                },
                "examples": [
                    {
                        "en": "Hold your breath and count to ten.",
                        "vi": "Giữ hơi thở của bạn và đếm đến mười."
                    },
                    {
                        "en": "How long can you hold your breath for?",
                        "vi": "Bạn có thể nín thở trong bao lâu?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be nervous while you are waiting for something that you are anxious about",
                    "vi": "hồi hộp trong khi bạn đang chờ đợi điều gì đó mà bạn đang lo lắng"
                },
                "examples": [
                    {
                        "en": "He held his breath while the results were read out.",
                        "vi": "Anh ta nín thở khi kết quả được đọc ra."
                    }
                ]
            },
            {
                "define": {
                    "en": "people say don’t hold your breath! to emphasize that something will take a long time or may not happen",
                    "vi": "người ta nói đừng nín thở! để nhấn mạnh rằng điều gì đó sẽ mất nhiều thời gian hoặc có thể không xảy ra"
                },
                "examples": [
                    {
                        "en": "She said she'd do it this week, but don't hold your breath!",
                        "vi": "Cô ấy nói rằng cô ấy sẽ làm điều đó trong tuần này, nhưng đừng nín thở!"
                    }
                ]
            },
            {
                "define": {
                    "en": "immediately after saying something that suggests the opposite intention or meaning",
                    "vi": "ngay sau khi nói điều gì đó gợi ý hoặc ý nghĩa ngược lại"
                },
                "examples": [
                    {
                        "en": "He praised my work and in the same breath told me I would have to leave.",
                        "vi": "Anh ấy khen ngợi công việc của tôi và đồng thanh nói với tôi rằng tôi sẽ phải ra đi."
                    }
                ]
            },
            {
                "define": {
                    "en": "the last moment of a person’s life",
                    "vi": "khoảnh khắc cuối cùng của cuộc đời một người"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "having difficulty breathing after exercise",
                    "vi": "khó thở sau khi tập thể dục"
                },
                "examples": [
                    {
                        "en": "We were out of breath after only five minutes.",
                        "vi": "Chúng tôi đã tắt thở chỉ sau năm phút."
                    },
                    {
                        "en": "I'm a bit out of breath after my run.",
                        "vi": "Tôi hơi hụt hơi sau khi chạy."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to tell somebody that it is not worth wasting time and effort saying something because it will not change anything",
                    "vi": "được sử dụng để nói với ai đó rằng không đáng lãng phí thời gian và công sức để nói điều gì đó bởi vì nó sẽ không thay đổi bất cứ điều gì"
                },
                "examples": [
                    {
                        "en": "Save your breath—you'll never persuade her.",
                        "vi": "Hãy tiết kiệm hơi thở của bạn — bạn sẽ không bao giờ thuyết phục được cô ấy."
                    },
                    {
                        "en": "It's useless talking to him—you may as well save your breath.",
                        "vi": "Nói chuyện với anh ấy cũng vô ích - bạn cũng có thể tiết kiệm được hơi thở của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to say something quietly so that people cannot hear",
                    "vi": "nói điều gì đó thật nhẹ nhàng để mọi người không thể nghe thấy"
                },
                "examples": [
                    {
                        "en": "‘Rubbish!’ she muttered under her breath.",
                        "vi": "Rác!' cô lầm bầm trong hơi thở của mình."
                    },
                    {
                        "en": "He was whispering rude remarks about her under his breath.",
                        "vi": "Anh đang thì thầm những lời nhận xét thô lỗ về cô."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be very surprising or beautiful",
                    "vi": "rất đáng ngạc nhiên hoặc đẹp"
                },
                "examples": [
                    {
                        "en": "My first view of the island from the air took my breath away.",
                        "vi": "Cái nhìn đầu tiên của tôi về hòn đảo từ trên không đã lấy đi hơi thở của tôi."
                    },
                    {
                        "en": "The sheer audacity of the man took my breath away.",
                        "vi": "Sự táo bạo tuyệt đối của người đàn ông đã khiến tôi mất hồn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to say something that nobody takes any notice of",
                    "vi": "để nói điều gì đó mà không ai để ý đến"
                },
                "examples": [
                    {
                        "en": "You're just wasting your breath. She never listens.",
                        "vi": "Bạn chỉ đang lãng phí hơi thở của bạn. Cô ấy không bao giờ lắng nghe."
                    }
                ]
            },
            {
                "define": {
                    "en": "feeling very anxious or excited",
                    "vi": "cảm thấy rất lo lắng hoặc vui mừng"
                },
                "examples": [
                    {
                        "en": "We waited with bated breath for the winner to be announced.",
                        "vi": "Chúng tôi chờ đợi người chiến thắng được công bố."
                    },
                    {
                        "en": "We waited for the decision with bated breath.",
                        "vi": "Chúng tôi chờ đợi quyết định với hơi thở dồn dập."
                    }
                ]
            }
        ]
    },
    {
        "id": "b2fed6d6132c44189f911b76ee42be42",
        "word": "breathe",
        "pos": "verb",
        "level": "b1",
        "phonetic": {
            "uk": "/briːð/",
            "us": "/briːð/"
        },
        "nearby": [
            {
                "word": "breathalyse",
                "pos": "verb"
            },
            {
                "word": "breathalyser",
                "pos": "noun"
            },
            {
                "word": "breathe",
                "pos": "verb"
            },
            {
                "word": "breathe in",
                "pos": "phrasal verb"
            },
            {
                "word": "breathe out",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to take air into your lungs and send it out again through your nose or mouth",
                    "vi": "để lấy không khí vào phổi của bạn và đưa nó ra ngoài qua mũi hoặc miệng của bạn"
                },
                "examples": [
                    {
                        "en": "He breathed deeply before speaking again.",
                        "vi": "Anh thở sâu trước khi nói lại."
                    },
                    {
                        "en": "The air was so cold we could hardly breathe.",
                        "vi": "Không khí lạnh đến mức chúng tôi khó thở."
                    },
                    {
                        "en": "She was beginning to breathe more easily.",
                        "vi": "Cô bắt đầu dễ thở hơn."
                    },
                    {
                        "en": "He was breathing heavily after his exertions.",
                        "vi": "Anh ta thở hồng hộc sau khi gắng sức."
                    },
                    {
                        "en": "breathe something Most people don't realize that they are breathing polluted air.",
                        "vi": "hít thở thứ gì đó Hầu hết mọi người không nhận ra rằng họ đang hít thở không khí ô nhiễm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to send air, smoke or a particular smell out of your mouth",
                    "vi": "để đưa không khí, khói hoặc một mùi cụ thể ra khỏi miệng của bạn"
                },
                "examples": [
                    {
                        "en": "He came up close, breathing alcohol fumes all over me.",
                        "vi": "Anh đến gần, hơi thở bốc khói nồng nặc khắp người tôi."
                    },
                    {
                        "en": "(figurative) She rushed into my office breathing fire and threatening me with a lawyer.",
                        "vi": "(nghĩa bóng) Cô ấy xông vào văn phòng của tôi, xả súng và đe dọa tôi với một luật sư."
                    }
                ]
            },
            {
                "define": {
                    "en": "to say something quietly",
                    "vi": "nói điều gì đó lặng lẽ"
                },
                "examples": [
                    {
                        "en": "‘I'm over here,’ she breathed.",
                        "vi": "Tôi ở đây, cô thở."
                    }
                ]
            },
            {
                "define": {
                    "en": "if you allow wine to breathe, you open the bottle and let air get in before you drink it",
                    "vi": "Nếu bạn cho phép rượu vang thở, bạn mở chai và để không khí vào trước khi uống"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "if cloth, leather, skin, etc. can breathe, air can move around or through it",
                    "vi": "nếu vải, da, da, v.v. có thể thở, không khí có thể di chuyển xung quanh hoặc xuyên qua nó"
                },
                "examples": [
                    {
                        "en": "Cotton clothing allows your skin to breathe.",
                        "vi": "Quần áo cotton cho phép làn da của bạn thở."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be full of a particular feeling or quality",
                    "vi": "để có đầy đủ một cảm giác hoặc chất lượng cụ thể"
                },
                "examples": [
                    {
                        "en": "Her performance breathed wit and charm.",
                        "vi": "Màn trình diễn của cô ấy mang hơi thở hóm hỉnh và quyến rũ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to feel calm again after something unpleasant or frightening has ended",
                    "vi": "để cảm thấy bình tĩnh trở lại sau khi điều gì đó khó chịu hoặc đáng sợ đã kết thúc"
                },
                "examples": [
                    {
                        "en": "Once he was safely back in prison, she was able to breathe easily again.",
                        "vi": "Khi anh ta đã trở lại nhà tù một cách an toàn, cô đã có thể thở dễ dàng trở lại."
                    }
                ]
            },
            {
                "define": {
                    "en": "to watch closely what somebody is doing in a way that makes them feel anxious and/or annoyed",
                    "vi": "để theo dõi chặt chẽ những gì ai đó đang làm theo cách khiến họ cảm thấy lo lắng và / hoặc khó chịu"
                },
                "examples": [
                    {
                        "en": "I can’t get any work done with you breathing down my neck.",
                        "vi": "Tôi không thể hoàn thành bất kỳ công việc nào nếu bạn thở dài trên cổ của tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to relax and stop worrying",
                    "vi": "thư giãn và ngừng lo lắng"
                },
                "examples": [
                    {
                        "en": "You can rest easy—I'm not going to tell anyone.",
                        "vi": "Bạn có thể yên tâm — tôi sẽ không nói với ai cả."
                    },
                    {
                        "en": "I can sleep easy knowing that she's safely home.",
                        "vi": "Tôi có thể ngủ dễ dàng khi biết rằng cô ấy đã về nhà an toàn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to die",
                    "vi": "chết"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to improve something by introducing new ideas and making people more interested in it",
                    "vi": "để cải thiện điều gì đó bằng cách giới thiệu những ý tưởng mới và khiến mọi người quan tâm hơn đến nó"
                },
                "examples": [
                    {
                        "en": "The results of their research have breathed new life into the debate.",
                        "vi": "Kết quả nghiên cứu của họ đã thổi một luồng sinh khí mới vào cuộc tranh luận."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be very enthusiastic about something",
                    "vi": "rất nhiệt tình về điều gì đó"
                },
                "examples": [
                    {
                        "en": "He just lives and breathes football.",
                        "vi": "Anh ấy chỉ sống và thở bóng đá."
                    }
                ]
            }
        ]
    },
    {
        "id": "54be3651e88b4f4d9ee171917335f4dc",
        "word": "breathing",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈbriːðɪŋ/",
            "us": "/ˈbriːðɪŋ/"
        },
        "nearby": [
            {
                "word": "breathe out",
                "pos": "phrasal verb"
            },
            {
                "word": "breather",
                "pos": "noun"
            },
            {
                "word": "breathing",
                "pos": "noun"
            },
            {
                "word": "breathing room",
                "pos": "noun"
            },
            {
                "word": "breathing space",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the action of taking air into the lungs and sending it out again",
                    "vi": "hành động lấy không khí vào phổi và đưa nó ra ngoài một lần nữa"
                },
                "examples": [
                    {
                        "en": "Her breathing became steady and she fell asleep.",
                        "vi": "Hơi thở của cô trở nên ổn định và cô chìm vào giấc ngủ."
                    },
                    {
                        "en": "Deep breathing exercises will help you relax.",
                        "vi": "Các bài tập thở sâu sẽ giúp bạn thư giãn."
                    },
                    {
                        "en": "Heavy (= loud) breathing was all I could hear.",
                        "vi": "Tôi chỉ nghe thấy tiếng thở nặng nhọc (= to)."
                    },
                    {
                        "en": "Firefighters wearing breathing apparatus went into the house.",
                        "vi": "Lính cứu hỏa đeo thiết bị thở đi vào nhà."
                    },
                    {
                        "en": "The drug is used to treat breathing difficulties caused by asthma.",
                        "vi": "Thuốc được dùng để điều trị chứng khó thở do hen suyễn."
                    },
                    {
                        "en": "Are you having difficulty in breathing?",
                        "vi": "Bạn có đang bị khó thở không?"
                    }
                ]
            }
        ]
    },
    {
        "id": "f443cddd2bc04d0e90ed7bd331ebd371",
        "word": "cell",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/sel/",
            "us": "/sel/"
        },
        "nearby": [
            {
                "word": "celibate",
                "pos": "adjective"
            },
            {
                "word": "celibate",
                "pos": "noun"
            },
            {
                "word": "cell",
                "pos": "noun"
            },
            {
                "word": "cellar",
                "pos": "noun"
            },
            {
                "word": "cellist",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the smallest unit of living matter that can exist on its own. All plants and animals are made up of cells.",
                    "vi": "đơn vị nhỏ nhất của vật chất sống có thể tự tồn tại. Tất cả thực vật và động vật đều được tạo thành từ các tế bào."
                },
                "examples": [
                    {
                        "en": "red and white blood cells",
                        "vi": "tế bào máu đỏ và trắng"
                    },
                    {
                        "en": "brain/nerve/cancer cells",
                        "vi": "tế bào não / thần kinh / ung thư"
                    },
                    {
                        "en": "the nucleus of a cell",
                        "vi": "nhân của một tế bào"
                    },
                    {
                        "en": "Cells divide and form new cells.",
                        "vi": "Tế bào phân chia và hình thành tế bào mới."
                    }
                ]
            },
            {
                "define": {
                    "en": "a room for one or more prisoners in a prison or police station",
                    "vi": "phòng cho một hoặc nhiều tù nhân trong nhà tù hoặc đồn cảnh sát"
                },
                "examples": [
                    {
                        "en": "in a cell He spent a night in a prison cell.",
                        "vi": "trong một phòng giam Anh ấy đã trải qua một đêm trong một phòng giam của nhà tù."
                    }
                ]
            },
            {
                "define": {
                    "en": "a small room without much furniture in which a monk or nun lives",
                    "vi": "một căn phòng nhỏ không có nhiều đồ đạc trong đó một nhà sư hoặc nữ tu sĩ sống"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "each of the small sections that together form a larger structure, for example a honeycomb",
                    "vi": "mỗi phần nhỏ cùng nhau tạo thành một cấu trúc lớn hơn, ví dụ như một tổ ong"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a device for producing an electric current, for example by the action of chemicals or light",
                    "vi": "một thiết bị để tạo ra dòng điện, ví dụ bằng tác động của hóa chất hoặc ánh sáng"
                },
                "examples": [
                    {
                        "en": "a photoelectric cell",
                        "vi": "một tế bào quang điện"
                    }
                ]
            },
            {
                "define": {
                    "en": "a small group of people who work as part of a larger political organization, especially secretly",
                    "vi": "một nhóm nhỏ những người hoạt động như một phần của một tổ chức chính trị lớn hơn, đặc biệt là bí mật"
                },
                "examples": [
                    {
                        "en": "a terrorist cell",
                        "vi": "một phòng giam khủng bố"
                    }
                ]
            },
            {
                "define": {
                    "en": "one of the small squares in a spreadsheet computer program in which you enter a single piece of data",
                    "vi": "một trong những ô vuông nhỏ trong chương trình máy tính bảng tính trong đó bạn nhập một phần dữ liệu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a phone that does not have wires and works by radio, and that you can carry with you and use anywhere",
                    "vi": "điện thoại không có dây và hoạt động bằng radio và bạn có thể mang theo bên mình và sử dụng ở bất cứ đâu"
                },
                "examples": [
                    {
                        "en": "Call me on my cell.",
                        "vi": "Gọi cho tôi vào di động của tôi."
                    }
                ]
            }
        ]
    },
    {
        "id": "7729cc726edc418db3d322a9f52bc7df",
        "word": "joint",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/dʒɔɪnt/",
            "us": "/dʒɔɪnt/"
        },
        "nearby": [
            {
                "word": "join in",
                "pos": "phrasal verb"
            },
            {
                "word": "joint",
                "pos": "adjective"
            },
            {
                "word": "joint",
                "pos": "noun"
            },
            {
                "word": "joint",
                "pos": "verb"
            },
            {
                "word": "Joint Chiefs of Staff",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a place where two bones are joined together in the body in a way that enables them to bend and move",
                    "vi": "một nơi mà hai xương liên kết với nhau trong cơ thể theo cách cho phép chúng uốn cong và di chuyển"
                },
                "examples": [
                    {
                        "en": "inflammation of the knee joint",
                        "vi": "viêm khớp gối"
                    },
                    {
                        "en": "My joints are really stiff this morning.",
                        "vi": "Các khớp của tôi thực sự cứng sáng nay."
                    }
                ]
            },
            {
                "define": {
                    "en": "a place where two or more parts of an object are joined together, especially to form a corner",
                    "vi": "một nơi mà hai hoặc nhiều phần của một đối tượng được nối với nhau, đặc biệt là để tạo thành một góc"
                },
                "examples": [
                    {
                        "en": "a joint between two lengths of copper",
                        "vi": "một mối nối giữa hai chiều dài của đồng"
                    },
                    {
                        "en": "The joint was sealed with waterproof tape.",
                        "vi": "Mối nối đã được niêm phong bằng băng không thấm nước."
                    },
                    {
                        "en": "To get a strong joint, the groove must be completely filled with glue.",
                        "vi": "Để có được một mối nối chắc chắn, rãnh phải được lấp đầy hoàn toàn bằng keo."
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of roast meat",
                    "vi": "một miếng thịt quay"
                },
                "examples": [
                    {
                        "en": "a joint of beef",
                        "vi": "một miếng thịt bò"
                    },
                    {
                        "en": "the Sunday joint (= one traditionally eaten on a Sunday)",
                        "vi": "Chủ nhật (= một món ăn theo truyền thống vào Chủ nhật)"
                    }
                ]
            },
            {
                "define": {
                    "en": "a place where people meet to eat, drink, dance, etc., especially one that is cheap",
                    "vi": "nơi mọi người gặp gỡ để ăn, uống, khiêu vũ, v.v., đặc biệt là một nơi có giá rẻ"
                },
                "examples": [
                    {
                        "en": "a fast-food joint",
                        "vi": "một cửa hàng thức ăn nhanh"
                    },
                    {
                        "en": "The joint was jumping (= full of people and activity).",
                        "vi": "Các khớp đã nhảy (= đầy người và hoạt động)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a cigarette containing marijuana (= an illegal drug)",
                    "vi": "một điếu thuốc có chứa cần sa (= một loại thuốc bất hợp pháp)"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to look carefully around a building so that you can plan how to steal things from it at a later time",
                    "vi": "để xem xét cẩn thận xung quanh một tòa nhà để bạn có thể lập kế hoạch lấy cắp đồ đạc từ đó vào thời gian sau"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "pushed out of its correct position",
                    "vi": "bị đẩy ra khỏi vị trí chính xác của nó"
                },
                "examples": [
                    {
                        "en": "She put her hip out of joint in the accident.",
                        "vi": "Cô ấy đã bị trật khớp háng trong vụ tai nạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "not working or behaving in the normal way",
                    "vi": "không hoạt động hoặc hoạt động theo cách bình thường"
                },
                "examples": [
                    {
                        "en": "Time is thrown completely out of joint in the opening chapters.",
                        "vi": "Thời gian trôi qua hoàn toàn trong các chương mở đầu."
                    }
                ]
            },
            {
                "define": {
                    "en": "to upset or annoy somebody, especially by not giving them enough attention",
                    "vi": "làm khó chịu hoặc làm phiền ai đó, đặc biệt là bằng cách không dành đủ sự quan tâm cho họ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "3ad322144af14e4bb4b15984bd3c5f29",
        "word": "lung",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/lʌŋ/",
            "us": "/lʌŋ/"
        },
        "nearby": [
            {
                "word": "lunchtime",
                "pos": "noun"
            },
            {
                "word": "Lundy",
                "pos": ""
            },
            {
                "word": "lung",
                "pos": "noun"
            },
            {
                "word": "lung-busting",
                "pos": "adjective"
            },
            {
                "word": "lunge",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "either of the two organs in the chest that you use for breathing",
                    "vi": "một trong hai cơ quan trong lồng ngực mà bạn dùng để thở"
                },
                "examples": [
                    {
                        "en": "Her father died of lung cancer.",
                        "vi": "Cha cô qua đời vì bệnh ung thư phổi."
                    },
                    {
                        "en": "Obesity can raise the risk of lung disease.",
                        "vi": "Béo phì có thể làm tăng nguy cơ mắc bệnh phổi."
                    },
                    {
                        "en": "He will need a lung transplant if he is going to survive.",
                        "vi": "Anh ấy sẽ cần ghép phổi nếu muốn sống sót."
                    },
                    {
                        "en": "Some of these substances are known to damage lung tissue.",
                        "vi": "Một số chất này được biết là có thể làm tổn thương mô phổi."
                    },
                    {
                        "en": "Coughing clears the lungs of mucus.",
                        "vi": "Ho làm sạch phổi chất nhầy."
                    },
                    {
                        "en": "She felt the sun on her skin and fresh air in her lungs.",
                        "vi": "Cô cảm nhận được ánh nắng trên da và không khí trong lành tràn vào phổi."
                    },
                    {
                        "en": "He's been hospitalized for a blood clot in his lung.",
                        "vi": "Anh ấy đã phải nhập viện vì một cục máu đông trong phổi."
                    },
                    {
                        "en": "(humorous) She has a fine pair of lungs! (= she can sing or shout loudly)",
                        "vi": "(hài hước) Cô ấy có một cặp phổi tốt! (= cô ấy có thể hát hoặc hét to)"
                    }
                ]
            }
        ]
    },
    {
        "id": "9eebf5a8d9ee4e6cb8baee744069df54",
        "word": "nerve",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/nɜːv/",
            "us": "/nɜːrv/"
        },
        "nearby": [
            {
                "word": "nerd",
                "pos": "noun"
            },
            {
                "word": "nerdy",
                "pos": "adjective"
            },
            {
                "word": "nerve",
                "pos": "noun"
            },
            {
                "word": "nerve",
                "pos": "verb"
            },
            {
                "word": "nerve agent",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "any of the long fibres that carry messages between the brain and parts of the body, enabling you to move, feel pain, etc.",
                    "vi": "bất kỳ sợi dài nào mang thông điệp giữa não và các bộ phận của cơ thể, cho phép bạn cử động, cảm thấy đau, v.v."
                },
                "examples": [
                    {
                        "en": "the optic nerve",
                        "vi": "dây thần kinh thị giác"
                    },
                    {
                        "en": "He's off work with a trapped nerve in his neck.",
                        "vi": "Anh ấy đang nghỉ việc với một dây thần kinh bị kẹt ở cổ."
                    },
                    {
                        "en": "Every nerve in her body was tense.",
                        "vi": "Mọi dây thần kinh trong cơ thể cô đều căng thẳng."
                    },
                    {
                        "en": "The illness kills nerve cells and causes chronic fatigue.",
                        "vi": "Căn bệnh này giết chết các tế bào thần kinh và gây ra tình trạng mệt mỏi mãn tính."
                    },
                    {
                        "en": "Pain occurs when the nerve fibres are damaged.",
                        "vi": "Đau xảy ra khi các sợi thần kinh bị tổn thương."
                    },
                    {
                        "en": "Signals are transmitted from the nerve endings to the brain.",
                        "vi": "Tín hiệu được truyền từ đầu dây thần kinh đến não."
                    },
                    {
                        "en": "The disease can also cause nerve damage.",
                        "vi": "Bệnh cũng có thể gây tổn thương dây thần kinh."
                    }
                ]
            },
            {
                "define": {
                    "en": "feelings of worry or stress",
                    "vi": "cảm giác lo lắng hoặc căng thẳng"
                },
                "examples": [
                    {
                        "en": "Even after years as a singer, he still suffers from nerves before a performance.",
                        "vi": "Ngay cả sau nhiều năm làm ca sĩ, anh ấy vẫn bị căng thẳng trước một buổi biểu diễn."
                    },
                    {
                        "en": "I need something to calm my nerves.",
                        "vi": "Tôi cần thứ gì đó để xoa dịu thần kinh của mình."
                    },
                    {
                        "en": "to settle/soothe/steady your nerves",
                        "vi": "để giải quyết / làm dịu / ổn định thần kinh của bạn"
                    },
                    {
                        "en": "Everyone's nerves were on edge (= everyone felt tense).",
                        "vi": "Mọi người đều căng thẳng (= mọi người đều cảm thấy căng thẳng)."
                    },
                    {
                        "en": "He lives on his nerves (= is always worried).",
                        "vi": "Anh ấy sống dựa vào thần kinh của mình (= luôn lo lắng)."
                    },
                    {
                        "en": "By the end of the meal her nerves were completely frayed.",
                        "vi": "Đến cuối bữa ăn, thần kinh của cô hoàn toàn không còn sức lực."
                    }
                ]
            },
            {
                "define": {
                    "en": "the courage to do something difficult or dangerous",
                    "vi": "can đảm để làm điều gì đó khó khăn hoặc nguy hiểm"
                },
                "examples": [
                    {
                        "en": "It took a lot of nerve to take the company to court.",
                        "vi": "Phải rất căng thẳng để đưa công ty ra tòa."
                    },
                    {
                        "en": "I was going to have a go at parachuting but lost my nerve at the last minute.",
                        "vi": "Tôi đã định nhảy dù nhưng bị mất thần kinh vào phút cuối."
                    },
                    {
                        "en": "He held his nerve to win the final set 6–4.",
                        "vi": "Anh ấy đã cố gắng để giành chiến thắng trong set 6–4 cuối cùng."
                    },
                    {
                        "en": "Investors largely kept their nerve and stayed with the company.",
                        "vi": "Các nhà đầu tư chủ yếu giữ vững tâm lý và ở lại với công ty."
                    },
                    {
                        "en": "It was an amazing journey which tested her nerves to the full.",
                        "vi": "Đó là một cuộc hành trình tuyệt vời đã kiểm tra thần kinh của cô ấy một cách đầy đủ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a way of behaving that other people think is rude or not appropriate",
                    "vi": "một cách cư xử mà người khác cho là thô lỗ hoặc không phù hợp"
                },
                "examples": [
                    {
                        "en": "I don't know how you have the nerve to show your face after what you said!",
                        "vi": "Tôi không biết làm thế nào bạn có đủ can đảm để lộ ra khuôn mặt của bạn sau những gì bạn nói!"
                    },
                    {
                        "en": "He's got a nerve asking us for money!",
                        "vi": "Anh ta có gan đòi tiền chúng tôi!"
                    },
                    {
                        "en": "‘Then she demanded to see the manager!’ ‘What a nerve!’",
                        "vi": "Sau đó cô ấy yêu cầu gặp người quản lý!' 'Thật là một thần kinh!'"
                    },
                    {
                        "en": "He had some nerve to insult Mina's cooking.",
                        "vi": "Anh ta có chút gan dạ để xúc phạm công việc nấu nướng của Mina."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be very nervous",
                    "vi": "rất lo lắng"
                },
                "examples": [
                    {
                        "en": "By the time of the interview, I was a bundle of nerves.",
                        "vi": "Vào thời điểm phỏng vấn, tôi đã bó tay."
                    }
                ]
            },
            {
                "define": {
                    "en": "to annoy somebody",
                    "vi": "làm phiền ai đó"
                },
                "examples": [
                    {
                        "en": "That music is starting to get on my nerves.",
                        "vi": "Âm nhạc đó đang bắt đầu làm tôi lo lắng."
                    },
                    {
                        "en": "It really gets on my nerves when people talk loudly on the phone in public.",
                        "vi": "Tôi thực sự lo lắng khi mọi người nói chuyện điện thoại ồn ào ở nơi công cộng."
                    },
                    {
                        "en": "His endless whining really gets on my nerves.",
                        "vi": "Tiếng rên rỉ bất tận của anh ấy thực sự làm tôi lo lắng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be able to remain calm in a difficult or dangerous situation",
                    "vi": "để có thể giữ bình tĩnh trong một tình huống khó khăn hoặc nguy hiểm"
                },
                "examples": [
                    {
                        "en": "You need nerves of steel to be a good poker player.",
                        "vi": "Bạn cần có thần kinh thép để trở thành một người chơi poker giỏi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to mention a subject that makes somebody feel angry, upset, embarrassed, etc.",
                    "vi": "đề cập đến một chủ đề khiến ai đó cảm thấy tức giận, khó chịu, xấu hổ, v.v."
                },
                "examples": [
                    {
                        "en": "You touched a raw nerve when you mentioned his first wife.",
                        "vi": "Bạn đã xúc động mạnh khi nhắc đến người vợ đầu tiên của anh ấy."
                    },
                    {
                        "en": "My remarks about divorce had unwittingly touched a raw nerve.",
                        "vi": "Những nhận xét của tôi về việc ly hôn đã vô tình chạm vào một dây thần kinh thô."
                    },
                    {
                        "en": "The article struck a raw nerve as it revived unpleasant memories.",
                        "vi": "Bài báo đánh vào một dây thần kinh thô khi nó làm sống lại những ký ức khó chịu."
                    }
                ]
            },
            {
                "define": {
                    "en": "to try as hard as you can to do something",
                    "vi": "cố gắng hết sức có thể để làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "He strained every nerve to snatch victory from defeat.",
                        "vi": "Anh ta căng mọi dây thần kinh để giành lấy chiến thắng từ thất bại."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have a strong effect",
                    "vi": "để có một hiệu ứng mạnh mẽ"
                },
                "examples": [
                    {
                        "en": "His work strikes a nerve with people who are attracted to nostalgia.",
                        "vi": "Tác phẩm của anh gây ấn tượng mạnh với những người bị thu hút bởi sự hoài cổ."
                    },
                    {
                        "en": "It seems I struck a nerve with my last post about cell phones.",
                        "vi": "Có vẻ như tôi đã giật mình với bài viết cuối cùng của tôi về điện thoại di động."
                    },
                    {
                        "en": "Nissan may well strike a popular nerve here.",
                        "vi": "Nissan cũng có thể tấn công một thần kinh phổ biến ở đây."
                    }
                ]
            },
            {
                "define": {
                    "en": "an attempt to defeat your opponents by putting pressure on them so that they lose courage or confidence",
                    "vi": "nỗ lực đánh bại đối thủ của bạn bằng cách gây áp lực lên họ để họ mất can đảm hoặc tự tin"
                },
                "examples": [
                    {
                        "en": "The union has been fighting a war of nerves with the management over pay.",
                        "vi": "Công đoàn đã phải đối mặt với một cuộc chiến căng thẳng với việc quản lý quá mức lương."
                    }
                ]
            }
        ]
    },
    {
        "id": "12634cb762b449cb85ef4329c842d027",
        "word": "organ",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈɔːɡən/",
            "us": "/ˈɔːrɡən/"
        },
        "nearby": [
            {
                "word": "the Oregon Trail",
                "pos": ""
            },
            {
                "word": "Oreo",
                "pos": "noun"
            },
            {
                "word": "organ",
                "pos": "noun"
            },
            {
                "word": "organdie",
                "pos": "noun"
            },
            {
                "word": "organ grinder",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a part of the body that has a particular purpose, such as the heart or the brain; part of a plant with a particular purpose",
                    "vi": "một bộ phận của cơ thể có mục đích cụ thể, chẳng hạn như tim hoặc não; một phần của cây với một mục đích cụ thể"
                },
                "examples": [
                    {
                        "en": "the internal organs",
                        "vi": "các cơ quan nội tạng"
                    },
                    {
                        "en": "the sense organs (= the eyes, ears, nose, etc.)",
                        "vi": "các cơ quan giác quan (= mắt, tai, mũi, v.v.)"
                    },
                    {
                        "en": "the sexual/reproductive organs",
                        "vi": "cơ quan sinh dục / sinh sản"
                    },
                    {
                        "en": "an organ transplant/donor",
                        "vi": "ghép tạng / người hiến tặng"
                    },
                    {
                        "en": "the vital organs (= the brain, heart, lungs, etc.)",
                        "vi": "các cơ quan quan trọng (= não, tim, phổi, v.v.)"
                    },
                    {
                        "en": "organ donation/transplantation",
                        "vi": "hiến / cấy ghép nội tạng"
                    },
                    {
                        "en": "He died of multiple organ failure.",
                        "vi": "Anh chết vì suy đa tạng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a penis",
                    "vi": "một dương vật"
                },
                "examples": [
                    {
                        "en": "the male organ",
                        "vi": "cơ quan nam"
                    }
                ]
            },
            {
                "define": {
                    "en": "a large musical instrument with keys like a piano. Sounds are produced by air forced through pipes.",
                    "vi": "một nhạc cụ lớn với các phím như đàn piano. Âm thanh được tạo ra bởi không khí cưỡng bức qua đường ống."
                },
                "examples": [
                    {
                        "en": "She plays the organ in church.",
                        "vi": "Cô ấy chơi đàn organ trong nhà thờ."
                    },
                    {
                        "en": "organ music",
                        "vi": "nhạc organ"
                    },
                    {
                        "en": "an organ recital",
                        "vi": "một buổi biểu diễn nội tạng"
                    }
                ]
            },
            {
                "define": {
                    "en": "a musical instrument similar to a pipe organ, but without pipes",
                    "vi": "một nhạc cụ tương tự như đàn organ nhưng không có ống"
                },
                "examples": [
                    {
                        "en": "an electric organ",
                        "vi": "một cơ quan điện"
                    }
                ]
            },
            {
                "define": {
                    "en": "an official organization that is part of a larger organization and has a special purpose",
                    "vi": "một tổ chức chính thức là một phần của một tổ chức lớn hơn và có mục đích đặc biệt"
                },
                "examples": [
                    {
                        "en": "the organs of government",
                        "vi": "các cơ quan của chính phủ"
                    },
                    {
                        "en": "the central organs of state",
                        "vi": "các cơ quan trung tâm của nhà nước"
                    }
                ]
            },
            {
                "define": {
                    "en": "a newspaper or magazine that gives information about a particular group or organization; a means of communicating the views of a particular group",
                    "vi": "một tờ báo hoặc tạp chí cung cấp thông tin về một nhóm hoặc tổ chức cụ thể; một phương tiện truyền đạt quan điểm của một nhóm cụ thể"
                },
                "examples": [
                    {
                        "en": "The People's Daily is the official organ of the Chinese Communist Party.",
                        "vi": "Nhân dân Nhật báo là cơ quan chính thức của Đảng Cộng sản Trung Quốc."
                    },
                    {
                        "en": "the organs of public opinion (= for example, newspapers, television, radio)",
                        "vi": "các cơ quan của dư luận (= ví dụ: báo chí, truyền hình, đài phát thanh)"
                    }
                ]
            }
        ]
    },
    {
        "id": "8ae4ae369e444499918f1e8ddc382323",
        "word": "adrenaline",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/əˈdrenəlɪn/",
            "us": "/əˈdrenəlɪn/"
        },
        "nearby": [
            {
                "word": "adornment",
                "pos": "noun"
            },
            {
                "word": "adrenal gland",
                "pos": "noun"
            },
            {
                "word": "adrenaline",
                "pos": "noun"
            },
            {
                "word": "Adrian",
                "pos": ""
            },
            {
                "word": "adrift",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a substance produced in the body when you are excited, afraid or angry. It makes the heart beat faster and increases your energy and ability to move quickly.",
                    "vi": "một chất được tạo ra trong cơ thể khi bạn vui mừng, sợ hãi hoặc tức giận. Nó làm cho tim đập nhanh hơn và tăng năng lượng và khả năng di chuyển nhanh chóng của bạn."
                },
                "examples": [
                    {
                        "en": "The excitement at the start of a race can really get the adrenaline flowing.",
                        "vi": "Sự phấn khích khi bắt đầu cuộc đua thực sự có thể khiến adrenaline chảy."
                    },
                    {
                        "en": "an adrenaline rush",
                        "vi": "một cơn sốt adrenaline"
                    },
                    {
                        "en": "a rush/surge of adrenaline",
                        "vi": "một cơn sốt / tăng vọt của adrenaline"
                    },
                    {
                        "en": "A shot of adrenaline was given as an antidote to the wasp sting.",
                        "vi": "Một mũi tiêm adrenaline đã được tiêm như một loại thuốc giải độc cho vết đốt của ong bắp cày."
                    }
                ]
            }
        ]
    },
    {
        "id": "c41b0b28512c4c1bafc07595757af6d5",
        "word": "artery",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈɑːtəri/",
            "us": "/ˈɑːrtəri/"
        },
        "nearby": [
            {
                "word": "arteriole",
                "pos": "noun"
            },
            {
                "word": "arteriosclerosis",
                "pos": "noun"
            },
            {
                "word": "artery",
                "pos": "noun"
            },
            {
                "word": "artesian",
                "pos": "adjective"
            },
            {
                "word": "Artex",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "any of the tubes that carry blood from the heart to other parts of the body",
                    "vi": "bất kỳ ống nào dẫn máu từ tim đến các bộ phận khác của cơ thể"
                },
                "examples": [
                    {
                        "en": "blocked arteries",
                        "vi": "động mạch bị tắc nghẽn"
                    }
                ]
            },
            {
                "define": {
                    "en": "a large and important road, river, railway line, etc.",
                    "vi": "một con đường lớn và quan trọng, đường sông, tuyến đường sắt, v.v."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "fefd6a6690344796bf6bcf941f6bbeb6",
        "word": "blood vessel",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈblʌd vesl/",
            "us": "/ˈblʌd vesl/"
        },
        "nearby": [
            {
                "word": "blood transfusion",
                "pos": "noun"
            },
            {
                "word": "blood type",
                "pos": "noun"
            },
            {
                "word": "blood vessel",
                "pos": "noun"
            },
            {
                "word": "bloody1",
                "pos": "adjective"
            },
            {
                "word": "bloody2",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "any of the tubes through which blood flows through the body",
                    "vi": "bất kỳ ống nào mà máu chảy qua cơ thể"
                },
                "examples": [
                    {
                        "en": "broken blood vessels",
                        "vi": "mạch máu bị vỡ"
                    },
                    {
                        "en": "The knife had missed the major blood vessels.",
                        "vi": "Con dao đã bắn trượt các mạch máu lớn."
                    },
                    {
                        "en": "blood vessels supplying nutrition to the skin",
                        "vi": "mạch máu cung cấp dinh dưỡng cho da"
                    }
                ]
            }
        ]
    },
    {
        "id": "09eeac76d7394f33b8fcfdee5c90a88d",
        "word": "circulation",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌsɜːkjəˈleɪʃn/",
            "us": "/ˌsɜːrkjəˈleɪʃn/"
        },
        "nearby": [
            {
                "word": "circular saw",
                "pos": "noun"
            },
            {
                "word": "circulate",
                "pos": "verb"
            },
            {
                "word": "circulation",
                "pos": "noun"
            },
            {
                "word": "circulatory",
                "pos": "adjective"
            },
            {
                "word": "circum-",
                "pos": "prefix"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the movement of blood around the body",
                    "vi": "sự di chuyển của máu xung quanh cơ thể"
                },
                "examples": [
                    {
                        "en": "Regular exercise will improve blood circulation.",
                        "vi": "Tập thể dục thường xuyên sẽ cải thiện lưu thông máu."
                    },
                    {
                        "en": "to have good/bad circulation",
                        "vi": "lưu thông tốt / xấu"
                    }
                ]
            },
            {
                "define": {
                    "en": "the passing or spreading of something from one person or place to another",
                    "vi": "sự truyền hoặc lan truyền của một cái gì đó từ người này sang nơi khác"
                },
                "examples": [
                    {
                        "en": "the circulation of money/information/ideas",
                        "vi": "sự lưu thông của tiền / thông tin / ý tưởng"
                    },
                    {
                        "en": "in circulation A number of forged tickets are in circulation.",
                        "vi": "đang lưu hành Một số vé giả đang được lưu hành."
                    },
                    {
                        "en": "The coins were taken out of circulation.",
                        "vi": "Các đồng tiền đã được đưa ra khỏi lưu thông."
                    },
                    {
                        "en": "Copies of the magazine were withdrawn from circulation.",
                        "vi": "Các bản sao của tạp chí đã bị rút khỏi lưu hành."
                    },
                    {
                        "en": "putting computer viruses into circulation",
                        "vi": "đưa vi rút máy tính vào lưu hành"
                    }
                ]
            },
            {
                "define": {
                    "en": "the usual number of copies of a newspaper or magazine that are sold each day, week, etc.",
                    "vi": "số lượng bản sao thông thường của một tờ báo hoặc tạp chí được bán mỗi ngày, hàng tuần, v.v."
                },
                "examples": [
                    {
                        "en": "a daily circulation of more than one million",
                        "vi": "số lượng phát hành hàng ngày hơn một triệu"
                    },
                    {
                        "en": "The newspaper has a daily circulation of 20 000.",
                        "vi": "Tờ báo có số lượng phát hành hàng ngày là 20 000."
                    }
                ]
            },
            {
                "define": {
                    "en": "the movement of something (for example air, water, gas, etc.) around an area or inside a system or machine",
                    "vi": "chuyển động của một thứ gì đó (ví dụ như không khí, nước, khí, v.v.) xung quanh một khu vực hoặc bên trong một hệ thống hoặc máy móc"
                },
                "examples": [
                    {
                        "en": "Poor air circulation can cause condensation.",
                        "vi": "Không khí lưu thông kém có thể gây ra ngưng tụ."
                    }
                ]
            },
            {
                "define": {
                    "en": "the fact that somebody takes part in social activities at a particular time",
                    "vi": "thực tế là ai đó tham gia vào các hoạt động xã hội tại một thời điểm cụ thể"
                },
                "examples": [
                    {
                        "en": "in circulation Anne has been ill but now she's back in circulation.",
                        "vi": "Đang lưu hành Anne đã bị bệnh nhưng bây giờ cô ấy đã trở lại bình thường."
                    },
                    {
                        "en": "out of circulation I was out of circulation for months after the baby was born.",
                        "vi": "tôi đã bị mất tuần hoàn trong nhiều tháng sau khi đứa trẻ được sinh ra."
                    }
                ]
            }
        ]
    },
    {
        "id": "3b0d5e924beb453189f528c87be5cc91",
        "word": "fibre",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈfaɪbə(r)/",
            "us": "/ˈfaɪbər/"
        },
        "nearby": [
            {
                "word": "fibber",
                "pos": "noun"
            },
            {
                "word": "Fibonacci series",
                "pos": "noun"
            },
            {
                "word": "fibre",
                "pos": "noun"
            },
            {
                "word": "fibreboard",
                "pos": "noun"
            },
            {
                "word": "fibreglass",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the part of food that helps to keep a person healthy by keeping the bowels working and moving other food quickly through the body",
                    "vi": "một phần của thức ăn giúp giữ cho một người khỏe mạnh bằng cách giữ cho ruột hoạt động và di chuyển thức ăn khác nhanh chóng qua cơ thể"
                },
                "examples": [
                    {
                        "en": "dietary fibre",
                        "vi": "chất xơ"
                    },
                    {
                        "en": "Dried fruits are especially high in fibre.",
                        "vi": "Trái cây sấy khô đặc biệt giàu chất xơ."
                    },
                    {
                        "en": "a high-/low-fibre diet",
                        "vi": "chế độ ăn nhiều / ít chất xơ"
                    },
                    {
                        "en": "He has been advised to increase his fibre intake.",
                        "vi": "Anh ấy đã được khuyên nên tăng lượng chất xơ của mình."
                    },
                    {
                        "en": "bran fibre",
                        "vi": "sợi cám"
                    }
                ]
            },
            {
                "define": {
                    "en": "a material such as cloth or rope that is made from a mass of natural or artificial threads",
                    "vi": "vật liệu như vải hoặc dây thừng được làm từ nhiều sợi chỉ tự nhiên hoặc nhân tạo"
                },
                "examples": [
                    {
                        "en": "nylon and other man-made fibres",
                        "vi": "nylon và các loại sợi nhân tạo khác"
                    },
                    {
                        "en": "Wear underwear that is made from natural fibres.",
                        "vi": "Mặc đồ lót làm từ sợi tự nhiên."
                    }
                ]
            },
            {
                "define": {
                    "en": "one of the many thin threads that form body tissue, such as muscle, and natural materials, such as wood and cotton",
                    "vi": "một trong nhiều sợi mảnh hình thành mô cơ thể, chẳng hạn như cơ và các vật liệu tự nhiên, chẳng hạn như gỗ và bông"
                },
                "examples": [
                    {
                        "en": "cotton/wood/nerve/muscle fibres",
                        "vi": "sợi bông / gỗ / thần kinh / cơ"
                    },
                    {
                        "en": "(literary) She loved him with every fibre of her being.",
                        "vi": "(văn học) Cô yêu anh bằng mọi thứ trong con người cô."
                    }
                ]
            }
        ]
    },
    {
        "id": "5b0f78b9ef5c402285ab89ac4aead8ea",
        "word": "gut",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ɡʌt/",
            "us": "/ɡʌt/"
        },
        "nearby": [
            {
                "word": "gusto",
                "pos": "noun"
            },
            {
                "word": "gusty",
                "pos": "adjective"
            },
            {
                "word": "gut",
                "pos": "noun"
            },
            {
                "word": "gut",
                "pos": "verb"
            },
            {
                "word": "gut",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the tube in the body through which food passes when it leaves the stomach",
                    "vi": "ống trong cơ thể mà thức ăn đi qua khi nó rời khỏi dạ dày"
                },
                "examples": [
                    {
                        "en": "It can take up to 72 hours for food to pass through the gut.",
                        "vi": "Có thể mất đến 72 giờ để thức ăn đi qua ruột."
                    },
                    {
                        "en": "I had a terrible pain in my guts after eating too many plums.",
                        "vi": "Tôi đã bị đau bụng kinh khủng sau khi ăn quá nhiều mận."
                    }
                ]
            },
            {
                "define": {
                    "en": "the organs in and around the stomach, especially in an animal",
                    "vi": "các cơ quan trong và xung quanh dạ dày, đặc biệt là ở động vật"
                },
                "examples": [
                    {
                        "en": "I'll only cook fish if the guts have been removed.",
                        "vi": "Tôi sẽ chỉ nấu cá nếu ruột đã được loại bỏ."
                    },
                    {
                        "en": "I don't like movies that are full of blood and guts (= that show a lot of blood and violence).",
                        "vi": "Tôi không thích những bộ phim đầy máu me (= thể hiện nhiều máu me và bạo lực)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person’s stomach, especially when it is large",
                    "vi": "dạ dày của một người, đặc biệt là khi nó lớn"
                },
                "examples": [
                    {
                        "en": "Have you seen the gut on him!",
                        "vi": "Bạn đã thấy ruột trên anh ta chưa!"
                    },
                    {
                        "en": "a beer gut (= caused by drinking a lot of beer regularly)",
                        "vi": "ruột bia (= do uống nhiều bia thường xuyên)"
                    }
                ]
            },
            {
                "define": {
                    "en": "the courage and strength of mind that it takes to do something difficult or unpleasant",
                    "vi": "can đảm và sức mạnh của tâm trí mà nó cần để làm một cái gì đó khó khăn hoặc khó chịu"
                },
                "examples": [
                    {
                        "en": "He doesn't have the guts to walk away from a well-paid job.",
                        "vi": "Anh ấy không đủ can đảm để rời bỏ một công việc được trả lương cao."
                    }
                ]
            },
            {
                "define": {
                    "en": "the place where your natural feelings that make you react in a particular way are thought to be",
                    "vi": "nơi mà những cảm xúc tự nhiên của bạn khiến bạn phản ứng theo một cách cụ thể được cho là"
                },
                "examples": [
                    {
                        "en": "in your guts I had a feeling in my guts that something was wrong.",
                        "vi": "trong ruột của bạn, tôi có cảm giác trong ruột của mình rằng có điều gì đó không ổn."
                    }
                ]
            },
            {
                "define": {
                    "en": "the most important part of something",
                    "vi": "phần quan trọng nhất của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "the guts of the problem",
                        "vi": "gan ruột của vấn đề"
                    }
                ]
            },
            {
                "define": {
                    "en": "thin strong string made from animals' intestines and used in making musical instruments, tennis rackets and medical equipment",
                    "vi": "dây mảnh mỏng làm từ ruột động vật và được sử dụng để làm nhạc cụ, vợt tennis và thiết bị y tế"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to make a great effort to do something",
                    "vi": "nỗ lực rất nhiều để làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "It’s a problem which nobody is going to bust a gut trying to solve.",
                        "vi": "Đó là một vấn đề mà không ai muốn giải quyết."
                    },
                    {
                        "en": "I busted my chops to get into law school.",
                        "vi": "Tôi đã cố gắng để được vào trường luật."
                    },
                    {
                        "en": "These guys were busting their butts on the field, trying to excel at athletics.",
                        "vi": "Những chàng trai này đang ngồi trên sân, cố gắng trở nên xuất sắc trong môn điền kinh."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make a decision based on something that you are certain about, even though you do not have any direct proof and cannot explain why you are certain",
                    "vi": "đưa ra quyết định dựa trên điều gì đó mà bạn chắc chắn, mặc dù bạn không có bất kỳ bằng chứng trực tiếp nào và không thể giải thích tại sao bạn chắc chắn"
                },
                "examples": [
                    {
                        "en": "I went with my gut and turned down the job.",
                        "vi": "Tôi đã rút ruột và từ chối công việc."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to refer to somebody who eats too much",
                    "vi": "dùng để chỉ ai đó ăn quá nhiều"
                },
                "examples": [
                    {
                        "en": "Make sure greedy guts doesn’t eat all the cake.",
                        "vi": "Đảm bảo lòng tham ăn không hết bánh."
                    }
                ]
            },
            {
                "define": {
                    "en": "to dislike somebody very much",
                    "vi": "không thích ai đó rất nhiều"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be very angry with somebody and punish them severely for something they have done",
                    "vi": "rất tức giận với ai đó và trừng phạt họ thật nặng vì điều họ đã làm"
                },
                "examples": [
                    {
                        "en": "She’ll have your guts for garters if she ever finds out.",
                        "vi": "Cô ấy sẽ rất quan tâm đến bạn nếu cô ấy phát hiện ra."
                    }
                ]
            },
            {
                "define": {
                    "en": "to work very hard to achieve something",
                    "vi": "làm việc rất chăm chỉ để đạt được điều gì đó"
                },
                "examples": [
                    {
                        "en": "I slogged my guts out for the exam.",
                        "vi": "Tôi vắt kiệt sức lực của mình cho kỳ thi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to tell somebody everything you know or feel about something, because you are upset",
                    "vi": "để nói với ai đó tất cả những gì bạn biết hoặc cảm thấy về điều gì đó, bởi vì bạn đang buồn"
                },
                "examples": [
                    {
                        "en": "He has spilled his guts in his new autobiography.",
                        "vi": "Anh ấy đã hết mình trong cuốn tự truyện mới của mình."
                    }
                ]
            }
        ]
    },
    {
        "id": "06f6494072124e5aa4b0ba22203d975c",
        "word": "hormone",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈhɔːməʊn/",
            "us": "/ˈhɔːrməʊn/"
        },
        "nearby": [
            {
                "word": "Horlicks",
                "pos": "noun"
            },
            {
                "word": "hormonal",
                "pos": "adjective"
            },
            {
                "word": "hormone",
                "pos": "noun"
            },
            {
                "word": "hormone replacement therapy",
                "pos": "noun"
            },
            {
                "word": "horn",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a chemical substance produced in the body or in a plant that encourages growth or influences how the cells and tissues function; an artificial substance that has similar effects",
                    "vi": "một chất hóa học được tạo ra trong cơ thể hoặc trong thực vật có tác dụng khuyến khích sự phát triển hoặc ảnh hưởng đến cách các tế bào và mô hoạt động; một chất nhân tạo có tác dụng tương tự"
                },
                "examples": [
                    {
                        "en": "growth hormones",
                        "vi": "kích thích tố tăng trưởng"
                    },
                    {
                        "en": "a hormone imbalance",
                        "vi": "sự mất cân bằng hormone"
                    },
                    {
                        "en": "Oestrogen is a female sex hormone.",
                        "vi": "Estrogen là một loại hormone sinh dục nữ."
                    },
                    {
                        "en": "children who do not produce enough growth hormone",
                        "vi": "trẻ em không sản xuất đủ hormone tăng trưởng"
                    }
                ]
            }
        ]
    },
    {
        "id": "6d31054c823748c986f9ca6c4cf3d52f",
        "word": "kidney",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈkɪdni/",
            "us": "/ˈkɪdni/"
        },
        "nearby": [
            {
                "word": "kidnapper",
                "pos": "noun"
            },
            {
                "word": "kidnapping",
                "pos": "noun"
            },
            {
                "word": "kidney",
                "pos": "noun"
            },
            {
                "word": "kidney bean",
                "pos": "noun"
            },
            {
                "word": "kidney machine",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "either of the two organs in the body that remove waste products from the blood and produce urine",
                    "vi": "một trong hai cơ quan trong cơ thể có chức năng loại bỏ các chất thải ra khỏi máu và sản xuất nước tiểu"
                },
                "examples": [
                    {
                        "en": "a kidney infection",
                        "vi": "nhiễm trùng thận"
                    }
                ]
            },
            {
                "define": {
                    "en": "the kidneys of some animals that are cooked and eaten",
                    "vi": "thận của một số động vật được nấu chín và ăn"
                },
                "examples": [
                    {
                        "en": "steak and kidney pie",
                        "vi": "Món bò bít tết với bánh đậu trắng"
                    }
                ]
            }
        ]
    },
    {
        "id": "2bcf754dd199443da07216ba02b6f004",
        "word": "liver",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈlɪvə(r)/",
            "us": "/ˈlɪvər/"
        },
        "nearby": [
            {
                "word": "live on",
                "pos": "phrasal verb"
            },
            {
                "word": "live out",
                "pos": "phrasal verb"
            },
            {
                "word": "liver",
                "pos": "noun"
            },
            {
                "word": "liver bird",
                "pos": "noun"
            },
            {
                "word": "liver fluke",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a large organ in the body that cleans the blood and produces bile",
                    "vi": "một cơ quan lớn trong cơ thể làm sạch máu và sản xuất mật"
                },
                "examples": [
                    {
                        "en": "liver disease",
                        "vi": "bệnh gan"
                    },
                    {
                        "en": "He had a liver transplant at the age of 12.",
                        "vi": "Anh được ghép gan vào năm 12 tuổi."
                    },
                    {
                        "en": "a nationwide appeal for a donor liver",
                        "vi": "kêu gọi toàn quốc cho một người hiến gan"
                    }
                ]
            },
            {
                "define": {
                    "en": "the liver of some animals that is cooked and eaten",
                    "vi": "gan của một số động vật được nấu chín và ăn"
                },
                "examples": [
                    {
                        "en": "liver and onions",
                        "vi": "gan và hành tây"
                    },
                    {
                        "en": "chicken livers",
                        "vi": "Gan gà"
                    }
                ]
            }
        ]
    },
    {
        "id": "9415a307f5ec44ceac7b5b92ca2041e6",
        "word": "nervous system",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈnɜːvəs sɪstəm/",
            "us": "/ˈnɜːrvəs sɪstəm/"
        },
        "nearby": [
            {
                "word": "nervously",
                "pos": "adverb"
            },
            {
                "word": "nervousness",
                "pos": "noun"
            },
            {
                "word": "nervous system",
                "pos": "noun"
            },
            {
                "word": "nervy",
                "pos": "adjective"
            },
            {
                "word": "E Nesbit",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the system of all the nerves in the body that carries messages between the brain and the rest of the body",
                    "vi": "hệ thống của tất cả các dây thần kinh trong cơ thể mang thông điệp giữa não và phần còn lại của cơ thể"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "e4752df213f141599bfd0d42e4e2fbff",
        "word": "pulse",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/pʌls/",
            "us": "/pʌls/"
        },
        "nearby": [
            {
                "word": "pulsate",
                "pos": "verb"
            },
            {
                "word": "pulsation",
                "pos": "noun"
            },
            {
                "word": "pulse",
                "pos": "noun"
            },
            {
                "word": "pulse",
                "pos": "verb"
            },
            {
                "word": "pulverize",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the regular beat of the heart as it sends blood around the body, that can be felt in different places, especially on the inside part of the wrist; the number of times the heart beats in a minute",
                    "vi": "nhịp đập đều đặn của trái tim khi nó đưa máu đi khắp cơ thể, có thể được cảm nhận ở những nơi khác nhau, đặc biệt là ở phần bên trong của cổ tay; số lần tim đập trong một phút"
                },
                "examples": [
                    {
                        "en": "a strong/weak pulse",
                        "vi": "một mạch mạnh / yếu"
                    },
                    {
                        "en": "an abnormally high pulse rate",
                        "vi": "nhịp tim cao bất thường"
                    },
                    {
                        "en": "The doctor took/felt my pulse.",
                        "vi": "Bác sĩ đã lấy / sờ mạch của tôi."
                    },
                    {
                        "en": "Fear sent her pulse racing (= made it beat very quickly).",
                        "vi": "Nỗi sợ hãi khiến nhịp đập của cô ấy đập nhanh (= khiến nó đập rất nhanh)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a strong regular beat in music",
                    "vi": "nhịp điệu mạnh mẽ thường xuyên trong âm nhạc"
                },
                "examples": [
                    {
                        "en": "the throbbing pulse of the drums",
                        "vi": "nhịp đập rộn ràng của trống"
                    }
                ]
            },
            {
                "define": {
                    "en": "a single short increase in the amount of light, sound or electricity produced by a machine, etc.",
                    "vi": "một sự gia tăng trong thời gian ngắn về lượng ánh sáng, âm thanh hoặc điện năng do máy tạo ra, v.v."
                },
                "examples": [
                    {
                        "en": "pulse waves",
                        "vi": "sóng xung"
                    },
                    {
                        "en": "sound pulses",
                        "vi": "xung âm thanh"
                    }
                ]
            },
            {
                "define": {
                    "en": "the seeds of some plants that are eaten as food, such as peas and lentils",
                    "vi": "hạt của một số cây được dùng làm thực phẩm, chẳng hạn như đậu Hà Lan và đậu lăng"
                },
                "examples": [
                    {
                        "en": "Pulses are a good source of protein.",
                        "vi": "Đậu là một nguồn protein tốt."
                    }
                ]
            },
            {
                "define": {
                    "en": "to always be aware of the most recent developments in a particular situation",
                    "vi": "luôn nhận thức được những phát triển gần đây nhất trong một tình huống cụ thể"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "3f7b82b6ea7a45509c44a797cdf192c9",
        "word": "tissue",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈtɪʃuː/",
            "us": "/ˈtɪʃuː/"
        },
        "nearby": [
            {
                "word": "tiring",
                "pos": "adjective"
            },
            {
                "word": "'tis",
                "pos": "short form"
            },
            {
                "word": "tissue",
                "pos": "noun"
            },
            {
                "word": "tissue paper",
                "pos": "noun"
            },
            {
                "word": "tit",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a piece of soft paper, used especially as a handkerchief",
                    "vi": "một mảnh giấy mềm, đặc biệt được dùng làm khăn tay"
                },
                "examples": [
                    {
                        "en": "a box of tissues",
                        "vi": "một hộp khăn giấy"
                    },
                    {
                        "en": "He wiped his nose on a tissue.",
                        "vi": "Anh lấy khăn giấy lau mũi."
                    },
                    {
                        "en": "She grabbed a wad of tissues from the box and soaked up the spilt wine.",
                        "vi": "Cô lấy một xấp khăn giấy trong hộp và ngâm rượu bị đổ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a collection of cells that form the different parts of humans, animals and plants",
                    "vi": "một tập hợp các tế bào tạo nên các bộ phận khác nhau của con người, động vật và thực vật"
                },
                "examples": [
                    {
                        "en": "muscle/brain/lung tissue",
                        "vi": "mô cơ / não / phổi"
                    },
                    {
                        "en": "scar tissue",
                        "vi": "mô sẹo"
                    }
                ]
            },
            {
                "define": {
                    "en": "very thin paper used for wrapping and packing things that break easily",
                    "vi": "giấy rất mỏng dùng để gói và đóng gói những thứ dễ vỡ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a story, an excuse, etc. that is full of lies",
                    "vi": "một câu chuyện, một cái cớ, v.v. đầy dối trá"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "bf9569b3e4a74a5b8441486bbe79c5da",
        "word": "vein",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/veɪn/",
            "us": "/veɪn/"
        },
        "nearby": [
            {
                "word": "veil",
                "pos": "verb"
            },
            {
                "word": "veiled",
                "pos": "adjective"
            },
            {
                "word": "vein",
                "pos": "noun"
            },
            {
                "word": "veined",
                "pos": "adjective"
            },
            {
                "word": "veining",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "any of the tubes that carry blood from all parts of the body towards the heart",
                    "vi": "bất kỳ ống nào dẫn máu từ tất cả các bộ phận của cơ thể về tim"
                },
                "examples": [
                    {
                        "en": "the jugular vein",
                        "vi": "tĩnh mạch hình cầu"
                    },
                    {
                        "en": "The nurse was having trouble finding a vein in his arm.",
                        "vi": "Y tá gặp khó khăn khi tìm tĩnh mạch trên cánh tay của anh ta."
                    }
                ]
            },
            {
                "define": {
                    "en": "any of the very thin tubes that form the frame of a leaf or an insect’s wing",
                    "vi": "bất kỳ ống rất mỏng nào tạo thành khung của lá hoặc cánh của côn trùng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a narrow area of a different colour in some types of stone, wood and cheese",
                    "vi": "một số loại đá, gỗ và pho mát có màu khác nhau hẹp"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a thin layer of minerals or metal contained in rock",
                    "vi": "một lớp mỏng khoáng chất hoặc kim loại chứa trong đá"
                },
                "examples": [
                    {
                        "en": "a vein of gold",
                        "vi": "một mạch vàng"
                    }
                ]
            },
            {
                "define": {
                    "en": "an amount of a particular quality or feature in something",
                    "vi": "một lượng chất lượng hoặc tính năng cụ thể trong một cái gì đó"
                },
                "examples": [
                    {
                        "en": "They had tapped a rich vein of information in his secretary.",
                        "vi": "Họ đã khai thác một mạch thông tin phong phú trong thư ký của anh ta."
                    },
                    {
                        "en": "There was a vein of proverbial wisdom in what he said.",
                        "vi": "Có một mạch máu của sự khôn ngoan theo phương ngôn trong những gì anh ta nói."
                    }
                ]
            },
            {
                "define": {
                    "en": "a particular style or manner",
                    "vi": "một phong cách hoặc cách thức cụ thể"
                },
                "examples": [
                    {
                        "en": "A number of other people commented in a similar vein.",
                        "vi": "Một số người khác cũng bình luận tương tự."
                    },
                    {
                        "en": "‘And that's not all,’ he continued in angry vein.",
                        "vi": "“Và đó không phải là tất cả,” anh ta tiếp tục với vẻ giận dữ."
                    },
                    {
                        "en": "Other speakers tackled the same problem in a lighter vein.",
                        "vi": "Các diễn giả khác đã giải quyết vấn đề tương tự theo cách nhẹ nhàng hơn."
                    },
                    {
                        "en": "Fortunately, the rest of the evening continued in a lighter vein.",
                        "vi": "May mắn thay, phần còn lại của buổi tối tiếp tục trong một tĩnh mạch nhẹ hơn."
                    }
                ]
            }
        ]
    },
    {
        "id": "85aac79ed5ee4ca6b7c2450bc9fe3394",
        "word": "Achilles tendon",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/əˌkɪliːz ˈtendən/",
            "us": "/əˌkɪliːz ˈtendən/"
        },
        "nearby": [
            {
                "word": "achiever",
                "pos": "noun"
            },
            {
                "word": "Achilles heel",
                "pos": "noun"
            },
            {
                "word": "Achilles tendon",
                "pos": "noun"
            },
            {
                "word": "achingly",
                "pos": "adverb"
            },
            {
                "word": "achkan",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the tendon that connects the muscles at the back of the lower part of the leg to the heel",
                    "vi": "gân kết nối các cơ ở phía sau của phần dưới của chân với gót chân"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "792b992842b443c79e6a47b7d6fef0b5",
        "word": "adenoids",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈædənɔɪdz/",
            "us": "/ˈædənɔɪdz/"
        },
        "nearby": [
            {
                "word": "adenine",
                "pos": "noun"
            },
            {
                "word": "adenoidal",
                "pos": "adjective"
            },
            {
                "word": "adenoids",
                "pos": "noun"
            },
            {
                "word": "adept",
                "pos": "adjective"
            },
            {
                "word": "adept",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "pieces of soft tissue at the back of the nose and throat, that are part of the body’s immune system and that can become larger than normal and cause breathing difficulties, especially in children",
                    "vi": "các mảnh mô mềm ở phía sau mũi và cổ họng, là một phần của hệ thống miễn dịch của cơ thể và có thể trở nên lớn hơn bình thường và gây khó thở, đặc biệt là ở trẻ em"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "340d03fbb80e4c538ede6a9e018e7080",
        "word": "anatomy",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/əˈnætəmi/",
            "us": "/əˈnætəmi/"
        },
        "nearby": [
            {
                "word": "anatomically",
                "pos": "adverb"
            },
            {
                "word": "anatomist",
                "pos": "noun"
            },
            {
                "word": "anatomy",
                "pos": "noun"
            },
            {
                "word": "ANC",
                "pos": "abbreviation"
            },
            {
                "word": "-ance",
                "pos": "suffix"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the scientific study of the physical structure of humans, animals or plants",
                    "vi": "nghiên cứu khoa học về cấu trúc vật chất của con người, động vật hoặc thực vật"
                },
                "examples": [
                    {
                        "en": "the department of anatomy and physiology",
                        "vi": "khoa giải phẫu và sinh lý học"
                    }
                ]
            },
            {
                "define": {
                    "en": "the physical structure of a human, animal or plant",
                    "vi": "cấu trúc vật chất của con người, động vật hoặc thực vật"
                },
                "examples": [
                    {
                        "en": "the anatomy of the horse",
                        "vi": "giải phẫu của con ngựa"
                    },
                    {
                        "en": "human anatomy",
                        "vi": "giải phẫu con người"
                    }
                ]
            },
            {
                "define": {
                    "en": "a person’s body",
                    "vi": "cơ thể của một người"
                },
                "examples": [
                    {
                        "en": "Various parts of his anatomy were clearly visible.",
                        "vi": "Các bộ phận giải phẫu khác nhau có thể nhìn thấy rõ ràng."
                    }
                ]
            },
            {
                "define": {
                    "en": "an examination of what something is like or why it happens",
                    "vi": "kiểm tra một cái gì đó như thế nào hoặc tại sao nó xảy ra"
                },
                "examples": [
                    {
                        "en": "an anatomy of the current recession",
                        "vi": "giải phẫu của cuộc suy thoái hiện tại"
                    }
                ]
            }
        ]
    },
    {
        "id": "c36ed99e7f7947ad9af5cd320dceb346",
        "word": "antibody",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈæntibɒdi/",
            "us": "/ˈæntibɑːdi/"
        },
        "nearby": [
            {
                "word": "antibiotic",
                "pos": "noun"
            },
            {
                "word": "antibiotic",
                "pos": "adjective"
            },
            {
                "word": "antibody",
                "pos": "noun"
            },
            {
                "word": "anti-choice",
                "pos": "adjective"
            },
            {
                "word": "Antichrist",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a substance that the body produces in the blood to fight disease, or as a reaction when certain substances are put into the body",
                    "vi": "một chất mà cơ thể sản xuất trong máu để chống lại bệnh tật, hoặc như một phản ứng khi một số chất được đưa vào cơ thể"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "b0cfe079fc1c449b9badd4acf6b5fab8",
        "word": "anus",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈeɪnəs/",
            "us": "/ˈeɪnəs/"
        },
        "nearby": [
            {
                "word": "antonym",
                "pos": "noun"
            },
            {
                "word": "antsy",
                "pos": "adjective"
            },
            {
                "word": "anus",
                "pos": "noun"
            },
            {
                "word": "anvil",
                "pos": "noun"
            },
            {
                "word": "anxiety",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the opening in a person’s or animal's bottom through which solid waste leaves the body",
                    "vi": "lỗ hở dưới đáy người hoặc động vật, qua đó chất thải rắn rời khỏi cơ thể"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "4fe3b5225ef143ea908b2308d142f6ce",
        "word": "anvil",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈænvɪl/",
            "us": "/ˈænvɪl/"
        },
        "nearby": [
            {
                "word": "antsy",
                "pos": "adjective"
            },
            {
                "word": "anus",
                "pos": "noun"
            },
            {
                "word": "anvil",
                "pos": "noun"
            },
            {
                "word": "anxiety",
                "pos": "noun"
            },
            {
                "word": "anxious",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an iron block on which a blacksmith puts hot pieces of metal before shaping them with a hammer",
                    "vi": "một khối sắt trên đó thợ rèn đặt các miếng kim loại nóng trước khi tạo hình chúng bằng búa"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the second of three small bones in the middle ear that carry sound to the inner ear",
                    "vi": "xương thứ hai trong ba xương nhỏ ở tai giữa truyền âm thanh đến tai trong"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "7ee46f6c81694cfc8f2d36b82b2116d4",
        "word": "aorta",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/eɪˈɔːtə/",
            "us": "/eɪˈɔːrtə/"
        },
        "nearby": [
            {
                "word": "AOL",
                "pos": ""
            },
            {
                "word": "AONB",
                "pos": "noun"
            },
            {
                "word": "aorta",
                "pos": "noun"
            },
            {
                "word": "Aotearoa",
                "pos": "noun"
            },
            {
                "word": "AP",
                "pos": "abbreviation"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the main artery that carries blood from the heart to the rest of the body once it has passed through the lungs",
                    "vi": "động mạch chính mang máu từ tim đến phần còn lại của cơ thể khi nó đã đi qua phổi"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a33832ece7734d08a3323e99b8ba0efd",
        "word": "appendix",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/əˈpendɪks/",
            "us": "/əˈpendɪks/"
        },
        "nearby": [
            {
                "word": "appendectomy",
                "pos": "noun"
            },
            {
                "word": "appendicitis",
                "pos": "noun"
            },
            {
                "word": "appendix",
                "pos": "noun"
            },
            {
                "word": "appertain",
                "pos": "verb"
            },
            {
                "word": "appertain to",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small bag of tissue that is attached to the large intestine. In humans, the appendix has no clear function.",
                    "vi": "một túi mô nhỏ được gắn vào ruột già. Ở người, ruột thừa không có chức năng rõ ràng."
                },
                "examples": [
                    {
                        "en": "He had to have his appendix out (= removed).",
                        "vi": "Anh ta phải mổ ruột thừa (= bị cắt bỏ)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a section giving extra information at the end of a book or document",
                    "vi": "một phần cung cấp thông tin bổ sung ở cuối sách hoặc tài liệu"
                },
                "examples": [
                    {
                        "en": "Full details are given in Appendix 3.",
                        "vi": "Chi tiết đầy đủ được nêu trong Phụ lục 3."
                    }
                ]
            }
        ]
    },
    {
        "id": "844baab5bbf8423590cc83cfd6d82b24",
        "word": "auricle",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɔːrɪkl/",
            "us": "/ˈɔːrɪkl/"
        },
        "nearby": [
            {
                "word": "aureole",
                "pos": "noun"
            },
            {
                "word": "au revoir",
                "pos": "exclamation"
            },
            {
                "word": "auricle",
                "pos": "noun"
            },
            {
                "word": "aurochs",
                "pos": "noun"
            },
            {
                "word": "aurora australis",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "either of the two upper spaces in the heart used to send blood around the body",
                    "vi": "một trong hai không gian trên của tim được sử dụng để đưa máu đi khắp cơ thể"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the outer part of the ear",
                    "vi": "phần bên ngoài của tai"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "320c95c1a564425aac79e06496bbc49b",
        "word": "bile",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/baɪl/",
            "us": "/baɪl/"
        },
        "nearby": [
            {
                "word": "bilberry",
                "pos": "noun"
            },
            {
                "word": "bilby",
                "pos": "noun"
            },
            {
                "word": "bile",
                "pos": "noun"
            },
            {
                "word": "bile duct",
                "pos": "noun"
            },
            {
                "word": "bilge",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the green-brown liquid with a bitter unpleasant taste that is produced by the liver to help the body to deal with the fats we eat, and that can come into your mouth when you vomit with an empty stomach",
                    "vi": "chất lỏng màu nâu xanh có vị đắng khó chịu do gan sản xuất ra để giúp cơ thể xử lý chất béo mà chúng ta ăn vào và có thể chảy vào miệng bạn khi bạn nôn mửa khi bụng đói."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a strong feeling of anger or hating somebody/something",
                    "vi": "một cảm giác tức giận hoặc ghét ai đó / cái gì đó mạnh mẽ"
                },
                "examples": [
                    {
                        "en": "The critic's review of the play was just a paragraph of bile.",
                        "vi": "Lời phê bình của nhà phê bình về vở kịch chỉ là một đoạn đường mật."
                    }
                ]
            }
        ]
    },
    {
        "id": "711b58f427644d2192bf4933a15e4652",
        "word": "bile duct",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbaɪl dʌkt/",
            "us": "/ˈbaɪl dʌkt/"
        },
        "nearby": [
            {
                "word": "bilby",
                "pos": "noun"
            },
            {
                "word": "bile",
                "pos": "noun"
            },
            {
                "word": "bile duct",
                "pos": "noun"
            },
            {
                "word": "bilge",
                "pos": "noun"
            },
            {
                "word": "bilharzia",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the tube that carries bile from the liver and the gall bladder to the duodenum",
                    "vi": "ống dẫn mật từ gan và túi mật đến tá tràng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "6f0df34dd2664efaa9142ce642e2b92b",
        "word": "bladder",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈblædə(r)/",
            "us": "/ˈblædər/"
        },
        "nearby": [
            {
                "word": "Black Wednesday",
                "pos": ""
            },
            {
                "word": "black widow",
                "pos": "noun"
            },
            {
                "word": "bladder",
                "pos": "noun"
            },
            {
                "word": "bladdered",
                "pos": "adjective"
            },
            {
                "word": "blade",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an organ that has the shape of a bag in which liquid waste (= urine) collects before it is passed out of the body",
                    "vi": "một cơ quan có hình dạng một cái túi, trong đó chất thải lỏng (= nước tiểu) được thu gom trước khi thải ra khỏi cơ thể"
                },
                "examples": [
                    {
                        "en": "He died of bladder cancer.",
                        "vi": "Anh ấy chết vì ung thư bàng quang."
                    }
                ]
            },
            {
                "define": {
                    "en": "a bag made of rubber, leather, etc. that can be filled with air or liquid, such as the one inside a football",
                    "vi": "túi làm bằng cao su, da, v.v. có thể chứa không khí hoặc chất lỏng, chẳng hạn như túi đựng bên trong quả bóng đá"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "dcd1c3ea1b4447898842913ca83f7d49",
        "word": "bloodstream",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈblʌdstriːm/",
            "us": "/ˈblʌdstriːm/"
        },
        "nearby": [
            {
                "word": "bloodstained",
                "pos": "adjective"
            },
            {
                "word": "bloodstock",
                "pos": "noun"
            },
            {
                "word": "bloodstream",
                "pos": "noun"
            },
            {
                "word": "bloodsucker",
                "pos": "noun"
            },
            {
                "word": "bloodsucking",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the blood flowing through the body",
                    "vi": "máu chảy trong cơ thể"
                },
                "examples": [
                    {
                        "en": "They injected the drug directly into her bloodstream.",
                        "vi": "Họ tiêm thuốc trực tiếp vào máu của cô."
                    }
                ]
            }
        ]
    },
    {
        "id": "3a354daa073340d8b5072ec9016474a4",
        "word": "bone marrow",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbəʊn mærəʊ/",
            "us": "/ˈbəʊn mærəʊ/"
        },
        "nearby": [
            {
                "word": "bone idle",
                "pos": "adjective"
            },
            {
                "word": "boneless",
                "pos": "adjective"
            },
            {
                "word": "bone marrow",
                "pos": "noun"
            },
            {
                "word": "bonemeal",
                "pos": "noun"
            },
            {
                "word": "boner",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a soft substance that fills the hollow parts of bones",
                    "vi": "một chất mềm lấp đầy các phần rỗng của xương"
                },
                "examples": [
                    {
                        "en": "a bone marrow transplant",
                        "vi": "cấy ghép tủy xương"
                    }
                ]
            }
        ]
    },
    {
        "id": "2b3024ee582745a992787beb9aff50a7",
        "word": "bowel",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbaʊəl/",
            "us": "/ˈbaʊəl/"
        },
        "nearby": [
            {
                "word": "bowdlerize",
                "pos": "verb"
            },
            {
                "word": "bow down to",
                "pos": "phrasal verb"
            },
            {
                "word": "bowel",
                "pos": "noun"
            },
            {
                "word": "bowel movement",
                "pos": "noun"
            },
            {
                "word": "bower",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the tube along which food passes after it has been through the stomach, especially the end where waste is collected before it is passed out of the body",
                    "vi": "ống dẫn thức ăn đi qua sau khi đi qua dạ dày, đặc biệt là phần cuối nơi chất thải được thu gom trước khi đưa ra ngoài cơ thể"
                },
                "examples": [
                    {
                        "en": "(medical) to empty/move/open your bowels (= to pass solid waste out of the body)",
                        "vi": "(y tế) để làm rỗng / di chuyển / mở ruột của bạn (= để thải chất thải rắn ra khỏi cơ thể)"
                    },
                    {
                        "en": "bowel cancer/cancer of the bowel",
                        "vi": "ung thư ruột / ung thư ruột"
                    },
                    {
                        "en": "Patients are asked to report any change in bowel habit.",
                        "vi": "Bệnh nhân được yêu cầu báo cáo bất kỳ thay đổi nào trong thói quen đi tiêu."
                    },
                    {
                        "en": "irritable bowel syndrome",
                        "vi": "hội chứng ruột kích thích"
                    }
                ]
            },
            {
                "define": {
                    "en": "the part that is deepest inside something",
                    "vi": "phần sâu nhất bên trong một cái gì đó"
                },
                "examples": [
                    {
                        "en": "A rumble came from the bowels of the earth (= deep underground).",
                        "vi": "Một tiếng ầm ầm phát ra từ ruột đất (= sâu dưới lòng đất)."
                    }
                ]
            }
        ]
    },
    {
        "id": "be78814d1ad8423995d879f2f4e000b6",
        "word": "canal",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/kəˈnæl/",
            "us": "/kəˈnæl/"
        },
        "nearby": [
            {
                "word": "Canadian football",
                "pos": "noun"
            },
            {
                "word": "Canadian Security Intelligence Service",
                "pos": "noun"
            },
            {
                "word": "canal",
                "pos": "noun"
            },
            {
                "word": "canal boat",
                "pos": "noun"
            },
            {
                "word": "canalization",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a long straight passage dug in the ground and filled with water for boats and ships to travel along; a smaller passage used for carrying water to fields, crops, etc.",
                    "vi": "một lối đi thẳng dài được đào trong lòng đất và chứa đầy nước cho tàu thuyền qua lại; một lối đi nhỏ hơn được sử dụng để dẫn nước đến đồng ruộng, hoa màu, v.v."
                },
                "examples": [
                    {
                        "en": "the Panama/Suez Canal",
                        "vi": "kênh đào Panama / Suez"
                    },
                    {
                        "en": "an irrigation canal",
                        "vi": "một kênh thủy lợi"
                    }
                ]
            },
            {
                "define": {
                    "en": "a tube inside the body through which liquid, food or air can pass",
                    "vi": "một ống bên trong cơ thể mà chất lỏng, thức ăn hoặc không khí có thể đi qua"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "396d7ed7fbc04abc86e55e0070a3d774",
        "word": "capillary",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/kəˈpɪləri/",
            "us": "/ˈkæpəleri/"
        },
        "nearby": [
            {
                "word": "Cape Verde",
                "pos": "noun"
            },
            {
                "word": "Cape Verdean",
                "pos": "noun, adjective"
            },
            {
                "word": "capillary",
                "pos": "noun"
            },
            {
                "word": "capillary action",
                "pos": "noun"
            },
            {
                "word": "capital",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "any of the smallest tubes in the body that carry blood",
                    "vi": "bất kỳ ống nhỏ nhất nào trong cơ thể mang máu"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "55707bca892e40b099902ed25ad942a4",
        "word": "cartilage",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkɑːtɪlɪdʒ/",
            "us": "/ˈkɑːrtɪlɪdʒ/"
        },
        "nearby": [
            {
                "word": "Cartesian",
                "pos": "adjective"
            },
            {
                "word": "carthorse",
                "pos": "noun"
            },
            {
                "word": "cartilage",
                "pos": "noun"
            },
            {
                "word": "cartilaginous",
                "pos": "adjective"
            },
            {
                "word": "Barbara Cartland",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the strong white tissue that is important in supporting and connecting parts of the body, and especially in joints to prevent the bones rubbing against each other",
                    "vi": "Mô trắng chắc khỏe, quan trọng trong việc nâng đỡ và kết nối các bộ phận của cơ thể, và đặc biệt là ở các khớp để ngăn xương cọ xát với nhau"
                },
                "examples": [
                    {
                        "en": "I’ve damaged the cartilage in my knee.",
                        "vi": "Tôi đã bị hư sụn ở đầu gối."
                    }
                ]
            }
        ]
    },
    {
        "id": "8294d5c302464821b0c7c7bd12d74a7b",
        "word": "cervix",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsɜːvɪks/",
            "us": "/ˈsɜːrvɪks/"
        },
        "nearby": [
            {
                "word": "cervical",
                "pos": "adjective"
            },
            {
                "word": "cervical smear",
                "pos": "noun"
            },
            {
                "word": "cervix",
                "pos": "noun"
            },
            {
                "word": "cesarean",
                "pos": "noun"
            },
            {
                "word": "cesarean",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the narrow passage at the opening of the womb of a woman or female animal",
                    "vi": "lối đi hẹp khi mở tử cung của phụ nữ hoặc động vật giống cái"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "4991fc2afd7e4c9cbcb15a6d10646b2a",
        "word": "cochlea",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkɒkliə/",
            "us": "/ˈkəʊkliə/"
        },
        "nearby": [
            {
                "word": "cochineal",
                "pos": "noun"
            },
            {
                "word": "Cochise",
                "pos": ""
            },
            {
                "word": "cochlea",
                "pos": "noun"
            },
            {
                "word": "Eddie Cochran",
                "pos": ""
            },
            {
                "word": "cock",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small curved tube inside the ear that contains a small part that sends nerve signals to the brain when sounds cause it to vibrate",
                    "vi": "một ống cong nhỏ bên trong tai có chứa một phần nhỏ gửi tín hiệu thần kinh đến não khi âm thanh làm nó rung động"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "8fa1f68ba19c4cafb2337d4ad50b8657",
        "word": "colon",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkəʊlən/",
            "us": "/ˈkəʊlən/"
        },
        "nearby": [
            {
                "word": "Colombia",
                "pos": "noun"
            },
            {
                "word": "Colombian",
                "pos": "noun, adjective"
            },
            {
                "word": "colon",
                "pos": "noun"
            },
            {
                "word": "colonel",
                "pos": "noun"
            },
            {
                "word": "Colonel Blimp",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the mark ( : ) used to introduce a list, a summary, an explanation, etc. or before reporting what somebody has said",
                    "vi": "dấu (:) được sử dụng để giới thiệu danh sách, tóm tắt, giải thích, v.v. hoặc trước khi báo cáo những gì ai đó đã nói"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the main part of the large intestine (= part of the bowels)",
                    "vi": "phần chính của ruột già (= một phần của ruột)"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "104fa00f307e42b3884d20e83e9da2f3",
        "word": "connective tissue",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/kəˌnektɪv ˈtɪʃuː/",
            "us": "/kəˌnektɪv ˈtɪʃuː/"
        },
        "nearby": [
            {
                "word": "connective",
                "pos": "adjective"
            },
            {
                "word": "connective",
                "pos": "noun"
            },
            {
                "word": "connective tissue",
                "pos": "noun"
            },
            {
                "word": "connectivity",
                "pos": "noun"
            },
            {
                "word": "connector",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "any fat, cartilage or other material that supports, connects or separates organs or other parts of the body",
                    "vi": "bất kỳ chất béo, sụn hoặc vật liệu khác hỗ trợ, kết nối hoặc phân tách các cơ quan hoặc các bộ phận khác của cơ thể"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "6c7e8fc105b04fee9204ff76cb3c26d9",
        "word": "cortex",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkɔːteks/",
            "us": "/ˈkɔːrteks/"
        },
        "nearby": [
            {
                "word": "corset",
                "pos": "noun"
            },
            {
                "word": "cortège",
                "pos": "noun"
            },
            {
                "word": "cortex",
                "pos": "noun"
            },
            {
                "word": "cortical",
                "pos": "adjective"
            },
            {
                "word": "cortisol",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the outer layer of an organ in the body, especially the brain",
                    "vi": "lớp ngoài của một cơ quan trong cơ thể, đặc biệt là não"
                },
                "examples": [
                    {
                        "en": "the cerebral/renal cortex (= around the brain/ kidney)",
                        "vi": "vỏ não / thận (= quanh não / thận)"
                    }
                ]
            }
        ]
    },
    {
        "id": "434bb46c4b3c489ca38b25dec01e8810",
        "word": "disc",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/dɪsk/",
            "us": "/dɪsk/"
        },
        "nearby": [
            {
                "word": "disburse",
                "pos": "verb"
            },
            {
                "word": "disbursement",
                "pos": "noun"
            },
            {
                "word": "disc",
                "pos": "noun"
            },
            {
                "word": "discard",
                "pos": "verb"
            },
            {
                "word": "discard",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a thin flat round object",
                    "vi": "một vật thể tròn dẹt mỏng"
                },
                "examples": [
                    {
                        "en": "He wears an identity disc around his neck.",
                        "vi": "Anh ta đeo một chiếc đĩa nhận dạng quanh cổ."
                    },
                    {
                        "en": "In a total eclipse, the moon completely covers the disc of the sun.",
                        "vi": "Trong nguyệt thực toàn phần, mặt trăng che hoàn toàn đĩa của mặt trời."
                    }
                ]
            },
            {
                "define": {
                    "en": "a CD or DVD",
                    "vi": "một đĩa CD hoặc DVD"
                },
                "examples": [
                    {
                        "en": "This disc contains lots of extra features, including an interview with the director.",
                        "vi": "Đĩa này chứa rất nhiều tính năng bổ sung, bao gồm một cuộc phỏng vấn với đạo diễn."
                    },
                    {
                        "en": "on disc This recording is available online or on disc.",
                        "vi": "trên đĩa Bản ghi âm này có sẵn trực tuyến hoặc trên đĩa."
                    },
                    {
                        "en": "The series comes as a two-disc box set with three episodes on each disc.",
                        "vi": "Bộ truyện đi kèm dưới dạng một bộ hộp hai đĩa với ba tập trên mỗi đĩa."
                    },
                    {
                        "en": "There are lots of extras on this disc.",
                        "vi": "Có rất nhiều tính năng bổ sung trên đĩa này."
                    }
                ]
            },
            {
                "define": {
                    "en": "a disk for a computer",
                    "vi": "một đĩa cho máy tính"
                },
                "examples": [
                    {
                        "en": "He inserted the disc into the machine.",
                        "vi": "Anh ta lắp đĩa vào máy."
                    }
                ]
            },
            {
                "define": {
                    "en": "a record (= a thin round piece of plastic on which music, etc. is recorded)",
                    "vi": "một bản ghi (= một miếng nhựa tròn mỏng có ghi âm nhạc, v.v.)"
                },
                "examples": [
                    {
                        "en": "I have an old vinyl disc of her singing.",
                        "vi": "Tôi có một đĩa vinyl cũ về tiếng hát của cô ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "a structure made of cartilage between the bones of the back",
                    "vi": "một cấu trúc làm bằng sụn giữa các xương của lưng"
                },
                "examples": [
                    {
                        "en": "He's in bed with a slipped disc.",
                        "vi": "Anh ấy đang ở trên giường với một chiếc đĩa bị trượt."
                    },
                    {
                        "en": "She's slipped a disc.",
                        "vi": "Cô ấy đánh trượt một cái đĩa."
                    }
                ]
            }
        ]
    },
    {
        "id": "8a9b152c1156431bb04f173a9c22a4bc",
        "word": "duct",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/dʌkt/",
            "us": "/dʌkt/"
        },
        "nearby": [
            {
                "word": "ducky",
                "pos": "noun"
            },
            {
                "word": "ducky",
                "pos": "adjective"
            },
            {
                "word": "duct",
                "pos": "noun"
            },
            {
                "word": "ductile",
                "pos": "adjective"
            },
            {
                "word": "ducting",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a pipe or tube carrying liquid, gas, electric or phone wires, etc.",
                    "vi": "một ống hoặc ống dẫn chất lỏng, khí đốt, dây điện hoặc điện thoại, v.v."
                },
                "examples": [
                    {
                        "en": "a heating/ventilation duct",
                        "vi": "một ống sưởi / thông gió"
                    },
                    {
                        "en": "Air flows through the ventilation ducts.",
                        "vi": "Luồng không khí đi qua các ống thông gió."
                    },
                    {
                        "en": "They managed to get out of the building by crawling through a ventilation duct.",
                        "vi": "Họ tìm cách ra khỏi tòa nhà bằng cách chui qua một ống thông gió."
                    }
                ]
            },
            {
                "define": {
                    "en": "a tube in the body or in plants through which liquid passes",
                    "vi": "một ống trong cơ thể hoặc trong thực vật mà chất lỏng đi qua"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "7e291d4d015e4b21a9092def92324c38",
        "word": "duodenal",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌdjuːəˈdiːnl/",
            "us": "/ˌduːəˈdiːnl/"
        },
        "nearby": [
            {
                "word": "dunt",
                "pos": "noun"
            },
            {
                "word": "duo",
                "pos": "noun"
            },
            {
                "word": "duodenal",
                "pos": "adjective"
            },
            {
                "word": "duodenum",
                "pos": "noun"
            },
            {
                "word": "duopoly",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "relating to the first part of the small intestine, next to the stomach",
                    "vi": "liên quan đến phần đầu tiên của ruột non, bên cạnh dạ dày"
                },
                "examples": [
                    {
                        "en": "a duodenal ulcer",
                        "vi": "loét tá tràng"
                    }
                ]
            }
        ]
    },
    {
        "id": "779d67934add4908bb5a9f36809c3614",
        "word": "duodenum",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌdjuːəˈdiːnəm/",
            "us": "/ˌduːəˈdiːnəm/"
        },
        "nearby": [
            {
                "word": "duo",
                "pos": "noun"
            },
            {
                "word": "duodenal",
                "pos": "adjective"
            },
            {
                "word": "duodenum",
                "pos": "noun"
            },
            {
                "word": "duopoly",
                "pos": "noun"
            },
            {
                "word": "the DUP",
                "pos": "abbreviation"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the first part of the small intestine, next to the stomach",
                    "vi": "phần đầu tiên của ruột non, bên cạnh dạ dày"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "67ed79785a10484798094d1ab1d62e7b",
        "word": "ear canal",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɪə kənæl/",
            "us": "/ˈɪr kənæl/"
        },
        "nearby": [
            {
                "word": "earbashing",
                "pos": "noun"
            },
            {
                "word": "earbud",
                "pos": "noun"
            },
            {
                "word": "ear canal",
                "pos": "noun"
            },
            {
                "word": "ear drops",
                "pos": "noun"
            },
            {
                "word": "eardrum",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the passage in the body that carries sounds from the ear to the eardrum",
                    "vi": "đường đi trong cơ thể mang âm thanh từ tai đến màng nhĩ"
                },
                "examples": [
                    {
                        "en": "Swimmer's ear is an infection of the ear canal that can be caused by bacteria or fungi.",
                        "vi": "Tai người đi bơi là một bệnh nhiễm trùng ống tai có thể do vi khuẩn hoặc nấm gây ra."
                    }
                ]
            }
        ]
    },
    {
        "id": "b204c707bd8e46c29a02ef28d7f805b4",
        "word": "eardrum",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɪədrʌm/",
            "us": "/ˈɪrdrʌm/"
        },
        "nearby": [
            {
                "word": "ear canal",
                "pos": "noun"
            },
            {
                "word": "ear drops",
                "pos": "noun"
            },
            {
                "word": "eardrum",
                "pos": "noun"
            },
            {
                "word": "earful",
                "pos": "noun"
            },
            {
                "word": "Amelia Earhart",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the piece of thin tightly stretched skin inside the ear that is moved by sound waves, making you able to hear",
                    "vi": "mảnh da mỏng căng và khít bên trong tai được sóng âm thanh chuyển động, giúp bạn có thể nghe thấy"
                },
                "examples": [
                    {
                        "en": "a perforated eardrum",
                        "vi": "một màng nhĩ đục lỗ"
                    },
                    {
                        "en": "His right eardrum burst.",
                        "vi": "Màng nhĩ phải của anh ta bị vỡ."
                    },
                    {
                        "en": "She thought the noise would burst her eardrums.",
                        "vi": "Cô nghĩ rằng tiếng ồn sẽ làm vỡ màng nhĩ của cô."
                    }
                ]
            }
        ]
    },
    {
        "id": "9255668a5b7a4ca6a57468dfe812e7f9",
        "word": "epinephrine",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌepɪˈnefrɪn/",
            "us": "/ˌepɪˈnefrɪn/"
        },
        "nearby": [
            {
                "word": "epileptic",
                "pos": "adjective"
            },
            {
                "word": "epilogue",
                "pos": "noun"
            },
            {
                "word": "epinephrine",
                "pos": "noun"
            },
            {
                "word": "EpiPen",
                "pos": "noun"
            },
            {
                "word": "epiphany",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a substance produced in the body when you are excited, afraid or angry. It makes the heart beat faster and increases your energy and ability to move quickly.",
                    "vi": "một chất được tạo ra trong cơ thể khi bạn vui mừng, sợ hãi hoặc tức giận. Nó làm cho tim đập nhanh hơn và tăng năng lượng và khả năng di chuyển nhanh chóng của bạn."
                },
                "examples": [
                    {
                        "en": "You should administer epinephrine within minutes of the onset of severe allergy symptoms.",
                        "vi": "Bạn nên dùng epinephrine trong vòng vài phút sau khi bắt đầu xuất hiện các triệu chứng dị ứng nghiêm trọng."
                    }
                ]
            }
        ]
    },
    {
        "id": "55c3f59cdafa4e32a5b128e9702bb61a",
        "word": "gall bladder",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɡɔːl blædə(r)/",
            "us": "/ˈɡɔːl blædər/"
        },
        "nearby": [
            {
                "word": "gallantly",
                "pos": "adverb"
            },
            {
                "word": "gallantry",
                "pos": "noun"
            },
            {
                "word": "gall bladder",
                "pos": "noun"
            },
            {
                "word": "galleon",
                "pos": "noun"
            },
            {
                "word": "galleried",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an organ attached to the liver in which bile is stored",
                    "vi": "một cơ quan gắn liền với gan, trong đó mật được lưu trữ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "070b74b675da4611b3cbf9de7fe806d6",
        "word": "ganglion",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɡæŋɡliən/",
            "us": "/ˈɡæŋɡliən/"
        },
        "nearby": [
            {
                "word": "gangland",
                "pos": "noun"
            },
            {
                "word": "gangling",
                "pos": "adjective"
            },
            {
                "word": "ganglion",
                "pos": "noun"
            },
            {
                "word": "gangmaster",
                "pos": "noun"
            },
            {
                "word": "gangplank",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a mass of nerve cells",
                    "vi": "một khối lượng lớn các tế bào thần kinh"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a swelling (= an area that is larger and rounder than normal) in a tendon, often at the back of the hand",
                    "vi": "sưng (= một vùng lớn hơn và tròn hơn bình thường) ở gân, thường ở mu bàn tay"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "e9fc853050d94f129a8273c1bfc55cbf",
        "word": "gland",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ɡlænd/",
            "us": "/ɡlænd/"
        },
        "nearby": [
            {
                "word": "glance on",
                "pos": "phrasal verb"
            },
            {
                "word": "glancing",
                "pos": "adjective"
            },
            {
                "word": "gland",
                "pos": "noun"
            },
            {
                "word": "glandular",
                "pos": "adjective"
            },
            {
                "word": "glandular fever",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an organ in a person’s or an animal’s body that produces a substance for the body to use; a part in the body that is similar to this, especially a lymph node",
                    "vi": "cơ quan trong cơ thể người hoặc động vật sản sinh ra chất để cơ thể sử dụng; một bộ phận trong cơ thể tương tự như vậy, đặc biệt là một hạch bạch huyết"
                },
                "examples": [
                    {
                        "en": "a snake’s poison glands",
                        "vi": "tuyến độc của rắn"
                    },
                    {
                        "en": "Her glands are swollen.",
                        "vi": "Các tuyến của cô ấy bị sưng lên."
                    },
                    {
                        "en": "She’s gone to bed with swollen glands and a temperature.",
                        "vi": "Cô ấy đi ngủ với sưng hạch và nhiệt độ."
                    }
                ]
            }
        ]
    },
    {
        "id": "360b36c996844cab96eed2cab66b452b",
        "word": "gullet",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɡʌlɪt/",
            "us": "/ˈɡʌlɪt/"
        },
        "nearby": [
            {
                "word": "gull",
                "pos": "noun"
            },
            {
                "word": "Gullah",
                "pos": "noun"
            },
            {
                "word": "gullet",
                "pos": "noun"
            },
            {
                "word": "gullibility",
                "pos": "noun"
            },
            {
                "word": "gullible",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the tube through which food passes from the mouth to the stomach",
                    "vi": "ống dẫn thức ăn từ miệng đến dạ dày"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "d8cc00d408a547c7a276e711fc290f29",
        "word": "hammer",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈhæmə(r)/",
            "us": "/ˈhæmər/"
        },
        "nearby": [
            {
                "word": "Armand Hammer",
                "pos": ""
            },
            {
                "word": "Mike Hammer",
                "pos": ""
            },
            {
                "word": "hammer",
                "pos": "noun"
            },
            {
                "word": "hammer",
                "pos": "verb"
            },
            {
                "word": "hammer and sickle",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a tool with a handle and a heavy metal head, used for breaking things or hitting nails",
                    "vi": "một công cụ có tay cầm và đầu bằng kim loại nặng, dùng để đập vỡ đồ đạc hoặc đánh đinh"
                },
                "examples": [
                    {
                        "en": "a gentle tap with a hammer",
                        "vi": "một cái gõ nhẹ nhàng bằng một cái búa"
                    },
                    {
                        "en": "He struck her on the head with a hammer.",
                        "vi": "Anh ta dùng búa đập vào đầu cô."
                    }
                ]
            },
            {
                "define": {
                    "en": "a tool with a handle and a wooden head, used by a person in charge of an auction (= a sale at which things are sold to the person who offers the most money) in order to get people’s attention when something is just being sold",
                    "vi": "một công cụ có tay cầm và đầu bằng gỗ, được sử dụng bởi một người phụ trách cuộc đấu giá (= một cuộc mua bán mà tại đó những thứ được bán cho người đưa ra nhiều tiền nhất) để thu hút sự chú ý của mọi người khi một thứ gì đó vừa được bán"
                },
                "examples": [
                    {
                        "en": "to come/go under the hammer (= to be sold at auction)",
                        "vi": "đến / đi dưới cái búa (= được bán trong cuộc đấu giá)"
                    },
                    {
                        "en": "Forty modern Russian paintings went under the hammer at Christie’s today.",
                        "vi": "Bốn mươi bức tranh hiện đại của Nga đã đi vào tầm ngắm của Christie's ngày nay."
                    }
                ]
            },
            {
                "define": {
                    "en": "a small wooden part inside a piano, that hits the strings to produce a sound",
                    "vi": "một bộ phận nhỏ bằng gỗ bên trong đàn piano, chạm vào dây để tạo ra âm thanh"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a part inside a gun that makes the gun fire",
                    "vi": "một bộ phận bên trong súng làm cho súng bắn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a metal ball attached to a wire, thrown as a sport",
                    "vi": "một quả bóng kim loại gắn vào dây, ném như một môn thể thao"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the event or sport of throwing the hammer",
                    "vi": "sự kiện hoặc môn thể thao ném búa"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the first of three small bones in the middle ear that carry sound to the inner ear",
                    "vi": "xương đầu tiên trong số ba xương nhỏ ở tai giữa truyền âm thanh đến tai trong"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "if two people are at it hammer and tongs or go at it hammer and tongs, they argue or fight with a lot of energy and noise",
                    "vi": "nếu hai người ở bên nó búa và cái kẹp hoặc đi vào nó búa và cái kẹp, họ tranh luận hoặc đánh nhau với rất nhiều năng lượng và tiếng ồn"
                },
                "examples": [
                    {
                        "en": "We could hear the neighbours going at it hammer and tongs.",
                        "vi": "Chúng tôi có thể nghe thấy những người hàng xóm đang dùng búa và kẹp."
                    }
                ]
            }
        ]
    },
    {
        "id": "955323806c5d4c238bb8513292ad3ca0",
        "word": "hamstring",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈhæmstrɪŋ/",
            "us": "/ˈhæmstrɪŋ/"
        },
        "nearby": [
            {
                "word": "Hampton Court",
                "pos": ""
            },
            {
                "word": "hamster",
                "pos": "noun"
            },
            {
                "word": "hamstring",
                "pos": "noun"
            },
            {
                "word": "hamstring",
                "pos": "verb"
            },
            {
                "word": "Tony Hancock",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "one of the five tendons behind the knee that connect the muscles of the upper leg to the bones of the lower leg",
                    "vi": "một trong năm gân phía sau đầu gối kết nối các cơ của chân trên với xương của chân dưới"
                },
                "examples": [
                    {
                        "en": "a hamstring injury",
                        "vi": "chấn thương gân khoeo"
                    },
                    {
                        "en": "She's pulled a hamstring.",
                        "vi": "Cô ấy bị kéo gân kheo."
                    }
                ]
            },
            {
                "define": {
                    "en": "a tendon behind the hock (= middle joint) of the back leg of a horse and some other animals",
                    "vi": "gân sau mỏm (= khớp giữa) của chân sau ngựa và một số động vật khác"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "d394db1760a34b81a7a51b1042312af4",
        "word": "hemisphere",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈhemɪsfɪə(r)/",
            "us": "/ˈhemɪsfɪr/"
        },
        "nearby": [
            {
                "word": "hem in",
                "pos": "phrasal verb"
            },
            {
                "word": "Ernest Hemingway",
                "pos": ""
            },
            {
                "word": "hemisphere",
                "pos": "noun"
            },
            {
                "word": "hemispherical",
                "pos": "adjective"
            },
            {
                "word": "hemistich",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "one half of the earth, especially the half above or below the equator",
                    "vi": "một nửa của trái đất, đặc biệt là nửa trên hoặc dưới đường xích đạo"
                },
                "examples": [
                    {
                        "en": "the northern/southern hemisphere",
                        "vi": "bán cầu bắc / nam"
                    },
                    {
                        "en": "In the northern hemisphere, December is a winter month.",
                        "vi": "Ở Bắc bán cầu, tháng 12 là một tháng mùa đông."
                    }
                ]
            },
            {
                "define": {
                    "en": "either half of the brain",
                    "vi": "một trong hai bộ não"
                },
                "examples": [
                    {
                        "en": "the left/right hemisphere of the brain",
                        "vi": "bán cầu não trái / phải"
                    }
                ]
            },
            {
                "define": {
                    "en": "one half of a sphere (= a round solid object)",
                    "vi": "một nửa hình cầu (= vật rắn tròn)"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "9a683bb87d4a49e99dc6eae7bddec0b0",
        "word": "hypothalamus",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌhaɪpəˈθæləməs/",
            "us": "/ˌhaɪpəˈθæləməs/"
        },
        "nearby": [
            {
                "word": "hypotaxis",
                "pos": "noun"
            },
            {
                "word": "hypotenuse",
                "pos": "noun"
            },
            {
                "word": "hypothalamus",
                "pos": "noun"
            },
            {
                "word": "hypothermia",
                "pos": "noun"
            },
            {
                "word": "hypothesis",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an area in the central lower part of the brain that controls body temperature, hunger and the release of hormones",
                    "vi": "một khu vực ở phần dưới trung tâm của não kiểm soát nhiệt độ cơ thể, cảm giác đói và giải phóng các hormone"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "e6b7f994fd004665934e3c624936ecb0",
        "word": "incus",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɪŋkəs/",
            "us": "/ˈɪŋkəs/"
        },
        "nearby": [
            {
                "word": "incuriously",
                "pos": "adverb"
            },
            {
                "word": "incursion",
                "pos": "noun"
            },
            {
                "word": "incus",
                "pos": "noun"
            },
            {
                "word": "Ind.",
                "pos": "abbreviation"
            },
            {
                "word": "indaba",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the second of three small bones in the middle ear that carry sound to the inner ear",
                    "vi": "xương thứ hai trong ba xương nhỏ ở tai giữa truyền âm thanh đến tai trong"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "5698d958ea4e424c96dbc8441b33aeef",
        "word": "intestinal",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ɪnˈtestɪnl/",
            "us": "/ɪnˈtestɪnl/"
        },
        "nearby": [
            {
                "word": "intestacy",
                "pos": "noun"
            },
            {
                "word": "intestate",
                "pos": "adjective"
            },
            {
                "word": "intestinal",
                "pos": "adjective"
            },
            {
                "word": "intestinal fortitude",
                "pos": "noun"
            },
            {
                "word": "intestine",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "connected with the intestines",
                    "vi": "kết nối với ruột"
                },
                "examples": [
                    {
                        "en": "intestinal surgery/infection",
                        "vi": "phẫu thuật đường ruột / nhiễm trùng"
                    },
                    {
                        "en": "the intestinal tract/wall",
                        "vi": "đường ruột / thành"
                    }
                ]
            }
        ]
    },
    {
        "id": "885b8cda92464926a14cf518a7872398",
        "word": "intestine",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ɪnˈtestɪn/",
            "us": "/ɪnˈtestɪn/"
        },
        "nearby": [
            {
                "word": "intestinal",
                "pos": "adjective"
            },
            {
                "word": "intestinal fortitude",
                "pos": "noun"
            },
            {
                "word": "intestine",
                "pos": "noun"
            },
            {
                "word": "In the Bleak Midwinter",
                "pos": ""
            },
            {
                "word": "intimacy",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a long tube in the body between the stomach and the anus. Food passes from the stomach to the small intestine and from there to the large intestine.",
                    "vi": "một ống dài trong cơ thể giữa dạ dày và hậu môn. Thức ăn đi từ dạ dày đến ruột non và từ đó đến ruột già."
                },
                "examples": [
                    {
                        "en": "bacteria in the small intestine",
                        "vi": "vi khuẩn trong ruột non"
                    }
                ]
            }
        ]
    },
    {
        "id": "52f8ac199b82491191a6410d7f6f6d1a",
        "word": "jugular",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈdʒʌɡjələ(r)/",
            "us": "/ˈdʒʌɡjələr/"
        },
        "nearby": [
            {
                "word": "juggle",
                "pos": "verb"
            },
            {
                "word": "juggler",
                "pos": "noun"
            },
            {
                "word": "jugular",
                "pos": "noun"
            },
            {
                "word": "juice",
                "pos": "noun"
            },
            {
                "word": "juice",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "any of the three large veins in the neck that carry blood from the head towards the heart",
                    "vi": "bất kỳ trong ba tĩnh mạch lớn ở cổ dẫn máu từ đầu về tim"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to attack somebody’s weakest point during a discussion, in an aggressive way",
                    "vi": "tấn công điểm yếu nhất của ai đó trong cuộc thảo luận, một cách tích cực"
                },
                "examples": [
                    {
                        "en": "She went straight for the jugular and asked him to explain his previous criminal record.",
                        "vi": "Cô đi thẳng đến nhà tù và yêu cầu anh ta giải thích về tiền án tiền sự của mình."
                    }
                ]
            }
        ]
    },
    {
        "id": "3d8ac0aa955143c580dd2520ea128f66",
        "word": "larynx",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈlærɪŋks/",
            "us": "/ˈlærɪŋks/"
        },
        "nearby": [
            {
                "word": "laryngeal",
                "pos": "adjective"
            },
            {
                "word": "laryngitis",
                "pos": "noun"
            },
            {
                "word": "larynx",
                "pos": "noun"
            },
            {
                "word": "lasagne",
                "pos": "noun"
            },
            {
                "word": "lascivious",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the area at the top of the throat that contains the vocal cords",
                    "vi": "khu vực ở trên cùng của cổ họng có chứa dây thanh âm"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "61790fba0d0a4bfdb6424a65609ce69d",
        "word": "ligament",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈlɪɡəmənt/",
            "us": "/ˈlɪɡəmənt/"
        },
        "nearby": [
            {
                "word": "lift off",
                "pos": "phrasal verb"
            },
            {
                "word": "lift-off",
                "pos": "noun"
            },
            {
                "word": "ligament",
                "pos": "noun"
            },
            {
                "word": "ligate",
                "pos": "verb"
            },
            {
                "word": "ligation",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a strong band of tissue in the body that connects bones and supports organs and keeps them in position",
                    "vi": "một dải mô vững chắc trong cơ thể kết nối xương và hỗ trợ các cơ quan và giữ chúng ở vị trí"
                },
                "examples": [
                    {
                        "en": "I've torn a ligament.",
                        "vi": "Tôi bị rách dây chằng."
                    }
                ]
            }
        ]
    },
    {
        "id": "b4d09c465a4d494da55e6993738255ac",
        "word": "limbic system",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈlɪmbɪk sɪstəm/",
            "us": "/ˈlɪmbɪk sɪstəm/"
        },
        "nearby": [
            {
                "word": "limber",
                "pos": "verb"
            },
            {
                "word": "limber up",
                "pos": "phrasal verb"
            },
            {
                "word": "limbic system",
                "pos": "noun"
            },
            {
                "word": "limbo",
                "pos": "noun"
            },
            {
                "word": "lime",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a system of nerves in the brain involving several different areas, connected with basic emotions such as fear and anger and basic needs such as the need to eat and to have sex",
                    "vi": "một hệ thống dây thần kinh trong não liên quan đến một số khu vực khác nhau, kết nối với những cảm xúc cơ bản như sợ hãi và tức giận và những nhu cầu cơ bản như nhu cầu ăn uống và quan hệ tình dục."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "de68caf621e749ed8a65d31136ec6b76",
        "word": "lobe",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ləʊb/",
            "us": "/ləʊb/"
        },
        "nearby": [
            {
                "word": "lobby",
                "pos": "verb"
            },
            {
                "word": "lobbyist",
                "pos": "noun"
            },
            {
                "word": "lobe",
                "pos": "noun"
            },
            {
                "word": "lobelia",
                "pos": "noun"
            },
            {
                "word": "lobola",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the soft part at the bottom of the ear",
                    "vi": "phần mềm ở dưới tai"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a part of an organ in the body, especially the lungs or brain",
                    "vi": "một bộ phận của cơ quan trong cơ thể, đặc biệt là phổi hoặc não"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "75e18c2711c640d4b365a8c7b71b8294",
        "word": "malleus",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmæliəs/",
            "us": "/ˈmæliəs/"
        },
        "nearby": [
            {
                "word": "malleable",
                "pos": "adjective"
            },
            {
                "word": "mallet",
                "pos": "noun"
            },
            {
                "word": "malleus",
                "pos": "noun"
            },
            {
                "word": "Mallory and Irvine",
                "pos": ""
            },
            {
                "word": "mallow",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the first of three small bones in the middle ear that carry sound to the inner ear",
                    "vi": "xương đầu tiên trong số ba xương nhỏ ở tai giữa truyền âm thanh đến tai trong"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "1a556ba1f60d4f0287cf3c1dbe3ff81e",
        "word": "marrow",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmærəʊ/",
            "us": "/ˈmærəʊ/"
        },
        "nearby": [
            {
                "word": "married",
                "pos": "adjective"
            },
            {
                "word": "Neville Marriner",
                "pos": ""
            },
            {
                "word": "marrow",
                "pos": "noun"
            },
            {
                "word": "marrowbone",
                "pos": "noun"
            },
            {
                "word": "marrowfat pea",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a soft substance that fills the hollow parts of bones",
                    "vi": "một chất mềm lấp đầy các phần rỗng của xương"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a large, long vegetable that grows on the ground. Marrows have dark green skin and are white inside.",
                    "vi": "một loại rau to, dài, mọc trên mặt đất. Tủy có vỏ màu xanh đậm và bên trong có màu trắng."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "cc955ff616f2452e84e58ae891b488bb",
        "word": "medulla oblongata",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/meˌdʌlə ˌɒblɒŋˈɡɑːtə/",
            "us": "/məˌdʌlə ˌɑːblɑːŋˈɡɑːtə/"
        },
        "nearby": [
            {
                "word": "meds",
                "pos": "noun"
            },
            {
                "word": "med school",
                "pos": "noun"
            },
            {
                "word": "medulla oblongata",
                "pos": "noun"
            },
            {
                "word": "the Medway",
                "pos": ""
            },
            {
                "word": "meek",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the part of the brain that controls the way the heart and lungs work",
                    "vi": "phần não kiểm soát cách hoạt động của tim và phổi"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "d256ad60e28f4a0d9593efc61a0439a9",
        "word": "membrane",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmembreɪn/",
            "us": "/ˈmembreɪn/"
        },
        "nearby": [
            {
                "word": "Member of the European Parliament",
                "pos": "noun"
            },
            {
                "word": "membership",
                "pos": "noun"
            },
            {
                "word": "membrane",
                "pos": "noun"
            },
            {
                "word": "membranous",
                "pos": "adjective"
            },
            {
                "word": "meme",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a thin layer of skin or tissue that connects or covers parts inside the body",
                    "vi": "một lớp da hoặc mô mỏng kết nối hoặc bao phủ các bộ phận bên trong cơ thể"
                },
                "examples": [
                    {
                        "en": "The virus passes through the cell membrane.",
                        "vi": "Virus đi qua màng tế bào."
                    }
                ]
            },
            {
                "define": {
                    "en": "a very thin layer found in the structure of cells in plants",
                    "vi": "một lớp rất mỏng được tìm thấy trong cấu trúc của tế bào ở thực vật"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a thin layer of material used to prevent air, liquid, etc. from entering a particular part of something",
                    "vi": "một lớp vật liệu mỏng được sử dụng để ngăn không khí, chất lỏng, v.v. xâm nhập vào một bộ phận cụ thể của thứ gì đó"
                },
                "examples": [
                    {
                        "en": "a waterproof membrane",
                        "vi": "màng chống thấm"
                    }
                ]
            }
        ]
    },
    {
        "id": "66128788644f445fac2a60a4e605f322",
        "word": "nephron",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈnefrɒn/",
            "us": "/ˈnefrɑːn/"
        },
        "nearby": [
            {
                "word": "Nepalese",
                "pos": "noun, adjective"
            },
            {
                "word": "nephew",
                "pos": "noun"
            },
            {
                "word": "nephron",
                "pos": "noun"
            },
            {
                "word": "ne plus ultra",
                "pos": "noun"
            },
            {
                "word": "nepotism",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "one of the tiny tubes in the kidneys that filter the blood",
                    "vi": "một trong những ống nhỏ trong thận lọc máu"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "d7b8fcf120e74724a07847b279c1a424",
        "word": "neuron",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈnjʊərɒn/",
            "us": "/ˈnʊrɑːn/"
        },
        "nearby": [
            {
                "word": "neurologist",
                "pos": "noun"
            },
            {
                "word": "neurology",
                "pos": "noun"
            },
            {
                "word": "neuron",
                "pos": "noun"
            },
            {
                "word": "neurophysiology",
                "pos": "noun"
            },
            {
                "word": "neuroscience",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a cell that carries information within the brain and between the brain and other parts of the body",
                    "vi": "một tế bào mang thông tin trong não và giữa não và các bộ phận khác của cơ thể"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c1b6be35ae904f689f23cac8814fab0d",
        "word": "oesophagus",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/iˈsɒfəɡəs/",
            "us": "/iˈsɑːfəɡəs/"
        },
        "nearby": [
            {
                "word": "oenophile",
                "pos": "noun"
            },
            {
                "word": "o'er",
                "pos": "adverb, preposition"
            },
            {
                "word": "oesophagus",
                "pos": "noun"
            },
            {
                "word": "oestrogen",
                "pos": "noun"
            },
            {
                "word": "oestrus",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the tube through which food passes from the mouth to the stomach",
                    "vi": "ống dẫn thức ăn từ miệng đến dạ dày"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "ea15d3e7728244889ade993d6462542d",
        "word": "orifice",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɒrɪfɪs/",
            "us": "/ˈɔːrɪfɪs/"
        },
        "nearby": [
            {
                "word": "-oriented",
                "pos": "combining form"
            },
            {
                "word": "orienteering",
                "pos": "noun"
            },
            {
                "word": "orifice",
                "pos": "noun"
            },
            {
                "word": "origami",
                "pos": "noun"
            },
            {
                "word": "origin",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a hole or opening, especially one in the body",
                    "vi": "một lỗ hoặc lỗ, đặc biệt là một trong cơ thể"
                },
                "examples": [
                    {
                        "en": "the nasal orifice",
                        "vi": "lỗ mũi"
                    }
                ]
            }
        ]
    },
    {
        "id": "260f31c83d0c48039762946ac5c578c1",
        "word": "ossicle",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɒsɪkl/",
            "us": "/ˈɑːsɪkl/"
        },
        "nearby": [
            {
                "word": "osprey",
                "pos": "noun"
            },
            {
                "word": "osseous",
                "pos": "adjective"
            },
            {
                "word": "ossicle",
                "pos": "noun"
            },
            {
                "word": "ossification",
                "pos": "noun"
            },
            {
                "word": "ossify",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "any of the three very small bones in the middle ear",
                    "vi": "bất kỳ xương nào trong số ba xương rất nhỏ ở tai giữa"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "d98d47478d9d4f87b7eef439b5bdb695",
        "word": "ovary",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈəʊvəri/",
            "us": "/ˈəʊvəri/"
        },
        "nearby": [
            {
                "word": "oval window",
                "pos": "noun"
            },
            {
                "word": "ovarian",
                "pos": "adjective"
            },
            {
                "word": "ovary",
                "pos": "noun"
            },
            {
                "word": "ovation",
                "pos": "noun"
            },
            {
                "word": "oven",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "either of the two organs in a woman’s body that produce eggs; a similar organ in female animals, birds and fish",
                    "vi": "một trong hai cơ quan trong cơ thể người phụ nữ sản xuất ra trứng; một cơ quan tương tự ở động vật cái, chim và cá"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the part of a plant that produces seeds",
                    "vi": "một phần của cây tạo ra hạt giống"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "0a52bc63ae784131b6b2ddd8fd3494f9",
        "word": "oviduct",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈəʊvɪdʌkt/",
            "us": "/ˈəʊvɪdʌkt/"
        },
        "nearby": [
            {
                "word": "overwrought",
                "pos": "adjective"
            },
            {
                "word": "overzealous",
                "pos": "adjective"
            },
            {
                "word": "oviduct",
                "pos": "noun"
            },
            {
                "word": "ovine",
                "pos": "adjective"
            },
            {
                "word": "oviparous",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "either of the tubes that carry eggs from the ovaries in women and female animals",
                    "vi": "một trong các ống mang trứng từ buồng trứng ở phụ nữ và động vật cái"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "13c989fbb31c4784849626c0e2433e5a",
        "word": "pancreas",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpæŋkriəs/",
            "us": "/ˈpæŋkriəs/"
        },
        "nearby": [
            {
                "word": "pancetta",
                "pos": "noun"
            },
            {
                "word": "panchayat",
                "pos": "noun"
            },
            {
                "word": "pancreas",
                "pos": "noun"
            },
            {
                "word": "pancreatic",
                "pos": "adjective"
            },
            {
                "word": "panda",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an organ near the stomach that produces insulin and a liquid that helps the body to digest food",
                    "vi": "một cơ quan gần dạ dày sản xuất insulin và chất lỏng giúp cơ thể tiêu hóa thức ăn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a9efab374f32432299e60de8f1e6ad03",
        "word": "pancreatic",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌpæŋkriˈætɪk/",
            "us": "/ˌpæŋkriˈætɪk/"
        },
        "nearby": [
            {
                "word": "panchayat",
                "pos": "noun"
            },
            {
                "word": "pancreas",
                "pos": "noun"
            },
            {
                "word": "pancreatic",
                "pos": "adjective"
            },
            {
                "word": "panda",
                "pos": "noun"
            },
            {
                "word": "panda car",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "connected with the pancreas (= an organ near the stomach that produces insulin and a liquid that helps the body to digest food)",
                    "vi": "kết nối với tuyến tụy (= một cơ quan gần dạ dày sản xuất insulin và chất lỏng giúp cơ thể tiêu hóa thức ăn)"
                },
                "examples": [
                    {
                        "en": "pancreatic juices",
                        "vi": "nước tụy"
                    }
                ]
            }
        ]
    },
    {
        "id": "c709e6efc81d480c93034622db4462d5",
        "word": "pericardium",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌperiˈkɑːdiəm/",
            "us": "/ˌperiˈkɑːrdiəm/"
        },
        "nearby": [
            {
                "word": "pergola",
                "pos": "noun"
            },
            {
                "word": "perhaps",
                "pos": "adverb"
            },
            {
                "word": "pericardium",
                "pos": "noun"
            },
            {
                "word": "perigee",
                "pos": "noun"
            },
            {
                "word": "peril",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the membrane (= thin layer) that surrounds the heart",
                    "vi": "màng (= lớp mỏng) bao quanh trái tim"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "e3c589055e8e436597360fa84ea56d42",
        "word": "pharynx",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈfærɪŋks/",
            "us": "/ˈfærɪŋks/"
        },
        "nearby": [
            {
                "word": "pharyngeal",
                "pos": "noun"
            },
            {
                "word": "pharyngitis",
                "pos": "noun"
            },
            {
                "word": "pharynx",
                "pos": "noun"
            },
            {
                "word": "phase",
                "pos": "noun"
            },
            {
                "word": "phase",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the soft area at the top of the throat where the passages to the nose and mouth connect with the throat",
                    "vi": "khu vực mềm ở đầu cổ họng, nơi đường thông với mũi và miệng kết nối với cổ họng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "9308e1801d364ce6ab6a4e828a33d95d",
        "word": "phlegm",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/flem/",
            "us": "/flem/"
        },
        "nearby": [
            {
                "word": "phlebitis",
                "pos": "noun"
            },
            {
                "word": "phlebotomy",
                "pos": "noun"
            },
            {
                "word": "phlegm",
                "pos": "noun"
            },
            {
                "word": "phlegmatic",
                "pos": "adjective"
            },
            {
                "word": "phlegmatically",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the thick substance that forms in the nose and throat, especially when you have a cold",
                    "vi": "chất đặc hình thành trong mũi và cổ họng, đặc biệt là khi bạn bị cảm lạnh"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the ability to remain calm in a situation that is difficult or frightening",
                    "vi": "khả năng giữ bình tĩnh trong một tình huống khó khăn hoặc đáng sợ"
                },
                "examples": [
                    {
                        "en": "Phlegm and perseverance carried them through many troubles.",
                        "vi": "Sự kiên trì và kiên trì đã mang họ đi qua nhiều rắc rối."
                    }
                ]
            }
        ]
    },
    {
        "id": "96d2d674476c4e50973cd9d4e3932162",
        "word": "plasma",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈplæzmə/",
            "us": "/ˈplæzmə/"
        },
        "nearby": [
            {
                "word": "plantswoman",
                "pos": "noun"
            },
            {
                "word": "plaque",
                "pos": "noun"
            },
            {
                "word": "plasma",
                "pos": "noun"
            },
            {
                "word": "plasma screen",
                "pos": "noun"
            },
            {
                "word": "plasma TV",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the clear liquid part of blood, in which the blood cells, etc. float",
                    "vi": "phần chất lỏng trong suốt của máu, trong đó các tế bào máu, v.v. trôi nổi"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a gas that contains approximately equal numbers of positive and negative electric charges and is present in the sun and most stars",
                    "vi": "một chất khí chứa các điện tích âm và dương xấp xỉ bằng nhau và có mặt trong mặt trời và hầu hết các ngôi sao"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "71235c9a2f45453fa32f8ccc5ff24e46",
        "word": "rectum",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈrektəm/",
            "us": "/ˈrektəm/"
        },
        "nearby": [
            {
                "word": "rector",
                "pos": "noun"
            },
            {
                "word": "rectory",
                "pos": "noun"
            },
            {
                "word": "rectum",
                "pos": "noun"
            },
            {
                "word": "recumbent",
                "pos": "adjective"
            },
            {
                "word": "recuperate",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the end section of the tube where food waste collects before leaving the body through the anus",
                    "vi": "đoạn cuối của ống, nơi chất thải thức ăn thu thập trước khi ra khỏi cơ thể qua hậu môn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "8468927f1faf4695870d9b413f890084",
        "word": "renal",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈriːnl/",
            "us": "/ˈriːnl/"
        },
        "nearby": [
            {
                "word": "renaissance",
                "pos": "noun"
            },
            {
                "word": "Renaissance man",
                "pos": "noun"
            },
            {
                "word": "renal",
                "pos": "adjective"
            },
            {
                "word": "rename",
                "pos": "verb"
            },
            {
                "word": "Ren and Stimpy",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "relating to or involving the kidneys",
                    "vi": "liên quan đến hoặc liên quan đến thận"
                },
                "examples": [
                    {
                        "en": "renal failure",
                        "vi": "suy thận"
                    }
                ]
            }
        ]
    },
    {
        "id": "4c45d46489ab4a418ce87ed2d5f6043e",
        "word": "respiration",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌrespəˈreɪʃn/",
            "us": "/ˌrespəˈreɪʃn/"
        },
        "nearby": [
            {
                "word": "respective",
                "pos": "adjective"
            },
            {
                "word": "respectively",
                "pos": "adverb"
            },
            {
                "word": "respiration",
                "pos": "noun"
            },
            {
                "word": "respirator",
                "pos": "noun"
            },
            {
                "word": "respiratory",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act of breathing",
                    "vi": "hành động thở"
                },
                "examples": [
                    {
                        "en": "Blood pressure and respiration are also recorded.",
                        "vi": "Huyết áp và hô hấp cũng được ghi lại."
                    }
                ]
            },
            {
                "define": {
                    "en": "a process by which organisms (= living things) produce energy from food, typically using oxygen",
                    "vi": "một quá trình mà các sinh vật (= các sinh vật sống) sản xuất năng lượng từ thực phẩm, thường sử dụng oxy"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "595ce4a81ad0458db74b305242a8e79b",
        "word": "sinus",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsaɪnəs/",
            "us": "/ˈsaɪnəs/"
        },
        "nearby": [
            {
                "word": "sinuous",
                "pos": "adjective"
            },
            {
                "word": "sinuously",
                "pos": "adverb"
            },
            {
                "word": "sinus",
                "pos": "noun"
            },
            {
                "word": "sinusitis",
                "pos": "noun"
            },
            {
                "word": "Siobhan",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "any of the hollow spaces in the bones of the head that are connected to the inside of the nose",
                    "vi": "bất kỳ khoảng trống nào trong xương của đầu nối với bên trong mũi"
                },
                "examples": [
                    {
                        "en": "blocked sinuses",
                        "vi": "xoang bị tắc"
                    }
                ]
            }
        ]
    },
    {
        "id": "8e9ab4861ebd46f0940fb2d29760ac65",
        "word": "solar plexus",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌsəʊlə ˈpleksəs/",
            "us": "/ˌsəʊlər ˈpleksəs/"
        },
        "nearby": [
            {
                "word": "solarium",
                "pos": "noun"
            },
            {
                "word": "solar panel",
                "pos": "noun"
            },
            {
                "word": "solar plexus",
                "pos": "noun"
            },
            {
                "word": "solar power",
                "pos": "noun"
            },
            {
                "word": "solar system",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a system of nerves at the base of the stomach",
                    "vi": "một hệ thống dây thần kinh ở đáy dạ dày"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the part of the body at the top of the stomach, below the ribs",
                    "vi": "phần cơ thể ở trên cùng của dạ dày, dưới xương sườn"
                },
                "examples": [
                    {
                        "en": "a painful punch in the solar plexus",
                        "vi": "một cú đấm đau đớn vào đám rối thái dương"
                    }
                ]
            }
        ]
    },
    {
        "id": "225339d12456491388d3652a6eb79642",
        "word": "spinal",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈspaɪnl/",
            "us": "/ˈspaɪnl/"
        },
        "nearby": [
            {
                "word": "spina bifida",
                "pos": "noun"
            },
            {
                "word": "spinach",
                "pos": "noun"
            },
            {
                "word": "spinal",
                "pos": "adjective"
            },
            {
                "word": "spinal column",
                "pos": "noun"
            },
            {
                "word": "spinal cord",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "connected with the spine (= the long bone in the back)",
                    "vi": "kết nối với cột sống (= xương dài ở lưng)"
                },
                "examples": [
                    {
                        "en": "spinal injuries",
                        "vi": "chấn thương cột sống"
                    }
                ]
            }
        ]
    },
    {
        "id": "6be367dc58564120ace7854dd70f12b1",
        "word": "spinal cord",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈspaɪnl kɔːd/",
            "us": "/ˈspaɪnl kɔːrd/"
        },
        "nearby": [
            {
                "word": "spinal",
                "pos": "adjective"
            },
            {
                "word": "spinal column",
                "pos": "noun"
            },
            {
                "word": "spinal cord",
                "pos": "noun"
            },
            {
                "word": "spinal tap",
                "pos": "noun"
            },
            {
                "word": "spindle",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the mass of nerves inside the spine that connects all parts of the body to the brain",
                    "vi": "khối lượng của các dây thần kinh bên trong cột sống kết nối tất cả các bộ phận của cơ thể với não"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "cf9eb45a03d74a0d963f1b0615b500bc",
        "word": "spleen",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/spliːn/",
            "us": "/spliːn/"
        },
        "nearby": [
            {
                "word": "splay-foot",
                "pos": "noun"
            },
            {
                "word": "splay-footed",
                "pos": "adjective"
            },
            {
                "word": "spleen",
                "pos": "noun"
            },
            {
                "word": "splendid",
                "pos": "adjective"
            },
            {
                "word": "splendid",
                "pos": "exclamation"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small organ near the stomach that controls the quality of the blood cells",
                    "vi": "một cơ quan nhỏ gần dạ dày kiểm soát chất lượng của các tế bào máu"
                },
                "examples": [
                    {
                        "en": "a ruptured spleen",
                        "vi": "lá lách bị vỡ"
                    }
                ]
            },
            {
                "define": {
                    "en": "anger",
                    "vi": "Sự phẫn nộ"
                },
                "examples": [
                    {
                        "en": "He vented his spleen (= shouted in an angry way) on the assembled crowd.",
                        "vi": "Anh ta trút lá lách của mình (= hét lên một cách tức giận) vào đám đông đang tụ tập."
                    }
                ]
            }
        ]
    },
    {
        "id": "c6b0b0d11c1c4993969757fd2b9e53f9",
        "word": "stapes",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsteɪpiːz/",
            "us": "/ˈsteɪpiːz/"
        },
        "nearby": [
            {
                "word": "Barbara Stanwyck",
                "pos": ""
            },
            {
                "word": "stanza",
                "pos": "noun"
            },
            {
                "word": "stapes",
                "pos": "noun"
            },
            {
                "word": "staphylococcus",
                "pos": "noun"
            },
            {
                "word": "staple",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the third of three small bones in the middle ear that carry sound to the inner ear",
                    "vi": "phần ba trong số ba xương nhỏ ở tai giữa truyền âm thanh đến tai trong"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a0f78ee44f6c4ed8b1d56b9952d89b45",
        "word": "stem cell",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈstem sel/",
            "us": "/ˈstem sel/"
        },
        "nearby": [
            {
                "word": "STEM",
                "pos": "abbreviation"
            },
            {
                "word": "stem",
                "pos": "verb"
            },
            {
                "word": "stem cell",
                "pos": "noun"
            },
            {
                "word": "stem from",
                "pos": "phrasal verb"
            },
            {
                "word": "stem ginger",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a basic type of cell which can divide and develop into cells with particular functions. All the different kinds of cells in the human body develop from stem cells.",
                    "vi": "một loại tế bào cơ bản có thể phân chia và phát triển thành các tế bào với các chức năng cụ thể. Tất cả các loại tế bào khác nhau trong cơ thể con người đều phát triển từ tế bào gốc."
                },
                "examples": [
                    {
                        "en": "Stem cells are the key to the body’s ability to renew itself.",
                        "vi": "Tế bào gốc là chìa khóa cho khả năng tự làm mới của cơ thể."
                    },
                    {
                        "en": "Tests suggest that stem cells could be used to regenerate damaged body parts.",
                        "vi": "Các thử nghiệm cho thấy tế bào gốc có thể được sử dụng để tái tạo các bộ phận cơ thể bị tổn thương."
                    },
                    {
                        "en": "Stem cell research is the essential first step for cloning.",
                        "vi": "Nghiên cứu tế bào gốc là bước đầu tiên cần thiết để nhân bản."
                    }
                ]
            }
        ]
    },
    {
        "id": "d1e569ffb7564e1393b75eb29f13bd35",
        "word": "stirrup",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈstɪrəp/",
            "us": "/ˈstɪrəp/"
        },
        "nearby": [
            {
                "word": "stirring",
                "pos": "noun"
            },
            {
                "word": "stirring",
                "pos": "adjective"
            },
            {
                "word": "stirrup",
                "pos": "noun"
            },
            {
                "word": "stirrup pants",
                "pos": "noun"
            },
            {
                "word": "stir up",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "one of the metal rings that hang down on each side of a horse’s saddle, used to support the rider’s foot",
                    "vi": "một trong những vòng kim loại treo xuống mỗi bên yên ngựa, được sử dụng để hỗ trợ chân của người cưỡi ngựa"
                },
                "examples": [
                    {
                        "en": "He put his feet in the stirrups.",
                        "vi": "Anh đặt chân vào kiềng."
                    },
                    {
                        "en": "She stood up in her stirrups to see where the others had gone.",
                        "vi": "Cô đứng lên trên chiếc kiềng của mình để xem những người khác đã đi đâu."
                    }
                ]
            },
            {
                "define": {
                    "en": "the third of three small bones in the middle ear that carry sound to the inner ear",
                    "vi": "phần ba trong số ba xương nhỏ ở tai giữa truyền âm thanh đến tai trong"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "768c2197889a40c5a153495690fd8247",
        "word": "thalamus",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈθæləməs/",
            "us": "/ˈθæləməs/"
        },
        "nearby": [
            {
                "word": "Thailand",
                "pos": "noun"
            },
            {
                "word": "thakur",
                "pos": "noun"
            },
            {
                "word": "thalamus",
                "pos": "noun"
            },
            {
                "word": "thalassotherapy",
                "pos": "noun"
            },
            {
                "word": "Irving Thalberg",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "either of the two parts of the brain that control pain and feeling",
                    "vi": "một trong hai phần của não kiểm soát cơn đau và cảm giác"
                },
                "examples": []
            }
        ]
    }
]