[
    {
        "id": "cb0c26daa958489c9d7d428192913439",
        "word": "result",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/rɪˈzʌlt/",
            "us": "/rɪˈzʌlt/"
        },
        "nearby": [
            {
                "word": "rest upon",
                "pos": "phrasal verb"
            },
            {
                "word": "rest with",
                "pos": "phrasal verb"
            },
            {
                "word": "result",
                "pos": "noun"
            },
            {
                "word": "result",
                "pos": "verb"
            },
            {
                "word": "resultant",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a thing that is caused or produced because of something else",
                    "vi": "một thứ được gây ra hoặc được tạo ra do một thứ khác"
                },
                "examples": [
                    {
                        "en": "And did your intervention produce the desired result?",
                        "vi": "Và sự can thiệp của bạn có mang lại kết quả như mong muốn không?"
                    },
                    {
                        "en": "to yield/achieve a result",
                        "vi": "để mang lại / đạt được một kết quả"
                    },
                    {
                        "en": "result of something The company's failure was a direct result of bad management.",
                        "vi": "kết quả của điều gì đó Sự thất bại của công ty là kết quả trực tiếp của việc quản lý tồi."
                    },
                    {
                        "en": "This book is the result of 25 years of research.",
                        "vi": "Cuốn sách này là kết quả của 25 năm nghiên cứu."
                    },
                    {
                        "en": "The end result (= the final one) of her hard work was a place at medical school.",
                        "vi": "Kết quả cuối cùng (= kết quả cuối cùng) cho sự chăm chỉ của cô ấy là một suất vào trường y."
                    },
                    {
                        "en": "as a result He made one big mistake, and, as a result, lost his job.",
                        "vi": "kết quả là anh ta đã mắc một sai lầm lớn, và kết quả là anh ta bị mất việc làm."
                    },
                    {
                        "en": "as a result of something She died as a result of her injuries.",
                        "vi": "do hậu quả của một cái gì đó Cô ấy đã chết vì những vết thương của cô ấy."
                    },
                    {
                        "en": "with the result that… The farm was flooded, with the result that the crop was lost.",
                        "vi": "với kết quả là… Trang trại bị ngập lụt, kết quả là mùa màng bị mất trắng."
                    },
                    {
                        "en": "with… results He decided to get involved, with disastrous results.",
                        "vi": "với… kết quả Anh ấy quyết định tham gia, với kết quả thảm hại."
                    }
                ]
            },
            {
                "define": {
                    "en": "the final score or the name of the winner in a sports event, competition, election, etc.",
                    "vi": "điểm số cuối cùng hoặc tên của người chiến thắng trong một sự kiện thể thao, cuộc thi, cuộc bầu cử, v.v."
                },
                "examples": [
                    {
                        "en": "the election results",
                        "vi": "kết quả bầu cử"
                    },
                    {
                        "en": "The announcer was reading out the football results.",
                        "vi": "Phát thanh viên đang đọc kết quả bóng đá."
                    },
                    {
                        "en": "result of something They will announce the result of the vote tonight.",
                        "vi": "kết quả của một cái gì đó Họ sẽ công bố kết quả của cuộc bỏ phiếu vào tối nay."
                    }
                ]
            },
            {
                "define": {
                    "en": "a victory or a success",
                    "vi": "một chiến thắng hoặc một thành công"
                },
                "examples": [
                    {
                        "en": "We badly need to get a result from this match.",
                        "vi": "Chúng tôi rất cần có được một kết quả từ trận đấu này."
                    },
                    {
                        "en": "This was a great result for us.",
                        "vi": "Đây là một kết quả tuyệt vời cho chúng tôi."
                    },
                    {
                        "en": "He left. Result! (= used when you are happy something has happened)",
                        "vi": "Anh ấy đã đi. Kết quả! (= được sử dụng khi bạn vui vì điều gì đó đã xảy ra)"
                    }
                ]
            },
            {
                "define": {
                    "en": "the mark or grade you get in an exam or in a number of exams",
                    "vi": "điểm hoặc điểm bạn đạt được trong một kỳ thi hoặc trong một số kỳ thi"
                },
                "examples": [
                    {
                        "en": "Have you had your results yet?",
                        "vi": "Bạn đã có kết quả của mình chưa?"
                    },
                    {
                        "en": "When do you get your exam results?",
                        "vi": "Khi nào bạn nhận được kết quả kỳ thi của mình?"
                    }
                ]
            },
            {
                "define": {
                    "en": "the information that you get from a scientific test or piece of research",
                    "vi": "thông tin mà bạn nhận được từ một thử nghiệm khoa học hoặc một phần của nghiên cứu"
                },
                "examples": [
                    {
                        "en": "Other research has yielded similar results.",
                        "vi": "Nghiên cứu khác cũng cho kết quả tương tự."
                    },
                    {
                        "en": "The doctor will explain your blood test results.",
                        "vi": "Bác sĩ sẽ giải thích kết quả xét nghiệm máu của bạn."
                    },
                    {
                        "en": "a positive/negative test result",
                        "vi": "một kết quả xét nghiệm dương tính / âm tính"
                    },
                    {
                        "en": "result of something the results of a study",
                        "vi": "kết quả của một cái gì đó kết quả của một nghiên cứu"
                    },
                    {
                        "en": "The results of our experiment indicate that environmental factors play a part.",
                        "vi": "Kết quả thí nghiệm của chúng tôi chỉ ra rằng các yếu tố môi trường đóng một vai trò quan trọng."
                    },
                    {
                        "en": "The results obtained were compared with previous results.",
                        "vi": "Kết quả thu được được so sánh với kết quả trước đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "the information that you get from a computer search",
                    "vi": "thông tin mà bạn nhận được từ tìm kiếm trên máy tính"
                },
                "examples": [
                    {
                        "en": "My search produced several thousand results.",
                        "vi": "Tìm kiếm của tôi cho ra vài nghìn kết quả."
                    },
                    {
                        "en": "The user can control how the search results are displayed.",
                        "vi": "Người dùng có thể kiểm soát cách hiển thị kết quả tìm kiếm."
                    },
                    {
                        "en": "the first page of search results",
                        "vi": "trang đầu tiên của kết quả tìm kiếm"
                    }
                ]
            },
            {
                "define": {
                    "en": "things that are achieved successfully",
                    "vi": "những điều đạt được thành công"
                },
                "examples": [
                    {
                        "en": "The project is beginning to show results.",
                        "vi": "Dự án đang bắt đầu cho thấy kết quả."
                    },
                    {
                        "en": "a coach who knows how to get results from his players",
                        "vi": "một huấn luyện viên biết cách thu được kết quả từ các cầu thủ của mình"
                    },
                    {
                        "en": "For best results, defrost fully before use.",
                        "vi": "Để có kết quả tốt nhất, hãy rã đông hoàn toàn trước khi sử dụng."
                    }
                ]
            },
            {
                "define": {
                    "en": "the amount of profit or loss made by a business over a particular period of time",
                    "vi": "số tiền lãi hoặc lỗ của một doanh nghiệp trong một khoảng thời gian cụ thể"
                },
                "examples": [
                    {
                        "en": "Companies are required by law to report their financial results on a quarterly basis.",
                        "vi": "Theo luật, các công ty phải báo cáo kết quả tài chính của họ hàng quý."
                    },
                    {
                        "en": "The company will publish its interim results (= before the final results are known) on Monday.",
                        "vi": "Công ty sẽ công bố kết quả tạm thời (= trước khi biết kết quả cuối cùng) vào thứ Hai."
                    },
                    {
                        "en": "The corporation is expected to announce improved results for the last quarter.",
                        "vi": "Công ty dự kiến sẽ công bố kết quả cải thiện trong quý cuối cùng."
                    }
                ]
            }
        ]
    },
    {
        "id": "9db205ba361e4b4f9f478b3c96b2f136",
        "word": "campaign",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/kæmˈpeɪn/",
            "us": "/kæmˈpeɪn/"
        },
        "nearby": [
            {
                "word": "camp",
                "pos": "verb"
            },
            {
                "word": "camp",
                "pos": "adjective"
            },
            {
                "word": "campaign",
                "pos": "noun"
            },
            {
                "word": "campaign",
                "pos": "verb"
            },
            {
                "word": "campaigner",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a series of planned activities that are intended to achieve a particular social, commercial or political aim",
                    "vi": "một loạt các hoạt động được lên kế hoạch nhằm đạt được một mục đích xã hội, thương mại hoặc chính trị cụ thể"
                },
                "examples": [
                    {
                        "en": "an anti-smoking campaign",
                        "vi": "một chiến dịch chống hút thuốc lá"
                    },
                    {
                        "en": "an advertising/a marketing campaign",
                        "vi": "một quảng cáo / một chiến dịch tiếp thị"
                    },
                    {
                        "en": "an election campaign",
                        "vi": "một chiến dịch bầu cử"
                    },
                    {
                        "en": "the recent presidential campaign",
                        "vi": "chiến dịch tranh cử tổng thống gần đây"
                    },
                    {
                        "en": "campaign for something the campaign for parliamentary reform",
                        "vi": "vận động cho một cái gì đó chiến dịch cải cách quốc hội"
                    },
                    {
                        "en": "campaign against something a campaign against ageism in the workplace",
                        "vi": "chiến dịch chống lại một cái gì đó một chiến dịch chống lại chủ nghĩa tuổi tác ở nơi làm việc"
                    },
                    {
                        "en": "campaign to do something Today police launched a campaign to reduce road accidents.",
                        "vi": "Chiến dịch làm điều gì đó Hôm nay cảnh sát đã phát động một chiến dịch giảm thiểu tai nạn giao thông đường bộ."
                    },
                    {
                        "en": "They began a grass-roots campaign to encourage people to shop locally.",
                        "vi": "Họ đã bắt đầu một chiến dịch cơ sở để khuyến khích mọi người mua sắm tại địa phương."
                    },
                    {
                        "en": "to mount/start a campaign",
                        "vi": "để gắn kết / bắt đầu một chiến dịch"
                    },
                    {
                        "en": "to run/lead/spearhead a campaign",
                        "vi": "để chạy / dẫn đầu / dẫn đầu một chiến dịch"
                    },
                    {
                        "en": "Both sides have been accused of waging a dirty campaign.",
                        "vi": "Cả hai bên đều bị cáo buộc tiến hành một chiến dịch bẩn thỉu."
                    },
                    {
                        "en": "the governor's campaign manager",
                        "vi": "người quản lý chiến dịch của thống đốc"
                    },
                    {
                        "en": "The candidates are on the campaign trail (= travelling around to attract support).",
                        "vi": "Các ứng cử viên đang trên đường vận động tranh cử (= đi khắp nơi để thu hút sự ủng hộ)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a series of attacks and battles that are intended to achieve a particular military aim during a war",
                    "vi": "một loạt các cuộc tấn công và trận chiến nhằm đạt được một mục đích quân sự cụ thể trong chiến tranh"
                },
                "examples": [
                    {
                        "en": "the North African campaign",
                        "vi": "chiến dịch Bắc Phi"
                    },
                    {
                        "en": "a bombing campaign",
                        "vi": "một chiến dịch ném bom"
                    },
                    {
                        "en": "Air battles had dominated the campaign.",
                        "vi": "Các trận không chiến đã chiếm ưu thế trong chiến dịch."
                    },
                    {
                        "en": "The government has intensified the military campaign against the rebels.",
                        "vi": "Chính phủ đã tăng cường chiến dịch quân sự chống lại phe nổi dậy."
                    },
                    {
                        "en": "The Russian campaign ended with the German defeat at Stalingrad.",
                        "vi": "Chiến dịch của Nga kết thúc với thất bại của quân Đức tại Stalingrad."
                    }
                ]
            }
        ]
    },
    {
        "id": "cd8ae3f1b73242e4984a125958c739b9",
        "word": "election",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ɪˈlekʃn/",
            "us": "/ɪˈlekʃn/"
        },
        "nearby": [
            {
                "word": "electability",
                "pos": "noun"
            },
            {
                "word": "electable",
                "pos": "adjective"
            },
            {
                "word": "election",
                "pos": "noun"
            },
            {
                "word": "electioneering",
                "pos": "noun"
            },
            {
                "word": "elective",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the process of choosing a person or a group of people for a position, especially a political position, by voting",
                    "vi": "Quá trình lựa chọn một người hoặc một nhóm người cho một vị trí, đặc biệt là một vị trí chính trị, bằng cách bỏ phiếu"
                },
                "examples": [
                    {
                        "en": "presidential/parliamentary/local elections",
                        "vi": "bầu cử tổng thống / quốc hội / địa phương"
                    },
                    {
                        "en": "the upcoming midterm elections for Congress",
                        "vi": "cuộc bầu cử giữa nhiệm kỳ sắp tới cho Quốc hội"
                    },
                    {
                        "en": "The prime minister is about to call (= announce) an election.",
                        "vi": "Thủ tướng sắp kêu gọi (= thông báo) một cuộc bầu cử."
                    },
                    {
                        "en": "Elections will be held later this year.",
                        "vi": "Các cuộc bầu cử sẽ được tổ chức vào cuối năm nay."
                    },
                    {
                        "en": "to vote in an election",
                        "vi": "bỏ phiếu trong một cuộc bầu cử"
                    },
                    {
                        "en": "(especially British English) How many candidates are standing for election?",
                        "vi": "(đặc biệt là tiếng Anh Anh) Có bao nhiêu ứng cử viên đang ứng cử?"
                    },
                    {
                        "en": "(especially North American English) to run for election",
                        "vi": "(đặc biệt là tiếng Anh Bắc Mỹ) để tham gia tranh cử"
                    },
                    {
                        "en": "to fight/contest an election",
                        "vi": "đấu tranh / tranh cử"
                    },
                    {
                        "en": "to win/lose an election",
                        "vi": "thắng / thua một cuộc bầu cử"
                    },
                    {
                        "en": "the 2020 US election campaign",
                        "vi": "chiến dịch bầu cử Hoa Kỳ năm 2020"
                    },
                    {
                        "en": "an election result/victory",
                        "vi": "một kết quả bầu cử / chiến thắng"
                    },
                    {
                        "en": "election day/night",
                        "vi": "bầu cử ngày / đêm"
                    }
                ]
            },
            {
                "define": {
                    "en": "the fact of having been chosen by election",
                    "vi": "thực tế là đã được chọn bởi cuộc bầu cử"
                },
                "examples": [
                    {
                        "en": "Her election will mark a new beginning for the country.",
                        "vi": "Cuộc bầu cử của bà sẽ đánh dấu một sự khởi đầu mới cho đất nước."
                    },
                    {
                        "en": "election as something We welcome his election as president.",
                        "vi": "bầu cử như một cái gì đó Chúng tôi hoan nghênh cuộc bầu cử của ông ấy làm tổng thống."
                    },
                    {
                        "en": "election to something a year after her election to the committee",
                        "vi": "bầu cử vào một cái gì đó một năm sau khi cô ấy được bầu vào ủy ban"
                    },
                    {
                        "en": "Since his election to the Senate, he has been an ardent gay rights supporter.",
                        "vi": "Kể từ khi đắc cử vào Thượng viện, ông là một người ủng hộ quyền của người đồng tính nhiệt thành."
                    }
                ]
            }
        ]
    },
    {
        "id": "bdd3f29f766b4038844be2ce78f4c52b",
        "word": "vote",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/vəʊt/",
            "us": "/vəʊt/"
        },
        "nearby": [
            {
                "word": "Vorticism",
                "pos": "noun"
            },
            {
                "word": "votary",
                "pos": "noun"
            },
            {
                "word": "vote",
                "pos": "noun"
            },
            {
                "word": "vote",
                "pos": "verb"
            },
            {
                "word": "vote bank",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a formal choice that you make in an election or at a meeting in order to choose somebody or decide something",
                    "vi": "một lựa chọn chính thức mà bạn đưa ra trong một cuộc bầu cử hoặc tại một cuộc họp để chọn ai đó hoặc quyết định điều gì đó"
                },
                "examples": [
                    {
                        "en": "to win/lose votes",
                        "vi": "thắng / thua phiếu bầu"
                    },
                    {
                        "en": "You can cast your vote at the local polling station.",
                        "vi": "Bạn có thể bỏ phiếu của mình tại điểm bỏ phiếu địa phương."
                    },
                    {
                        "en": "He took 53% of the votes in the election.",
                        "vi": "Ông đã giành được 53% số phiếu bầu trong cuộc bầu cử."
                    },
                    {
                        "en": "They've started opening the ballot boxes and counting the votes.",
                        "vi": "Họ đã bắt đầu mở thùng phiếu và kiểm phiếu."
                    },
                    {
                        "en": "No candidate gained a majority of the votes in the first round.",
                        "vi": "Không có ứng cử viên nào đạt được đa số phiếu trong vòng đầu tiên."
                    },
                    {
                        "en": "The Tory candidate received only 4203 votes.",
                        "vi": "Ứng cử viên Tory chỉ nhận được 4203 phiếu bầu."
                    },
                    {
                        "en": "vote for/against somebody/something There were 21 votes for and 17 against the motion, with 2 abstentions.",
                        "vi": "bỏ phiếu cho / chống lại ai đó / cái gì đó Có 21 phiếu ủng hộ và 17 phiếu chống đối với đề nghị, với 2 phiếu trắng."
                    },
                    {
                        "en": "The motion was passed by 6 votes to 3.",
                        "vi": "Đề nghị đã được thông qua bởi 6 phiếu bầu đến 3."
                    },
                    {
                        "en": "The Green candidate won over 3 000 of the 14 000 votes cast.",
                        "vi": "Ứng cử viên Xanh lá đã giành được hơn 3 000 trong số 14 000 phiếu bầu."
                    }
                ]
            },
            {
                "define": {
                    "en": "an occasion when a group of people vote on something",
                    "vi": "một dịp khi một nhóm người bỏ phiếu về điều gì đó"
                },
                "examples": [
                    {
                        "en": "to win/lose a vote",
                        "vi": "thắng / thua một cuộc bỏ phiếu"
                    },
                    {
                        "en": "vote on something to have/take/hold a vote on an issue",
                        "vi": "bỏ phiếu về điều gì đó để có / lấy / tổ chức biểu quyết về một vấn đề"
                    },
                    {
                        "en": "vote in favour of something We saw today a decisive vote in favour of (= for) industrial action.",
                        "vi": "bỏ phiếu ủng hộ điều gì đó Chúng ta đã thấy hôm nay một cuộc bỏ phiếu quyết định ủng hộ (= cho) hành động công nghiệp."
                    },
                    {
                        "en": "The issue was put to the vote.",
                        "vi": "Vấn đề đã được đưa ra biểu quyết."
                    },
                    {
                        "en": "The vote was unanimous.",
                        "vi": "Biểu quyết nhất trí."
                    },
                    {
                        "en": "vote to do something He called on the government to delay the vote to authorize miltary action.",
                        "vi": "bỏ phiếu để làm điều gì đó Ông kêu gọi chính phủ trì hoãn cuộc bỏ phiếu để cho phép hành động quân sự."
                    },
                    {
                        "en": "Decisions have to be ratified by a majority vote.",
                        "vi": "Các quyết định phải được thông qua bằng đa số phiếu."
                    }
                ]
            },
            {
                "define": {
                    "en": "the right to vote, especially in political elections",
                    "vi": "quyền bầu cử, đặc biệt là trong các cuộc bầu cử chính trị"
                },
                "examples": [
                    {
                        "en": "In Britain and the US, people get the vote at 18.",
                        "vi": "Ở Anh và Mỹ, người dân nhận được phiếu bầu ở tuổi 18."
                    },
                    {
                        "en": "How many years is it since women have had the vote?",
                        "vi": "Phụ nữ có bầu bao nhiêu năm rồi?"
                    },
                    {
                        "en": "legislation to give prisoners the vote",
                        "vi": "luật để cho các tù nhân bỏ phiếu"
                    }
                ]
            },
            {
                "define": {
                    "en": "the total number of votes in an election",
                    "vi": "tổng số phiếu bầu trong một cuộc bầu cử"
                },
                "examples": [
                    {
                        "en": "She obtained 40% of the vote.",
                        "vi": "Cô thu được 40% phiếu bầu."
                    },
                    {
                        "en": "The party increased their share of the vote.",
                        "vi": "Đảng đã tăng tỷ lệ phiếu bầu của họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "the vote given by a particular group of people, or for a particular party, etc.",
                    "vi": "phiếu bầu được đưa ra bởi một nhóm người cụ thể hoặc cho một bên cụ thể, v.v."
                },
                "examples": [
                    {
                        "en": "the student vote",
                        "vi": "phiếu bầu của sinh viên"
                    },
                    {
                        "en": "the Labour vote",
                        "vi": "cuộc bỏ phiếu của Lao động"
                    },
                    {
                        "en": "the Hispanic/Latino vote",
                        "vi": "lá phiếu của người Tây Ban Nha / La tinh"
                    }
                ]
            }
        ]
    },
    {
        "id": "679fd7a7afed4557b4d8d2362a2fe1a1",
        "word": "vote",
        "pos": "verb",
        "level": "b1",
        "phonetic": {
            "uk": "/vəʊt/",
            "us": "/vəʊt/"
        },
        "nearby": [
            {
                "word": "votary",
                "pos": "noun"
            },
            {
                "word": "vote",
                "pos": "noun"
            },
            {
                "word": "vote",
                "pos": "verb"
            },
            {
                "word": "vote bank",
                "pos": "noun"
            },
            {
                "word": "vote down",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to show formally by marking a paper, raising your hand, using a voting machine, etc. which person you want to win an election, or which plan or idea you support",
                    "vi": "thể hiện chính thức bằng cách đánh dấu vào tờ giấy, giơ tay, sử dụng máy bỏ phiếu, v.v. bạn muốn giành chiến thắng trong cuộc bầu cử nào hoặc kế hoạch hoặc ý tưởng nào mà bạn ủng hộ"
                },
                "examples": [
                    {
                        "en": "How did you vote at the last election?",
                        "vi": "Bạn đã bỏ phiếu như thế nào tại cuộc bầu cử vừa qua?"
                    },
                    {
                        "en": "Only about half of the electorate bothered to vote.",
                        "vi": "Chỉ có khoảng một nửa số cử tri bận tâm đến việc bỏ phiếu."
                    },
                    {
                        "en": "vote for/against somebody/something to vote for a candidate/party/bill",
                        "vi": "bỏ phiếu cho / chống lại ai đó / cái gì đó để bỏ phiếu cho một ứng cử viên / đảng / dự luật"
                    },
                    {
                        "en": "Did you vote for or against her?",
                        "vi": "Bạn bỏ phiếu cho hay chống lại cô ấy?"
                    },
                    {
                        "en": "vote in favour of something Over 60% of members voted in favour of (= for) the motion.",
                        "vi": "bỏ phiếu ủng hộ điều gì đó Hơn 60% thành viên đã bỏ phiếu ủng hộ (= cho) đề xuất."
                    },
                    {
                        "en": "vote on something We'll listen to the arguments on both sides and then vote on it.",
                        "vi": "biểu quyết về điều gì đó Chúng tôi sẽ lắng nghe các tranh luận của cả hai bên và sau đó bỏ phiếu về điều đó."
                    },
                    {
                        "en": "About 1.8 million people voted in the election.",
                        "vi": "Khoảng 1,8 triệu người đã bỏ phiếu trong cuộc bầu cử."
                    },
                    {
                        "en": "vote something We voted Democrat in the last election.",
                        "vi": "bỏ phiếu một cái gì đó Chúng tôi đã bầu chọn Đảng viên Đảng Dân chủ trong cuộc bầu cử vừa qua."
                    },
                    {
                        "en": "to vote yes/no",
                        "vi": "bỏ phiếu có / không"
                    },
                    {
                        "en": "vote to do something The board voted unanimously not to file for bankruptcy.",
                        "vi": "bỏ phiếu để làm điều gì đó Hội đồng đã biểu quyết nhất trí không nộp đơn xin phá sản."
                    },
                    {
                        "en": "The Senate voted overwhelmingly to retain sanctions.",
                        "vi": "Thượng viện đã bỏ phiếu áp đảo để giữ lại các lệnh trừng phạt."
                    },
                    {
                        "en": "Parliament voted to set up an independent inquiry into the matter.",
                        "vi": "Nghị viện đã bỏ phiếu để thiết lập một cuộc điều tra độc lập về vấn đề này."
                    },
                    {
                        "en": "vote that… The meeting voted that the town council should reject the scheme.",
                        "vi": "biểu quyết rằng… Cuộc họp đã biểu quyết rằng hội đồng thị trấn nên bác bỏ kế hoạch."
                    },
                    {
                        "en": "Everyone over 18 has the right to vote.",
                        "vi": "Mọi người trên 18 tuổi đều có quyền bầu cử."
                    },
                    {
                        "en": "to be registered/eligible to vote",
                        "vi": "được đăng ký / đủ điều kiện để bỏ phiếu"
                    }
                ]
            },
            {
                "define": {
                    "en": "to choose somebody/something for a position or an award by voting",
                    "vi": "để chọn ai đó / cái gì đó cho một vị trí hoặc một giải thưởng bằng cách bỏ phiếu"
                },
                "examples": [
                    {
                        "en": "He was voted most promising new director.",
                        "vi": "Anh được bình chọn là đạo diễn mới triển vọng nhất."
                    },
                    {
                        "en": "The College of Cardinals voted him Pope.",
                        "vi": "Đại học Hồng y bầu ông làm Giáo hoàng."
                    },
                    {
                        "en": "The New York Film Critics Circle voted it their Best Picture of the Year.",
                        "vi": "Hội phê bình phim New York đã bình chọn đây là Phim hay nhất trong năm của họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to say that something is good or bad",
                    "vi": "để nói rằng điều gì đó tốt hay xấu"
                },
                "examples": [
                    {
                        "en": "The event was voted a great success.",
                        "vi": "Sự kiện được bình chọn đã thành công tốt đẹp."
                    }
                ]
            },
            {
                "define": {
                    "en": "to agree to give somebody/yourself something by voting",
                    "vi": "đồng ý cho ai đó / bản thân bạn một cái gì đó bằng cách bỏ phiếu"
                },
                "examples": [
                    {
                        "en": "The directors have just voted themselves a huge pay increase.",
                        "vi": "Các giám đốc vừa bỏ phiếu cho mình một khoản tăng lương khủng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to suggest something or support a suggestion that somebody has made",
                    "vi": "để đề xuất điều gì đó hoặc hỗ trợ một đề xuất mà ai đó đã đưa ra"
                },
                "examples": [
                    {
                        "en": "I vote (that) we go out to eat.",
                        "vi": "Tôi bầu (mà) chúng tôi đi ăn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to show what you think about something by going or not going somewhere",
                    "vi": "để thể hiện những gì bạn nghĩ về điều gì đó bằng cách đi hoặc không đi đâu đó"
                },
                "examples": [
                    {
                        "en": "Shoppers voted with their feet and avoided the store.",
                        "vi": "Người mua hàng đã bỏ phiếu bằng chân và tránh cửa hàng."
                    }
                ]
            }
        ]
    },
    {
        "id": "37c77a7090a24861a4cf309907dc9553",
        "word": "voter",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈvəʊtə(r)/",
            "us": "/ˈvəʊtər/"
        },
        "nearby": [
            {
                "word": "vote out",
                "pos": "phrasal verb"
            },
            {
                "word": "vote out of",
                "pos": "phrasal verb"
            },
            {
                "word": "voter",
                "pos": "noun"
            },
            {
                "word": "vote through",
                "pos": "phrasal verb"
            },
            {
                "word": "voting",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who votes or has the right to vote, especially in a political election",
                    "vi": "một người bỏ phiếu hoặc có quyền bầu cử, đặc biệt là trong một cuộc bầu cử chính trị"
                },
                "examples": [
                    {
                        "en": "A clear majority of voters were in favour of the motion.",
                        "vi": "Đa số cử tri rõ ràng đã ủng hộ đề nghị này."
                    },
                    {
                        "en": "Only 60% of eligible voters actually used their vote.",
                        "vi": "Chỉ 60% cử tri đủ điều kiện thực sự sử dụng lá phiếu của họ."
                    }
                ]
            }
        ]
    },
    {
        "id": "f4b8ef65d5f644e9866dbef97b5f02b5",
        "word": "contest",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈkɒntest/",
            "us": "/ˈkɑːntest/"
        },
        "nearby": [
            {
                "word": "content provider",
                "pos": "noun"
            },
            {
                "word": "content word",
                "pos": "noun"
            },
            {
                "word": "contest",
                "pos": "noun"
            },
            {
                "word": "contest",
                "pos": "verb"
            },
            {
                "word": "contestant",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a competition in which people try to win something",
                    "vi": "một cuộc thi trong đó mọi người cố gắng giành được thứ gì đó"
                },
                "examples": [
                    {
                        "en": "to hold a singing/talent contest",
                        "vi": "tổ chức một cuộc thi ca hát / tài năng"
                    },
                    {
                        "en": "to enter/win a contest",
                        "vi": "tham gia / giành chiến thắng trong một cuộc thi"
                    },
                    {
                        "en": "in a contest She was awarded the first prize in an essay contest .",
                        "vi": "trong một cuộc thi Cô đã được giải nhất một cuộc thi viết luận."
                    },
                    {
                        "en": "contest between A and B It was a close contest between two evenly matched crews.",
                        "vi": "cuộc thi giữa A và B Đó là một cuộc thi chặt chẽ giữa hai đội đồng đều."
                    },
                    {
                        "en": "contest with somebody He said he had enjoyed the contest with his rival for the title .",
                        "vi": "cuộc thi với ai đó Anh ấy nói rằng anh ấy đã rất thích cuộc thi với đối thủ của mình cho danh hiệu."
                    },
                    {
                        "en": "contest to do something a contest to win a free tickets to the concert",
                        "vi": "cuộc thi làm điều gì đó cuộc thi giành vé miễn phí đến buổi hòa nhạc"
                    }
                ]
            },
            {
                "define": {
                    "en": "a struggle to gain control or power",
                    "vi": "một cuộc đấu tranh để giành quyền kiểm soát hoặc quyền lực"
                },
                "examples": [
                    {
                        "en": "the leadership/presidential contest",
                        "vi": "cuộc thi lãnh đạo / tổng thống"
                    },
                    {
                        "en": "in a contest Both parties are predicting victory in this close contest.",
                        "vi": "trong một cuộc thi Cả hai bên đều dự đoán chiến thắng trong cuộc thi sát nút này."
                    },
                    {
                        "en": "contest for something a contest for the leadership of the party",
                        "vi": "cuộc thi cho một cái gì đó một cuộc thi cho sự lãnh đạo của đảng"
                    },
                    {
                        "en": "contest between A and B a contest between traditional and liberal views",
                        "vi": "cuộc thi giữa A và B một cuộc thi giữa quan điểm truyền thống và tự do"
                    },
                    {
                        "en": "contest with somebody It looks like being a close-fought contest with the Conservatives.",
                        "vi": "cuộc cạnh tranh với ai đó Có vẻ như là một cuộc thi đấu chặt chẽ với Đảng Bảo thủ."
                    },
                    {
                        "en": "contest to do something the contest to gain control of the party",
                        "vi": "cuộc thi để làm điều gì đó cuộc thi để giành quyền kiểm soát đảng"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that one side in a competition is so much stronger or better than the other that it is sure to win easily",
                    "vi": "thường nói rằng một bên trong một cuộc thi mạnh hơn hoặc tốt hơn bên kia rất nhiều nên chắc chắn sẽ giành chiến thắng một cách dễ dàng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c8506eefe148451a9362e87d012ac609",
        "word": "contest",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/kənˈtest/",
            "us": "/kənˈtest/"
        },
        "nearby": [
            {
                "word": "content word",
                "pos": "noun"
            },
            {
                "word": "contest",
                "pos": "noun"
            },
            {
                "word": "contest",
                "pos": "verb"
            },
            {
                "word": "contestant",
                "pos": "noun"
            },
            {
                "word": "context",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to take part in a competition, election, etc. and try to win it",
                    "vi": "tham gia vào một cuộc thi, cuộc bầu cử, v.v. và cố gắng giành chiến thắng"
                },
                "examples": [
                    {
                        "en": "Three candidates contested the leadership.",
                        "vi": "Ba ứng cử viên tranh giành quyền lãnh đạo."
                    },
                    {
                        "en": "The party has decided not to contest this election.",
                        "vi": "Đảng đã quyết định không tham gia cuộc bầu cử này."
                    },
                    {
                        "en": "Conservatives met to decide who would contest the seat for them at the next election.",
                        "vi": "Những người bảo thủ đã họp để quyết định ai sẽ tranh ghế cho họ trong cuộc bầu cử tiếp theo."
                    },
                    {
                        "en": "a hotly/fiercely/keenly contested game (= one in which the players try very hard to win and the scores are close)",
                        "vi": "một trò chơi cạnh tranh gay gắt / khốc liệt / gay cấn (= một trò chơi trong đó những người chơi cố gắng rất nhiều để giành chiến thắng và điểm số là gần nhau)"
                    }
                ]
            },
            {
                "define": {
                    "en": "to formally oppose a decision or statement because you think it is wrong",
                    "vi": "chính thức phản đối một quyết định hoặc tuyên bố vì bạn cho rằng nó sai"
                },
                "examples": [
                    {
                        "en": "to contest a will (= try to show that it was not correctly made in law)",
                        "vi": "để tranh chấp một di chúc (= cố gắng chứng tỏ rằng nó không được lập đúng theo luật)"
                    },
                    {
                        "en": "The divorce was not contested.",
                        "vi": "Cuộc ly hôn không gây tranh cãi."
                    },
                    {
                        "en": "His insurance company decided to contest the claim.",
                        "vi": "Công ty bảo hiểm của anh ấy đã quyết định phản đối yêu cầu bồi thường."
                    }
                ]
            }
        ]
    },
    {
        "id": "5d413c3244a04aae933ab966df5c8826",
        "word": "elect",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/ɪˈlekt/",
            "us": "/ɪˈlekt/"
        },
        "nearby": [
            {
                "word": "Eleanor of Castile",
                "pos": ""
            },
            {
                "word": "e-learning",
                "pos": "noun"
            },
            {
                "word": "elect",
                "pos": "verb"
            },
            {
                "word": "elect",
                "pos": "adjective"
            },
            {
                "word": "electability",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to choose somebody to do a particular job by voting for them",
                    "vi": "để chọn ai đó làm một công việc cụ thể bằng cách bỏ phiếu cho họ"
                },
                "examples": [
                    {
                        "en": "elect somebody/something Voters will elect a new president on 30 March next year.",
                        "vi": "bầu ai đó / cái gì đó Các cử tri sẽ bầu ra chủ tịch mới vào ngày 30 tháng 3 năm sau."
                    },
                    {
                        "en": "the newly/democratically elected government",
                        "vi": "chính phủ mới / được bầu một cách dân chủ"
                    },
                    {
                        "en": "an elected representative/official/assembly",
                        "vi": "một đại diện được bầu / quan chức / hội đồng"
                    },
                    {
                        "en": "What changes will he make if he gets elected?",
                        "vi": "Anh ta sẽ thực hiện những thay đổi gì nếu trúng cử?"
                    },
                    {
                        "en": "elect somebody to something She became the first black woman to be elected to the Senate.",
                        "vi": "bầu ai đó vào việc gì đó Cô trở thành người phụ nữ da đen đầu tiên được bầu vào Thượng viện."
                    },
                    {
                        "en": "elect somebody (as) something He was elected (as) MP for Oxford East.",
                        "vi": "bầu ai đó (với tư cách) một cái gì đó Ông đã được bầu (làm) nghị sĩ cho Oxford East."
                    },
                    {
                        "en": "The party first elected her leader in 2017.",
                        "vi": "Đảng lần đầu tiên bầu ra lãnh đạo của cô vào năm 2017."
                    }
                ]
            },
            {
                "define": {
                    "en": "to choose to do something",
                    "vi": "để chọn làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "Increasing numbers of people elect to work from home nowadays.",
                        "vi": "Ngày nay, ngày càng có nhiều người chọn làm việc tại nhà."
                    },
                    {
                        "en": "Several of the tenants have elected to move to smaller premises.",
                        "vi": "Một số người thuê đã chọn chuyển đến các cơ sở nhỏ hơn."
                    }
                ]
            }
        ]
    },
    {
        "id": "d90895373e274dedacb5416103e9f427",
        "word": "majority",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/məˈdʒɒrəti/",
            "us": "/məˈdʒɔːrəti/"
        },
        "nearby": [
            {
                "word": "major general",
                "pos": "noun"
            },
            {
                "word": "major in",
                "pos": "phrasal verb"
            },
            {
                "word": "majority",
                "pos": "noun"
            },
            {
                "word": "majority leader",
                "pos": "noun"
            },
            {
                "word": "majority rule",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the largest part of a group of people or things",
                    "vi": "phần lớn nhất của một nhóm người hoặc sự vật"
                },
                "examples": [
                    {
                        "en": "majority (of somebody/something) The majority of people interviewed prefer TV to radio.",
                        "vi": "Đa số (của ai đó / cái gì đó) Phần lớn những người được phỏng vấn thích TV hơn radio."
                    },
                    {
                        "en": "The majority was/were in favour of banning smoking.",
                        "vi": "Đa số ủng hộ việc cấm hút thuốc."
                    },
                    {
                        "en": "This treatment is not available in the vast majority of hospitals.",
                        "vi": "Phương pháp điều trị này không có sẵn ở đại đa số các bệnh viện."
                    },
                    {
                        "en": "The overwhelming majority of participants were men.",
                        "vi": "Đa số những người tham gia là nam giới."
                    },
                    {
                        "en": "to represent/form/constitute/comprise the majority of somebody/something",
                        "vi": "đại diện cho / hình thức / cấu thành / bao gồm phần lớn ai đó / cái gì đó"
                    },
                    {
                        "en": "in a/the majority (of something) In the nursing profession, women are in the majority.",
                        "vi": "in a / the most (of something) Trong nghề điều dưỡng, phụ nữ chiếm đa số."
                    },
                    {
                        "en": "The drug provided significant pain relief in a majority of cases.",
                        "vi": "Thuốc giúp giảm đau đáng kể trong hầu hết các trường hợp."
                    },
                    {
                        "en": "a majority decision (= one that is decided by what most people want)",
                        "vi": "một quyết định đa số (= một quyết định được quyết định bởi những gì hầu hết mọi người muốn)"
                    },
                    {
                        "en": "We make decisions by majority vote.",
                        "vi": "Chúng tôi đưa ra quyết định theo đa số phiếu."
                    },
                    {
                        "en": "the majority opinion/view",
                        "vi": "ý kiến / quan điểm đa số"
                    }
                ]
            },
            {
                "define": {
                    "en": "the number of votes by which one political party wins an election; the number of votes by which one side in a discussion, etc. wins",
                    "vi": "số phiếu bầu mà một đảng chính trị thắng một cuộc bầu cử; số phiếu bầu mà một bên trong cuộc thảo luận, v.v. giành chiến thắng"
                },
                "examples": [
                    {
                        "en": "by/with a majority of something She was elected by a majority of 749.",
                        "vi": "bởi / với đa số điều gì đó Cô ấy đã được bầu bởi đa số 749."
                    },
                    {
                        "en": "The resolution was carried by a huge majority.",
                        "vi": "Nghị quyết đã được thực hiện bởi một phần lớn."
                    },
                    {
                        "en": "majority over somebody They had a large majority over their nearest rivals.",
                        "vi": "đa số so với ai đó Họ chiếm đa số hơn các đối thủ gần nhất của họ."
                    },
                    {
                        "en": "They have a clear majority (= large majority) in Parliament.",
                        "vi": "Họ có đa số rõ ràng (= đa số lớn) trong Nghị viện."
                    },
                    {
                        "en": "to win/get/gain/secure a majority",
                        "vi": "giành được / có được / đạt được / đảm bảo đa số"
                    }
                ]
            },
            {
                "define": {
                    "en": "the difference between the number of votes given to the candidate who wins the election and the total number of votes of all the other candidates",
                    "vi": "chênh lệch giữa số phiếu bầu của ứng cử viên thắng cử và tổng số phiếu bầu của tất cả các ứng cử viên khác"
                },
                "examples": [
                    {
                        "en": "Without this shift, Kerry would have had a popular majority of a million votes.",
                        "vi": "Nếu không có sự thay đổi này, Kerry đã có được đa số phổ thông một triệu phiếu bầu."
                    }
                ]
            },
            {
                "define": {
                    "en": "the age at which you are legally considered to be an adult",
                    "vi": "độ tuổi mà bạn được coi là người lớn một cách hợp pháp"
                },
                "examples": [
                    {
                        "en": "The age of majority in Britain was reduced from 21 to 18 in 1970.",
                        "vi": "Độ tuổi trưởng thành ở Anh đã giảm từ 21 xuống 18 vào năm 1970."
                    }
                ]
            }
        ]
    },
    {
        "id": "8305267b2b0143a38b4dc7710d8f2123",
        "word": "protest vote",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈprəʊtest vəʊt/",
            "us": "/ˈprəʊtest vəʊt/"
        },
        "nearby": [
            {
                "word": "protestation",
                "pos": "noun"
            },
            {
                "word": "protester",
                "pos": "noun"
            },
            {
                "word": "protest vote",
                "pos": "noun"
            },
            {
                "word": "proto-",
                "pos": "combining form"
            },
            {
                "word": "protocol",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a vote for a person or party not because you support them but because you want to prevent another person or party from succeeding",
                    "vi": "phiếu bầu cho một người hoặc đảng phái không phải vì bạn ủng hộ họ mà vì bạn muốn ngăn cản người hoặc đảng phái khác thành công"
                },
                "examples": [
                    {
                        "en": "People were really casting a protest vote against the leadership of the Democratic Party rather than endorsing the far left.",
                        "vi": "Mọi người thực sự đã bỏ phiếu phản đối sự lãnh đạo của Đảng Dân chủ hơn là tán thành phe cánh tả."
                    }
                ]
            },
            {
                "define": {
                    "en": "the total number of protest votes in an election",
                    "vi": "tổng số phiếu phản đối trong một cuộc bầu cử"
                },
                "examples": [
                    {
                        "en": "The Communist Party appeared to benefit from the protest vote.",
                        "vi": "Đảng Cộng sản dường như được hưởng lợi từ cuộc bỏ phiếu phản đối."
                    }
                ]
            }
        ]
    },
    {
        "id": "e45c297e24964b22b2b49c155fa818cb",
        "word": "run",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/rʌn/",
            "us": "/rʌn/"
        },
        "nearby": [
            {
                "word": "rumpus room",
                "pos": "noun"
            },
            {
                "word": "rumpy pumpy",
                "pos": "noun"
            },
            {
                "word": "run",
                "pos": "verb"
            },
            {
                "word": "run",
                "pos": "noun"
            },
            {
                "word": "runabout",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to move using your legs, going faster than when you walk",
                    "vi": "di chuyển bằng chân của bạn, đi nhanh hơn khi bạn đi bộ"
                },
                "examples": [
                    {
                        "en": "Can you run as fast as Mike?",
                        "vi": "Bạn có thể chạy nhanh như Mike?"
                    },
                    {
                        "en": "They turned and ran when they saw us coming.",
                        "vi": "Họ quay đầu bỏ chạy khi thấy chúng tôi đến."
                    },
                    {
                        "en": "She came running to meet us.",
                        "vi": "Cô ấy chạy đến gặp chúng tôi."
                    },
                    {
                        "en": "I had to run to catch the bus.",
                        "vi": "Tôi phải chạy để bắt xe buýt."
                    },
                    {
                        "en": "+ adv./prep. The dogs ran off as soon as we appeared.",
                        "vi": "Err:509"
                    },
                    {
                        "en": "He ran home in tears to his mother.",
                        "vi": "Anh chạy về nhà trong nước mắt với mẹ."
                    },
                    {
                        "en": "The children spent the morning running around in the park.",
                        "vi": "Bọn trẻ đã dành cả buổi sáng để chạy quanh công viên."
                    },
                    {
                        "en": "She can run really fast.",
                        "vi": "Cô ấy có thể chạy rất nhanh."
                    }
                ]
            },
            {
                "define": {
                    "en": "to travel a particular distance by running",
                    "vi": "để di chuyển một khoảng cách cụ thể bằng cách chạy"
                },
                "examples": [
                    {
                        "en": "Who was the first person to run a mile in under four minutes?",
                        "vi": "Ai là người đầu tiên chạy một dặm trong vòng dưới bốn phút?"
                    },
                    {
                        "en": "I ran four miles today.",
                        "vi": "Tôi đã chạy bốn dặm hôm nay."
                    }
                ]
            },
            {
                "define": {
                    "en": "to run as a sport",
                    "vi": "chạy như một môn thể thao"
                },
                "examples": [
                    {
                        "en": "She used to run when she was at college.",
                        "vi": "Cô ấy đã từng chạy khi còn học đại học."
                    },
                    {
                        "en": "I often go running before work.",
                        "vi": "Tôi thường chạy trước khi làm việc."
                    },
                    {
                        "en": "Try to run round the block a few times every morning.",
                        "vi": "Cố gắng chạy vòng quanh khu nhà vài lần vào mỗi buổi sáng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to take part in a race",
                    "vi": "tham gia một cuộc đua"
                },
                "examples": [
                    {
                        "en": "run in something He will be running in the 100 metres tonight.",
                        "vi": "chạy trong một cái gì đó Anh ấy sẽ chạy trong 100 mét tối nay."
                    },
                    {
                        "en": "There are only five horses running in the first race.",
                        "vi": "Chỉ có năm con ngựa chạy trong cuộc đua đầu tiên."
                    },
                    {
                        "en": "run something to run a marathon",
                        "vi": "chạy cái gì đó để chạy marathon"
                    },
                    {
                        "en": "Farah ran a fine race to take the gold medal.",
                        "vi": "Farah đã chạy một cuộc đua tốt để giành lấy huy chương vàng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make a race take place",
                    "vi": "để làm cho một cuộc đua diễn ra"
                },
                "examples": [
                    {
                        "en": "The Derby will be run in spite of the bad weather.",
                        "vi": "Trận Derby sẽ diễn ra bất chấp thời tiết xấu."
                    }
                ]
            },
            {
                "define": {
                    "en": "to hurry from one place to another",
                    "vi": "nhanh chóng từ nơi này đến nơi khác"
                },
                "examples": [
                    {
                        "en": "I've spent the whole day running around after the kids.",
                        "vi": "Tôi đã dành cả ngày để chạy theo lũ trẻ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be in charge of a business, campaign, etc.",
                    "vi": "phụ trách kinh doanh, chiến dịch, v.v."
                },
                "examples": [
                    {
                        "en": "to run a hotel/store/language school",
                        "vi": "để điều hành một khách sạn / cửa hàng / trường ngoại ngữ"
                    },
                    {
                        "en": "He has no idea how to run a business.",
                        "vi": "Anh ta không biết làm thế nào để điều hành một doanh nghiệp."
                    },
                    {
                        "en": "Stop trying to run my life (= organize it) for me.",
                        "vi": "Ngừng cố gắng điều hành cuộc sống của tôi (= sắp xếp nó) cho tôi."
                    },
                    {
                        "en": "The shareholders want more say in how the company is run.",
                        "vi": "Các cổ đông muốn nói nhiều hơn về cách công ty được điều hành."
                    },
                    {
                        "en": "a badly run company",
                        "vi": "một công ty hoạt động tồi tệ"
                    },
                    {
                        "en": "Both candidates have run a good campaign.",
                        "vi": "Cả hai ứng cử viên đều đã chạy một chiến dịch tốt."
                    },
                    {
                        "en": "state-run industries",
                        "vi": "các ngành công nghiệp quốc doanh"
                    }
                ]
            },
            {
                "define": {
                    "en": "to make a service, course of study, etc. available to people",
                    "vi": "để cung cấp một dịch vụ, khóa học, v.v. cho mọi người"
                },
                "examples": [
                    {
                        "en": "The college runs summer courses for foreign students.",
                        "vi": "Trường tổ chức các khóa học mùa hè cho sinh viên nước ngoài."
                    },
                    {
                        "en": "The programme will be jointly run with NASA in the US.",
                        "vi": "Chương trình sẽ được phối hợp thực hiện với NASA tại Mỹ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to travel on a particular route",
                    "vi": "đi du lịch trên một tuyến đường cụ thể"
                },
                "examples": [
                    {
                        "en": "Buses to Oxford run every half hour.",
                        "vi": "Xe buýt đến Oxford chạy cứ nửa giờ một lần."
                    },
                    {
                        "en": "+ adv./prep. All the trains are running late (= are leaving later than planned).",
                        "vi": "Err:509"
                    },
                    {
                        "en": "Trains between London and Brighton run throughout the day.",
                        "vi": "Các chuyến tàu giữa London và Brighton chạy suốt cả ngày."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make buses, trains, etc. travel on a particular route",
                    "vi": "để làm cho xe buýt, xe lửa, v.v. đi trên một tuyến đường cụ thể"
                },
                "examples": [
                    {
                        "en": "run something + adv./prep. They run extra trains during the rush hour.",
                        "vi": "chạy cái gì đó + adv./prep. Họ chạy thêm tàu trong giờ cao điểm."
                    },
                    {
                        "en": "The transport company is concerned about the cost of running more buses.",
                        "vi": "Công ty vận tải lo ngại về chi phí chạy thêm xe buýt."
                    }
                ]
            },
            {
                "define": {
                    "en": "to operate or function; to make something do this",
                    "vi": "để vận hành hoặc hoạt động; để làm một cái gì đó làm điều này"
                },
                "examples": [
                    {
                        "en": "Stan had the chainsaw running.",
                        "vi": "Stan đã chạy cưa máy."
                    },
                    {
                        "en": "run on something Our van runs on (= uses) diesel.",
                        "vi": "chạy bằng thứ gì đó Xe van của chúng tôi chạy bằng (= sử dụng) dầu diesel."
                    },
                    {
                        "en": "run something Could you run the engine for a moment?",
                        "vi": "chạy cái gì đó Bạn có thể chạy động cơ trong giây lát được không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "when a computer program or system runs or somebody runs it, it operates",
                    "vi": "khi một chương trình hoặc hệ thống máy tính chạy hoặc ai đó chạy nó, nó sẽ hoạt động"
                },
                "examples": [
                    {
                        "en": "You may find that some apps are running slowly.",
                        "vi": "Bạn có thể thấy rằng một số ứng dụng đang chạy chậm."
                    },
                    {
                        "en": "There are too many programs running on your computer.",
                        "vi": "Có quá nhiều chương trình đang chạy trên máy tính của bạn."
                    },
                    {
                        "en": "You need to have antivirus software running on your PC.",
                        "vi": "Bạn cần có phần mềm chống vi-rút chạy trên PC của mình."
                    },
                    {
                        "en": "The app runs on all Android devices.",
                        "vi": "Ứng dụng này chạy trên tất cả các thiết bị Android."
                    },
                    {
                        "en": "run something You can run the program overnight.",
                        "vi": "chạy một cái gì đó Bạn có thể chạy chương trình qua đêm."
                    },
                    {
                        "en": "My PC runs Windows 10.",
                        "vi": "PC của tôi chạy Windows 10."
                    },
                    {
                        "en": "Don't forget to run a final spellcheck.",
                        "vi": "Đừng quên kiểm tra chính tả lần cuối."
                    },
                    {
                        "en": "What applications were you running when the problem occurred?",
                        "vi": "Bạn đã chạy những ứng dụng nào khi sự cố xảy ra?"
                    }
                ]
            },
            {
                "define": {
                    "en": "if a recording on a tape runs or somebody runs it, it plays",
                    "vi": "nếu bản ghi trên băng chạy hoặc ai đó chạy nó, nó sẽ phát"
                },
                "examples": [
                    {
                        "en": "He didn't know the tape was still running.",
                        "vi": "Anh ta không biết cuốn băng vẫn đang chạy."
                    },
                    {
                        "en": "run something Run the tape, please.",
                        "vi": "chạy cái gì đó Chạy băng, làm ơn."
                    },
                    {
                        "en": "run something + adv./prep. Can you run the tape back a few minutes?",
                        "vi": "chạy cái gì đó + adv./prep. Bạn có thể chạy đoạn băng trở lại vài phút không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to own and use a vehicle or machine",
                    "vi": "sở hữu và sử dụng một phương tiện hoặc máy móc"
                },
                "examples": [
                    {
                        "en": "I can't afford to run a car on my salary.",
                        "vi": "Tôi không có khả năng chạy xe hơi bằng tiền lương của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to drive somebody to a place in a car",
                    "vi": "để chở ai đó đến một nơi trong ô tô"
                },
                "examples": [
                    {
                        "en": "Shall I run you home?",
                        "vi": "Tôi sẽ đưa bạn về nhà?"
                    },
                    {
                        "en": "Would you mind running me to the shops?",
                        "vi": "Bạn có phiền đưa tôi đến các cửa hàng không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to move, especially quickly, in a particular direction",
                    "vi": "để di chuyển, đặc biệt là nhanh chóng, theo một hướng cụ thể"
                },
                "examples": [
                    {
                        "en": "The car ran off the road into a ditch.",
                        "vi": "Chiếc xe ô tô lao khỏi đường vào một con mương."
                    },
                    {
                        "en": "A shiver ran down my spine.",
                        "vi": "Một cơn rùng mình chạy dọc sống lưng."
                    },
                    {
                        "en": "The sledge ran smoothly over the frozen snow.",
                        "vi": "Chiếc xe trượt tuyết chạy êm ru trên lớp tuyết đóng băng."
                    },
                    {
                        "en": "The old tramlines are still there but now no trams run on them.",
                        "vi": "Các tuyến xe điện cũ vẫn còn đó nhưng bây giờ không có xe điện nào chạy trên chúng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to move something in a particular direction",
                    "vi": "để di chuyển một cái gì đó theo một hướng cụ thể"
                },
                "examples": [
                    {
                        "en": "She ran her fingers nervously through her hair.",
                        "vi": "Cô lo lắng lướt những ngón tay qua mái tóc của mình."
                    },
                    {
                        "en": "I ran my eyes over the page.",
                        "vi": "Tôi lướt mắt qua trang giấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to lead or stretch from one place to another; to make something do this",
                    "vi": "để dẫn dắt hoặc kéo dài từ nơi này sang nơi khác; để làm một cái gì đó làm điều này"
                },
                "examples": [
                    {
                        "en": "+ adv./prep. He had a scar running down his left cheek.",
                        "vi": "Err:509"
                    },
                    {
                        "en": "The road runs parallel to the river.",
                        "vi": "Con đường chạy song song với dòng sông."
                    },
                    {
                        "en": "The railway line runs right past the house.",
                        "vi": "Tuyến đường sắt chạy ngang qua nhà."
                    },
                    {
                        "en": "run something The bookcase runs the length of the room.",
                        "vi": "run something Tủ sách chạy theo chiều dài của căn phòng."
                    },
                    {
                        "en": "run something + adv./prep. We ran a cable from the lights to the stage.",
                        "vi": "chạy cái gì đó + adv./prep. Chúng tôi đã chạy một dây cáp từ đèn đến sân khấu."
                    }
                ]
            },
            {
                "define": {
                    "en": "to flow",
                    "vi": "chảy"
                },
                "examples": [
                    {
                        "en": "The tears ran down her cheeks.",
                        "vi": "Những giọt nước mắt chảy dài trên má."
                    },
                    {
                        "en": "Water was running all over the bathroom floor.",
                        "vi": "Nước chảy khắp sàn phòng tắm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make liquid flow",
                    "vi": "để làm cho chất lỏng chảy"
                },
                "examples": [
                    {
                        "en": "run something (into something) She ran hot water into the bucket.",
                        "vi": "chạy cái gì đó (vào một cái gì đó) Cô ấy chạy nước nóng vào xô."
                    },
                    {
                        "en": "to run the hot tap (= to turn it so that water flows from it)",
                        "vi": "để chạy vòi nước nóng (= vặn vòi để nước chảy từ vòi)"
                    },
                    {
                        "en": "run something for somebody I'll run a bath for you.",
                        "vi": "chạy cái gì đó cho ai đó Tôi sẽ chạy cái tắm cho bạn."
                    },
                    {
                        "en": "run somebody something I'll run you a bath.",
                        "vi": "chạy ai đó cái gì đó tôi sẽ tắm cho bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to send out a liquid",
                    "vi": "gửi ra chất lỏng"
                },
                "examples": [
                    {
                        "en": "Who left the tap running?",
                        "vi": "Ai để vòi chạy?"
                    },
                    {
                        "en": "Your nose is running (= mucus is flowing from it).",
                        "vi": "Mũi của bạn đang chảy (= chất nhầy chảy ra từ nó)."
                    },
                    {
                        "en": "The smoke makes my eyes run.",
                        "vi": "Khói làm tôi chảy nước mắt."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be covered with a liquid",
                    "vi": "được bao phủ bởi một chất lỏng"
                },
                "examples": [
                    {
                        "en": "His face was running with sweat.",
                        "vi": "Mặt anh lấm tấm mồ hôi."
                    },
                    {
                        "en": "The bathroom floor was running with water.",
                        "vi": "Sàn phòng tắm chảy đầy nước."
                    }
                ]
            },
            {
                "define": {
                    "en": "if the colour runs in a piece of clothing, etc. when it gets wet, the colour comes out of the material and spreads into other pieces of clothing, etc. in the same water",
                    "vi": "nếu màu chảy trong quần áo, v.v. khi bị ướt, màu sẽ ra khỏi vật liệu và lan sang các mảnh quần áo khác, v.v. trong cùng một nước"
                },
                "examples": [
                    {
                        "en": "The colour ran and made all my underwear pink.",
                        "vi": "Màu sắc chạy và làm cho tất cả đồ lót của tôi màu hồng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to melt",
                    "vi": "tan chảy"
                },
                "examples": [
                    {
                        "en": "The wax began to run.",
                        "vi": "Sáp bắt đầu chảy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to become different in a particular way, especially a bad way",
                    "vi": "trở nên khác biệt theo một cách cụ thể, đặc biệt là một cách xấu"
                },
                "examples": [
                    {
                        "en": "The river ran dry (= stopped flowing) during the drought.",
                        "vi": "Sông cạn (= ngừng chảy) trong thời gian hạn hán."
                    },
                    {
                        "en": "Supplies are running low.",
                        "vi": "Nguồn cung cấp sắp hết."
                    },
                    {
                        "en": "We understand that feelings are running high on this issue",
                        "vi": "Chúng tôi hiểu rằng cảm giác đang dâng cao về vấn đề này"
                    },
                    {
                        "en": "We've run short of milk.",
                        "vi": "Chúng tôi đã thiếu sữa."
                    },
                    {
                        "en": "You've got your rivals running scared.",
                        "vi": "Bạn đã khiến các đối thủ của bạn sợ hãi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be at or near a particular level",
                    "vi": "ở hoặc gần một cấp độ cụ thể"
                },
                "examples": [
                    {
                        "en": "Inflation was running at 26 per cent.",
                        "vi": "Lạm phát đang ở mức 26%."
                    }
                ]
            },
            {
                "define": {
                    "en": "to continue for a particular period of time without stopping",
                    "vi": "tiếp tục trong một khoảng thời gian cụ thể mà không dừng lại"
                },
                "examples": [
                    {
                        "en": "run for something Her last musical ran for six months on Broadway.",
                        "vi": "chạy cho một cái gì đó vở nhạc kịch cuối cùng của cô ấy đã diễn ra trong sáu tháng trên sân khấu Broadway."
                    },
                    {
                        "en": "run from A to B The course runs from June 25th to August 27th.",
                        "vi": "chạy từ A đến B Khóa học kéo dài từ ngày 25 tháng 6 đến ngày 27 tháng 8."
                    },
                    {
                        "en": "This debate will run and run!",
                        "vi": "Cuộc tranh luận này sẽ chạy và chạy!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to operate or be legally acceptable for a particular period of time",
                    "vi": "để hoạt động hoặc được chấp nhận về mặt pháp lý trong một khoảng thời gian cụ thể"
                },
                "examples": [
                    {
                        "en": "The permit runs for three months.",
                        "vi": "Giấy phép có hiệu lực trong ba tháng."
                    },
                    {
                        "en": "The lease on my house only has a year left to run.",
                        "vi": "Hợp đồng thuê nhà của tôi chỉ còn một năm nữa là hết hạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to happen or progress at the time or in the way mentioned",
                    "vi": "xảy ra hoặc tiến triển tại thời điểm hoặc theo cách đã đề cập"
                },
                "examples": [
                    {
                        "en": "+ adv./prep. Programmes are running a few minutes behind schedule this evening.",
                        "vi": "Err:509"
                    },
                    {
                        "en": "Everything is running according to plan.",
                        "vi": "Mọi thứ đang chạy theo đúng kế hoạch."
                    },
                    {
                        "en": "Her life had always run smoothly before.",
                        "vi": "Trước đây cuộc sống của cô luôn suôn sẻ."
                    },
                    {
                        "en": "The murderer was given three life sentences, to run concurrently.",
                        "vi": "Kẻ sát nhân bị tuyên ba bản án chung thân, để xử cùng một lúc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be a candidate in an election for a political position, especially in the US",
                    "vi": "trở thành một ứng cử viên trong một cuộc bầu cử cho một vị trí chính trị, đặc biệt là ở Hoa Kỳ"
                },
                "examples": [
                    {
                        "en": "Obama ran a second time in 2012.",
                        "vi": "Obama tranh cử lần thứ hai vào năm 2012."
                    },
                    {
                        "en": "run for somebody/something Hilary Clinton ran for president in 2016.",
                        "vi": "tranh cử ai đó / điều gì đó Hilary Clinton tranh cử tổng thống vào năm 2016."
                    },
                    {
                        "en": "He ran unsuccessfully for the Senate in New York.",
                        "vi": "Ông đã tranh cử vào Thượng viện ở New York không thành công."
                    },
                    {
                        "en": "run in something She is planning to run in the parliamentary election.",
                        "vi": "chạy trong một cái gì đó Cô ấy đang có kế hoạch tranh cử trong cuộc bầu cử quốc hội."
                    }
                ]
            },
            {
                "define": {
                    "en": "to bring or take something into a country illegally and secretly",
                    "vi": "mang hoặc mang một thứ gì đó vào một quốc gia bất hợp pháp và bí mật"
                },
                "examples": [
                    {
                        "en": "run something + adv./prep. He used to run guns across the border.",
                        "vi": "chạy cái gì đó + adv./prep. Anh đã từng cầm súng chạy qua biên giới."
                    },
                    {
                        "en": "She made money by running drugs.",
                        "vi": "Cô kiếm tiền bằng cách điều hành ma túy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have particular words, contents, etc.",
                    "vi": "để có các từ, nội dung cụ thể, v.v."
                },
                "examples": [
                    {
                        "en": "Their argument ran something like this…",
                        "vi": "Cuộc tranh cãi của họ diễn ra như thế này…"
                    },
                    {
                        "en": "+ speech ‘Ten shot dead by gunmen,’ ran the newspaper headline.",
                        "vi": "Err:509"
                    }
                ]
            },
            {
                "define": {
                    "en": "to print and publish an item or a story",
                    "vi": "để in và xuất bản một mục hoặc một câu chuyện"
                },
                "examples": [
                    {
                        "en": "On advice from their lawyers they decided not to run the story.",
                        "vi": "Theo lời khuyên từ luật sư của họ, họ quyết định không chạy câu chuyện."
                    }
                ]
            },
            {
                "define": {
                    "en": "to do a test, an experiment, etc.",
                    "vi": "để làm một bài kiểm tra, một thử nghiệm, v.v."
                },
                "examples": [
                    {
                        "en": "run something on something The doctors decided to run some more tests on the blood samples.",
                        "vi": "chạy một cái gì đó trên một cái gì đó Các bác sĩ quyết định chạy thêm một số xét nghiệm trên các mẫu máu."
                    },
                    {
                        "en": "run something The two experiments are run in parallel.",
                        "vi": "chạy một cái gì đó Hai thử nghiệm được chạy song song."
                    },
                    {
                        "en": "The company is running clinical trials of the new drug.",
                        "vi": "Công ty đang chạy thử nghiệm lâm sàng loại thuốc mới."
                    }
                ]
            },
            {
                "define": {
                    "en": "if tights or stockings run, a long thin hole appears in them",
                    "vi": "nếu quần tất hoặc tất dài chạy, một lỗ mỏng dài sẽ xuất hiện trên chúng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be pleased to do what somebody wants",
                    "vi": "được vui lòng làm những gì ai đó muốn"
                },
                "examples": [
                    {
                        "en": "She knew she had only to call and he would come running.",
                        "vi": "Cô biết cô chỉ cần gọi và anh sẽ chạy đến."
                    }
                ]
            },
            {
                "define": {
                    "en": "to run in order to escape from somebody/something",
                    "vi": "chạy để thoát khỏi ai đó / cái gì đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to treat somebody badly and not worry about their feelings",
                    "vi": "đối xử tệ với ai đó và không lo lắng về cảm xúc của họ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "working fully and correctly",
                    "vi": "hoạt động đầy đủ và chính xác"
                },
                "examples": [
                    {
                        "en": "It will be a lot easier when we have the database up and running.",
                        "vi": "Nó sẽ dễ dàng hơn rất nhiều khi chúng ta đã thiết lập và chạy cơ sở dữ liệu."
                    },
                    {
                        "en": "We soon had the sound system up and running.",
                        "vi": "Chúng tôi đã sớm lắp đặt và chạy hệ thống âm thanh."
                    }
                ]
            }
        ]
    },
    {
        "id": "0cffd58f8e644d67bbd26054b7eaed3c",
        "word": "stand",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/stænd/",
            "us": "/stænd/"
        },
        "nearby": [
            {
                "word": "stanchion",
                "pos": "noun"
            },
            {
                "word": "stand-up",
                "pos": "noun"
            },
            {
                "word": "stand",
                "pos": "verb"
            },
            {
                "word": "stand",
                "pos": "noun"
            },
            {
                "word": "stand-alone",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to be on your feet; to be in a vertical position",
                    "vi": "được trên đôi chân của bạn; ở vị trí thẳng đứng"
                },
                "examples": [
                    {
                        "en": "She was too weak to stand.",
                        "vi": "Cô ấy quá yếu để có thể đứng vững."
                    },
                    {
                        "en": "+ adv./prep. a bird standing on one leg",
                        "vi": "Err:509"
                    },
                    {
                        "en": "Don't just stand there—do something!",
                        "vi": "Đừng chỉ đứng đó — hãy làm gì đó!"
                    },
                    {
                        "en": "I was standing only a few feet away.",
                        "vi": "Tôi đang đứng cách đó chỉ vài bước chân."
                    },
                    {
                        "en": "We all stood around in the corridor waiting.",
                        "vi": "Tất cả chúng tôi đứng quanh hành lang chờ đợi."
                    },
                    {
                        "en": "to stand on your head/hands (= to be upside down, balancing on your head/hands)",
                        "vi": "để đứng trên đầu / tay của bạn (= lộn ngược, giữ thăng bằng trên đầu / tay của bạn)"
                    },
                    {
                        "en": "+ adj. Stand still while I take your photo.",
                        "vi": "Err:509"
                    },
                    {
                        "en": "stand doing something We stood talking for a few minutes.",
                        "vi": "đứng làm gì đó Chúng tôi đứng nói chuyện trong vài phút."
                    },
                    {
                        "en": "People stood waiting for a bus in the rain.",
                        "vi": "Người dân đứng đợi xe buýt dưới trời mưa."
                    },
                    {
                        "en": "After the earthquake, only a few houses were left standing.",
                        "vi": "Sau trận động đất, chỉ còn lại một số ngôi nhà đứng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to get up onto your feet from another position",
                    "vi": "đứng dậy từ một vị trí khác"
                },
                "examples": [
                    {
                        "en": "Everyone stood when the president came in.",
                        "vi": "Mọi người đều đứng khi tổng thống bước vào."
                    },
                    {
                        "en": "stand up We stood up in order to get a better view.",
                        "vi": "đứng lên Chúng tôi đã đứng lên để có thể nhìn rõ hơn."
                    },
                    {
                        "en": "I tried to stand up and found myself in agony.",
                        "vi": "Tôi cố gắng đứng dậy và thấy mình đau đớn tột cùng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to put something/somebody in a vertical position somewhere",
                    "vi": "đặt một cái gì đó / ai đó ở một vị trí thẳng đứng ở đâu đó"
                },
                "examples": [
                    {
                        "en": "Stand the ladder up against the wall.",
                        "vi": "Dựng thang dựa vào tường."
                    },
                    {
                        "en": "I stood the little girl on a chair so that she could see.",
                        "vi": "Tôi đứng cô bé trên ghế để cô bé có thể nhìn thấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "used especially in negative sentences and questions to emphasize that you do not like somebody/something",
                    "vi": "được sử dụng đặc biệt trong câu phủ định và câu hỏi để nhấn mạnh rằng bạn không thích ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "stand somebody/something I can't stand his brother.",
                        "vi": "đứng ai đó / cái gì đó tôi không thể chịu đựng được anh trai của anh ấy."
                    },
                    {
                        "en": "I can't stand the sight of blood.",
                        "vi": "Tôi không thể chịu được cảnh máu."
                    },
                    {
                        "en": "I can't stand it when you do that.",
                        "vi": "Tôi không thể chịu đựng được khi bạn làm như vậy."
                    },
                    {
                        "en": "stand doing something She couldn't stand being kept waiting.",
                        "vi": "đứng làm điều gì đó Cô ấy không thể chịu được khi tiếp tục chờ đợi."
                    },
                    {
                        "en": "stand to do something She couldn't stand to be kept waiting.",
                        "vi": "đứng để làm điều gì đó Cô ấy không thể chịu đựng được khi tiếp tục chờ đợi."
                    },
                    {
                        "en": "stand somebody/something doing something I can't stand people interrupting all the time.",
                        "vi": "đứng ai đó / cái gì đó đang làm gì đó Tôi không thể chịu được mọi người làm gián đoạn mọi lúc."
                    },
                    {
                        "en": "How do you stand him being here all the time?",
                        "vi": "Làm thế nào để bạn có thể chịu được anh ta ở đây mọi lúc?"
                    }
                ]
            },
            {
                "define": {
                    "en": "used especially with can/could or will to say that somebody/something can survive something or can tolerate something without being hurt or damaged",
                    "vi": "được sử dụng đặc biệt với can / could hoặc will để nói rằng ai đó / điều gì đó có thể tồn tại một cái gì đó hoặc có thể chịu đựng một cái gì đó mà không bị thương hoặc bị hư hại"
                },
                "examples": [
                    {
                        "en": "stand something His heart won't stand the strain much longer.",
                        "vi": "đứng vững một cái gì đó Trái tim của anh ấy sẽ không chịu đựng được căng thẳng lâu hơn nữa."
                    },
                    {
                        "en": "Modern plastics can stand very high and very low temperatures.",
                        "vi": "Nhựa hiện đại có thể chịu được nhiệt độ rất cao và rất thấp."
                    },
                    {
                        "en": "stand doing something It can stand being dropped from a great height without breaking.",
                        "vi": "đứng làm việc gì đó Nó có thể chịu được khi bị rơi từ độ cao lớn mà không bị gãy."
                    },
                    {
                        "en": "stand somebody doing something Can you stand me touching your hand or is it too sore?",
                        "vi": "đứng ai đó đang làm gì đó Bạn có thể chịu được tôi chạm vào tay bạn hay nó quá đau?"
                    },
                    {
                        "en": "stand to do something I can't stand to see him suffer any more.",
                        "vi": "đứng để làm gì tôi không thể đứng nhìn anh ấy đau khổ thêm nữa."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be in a particular place",
                    "vi": "ở một nơi cụ thể"
                },
                "examples": [
                    {
                        "en": "The castle stands on the site of an ancient battlefield.",
                        "vi": "Lâu đài nằm trên địa điểm của một chiến trường cổ đại."
                    },
                    {
                        "en": "An old oak tree once stood here.",
                        "vi": "Một cây sồi già đã từng đứng ở đây."
                    },
                    {
                        "en": "Books stood in piles in the corner.",
                        "vi": "Sách chất thành đống trong góc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be in a particular condition or situation",
                    "vi": "ở trong một điều kiện hoặc tình huống cụ thể"
                },
                "examples": [
                    {
                        "en": "+ adj. The house stood empty for a long time.",
                        "vi": "Err:509"
                    },
                    {
                        "en": "'You're wrong about the date—it was 2008.’ ‘I stand corrected (= accept that I was wrong).'",
                        "vi": "Bạn đã sai về ngày tháng — đó là năm 2008. 'Tôi đứng lại sửa (= chấp nhận rằng tôi đã sai).'"
                    },
                    {
                        "en": "You stand accused of a terrible crime.",
                        "vi": "Bạn bị buộc tội bởi một tội ác khủng khiếp."
                    },
                    {
                        "en": "You never know where you stand with her—one minute she's friendly, the next she'll hardly speak to you.",
                        "vi": "Bạn không bao giờ biết mình đang đứng ở đâu với cô ấy — một phút cô ấy thân thiện, phút tiếp theo cô ấy sẽ khó nói chuyện với bạn."
                    },
                    {
                        "en": "As things stand, there is little chance of a quick settlement of the dispute.",
                        "vi": "Khi mọi thứ ổn định, có rất ít cơ hội để giải quyết tranh chấp nhanh chóng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be a candidate in an election",
                    "vi": "trở thành một ứng cử viên trong một cuộc bầu cử"
                },
                "examples": [
                    {
                        "en": "stand for something He stood for election in Colchester.",
                        "vi": "ứng cử cho một cái gì đó Anh ấy đã ứng cử ở Colchester."
                    },
                    {
                        "en": "He stood for parliament (= tried to get elected as an MP).",
                        "vi": "Anh ấy ứng cử vào quốc hội (= cố gắng được bầu làm nghị sĩ)."
                    },
                    {
                        "en": "stand as something She stood unsuccessfully as a candidate in the local elections.",
                        "vi": "đứng như một cái gì đó Cô ấy đã đứng không thành công với tư cách là một ứng cử viên trong các cuộc bầu cử địa phương."
                    },
                    {
                        "en": "Her friends persuaded her to stand.",
                        "vi": "Bạn bè của cô ấy đã thuyết phục cô ấy đứng vững."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be a particular height",
                    "vi": "là một chiều cao cụ thể"
                },
                "examples": [
                    {
                        "en": "The tower stands 30 metres high.",
                        "vi": "Tháp cao 30 mét."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be at a particular level, amount, height, etc.",
                    "vi": "ở một cấp độ, số lượng, chiều cao cụ thể, v.v."
                },
                "examples": [
                    {
                        "en": "Interest rates stand at 3 per cent.",
                        "vi": "Lãi suất ở mức 3%."
                    },
                    {
                        "en": "The world record then stood at 6.59 metres.",
                        "vi": "Kỷ lục thế giới sau đó là 6,59 mét."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be in a particular place, especially while waiting to go somewhere",
                    "vi": "ở một nơi cụ thể, đặc biệt là trong khi chờ đến một nơi nào đó"
                },
                "examples": [
                    {
                        "en": "The train standing at platform 3 is for London, Victoria.",
                        "vi": "Chuyến tàu đứng ở sân ga số 3 dành cho London, Victoria."
                    }
                ]
            },
            {
                "define": {
                    "en": "to remain still, without moving or being moved",
                    "vi": "đứng yên, không di chuyển hoặc bị di chuyển"
                },
                "examples": [
                    {
                        "en": "Mix the batter and let it stand for twenty minutes.",
                        "vi": "Trộn bột và để yên trong 20 phút."
                    },
                    {
                        "en": "standing pools of rainwater",
                        "vi": "vũng nước mưa đọng"
                    }
                ]
            },
            {
                "define": {
                    "en": "if an offer, a decision, etc. made earlier stands, it is still available or relevant or still exists",
                    "vi": "nếu một đề nghị, một quyết định, v.v. được đưa ra trước đó, nó vẫn có sẵn hoặc có liên quan hoặc vẫn tồn tại"
                },
                "examples": [
                    {
                        "en": "My offer still stands.",
                        "vi": "Đề nghị của tôi vẫn còn."
                    },
                    {
                        "en": "The world record stood for 20 years.",
                        "vi": "Kỷ lục thế giới đã đứng trong 20 năm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be in a situation where you are likely to do something",
                    "vi": "ở trong tình huống mà bạn có khả năng làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "You stand to make a lot from this deal.",
                        "vi": "Bạn sẽ kiếm được rất nhiều từ thỏa thuận này."
                    },
                    {
                        "en": "Who stands to benefit the most?",
                        "vi": "Ai đứng ra hưởng lợi nhiều nhất?"
                    },
                    {
                        "en": "to stand to gain/lose something",
                        "vi": "đứng để đạt được / mất một cái gì đó"
                    }
                ]
            },
            {
                "define": {
                    "en": "to have a particular attitude or opinion about something or towards somebody",
                    "vi": "có thái độ hoặc quan điểm cụ thể về điều gì đó hoặc đối với ai đó"
                },
                "examples": [
                    {
                        "en": "Where do you stand on private education?",
                        "vi": "Bạn đứng ở đâu về giáo dục tư nhân?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to buy a drink or meal for somebody",
                    "vi": "mua đồ uống hoặc bữa ăn cho ai đó"
                },
                "examples": [
                    {
                        "en": "stand something He stood drinks all round.",
                        "vi": "đứng cái gì đó Anh ấy đứng uống rượu quanh đó."
                    },
                    {
                        "en": "stand somebody something She was kind enough to stand us a meal.",
                        "vi": "đứng ai đó một cái gì đó Cô ấy đủ tốt bụng để phục vụ chúng tôi một bữa ăn."
                    }
                ]
            }
        ]
    },
    {
        "id": "b39be1c4ba0849238b15d95491da61f8",
        "word": "voting",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈvəʊtɪŋ/",
            "us": "/ˈvəʊtɪŋ/"
        },
        "nearby": [
            {
                "word": "voter",
                "pos": "noun"
            },
            {
                "word": "vote through",
                "pos": "phrasal verb"
            },
            {
                "word": "voting",
                "pos": "noun"
            },
            {
                "word": "voting booth",
                "pos": "noun"
            },
            {
                "word": "voting machine",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the action of choosing somebody/something in an election or at a meeting",
                    "vi": "hành động chọn ai đó / cái gì đó trong một cuộc bầu cử hoặc tại một cuộc họp"
                },
                "examples": [
                    {
                        "en": "He was eliminated in the first round of voting.",
                        "vi": "Anh ấy đã bị loại ngay trong vòng bỏ phiếu đầu tiên."
                    },
                    {
                        "en": "Voting will take place on May 1.",
                        "vi": "Việc bỏ phiếu sẽ diễn ra vào ngày 1/5."
                    },
                    {
                        "en": "tactical voting",
                        "vi": "biểu quyết chiến thuật"
                    },
                    {
                        "en": "to be of voting age",
                        "vi": "đủ tuổi bầu cử"
                    },
                    {
                        "en": "She was elected on the second round of voting.",
                        "vi": "Cô đã được bầu vào vòng bỏ phiếu thứ hai."
                    }
                ]
            }
        ]
    },
    {
        "id": "6b341fba803b4d0f9f91bf3f2d071757",
        "word": "ballot",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈbælət/",
            "us": "/ˈbælət/"
        },
        "nearby": [
            {
                "word": "balloon tyre",
                "pos": "noun"
            },
            {
                "word": "balloon whisk",
                "pos": "noun"
            },
            {
                "word": "ballot",
                "pos": "noun"
            },
            {
                "word": "ballot",
                "pos": "verb"
            },
            {
                "word": "ballot box",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the system of voting in writing and usually in secret; an occasion on which a vote is held",
                    "vi": "hệ thống biểu quyết bằng văn bản và thường là bí mật; một dịp mà một cuộc bỏ phiếu được tổ chức"
                },
                "examples": [
                    {
                        "en": "The chairperson is chosen by secret ballot.",
                        "vi": "Chủ tọa được chọn bằng hình thức bỏ phiếu kín."
                    },
                    {
                        "en": "The union cannot call a strike unless it holds a ballot of members.",
                        "vi": "Công đoàn không thể gọi một cuộc đình công trừ khi nó tổ chức một cuộc bỏ phiếu của các thành viên."
                    },
                    {
                        "en": "ballot for something a ballot for the Conservative leadership",
                        "vi": "bỏ phiếu cho một cái gì đó một lá phiếu cho sự lãnh đạo của Đảng Bảo thủ"
                    },
                    {
                        "en": "ballot on/over something a ballot over strike action",
                        "vi": "bỏ phiếu cho / hơn một cái gì đó một lá phiếu cho hành động đình công"
                    },
                    {
                        "en": "a ballot on the new contracts",
                        "vi": "một lá phiếu về các hợp đồng mới"
                    }
                ]
            },
            {
                "define": {
                    "en": "the piece of paper on which somebody marks who they are voting for",
                    "vi": "mảnh giấy trên đó ai đó đánh dấu họ đang bỏ phiếu cho ai"
                },
                "examples": [
                    {
                        "en": "What percentage of eligible voters cast their ballots?",
                        "vi": "Bao nhiêu phần trăm cử tri đủ điều kiện bỏ phiếu của họ?"
                    }
                ]
            },
            {
                "define": {
                    "en": "the total number of votes in an election",
                    "vi": "tổng số phiếu bầu trong một cuộc bầu cử"
                },
                "examples": [
                    {
                        "en": "She won 58.8% of the ballot.",
                        "vi": "Cô đã giành được 58,8% số phiếu bầu."
                    }
                ]
            }
        ]
    },
    {
        "id": "97e94240f3ac438cba7327d383bba6f7",
        "word": "constituency",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/kənˈstɪtʃuənsi/",
            "us": "/kənˈstɪtʃuənsi/"
        },
        "nearby": [
            {
                "word": "constipated",
                "pos": "adjective"
            },
            {
                "word": "constipation",
                "pos": "noun"
            },
            {
                "word": "constituency",
                "pos": "noun"
            },
            {
                "word": "constituent",
                "pos": "noun"
            },
            {
                "word": "constituent",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a district that elects its own representative to parliament",
                    "vi": "một khu bầu cử đại diện của mình vào quốc hội"
                },
                "examples": [
                    {
                        "en": "Unemployment is high in her constituency.",
                        "vi": "Tỷ lệ thất nghiệp cao ở khu vực cử tri của cô ấy."
                    },
                    {
                        "en": "He owns a house in his Darlington constituency.",
                        "vi": "Anh ta sở hữu một ngôi nhà ở khu vực bầu cử Darlington của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "the people who live in and vote in a particular district",
                    "vi": "những người sống và bỏ phiếu trong một quận cụ thể"
                },
                "examples": [
                    {
                        "en": "constituency opinion",
                        "vi": "ý kiến cử tri"
                    }
                ]
            },
            {
                "define": {
                    "en": "a particular group of people in society who are likely to support a person, an idea or a product",
                    "vi": "một nhóm người cụ thể trong xã hội có khả năng ủng hộ một người, một ý tưởng hoặc một sản phẩm"
                },
                "examples": [
                    {
                        "en": "There is a strong constituency of support for his proposal.",
                        "vi": "Có một bộ phận cử tri ủng hộ mạnh mẽ cho đề xuất của ông."
                    }
                ]
            }
        ]
    },
    {
        "id": "1719420e998f4fb1bfc53199fe26ce80",
        "word": "electable",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ɪˈlektəbl/",
            "us": "/ɪˈlektəbl/"
        },
        "nearby": [
            {
                "word": "elect",
                "pos": "adjective"
            },
            {
                "word": "electability",
                "pos": "noun"
            },
            {
                "word": "electable",
                "pos": "adjective"
            },
            {
                "word": "election",
                "pos": "noun"
            },
            {
                "word": "electioneering",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "having the qualities that make it likely or possible that they will win in an election",
                    "vi": "có những phẩm chất khiến họ có khả năng thắng trong một cuộc bầu cử"
                },
                "examples": [
                    {
                        "en": "The party can't seem to nominate an electable candidate.",
                        "vi": "Đảng dường như không thể đề cử một ứng cử viên có thể bầu cử."
                    }
                ]
            }
        ]
    },
    {
        "id": "ff6109e860b7437e8c3bf38b6970ee74",
        "word": "electoral",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ɪˈlektərəl/",
            "us": "/ɪˈlektərəl/"
        },
        "nearby": [
            {
                "word": "elective",
                "pos": "noun"
            },
            {
                "word": "elector",
                "pos": "noun"
            },
            {
                "word": "electoral",
                "pos": "adjective"
            },
            {
                "word": "electoral college",
                "pos": "noun"
            },
            {
                "word": "electorally",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "connected with elections",
                    "vi": "kết nối với các cuộc bầu cử"
                },
                "examples": [
                    {
                        "en": "electoral systems/reforms",
                        "vi": "hệ thống bầu cử / cải cách"
                    }
                ]
            }
        ]
    },
    {
        "id": "6e6e213003c243dc9f96f84b81d7adfa",
        "word": "electorate",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ɪˈlektərət/",
            "us": "/ɪˈlektərət/"
        },
        "nearby": [
            {
                "word": "electoral register",
                "pos": "noun"
            },
            {
                "word": "electoral vote",
                "pos": "noun"
            },
            {
                "word": "electorate",
                "pos": "noun"
            },
            {
                "word": "Electra complex",
                "pos": "noun"
            },
            {
                "word": "electric",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the people in a country or an area who have the right to vote, thought of as a group",
                    "vi": "những người trong một quốc gia hoặc một khu vực có quyền bầu cử, được coi là một nhóm"
                },
                "examples": [
                    {
                        "en": "Only 60 per cent of the electorate voted in the last election.",
                        "vi": "Chỉ 60% cử tri đã bỏ phiếu trong cuộc bầu cử vừa qua."
                    }
                ]
            },
            {
                "define": {
                    "en": "a district that elects its own representative to parliament",
                    "vi": "một khu bầu cử đại diện của mình vào quốc hội"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "5145589d58f14622b1234061cb51812a",
        "word": "general election",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌdʒenrəl ɪˈlekʃn/",
            "us": "/ˌdʒenrəl ɪˈlekʃn/"
        },
        "nearby": [
            {
                "word": "general counsel",
                "pos": "noun"
            },
            {
                "word": "general delivery",
                "pos": "noun"
            },
            {
                "word": "general election",
                "pos": "noun"
            },
            {
                "word": "General Electric",
                "pos": ""
            },
            {
                "word": "the General Electric Company",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an election in which all the adults of a country can vote to choose people to represent them in parliament",
                    "vi": "một cuộc bầu cử trong đó tất cả người lớn của một quốc gia có thể bỏ phiếu để chọn những người đại diện cho họ trong quốc hội"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "f4d4a3b022e04bd1b4e86d6eaf3dcec7",
        "word": "mandate",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈmændeɪt/",
            "us": "/ˈmændeɪt/"
        },
        "nearby": [
            {
                "word": "mandarin",
                "pos": "noun"
            },
            {
                "word": "mandarin collar",
                "pos": "noun"
            },
            {
                "word": "mandate",
                "pos": "noun"
            },
            {
                "word": "mandate",
                "pos": "verb"
            },
            {
                "word": "mandated",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the authority to do something, given to a government or other organization by the people who vote for it in an election",
                    "vi": "quyền làm điều gì đó, được trao cho chính phủ hoặc tổ chức khác bởi những người bỏ phiếu cho nó trong một cuộc bầu cử"
                },
                "examples": [
                    {
                        "en": "It is undemocratic to govern an area without an electoral mandate.",
                        "vi": "Sẽ là phi dân chủ để quản lý một khu vực mà không có nhiệm vụ bầu cử."
                    },
                    {
                        "en": "mandate to do something The election victory gave the party a clear mandate to continue its programme of reform.",
                        "vi": "nhiệm vụ để làm điều gì đó Chiến thắng trong cuộc bầu cử đã cho đảng một nhiệm vụ rõ ràng để tiếp tục chương trình cải cách của mình."
                    },
                    {
                        "en": "mandate for something a mandate for an end to the civil war",
                        "vi": "ủy thác cho một cái gì đó một nhiệm vụ chấm dứt nội chiến"
                    }
                ]
            },
            {
                "define": {
                    "en": "the period of time for which a government is given power",
                    "vi": "khoảng thời gian mà chính phủ được trao quyền"
                },
                "examples": [
                    {
                        "en": "The presidential mandate is limited to two terms of four years each.",
                        "vi": "Nhiệm vụ của tổng thống được giới hạn trong hai nhiệm kỳ, mỗi nhiệm kỳ bốn năm."
                    }
                ]
            },
            {
                "define": {
                    "en": "an official order given to somebody to perform a particular task",
                    "vi": "một mệnh lệnh chính thức được trao cho ai đó để thực hiện một nhiệm vụ cụ thể"
                },
                "examples": [
                    {
                        "en": "The bank had no mandate to honour the cheque.",
                        "vi": "Ngân hàng không có nhiệm vụ tôn trọng séc."
                    },
                    {
                        "en": "They accused him of acting without a mandate.",
                        "vi": "Họ buộc tội anh ta hành động mà không được ủy quyền."
                    }
                ]
            },
            {
                "define": {
                    "en": "the power given to a country to govern another country or region, especially in the past",
                    "vi": "quyền lực được trao cho một quốc gia để quản lý một quốc gia hoặc khu vực khác, đặc biệt là trong quá khứ"
                },
                "examples": [
                    {
                        "en": "The Cook Islands mandate was given to New Zealand.",
                        "vi": "Quyền lực của Quần đảo Cook đã được trao cho New Zealand."
                    },
                    {
                        "en": "The mandate ran until 1947.",
                        "vi": "Nhiệm vụ này kéo dài đến năm 1947."
                    }
                ]
            }
        ]
    },
    {
        "id": "fccd0b4c30a943618729556f2044585b",
        "word": "manifesto",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌmænɪˈfestəʊ/",
            "us": "/ˌmænɪˈfestəʊ/"
        },
        "nearby": [
            {
                "word": "manifest destiny",
                "pos": "noun"
            },
            {
                "word": "manifestly",
                "pos": "adverb"
            },
            {
                "word": "manifesto",
                "pos": "noun"
            },
            {
                "word": "manifold",
                "pos": "adjective"
            },
            {
                "word": "manifold",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a written statement in which a group of people explain their beliefs and aims, especially one published by a political party to say what they will do if they win an election",
                    "vi": "một tuyên bố bằng văn bản trong đó một nhóm người giải thích niềm tin và mục tiêu của họ, đặc biệt là một tuyên bố do một đảng chính trị xuất bản để nói rằng họ sẽ làm gì nếu thắng một cuộc bầu cử"
                },
                "examples": [
                    {
                        "en": "an election manifesto",
                        "vi": "một tuyên ngôn bầu cử"
                    },
                    {
                        "en": "the party manifesto",
                        "vi": "tuyên ngôn của đảng"
                    }
                ]
            }
        ]
    },
    {
        "id": "85cbfec6c80d4f5e8d2a13f1c704fc73",
        "word": "nominate",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈnɒmɪneɪt/",
            "us": "/ˈnɑːmɪneɪt/"
        },
        "nearby": [
            {
                "word": "nominalize",
                "pos": "verb"
            },
            {
                "word": "nominally",
                "pos": "adverb"
            },
            {
                "word": "nominate",
                "pos": "verb"
            },
            {
                "word": "nomination",
                "pos": "noun"
            },
            {
                "word": "nominative",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to formally suggest that somebody/something should be chosen for an important role, prize, position, etc.",
                    "vi": "để chính thức gợi ý rằng ai đó / điều gì đó nên được chọn cho một vai trò quan trọng, giải thưởng, vị trí, v.v."
                },
                "examples": [
                    {
                        "en": "nominate somebody/something (for something) She has been nominated for the presidency.",
                        "vi": "đề cử ai đó / cái gì đó (cho việc gì đó) Cô ấy đã được đề cử cho chức vụ tổng thống."
                    },
                    {
                        "en": "nominate somebody/something (as) something | nominate somebody/something + noun He was nominated (as) best actor.",
                        "vi": "đề cử ai đó / cái gì đó (như) cái gì đó | đề cử ai đó / cái gì đó + danh từ Anh ấy đã được đề cử (là) nam diễn viên chính xuất sắc nhất."
                    },
                    {
                        "en": "nominate somebody/something to do something I nominated Paul to take on the role of treasurer.",
                        "vi": "đề cử ai đó / việc gì đó làm việc gì đó Tôi đã đề cử Paul đảm nhận vai trò thủ quỹ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to choose somebody to do a particular job",
                    "vi": "chọn ai đó để làm một công việc cụ thể"
                },
                "examples": [
                    {
                        "en": "nominate somebody (to something) I have been nominated to the committee.",
                        "vi": "đề cử ai đó (cho một cái gì đó) Tôi đã được đề cử vào ủy ban."
                    },
                    {
                        "en": "nominate somebody as something The president wanted to nominate her as his successor.",
                        "vi": "đề cử ai đó làm thứ gì đó Tổng thống muốn đề cử cô ấy làm người kế nhiệm."
                    },
                    {
                        "en": "nominate somebody to do something She was nominated to speak on our behalf.",
                        "vi": "đề cử ai đó làm điều gì đó Cô ấy đã được đề cử để nói chuyện thay mặt chúng tôi."
                    },
                    {
                        "en": "Each office will nominate a representative to sit on the committee.",
                        "vi": "Mỗi văn phòng sẽ đề cử một đại diện để ngồi vào ủy ban."
                    }
                ]
            },
            {
                "define": {
                    "en": "to choose a time, date or title for something",
                    "vi": "để chọn thời gian, ngày tháng hoặc tiêu đề cho một cái gì đó"
                },
                "examples": [
                    {
                        "en": "1 December has been nominated as the day of the election.",
                        "vi": "Ngày 1 tháng 12 đã được đề cử là ngày bầu cử."
                    }
                ]
            }
        ]
    },
    {
        "id": "859cbf8831cd474389e9549f504a755d",
        "word": "nomination",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌnɒmɪˈneɪʃn/",
            "us": "/ˌnɑːmɪˈneɪʃn/"
        },
        "nearby": [
            {
                "word": "nominally",
                "pos": "adverb"
            },
            {
                "word": "nominate",
                "pos": "verb"
            },
            {
                "word": "nomination",
                "pos": "noun"
            },
            {
                "word": "nominative",
                "pos": "noun"
            },
            {
                "word": "nominative",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act of suggesting or choosing somebody as a candidate in an election, or for a job or an award; the fact of being suggested for this",
                    "vi": "hành động đề xuất hoặc chọn ai đó làm ứng cử viên trong một cuộc bầu cử, hoặc cho một công việc hoặc một giải thưởng; thực tế là được đề xuất cho điều này"
                },
                "examples": [
                    {
                        "en": "Membership of the club is by nomination only.",
                        "vi": "Tư cách thành viên của câu lạc bộ chỉ là do đề cử."
                    },
                    {
                        "en": "He won the nomination as Democratic candidate for the presidency.",
                        "vi": "Ông đã giành được đề cử là ứng cử viên đảng Dân chủ cho chức vụ tổng thống."
                    },
                    {
                        "en": "They opposed her nomination to the post of Deputy Director.",
                        "vi": "Họ phản đối việc đề cử bà vào chức vụ Phó Giám đốc."
                    },
                    {
                        "en": "He has had nine Oscar nominations.",
                        "vi": "Anh đã có chín đề cử Oscar."
                    }
                ]
            }
        ]
    },
    {
        "id": "c3920dfdb0604dcb99a175bb556e23b1",
        "word": "poll",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/pəʊl/",
            "us": "/pəʊl/"
        },
        "nearby": [
            {
                "word": "polka",
                "pos": "noun"
            },
            {
                "word": "polka dot",
                "pos": "noun"
            },
            {
                "word": "poll",
                "pos": "noun"
            },
            {
                "word": "poll",
                "pos": "verb"
            },
            {
                "word": "pollard",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the process of questioning people who are representative of a larger group in order to get information about the general opinion",
                    "vi": "quá trình chất vấn những người đại diện cho một nhóm lớn hơn để có được thông tin về ý kiến chung"
                },
                "examples": [
                    {
                        "en": "to carry out/conduct a poll",
                        "vi": "để thực hiện / tiến hành một cuộc thăm dò"
                    },
                    {
                        "en": "A recent poll suggests some surprising changes in public opinion.",
                        "vi": "Một cuộc thăm dò gần đây cho thấy một số thay đổi đáng ngạc nhiên trong dư luận."
                    },
                    {
                        "en": "A nationwide poll revealed different food preferences in the North and the South.",
                        "vi": "Một cuộc thăm dò trên toàn quốc cho thấy sở thích ăn uống khác nhau ở miền Bắc và miền Nam."
                    }
                ]
            },
            {
                "define": {
                    "en": "the process of voting at an election; the process of counting the votes",
                    "vi": "quy trình bỏ phiếu tại một cuộc bầu cử; quá trình kiểm phiếu"
                },
                "examples": [
                    {
                        "en": "The final result of the poll will be known tomorrow.",
                        "vi": "Kết quả cuối cùng của cuộc bình chọn sẽ được biết vào ngày mai."
                    },
                    {
                        "en": "Thursday is traditionally the day when Britain goes to the polls (= when elections are held).",
                        "vi": "Thứ Năm theo truyền thống là ngày nước Anh đi bỏ phiếu (= khi các cuộc bầu cử được tổ chức)."
                    },
                    {
                        "en": "Polls close (= voting ends) at 9 p.m.",
                        "vi": "Cuộc thăm dò ý kiến đóng lại (= cuộc bỏ phiếu kết thúc) lúc 9 giờ tối"
                    },
                    {
                        "en": "at the polls Their defeat at the polls came as a big shock.",
                        "vi": "tại các cuộc thăm dò Thất bại của họ trong các cuộc thăm dò đã gây ra một cú sốc lớn."
                    }
                ]
            },
            {
                "define": {
                    "en": "the number of votes given in an election",
                    "vi": "số phiếu bầu được đưa ra trong một cuộc bầu cử"
                },
                "examples": [
                    {
                        "en": "Labour is ahead in the poll.",
                        "vi": "Lao động đang dẫn đầu trong cuộc thăm dò."
                    },
                    {
                        "en": "They gained 20 per cent of the poll.",
                        "vi": "Họ đã giành được 20% cuộc thăm dò."
                    }
                ]
            }
        ]
    },
    {
        "id": "abe900a108b246b7b004d7399884a372",
        "word": "polling",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈpəʊlɪŋ/",
            "us": "/ˈpəʊlɪŋ/"
        },
        "nearby": [
            {
                "word": "pollinate",
                "pos": "verb"
            },
            {
                "word": "pollination",
                "pos": "noun"
            },
            {
                "word": "polling",
                "pos": "noun"
            },
            {
                "word": "polling booth",
                "pos": "noun"
            },
            {
                "word": "polling day",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the activity of voting",
                    "vi": "hoạt động bỏ phiếu"
                },
                "examples": [
                    {
                        "en": "Polling has been heavy since 8 a.m.",
                        "vi": "Cuộc bỏ phiếu đã diễn ra nặng nề kể từ 8 giờ sáng"
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of asking questions as part of an opinion poll",
                    "vi": "hành động đặt câu hỏi như một phần của cuộc thăm dò ý kiến"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "f5625b9a38df46ba8337f2050f4f3e99",
        "word": "referendum",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌrefəˈrendəm/",
            "us": "/ˌrefəˈrendəm/"
        },
        "nearby": [
            {
                "word": "reference library",
                "pos": "noun"
            },
            {
                "word": "reference point",
                "pos": "noun"
            },
            {
                "word": "referendum",
                "pos": "noun"
            },
            {
                "word": "referral",
                "pos": "noun"
            },
            {
                "word": "refer to",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an occasion when all the people of a country can vote on an important issue",
                    "vi": "một dịp mà tất cả người dân của một quốc gia có thể bỏ phiếu về một vấn đề quan trọng"
                },
                "examples": [
                    {
                        "en": "referendum on something Switzerland decided to hold a referendum on joining the EU.",
                        "vi": "trưng cầu dân ý về điều gì đó Thụy Sĩ quyết định tổ chức trưng cầu dân ý về việc gia nhập EU."
                    },
                    {
                        "en": "by referendum The changes were approved by referendum.",
                        "vi": "bởi trưng cầu dân ý Những thay đổi đã được thông qua bởi trưng cầu dân ý."
                    }
                ]
            }
        ]
    },
    {
        "id": "2bce1aa5ec0746858abad7e3b300ce48",
        "word": "turnout",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈtɜːnaʊt/",
            "us": "/ˈtɜːrnaʊt/"
        },
        "nearby": [
            {
                "word": "turn-on",
                "pos": "noun"
            },
            {
                "word": "turn out",
                "pos": "phrasal verb"
            },
            {
                "word": "turnout",
                "pos": "noun"
            },
            {
                "word": "turn over",
                "pos": "phrasal verb"
            },
            {
                "word": "turnover",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the number of people who attend a particular event",
                    "vi": "số lượng người tham dự một sự kiện cụ thể"
                },
                "examples": [
                    {
                        "en": "This year's festival attracted a record turnout.",
                        "vi": "Lễ hội năm nay thu hút lượng người tham dự kỷ lục."
                    }
                ]
            },
            {
                "define": {
                    "en": "the number of people who vote in a particular election",
                    "vi": "số người bỏ phiếu trong một cuộc bầu cử cụ thể"
                },
                "examples": [
                    {
                        "en": "a high/low/poor turnout",
                        "vi": "tỷ lệ cử tri đi bỏ phiếu cao / thấp / kém"
                    },
                    {
                        "en": "a 60% turnout of voters",
                        "vi": "60% cử tri đi bỏ phiếu"
                    }
                ]
            }
        ]
    },
    {
        "id": "d46494b661cf45ff9971f1bc991c81f3",
        "word": "unelected",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌʌnɪˈlektɪd/",
            "us": "/ˌʌnɪˈlektɪd/"
        },
        "nearby": [
            {
                "word": "unedifying",
                "pos": "adjective"
            },
            {
                "word": "uneducated",
                "pos": "adjective"
            },
            {
                "word": "unelected",
                "pos": "adjective"
            },
            {
                "word": "unemotional",
                "pos": "adjective"
            },
            {
                "word": "unemotionally",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "not having been chosen by people in an election",
                    "vi": "không được chọn bởi những người trong một cuộc bầu cử"
                },
                "examples": [
                    {
                        "en": "unelected bureaucrats",
                        "vi": "các quan chức không được tuyển chọn"
                    }
                ]
            }
        ]
    },
    {
        "id": "2cc8393c33534b0aa59e30ca17711f0d",
        "word": "absentee ballot",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌæbsəntiː ˈbælət/",
            "us": "/ˌæbsəntiː ˈbælət/"
        },
        "nearby": [
            {
                "word": "absent",
                "pos": "preposition"
            },
            {
                "word": "absentee",
                "pos": "noun"
            },
            {
                "word": "absentee ballot",
                "pos": "noun"
            },
            {
                "word": "absenteeism",
                "pos": "noun"
            },
            {
                "word": "absentee landlord",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a vote in an election that you can send when you cannot be present",
                    "vi": "một lá phiếu trong một cuộc bầu cử mà bạn có thể gửi khi bạn không thể có mặt"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "101c9c7b5cfc4f779ac7223b02c82bc3",
        "word": "abstain",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/əbˈsteɪn/",
            "us": "/əbˈsteɪn/"
        },
        "nearby": [
            {
                "word": "absorbing",
                "pos": "adjective"
            },
            {
                "word": "absorption",
                "pos": "noun"
            },
            {
                "word": "abstain",
                "pos": "verb"
            },
            {
                "word": "abstainer",
                "pos": "noun"
            },
            {
                "word": "abstemious",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to choose not to use a vote, either in favour of or against something",
                    "vi": "chọn không sử dụng phiếu bầu, ủng hộ hoặc chống lại điều gì đó"
                },
                "examples": [
                    {
                        "en": "Ten people voted in favour, five against and two abstained.",
                        "vi": "Mười người đã bỏ phiếu thuận, năm người chống và hai người bỏ phiếu trắng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to decide not to do or have something, especially something you like or enjoy, because it is bad for your health or considered morally wrong",
                    "vi": "quyết định không làm hoặc có một cái gì đó, đặc biệt là cái gì đó bạn thích hoặc thích, vì nó có hại cho sức khỏe của bạn hoặc bị coi là sai về mặt đạo đức"
                },
                "examples": [
                    {
                        "en": "to abstain from alcohol/sex/drugs",
                        "vi": "kiêng rượu / quan hệ tình dục / ma túy"
                    }
                ]
            },
            {
                "define": {
                    "en": "to stay away from something",
                    "vi": "tránh xa một cái gì đó"
                },
                "examples": [
                    {
                        "en": "The workers who abstained from work yesterday have been suspended.",
                        "vi": "Những công nhân nghỉ việc hôm qua đã bị đình chỉ."
                    }
                ]
            }
        ]
    },
    {
        "id": "11aab407941a4e88b51dba189b1522f6",
        "word": "abstention",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/əbˈstenʃn/",
            "us": "/əbˈstenʃn/"
        },
        "nearby": [
            {
                "word": "abstainer",
                "pos": "noun"
            },
            {
                "word": "abstemious",
                "pos": "adjective"
            },
            {
                "word": "abstention",
                "pos": "noun"
            },
            {
                "word": "abstinence",
                "pos": "noun"
            },
            {
                "word": "abstinent",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an act of choosing not to use a vote either in favour of or against something",
                    "vi": "một hành động lựa chọn không sử dụng phiếu ủng hộ hoặc chống lại điều gì đó"
                },
                "examples": [
                    {
                        "en": "The voting was 15 in favour, 3 against and 2 abstentions.",
                        "vi": "Cuộc biểu quyết có 15 phiếu thuận, 3 phiếu chống và 2 phiếu trắng."
                    },
                    {
                        "en": "Voter abstention is seen as the only real form of dissent in elections.",
                        "vi": "Cử tri bỏ phiếu trắng được coi là hình thức bất đồng chính kiến thực sự duy nhất trong các cuộc bầu cử."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of not allowing yourself to have or do something fun or something that is considered bad",
                    "vi": "hành động không cho phép mình có hoặc làm điều gì đó vui vẻ hoặc điều gì đó bị coi là xấu"
                },
                "examples": [
                    {
                        "en": "The Church insisted on abstention from all luxuries.",
                        "vi": "Giáo hội kiên quyết kiêng mọi thứ xa xỉ."
                    }
                ]
            }
        ]
    },
    {
        "id": "9dc7648f30794495abb8de73a698f6ba",
        "word": "alternative vote",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ɔːlˌtɜːnətɪv ˈvəʊt/",
            "us": "/ɔːlˌtɜːrnətɪv ˈvəʊt/"
        },
        "nearby": [
            {
                "word": "alternative medicine",
                "pos": "noun"
            },
            {
                "word": "alternative rock",
                "pos": "noun"
            },
            {
                "word": "alternative vote",
                "pos": "noun"
            },
            {
                "word": "alternator",
                "pos": "noun"
            },
            {
                "word": "Althea",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a system that allows people to choose candidates for an election in order of preference. All first preferences are counted, and if no candidate achieves a majority, the candidate with the fewest votes is removed from the process and each vote for that candidate is transferred to each person’s second preference. This process is repeated until one candidate achieves the majority.",
                    "vi": "một hệ thống cho phép mọi người chọn ứng cử viên cho một cuộc bầu cử theo thứ tự ưu tiên. Tất cả các ưu tiên đầu tiên đều được tính và nếu không có ứng cử viên nào đạt được đa số phiếu, ứng viên có ít phiếu bầu nhất sẽ bị loại khỏi quy trình và mỗi phiếu bầu cho ứng viên đó được chuyển sang ưu tiên thứ hai của mỗi người. Quá trình này được lặp lại cho đến khi một ứng viên đạt được đa số."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "1cea2c05047449e7b27583b321e5446d",
        "word": "apathy",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈæpəθi/",
            "us": "/ˈæpəθi/"
        },
        "nearby": [
            {
                "word": "apathetic",
                "pos": "adjective"
            },
            {
                "word": "apathetically",
                "pos": "adverb"
            },
            {
                "word": "apathy",
                "pos": "noun"
            },
            {
                "word": "apatosaurus",
                "pos": "noun"
            },
            {
                "word": "APB",
                "pos": "abbreviation"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the feeling of not being interested in or enthusiastic about something, or things in general",
                    "vi": "cảm giác không quan tâm hoặc không nhiệt tình với một cái gì đó, hoặc những thứ nói chung"
                },
                "examples": [
                    {
                        "en": "There is widespread apathy among the electorate.",
                        "vi": "Có sự thờ ơ rộng rãi giữa các cử tri."
                    },
                    {
                        "en": "public/political/student apathy",
                        "vi": "sự thờ ơ của công chúng / chính trị / sinh viên"
                    }
                ]
            }
        ]
    },
    {
        "id": "883344e013374e6782fa58ff808c2960",
        "word": "attack ad",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/əˈtæk æd/",
            "us": "/əˈtæk æd/"
        },
        "nearby": [
            {
                "word": "attack",
                "pos": "noun"
            },
            {
                "word": "attack",
                "pos": "verb"
            },
            {
                "word": "attack ad",
                "pos": "noun"
            },
            {
                "word": "attack dog",
                "pos": "noun"
            },
            {
                "word": "attacker",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an advertisement that promotes a particular politician or political party by presenting the opposition in a negative way",
                    "vi": "một quảng cáo thúc đẩy một chính trị gia hoặc đảng phái chính trị cụ thể bằng cách trình bày phe đối lập theo cách tiêu cực"
                },
                "examples": [
                    {
                        "en": "Her political opponents ran a series of attack ads against her, which aired on TV and radio.",
                        "vi": "Các đối thủ chính trị của cô đã chạy một loạt các quảng cáo tấn công cô, được phát sóng trên TV và đài phát thanh."
                    }
                ]
            }
        ]
    },
    {
        "id": "da01ede16b754768aa2163d447180938",
        "word": "ballot box",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbælət bɒks/",
            "us": "/ˈbælət bɑːks/"
        },
        "nearby": [
            {
                "word": "ballot",
                "pos": "noun"
            },
            {
                "word": "ballot",
                "pos": "verb"
            },
            {
                "word": "ballot box",
                "pos": "noun"
            },
            {
                "word": "ballot paper",
                "pos": "noun"
            },
            {
                "word": "ballpark",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a box in which people put their ballots after voting",
                    "vi": "một hộp trong đó mọi người bỏ phiếu của họ sau khi bỏ phiếu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the system of voting in an election",
                    "vi": "hệ thống bỏ phiếu trong một cuộc bầu cử"
                },
                "examples": [
                    {
                        "en": "The people make their wishes known through the ballot box.",
                        "vi": "Mọi người thể hiện mong muốn của họ thông qua thùng phiếu."
                    }
                ]
            }
        ]
    },
    {
        "id": "d0b5cbceb3344a4fa02f6a9970ad5d4f",
        "word": "bundler",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbʌndlə(r)/",
            "us": "/ˈbʌndlər/"
        },
        "nearby": [
            {
                "word": "bundle",
                "pos": "verb"
            },
            {
                "word": "bundle of joy",
                "pos": "noun"
            },
            {
                "word": "bundler",
                "pos": "noun"
            },
            {
                "word": "bundle together",
                "pos": "phrasal verb"
            },
            {
                "word": "bundle up",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person or machine that packs things into bundles",
                    "vi": "người hoặc máy đóng gói mọi thứ thành từng gói"
                },
                "examples": [
                    {
                        "en": "The bundler compresses the material and wraps it with twine.",
                        "vi": "Người bó sẽ nén vật liệu và quấn nó bằng sợi xe."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who raises money for a political campaign by collecting money from people who support the campaign",
                    "vi": "một người quyên tiền cho một chiến dịch chính trị bằng cách thu tiền từ những người ủng hộ chiến dịch"
                },
                "examples": [
                    {
                        "en": "She was a bundler for Obama in 2012.",
                        "vi": "Cô ấy là người trợ giúp cho Obama vào năm 2012."
                    }
                ]
            }
        ]
    },
    {
        "id": "6893ed535f98463e931d8b918311d18f",
        "word": "by-election",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbaɪ ɪlekʃn/",
            "us": "/ˈbaɪ ɪlekʃn/"
        },
        "nearby": [
            {
                "word": "bye-byes",
                "pos": "noun"
            },
            {
                "word": "bye-law",
                "pos": "noun"
            },
            {
                "word": "by-election",
                "pos": "noun"
            },
            {
                "word": "bygone",
                "pos": "adjective"
            },
            {
                "word": "bygones",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an election of a new Member of Parliament to replace somebody who has died or left parliament",
                    "vi": "một cuộc bầu cử một thành viên mới của quốc hội để thay thế một người nào đó đã chết hoặc rời khỏi quốc hội"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "0749bea5582a4e649bdaa5ef17d722af",
        "word": "candidacy",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkændɪdəsi/",
            "us": "/ˈkændɪdəsi/"
        },
        "nearby": [
            {
                "word": "candid",
                "pos": "adjective"
            },
            {
                "word": "candida",
                "pos": "noun"
            },
            {
                "word": "candidacy",
                "pos": "noun"
            },
            {
                "word": "candidate",
                "pos": "noun"
            },
            {
                "word": "candidature",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the fact of being a candidate in an election",
                    "vi": "thực tế là một ứng cử viên trong một cuộc bầu cử"
                },
                "examples": [
                    {
                        "en": "to announce/declare/withdraw your candidacy for the post",
                        "vi": "thông báo / tuyên bố / rút lại ứng cử của bạn cho bài đăng"
                    }
                ]
            }
        ]
    },
    {
        "id": "c430474888394a5c86aa2dd6a99798d2",
        "word": "candidature",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkændɪdətʃə(r)/",
            "us": "/ˈkændɪdətʃər/"
        },
        "nearby": [
            {
                "word": "candidacy",
                "pos": "noun"
            },
            {
                "word": "candidate",
                "pos": "noun"
            },
            {
                "word": "candidature",
                "pos": "noun"
            },
            {
                "word": "Candid Camera",
                "pos": ""
            },
            {
                "word": "candidly",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the fact of being a candidate in an election",
                    "vi": "thực tế là một ứng cử viên trong một cuộc bầu cử"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "effc548b0c024475b4c67ee96a2877fe",
        "word": "canvass",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkænvəs/",
            "us": "/ˈkænvəs/"
        },
        "nearby": [
            {
                "word": "Canute",
                "pos": "noun"
            },
            {
                "word": "canvas",
                "pos": "noun"
            },
            {
                "word": "canvass",
                "pos": "noun"
            },
            {
                "word": "canvass",
                "pos": "verb"
            },
            {
                "word": "canvasser",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the process of going around an area and talking to people, especially to ask for support for a particular person, political party, etc.",
                    "vi": "Quá trình đi xung quanh một khu vực và nói chuyện với mọi người, đặc biệt là để yêu cầu hỗ trợ cho một cá nhân cụ thể, đảng phái chính trị, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the process of asking people what they think about a particular subject",
                    "vi": "quá trình hỏi mọi người xem họ nghĩ gì về một chủ đề cụ thể"
                },
                "examples": [
                    {
                        "en": "to carry out a canvass of opinions",
                        "vi": "thực hiện một loạt các ý kiến"
                    }
                ]
            }
        ]
    },
    {
        "id": "15df2b8afe614d138fab2869fe1c7bff",
        "word": "canvass",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkænvəs/",
            "us": "/ˈkænvəs/"
        },
        "nearby": [
            {
                "word": "canvas",
                "pos": "noun"
            },
            {
                "word": "canvass",
                "pos": "noun"
            },
            {
                "word": "canvass",
                "pos": "verb"
            },
            {
                "word": "canvasser",
                "pos": "noun"
            },
            {
                "word": "canyon",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to ask people to support a particular person, political party, etc., either by going around an area and talking to people or by phoning them",
                    "vi": "để yêu cầu mọi người ủng hộ một cá nhân cụ thể, đảng phái chính trị, v.v., bằng cách đi xung quanh một khu vực và nói chuyện với mọi người hoặc gọi điện cho họ"
                },
                "examples": [
                    {
                        "en": "canvass (for something) He spent the whole month canvassing for votes.",
                        "vi": "canvass (vì điều gì đó) Anh ấy đã dành cả tháng để tìm kiếm các phiếu bầu."
                    },
                    {
                        "en": "canvass somebody (for something) Party workers are busy canvassing local residents.",
                        "vi": "canvass ai đó (vì điều gì đó) Các nhân viên của Đảng đang bận rộn với việc thăm dò các cư dân địa phương."
                    }
                ]
            },
            {
                "define": {
                    "en": "to ask people about something in order to find out what they think about it",
                    "vi": "hỏi mọi người về điều gì đó để tìm hiểu xem họ nghĩ gì về điều đó"
                },
                "examples": [
                    {
                        "en": "canvass something He has been canvassing opinion on the issue.",
                        "vi": "canvass something Anh ấy đã đưa ra ý kiến về vấn đề này."
                    },
                    {
                        "en": "canvass somebody (for something) People are being canvassed for their views on the proposed new road.",
                        "vi": "canvass ai đó (vì điều gì đó) Mọi người đang được canvass vì quan điểm của họ về con đường mới được đề xuất."
                    }
                ]
            },
            {
                "define": {
                    "en": "to try and get support from a group of people",
                    "vi": "để cố gắng và nhận được sự hỗ trợ từ một nhóm người"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to discuss an idea carefully and completely",
                    "vi": "thảo luận về một ý tưởng một cách cẩn thận và đầy đủ"
                },
                "examples": [
                    {
                        "en": "The proposal is currently being canvassed.",
                        "vi": "Đề xuất hiện đang được thông qua."
                    }
                ]
            }
        ]
    },
    {
        "id": "44f448aa39c94af1bdbab5dc6b8421bb",
        "word": "canvasser",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkænvəsə(r)/",
            "us": "/ˈkænvəsər/"
        },
        "nearby": [
            {
                "word": "canvass",
                "pos": "noun"
            },
            {
                "word": "canvass",
                "pos": "verb"
            },
            {
                "word": "canvasser",
                "pos": "noun"
            },
            {
                "word": "canyon",
                "pos": "noun"
            },
            {
                "word": "canyoning",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who asks people to support a particular politician or party, either by going around an area or by phone",
                    "vi": "một người yêu cầu mọi người ủng hộ một chính trị gia hoặc đảng cụ thể, bằng cách đi xung quanh một khu vực hoặc qua điện thoại"
                },
                "examples": [
                    {
                        "en": "Democratic/Republican canvassers",
                        "vi": "Những người ủng hộ đảng Dân chủ / Cộng hòa"
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who tries to persuade people to buy something, use a service, etc., either by going around an area or by phone",
                    "vi": "một người cố gắng thuyết phục mọi người mua thứ gì đó, sử dụng dịch vụ, v.v., bằng cách đi quanh một khu vực hoặc qua điện thoại"
                },
                "examples": [
                    {
                        "en": "He works as a canvasser for a double glazing firm.",
                        "vi": "Anh ấy làm việc như một người thợ đóng thùng cho một công ty sản xuất kính hai lớp."
                    }
                ]
            }
        ]
    },
    {
        "id": "37f5f0b7c2434160b3d3f8f1804e8c15",
        "word": "congressional district",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/kənˌɡreʃənl ˈdɪstrɪkt/",
            "us": "/kənˌɡreʃənl ˈdɪstrɪkt/"
        },
        "nearby": [
            {
                "word": "Congress House",
                "pos": ""
            },
            {
                "word": "congressional",
                "pos": "adjective"
            },
            {
                "word": "congressional district",
                "pos": "noun"
            },
            {
                "word": "the Congressional Gold Medal",
                "pos": ""
            },
            {
                "word": "the Congressional Record",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an area within a state that elects a member of the US House of Representatives",
                    "vi": "một khu vực trong tiểu bang bầu chọn thành viên của Hạ viện Hoa Kỳ"
                },
                "examples": [
                    {
                        "en": "He represents the first congressional district of Massachusetts.",
                        "vi": "Ông đại diện cho khu vực quốc hội đầu tiên của Massachusetts."
                    }
                ]
            }
        ]
    },
    {
        "id": "9b9a5f123888453cbdc0d706987b7607",
        "word": "constituent",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/kənˈstɪtʃuənt/",
            "us": "/kənˈstɪtʃuənt/"
        },
        "nearby": [
            {
                "word": "constipation",
                "pos": "noun"
            },
            {
                "word": "constituency",
                "pos": "noun"
            },
            {
                "word": "constituent",
                "pos": "noun"
            },
            {
                "word": "constituent",
                "pos": "adjective"
            },
            {
                "word": "constituent assembly",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who lives in and can vote in a constituency",
                    "vi": "một người sống và có thể bỏ phiếu trong khu vực bầu cử"
                },
                "examples": [
                    {
                        "en": "She has the full support of her constituents.",
                        "vi": "Cô ấy có sự ủng hộ đầy đủ của các cử tri của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "one of the parts of something that combine to form the whole",
                    "vi": "một trong những bộ phận của cái gì đó kết hợp để tạo thành tổng thể"
                },
                "examples": [
                    {
                        "en": "Silicon and oxygen are the fundamental constituents of rocks in the earth’s crust.",
                        "vi": "Silic và oxy là thành phần cơ bản của đá trong vỏ trái đất."
                    },
                    {
                        "en": "Tar is a harmful constituent of tobacco smoke.",
                        "vi": "Tar là một thành phần có hại của khói thuốc lá."
                    },
                    {
                        "en": "Vitamins are natural food constituents which are essential in helping to maintain good health.",
                        "vi": "Vitamin là thành phần thực phẩm tự nhiên rất cần thiết để giúp duy trì sức khỏe tốt."
                    }
                ]
            }
        ]
    },
    {
        "id": "b33fab61507e4e1f9771b0e64427f344",
        "word": "deposit",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/dɪˈpɒzɪt/",
            "us": "/dɪˈpɑːzɪt/"
        },
        "nearby": [
            {
                "word": "deportment",
                "pos": "noun"
            },
            {
                "word": "depose",
                "pos": "verb"
            },
            {
                "word": "deposit",
                "pos": "noun"
            },
            {
                "word": "deposit",
                "pos": "verb"
            },
            {
                "word": "deposit account",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a sum of money that is given as the first part of a larger payment",
                    "vi": "một khoản tiền được đưa ra như là phần đầu tiên của một khoản thanh toán lớn hơn"
                },
                "examples": [
                    {
                        "en": "They normally ask you to pay $100 (as a) deposit.",
                        "vi": "Họ thường yêu cầu bạn trả 100 đô la (dưới dạng) tiền đặt cọc."
                    },
                    {
                        "en": "All deposits are non-refundable.",
                        "vi": "Tất cả các khoản đặt cọc đều không được hoàn lại."
                    },
                    {
                        "en": "deposit on something (British English) We've put down a 5% deposit on the house.",
                        "vi": "đặt cọc vào thứ gì đó (tiếng Anh Anh) Chúng tôi đã đặt cọc 5% cho căn nhà."
                    }
                ]
            },
            {
                "define": {
                    "en": "a sum of money that is paid by somebody when they rent something and that is returned to them if they do not lose or damage the thing they are renting",
                    "vi": "một khoản tiền được ai đó trả khi họ thuê một thứ gì đó và sẽ được trả lại cho họ nếu họ không làm mất hoặc hư hỏng thứ mà họ đang thuê"
                },
                "examples": [
                    {
                        "en": "to pay a deposit",
                        "vi": "trả tiền đặt cọc"
                    },
                    {
                        "en": "They'll probably ask you to leave a deposit.",
                        "vi": "Họ có thể sẽ yêu cầu bạn để lại một khoản tiền gửi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a sum of money that is paid into a bank account",
                    "vi": "một khoản tiền được trả vào tài khoản ngân hàng"
                },
                "examples": [
                    {
                        "en": "Deposits can be made at any branch.",
                        "vi": "Có thể gửi tiền tại bất kỳ chi nhánh nào."
                    }
                ]
            },
            {
                "define": {
                    "en": "(in the British political system) the amount of money that a candidate in an election to Parliament has to pay, and that is returned if he/she gets enough votes",
                    "vi": "(trong hệ thống chính trị Anh) số tiền mà một ứng cử viên trong cuộc bầu cử vào Nghị viện phải trả và số tiền đó sẽ được trả lại nếu anh ta / cô ta có đủ số phiếu bầu"
                },
                "examples": [
                    {
                        "en": "All the other candidates lost their deposits.",
                        "vi": "Tất cả các ứng cử viên khác bị mất tiền gửi của họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a layer of a substance that has formed naturally underground",
                    "vi": "một lớp chất đã hình thành tự nhiên dưới lòng đất"
                },
                "examples": [
                    {
                        "en": "mineral/gold/coal deposits",
                        "vi": "mỏ khoáng sản / vàng / than đá"
                    }
                ]
            },
            {
                "define": {
                    "en": "a layer of a substance that has been left somewhere, especially by a river, flood, etc., or is found at the bottom of a liquid",
                    "vi": "một lớp chất đã bị bỏ lại ở đâu đó, đặc biệt là do sông, lũ lụt, v.v., hoặc được tìm thấy dưới đáy chất lỏng"
                },
                "examples": [
                    {
                        "en": "The rain left a deposit of mud on the windows.",
                        "vi": "Mưa để lại một đống bùn trên cửa sổ."
                    },
                    {
                        "en": "fatty deposits in the arteries of the heart",
                        "vi": "chất béo lắng đọng trong động mạch của tim"
                    },
                    {
                        "en": "glacial deposits",
                        "vi": "tiền gửi băng"
                    },
                    {
                        "en": "The floods left a thick deposit of mud over the fields.",
                        "vi": "Lũ lụt để lại một lớp bùn dày đặc trên các cánh đồng."
                    }
                ]
            },
            {
                "define": {
                    "en": "placed in a deposit account",
                    "vi": "được đặt trong một tài khoản tiền gửi"
                },
                "examples": [
                    {
                        "en": "With interest rates so low, there is little point in having cash on deposit.",
                        "vi": "Với lãi suất thấp như vậy, việc có tiền gửi tiết kiệm là điều rất ít."
                    }
                ]
            }
        ]
    },
    {
        "id": "7a8dfc38c09a4da18c89a65a1b6ce508",
        "word": "deselect",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌdiːsɪˈlekt/",
            "us": "/ˌdiːsɪˈlekt/"
        },
        "nearby": [
            {
                "word": "desegregate",
                "pos": "verb"
            },
            {
                "word": "desegregation",
                "pos": "noun"
            },
            {
                "word": "deselect",
                "pos": "verb"
            },
            {
                "word": "deselection",
                "pos": "noun"
            },
            {
                "word": "desensitization",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "if the local branch of a political party in the UK deselects the existing Member of Parliament, it does not choose him or her as a candidate at the next election",
                    "vi": "nếu chi nhánh địa phương của một đảng chính trị ở Vương quốc Anh loại bỏ thành viên Nghị viện hiện tại, nó sẽ không chọn người đó làm ứng cử viên tại cuộc bầu cử tiếp theo"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to remove something from the list of possible choices on a computer menu",
                    "vi": "để xóa nội dung nào đó khỏi danh sách các lựa chọn có thể có trên menu máy tính"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "d65818daa6614515ab181636738e9193",
        "word": "dirty trick",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌdɜːti ˈtrɪk/",
            "us": "/ˌdɜːrti ˈtrɪk/"
        },
        "nearby": [
            {
                "word": "Dirty Harry",
                "pos": ""
            },
            {
                "word": "dirty old man",
                "pos": "noun"
            },
            {
                "word": "dirty trick",
                "pos": "noun"
            },
            {
                "word": "dirty weekend",
                "pos": "noun"
            },
            {
                "word": "dirty word",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "dishonest, secret and often illegal activity by a political group or other organization that is intended to harm the reputation or success of an opponent",
                    "vi": "hoạt động không trung thực, bí mật và thường là bất hợp pháp của một nhóm chính trị hoặc tổ chức khác nhằm làm tổn hại danh tiếng hoặc sự thành công của đối thủ"
                },
                "examples": [
                    {
                        "en": "a dirty tricks campaign",
                        "vi": "một chiến dịch thủ đoạn bẩn thỉu"
                    }
                ]
            },
            {
                "define": {
                    "en": "an unpleasant and dishonest act",
                    "vi": "một hành động khó chịu và không trung thực"
                },
                "examples": [
                    {
                        "en": "What a dirty trick to play!",
                        "vi": "Thật là một trò bẩn thỉu để chơi!"
                    }
                ]
            }
        ]
    },
    {
        "id": "f9526ccd9a864ceb94c3aea50005cfbe",
        "word": "disenfranchise",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌdɪsɪnˈfræntʃaɪz/",
            "us": "/ˌdɪsɪnˈfræntʃaɪz/"
        },
        "nearby": [
            {
                "word": "disenchanted",
                "pos": "adjective"
            },
            {
                "word": "disenchantment",
                "pos": "noun"
            },
            {
                "word": "disenfranchise",
                "pos": "verb"
            },
            {
                "word": "disengage",
                "pos": "verb"
            },
            {
                "word": "disengaged",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to take away somebody’s rights, especially their right to vote",
                    "vi": "tước bỏ quyền của ai đó, đặc biệt là quyền bầu cử của họ"
                },
                "examples": [
                    {
                        "en": "be disenfranchised Many disabled people were effectively disenfranchised because of lack of access.",
                        "vi": "bị tước quyền sử dụng Nhiều người tàn tật đã bị tước quyền sử dụng một cách hiệu quả vì không có quyền tiếp cận."
                    },
                    {
                        "en": "Mr Mandela was the symbolic leader of the disenfranchised black majority.",
                        "vi": "Ông Mandela là nhà lãnh đạo biểu tượng của đa số người da đen bị tước quyền."
                    }
                ]
            }
        ]
    },
    {
        "id": "e8479be424914da1ba731e0f028ec126",
        "word": "electioneering",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ɪˌlekʃəˈnɪərɪŋ/",
            "us": "/ɪˌlekʃəˈnɪrɪŋ/"
        },
        "nearby": [
            {
                "word": "electable",
                "pos": "adjective"
            },
            {
                "word": "election",
                "pos": "noun"
            },
            {
                "word": "electioneering",
                "pos": "noun"
            },
            {
                "word": "elective",
                "pos": "adjective"
            },
            {
                "word": "elective",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the activity of making speeches and visiting people to try to persuade them to vote for a particular politician or political party in an election",
                    "vi": "Hoạt động phát biểu và thăm hỏi mọi người để cố gắng thuyết phục họ bỏ phiếu cho một chính trị gia hoặc đảng chính trị cụ thể trong một cuộc bầu cử"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "677a39ec60164dd695f537bc96b1216a",
        "word": "elective",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ɪˈlektɪv/",
            "us": "/ɪˈlektɪv/"
        },
        "nearby": [
            {
                "word": "election",
                "pos": "noun"
            },
            {
                "word": "electioneering",
                "pos": "noun"
            },
            {
                "word": "elective",
                "pos": "adjective"
            },
            {
                "word": "elective",
                "pos": "noun"
            },
            {
                "word": "elector",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "using or chosen by election",
                    "vi": "sử dụng hoặc được lựa chọn bởi bầu cử"
                },
                "examples": [
                    {
                        "en": "an elective democracy",
                        "vi": "một nền dân chủ tự chọn"
                    },
                    {
                        "en": "an elective assembly",
                        "vi": "một hội đồng tự chọn"
                    },
                    {
                        "en": "an elective member",
                        "vi": "một thành viên tự chọn"
                    },
                    {
                        "en": "He had never held elective office (= a position that is filled by election).",
                        "vi": "Anh ta chưa bao giờ giữ chức vụ bầu cử (= một vị trí được bầu cử)."
                    }
                ]
            },
            {
                "define": {
                    "en": "having the power to elect",
                    "vi": "có quyền bầu cử"
                },
                "examples": [
                    {
                        "en": "an elective body",
                        "vi": "một cơ quan tự chọn"
                    }
                ]
            },
            {
                "define": {
                    "en": "that you choose to have; that does not require immediate attention",
                    "vi": "mà bạn chọn để có; điều đó không đòi hỏi sự chú ý ngay lập tức"
                },
                "examples": [
                    {
                        "en": "elective surgery",
                        "vi": "Lựa chọn phẫu thuật"
                    },
                    {
                        "en": "an elective operation",
                        "vi": "một hoạt động tự chọn"
                    }
                ]
            },
            {
                "define": {
                    "en": "that a student can choose",
                    "vi": "mà một sinh viên có thể chọn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "599e62190fea4e7ab1b4288ac1f9fc03",
        "word": "elector",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ɪˈlektə(r)/",
            "us": "/ɪˈlektər/"
        },
        "nearby": [
            {
                "word": "elective",
                "pos": "adjective"
            },
            {
                "word": "elective",
                "pos": "noun"
            },
            {
                "word": "elector",
                "pos": "noun"
            },
            {
                "word": "electoral",
                "pos": "adjective"
            },
            {
                "word": "electoral college",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who has the right to vote in an election",
                    "vi": "một người có quyền bỏ phiếu trong một cuộc bầu cử"
                },
                "examples": [
                    {
                        "en": "If your name is not on the register of electors, you will not be able to vote.",
                        "vi": "Nếu tên của bạn không có trong sổ đăng ký đại cử tri, bạn sẽ không thể bỏ phiếu."
                    },
                    {
                        "en": "Not all the registered electors actually voted.",
                        "vi": "Không phải tất cả các đại cử tri đã đăng ký đều thực sự bỏ phiếu."
                    }
                ]
            },
            {
                "define": {
                    "en": "a member of the Electoral College",
                    "vi": "một thành viên của cử tri đoàn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "5c646a8331084866976d1f8727c21de8",
        "word": "electoral college",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ɪˌlektərəl ˈkɒlɪdʒ/",
            "us": "/ɪˌlektərəl ˈkɑːlɪdʒ/"
        },
        "nearby": [
            {
                "word": "elector",
                "pos": "noun"
            },
            {
                "word": "electoral",
                "pos": "adjective"
            },
            {
                "word": "electoral college",
                "pos": "noun"
            },
            {
                "word": "electorally",
                "pos": "adverb"
            },
            {
                "word": "the Electoral Reform Society",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "(in the US) a group of people who come together to elect the President and Vice-President, based on the votes of people in each state",
                    "vi": "(ở Mỹ) một nhóm người cùng nhau bầu Tổng thống và Phó Tổng thống, dựa trên phiếu bầu của người dân ở mỗi bang"
                },
                "examples": [
                    {
                        "en": "Each of the fifty states casts electoral college votes equal to the number of its delegates in Congress.",
                        "vi": "Mỗi bang trong số năm mươi bang bỏ phiếu của cử tri đoàn bằng với số đại biểu của nó trong Quốc hội."
                    }
                ]
            },
            {
                "define": {
                    "en": "a group of people who are chosen to represent the members of a political party, etc. in the election of a leader",
                    "vi": "một nhóm người được chọn để đại diện cho các thành viên của một đảng chính trị, v.v. trong cuộc bầu cử lãnh đạo"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "4e3e87153b354236a245fdb166876105",
        "word": "enfranchise",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ɪnˈfræntʃaɪz/",
            "us": "/ɪnˈfræntʃaɪz/"
        },
        "nearby": [
            {
                "word": "enforcement",
                "pos": "noun"
            },
            {
                "word": "enforcer",
                "pos": "noun"
            },
            {
                "word": "enfranchise",
                "pos": "verb"
            },
            {
                "word": "enfranchisement",
                "pos": "noun"
            },
            {
                "word": "eng.",
                "pos": "abbreviation"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to give somebody the right to vote in an election",
                    "vi": "trao cho ai đó quyền bỏ phiếu trong một cuộc bầu cử"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "11638e36daa8435590f3191fd47c9e59",
        "word": "enfranchisement",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ɪnˈfræntʃɪzmənt/",
            "us": "/ɪnˈfræntʃaɪzmənt/"
        },
        "nearby": [
            {
                "word": "enforcer",
                "pos": "noun"
            },
            {
                "word": "enfranchise",
                "pos": "verb"
            },
            {
                "word": "enfranchisement",
                "pos": "noun"
            },
            {
                "word": "eng.",
                "pos": "abbreviation"
            },
            {
                "word": "ENG",
                "pos": "abbreviation"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act of giving somebody the right to vote in an election",
                    "vi": "hành động trao cho ai đó quyền bỏ phiếu trong một cuộc bầu cử"
                },
                "examples": [
                    {
                        "en": "the enfranchisement of foreign residents in local elections",
                        "vi": "sự chiếm quyền của cư dân nước ngoài trong các cuộc bầu cử địa phương"
                    }
                ]
            }
        ]
    },
    {
        "id": "2c6efa9da30d4b5abf937d07041f1982",
        "word": "exit poll",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈeksɪt pəʊl/",
            "us": "/ˈeksɪt pəʊl/"
        },
        "nearby": [
            {
                "word": "exit exam",
                "pos": "noun"
            },
            {
                "word": "exit interview",
                "pos": "noun"
            },
            {
                "word": "exit poll",
                "pos": "noun"
            },
            {
                "word": "exit strategy",
                "pos": "noun"
            },
            {
                "word": "exit visa",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "in an exit poll immediately after an election, people are asked how they voted, in order to predict the result of the election",
                    "vi": "trong một cuộc thăm dò ý kiến rút lui ngay sau một cuộc bầu cử, mọi người được hỏi họ đã bỏ phiếu như thế nào, để dự đoán kết quả của cuộc bầu cử"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "293935ff7e244d528f927bc7e4e8ea4e",
        "word": "first-past-the-post",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌfɜːst ˌpɑːst ðə ˈpəʊst/",
            "us": "/ˌfɜːrst ˌpæst ðə ˈpəʊst/"
        },
        "nearby": [
            {
                "word": "first offender",
                "pos": "noun"
            },
            {
                "word": "first officer",
                "pos": "noun"
            },
            {
                "word": "first-past-the-post",
                "pos": "adjective"
            },
            {
                "word": "the first person",
                "pos": "noun"
            },
            {
                "word": "first-person shooter",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "in which only the person who gets the most votes is elected",
                    "vi": "trong đó chỉ người được nhiều phiếu bầu nhất."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c076c293b4a74d60bcec1e761000c6c7",
        "word": "floating voter",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌfləʊtɪŋ ˈvəʊtə(r)/",
            "us": "/ˌfləʊtɪŋ ˈvəʊtər/"
        },
        "nearby": [
            {
                "word": "floating",
                "pos": "adjective"
            },
            {
                "word": "floating rib",
                "pos": "noun"
            },
            {
                "word": "floating voter",
                "pos": "noun"
            },
            {
                "word": "floaty",
                "pos": "adjective"
            },
            {
                "word": "flock",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who does not always vote for the same political party or who has not decided which party to vote for in an election",
                    "vi": "một người không phải lúc nào cũng bỏ phiếu cho cùng một chính đảng hoặc người không quyết định sẽ bỏ phiếu cho đảng nào trong một cuộc bầu cử"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "148e21fdbec54d1b83e20db804851551",
        "word": "franchise",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈfræntʃaɪz/",
            "us": "/ˈfræntʃaɪz/"
        },
        "nearby": [
            {
                "word": "Frances",
                "pos": ""
            },
            {
                "word": "Francesca",
                "pos": ""
            },
            {
                "word": "franchise",
                "pos": "noun"
            },
            {
                "word": "franchise",
                "pos": "verb"
            },
            {
                "word": "franchisee",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "formal permission given by a company to somebody who wants to sell its goods or services in a particular area; formal permission given by a government to somebody who wants to operate a public service as a business",
                    "vi": "sự cho phép chính thức của một công ty cho ai đó muốn bán hàng hóa hoặc dịch vụ của họ trong một khu vực cụ thể; sự cho phép chính thức do chính phủ cấp cho ai đó muốn hoạt động dịch vụ công như một doanh nghiệp"
                },
                "examples": [
                    {
                        "en": "a franchise agreement/company",
                        "vi": "hợp đồng nhượng quyền thương mại / công ty"
                    },
                    {
                        "en": "a catering/rail franchise",
                        "vi": "nhượng quyền kinh doanh dịch vụ ăn uống / đường sắt"
                    },
                    {
                        "en": "In the reorganization, Southern Television lost their franchise.",
                        "vi": "Trong quá trình tổ chức lại, Đài Truyền hình Miền Nam mất quyền kinh doanh."
                    },
                    {
                        "en": "to operate a business under franchise",
                        "vi": "để điều hành một doanh nghiệp theo nhượng quyền thương mại"
                    }
                ]
            },
            {
                "define": {
                    "en": "a business or service run under franchise",
                    "vi": "một doanh nghiệp hoặc dịch vụ được nhượng quyền thương mại"
                },
                "examples": [
                    {
                        "en": "They operate franchises in London and Paris.",
                        "vi": "Họ điều hành nhượng quyền thương mại ở London và Paris."
                    },
                    {
                        "en": "He's got a job as manager of a burger franchise.",
                        "vi": "Anh ấy nhận được một công việc là quản lý của một cửa hàng nhượng quyền thương mại bánh mì kẹp thịt."
                    },
                    {
                        "en": "He runs a local pizza franchise.",
                        "vi": "Anh ấy điều hành một cửa hàng nhượng quyền pizza địa phương."
                    }
                ]
            },
            {
                "define": {
                    "en": "the right to vote in a country’s elections",
                    "vi": "quyền bỏ phiếu trong các cuộc bầu cử của một quốc gia"
                },
                "examples": [
                    {
                        "en": "universal adult franchise",
                        "vi": "nhượng quyền thương mại dành cho người lớn"
                    },
                    {
                        "en": "The 1918 Reform Act extended the franchise to women over 30.",
                        "vi": "Đạo luật cải cách năm 1918 đã mở rộng nhượng quyền thương mại cho phụ nữ trên 30 tuổi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a set of films in which the same characters appear in related stories",
                    "vi": "một bộ phim trong đó các nhân vật giống nhau xuất hiện trong các câu chuyện liên quan"
                },
                "examples": [
                    {
                        "en": "Disney has successfully revived the ‘Star Wars’ franchise, with four films already released and more in the works.",
                        "vi": "Disney đã hồi sinh thành công loạt phim 'Chiến tranh giữa các vì sao', với bốn phim đã được phát hành và nhiều phim khác đang được thực hiện."
                    }
                ]
            }
        ]
    },
    {
        "id": "c24df1be31994dde896f459c509ea956",
        "word": "hustings",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈhʌstɪŋz/",
            "us": "/ˈhʌstɪŋz/"
        },
        "nearby": [
            {
                "word": "hussar",
                "pos": "noun"
            },
            {
                "word": "hussy",
                "pos": "noun"
            },
            {
                "word": "hustings",
                "pos": "noun"
            },
            {
                "word": "hustle",
                "pos": "verb"
            },
            {
                "word": "hustle",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a meeting before an election at which candidates speak to voters",
                    "vi": "một cuộc họp trước một cuộc bầu cử mà tại đó các ứng cử viên nói chuyện với cử tri"
                },
                "examples": [
                    {
                        "en": "an election hustings",
                        "vi": "một cuộc bầu cử"
                    }
                ]
            },
            {
                "define": {
                    "en": "the political meetings, speeches, etc. that take place in the period before an election",
                    "vi": "các cuộc họp chính trị, bài phát biểu, v.v. diễn ra trong khoảng thời gian trước một cuộc bầu cử"
                },
                "examples": [
                    {
                        "en": "on the hustings Most candidates will be out on the hustings this week.",
                        "vi": "Hầu hết các ứng cử viên sẽ ra ngoài trong tuần này."
                    }
                ]
            }
        ]
    },
    {
        "id": "beb368a1165f4c7f8d80de6ae9b1c6ed",
        "word": "incoming",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɪnkʌmɪŋ/",
            "us": "/ˈɪnkʌmɪŋ/"
        },
        "nearby": [
            {
                "word": "income support",
                "pos": "noun"
            },
            {
                "word": "income tax",
                "pos": "noun"
            },
            {
                "word": "incoming",
                "pos": "adjective"
            },
            {
                "word": "incommensurable",
                "pos": "adjective"
            },
            {
                "word": "incommensurate",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "recently elected or chosen",
                    "vi": "được bầu hoặc chọn gần đây"
                },
                "examples": [
                    {
                        "en": "the incoming government/president/administration",
                        "vi": "chính phủ sắp tới / tổng thống / chính quyền"
                    }
                ]
            },
            {
                "define": {
                    "en": "arriving somewhere, or being received",
                    "vi": "đến một nơi nào đó, hoặc được nhận"
                },
                "examples": [
                    {
                        "en": "incoming flights",
                        "vi": "các chuyến bay đến"
                    },
                    {
                        "en": "the incoming tide",
                        "vi": "thủy triều đến"
                    },
                    {
                        "en": "incoming calls/mail",
                        "vi": "cuộc gọi đến / thư"
                    }
                ]
            }
        ]
    },
    {
        "id": "d0400e8d4afa4fe28c1ed33cf9433893",
        "word": "landslide",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈlændslaɪd/",
            "us": "/ˈlændslaɪd/"
        },
        "nearby": [
            {
                "word": "Edwin Landseer",
                "pos": ""
            },
            {
                "word": "Land's End",
                "pos": ""
            },
            {
                "word": "landslide",
                "pos": "noun"
            },
            {
                "word": "landslip",
                "pos": "noun"
            },
            {
                "word": "land up at",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a mass of earth, rock, etc. that falls down the slope of a mountain or a cliff",
                    "vi": "một khối đất, đá, v.v. rơi xuống dốc núi hoặc vách đá"
                },
                "examples": [
                    {
                        "en": "The house was buried beneath a landslide.",
                        "vi": "Ngôi nhà bị chôn vùi dưới một trận lở đất."
                    }
                ]
            },
            {
                "define": {
                    "en": "an election in which one person or party gets very many more votes than the other people or parties",
                    "vi": "một cuộc bầu cử trong đó một người hoặc đảng nhận được rất nhiều phiếu bầu hơn những người hoặc đảng khác"
                },
                "examples": [
                    {
                        "en": "by a landslide She was expected to win by a landslide.",
                        "vi": "bởi một trận lở đất Cô ấy được kỳ vọng sẽ thắng bằng một trận lở đất."
                    },
                    {
                        "en": "No one expected a repeat of Labour's 1997 landslide victory.",
                        "vi": "Không ai mong đợi một chiến thắng vang dội năm 1997 của Labour lặp lại."
                    },
                    {
                        "en": "The National Party won by a landslide.",
                        "vi": "Đảng Quốc đại chiến thắng long trời lở đất."
                    }
                ]
            }
        ]
    },
    {
        "id": "f0050d615e57484f94cf4548c2ab2d5f",
        "word": "marginal",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmɑːdʒɪnl/",
            "us": "/ˈmɑːrdʒɪnl/"
        },
        "nearby": [
            {
                "word": "Margery",
                "pos": ""
            },
            {
                "word": "margin",
                "pos": "noun"
            },
            {
                "word": "marginal",
                "pos": "adjective"
            },
            {
                "word": "marginal",
                "pos": "noun"
            },
            {
                "word": "marginalia",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "small and not important",
                    "vi": "nhỏ và không quan trọng"
                },
                "examples": [
                    {
                        "en": "a marginal improvement in weather conditions",
                        "vi": "một sự cải thiện nhỏ trong điều kiện thời tiết"
                    },
                    {
                        "en": "The story will only be of marginal interest to our readers.",
                        "vi": "Câu chuyện sẽ chỉ được các độc giả của chúng tôi quan tâm ngoài lề."
                    },
                    {
                        "en": "The difference between the two estimates is marginal.",
                        "vi": "Sự khác biệt giữa hai ước tính là cận biên."
                    }
                ]
            },
            {
                "define": {
                    "en": "relating to or resulting from small changes",
                    "vi": "liên quan đến hoặc kết quả từ những thay đổi nhỏ"
                },
                "examples": [
                    {
                        "en": "All three companies reported marginal revenue growth.",
                        "vi": "Cả ba công ty đều báo cáo tăng trưởng doanh thu cận biên."
                    }
                ]
            },
            {
                "define": {
                    "en": "not part of a main or important group or situation",
                    "vi": "không phải là một phần của một nhóm hoặc tình huống chính hoặc quan trọng"
                },
                "examples": [
                    {
                        "en": "marginal groups in society",
                        "vi": "các nhóm bên lề trong xã hội"
                    },
                    {
                        "en": "Welsh was considered a marginal language.",
                        "vi": "Tiếng Wales được coi là một ngôn ngữ biên."
                    }
                ]
            },
            {
                "define": {
                    "en": "won or lost by a very small number of votes and therefore very important or interesting as evidence of public opinion",
                    "vi": "thắng hay thua bởi một số lượng rất nhỏ phiếu bầu và do đó rất quan trọng hoặc thú vị như là bằng chứng của dư luận"
                },
                "examples": [
                    {
                        "en": "a marginal seat/constituency",
                        "vi": "một chỗ ngồi / khu vực bầu cử bên lề"
                    }
                ]
            },
            {
                "define": {
                    "en": "written in the margin of a page",
                    "vi": "được viết ở lề của một trang"
                },
                "examples": [
                    {
                        "en": "marginal notes/comments",
                        "vi": "ghi chú / nhận xét bên lề"
                    }
                ]
            },
            {
                "define": {
                    "en": "that cannot produce enough good crops to make a profit",
                    "vi": "không thể sản xuất đủ cây trồng tốt để tạo ra lợi nhuận"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "cab4f2cee4ee483983c7de7f36fabb17",
        "word": "marginal",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmɑːdʒɪnl/",
            "us": "/ˈmɑːrdʒɪnl/"
        },
        "nearby": [
            {
                "word": "margin",
                "pos": "noun"
            },
            {
                "word": "marginal",
                "pos": "adjective"
            },
            {
                "word": "marginal",
                "pos": "noun"
            },
            {
                "word": "marginalia",
                "pos": "noun"
            },
            {
                "word": "marginalization",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a seat in a parliament, on a local council, etc. that was won by a very small number of votes",
                    "vi": "một ghế trong quốc hội, trong hội đồng địa phương, v.v. đã giành được bằng một số phiếu rất nhỏ"
                },
                "examples": [
                    {
                        "en": "a Labour marginal",
                        "vi": "một lao động cận biên"
                    }
                ]
            }
        ]
    },
    {
        "id": "6c5964bb54144358a13daf06946975ba",
        "word": "national convention",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌnæʃnəl kənˈvenʃn/",
            "us": "/ˌnæʃnəl kənˈvenʃn/"
        },
        "nearby": [
            {
                "word": "the National Consumer Council",
                "pos": ""
            },
            {
                "word": "National Consumers League",
                "pos": ""
            },
            {
                "word": "national convention",
                "pos": "noun"
            },
            {
                "word": "national costume",
                "pos": "noun"
            },
            {
                "word": "the National Crime Agency",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a meeting held by a political party, especially in the US, to choose a candidate to take part in the election for President",
                    "vi": "một cuộc họp được tổ chức bởi một đảng chính trị, đặc biệt là ở Hoa Kỳ, để chọn một ứng cử viên tham gia tranh cử Tổng thống"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "d441fc8d26aa4736804b733f5b02040d",
        "word": "off year",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɒf jɪə(r)/",
            "us": "/ˈɔːf jɪr/"
        },
        "nearby": [
            {
                "word": "off-white",
                "pos": "adjective"
            },
            {
                "word": "off-white",
                "pos": "noun"
            },
            {
                "word": "off year",
                "pos": "noun"
            },
            {
                "word": "off-year",
                "pos": "adjective"
            },
            {
                "word": "Ofgem",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a year in which there are no important elections, especially no election for president",
                    "vi": "một năm mà không có cuộc bầu cử quan trọng nào, đặc biệt là không có cuộc bầu cử tổng thống"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "5e2b0ab3467247cb8794404aacac3d88",
        "word": "outgoing",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌaʊtˈɡəʊɪŋ/",
            "us": "/ˌaʊtˈɡəʊɪŋ/"
        },
        "nearby": [
            {
                "word": "outflow",
                "pos": "noun"
            },
            {
                "word": "outfox",
                "pos": "verb"
            },
            {
                "word": "outgoing",
                "pos": "adjective"
            },
            {
                "word": "outgoings",
                "pos": "noun"
            },
            {
                "word": "out-group",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "liking to meet other people, enjoying their company and being friendly towards them",
                    "vi": "thích gặp gỡ người khác, thích bầu bạn và thân thiện với họ"
                },
                "examples": [
                    {
                        "en": "an outgoing personality",
                        "vi": "một tính cách hướng ngoại"
                    },
                    {
                        "en": "She was always cheerful and outgoing.",
                        "vi": "Cô ấy luôn vui vẻ và hướng ngoại."
                    },
                    {
                        "en": "I’ve become more confident and outgoing.",
                        "vi": "Tôi trở nên tự tin hơn và cởi mở hơn."
                    }
                ]
            },
            {
                "define": {
                    "en": "leaving the position of responsibility mentioned",
                    "vi": "rời khỏi vị trí trách nhiệm đã đề cập"
                },
                "examples": [
                    {
                        "en": "the outgoing president/government",
                        "vi": "tổng thống sắp mãn nhiệm / chính phủ"
                    }
                ]
            },
            {
                "define": {
                    "en": "going away from a particular place rather than arriving in it",
                    "vi": "đi khỏi một nơi cụ thể hơn là đến đó"
                },
                "examples": [
                    {
                        "en": "This telephone should be used for outgoing calls.",
                        "vi": "Điện thoại này nên được sử dụng cho các cuộc gọi đi."
                    },
                    {
                        "en": "outgoing flights/passengers",
                        "vi": "chuyến bay đi / hành khách"
                    },
                    {
                        "en": "the outgoing tide",
                        "vi": "thủy triều đi ra"
                    }
                ]
            }
        ]
    },
    {
        "id": "475acbe7df4e439ab9a6cd21bb0fd275",
        "word": "overall majority",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌəʊvərɔːl məˈdʒɒrəti/",
            "us": "/ˌəʊvərɔːl məˈdʒɔːrəti/"
        },
        "nearby": [
            {
                "word": "overall",
                "pos": "adverb"
            },
            {
                "word": "overall",
                "pos": "noun"
            },
            {
                "word": "overall majority",
                "pos": "noun"
            },
            {
                "word": "overambitious",
                "pos": "adjective"
            },
            {
                "word": "overarching",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "more votes in an election or vote than all the other people or parties together",
                    "vi": "nhiều phiếu bầu trong một cuộc bầu cử hoặc phiếu bầu hơn tất cả những người hoặc đảng phái khác cùng nhau"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the difference between the number of members that the government has in a parliament and the number that all the other political parties have together",
                    "vi": "sự khác biệt giữa số lượng thành viên mà chính phủ có trong nghị viện và số lượng mà tất cả các đảng chính trị khác cùng có"
                },
                "examples": [
                    {
                        "en": "a huge 101-seat overall majority",
                        "vi": "đa số tổng thể 101 chỗ"
                    }
                ]
            }
        ]
    },
    {
        "id": "6da3d450a5b24976b8e45cea65a53dc5",
        "word": "polling booth",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpəʊlɪŋ buːð/",
            "us": "/ˈpəʊlɪŋ buːθ/"
        },
        "nearby": [
            {
                "word": "pollination",
                "pos": "noun"
            },
            {
                "word": "polling",
                "pos": "noun"
            },
            {
                "word": "polling booth",
                "pos": "noun"
            },
            {
                "word": "polling day",
                "pos": "noun"
            },
            {
                "word": "polling station",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small place in a polling station, separated from the surrounding area, where people vote by marking a card, etc.",
                    "vi": "một địa điểm nhỏ trong điểm bỏ phiếu, ngăn cách với khu vực xung quanh, nơi mọi người bỏ phiếu bằng cách đánh dấu một thẻ, v.v."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "407b800ec1874c16ba87e7f7828c1953",
        "word": "polling day",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpəʊlɪŋ deɪ/",
            "us": "/ˈpəʊlɪŋ deɪ/"
        },
        "nearby": [
            {
                "word": "polling",
                "pos": "noun"
            },
            {
                "word": "polling booth",
                "pos": "noun"
            },
            {
                "word": "polling day",
                "pos": "noun"
            },
            {
                "word": "polling station",
                "pos": "noun"
            },
            {
                "word": "polliwog",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a day on which people vote in an election",
                    "vi": "một ngày mà mọi người bỏ phiếu trong một cuộc bầu cử"
                },
                "examples": [
                    {
                        "en": "a week before polling day",
                        "vi": "một tuần trước ngày bỏ phiếu"
                    }
                ]
            }
        ]
    },
    {
        "id": "2525975529fe4e8fa635b001151db058",
        "word": "polling station",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpəʊlɪŋ steɪʃn/",
            "us": "/ˈpəʊlɪŋ steɪʃn/"
        },
        "nearby": [
            {
                "word": "polling booth",
                "pos": "noun"
            },
            {
                "word": "polling day",
                "pos": "noun"
            },
            {
                "word": "polling station",
                "pos": "noun"
            },
            {
                "word": "polliwog",
                "pos": "noun"
            },
            {
                "word": "Jackson Pollock",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a building where people go to vote in an election",
                    "vi": "một tòa nhà nơi mọi người đi bỏ phiếu trong một cuộc bầu cử"
                },
                "examples": [
                    {
                        "en": "I went into a polling station and cast my vote.",
                        "vi": "Tôi đã đến một điểm bỏ phiếu và bỏ phiếu của mình."
                    }
                ]
            }
        ]
    },
    {
        "id": "7a5acf17b909434c94d56d09ff6c1f3f",
        "word": "popular vote",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌpɒpjələ ˈvəʊt/",
            "us": "/ˌpɑːpjələr ˈvəʊt/"
        },
        "nearby": [
            {
                "word": "popularize",
                "pos": "verb"
            },
            {
                "word": "popularly",
                "pos": "adverb"
            },
            {
                "word": "popular vote",
                "pos": "noun"
            },
            {
                "word": "populate",
                "pos": "verb"
            },
            {
                "word": "population",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act of voting by the people in a country or an area who have the right to vote",
                    "vi": "hành động bỏ phiếu của người dân trong một quốc gia hoặc một khu vực có quyền bầu cử"
                },
                "examples": [
                    {
                        "en": "The head of government is the prime minister, elected by popular vote for a four-year term.",
                        "vi": "Người đứng đầu chính phủ là thủ tướng, được bầu bằng phổ thông đầu phiếu với nhiệm kỳ 4 năm."
                    }
                ]
            },
            {
                "define": {
                    "en": "the choice expressed in an election by the majority of people who vote (but which may not necessarily determine who wins the election, depending on the system used)",
                    "vi": "sự lựa chọn được thể hiện trong một cuộc bầu cử bởi đa số những người bỏ phiếu (nhưng có thể không nhất thiết xác định ai thắng cuộc bầu cử, tùy thuộc vào hệ thống được sử dụng)"
                },
                "examples": [
                    {
                        "en": "It is possible to win the popular vote but still lose the electoral vote.",
                        "vi": "Có thể trúng cử phổ thông nhưng vẫn thua cử tri đoàn."
                    }
                ]
            }
        ]
    },
    {
        "id": "d3816cbb91f3466697bd681c179d0620",
        "word": "postal vote",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpəʊstl vəʊt/",
            "us": "/ˈpəʊstl vəʊt/"
        },
        "nearby": [
            {
                "word": "postal order",
                "pos": "noun"
            },
            {
                "word": "postal service",
                "pos": "noun"
            },
            {
                "word": "postal vote",
                "pos": "noun"
            },
            {
                "word": "postbag",
                "pos": "noun"
            },
            {
                "word": "postbox",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a vote in an election that you can send when you cannot be present",
                    "vi": "một lá phiếu trong một cuộc bầu cử mà bạn có thể gửi khi bạn không thể có mặt"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "2c12e0c8d1b84367ab7f8ba672df23c9",
        "word": "primary",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpraɪməri/",
            "us": "/ˈpraɪmeri/"
        },
        "nearby": [
            {
                "word": "primarily",
                "pos": "adverb"
            },
            {
                "word": "primary",
                "pos": "adjective"
            },
            {
                "word": "primary",
                "pos": "noun"
            },
            {
                "word": "primary care",
                "pos": "noun"
            },
            {
                "word": "primary care physician",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "(in the US) an election in which people in a particular area vote to choose a candidate for a future important election",
                    "vi": "(ở Hoa Kỳ) một cuộc bầu cử trong đó mọi người trong một khu vực cụ thể bỏ phiếu để chọn một ứng cử viên cho một cuộc bầu cử quan trọng trong tương lai"
                },
                "examples": [
                    {
                        "en": "the Illinois primary",
                        "vi": "trường tiểu học Illinois"
                    },
                    {
                        "en": "the presidential primaries",
                        "vi": "bầu cử sơ bộ tổng thống"
                    },
                    {
                        "en": "He ran in the open primary for election as a state senator.",
                        "vi": "Ông đã tranh cử trong cuộc bầu cử sơ bộ mở với tư cách là thượng nghị sĩ tiểu bang."
                    },
                    {
                        "en": "the next round of primaries",
                        "vi": "vòng bầu cử sơ bộ tiếp theo"
                    }
                ]
            }
        ]
    },
    {
        "id": "c4f44e94da704824a53f90dceabcd062",
        "word": "psephologist",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/siˈfɒlədʒɪst/",
            "us": "/siˈfɑːlədʒɪst/"
        },
        "nearby": [
            {
                "word": "PSAT",
                "pos": "noun"
            },
            {
                "word": "PSBR",
                "pos": ""
            },
            {
                "word": "psephologist",
                "pos": "noun"
            },
            {
                "word": "psephology",
                "pos": "noun"
            },
            {
                "word": "pseud",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who studies how people vote in elections",
                    "vi": "một người nghiên cứu cách mọi người bỏ phiếu trong các cuộc bầu cử"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "e3c527af2d4d42adb871ff64e90931c7",
        "word": "psephology",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/siˈfɒlədʒi/",
            "us": "/siˈfɑːlədʒi/"
        },
        "nearby": [
            {
                "word": "PSBR",
                "pos": ""
            },
            {
                "word": "psephologist",
                "pos": "noun"
            },
            {
                "word": "psephology",
                "pos": "noun"
            },
            {
                "word": "pseud",
                "pos": "adjective"
            },
            {
                "word": "pseud",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the study of how people vote in elections",
                    "vi": "nghiên cứu về cách mọi người bỏ phiếu trong các cuộc bầu cử"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "e4d86770ca24424ba48f6f750c9dac06",
        "word": "push poll",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpʊʃ pəʊl/",
            "us": "/ˈpʊʃ pəʊl/"
        },
        "nearby": [
            {
                "word": "pushover",
                "pos": "noun"
            },
            {
                "word": "pushpin",
                "pos": "noun"
            },
            {
                "word": "push poll",
                "pos": "noun"
            },
            {
                "word": "push polling",
                "pos": "noun"
            },
            {
                "word": "push-start",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a way of trying to influence the way people vote by giving them information, often something bad about a particular candidate, while seeming to be asking their opinion",
                    "vi": "một cách cố gắng ảnh hưởng đến cách mọi người bỏ phiếu bằng cách cung cấp cho họ thông tin, thường là điều gì đó không tốt về một ứng cử viên cụ thể, trong khi dường như đang hỏi ý kiến của họ"
                },
                "examples": [
                    {
                        "en": "The calls were a push poll against the rival candidate.",
                        "vi": "Các cuộc gọi là một cuộc thăm dò ý kiến chống lại ứng cử viên đối thủ."
                    }
                ]
            }
        ]
    },
    {
        "id": "50d2019a293848b4a536465158aed420",
        "word": "push polling",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpʊʃ pəʊlɪŋ/",
            "us": "/ˈpʊʃ pəʊlɪŋ/"
        },
        "nearby": [
            {
                "word": "pushpin",
                "pos": "noun"
            },
            {
                "word": "push poll",
                "pos": "noun"
            },
            {
                "word": "push polling",
                "pos": "noun"
            },
            {
                "word": "push-start",
                "pos": "noun"
            },
            {
                "word": "push-start",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the activity of trying to influence the way people vote by giving them information, often something bad about a particular candidate, while seeming to be asking their opinion",
                    "vi": "hoạt động cố gắng ảnh hưởng đến cách mọi người bỏ phiếu bằng cách cung cấp cho họ thông tin, thường là điều gì đó không tốt về một ứng cử viên cụ thể, trong khi dường như đang hỏi ý kiến của họ"
                },
                "examples": [
                    {
                        "en": "allegations of push polling",
                        "vi": "cáo buộc về bỏ phiếu đẩy"
                    }
                ]
            }
        ]
    },
    {
        "id": "3652cdce8a524a9885b1f850059f2c1a",
        "word": "running mate",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈrʌnɪŋ meɪt/",
            "us": "/ˈrʌnɪŋ meɪt/"
        },
        "nearby": [
            {
                "word": "running dog",
                "pos": "noun"
            },
            {
                "word": "running head",
                "pos": "noun"
            },
            {
                "word": "running mate",
                "pos": "noun"
            },
            {
                "word": "running order",
                "pos": "noun"
            },
            {
                "word": "running repairs",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "(in the US) a person who is chosen by the candidate in an election, especially that for president, to support them and to have the next highest political position if they win",
                    "vi": "(ở Hoa Kỳ) một người được ứng cử viên chọn trong một cuộc bầu cử, đặc biệt là ứng cử viên tổng thống, để ủng hộ họ và có vị trí chính trị cao nhất tiếp theo nếu họ chiến thắng"
                },
                "examples": [
                    {
                        "en": "The presidential nominee was advised to choose a woman as a running mate.",
                        "vi": "Ứng cử viên tổng thống được khuyên nên chọn một phụ nữ làm bạn đời tranh cử."
                    }
                ]
            }
        ]
    },
    {
        "id": "542981e58aae4fcf8ab6f15acc8fe93e",
        "word": "safe seat",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌseɪf ˈsiːt/",
            "us": "/ˌseɪf ˈsiːt/"
        },
        "nearby": [
            {
                "word": "the safe period",
                "pos": "noun"
            },
            {
                "word": "safe room",
                "pos": "noun"
            },
            {
                "word": "safe seat",
                "pos": "noun"
            },
            {
                "word": "safe sex",
                "pos": "noun"
            },
            {
                "word": "safe space",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a constituency where a particular political party has a lot of support and their candidate is unlikely to be defeated in an election",
                    "vi": "một khu vực bầu cử nơi một đảng chính trị cụ thể có rất nhiều sự ủng hộ và ứng cử viên của họ khó có thể bị đánh bại trong một cuộc bầu cử"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "eb2c236d0e134053b13487e0ea57c2c9",
        "word": "soft money",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌsɒft ˈmʌni/",
            "us": "/ˌsɔːft ˈmʌni/"
        },
        "nearby": [
            {
                "word": "softly-softly",
                "pos": "adjective"
            },
            {
                "word": "softly-spoken",
                "pos": "adjective"
            },
            {
                "word": "soft money",
                "pos": "noun"
            },
            {
                "word": "softness",
                "pos": "noun"
            },
            {
                "word": "soft pedal",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "money that is donated to a political party that is not intended to promote a particular candidate and where the maximum amount that can be given is not controlled by law",
                    "vi": "tiền được quyên góp cho một đảng chính trị không nhằm mục đích thúc đẩy một ứng cử viên cụ thể và trong đó số tiền tối đa có thể được cung cấp không bị pháp luật kiểm soát"
                },
                "examples": [
                    {
                        "en": "Unregulated soft money contributions made up the bulk of donations.",
                        "vi": "Các khoản đóng góp bằng tiền mềm không được kiểm soát đã tạo nên phần lớn các khoản đóng góp."
                    },
                    {
                        "en": "Election law bars parties from using soft money in campaigns.",
                        "vi": "Luật bầu cử cấm các bên sử dụng tiền mềm trong các chiến dịch."
                    }
                ]
            }
        ]
    },
    {
        "id": "c3809322cd684737bae456bbd05d3aba",
        "word": "straw poll",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌstrɔː ˈpəʊl/",
            "us": "/ˌstrɔː ˈpəʊl/"
        },
        "nearby": [
            {
                "word": "straw-coloured",
                "pos": "adjective"
            },
            {
                "word": "straw man",
                "pos": "noun"
            },
            {
                "word": "straw poll",
                "pos": "noun"
            },
            {
                "word": "stray",
                "pos": "verb"
            },
            {
                "word": "stray",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an occasion when a number of people are asked in an informal way to give their opinion about something or to say how they are likely to vote in an election",
                    "vi": "một dịp khi một số người được hỏi một cách thân mật để đưa ra ý kiến của họ về điều gì đó hoặc nói cách họ có khả năng bỏ phiếu trong một cuộc bầu cử"
                },
                "examples": [
                    {
                        "en": "I took a quick straw poll among my colleagues to see how many agreed.",
                        "vi": "Tôi đã thực hiện một cuộc thăm dò nhanh giữa các đồng nghiệp của mình để xem có bao nhiêu người đồng ý."
                    },
                    {
                        "en": "It’s only a straw poll, but it suggests that most people are in favour of stricter regulations.",
                        "vi": "Nó chỉ là một cuộc thăm dò rơm, nhưng nó cho thấy rằng hầu hết mọi người ủng hộ các quy định chặt chẽ hơn."
                    }
                ]
            }
        ]
    },
    {
        "id": "7ed74bcb142e486cb9ff5a0abbe49bc8",
        "word": "swing state",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌswɪŋ ˈsteɪt/",
            "us": "/ˌswɪŋ ˈsteɪt/"
        },
        "nearby": [
            {
                "word": "swing set",
                "pos": "noun"
            },
            {
                "word": "swing shift",
                "pos": "noun"
            },
            {
                "word": "swing state",
                "pos": "noun"
            },
            {
                "word": "swing vote",
                "pos": "noun"
            },
            {
                "word": "swing voter",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "(in an election for president in the US) a state where none of the candidates can be certain of getting the most support",
                    "vi": "(trong một cuộc bầu cử tổng thống ở Hoa Kỳ) một tiểu bang mà không ứng cử viên nào có thể chắc chắn nhận được nhiều sự ủng hộ nhất"
                },
                "examples": [
                    {
                        "en": "Arizona may be a swing state.",
                        "vi": "Arizona có thể là một tiểu bang đu dây."
                    },
                    {
                        "en": "swing state Democrats",
                        "vi": "xoay chuyển đảng Dân chủ tiểu bang"
                    }
                ]
            }
        ]
    },
    {
        "id": "ad4d6e4cc7a340cd8ad446c7449a7dd7",
        "word": "swing vote",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌswɪŋ ˈvəʊt/",
            "us": "/ˌswɪŋ ˈvəʊt/"
        },
        "nearby": [
            {
                "word": "swing shift",
                "pos": "noun"
            },
            {
                "word": "swing state",
                "pos": "noun"
            },
            {
                "word": "swing vote",
                "pos": "noun"
            },
            {
                "word": "swing voter",
                "pos": "noun"
            },
            {
                "word": "swing-wing",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the votes of people who do not always vote for the same political party and have not decided which party to vote for in an election",
                    "vi": "phiếu bầu của những người không phải lúc nào cũng bỏ phiếu cho cùng một đảng chính trị và không quyết định đảng nào sẽ bỏ phiếu trong một cuộc bầu cử"
                },
                "examples": [
                    {
                        "en": "his appeal to the crucial swing vote",
                        "vi": "lời kêu gọi của anh ấy đối với cuộc bỏ phiếu xoay quan trọng"
                    },
                    {
                        "en": "the shrinking of the swing vote",
                        "vi": "sự thu hẹp của cuộc bỏ phiếu xoay"
                    },
                    {
                        "en": "Catholics are important swing votes in this election.",
                        "vi": "Người Công giáo là những người có số phiếu xoay vòng quan trọng trong cuộc bầu cử này."
                    }
                ]
            }
        ]
    },
    {
        "id": "3c57a827997549deb2b68a7e13cb3744",
        "word": "swing voter",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌswɪŋ ˈvəʊtə(r)/",
            "us": "/ˌswɪŋ ˈvəʊtər/"
        },
        "nearby": [
            {
                "word": "swing state",
                "pos": "noun"
            },
            {
                "word": "swing vote",
                "pos": "noun"
            },
            {
                "word": "swing voter",
                "pos": "noun"
            },
            {
                "word": "swing-wing",
                "pos": "adjective"
            },
            {
                "word": "swipe",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who does not always vote for the same political party or who has not decided which party to vote for in an election",
                    "vi": "một người không phải lúc nào cũng bỏ phiếu cho cùng một chính đảng hoặc người không quyết định sẽ bỏ phiếu cho đảng nào trong một cuộc bầu cử"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "0ae840566f7c44e5b411c3390980546f",
        "word": "ticket",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈtɪkɪt/",
            "us": "/ˈtɪkɪt/"
        },
        "nearby": [
            {
                "word": "ticker tape",
                "pos": "noun"
            },
            {
                "word": "ticker-tape parade",
                "pos": "noun"
            },
            {
                "word": "ticket",
                "pos": "noun"
            },
            {
                "word": "ticket",
                "pos": "verb"
            },
            {
                "word": "ticketed",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a printed piece of paper, or a message or image received on your phone or computer, that gives you the right to travel on a particular bus, train, etc. or to go into a theatre, etc.",
                    "vi": "một mẩu giấy in, hoặc một tin nhắn hoặc hình ảnh nhận được trên điện thoại hoặc máy tính của bạn, cho phép bạn đi trên một chuyến xe buýt, xe lửa, v.v. hoặc đi vào rạp hát, v.v."
                },
                "examples": [
                    {
                        "en": "a plane/bus/train ticket",
                        "vi": "vé máy bay / xe buýt / xe lửa"
                    },
                    {
                        "en": "an airline ticket",
                        "vi": "một vé máy bay"
                    },
                    {
                        "en": "a theatre/concert ticket",
                        "vi": "một nhà hát / vé hòa nhạc"
                    },
                    {
                        "en": "ticket for/to something free tickets to the show",
                        "vi": "vé cho / đến một cái gì đó miễn phí vé xem chương trình"
                    },
                    {
                        "en": "I bought a ticket for the concert.",
                        "vi": "Tôi đã mua một vé cho buổi hòa nhạc."
                    },
                    {
                        "en": "I booked a one-way ticket to Montreal.",
                        "vi": "Tôi đã đặt vé một chiều đến Montreal."
                    },
                    {
                        "en": "Tickets are available from the Arts Centre at £5.00.",
                        "vi": "Vé có sẵn từ Trung tâm Nghệ thuật với giá £ 5,00."
                    },
                    {
                        "en": "a one-way/return ticket",
                        "vi": "vé một chiều / khứ hồi"
                    },
                    {
                        "en": "a ticket office",
                        "vi": "một văn phòng vé"
                    },
                    {
                        "en": "a ticket holder (= a person who has a ticket)",
                        "vi": "người giữ vé (= người có vé)"
                    },
                    {
                        "en": "a ticket machine/collector/inspector",
                        "vi": "một máy bán vé / người thu tiền / người kiểm tra"
                    },
                    {
                        "en": "They raised over £40,000 in ticket sales alone.",
                        "vi": "Chỉ riêng họ đã thu được hơn 40.000 bảng Anh tiền bán vé."
                    },
                    {
                        "en": "Ticket prices range from $9 for adults to $4.75 for children.",
                        "vi": "Giá vé từ $ 9 cho người lớn đến $ 4,75 cho trẻ em."
                    },
                    {
                        "en": "Tickets can also be purchased by phone.",
                        "vi": "Vé cũng có thể được mua qua điện thoại."
                    },
                    {
                        "en": "(figurative) She hoped that getting this job would finally be her ticket to success.",
                        "vi": "(nghĩa bóng) Cô ấy hy vọng rằng cuối cùng nhận được công việc này sẽ là tấm vé thành công cho cô ấy."
                    },
                    {
                        "en": "by ticket Admission is by ticket only.",
                        "vi": "bằng vé Vào cửa chỉ bằng vé."
                    }
                ]
            },
            {
                "define": {
                    "en": "a printed piece of paper with a number or numbers on it, that you buy in order to have the chance of winning a prize if the number or numbers are later chosen",
                    "vi": "một mảnh giấy in sẵn một con số hoặc các con số mà bạn mua để có cơ hội trúng giải nếu số hoặc các con số được chọn sau đó"
                },
                "examples": [
                    {
                        "en": "a lottery/raffle ticket",
                        "vi": "một vé xổ số / xổ số"
                    },
                    {
                        "en": "There are three winning tickets.",
                        "vi": "Có ba vé trúng thưởng."
                    },
                    {
                        "en": "I own a little store that sells lottery tickets.",
                        "vi": "Tôi sở hữu một cửa hàng nhỏ bán vé số."
                    },
                    {
                        "en": "Raffle tickets cost just $10.",
                        "vi": "Vé xổ số chỉ có giá 10 đô la."
                    }
                ]
            },
            {
                "define": {
                    "en": "a label that is attached to something in a shop giving details of its price, size, etc.",
                    "vi": "một nhãn được gắn vào một thứ gì đó trong cửa hàng cho biết chi tiết về giá cả, kích cỡ của nó, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "an official notice that orders you to pay a fine because you have done something illegal while driving or parking your car",
                    "vi": "một thông báo chính thức yêu cầu bạn phải trả tiền phạt vì bạn đã làm điều gì đó bất hợp pháp khi lái xe hoặc đỗ xe của mình"
                },
                "examples": [
                    {
                        "en": "a speeding ticket",
                        "vi": "một vé quá tốc độ"
                    },
                    {
                        "en": "The police officer gave us a ticket for going through a red light.",
                        "vi": "Anh cảnh sát đưa cho chúng tôi một cái vé vì vượt đèn đỏ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a list of candidates that are supported by a particular political party in an election",
                    "vi": "danh sách các ứng cử viên được một đảng chính trị cụ thể ủng hộ trong một cuộc bầu cử"
                },
                "examples": [
                    {
                        "en": "She ran for office on the Democratic ticket.",
                        "vi": "Cô ấy đã tranh cử vào chức vụ của đảng Dân chủ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a request for a problem to be fixed that is entered into a system that manages such requests",
                    "vi": "yêu cầu khắc phục sự cố được nhập vào hệ thống quản lý các yêu cầu đó"
                },
                "examples": [
                    {
                        "en": "Open a ticket with the Help Desk.",
                        "vi": "Mở một vé với Bộ phận trợ giúp."
                    }
                ]
            },
            {
                "define": {
                    "en": "be the end",
                    "vi": "là kết thúc"
                },
                "examples": [
                    {
                        "en": "It's tickets for the team that loses.",
                        "vi": "Đó là vé cho đội thua cuộc."
                    }
                ]
            },
            {
                "define": {
                    "en": "exactly what is needed in a particular situation",
                    "vi": "chính xác những gì cần thiết trong một tình huống cụ thể"
                },
                "examples": [
                    {
                        "en": "That cup of tea was just the ticket.",
                        "vi": "Chén trà đó chỉ là tấm vé."
                    }
                ]
            },
            {
                "define": {
                    "en": "to vote for candidates from more than one party",
                    "vi": "bỏ phiếu cho các ứng cử viên từ nhiều đảng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to say that something is just what is needed or that everything is just right",
                    "vi": "được sử dụng để nói rằng một cái gì đó chỉ là những gì cần thiết hoặc rằng mọi thứ đều vừa phải"
                },
                "examples": [
                    {
                        "en": "Are we all packed and ready to go? That’s the ticket.",
                        "vi": "Tất cả chúng ta đã đóng gói và sẵn sàng đi chưa? Đó là vé."
                    }
                ]
            }
        ]
    },
    {
        "id": "0e8af46fbc02434bbe1708342b8ae19c",
        "word": "voting booth",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈvəʊtɪŋ buːð/",
            "us": "/ˈvəʊtɪŋ buːθ/"
        },
        "nearby": [
            {
                "word": "vote through",
                "pos": "phrasal verb"
            },
            {
                "word": "voting",
                "pos": "noun"
            },
            {
                "word": "voting booth",
                "pos": "noun"
            },
            {
                "word": "voting machine",
                "pos": "noun"
            },
            {
                "word": "the Voting Rights Act of 1965",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small place in a polling station, separated from the surrounding area, where people vote by marking a card, etc.",
                    "vi": "một địa điểm nhỏ trong điểm bỏ phiếu, ngăn cách với khu vực xung quanh, nơi mọi người bỏ phiếu bằng cách đánh dấu một thẻ, v.v."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "fde150f3d448431aa016251938b2a6bf",
        "word": "voting machine",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈvəʊtɪŋ məʃiːn/",
            "us": "/ˈvəʊtɪŋ məʃiːn/"
        },
        "nearby": [
            {
                "word": "voting",
                "pos": "noun"
            },
            {
                "word": "voting booth",
                "pos": "noun"
            },
            {
                "word": "voting machine",
                "pos": "noun"
            },
            {
                "word": "the Voting Rights Act of 1965",
                "pos": ""
            },
            {
                "word": "votive",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a machine in which votes can be recorded automatically, used, for example, in the US",
                    "vi": "một máy trong đó phiếu bầu có thể được ghi lại tự động, được sử dụng, chẳng hạn như ở Hoa Kỳ"
                },
                "examples": [
                    {
                        "en": "the use of electronic voting machines in the November elections",
                        "vi": "việc sử dụng máy bỏ phiếu điện tử trong cuộc bầu cử tháng 11"
                    }
                ]
            }
        ]
    }
]