[
    {
        "id": "bd17aedaeab8486aa58edf6b52a0be1a",
        "title": "My first day at school",
        "content": "My mother accompanied me to school on the first day. Other parents accompanied their children as well. We all waited in front of the school office.\nSoon a teacher came and led us to some classrooms. There we were put into four separate classes. This was when some children began to cry as the parents were not allowed into the classrooms. I did not cry because I had been to kindergarten before. Actually my mother went home soon after for she knew I would be all right.\n\nIt was an enjoyable time for me as I got to know my new classmates. The teacher was very busy writing down our particulars so we had plenty of time to ourselves.\n\nMeantime some children continued to sob while their parents looked in anxiously through the windows.\n\nSoon recess came. Some of us headed for the tuck-shop while the rest headed for their parents. I bought a drink with the money my mother gave me. Getting to know my new friends had made me thirsty.\n\nAfter recess we went back to out classroom and my new friends and I managed to coax two boys to stop crying. In fact, soon we were laughing and playing together. Once in a while the teacher had to tell us to keep quiet as we were making too much noise.\n\nStill some parents looked in anxiously through the windows.\n\nFinally the bell rang for us to go home. Some of us were very relieved to be reunited with our parents. I too was glad to see my mother waiting for me at the school gate. I had made many friends. It had been a wonderful first day at school."
    },
    {
        "id": "9376a3596fa243368f34d0954541316c",
        "title": "Road  safety",
        "content": "Everyday many people are involved in road accidents. Some are killed. Many more are injured or maimed. So it is important for us to learn to use the roads properly and safely. No sane person would like to be involved in an accident.\nAs the roads are very busy nowadays, we should be very careful when crossing one. It is safer to use a pedestrian crossing or an overhead bridge whenever one is available. Never cross a road by dashing across it. That is inviting trouble. If there are no crossings, then we must look carefully right and left and cross only when it is safe to do so.\n\nSome of us take the bus to school. It is important that we do not try to get on or off a bus while it is still moving. I tried to get on a moving bus once. It dragged me a short distance and nearly ran over me. I was lucky to escape with only some scratches on my legs. Also we must not fool around while in the bus. A suddenly lurch can send us knocking our heads against something hard.\n\nUsing a bicycle can be dangerous too. We must pay attention on the road and never cycle too far out to the middle of the road. We must obey all traffic rules. Also we must make sure our bicycles are in good condition with working brakes, lights etc.\n\nThese are some things we can do to avoid accidents. However there is no guarantee that we will never be involved in one. The important thing is to stay alert at all times while using the roads. We must know what is happening around us. In that way we can take necessary action to avoid danger whenever we see one. Road safety is very much up to how we use the roads. Use them carefully and we may be able to use them for a long time. Use them carelessly and we may never be able to use them again."
    },
    {
        "id": "d169d0aa10a74ede82ce19f2be9dd88a",
        "title": "A visit to the dentist",
        "content": "My tooth hurt through the night. I had to take a painkiller to lessen the pain. Worst of all I did not get a wink of sleep the whole night through.\n\nThe next morning. I told my mother about my toothache. It was obvious I could not go to school. So instead she took me to the dentist. I was horrified, but I had no choice.\n\nAt nine o'clock we waited outside the dentist's office. The nurse came and opened the door. I was the first patient. She wrote down my particulars and told me to wait a moment. The dentist had not arrived yet. Meanwhile the tooth still ached like mad.\n\nThe burly dentist arrived and I was ushered to the dentist's chair. Normally I would run away from the frightening surgery with all its horrible drills and pliers, but I did not. I had to get the offending tooth out.\n\nSo I sat down on the reclining chair while the dentist kept saying some reassuring words. I relaxed somewhat. He asked me to open my mouth. I did so. He said that the tooth had to come out. I nodded dumbly in reply.\n\nI felt a slight prick of pain when he gave me an injection, but that was nothing compared to the toothache. Soon, miraculously, all pain disappeared. The anaesthetic definitely worked very quickly. Then before I knew it, the dentist told me that I could go. I looked at him quizzedly and he told me he had already pull the tooth out. What wonder, I did not even feel it.\n\nThe dentist put a wad of cotton over the wound and he told me to keep my mouth shut for a while. I nodded, smiled and went out into the waiting room where my mother was waiting for me. The visit to the dentist was not too bad after all."
    },
    {
        "id": "122b998ed5c04be0a72de4388723903d",
        "title": "Caught in a storm",
        "content": "Black clouds gathered above us, but we were too intent on playing football. We hoped that the clouds would go away so that we could continue playing.\nOur hopes were dashed when suddenly heavy rain began to pour. In a few seconds we were all soaked to the skin. To make matters worst, lightning flashed dangerously close to us. The deafening thunder and howling wind did not help either.\n\nWe ran towards a large tree under which we had parked our bicycles. The tree provided some shelter from the rain and we were tempted to remain under it. However we knew that it was dangerous to stay under a tree during a thunderstorm. So we got on our bicycles and pedalled off.\n\nThere was no other shelter available nearby. So I, for one, decided to go home. Since I was already completely wet, I might was well to go home instead to seeking shelter.\n\nIt was just about the fiercest storm I had ever been in. The driving rain made cycling difficult as I could not see more that a couple of metres in front of me. A car flashed past me. It was too close for comfort. Perhaps the driver did not even see me. So I thought it was better to stop somewhere before I got hit by another car.\n\nLuckily I found a bus-stop with a roof. I hurried gladly under the roof even though I had to share it with a dozen other people who were also soaked to the skin. It was a bit of a squeeze but no one complained.\n\nFor an hour the storm lashed everything around us. We were silent spectators to an awesome display of power by nature. I felt very small and vulnerable, even afraid; but I could do nothing but watch.\n\nFinally the rain slowed down to a drizzle and the wind died down. I could still hear distant thunder but the worst of the storm was over. So happily I got on my bicycle and pedalled home."
    },
    {
        "id": "5bee7c2c8d764f049466300b5d32b507",
        "title": "An  unforgettable  experience",
        "content": "Carrying a passenger on a bicycle is an offence punishable by law. Everyone knows that but still some of us do it.\nI had done it many times before until something happened to teach me never to do it again. It was not the police. Rather it was an unforgettable, and unpleasant, experience.\n\nIt happened one evening when my friend Segaran and I wanted to go and visit another friend who lived some distance away. I had a bicycle. Segaran did not. So, as usual, he sat side-saddle on the horizontal bar of the bicycle while I pedalled. We had done it many times before, so it should not be any problem.\n\nNear my friend's house, we got onto a gravel path made slippery by the recent rain. Still we managed to wobble along, thoroughly enjoying the rough ride.\n\nAs we passed by a stream, I made the mistake of going too near the bank. The rain had softened the soil and it could not hold our combined weight. One moment we were going along merrily, the next we were tumbling head over heels into the stream as the bank gave way beneath us.\n\nSplash! Splash! Splash! We plunged into the river bicycle first, followed by Segaran, then me. Normally the stream is only a few centimetres deep with clear water. When we fell in, it was a metre deep with foul black water. The water prevented us from getting badly injured but we also had to pay the price of gulping some of it. It tasted horrible. Segaran got the worst of it for being sandwiched between the bicycle and me, but it was not too bad. We had only a few cuts and bruises. Our pride was far more hurt.\n\nWe retrieved ourselves and the bicycle from the stream. We were both dirty and soaking wet. Obviously we were in no condition to visit anyone. So we decided to go home.\n\nWe walked all the way home. I had to push the bicycle because its front wheel was bent out of shape. From that moment I vowed never to carry anyone on a bicycle again. Never again do I want to be dirty and wet with cuts and bruises all over my body. Once was enough."
    },
    {
        "id": "8b7cc4fcac764601b9256af5d7dd651c",
        "title": "My  Classmates",
        "content": "We are a noisy lot, that is what our teachers say about us. This is largely due to Ah Keong. He is the noisiest of us all. His voice is like that of a bull frog but volumes louder. It seems that he cannot talk softly. Actually he does not talk, he shouts. Perhaps his living with his family of ten children has something to do with it.\nIn this noisy bunch lives a boy who hardly ever opens his mouth. This is Padma, the boy who sits next to me. He is such a gentle and soft creature that one would think that he is a sissy. This is not so. No one dares call him one for he is a member of the school's Karate Club.\n\nThen there is Doris, our class monitor. She sits right in front of the teacher's table. She is such a model student that all the teachers love her. We all love her for she does not boss us around. She has given up doing that long ago. All she does is to make sure that the teachers have sufficient chalk and that the classroom is clean.\n\nRight at the back of the class sits our class sleepy-head. Mat seems to need more sleep than others. He catches cat-naps in between lessons. The astounding thing is that he can fall asleep almost instantly. The moment the teacher leaves after a lesson, Mat's snores start up and we know he is at it again. Remarkably he wakes up when the next teacher arrives.\n\nEvery class has a clown. Our class has Jack, otherwise known as \"Jacko The Clown\". He is always up to some prank or other, putting tails on the boys' pants, frogs in the girls' desks and powdered chalk on the teacher's chair. So when we hear a girl scream or see men-teachers strolling around with chalk on the seat of their pants, we know that Jacko has struck again.\n\nThe other classmates too have their own unique personalities. Each contributes his or her part to our class. All in all we are a group of young children who perhaps are a bit noisy at times, but on the whole are well-behaved and pleasant to be with."
    },
    {
        "id": "7d7af82231c74c009ce95f182265ea16",
        "title": "My  neighbours",
        "content": "Many of us live in housing estates. I live in one myself. The one thing about living in a housing estate is that we have many neighbours.\nNext to my house on the right lives a family whose parents seem to be always scolding the children. I do not know them very well because they always appear angry. Never a day passes without hearing the children crying and the parents shouting at the top of their voices.\n\nOn the other side of my house, however, lives a very quiet and polite family. Mr. Verghese is a quiet man who seems to manage his family very well. Though he has four children, which is one more than the other family, I never hear him scold his children. So his children never cry. What a wonderful family they are.\n\nFurther down the road is a family whose radio is switched on most of the time, except late at night. His immediate neighbours must have a tough time putting up with the noise of the radio.\n\nThen there is a family whose members seem to live in a world of their own. Many times we have met along the road and not once has any of them even nod his or her head in acknowledgement. They are not blind or deaf. Yet they can walk straight past as if I am not there at all. I would not say that they are unfriendly. I guess they are simply not interested in knowing their neighbours.\n\nOn the opposite side of the road live Mr. Lim and his family. Mr. Lim is a bird-collector. So everyday a dozen or more birds sing melodious tunes right beneath his front porch. It is preferable to the blare of the other neighbour's radio. However the bird droppings can give off an awful stench.\n\nThese are some of the neighbours living near me. There are others that I have yet to meet. However I am careful not to intrude on their privacy. The friendly ones smile or raise their hands. The not-so-friendly ones look away. I have to live among them, friendly or not."
    },
    {
        "id": "7c476c40ecab4f5094888bef063198d1",
        "title": "My favourite time of the day",
        "content": "My favourite time of the day is between 5 p.m. and 7 p.m. This is the time when the sun is setting and the air is cooling down. At this time I either go for a stroll, play some games or sit quietly watching the activities around me.\nSitting quietly doing nothing in particular is what I like most.\n\nThe compound surrounding my house is a fairly large one. So my father has planted many trees in it. Birds of all sorts come to the trees in the evening to sing their sweet songs. I just sit under my favourite rambutan tree and listen to these lovely songs.\n\nHowever I cannot just sit quietly all the time. My parents sometimes ask me to mow the lawn or help them in some gardening tasks. These I do gladly for the air is nice and cool. Working under a hot sun is one thing I do not like. In the evening the sun is soft and gentle. It is pleasant to potter around the garden then.\n\nOther times I might go out for a stroll or play games with my friends.\n\nAgain it is pleasant to stroll around or play games when the sun is not hot in the evening. In fact many people come out of their houses to breathe in the cool evening air and to relax a bit, unless it is raining. This is the time of the day when the playing fields, parks and other recreational areas are filled with people. I guess it is not only my favourite time of the day. It is many people's favourite time as well."
    },
    {
        "id": "af3e8b1e7185480b88c7cef6a24072b6",
        "title": "A Journey by Car",
        "content": "My father bought a new car one day. We were all very excited. He promised to take us to Melaka to visit my grandparents the coming Sunday.\nSunday morning was bright and breezy. We hopped into the brand new car and soon we were heading out of Petaling Jaya towards the expressway. My mother sat in the front passenger seat while my father drove. I sat behind with my younger sister.\n\nAs it was Sunday the roads were not very busy. Soon we were on the expressway travelling at a leisurely pace. My father is a careful driver and he does not drive too fast or dangerously. This proved to be good for there was a speed-trap manned by the police along the expressway. I saw some cars stopped by the police. They had obviously been speeding.\n\nDriving along the expressway tend to be monotonous. I actually fell asleep once we passed Seremban.\n\nWhen I awoke, we were already at the Ayer Keroh toll gate. My father paid the toll and steered the car towards Melaka Town. On the way we passed many interesting sights. My father promised to stop by on our way home. We had to visit our grandparents first.\n\nWe left Ayer Keroh and all its factories behind as we journeyed into the town itself. Like all towns, there were many cars and other vehicles. Also there were many tourists. Melaka has many places of historical interest and thus this was not surprising.\n\nFinally we arrived at my grandparents' house in Klebang Besar. The journey had taken about two hours. We stepped out of the car. My grandparents greeted us happily."
    },
    {
        "id": "b50187b9d38b47538fc6eebb7496c699",
        "title": "A  Picnic by the Sea",
        "content": "Teluk Kemang is about 12 kilometres from Port Dickson town in Negeri Sembilan. It is a popular beach where many people go to and relax on.\nIt was on one of the days of the Chinese New Year holidays that we had a picnic at Teluk Kemang. I went there with my uncle and his family. There were five of us, my uncle, his wife, their two young children and me. My uncle drove us there in his car.\n\nWe arrived there at about ten in the morning. The beach was already crowded with other holiday-makers. Anyhow we managed to get a place in the shade of a large tree and we put our things there. My aunt laid out a mat for us to sit on.\n\nIn double-quick time we were enjoying ourselves in the sea, except my aunt. She just sat on the mat watching us.\n\nThe water was cool and refreshing and I loved splashing it on my cousins. However the hot sun above can be quite uncomfortable. So after about an hour or so, my uncle told us to sit in the shade for a while. The sun was getting increasingly hot. So we reluctantly came out of the sea.\n\nIn the shade of some trees we built some sandcastles.\n\nTime passed so quickly. Soon we heard my aunt calling us to have lunch. We ran to her and helped ourselves to the delicious curry she had brought. Then we had several glasses of ice-cold drink from the Thermos flask.\n\nAfter lunch we played a while more in the sea. The sun was just too hot. So we walked over to one of the hotels nearby and washed ourselves with clean freshwater.\n\nWhen we returned, my aunt had already packed everything in the car. So all of us got into the car and my uncle drove us back home to Seremban."
    },
    {
        "id": "cc3798bc9e8c46e59224bd988b981ae3",
        "title": "A  Nightmare",
        "content": "\"Don't eat just before going to bed !\" my mother used to tell me. \"You might get a nightmare.\" How right she was. I never believed her until it happened to me.\nIt was on a night when I felt hungry just as I was about to go to bed. So I made myself a peanut-butter sandwich and a large cold glass of milk. After consuming them I went to bed.\n\nSoon I drifted off into a troubled sleep. I dreamt that I was with a group of people looking for an old woman. I was not sure why we were looking for her but we all seemed afraid of her. Somehow we had to find her. So there I was, searching high and low for her in frightful places I had never been before. Sometimes I seemed to be flying while at other times I seemed unable to move. The whole atmosphere was one of fear, like a dreadful horror-movie in which I was a victim.\n\nAfter some searching I entered a darkened room and saw a figure sleeping on a bed. As I got nearer the figure suddenly threw away the blanket, got up and stared at me. It was an ugly old woman with shiny golden teeth. She raised her claw-like fingers and walked towards me.\n\nI wanted to run but was unable to. I tried to scream but found that I could not. In horror I struggled and struggled to get away from the frightful woman.\n\nThe next moment I gave a muffled yell and found myself panting on my bed. My goodness, what a horrible nightmare it was! For a minute or so I lay on my bed not daring to close my eyes for fear of falling asleep again and continuing the nightmare. Then I sat up on my bed until the horrible feeling passed. From then on I never eat just before going to sleep."
    },
    {
        "id": "79bff94751ad4339a701dd6bd3e55892",
        "title": "The Mad Woman",
        "content": "I walk a kilometre or so to school every morning. Sometimes I come across a mad woman dressed in a dark dirty sari. She probably has not had a bath for years. Her hair is matted, teeth stained red with betel-nut and eyes blood-shot with the look of madness. I always keep my distance from her for my own safety for I cannot be sure what she will do next. Also she smells terrible up close.\n\nIt is never pleasant when I see her standing by the roadside. She is by no means violent but she has the nasty habit of following people who pass by. Normally when I see her I cross over to the other side of the road just to avoid her. Usually that works. Sometimes she crosses the road too. So I run. Fortunately she cannot run very fast and gives up after a while.\n\nOne morning, as I crossed the road to avoid her, she tried to cross too. I started to run. She started to run too but tripped on her sari. She fell down hard on the road and lay there in a heap. I wanted to keep running but I saw that she was in great danger of being run over by a car. So I ran over to her to pull her to the roadside.\n\nAs much as I disliked it, I had to help her. The other passers-by did not seem to bother. So I held my breath and pull her by her arms towards the roadside. By now people and cars had stopped to watch. No one helped but at last I managed to drag her to safety.\n\nShe opened her eyes and gave me a smile. I could only stare at her dumbly. Then I turned and hurried to school to wash my hands.\n\nI am going to get a bicycle to cycle to school. It is much faster this way. Also I will not have to contend with the mad woman again."
    },
    {
        "id": "f48a1ae333c34bfb8f9089aebd6a7eb7",
        "title": "My  Hobby",
        "content": "My hobby is reading. I read story books, magazines, newspapers and any kind of material that I find interesting.\nThis hobby got started when I was a little boy. I had always wanted my parents to read fairy tales and other stories to me. Soon they got fed up and tired of having to read to me continually. So as soon as I could, I learned to read. I started with simple ABC books. Soon I could read simple fairy tales and other stories. Now I read just about anything that is available.\n\nReading enables me to learn about so many things that I would otherwise not know. I learned about how people lived in bygone days of magic and mystery. I learned about the wonders of the world, space travel, human achievements, gigantic whales, tiny viruses and other fascinating things of our world.\n\nThe wonderful thing about reading is that I do not have to learn things the hard way. For example, I do not have to catch a disease to know that it can kill me. I know the danger so I can avoid it. Also I do not have to go deep into the jungle to learn about the tiger. I can read all about it in a book.\n\nBooks provide the reader with so much information and facts. They have certainly helped me in my daily life. I am better equipped to cope with living. Otherwise I would go about ignorantly learning things the hard way.\n\nSo I continue to read. Besides being more informed about the world, I also spend my time profitably. It is indeed a good hobby."
    },
    {
        "id": "b75e27232e8943de9b6dfc175011537c",
        "title": "A  birthday  party",
        "content": "Fiona is my neighbor. She turned twelve recently and her parents held a birthday party for her. I was one of those invited.\nThe party began at about three in the afternoon. There were about twenty of us children gathered in Fiona's house. We were all dressed in our best clothes. Everyone, especially Fiona, wore a happy smile.\n\nWe gave our presents to Fiona and she happily opened them. It must really be exciting to receive all those presents.\n\nAfter that Fiona's mother served us soft drinks and delicious tidbits. We then played some games like \"Musical Chairs\" and \"Treasure Hunt\". The winners were given prizes.\n\nAt about four-thirty Fiona's mother brought out the birthday cake. It was beautifully decorated with pink and white icing. Twelve colorful candles sat in the middle of the cake. We all sang \"Happy Birthday\" to Fiona after which she blew out the candles and cut the cake. We clapped out hands eagerly.\n\nWe helped ourselves to slices of the delicious cake. Then we continued our games.\n\nFinally at about six in the evening the party came to an end. We were all tired but happy. The parents of the other children came to collect them. I helped Fiona and her mother clean up the mess we made. After that I walked home which was only two doors away."
    },
    {
        "id": "9aa2a2b2bae041ce937130c572f20a87",
        "title": "My favorite TV cartoon characters",
        "content": "My favorite cartoon character is Dishonest John, or DJ, for short. Dressed in black and uttering his famous \"Nyak, ah, ah\" laugh he makes life difficult for all those around him. However, as always, he will be outwitted and all his devious plans will fail. So every week I watch him go about his antics only to lose in the end. He is such a character that many of my friends have even adopted his laugh.\nAnother favorite character of mine is Big Baby Huey in the show \"Casper The Friendly Ghost\". Huey is such a overgrown lumbering but innocent baby duck who goes around happily defeating the bad guys without really trying to. He is quite a sight to watch as he sucks on his milk bottle and then knocks the lights out of the sly fox who tries to take advantage of him. It is bad luck for anyone with bad intention, for soon Huey will show him that it does not pay to do bad things.\n\nThere is one more character who is my favorite. He is Yogi Bear who lives in Jellystone National Park. This lovable rascal and his little buddy Boo Boo Bear always seem to be getting into trouble with the park ranger. Yogi's favorite pastime is pinching food from the park's visitors. The ranger's unending task is to stop Yogi from doing it.\n\nAll in all, cartoon characters are great fun. They show us what people can get up to. I am sure all of us who watch these shows are entertained by them."
    },
    {
        "id": "3bbb6bb202274cb9932820fec8c53b47",
        "title": "Things I like to do",
        "content": "I like playing the guitar. Though I am not very good at it and am still learning, I can play some tunes. I spend quite a lot of time playing the guitar so much so I get scolded sometimes by my mother. I suppose I do tend to spend a bit too much time with it. Anyhow, playing the guitar is very enjoyable.\nI also like taking evening walks around my neighborhood. In the evening the air is cool and refreshing. The children are busy playing and the neighbors are friendlier. So I take leisurely strolls, sometimes stopping to play with other children and sometimes stopping to chat with the neighbors.\n\nAnother thing that I like doing is getting up late in the morning. During weekdays I have to get up early or I will not get to school on time. On Saturdays, Sundays and holidays, it is so pleasurable to just lie in bed in the morning without having to get up and hurry to school. Again I tend to lie too long in bed and my mother has to come and tell me to get up.\n\nListening to the radio and watching television are also things I like to do. Of course I do not listen and watch everything. I only tune in to my favorite programmes and enjoy myself while seated on my favorite chair.\n\nThere are other things that I enjoy doing too but there seems to be not enough time to do them all. So I generally just stick to doing those I mentioned plus any others that I have time for."
    },
    {
        "id": "1e12f67bd6c54f71be48c931991fb11a",
        "title": "Fruits  of  Malaysia",
        "content": "Malaysia lies in the tropics and is blessed with plenty of rain and sunshine. Many types of trees and plants grow here. Among them are those that bear delicious fruits.\nThe \"King of Fruits\" is without doubt the durian. It is an oval-shaped fruit about the size of a rugby ball. Its skin is green or yellow and covered with many sharp thorns. Inside, however, the yellow flesh is soft and sweet. Its smell is very strong. The locals love the durian, but foreigners find the smell hard to bear.\n\nThe durian is a seasonal fruit. It normally is in season twice a year. So are other fruits like the mangosteen, langsat, duku, rambutan and mango. We consume these fruits in great quantities.\n\nOther fruits like the papaya, pineapple, banana and star fruit are not seasonal. They are obtainable at all times. Again we consume these fruits in large quantities. In a hot country like Malaysia, fruits provide us with much needed water and other nutrients that are vital for health. Often the fruit-stalls are crowded with people waiting to buy a slice of papaya, pineapple or watermelon to quench their thirst.\n\nWe are lucky to have such a huge variety of fruits. In addition to that we get imported fruits like apples and grapes, but they are usually more expensive. So we spend our money mainly on local fruits. I would say that it is money well-spent."
    },
    {
        "id": "fcfcf0db2acb42d6af409990d17a6486",
        "title": "An  Accident",
        "content": "The road in front of my school is a narrow one. It is also very busy. Every afternoon when school is dismissed the road becomes almost impassable as children, bicycles, cars and buses jostle and struggle to use it. Sometimes a policeman is there to help things out, but generally chaos reigns and we have to be careful not to get involved in an accident.\nA few accidents had already occurred. I was a witness to one.\n\nIf happened just after school. As usual the road was an utter mad house. Children were running across the road to get to their cars and buses. Cars and buses honked angrily at them.\n\nJust then I saw a young boy make a dash across the road. There was a loud blare of horn, a squeal of brakes and I saw a car knock into the boy. He fell as though his feet were swept from under him.\n\nFortunately the car was not moving very fast and the driver managed to stop the car before a wheel could run over the fallen boy.\n\nAll traffic stopped. I ran over to the boy and saw blood on the road. He was bleeding from a cut on his head. A man came and examined the boy. Then he lifted the boy and carried him to a car. They sped off, presumably to the hospital.\n\nMany people surrounded the driver who looked dazed and bewildered. A policeman came to calm things down.\n\nAs there was nothing I could do, I turned and walked down the road carefully. It was terrible to witness an accident. I certainly would not like to be involved in one."
    },
    {
        "id": "80d6f7d3ec7741af8b4edc458ac68c80",
        "title": "A  Fire",
        "content": "It was twilight time. I was watching television in my house when I heard an explosion. More followed. So I went outside to see what the matter was.\n\nA column of dark billowing smoke told me the story. There was a fire raging a short distance away.\n\nI got onto my bicycle and pedalled in the direction of the smoke. A couple of kilometres later I came upon the fire. It was a row of motor-workshops and they were burning furiously.\n\nThe police and fire department had already cordoned off the area. I watched from a distance. A crowd had already gathered and we gaped with amazement at the spectacle presented by the burning shops.\n\nThe fire rose to about twenty metres and it lit up the whole area even though the sky was already dark. The firemen desperately sprayed streams of water into the fire to control it. Now and then explosions can be heard as gas cylinders blew up in the intense heat.\n\nFor more than an hour the fire raged. I could see anxious people trying to get near the workshops only to be held back by the police. They were obviously the shop-owners trying to save their shops. Actually they could do nothing but wait for the fire to be extinguished.\n\nFinally the blaze died down and darkness enveloped us. The workshops were totally razed. Only red-hot embers remained where they once stood. The crowd thinned and I too got onto my bicycle and cycled home."
    },
    {
        "id": "57cfebd2f2ce40b79037987672dcaaca",
        "title": "A  Robbery",
        "content": "Sam helps his uncle look after the latter's sundry shop. Business is brisk and Sam is kept busy most of the time.\nOne evening at about 8 p.m., just as Sam's uncle was about to close for the day, two men on a motorcycle stopped outside. They got off and walked into the shop. Sam thought that it was odd that they should be wearing dark glasses at night. Anyway who was he to question what another should wear?\n\nSam was about to ask the men what they wanted when both of them drew pistols from their pockets. One pointed a pistol at Sam and the other at Sam's uncle. Sam froze and stared at the pistol pointed at him. He could not believe his eyes. These two were robbers wearing dark glasses to conceal their identities!\n\nThe next moment Sam and his uncle were made to lie face-down on the floor. Sam heard the cash register ring and the drawer open. Then he heard a shuffling of feet, the roar of a motorcycle starting up and suddenly all was quiet.\n\nSam looked up. The robbers were gone. Sam shook his uncle who was still prostrate on the floor. They got up. Sam's uncle ran to the cash register. The robbers had taken every cent from it. The robbery had happened so quickly. It took less than a minute for the robbers to come and vanish with the day's takings.\n\nSam's uncle shook his head. At least the robbers did not harm them. The only thing left to do was to inform the police and let them handle the case. As for Sam, he learned to be wary of strangers who wore dark glasses at night."
    },
    {
        "id": "2a119846c91846c1bccac6bdba2deb58",
        "title": "A  Busy  Street",
        "content": "Petaling Street in Kuala Lumpur has got to be one of the busiest street, if not the busiest, in Malaysia. To be in it just once is to know the meaning of the word \"busy\".\nI happened to be in it a few days before the Chinese New Year. On both sides of the street were hawkers with all sorts of goods for sale. Fruits, cakes, fireworks, food and other things were displayed openly for people to come and buy. The five-foot ways were not big enough, so the hawkers and their customers actually spilled into the narrow street itself making it a hazardous place for drivers and motorcyclists. Every few seconds a horn sounded as the vehicles crawled cautiously among the throng.\n\nThere were so many people there that if I had not been with my father I would probably have got lost. My father knew his way around. So I held on tightly to his hand as he led me through the crowd. A number of times I nearly knocked into someone, or rather, someone nearly knocked into me. Everyone seemed to be in a rush and nobody seemed to care whether they trampled on another.\n\nWe were there to buy some cakes for the New Year. At the shop we had to wait a long time before we could pay for what we wanted. The shop was crowded with other shoppers.\n\nAfter our purchase, we made our way carefully out of the street. Once outside, the air felt so much fresher. Though we had to walk some distance to our car, it was so much more pleasant than walking among the crowd of frenzied shoppers along the busy street."
    },
    {
        "id": "96a9332941784d4492a97d7c57eb814a",
        "title": "My favorite subject in school",
        "content": "My favorite subject in school is Mathematics. It is my favorite because I never have difficulty with it and always get good marks in tests.\nI suppose I am lucky to be born with a clear-thinking brain. So ever since young, manipulating numbers and figures came easy to me.\n\nThe wonderful thing about Mathematics is that, besides some formulae, there is nothing else to remember. Every step in solving a problem is done logically. Other subjects like History and Geography require a lot of memory work. Remembering dates and other facts is hard work compared with the ease and simplicity of mathematical reasoning.\n\nWhile Mathematics is simple to me, some of my friends have great difficulty with it. I do not really understand why. They get stuck with simple problems and often give up. So I help them out when I can.\n\nThe one advantage I have in being good in Mathematics is that I do not have to spend a lot of time on it. Homework and tests are a breeze. So I have plenty of time left over to study other subjects. Sometimes I feel sorry for my less fortunate classmates who get scolded in class for not completing their Mathematics homework.\n\nAnyhow I have come to realize that human beings can be so different in their abilities while they look similar otherwise. Some of us are lucky to be good in some things. Others may not be so lucky."
    },
    {
        "id": "eedaf8a7a6404e0dbe607064dee4a43d",
        "title": "The  haunted  house",
        "content": "Everyone says that the old house at the end of the road is haunted. It used to be the residence of a rich family but now none of them would stay there. So the house is vacant and uncared for. The compound is filled with over-grown weed and grass.\nMy friend Jack and I decided to find out once and for all if what people said was true. So one evening, we bravely entered the house and prepared to spend the night there. We brought along a powerful torchlight, two sleeping-bags, some food and drinks, and a portable stereo set.\n\nThe early part of the night was no trouble at all. We sat on our sleeping-bags and listened to our favourite music.\n\nTwelve midnight came. We felt a bit sleepy. So we switched off the stereo set and crawled into our sleeping-bags. However sleep was impossible. There seemed to be a heavy atmosphere hanging around us. The darkness was oppressive and there was a strange soft whining noise coming from upstairs.\n\nWe dared not go up to investigate the noise. So we lay quietly in our sleeping-bags and hoped that the noise would go away. But it would not go away.\n\nActually it got louder and louder. Then it sounded like someone moaning. Jack hurried out of his sleeping-bags and switched on the torchlight. We could see nothing except the walls of the empty living room we were in.\n\nSuddenly there was a loud crash from upstairs and the moans turned to screams. We screamed too and ran out of the house as fast as we could, leaving behind everything that we had brought. The hair on the back of my head stood on end for hours afterwards.\n\nWe never dared to go back into the house, not even in the daytime. My uncle had to go and retrieve the things we had left behind there.\n\nSo, is the house haunted ? All I can say is that if you want to know, go and find out for yourself."
    },
    {
        "id": "718e953fec154c3a8c854ea89bcb871a",
        "title": "My First Ride on a Ferry",
        "content": "The first time I ever rode on a ferry was when I took one to cross from Butterworth to Penang Island. My family and I had gone to Penang for a holiday.\nWe arrived at the Ferry Terminal just as the sun was setting. My father paid the fare at one of the toll-booths and we were ushered into a lane. We had to stop behind a row of cars to await the arrival of the next ferry.\n\nPresently a light yellow ferry arrived. Cars and motorcycles sped out of it. Then the green light came for us to board. My father carefully drove the car onto the lower deck of the ferry. It was an exciting new experience for me. I noticed the words \"Pulau Undan\" on a wall of the ferry.\n\nAs soon as the ferry was filled with cars and motorcycles on the lower deck, it left the terminal and proceeded towards the island. I stood at the front end of the ferry and watched the water churn and twirl as the ferry cut through it.\n\nI could see the island a short distance ahead of us. To our left spanned the Penang Bridge. The setting sun cast a red glow on the whole scene and I must say that it was beautiful.\n\nMy sister and I climbed up the stairs to the upper deck. It was filled with passengers who either sat on the seats there or loitered around the area.\n\nSoon the short ride ended. We hurried back down to the lower deck and got into our car when we saw Penang Island loom closer and closer.\n\nFinally the ferry docked and my father followed the row of cars out of the ferry. The car bumped a bit on the uneven ramp but soon we were on Penang itself. My first ferry ride was over."
    },
    {
        "id": "c02712048fb646bcb192827b68444f24",
        "title": "The day I won a prize",
        "content": "I was never a great athlete but I managed to win a prize once.\nIt happened on a School Sports Day when I was asked to represent my house in the Long Jump. There were no other suitable ones, and I, being the tallest of my friends, was promptly sent to the Long Jump pit. My house-master reckoned I might have a chance to win.\n\nHe was right. I did win, but not first prize. I only managed second place, coming behind someone who was at least five centimeters shorter than me.\n\nWe were each given three jumps. There were about ten of us competing for the prizes. When my turn came I ran down the lane as fast as I could and took off at the board. I thought I jumped very well but it was a foul jump. So I waited for my next jump.\n\nI saw the other competitors leap like gazelles into the sand-pit. One particular boy, the eventual winner, was built like a tank. He was not tall, but his legs were muscular and strong. So when I saw him make his jump, I knew that no one else would be able to beat him.\n\nNo one did. I managed my best jump of 3.65 meters and that was nowhere close to his best. The other competitors did much worse.\n\nI was delighted to collect my little plastic prize from the Headmaster. It was the first time I had ever won anything. My house-master patted me on my back. I smiled happily as I went home to show the prize to my parents."
    },
    {
        "id": "11db9d95a4354c38a1b8fb8a2c38b95f",
        "title": "The day I lost my wallet",
        "content": "When I was seven years old, I was given a small wallet to keep my pocket-money in. It made me feel grown up and I carried it proudly in my hip pocket.\nOne day, during recess in school, I discovered that my wallet was missing. I searched all my pockets but could not find it. There were a couple of ringgit or so in the wallet and without it I could not buy anything to eat.\n\nI was close to tears. It was not so much because of losing my precious wallet but because I might get a scolding from my parents. Anyhow I went hungry that day.\n\nAfter recess I was in no mood to study at all. I kept thinking about how I lost my wallet and what my parents would do to me. How was I going to explain the loss? I did not know whether someone had pinched it from my pocket or it had merely fallen out. I prayed that someone would find it and return it to me.\n\nMy prayers came to nought. Fortunately I did not have to pay to get on my school bus. My fare was paid for monthly.\n\nWhen I told my mother about my loss, she was clearly angry. I received a long lecture about my carelessness. When my father came home, I received another lecture. Also I was told that there would not be any more wallets for me until I got older.\n\nSo for the rest of the year and two years following, I carried my pocket-money (which became only a ringgit) in my pocket, without any wallet. I am glad to say I never lost any money again. I had learned to be more careful. It is not pleasant to lose something and then get scolded for losing it."
    },
    {
        "id": "82ad173f37bc440593408c6f07d32030",
        "title": "An autobiography of a motocycle",
        "content": "I was made in a factory in Penang. I was one of a number of 100 c.c. motorcycles that was sent down to Kuala Lumpur to be sold. So I found myself waiting patiently in a shop for someone to buy me.\nA few weeks later, a man came and bought me for his son. The boy was barely seventeen but his father was rich and could afford to buy me. I was chosen mainly because of my beautiful red colour and that I could go quite fast.\n\nMy young owner was a reckless rider. He rode me carelessly all over town, putting me in grew danger. Many times I thought for sure that it was the end but somehow he managed to escape.\n\nHowever, he tried one stunt too many. On that fateful day my owner took me out on a reckless ride. His object was to overtake every vehicle in front of him. After a few near misses he finally made a mistake and he slammed head-first into the back of a lorry. I slid uncontrollably under the lorry.\n\nThat was the end of him.\n\nI was salvaged from under the lorry, repaired and sold again to a middle-aged man who delivered newspapers for a living. So for the next five years I was made to run thousands of kilometres carrying loads of newspapers.\n\nThe hard work took its toll on me, and despite several repairs, my owner decided that it was time to retire me. I was too worn-out to be of any use anymore. So I was sold to a motorcycle shop where the owner stripped me of my parts.\n\nToday I am nothing but a bare frame without any wheels. I await the day when I will be sold for scrap. That would be the end of me."
    },
    {
        "id": "e410feb63b704c94a7100dea47a64d6f",
        "title": "The  Newspaperman",
        "content": "The newspaperman delivers newspapers to us and many other houses in the neighborhood. I hear his motorcycle every morning when he comes to deliver the daily paper. He comes promptly at 6.30 a.m. every morning, rain or shine, unless something extraordinary prevents him from doing so.\nHe is so regular and prompt that I do not need any alarm clock to wake up. At six-thirty, the neighbors' dogs start barking as he arrives and I know it is almost time to get up for school.\n\nThough he comes every day, I do not get to see him. I only pick up and read the newspaper he had left at the door. I only see him once a month when he comes to collect the bill.\n\nPromptly on the first of each month, at six-thirty in the evening, he shows up with his bills. This time he rings the door bell and I usually have to go and pay him. My mother will have got the money ready one day earlier and instructed me to pay him.\n\nHe never smiles. He merely gives me the change, put the \"PAID\" chop on the bill and goes off to the next house. It appears that his regular, almost regimental, rounds of newspaper delivery has made him behave like a robot. He is very efficient, very prompt and does not smile. That is certainly very robot-like.\n\nNevertheless, I appreciate his reliable service. For one thing, I am never without the daily paper. Some of my friends complain that their newspapermen are very unreliable. Not so with mine, he is the best."
    },
    {
        "id": "2e71648fee4f432cac699a542fca8e56",
        "title": "A day in the life of a bus driver",
        "content": "The alarm rings. It is six o'clock. Maniam gets up wearily. It is the start of another day ferrying school kids to and from school.\nAt six-thirty, after a hurried bath, Maniam starts his old 22-seater bus and moves off. He goes along a regular route picking up children to send to various schools. By seven, all the regular children, except one who is ill, is on the bus. Maniam drives carefully through the busy roads.\n\nHe stops at four different schools, dropping off some children at each. He plans his drive carefully so as to reach the last school by seven-thirty. Otherwise some children will be late for school and he gets the blame.\n\nAt seven-thirty two, his bus is empty and the roads are magically less congested. Most of the children are in the classrooms. Maniam stops by at a stall to have his breakfast.\n\nCome eleven-thirty, he picks up other school children for the afternoon session. By twelve-thirty he has sent all the children to the schools safely.\n\nAt one o'clock he collects his first batch of children from a school. Then he proceeds to three other schools to collect the others. After collecting the children he sends them home.\n\nManiam has lunch at home and takes a nap. At three o'clock he cleans up the bus.\n\nAt six in the evening, Maniam goes on his last round of collecting the children from the schools. He safely sends them home by seven thirty. Then Maniam goes home, takes a bath, has dinner and watches television for a while before retiring to bed. Thus end yet another day in the life of a bus driver."
    },
    {
        "id": "d40c4434789d4343bd77a96128cd0cc1",
        "title": "Danger  at  home",
        "content": "Our home is usually our favorite place to spend time in. However many accidents occur at home. There are dangerous things in the house and we should be aware of them. Thus we can avoid unnecessary pain or injury.\nElectricity runs many of our home appliances. It is a very useful thing. It is also a very dangerous thing if used carelessly, for it can kill. Electrical sockets and power points are to be handled with utmost care. Young children should never be allowed to go near them. Unless we are very sure of what we are doing, repairs should only be done by a competent electrician. It is only too easy to get electrocuted. Old or faulty appliances should be discarded. If used, they are likely to start a fire somewhere or kill someone who touches it.\n\nThe kitchen has many dangerous things. Sharp knives can draw blood, mishandled gas-cylinders can explode, hot water can scald and stoves can cause nasty burns. Flies and rats can contaminate food. Thus the kitchen is not a place to be careless in. If we are careful and know how to handle things there, then the chance of an accident occurring is lessened.\n\nThe biggest danger in a bathroom is when the floor is slippery with water or soap. I have heard of many incidents of people, especially old folks, falling in the bathroom. Sometimes the fall is fatal. Often it leaves the victim bedridden. Utmost care is needed here.\n\nFinally the medicine cabinet should be inaccessible to young children. Dangerous drugs and pills can look like sweets to these young ones. If taken, the consequences can be disastrous.\n\nOther dangers do exist. It is up to us to watch out for them."
    },
    {
        "id": "a9133d1d151748ffbd1308f6ef780162",
        "title": "The importance of physical exercise",
        "content": "Each of us has a physical body made of muscles, blood, bones and various other living tissue. When any of these are injured or not working properly then we get ill. Nobody likes to be ill. So it is important that we keep our body healthy.\nExercising the body is one way of keeping it healthy. If we do not exercise then our muscles become weaker and we are less able to do things properly. Also the bones can become weaker and thus break easily.\n\nThere are many types of exercises that we may participate in. We may play badminton, football, netball or whatever games that we prefer. We may also jog, walk, swim or climb a mountain. Older folks prefer less strenuous exercises like Tai Chi, Yoga or a leisurely stroll in the park. For the really fit young people, there are rock-climbing, gymnastics and other physically demanding activities.\n\nWe exercise to keep the body healthy. However there are some who overdo things and end up injuring themselves. It is fine to jog for a few kilometres. It is madness to jog until we are exhausted. Also they are people who become addicted to their exercises. They become unhappy when they are unable to exercise or when they lose to someone in a competition.\n\nExercise is important. No exercise may result in a weak body. Too much exercise may result in injury. Neither extremes are good. It is up to us to be sensible in exercising."
    },
    {
        "id": "2c7f052c7e3d43998b7dc40d5652e97c",
        "title": "A  visit  to  the  market",
        "content": "I accompanied my mother to the central market to buy some groceries that she needed for the coming New Year.\nWhen we arrived at the market we could not find a place to park the car. So we waited patiently for about ten minutes before someone vacated a parking space and we moved in.\n\nComing to the market just before a festive season was not a pleasant experience. The whole town seemed to be there. Everyone had things to buy. So the prices of things shot up. Worst of all, we had to struggle to get these things.\n\nSo we made our way carefully through the various sections buying vegetables, meat, fish, noodles, spices and other food stuffs. We had wanted to buy some prawns too but they were all sold out, despite their sky-high price.\n\nThe bags got heavier and heavier. The crowd got thicker and thicker. The noise and heat was overwhelming. As we had nearly done all the shopping, I told my mother that I would wait for her at the car. I could not stand being among hundreds of aggressive shoppers anymore.\n\nI lugged the bags wearily to the car and breathed a sigh of relief when I reached it. The air smelled sweet and cool. I was glad to be outside.\n\nFifteen minutes later my mother emerged from the market. She looked exhausted. We put the groceries in the boot, got into the car and drove off with the air-conditioner at full blast."
    },
    {
        "id": "f98f3c1b825c4002b5b8679c5d47ffc8",
        "title": "Power  failure",
        "content": "One evening just as I was getting ready to watch a cartoon show on television, there was a power failure. The television set just went blank, the lights went off and the fan slowed down and stopped. As it was getting dark, I hoped that the power would be restored soon but it was not to be so.\nSoon darkness enveloped the neighborhood. We hastily lit candles so that we could find our way around the house. As we had only three candles, my mother sent me to the sundry shop nearby to buy more.\n\n\"Sorry, no more candles\", was what the shopkeeper told me. The neighbors had bought up all the candles. At home my father managed to dig out two kerosene lamps. We lit these too and kept the darkness out.\n\nWithout the fan running, it was oppressively warm. Furthermore there was nothing to do but wait for the power to come on again. All of us sat quietly in the living- room. We had grown so dependent on electricity. Without it we felt so uncomfortable. I used a book to fan myself.\n\nFinally it was time for bed and still there was no power. Nevertheless I groped my way to my room, changed and lay quietly in the darkness. It felt so strange without the familiar lights around me. Anyhow I fell asleep after a while.\n\nThe power came back on only at dawn. By then we did not need it anymore."
    },
    {
        "id": "dee1066a19364e58a122e2a0f7e35672",
        "title": "Water supply disruption",
        "content": "We take so many things for granted at home that we do not appreciate them until they become unavailable. One of these is the water supply to our house.\nDisruptions to the water supply do occur now and then. However there was one that was the worst.\n\nIt began one morning when we got up to prepare for the day ahead. All the taps, except one in the bathroom connected to the water tank above the bathroom, were dry. So we had to patiently wait our turn to use the only tap with water.\n\nWe did not feel the pinch until evening when the water tank above the bathroom ran dry. My mother had a small tank of water stored in the kitchen, but that was only for cooking purposes. So none of us could have a bath or even wash our hands. Whatever little water we had in various little containers was used sparingly. We began to be careful not to waste water.\n\nThat evening a water-tanker from the waterworks arrived to supply us with water. We ran out gratefully with our buckets to collect as much water as we could. Soon all our buckets were full. At least we could wash ourselves that night.\n\nWe were very careful when we used the water we collected. We could not afford to waste any.\n\nThe next morning, there was still no water from the taps. So again we used the limited water frugally.\n\nFinally the water supply was restored at about four in the evening. It was wonderful to see rust-coloured water gushing out of the taps. It took a while for the water to become clear. Anyhow we were glad that we had normal water supply again."
    },
    {
        "id": "aba4c72ec0a3485cb48fe87285d4add8",
        "title": "Visiting a durian orchard",
        "content": "My cousin has a durian orchard about five kilometers from town. I visited him once during a fruit season.\nI reached the orchard at about 9 o'clock in the morning after having cycled all the way from my house. My cousin was waiting for me in his modest little wooden house in the middle of the orchard.\n\nAround the house, about 5 acres of it, was the orchard.\n\nThere were hundreds of durian trees all over the orchard. Clusters of durians hung on the branches. There must be thousands of these spiny fruits.\n\nSuddenly a loud crash sounded from a distance. I was startled. However my cousin said that it was only a ripe durian dropping from a tree. I breathed a sigh of relief. Then I followed him to where the sound came from. To my delight I found the fruit among the undergrowth. I picked it up and carried it back to the house.\n\nThere were dozens of other durians piled up at the back of the house. My cousin had collected them earlier. They were for a buyer who was coming later. Anyway my cousin opened a couple of them and I enjoyed eating the delicious flesh inside.\n\nSo I spent the morning picking up fallen durians. It was a great time for me. Only the mosquitoes, which kept attacking me, spoiled the fun somewhat.\n\nAt about noon, I bade farewell to my cousin after thanking him for the wonderful experience in the orchard. I then cycled home."
    },
    {
        "id": "ffaa732528d84abfb7604d4490f4c294",
        "title": "Grandma",
        "content": "Grandma is 88 years old. Her hair is snowy-white, skin wrinkled and teeth all but gone. She is also quite deaf. Otherwise she is strong and active, often arguing with my mother over who should mop the floor.\nThe doctor said she has Alzheimer's disease. In other words, she is senile. It is a sad fact but true.\n\nThe one glaring symptom of her disease is that her memory is very bad. She cannot remember things or gets them all mixed up. So she forgets where she has kept things and often will frantically search for them. Then she forgets what she is searching for, which adds to her frustration. When she misplaces her spectacles, she will don someone else's pair and happily go about the house. How she manages to see with the wrong spectacles baffles me.\n\nAs much as she cannot remember recent things, she can recall her younger days vividly. She rattles off the names of people she knew then and get my name and other family members' wrong. She cannot remember whether she just had dinner but can remember an event that happened fifty years ago. Sometimes she can be very difficult. Her being almost deaf does not help matters either. We have to speak loudly for her to hear.\n\nSometimes she says we are scolding her. We shout to say we are not scolding her, which makes things worse. We got her a hearing-aid. She would not wear it.\n\nIn between bouts of crankiness, she sometimes seems normal. But this seems to get lesser as her disease progresses. So we do our best to keep her out of harm's way. We lock the medicine cabinet and doors and hide dangerous things from her. It would be disastrous if she swallowed a bottle of pills or got lost while wandering in the streets. The latter has happened before. A kind neighbour brought her home.\n\nIt is unfortunate the last years of her life has to be like this, but it is so. We can do nothing but to help her along as much as we can."
    },
    {
        "id": "6df5b8dd652c4896b50996ed4c565b35",
        "title": "An unpleasant experience",
        "content": "The evening was very pleasant as we strolled to the \"Glutton's Square\" where we intended to have our dinner. The sun was setting and the air was cool.\nJohn, Aileen and I sat down at a table. The stall-owner came and we ordered some fried mee.\n\nSoon the large plate of piping-hot mee arrived and we happily put some into our bowls and began eating.\n\nIt was delicious.\n\nJohn, the talkative one, still managed to say an unintelligible word or two between gulps of food.\n\nSuddenly John winced as his teeth came against something unchewable. Cursing, he spat out the contents of his mouth onto the table. \"What the heck!\" he cursed again.\n\nMuch to my disgust, John ran a finger through the half-chewed food. Then, uttering a cry of triumph, he picked up a staple from the food.\n\nAileen and I immediately stopped chewing and expelled the food from our mouths. The thought of eating staples was revulsive. I wondered if I had already swallowed some staples.\n\nWith a fork, Aileen searched through the rest of the mee on the plate. She found two more staples and a short length of raffia string!\n\nGoodness, I thought, what other rubbish was there in the food?\n\nWe summoned the stall-owner to our table. His smile vanished when we showed him the staples and string. Then he apologized for the matter, said that we did not have to pay and furthermore would make a fresh plate of mee for us, free of charge.\n\nWe got up, showed him our sour faces and walked off. I, for one, seemed to have lost my appetite."
    },
    {
        "id": "ad693107f57448aa911a2d91e336a348",
        "title": "Confined to the house",
        "content": "It all began with a blister on my lower eyelid. I happened to rub it accidentally and it was painful.\nSoon after blisters appeared on my hands and neck. I suspected that I must be coming down with something. My mother examined me and immediately pronounced \"chicken-pox\". I had come down with chicken-pox.\n\nShe took me to the doctor's to make sure. The doctor said that what I needed was rest. He gave me a two- week medical certificate and some pills to keep down the fever.\n\nTwo weeks! I had to stay in the house for two weeks.\n\nVery quickly more blisters appeared all over my body. I even had some in the throat, which made swallowing difficult. To make matters worse, I began to get bouts of fever. At times when the fever was raging, I seemed to drift into a kind of limbo. Things became hazy and I was not sure whether I was dreaming or awake.\n\nI had a look in the mirror and saw that my face was grotesque. Red blisters covered the whole face. I wondered if I would be scarred permanently.\n\nSo I stayed in the house and did nothing. It was not too unpleasant except for the fever and the extra care I had to take not to break the blisters accidentally. Nobody came to visit me. I was forbidden to visit others. It was customary to remain out of sight when one had chicken- pox. I had no choice but to comply.\n\nThe days passed. Slowly the blisters dried into dark scabs which flaked off after a while, leaving behind little red scars. The flakes fell on the floor, on the bed and among my clothes.\n\nFor two weeks I remained confined to the house. At the end of the period, my appearance had improved enough for me to go back to school. The little scars remained there for a few more months but I was glad my enforced stay in the house was over."
    },
    {
        "id": "87e3516b1c634030895a0cd6c4294a25",
        "title": "Something unexpected",
        "content": "The routine of following lesson after lesson can be very tiring. Recess time always seems so far away. The bell rings. One teacher leaves, another appears. What we need is a break from the monotony.\nOne morning, we were a lesson into the routine when I felt that it was going to be just another day of endless studying. After what seemed a long time the bell rang for the second period. The Mathematics teacher left. Next would be Geography with Mrs. Singham.\n\nThe short break between the going of one teacher and the coming of the next was when we had the opportunity to talk and have some fun. It usually lasted a minute or two, sometimes more.\n\nThis time no teacher appeared even after five minutes. We were having a great time. Ten minutes -- Mrs. Singham still did not appear. Our monitor went out in search of her. A few minutes later, he returned to announce that Mrs. Singham was absent. We cheered. This was unexpected, but it was welcome.\n\nSo for forty minutes we literally fooled around. The monitor could do nothing. What a good time we had. The bell rang again. Forty minutes of fun seemed so short, but it was great while it lasted.\n\nAgain no teacher appeared. It was another case of an absent teacher. We cheered even louder because it was ,a double-period which meant we were free until recess.\n\nAltogether we had one hundred and twenty minutes -- two hours, of no lesson. It was unexpected of course and I have to say I enjoyed it very much. I would not mind having more of this unexpected thing."
    },
    {
        "id": "da7a13187f1641d68e6691f40c2529fd",
        "title": "Ways of improving my English",
        "content": "Today, English is used widely. It has become the most popular language of communication between countries and in many fields of human endeavor. So it is important that we learn to use English. Otherwise we will be at a disadvantage.\nThe only effective way of improving my English is to use it, as often as possible.\n\nIn school, the only time when English is used is during English lessons. That certainly is not enough. So wherever possible I speak English with some friends and teachers who will or can speak English with me.\n\nReading book, magazines and newspapers are good ways of improving my English. On the whole they are grammatically correct. We may speak incorrect English and get away with it. Not so with printed words, they have to be correct. Through reading, I learned how to use correct English in writing and speaking, though at times I still speak the broken English that many of us speak here.\n\nWatching television and listening to the radio are two more ways of improving my English. English as it is spoken by the English, Americans, Malaysians and others are distinctly different.\n\nSo I continue to use English, that is, hear, read, speak and write it. Some of my friends only hear and read it. They can hardly speak or write it, but I will not be like them. I will try my best to master it."
    },
    {
        "id": "5276384d01a94b44bd8ee666b9f75114",
        "title": "Freak  weather",
        "content": "Early one morning when it was still dark, I woke up suddenly. I felt very cold. The funny thing was that I had the blanket on but I still felt cold. I could not get back to sleep because of it. So I got up and put on extra clothes. Only then did I managed to get to sleep again.\nWhen dawn came, I woke up to find that my nose was freezing. The rest of the body was comfortably warm under the blanket, but the head, especially the nose, felt like ice.\n\nAnyhow I got up and immediately felt the cold air around me. I shivered. It was extraordinary that it should be this cold in the tropics. I checked the thermometer. It read 19 degrees Celsius. Goodness, I thought, this was really unusual.\n\nOutside the sky was obscured by thick mist. Again this was unusual. On my way to school, my clothes actually got damp as moisture settled on me. It was cold and damp. The sun was well hidden. I could not even see where it was.\n\nMost of my schoolmates and the teachers had extra clothes on. The others shivered.\n\nAs the day progressed it became more pleasant. Mist still hung all around us. It was strange having lessons in the unusual conditions.\n\nOnly at about 12 noon did the mist clear and the sun shone through. Even then the atmosphere was pleasantly cool.\n\nIt was a freak weather but it was enjoyable while it lasted. It gave me an idea of how it was like in a cold country. How nice it would be if we had this type of weather more often."
    },
    {
        "id": "86427d72cad3443ba6ef7fff3057c68b",
        "title": "Places I like to visit",
        "content": "First of all, I would like to visit the moon. By the time ordinary people can visit the moon, I will probably be very old or dead. Anyhow it would be quite an experience to walk on the moon. It is said that there is no air or water there and our weight is many times less. I certainly would like to see how high I can jump and how fast I can run on the moon. These are all wishful thinking, of course.\nTo be realistic I can only visit places on earth. There are the Seven, and other, Wonders of the Earth and I like to visit them all, if possible. After hearing about the marvels of The Pyramids Of Egypt, The Great Wall Of China, The Taj Mahal, The Leaning Tower Of Pisa, The Colosseum Of Rome, Stonehenge in England and others, it would be great to actually be there and experience these things first-hand.\n\nHowever, before all these places, I would like to visit Disneyland first. Which kid would not like to? There are so many things to see and do. It would be great fun.\n\nRight now I cannot visit any of these places. The first reason is the lack of money. The second is I am too young to go on my own and I do not know anyone rich enough to take me there.\n\nSo they remain places I like to visit. Who knows, I might get to visit some or all of them in future, or not at all. Only time will tell."
    },
    {
        "id": "ddfd72cbfa894b96963c05b218dbab55",
        "title": "Some funny people I have met",
        "content": "The first funny person that comes to mind is a man who sits on the branch of a tree by a road and shouts at the cars that pass by. He is mad of course but it still is strange that a madman should shout at passing cars. He never seems to notice me somehow when I pass by on my bicycle. For him it is only cars. He shouts with such gusto and pleasure. I always laugh when I see him at it.\nThen there is this man in baggy snorts and Japanese slippers who rides his motorcycle with only the right side of his buttocks on the seat. The left side hangs out. This makes his motorcycle lean at an awkward angle as though he is about to fall, but he does not. Perhaps he has a large boil on the left side of his buttocks. Whatever the reason, I have seen him ride the way he does many times. He looks so funny, but dangerous.\n\nRunning a sundry shop near my house is a short and stout man whose body shape and movements resemble that of a penguin. I do not mean to be derogatory but he always reminds me of that bird. However he runs his shop well and I get a lot of things from him.\n\nFinally there is a dandy who dresses in the most outrageous outfits I have ever seen. The colour combination he chooses for his clothes are, to say the least, horrible. Only he dares to wear a purple shirt with green trousers and a pink tie. Often I see running around on his motorcycle wearing those loud clothes. He works as a salesman for some company. Perhaps those clothes help him to get, or maybe shock, customers."
    },
    {
        "id": "a46f0c9da38c4c6da5e34b9ae6c5d9b3",
        "title": "Pests in the home",
        "content": "The biggest pest in the home is the mosquito. I notice that there are at least 3 different kinds of mosquitoes. Some bite in the daytime and some at night. Some are large while some are tiny, but they have one thing in common -- they bite. So we use mosquito repellents, coils, nets and sprays to keep them at bay, but somehow they still manage to get past our defenses.\nI am very sensitive to mosquito-bites, so I sleep under a mosquito-net. Some people seem quite unaware of their presence and do not seem to know that they have been bitten. Well, these are lucky people until they come down with malaria or dengue-fever.\n\nAnother persistent pest is the common rat. These animals are very active during the night, looking for food everywhere. They eat anything, even soap. So any food left uncovered overnight is likely to be contaminated by these pests. Furthermore rats make nests in nooks and corners of the house. They nibble into floorboards, ceilings and even electrical wiring. They are really a big nuisance.\n\nCockroaches too are pests. They have the habit of crawling all over the place. Sometimes they even crawl onto one's body. These dirty little creatures contaminate food too. They also emit a strong stench. It is never pleasant to encounter them.\n\nThere are other pests like flies, ants, moths and assorted bugs. It would be nice it we can get rid of them but it is obvious we cannot. They are here to stay. The only effective way to minimize them is to keep the house clean. In this way they have less places to breed and less food to eat. The less pests we have in the home, the more pleasant the home is."
    },
    {
        "id": "9455eb5e8d3e4ea5986e4d9f0eeacd67",
        "title": "Teachers'  Day",
        "content": "One day every year, we celebrate Teachers' Day in honour of the teachers who spend so much time teaching us so many things.\nThis year, Teachers' Day began with a school assembly in the hall where the headmaster delivered a speech. After that we adjourned to our classes, not to have lessons, but to enjoy ourselves.\n\nMy classmates gave a small party for the teachers who taught us. Each of us contributed a small sum of money to buy cakes, drinks and other titbits. On that day we arranged the chairs and desks so that they surrounded an empty space in the middle of the classroom.\n\nSo began a round of eating, drinking and playing games with the teachers. Most of the teachers were very sporting and we thoroughly enjoyed ourselves. It was so different from having lessons.\n\nThe other classes gave parties too. So the teachers had to move from class to class and participate in the fun. I would think that this was quite tiring on the part of the teachers but they managed it. After all it was their day to enjoy and have fun.\n\nOne class even gave a short play for their teachers. I did not get to watch it as I was busy tidying up the classroom after the party.\n\nAll in all it was a great day. The whole school was immersed in an atmosphere of gaiety. So when the school bell rang for dismissal I felt a little sad that it should end, but end it must. The day was over and we went home tired but happy."
    },
    {
        "id": "a1bf4e4010b2403e9ab7eccd765e91a3",
        "title": "Birds in my garden",
        "content": "I live in a bungalow surrounded by a fairly large garden. There are a number of fruit trees growing here along with many plants and a lot of grass. At first glance the garden appears very quiet but actually many birds and animals live in it or visit it frequently.\nEvery morning I am awakened by the shrill songs of a magpie-robin. The sound is so sweet and I just lie in bed listening to the songs until the bird flies away.\n\nAll through the day I see various birds come and perch on the trees and plants. Some come to sing or rest a bit. Others come to look for food. So it is always a pleasure to see them. I just sit quietly and they go about their business undisturbed. I have seen the oriole, spotted-dove, pigeon, yellow-vented bulbul, mynah, fan-tailed flycatcher and various other little birds which I cannot name. They sing, dance and display their beautiful colors. It is quite a treat. On the other hand there are those pesky little sparrows that come into the house to steal food.\n\nOne morning I saw a white-breasted water hen sunning itself just next to a mango tree. This normally shy bird must really be feeling the pinch of progress to take refuge in my garden. Sad to say, the surrounding area is being developed and the wildlife are being chased away or destroyed.\n\nSome people keep birds in cages to listen to their songs. I say it is far better for the birds to live freely. Then they sing, or not sing, their songs naturally. It is wonderful to see them fly freely among the trees. It is not so wonderful to see caged birds unable to move more than a foot in any direction."
    },
    {
        "id": "e61600ba73e84018a63cb1c248c70421",
        "title": "A  frightful  experience",
        "content": "I had to walk through an area filled with undergrowth to get to the shop. It was not too unpleasant except that I had to keep to the narrow footpath and not blunder into the bushes.\nBuying some flour from the shop seemed harmless enough. The shop was the nearest one and my mother reckoned I was old enough to run a simple errand for her.\n\nSuddenly I heard a growl from within some bushes. A ferocious dog appeared in front of me with its fangs bared. I froze. If it were to attack me I knew I could not fight it. I had heard that if you keep still, a dog would not attack.\n\nIt worked. The dog came up to me and sniffed me all over, but it did not bite me. I trembled with fear but dared not move.\n\nAfter a while it lay down beside me. I thought it was safe to go, but the moment I moved a leg it stood up and growled fiercely again. I was trapped! The dog would not let me move. What could I do?\n\nI waited in fear. As long as I remained still, I was all right, but how long could I stand there like that? My feet were already feeling numb.\n\nThen I had an idea. The shop was just a short distance away. I shouted \"Help! Help!\" with all my might. The dog looked confused but did not attack me.\n\nThe shopkeeper heard my shouts and came to investigate. The dog, which was obviously his, wagged its tail and folded back its ears. He quickly brought a chain and tied it to a post. I was so relieved. The shopkeeper apologized and gave me a free packet of flour.\n\nWhat a frightful experience it was. Anyway I never had anymore trouble with the dog. The shopkeeper kept it tied up at all times."
    },
    {
        "id": "78f53112f2454673a7f81ded9647b384",
        "title": "The way we eat",
        "content": "The way we eat our food is habitual. This means that we are usually not aware of it. I have noticed some of the ways people eat and they range from elegance to gluttony.\nMy father slurps his soup. It is disgusting but we dare not say anything. He will be sorely offended if we did. On the other hand my mother is so gracefully in her ways. It is a pleasure to watch her daintily scoop the food up into her mouth and then chew it slowly and gently.\n\nA fat friend of mine literally gobbles up his food. He eats at least three times as much as I do in about half the time that I take. While he is eating, he is totally oblivious to his surroundings. He puts the food into his mouth as fast as he can, chews a couple of times and then swallows. It does not matter whether he is using a spoon, chopsticks or his hands. He is skilled with all. After finishing, he sits up, gives a couple of burps and rubs his belly. It is all very disgusting, but at the same time it is very amusing.\n\nAnother friend of mine, a thin one this time, hardly, eats at all. He sits at the table and, half-heartedly picks up the food with a fork. He says he has no appetite. No wonder he is so thin.\n\nThen there are many who talk while they eat. So little pieces of food and drops of saliva start flying. Only a sharp \"Shut up and eat!\" can silence these talkers. They usually shut up but only for a while.\n\nHow do you eat your food? Do you eat quickly, slowly, like a glutton, sparingly, daintily or noisily? Do you lick your fingers, spoon or plate? Are you aware of how you eat?"
    },
    {
        "id": "d893b389d7694911ba0fabf39ee2e6fa",
        "title": "The garbage collectors",
        "content": "It is incredible how much rubbish we throw into the garbage bin. It always seems to be full. A garbage bin is never nice to look at and get near to. The smell can be quite strong. So we are very thankful to the garbage collectors who come and remove the garbage.\nThey normally come thrice a week. If they miss a day or two, then the garbage bins in my neighborhood overflow onto the road. This invites stray dogs and other scavengers. Only when the garbage truck comes again is the problem taken care of. So we can see how important these garbage collectors are.\n\nWhen they come, they usually make a lot of noise. Often they are moody. We bear with them because theirs is not a very pleasant job. It is dirty and smelly. Besides, God knows what sort of rubbish they have to handle every day. How they can stand the filth and stench I do not know. Perhaps they are used to it. I know for sure that they do not love their jobs. Who would?\n\nNevertheless, they do come regularly to perform an important job. On festive occasions we give them gifts, usually small amounts of money, as a token of appreciation for a job well done. Granted they are noisy, dirty and sometimes cranky, but how else can they behave when they have to do work that most people would not touch? Nobody would like to work as a garbage collector.\n\nAnyhow someone has to do the dirty job. The least we can do is make their job easier by keeping our garbage in proper bins and showing them a little appreciation now and then."
    },
    {
        "id": "c28dde39fa5c4e3eb556599f00fadb88",
        "title": "A close brush with death",
        "content": "It was raining cats and dogs. Fortunately we were in a car and my uncle, who was driving, had the situation under control.\nWe passed slowly by an oil-palm estate. The driving rain made visibility poor. So my uncle drove very carefully. He had all the lights on. So did the other drivers. I could make out little blobs of light on the other cars through the white sheet of rain.\n\nOverhead, black clouds hovered ominously. It felt as though they were about to fall on us at any moment. Lightning streaked across the sky and onto the distant hills. The ensuing thunder rumbled unceasingly. Some flashes of lightning came uncomfortably close and the resulting thunderclap was deafening, even with all our windows up.\n\nAll of a sudden a bright flash of light blinded us and a very loud crack made me lose my bearings. The next thing I knew was that my uncle had stopped the car and his face was pale with shock. I too was in shock. What had happened?\n\nFor a long agonising moment I struggled to collect my scattered wits. Then my uncle pointed a trembling finger at something outside the car. I looked in the direction and saw an oil-palm some ten metres away literally split in half through the middle. It was scorched black and smoking. I then realised that it had just been struck by lightning.\n\nIf the lightning had struck us instead, we would be scorched black and smoking too. Still trembling, my uncle quickly drove away from the danger zone. We had just had a close brush with death. It was close, too close for comfort."
    },
    {
        "id": "88a3809f98dc4f35bf88aeb228587c0c",
        "title": "Preparing for an examination",
        "content": "The Final Examination are just a couple of months away. It is important that I do well. So I shall have to prepare for it. In other words I need to revise and study what I have learned through the year.\nFirst of all I have to prepare a time-table of study so that I can divide my time properly to the various subjects. I shall have to devote more time to the subjects I am not so good at.\n\nI shall have two study periods a day, one from three to four in the afternoon and the other from seven to nine in the evening. I cannot study all the time for my mind will not be able to cope with it. So I must have some time to indulge in games and other forms of recreation. Then I can return to my studies with renewed vigor.\n\nI am not very good in Geography and History. So I have to spend more time with them. These two subjects require memorizing of many facts. In order that I remember the facts I need to do a lot of reading. Only then the facts will remain in my head. Also I need to read attentively or the facts will tend to be forgotten quickly.\n\nOther subjects require less memorizing. So I am all right with them. I only have to keep in touch with them and I should pass without any problem.\n\nOne last thing is necessary. I shall have to cut out time-consuming activities like socialising with friends, window shopping, watching videos and listening to pop-songs. I can do these things again once the examinations are over. Meanwhile it is 'action stations'! There is a battle to be won."
    },
    {
        "id": "1752deb9086344069dc4db3aad17193e",
        "title": "Punished  in  School",
        "content": "I was totally shocked when the teacher threw my exercise book at my face. She stood there glowering at me with her huge eyes. What had I done?\nNext, the boy beside me got the same treatment. One by one the teacher repeated her nasty actions on a total of five boys. The whole class was dumbfounded by her sudden outburst of anger. We were merely kids and were terrified of her. The fact that she was the headmaster's wife did not help matters.\n\nThen we were sent to the headmaster's office. The five of us did not know what we had done wrong, but it must be something terrible. Still, we walked bravely into the office.\n\n\"You are all trouble-makers, aren't you?\" the headmaster began. We looked at each other. What trouble did we make?\n\n\"I hear you never do what the teacher tells you. You are disobedient,\" continued the headmaster.\n\nWe protested but were told to shut up. Chong, my classmate, had his hands in his pockets and the headmaster said, \"Manners maketh a man. You've got no manners boy.\" Chong hastily took his hands out and stood at attention.\n\nThen the headmaster went on to accuse us of not doing our work properly, being ill-mannered and noisy, among other things. He was wrong most of the time. I admit that our work were not top-class material but the accusations were grossly exaggerated or totally unfounded.\n\nAnyhow each of us received a cut of the headmaster's cane. It did not hurt that much. What hurt was the injustice done onto us. We were punished for flimsy reasons but what could we do? We could do nothing but walk slowly back to class and try to get along with the tyrannous teacher."
    },
    {
        "id": "09644bdb6fe649508bcf5c4317093d43",
        "title": "Teachers, good and bad",
        "content": "Having been in school for a number of years now, I have come across many types of teachers. Some are good while some are not so good.\nThe good ones are those who put effort into their work. They care for the welfare of their students. They genuinely want to teach us what they know. So despite their weaknesses we love and respect them.\n\nOur present class teacher, Mr. Loga, is a model teacher. He not only teaches us English, but more importantly, what it means to be a human being. He is invariably patient, very approachable and always has a practical solution to any problem anyone may present to him. We are grateful for his guidance and advice.\n\nOn the other hand, our Mathematics teacher, is the worst of the lot. He comes in half-drunk and with a cigarette in his hand. Normally he just sits at the table and tells us to do exercise this or that. Sometimes he does not come at all. Rarely does he teach. When he does, it is almost impossible to follow him. His hands tremble and his speech is incoherent. So we are left to our own devices. Fortunately for me Mathematics is not too difficult. So I can cope, even without a teacher. Unfortunately for some, it means the difference between passing or failing. So some of them have resorted to taking private tuition.\n\nIn between these two are the other teachers. Some are good in some ways and bad in others. However all of them are predictable. So we know what to do when in their presence. The good ones we appreciate and respect. The bad ones we tolerate.\n\nIt is not for me to judge the teachers. They run their lives as they see fit. I wonder what they will write about us if they were to write an essay entitled \"Students, Good And Bad\"."
    },
    {
        "id": "874277484a984dadabb9d60932ea8505",
        "title": "A visit to a jungle",
        "content": "A tropical jungle is an awesome place. I had the opportunity of visiting one recently.\nMy friend Rahim, who works as a forest ranger, took me along on one of his trips into the jungle. I had wanted to experience for myself first-hand what he had always spoken about.\n\nThe moment we entered the jungle, a sort of semi-darkness enveloped us. The sky was almost completely shut out by the canopy of leaves high above us. At ground level, thick vegetation grew in every direction. The air was damp and had a peculiar smell to it.\n\nAll around us were the sounds of insects, birds and animals. Though we could not see them, except for some birds, we knew they were there. The sounds echoed all over, making the jungle feel eerie and strange.\n\nI had no idea how Rahim could find a way through the bushes and trees. He said he was just following a path used by the aborigines. As far as I was concerned, I could not see any path. I realised then how easily an inexperienced person could get lost and perish in the jungle.\n\nNevertheless I followed Rahim as we trudged along slowly. The most uncomfortable thing about being in the jungle were the leeches. These little bloodsuckers never gave up. Despite thick boots and clothes, they still managed to bite me.\n\nFor the first time in my life I saw strange birds, insects, huge spiders, snakes, trees, flowers, vines as thick as a man's hand and various animals. The experience was unforgettable. I was awestruck by the might of nature.\n\nWhen we emerged from the jungle I felt as though a great weight had been lifted from me. The clear blue sky was a welcome sight. Outside, the world was definitely easier to cope with. The jungle made me feel hemmed in and helpless. It was a good experience but I would prefer to remain outside it."
    },
    {
        "id": "4a75ca1fcee14f4389f8c5f3e57ec58b",
        "title": "My first acting role",
        "content": "The first time I acted in a play was when I was in Standard Three. Come to think of it, it was the only time I acted in a play.\nI was chosen to play the role of a farmer. Rathi, the prettiest girl in class, played the role of the farmer's wife. So I felt a little elated about my role.\n\nWe spent a whole week rehearsing the play. Learning the lines by heart was tedious. The first rehearsal was a disaster as we fumbled our lines again and again. After half a dozen rehearsals we managed to get things right. It was all very tiring.\n\nThe script required me to climb up a mango tree to pluck some mangoes. Obviously we could not put a mango tree in the classroom. So we improvised by hanging a mango by a string from the ceiling with a ladder below it. Those were the props, placed right in front of the blackboard.\n\nFinally the day of the play came. I went on stage, rather, in front of the classroom, with my fellow actors and actresses and performed our parts. Everything went smoothly. We never got stage-fright, thanks to our rehearsals and familiar audience of fifteen children. About half the class were the performers, the rest audience.\n\nNow, a few years later, I cannot remember a single line of the play. The only thing I remember clearly is that I enjoyed eating the mango during the play."
    },
    {
        "id": "898a57a6c17a45028308fb35db3f6047",
        "title": "Crew  Cut",
        "content": "The day I went to school with a crew cut, I was greeted by roars of laughter and plenty of comments. I really looked funny with a crew cut but I was forced to have my hair cut that way. It was my foolishness and my cousin's fault that it happened. Here is how it happened. The monthly ritual of visiting the barber to get my hair cut was tedious. Long hair was like a sin and mine was beginning to cover my ears. My cousin reckoned that he could save me some money if I let him cut my hair. He assured me that he knew how to do it properly. So foolishly I allowed him to use a pair of scissors on my hair. After five minutes of his handiwork, one look in the mirror told me that it was a disaster. His scissors had created havoc on my beautiful hair! I protested but he assured me that he had not finished and the finished product would be great. It became even worse. The cut was so uneven and haphazard that I had no choice but to visit a real barber to correct the damage. The barber laughed and said that the only remedy was a crew cut. So I reluctantly agreed to it. The final result was that my hair looked and felt like bristles, being only two or three millimetres long. At least it looked better than the mess my cousin made. I found that a crew cut was not too bad after all. I did not have to comb my hair and my head felt much cooler. As for the laughter and comments, they stopped after a while."
    },
    {
        "id": "2aa6e73181054d448701b4789ddb0587",
        "title": "At a shopping complex",
        "content": "My mother and I took the lift from the second level of the underground car-park to get to the ground floor of the shopping complex. The moment we stepped out of the lift we were greeted by a blast of cool air and the blare of music from a music shop nearby. The car-park was dark and gloomy. The ground floor was bright and lively.\nWe were at the foyer of the huge shopping complex. There were many people there. I could see a goldsmith's shop, two music shops, a pharmacy, two book stalls, a video shop, an optician's shop and a large super- market.\n\nTwo very old guards sat in front of the goldsmith's shop. They were nodding off. I wondered if they could cope if robbers were to come to the shop. It did not look like they could.\n\nA \"cheap sale\" of clothes was going on in the middle of the foyer. The crowd there was so thick that it was impossible to get near the clothes. We walked past the mad crowd and into the supermarket.\n\nThere were rows and rows of goods in the supermarket. We picked out the things we wanted and put them in a trolley. When we had finished I pushed the trolley to the check-out counter where my mother paid for the things we took. Fortunately there were few people in the supermarket. The cheap sale had attracted the crowd. So it did not take us long to buy what we came for.\n\nWe came out of the supermarket and passed the mad crowd. I noticed that one of the old guards at the goldsmith's was actually snoring! Anyhow we proceeded to the lift and left the shopping complex."
    },
    {
        "id": "b931be10a4464a679d6c8f2e049799a5",
        "title": "A  painful  lesson",
        "content": "Our bodies are made of flesh and bones. Anytime any part is injured we feel pain. So we try to avoid injury as much as we can. Usually it takes a painful lesson to teach us to avoid injury. The following was a particularly painful one.\nI, like any young child, love to run around as quickly as I can. It is fun. However, there is danger of falling down which can result in painful injuries.\n\nOne day while playing \"catching\" with some friends I happened to run down a hill. I found that running down a hill was easy and I could go very fast. At the spur of the moment I decided to see how fast I could go. So I ran with all my might.\n\nAlas, I ran too fast for my legs to keep up. One moment I was running, the next I fell sprawling onto the tarmac road. The shock was horrible as I scraped along the hard surface of the road.\n\nThe pain was intense as I lay on the road writhing. My hands, legs and face were bleeding from the many parts where my skin had been scraped off. When my friends came to help me they were horrified to see me in such a bloody mess.\n\nAnyhow they summoned help and I was taken to the hospital. There they cleaned and dressed my wounds. All the time I felt as though I was on fire.\n\nI suffered for two weeks thereafter every time they changed the bandages. It was terrible.\n\nI learned my lesson. It is foolish to run down a hill."
    },
    {
        "id": "25cf41308d5f44299d38578694cf6608",
        "title": "How I spent the weekend",
        "content": "Nothing extraordinary happened last weekend. It was just like any other ordinary weekend.\nI got up later than usual on Saturday morning. After breakfast I went over to my friend Arul's house and spent some time reading comics there. Arul has tons of comics. His father buys the latest for him. Being his friend, I get to read them too.\n\nWe read comics till lunch-time. Then I went home, had lunch and took an afternoon nap. Taking an afternoon nap is a pleasure that I can indulge in only on weekends. On weekdays I do not have time for it.\nThe rest of the afternoon I helped my father in the garden uprooting weeds and trimming the hedge. We continued until darkness fell. After that I had my bath and dinner. After dinner I watched television until it was time for bed.\n\nI got up late too on Sunday morning. For breakfast I had cornflakes with milk while listening to the radio. Then I spent the rest of the morning doing homework.\n\nAgain I took a nap after lunch. Then I finished up my homework.\n\nBy the time I was done with the homework it was already evening. So I took a stroll around the neighborhood. It was a great feeling to be able to relax after all the homework had been done.\n\nAfter dinner, I packed my books in my bag and went to bed early. I had to get enough sleep otherwise I would fall asleep in school the next day. Thus ended yet another weekend."
    },
    {
        "id": "ec03e5c7cbc34904b52dc33aa02fbbd3",
        "title": "Turning over a new leaf",
        "content": "Ah Keong was the naughtiest boy in class. In fact I would say that he was the naughtiest in the whole school. He always seemed to get in trouble with the prefects and teachers. The prefects avoided him and the teachers had a hard time controlling him.\nHe was destructive to say the least. Our classroom did not have a single window pane. He had broken them all. Over in a corner lay a heap of broken desks and chairs, the result of his handiwork. He had been caned twice in front of the whole school for his misdeeds but he remained unrepentant. I was sure that he would be sacked from school if he carried on like that.\n\nOne day Ah Keong's mother died. For a whole week he was absent from school. When he returned he was totally changed. I nearly did not recognize him. For a moment I thought we had a new classmate, but it was Ah Keong all right, well-groomed and neatly-dressed.\n\nNot only had his appearance change. His behavior also changed dramatically. He became the most well-behaved boy in class. No longer did he break chairs or anything else. The teachers and prefects were visibly shocked, but they were glad for it.\n\nIt was a miracle that Ah Keong turned over a new leaf. One day he confided to me that it was his mother's death that changed him. He realized how horrible he had been just before his mother died. So he made a promise to his mother at her deathbed to behave himself. This promise he had kept.\n\nI am glad for him. He is now a pleasure to be with and one of my best friends."
    },
    {
        "id": "5a4a6c3ca4cd466ba8b63d14780690f4",
        "title": "Visiting a book fair",
        "content": "A Book Fair was being held in the Town Hall. So one morning our teacher said that we were going to visit it. We cheered loudly for it meant that there would be no lessons for the day.\nWe lined up outside the classroom. Then we marched in pairs out of the school, up the pedestrian bridge, down the other side of the road and into the Town Hall just a few hundred meters from our school.\n\nAt the Town Hall we were told to behave ourselves. If we wanted to buy any book, we were to take it to our teacher. Then we gleefully buried ourselves among the vast number of books on display there.\n\nThere were so many books there. It was impossible to look at all of them. So I spent my time browsing mainly among the books on wildlife and nature, my favorite.\n\nAs much as the books were wonderful, the price was discouraging. I could not afford to buy any of them. I would have to ask my mother to buy one for me later on.\n\nTime flew. Two hours seemed like two minutes. Soon our teacher told us to assemble at the front door. There she helped those buying books pay at the counter at a special discount. Not many of us bought books. They were too expensive. I did not buy any.\n\nAfter paying for the books we lined up and marched back in pairs to school."
    },
    {
        "id": "ee4df91362684eb4a8b66f624ddb6980",
        "title": "How I can stop wasting things in the house",
        "content": "We are lucky to live in a rich country where we have many things at our convenience. However we tend to be wasteful.\nElectricity is one thing we waste most. Lights, fans, radios and other appliances are kept on even when no one is using them. I make it a point to switch them off when I do not need them. It takes less than a second to throw a switch but to some people even this seems a difficult task. Anyhow, not wasting electricity reduces the bill appreciably. Thus we do not have to pay for the electricity we do not use.\n\nThe other wasted commodity is water. Leaky pipes and faucets plus the negligence of leaving taps running all contribute to this wastage. Fresh water is precious, so it is not to be wasted. It is only a simple matter of shutting off a tap after use. I make sure I do this.\n\nAnother big wastage is food. My mother used to cook so much food that much of it was simply thrown away. She knows better now. I pointed out to her about how we wasted food. She realised it and now cooks only what we can eat. The garbage bin used to be filled with half-eaten cakes, fried chicken and things we thought we could eat but could not. It is not so anymore. Besides, we do not waste money on food we throw away.\n\nWe waste other things like tissue paper, clothes, soap, talcum powder and aerosol sprays. All these cost money. In short, we waste the money we work so hard to earn.\n\nIt is definitely better not to be wasteful. I discover there is a simple method of not wasting things, which is -- use only what we need. Do not touch what we do not need. In this way we can stop being wasteful."
    },
    {
        "id": "c9aa50af315f4ff1bf3f9e3b29b9f25f",
        "title": "Games I like to play",
        "content": "The games I like most is badminton. All it takes is a willing partner, two rackets and a shuttlecock. We do not even need a net. After all we simply enjoy hitting the shuttlecock to each other. My sister and I spend hours doing this just about everyday. We are not going to be world champions. It is simply great fun.\nWe used to do this with two old toy rackets. Since then our father had bought us two real, although cheap, rackets. I must say we enjoy the game even more. Sometimes even my mother comes to join in the fun when she has the time for it.\n\nThe other game I like to play is table tennis. We have an old table, two bats and some balls. So on some days we play table tennis instead. This is a game that requires more skill. We cannot even hit the ball onto the table half of the time. This can be frustrating. So we go back to badminton which is far easier and more fun.\n\nSince we play outdoors we are at the mercy of the weather. We often have to pause when the wind is too strong. It is difficult to hit the shuttlecock properly when the wind blows it away. Sometimes it rains, making it impossible to play.\n\nI do play other games in school like basketball and football. Somehow they do not seem to be much fun. So I stick to badminton and table tennis."
    },
    {
        "id": "6454ed55aa5141d1a3bcfc912d00efaf",
        "title": "Walking in the rain",
        "content": "As I descended the steps of the bus, I saw dark clouds in the sky. It looked as though it would rain.\nI walked briskly toward home which was a good kilometre away. My mother had warned me about getting caught in the rain. I might catch a cold or something. I wondered if I could get home before it rained.\n\nAs if in reply to my thought the rain came down. I wanted to run for it but my heavy schoolbag discouraged me from doing so. So I walked on. Soon it was raining cats and dogs.\n\nIn a short while I was drenched from head to toes. Instead of feeling miserable I was actually enjoying it. The feeling of cool water running down my wet body was quite pleasant.\n\nFinally I reached home. My mother was shocked to see me soaking wet. She hurried me to the hot shower after which I put on clean dry clothes. She was worried that I might get sick.\n\nWell, I did not. In fact I felt great, having had such a wonderful experience walking in the rain."
    },
    {
        "id": "8eef23b13cfa4fc8a23257b65d72f91a",
        "title": "A visit to a doctor",
        "content": "One morning I woke up with a very sore throat. I could not swallow without feeling great pain. I told my mother about it.\nShe decided that I should skip school that day. She was going to take me to see a doctor.\n\nAt 9 a.m., my mother and I took the bus to town-to see our family doctor.\n\nWe waited for a while at the clinic before I got to see the doctor. Dr. Lee examined me carefully. I had a slight fever and other symptoms that indicated that I might be coming down with influenza. So he gave me an injection and prescribed some oral medicine for me. He also wrote me a medical certificate so that I could be absent from school for a couple of days.\n\nBy the time we reached home, my throat was definitely not as sore as it was before. The injection must be doing its work.\n\nI took the oral medicine diligently and after two days of rest I was well on my way back to health again."
    },
    {
        "id": "a4bbfff8a3c24430b56b2faf5279b69c",
        "title": "The air we breathe",
        "content": "The air we breathe is a mixture of many gases, of which oxygen is the most important. If we were not able to breathe this precious air for even a few minutes, we would die. Thus air is vital to us.\nAir is vital too to the plants and animals that live on earth. We are all surrounded by air. Our bodies live and move in it. Thus it is important that the air remains clean and pure.\n\nAlas, modern man has polluted the air. By constantly emitting poisonous gas and fumes into the air from his factories and other devices, man is threatening his very own survival. The air we breathe now is filled with unnecessary and harmful pollutants. If this is allowed to increase then one day we may not have any more clean air to breathe.\n\nThe choice is ours. Stop polluting the air and we live. Keep polluting the air and we all perish."
    },
    {
        "id": "4d44798f846147c586942eb38514b8b4",
        "title": "Teenagers, Beware the Pitfalls!",
        "content": "Teenagers today must be ever vigilant to the many distractions and dangers that surround them. Knowing what these pitfalls are will help teenagers avoid trouble and have a happier teenagehood.\nFirst on the list are those distractions that take them away from their studies. Students owe it to themselves and their parents to put in their best efforts in their studies. At all times therefore, teenagers must make it a point to be conscious of the fact that their studies ought to come first. This strategy will help them get their priorities right. Complete that piece of homework or revise those chapters for the examination before you decide to hang out with your friends. Studies must come first.\n\nNext, let's talk about parents. Parents are wonderful people. They always have the best interests of their children at heart and they will do anything to prevent their children from getting hurt. However, teenagers often think that parents do not understand them and they are unable to communicate with their parents. So these teenagers are rude to their parents and become utterly selfish at times. If teenagers are a bit more appreciative of their parents and try and put themselves in the shoes of their parents, they will then be able to know how their parents think and feel - of their fears and dreams for their children.\n\nNow let's turn to the topic of friends. Friends are wonderful to have. Good friends are always there for you, just like parents. But there are friends you who may turn out to be bad influences and can lead you astray. Then there are friends who can inspire you and propel you to achieve great heights. So how do you distinguish the good from the bad ? In this respect, young people must learn to think for themselves. Reflect constantly on events, people and ideas. Learn to see through people. Hold on to sound moral values and principles. These will definitely help you discriminate the good from the 'bad'.\n\nBeing a teenager is not an easy thing. This is the time when there are many temptations and when you grow as a person. Therefore, sticking to the three points mentioned above would make life easier for you. First of all, concentrate on your studies because this will determine your future. Secondly, understand that your parents want the best for you. Lastly, choose your friends wisely."
    },
    {
        "id": "c772a2ad76804577bcfd803d96987597",
        "title": "Smart Studying",
        "content": "\"Studying smart\" is a phrase often used by students, parents and teachers to mean \"studying in an intelligent and effective way\"\n\nNot all methods of studying are intelligent or effective. For example, a person who does not pay attention in class or who does not do his homework on time is certainly not intelligent. He will not learn effectively and his grades will suffer. The result of this is that he will not be able to keep up with his peers. Even if he goes for private tuition he will be always trying to catch up, if he ever does at all.\n\nSo the first thing about studying smart is to pay fullest attention when a lesson is first being taught in class. Your learning will be quick and effective. Ask questions if there is anything that you do not understand. The teacher will be pleased to help. Do your homework and assignment on time and you will never have a backlog of work. You are ever ready for the next lesson.\n\nFurthermore, being up to date with your school work means you do not have to take private tuition on any subject. this saves money and you will have time for leisure or recreation.\n\nRevision books and guides are aplenty these days. Use them with care. Having more than one revision book per subject is waste of money. Also learning from too many books only serves to confuse you and take up precious time.\n\nFinally, know the format of the examinations and practice the previous years' questions to familiarize yourself with them. When the actual examinations come, you will know how to handle the questions."
    },
    {
        "id": "23d7f6ec69ff46d7ac20916f54db646a",
        "title": "A madman",
        "content": "Every town seems to have at least one madman running around loose. It is no different in my town. There is one madman that I encounter almost every day.\n\nHe is young and slim, but like all mad people that I have encountered, he is filthy. He probably has not taken a bath for years. His waist-length hair is matted and coiled. He wears what's left of a T-shirt, frayed and with many holes. One can only guess what the T-shirt's original color was. Now it is simply dirty brown. It is the same with his shorts.\n\nHe is a dark-skinned fellow but the filth on his body makes him look much darker. Combined with his clothes, he is just a walking piece of grime and filth. People give him a wide berth wherever he goes.\n\nWhile his appearance is bad, the body odor is worse. The stink becomes noticeable from about two meters. Anything closer than that will nicely fit the phrase \"stinks to high heaven\". For one thing, he will never ever find people crowding around him. He will have maple personal space wherever he goes. Nonetheless he does not get to go into buses, shops or public places where people gather. He gets shooed away, for obvious reasons.\n\nDespite his unpleasant appearance and smell, he is a pretty harmless fellow. He goes 'happily' walking around town every day. Blazing sun or driving rain does not seem to bother him. He could be dry as a bone on one day and wet as a drowned rat on another. A normal person would have suffered a heat stroke or caught pneumonia, but this madman seems immune to normal afflictions. Rain or shine, he can be seen walking on the streets, muttering to himself or taking with some invisible person.\n\nI suppose it would be a matter of time before the authorities round him up put him away somewhere. Meantime he just goes around town reminding clean, normal and harried people what it means to be filthy, mad and be without a care in the world."
    },
    {
        "id": "622554793f994ea2a6bf5d0034cc3600",
        "title": "Describe an exhibition that you have visited",
        "content": "The book exhibition was held from Friday to Sunday in the town hall. It was jointly organized by the Education Department and a local book shop. On the very first day, I walked over to visit the exhibition immediately after school was over.\n\nThere were already many people at the exhibition. Most were school children like me.\n\nThe good thing about exhibitions is that usually there are free gifts and items on offer. This exhibition was no different. At a counter near the entrance, I registered to be a member of the book shop and I received a small calculator as a gift.\n\nInside the hall proper, I was amazed by the number of books on display. There were books on computers, science, technology, music, cookery, travel, business, self-help and general interests. Other types of publications include encyclopaedias, maps, novels, greeting cards, magazines and children's books. Also available were computer software, compact discs and other items published in electronic media. The town hall was fairly large yet every bit of space was made use of to display the items. Most of the items were arranged in shelves or on tables.\n\nI noticed that there was a crowd over at a corner. So I ventured closer to have a look. As expected, items were on offer there. No wonder there were so many people. Slowly I inched my way into the crowd to look at the items.\n\nAfter looking though the items, I purchased a CD entitled \"Our Solar System and Beyond\". It was a good buy.\n\nNext I moved on to less crowded areas and look at the books. There were many that I would love to get my hands on but alas my financial status did not allow it. So I browsed through as many as I could. In that way I happily whiled away a whole afternoon.\n\nTime passed quickly. My watch showed 5.00 p.m. and I had not even seen half of the exhibition. Anyhow I had to get home before my mother started wondering about me. I would have to come and visit the exhibition another day. So reluctantly I stepped out of the town hall and walked towards the bus stop."
    },
    {
        "id": "198cbfc240004baf849d14a7cd6c3ee9",
        "title": "The Internet",
        "content": "The Internet began in the Eighties. Today it has grown to become a major means of communication. Websites and emails, things that were unheard of just two decades ago, are quickly gaining in popularity and usage.\n\nVia a computer, a person can access the Internet and the numerous websites in it. There are websites on just about anything anyone can think of. Information, files, photographs, video clips, computer software, games etc can often be obtained free or for a fee from some websites. Online shopping, banking and other services make it a cinch for an ordinary person to perform regular chores from the comfort of home or office.\n\nA very popular feature of the Internet is the use of email. Using email, persons at any part of the world can communicate with one other in an instant. The cost of sending an email is almost nothing. On top of that, files and pictures can be attached and sent together with the email.\n\nDespite its obvious usefulness, negative things are also present on the Internet. Viruses, worms, Trojan horses and other harmful programs wait to strike at the unwary user. Accessing the Internet without the protection of an anti-virus program or firewall is a sure way of getting infected. The result of infection varies from a simple obscene message on the screen to the complete erasure of the files and records in the computer.\n\nThen there are sites that promote pornography, anarchy, terrorism, Satanism, black magic and other threats to the well-being of our world.\n\nUsing the Internet is no different from dealing with our daily living in the physical world. We sue it but we take precautions to avoid the obvious dangers and negative elements in it."
    },
    {
        "id": "f49906015e5b4fbdbf7a54bc6c60a979",
        "title": "Cheating",
        "content": "Cheating has become a very common activity in our modern society. Many people indulge in this practice to make a quick buck without too much effort.\nThere are many instances where innocent people have been made to part with their money by confidence tricksters selling \"magic stones\" and charms that will bring prosperity to the users. After paying exorbitant sums for these fake articles, the gullible buyers ultimately realize that they have paid hard-earned money for worthless pieces of junk.\n\nThen, there are the big-time crooks. These people set up huge counterfeiting operations to produce imitation goods. Branded clothes, handbags, belts and other accessories are copied closely and produced at a fraction of the genuine articles' cost and sold as originals. Even toiletries and over-the-counter medicine and are being unscrupulously imitated.\n\nLately, there has been a rise in the manufacturing and selling of pirated compact discs. All forms of CD's are being pirated: audio CD's, video CD's and computer software. CD piracy has become such a big business that both the entertainment and information technology industries are alarmed at this trend that cuts deeply into the profits of the legitimate copyright holders.\n\nIt seems impossible to stop all these cheating activity. The authorities are doing their best to curb such practices but we must also do our part. We should not let greed or superstition make us victims of confidence tricksters, never patronize dealers of ill repute that sell imitation goods as originals and keep away from touts and pedlars that hawk pirated compact discs."
    },
    {
        "id": "6424bcbb2a7641c8ba54e26e38994d7d",
        "title": "A visit to the night market",
        "content": "Describe the scene at a night market that you have visited\n\n \nEvery Thursday from 6.00 p.m to about 10.00 p.m, a night market is set up on the road in front of a row of shop houses near where I live. There are many vendors plying their wares at the night market, and it has become a regular thing for me to visit the night market.\n\nOne Thursday evening at about 7.00 p.m, my sister and I paid a visit to the night market. It was not completely dark yet but the vendors had already lit their portable fluorescent lamps. From a distance the lamps seemed to add brilliance to the living sea of human bodies that had congregated at the market.\n\nWe stepped into the market carefully as there were many people there. In fact, we had to be careful not to knock into the other shoppers. Our first stop was the food stalls. There were vendors selling cakes, biscuits, buns, dumplings, dim sum, noodles and many other local tidbits and delicacies. we bought some buns and dumplings for my parents and other siblings at home.\n\nWe then walked over to the fruit stall to buy some fruits. Next to the fruit stall, a medicine seller had set up shop and was talking himself hoarse extolling the efficacy of his medicine to half-interested shoppers. Poor man, if he went on like that, he might need the medicine himself, whatever it was good for.\n\nNext, we stopped and bought some vegetables at our regular vegetable stall. That was the last thing we needed to buy. As it was still only 7.30 p.m. we decided to walk around a bit and look at the things on sale.\n\nThere were people selling toys, pirated video CDs, clothes, belts, books, posters, mobile phone casings, balloons, crockery and all sorts of goods. Business seemed to be good for most of the vendors. There was no shortage of buyers. Everyone seemed to have something to sell or to buy. The sight, sound and smell of the market were really quite intense. So after spending another ten minutes or so in the market, I yearned for the peace and quiet of home. So I motioned to my sister to go home.\n\nTogether we walked carefully out of the night market and headed home."
    },
    {
        "id": "c700b19a8c2041faac41f7f10a1db77b",
        "title": "Describe an encounter with a stranger",
        "content": "I first saw her standing by the roadside. For a moment she looked like a normal old lady wanting to cross the road. Then I noticed that she was hesitant about crossing even when the road was clear.\n\nQuickly I walked over to her and offered my hand. She took it. But as I tried to lead her across the road, she resisted and said, in English, \"I want to go to church.\"\n\nWell, I had assumed wrongly she wanted to cross the road whereas she wanted to go to a church on this side of the road. Still, why was she standing by the roadside appearing to want to cross ? I looked in the direction of the church and saw her problem.\n\nBetween us and the church's entrance was a kerb meant for pedestrians to walk on, but inconsiderate people had parked their motorcycles on the kerb making it impossible for anyone to walk on it. She was forced to walk along the road, and she did not seem to be able to cope properly.\n\nShe was at least seventy and showed signs of geriatric degeneration. Her steps were small and uncertain. She should not be out on her own. Anyhow I led her by the hand step by step along the road towards the church. On the way I suggested she get a walking stick. She replied that she already had one given to her by her daughter. She said that she was just too shy to use it in public. I would never have guessed that an old person could be shy, but I guess they are still human, despite their age.\n\nThe reason for her to go to church was to attend a function that was being held there that evening. It took about three minutes for us to walk the thirty or so meters to the entrance. There one of her church members recognized her and came over to greet her. The old lady thanked me for helping her.\n\nI nodded my head, released my hold on her hand and headed off to where I was going originally before I encountered her."
    },
    {
        "id": "a3de1e2ba56a4e13b5172badda70494f",
        "title": "The garbage truck",
        "content": "There is no mistaking the sound of the approaching garbage truck that comes thrice weekly to collect the garbage from the houses in our area. The roar of the diesel engine compounded by the puffing sound of black smoke from a broken exhaust pipe is a clear signal for residents to bring out their garbage. Furthermore, the local dogs add to the din with their confounded barking each time the truck comes.\nThe yellow garbage truck comes almost half-loaded with garbage already collected. I remember that it was new about a year ago but constant usage makes it look old and filthy. I guess it cannot help but be filthy for all the garbage it holds. The yellow paint is now a dirty brown. Five men are perched on its side.\n\nThe truck stops near my house. The men alight and go about collecting the garbage bags from the houses. They dump the bags into the back of the truck. The driver then operates the device that compresses the garbage deep into the middle of the truck. It is a wonder how much garbage the truck can hold.\n\nWhen the garbage is being compressed, foul-smelling liquid leaks onto the road as a result. This is a small inconvenience that we have to put up with. Anyhow the garbage is compressed within a minute. The men hop on the truck and off they go to another part of the housing estate to continue their garbage collection.\n\nIt is a small but important event in our lives every time the garbage truck comes because it takes away the garbage that would otherwise clutter up our living space. There were occasions when the truck did not show up as usual and we know how bad things can get. Bins overflow and the foul stench of rotting garbage is quite unbearable. Dogs, crows and rats rummage through the rubbish and distributing it all over the neighborhood. The return of the garbage truck s like heaven sent. We breathe a sigh of relief when it comes.\n\nStinking and dirty it might be, but the garbage struck is a very necessary part of our lives."
    },
    {
        "id": "dae951daf6044279b75e0efcee7fbce4",
        "title": "The scene at a shopping complex",
        "content": "It was Saturday. There was a good movie playing at the Cineplex on the top floor of Terminal One Shopping Center. Cathy, Shelly and I intended to catch the 12.30 show.\n\nWe met at the entrance to the shopping center at about 11.30 a.m. The complex had opened about an hour and a half ago and already it was teeming with people. Most of them were youngsters like us. We were out in town to have some fun and enjoy the weekend.\n\nOn the ground floor was a huge stage that was being prepared for some charity show later on in the evening. Workers were busy decorating the backdrop and setting up the props for the occasion. Someone was testing the public address system and the sound coming from the giant speakers was very loud. So we moved away from the stage and rode the escalators up to the top floor where the Cineplex was.\n\nA long queue had already formed in front of the box office. Cathy volunteered to get the tickets. Shelly and I agreed and we gave her our money. So while Cathy joined the queue, Shelly and I went over to the food stalls and bought some popcorn and drinks.\n\nThe crowd on the top floor swelled and the queue grew longer. we were glad that we were early. Judging by the length of the queue, there was a possibility that some of them were not going to get tickets.\n\nCathy still had some people in front of her, so we decided to visit the shops nearby. We wandered into a bookshop. The shop was having a sale and many items were offered at 20 to 70% discount. I looked at some novels but decided I could not afford any of them despite the discount. Shelly picked up some stationery but decided to put them back when she saw the long queue at the checkout. The movie was going to start soon and there would not be enough time to pay for the stationery.\n\nWe left the bookshop. It was already 12.25. So we walked to the entrance of the Cineplex. Cathy was already there with the tickets.\n\nWe gave the tickets to the usher at the entrance. With popcorn and drinks in our hands, we walked into the Cineplex to watch the movie."
    },
    {
        "id": "cece61c9a45949f4acb3f4a743b4bb36",
        "title": "Describe what you think it would be like to spend some time on the moon",
        "content": "To date, only some astronauts have been to the moon. Certainly I would like to spend some time on the moon, but that seems to be impossible for the moment. Anyhow, based on what I have read about the moon, I can imagine what it is like to be on it.\nThere is no air on the moon. The implications are obvious. I will always nee to wear a spacesuit that has its own air supply. Never will I be able to walk around in T-shirt, shorts and sandals. Without a spacesuit, my eyeballs and other organs will possibly explode because there is no atmospheric pressure to help maintain their size and shape.\n\nSecondly, there is no water on the moon. So there are no rivers, seas, ponds, rain, snow, clouds, thunder or lightning. The moon is a pretty desolate and silent place. In fact, it is lifeless as no living organism as we know it can survive there. So there will not be any other animal or vegetation on the moon, just rocks an sand.\n\nAnother consequence of the absence of air and water on the surface of the moon is that the sky will always appear black. There are no clouds and air to produce the effect of a blue sky that we so familiar with on earth.\n\nThe force of gravity on the surface of the moon is about one-sixth of that on the surface of the earth. This means that I will only weigh one-sixth of what I weigh on earth. Thus I should be able to jump much higher and further than on earth. I can imagine breaking the world's high-jump and long-jump records with every step I take. As gravity is low, movement will occur in actual slow-motion.\n\nIt would certainly be quite an experience to be on the moon. Things are quite different compared to those on earth. still I think I prefer things here on earth where my body is made for. I don't want to be wearing an oversized spacesuit and living in contained quarters indefinitely. It is far better back on earth where I am bale to run free on the beach, take a dip in the sea or simply lie back on the cool grass and look at the moon."
    },
    {
        "id": "4abebaed9a094e539ef9a3a958afb008",
        "title": "A busy eating place",
        "content": "It was about twelve thirty when Gary and I arrived at the newly-opened chicken-rice shop. We expected the place to be packed with people but what greeted us at the shop was beyond expectation.\nThe twenty or so tables in the shop were fully occupied. There were at least a hundred people crammed in the shop and the sound of a hundred voices talking at the same time was reminiscent of the market place. The place had air-conditioning but it was obviously not strong enough to cope with the crowd there. I saw some diners wipe their faces with tissue paper as the hot food caused them to sweat. We waited outside the shop in the midday heat and sweated as well.\n\nIt took about fifteen minutes before we could get a vacant table. it was a small table placed against a wall but it was better than nothing. Gratefully we sat down but had to wait again for a waitress to take our order.\n\nThe shop was clearly short-staffed. They had only three waitresses. But I could understand that it was their opening day and they had not expected such a crowd. The waitresses could hardly cope. So we sat down for another five minutes before a waitress came to take our order. Then we waited for the food to be brought.\n\nAnyhow there we were, sitting in a noisy, not-so-cool, air-conditioned chicken-rice shop. It was not exactly an ideal place to have lunch but we just wanted to try the food.\n\nEventually our order arrived and we set about having our meal. The chicken rice was only average. We had expected it to be something special after reading about the 'special chicken rice' in the newspaper. It was not excellent, but it was not bad either. Certainly it was nothing special. So we quickly finished our meal, paid for it and left the shop.\n\nAt the entrance there were still people waiting to have a taste of the 'special' chicken rice. Well, we have had our taste and they would have theirs in due course."
    },
    {
        "id": "6dd1a2ae5f7243bf9f1b841ec05e677b",
        "title": "Keeping a healthy lifestyle",
        "content": "Living a healthy lifestyle is the top priority for many people. Yet, today because of our busy schedules and hectic lives, we are unable to live a healthy lifestyle. A healthy lifestyle includes eating balanced meals, having regular exercise, getting enough sleep and having some recreational activities.\nTaking balanced meals with the right amount o carbohydrates, proteins, fruits and vegetables is vital for a healthy lifestyle. Regular exercise will not only keep your body trim and fit but it will also reduce your risk of developing heart disease and diabetes. Exercising on a daily basis for at least 30 minutes per day will do wonders for your health.\n\nYou should sleep for about 7 to 8 hours a day. Doing so will help your body to replenish itself. Lack of sleep will make you feel tired. It will also affect your concentration. Take part in recreational activities. There should be a balance between work or study and leisure. Remember, \"All work and no play makes lack a dull boy\".\n\nA the same time, keep away from unhealthy habits and activities. Stop smoking as it is harmful to health. Not only doe smoking cause life-threatening diseases like heart disease and lung cancer, it will also cause wrinkles and lead to premature aging.\n\nPeople who live a healthy lifestyle tend to be healthier, live longer and are happier. On the other hand, people who do not live a healthy lifestyle are prone to illness and stress."
    },
    {
        "id": "3e2888c53282402baed088f7e9959f4c",
        "title": "A hit-and-run accident",
        "content": "It was the school holidays ! For many youngsters it was a time for fun and games.\nIn one particular housing estate, the children enjoyed riding their bicycles around the area. The housing estate in which they lived in was relatively quiet and it was quite safe to ride their bicycles on the road, but as young boys go, they can tend to get a bit reckless sometimes, too reckless for their own good.\n\nThe residents of the area were usually careful when they drove their cars. Even so there were several near misses as the drivers had to avoid the reckless young children on their bicycles. The children had no knowledge of traffic rules and they did pretty much as they pleased. Their parents never educated them about road safety. In effect, the young cyclists were just accidents waiting to happen. It was just a mater of time before something tragic happened.\n\nOne evening as a group of five children was tearing down a road on their bicycles, a van suddenly shot out of a side road right in their path. The driver was obviously a stranger to the area and did not see the danger until it was too late. He braked hard and swerved his van in an attempt to avoid hitting the young cyclists. Tried as he did, he could not avoid hitting the leading cyclist. The front end of the van collided with the young cyclist with a sickening crunch. The boy was flung onto the road.\n\nThe van stopped and the driver opened the door, but he did not get out. Instead he closed the door, reversed his van from the fallen boy and the wrecked bicycle, engaged a forward gear and sped off. He did not want to hang around to deal with the angry residents knowing full well that he might be bashed up or perhaps even killed.\n\nIt was just as well that he fled for soon the residents ran out of their houses and onto the scene of the accident. the boy was still alive. One of the men lifted him up, put him into a neighbor's car and took him to the hospital.\n\nFor more than an hour after the accident the angry residents milled around the area uttering curses. However nobody had noted down the number of the van. All they knew was that it was driven by a young man, nothing more. To this day the identity of the hit-and-run van is unknown. The accident victim is alive but walks with a limp. Although the incident was not a pleasant one, it at least has a positive effect. The young cyclists do not ride recklessly around anymore. Their parents do not want a repeat of the accident."
    },
    {
        "id": "2f49a99612584aedb374e93f10e043a0",
        "title": "HIV infection and AIDS",
        "content": "HIV, short for \"human immunodefiency virus\" is a virus that progressively destroys the body's immune system. It does so by killing or damaging cells of the body's immune system.\n\nIn the early stages, HIV infection may have no symptoms or just symptoms of a flu-like illness. However as the disease progresses, the symptoms become progressively more severe. This may take several years to manifest.\n\nAIDS (acquired immunodeficiency syndrome) is the advanced stage of HIV infection. The body's immune system has been largely destroyed and it is susceptible to many life-threatening diseases and certain cancers.\n\nHIV infection reached world wide epidemic proportions since emerging in the 1980s. Transmission is mostly done through unprotected sex, the sharing of syringes or needles, and from infected mother to baby during pregnancy or birth. However there is no evidence that the infection can be spread through saliva or casual contact.\n\nIn the final stages of disease where the body has practically no immune system, all sorts of opportunistic infection can affect the body. The inevitable result of this is death.\n\nPrecautions that can be taken to prevent HIV infection include having no unprotected sex especially with someone you do not know well even if he or she shows no symptoms of infection. Also do not share or repeat the use of needles and syringes. The best thing to do is to not to have multiple sex partners and not to take drugs. AIDS is a killer. Your life is too precious to take chances with it."
    },
    {
        "id": "697b1abed5374ca9a3cc9c845f882458",
        "title": "Describe the things that irritate you the most",
        "content": "First on the list of irritating things is traffic jams. Going to town on weekends or holidays is never enjoyable because of the perpetual traffic jams that choke the streets.\n\nThe inability to move freely is already bad. To make things worse, there are irresponsible or poor drivers who cut across lanes without signaling, stop suddenly or generally do not seem to be aware of the danger they cause to others or to themselves. Then there are idiots who talk on the mobile phones while driving, or kids who stick their heads out of the window, kids who sit on their daddy's lap, and one day I saw a man  actually shaving in his car while we crawled along !\n\nThe top offenders are definitely the motorcyclists who weave in and out of traffic without a care for their own safety. No wonder they top the list of road fatalities.\n\nFinally reaching our destination brings no joy either because usually there is no place to park. So when we go to town, we go in pairs, one to drive and the other to get down to do whatever is necessary. Otherwise we stay home and avoid the irritation.\n\nThe second most irritating thing is inconsiderate people. Examples are people who throw rubbish on sidewalks, roads and out of moving cars. Out of sight and out of mind for them, but how about others who have to put up with the rubbish or clean it up ? Sadly the worst offenders are occupants of luxury cars. God knows what is behind the tinted windows, probably some spoiled brat and their indulgent parent.\n\nMobile phones ringing in public places are also very irritating, especially when the owner suddenly become oblivious to their surroundings when they answer the call. More than once I have been bumped into by phone-wielding buffoons who seemed to have become temporarily blind. And they don't even apologize.\n\nAs the world's population grow and grow, it is inevitable that irritations will also grow as we fight for living space. There is really no permanent solution, only a temporary one and that is to keep way from the sources of irritation as much as possible."
    },
    {
        "id": "19347cb99eb04f21874609bf2fa034d9",
        "title": "Describe a lion dance that you have watched",
        "content": "Chinese New Year is a time of festivity for the Chinese, and one of the ways of celebrating it is to have a lion dance in front of the house or business premises. A lion dance is believed to bring luck to the place.\nIt was the eighth day of the New Year. My friend, who has a computer shop in town, invited a troupe of lions to usher in the year at his shop. A one-ton truck carrying the troupe arrived at the premises at 9:30 a.m. The troupe had two lions, one red and the other yellow. The performers were young men and boys from a local Chinese association.\n\nquickly the performers donned the lion costumes. Each lion costume had two performers inside it. The big drum rolled and the cymbals clanged. The lions started dancing to the pulsating beat. They performers were very skilful as they pranced around in mock combat. The thunderous beat of the drum soon attracted a sizable audience in front of the shop.\n\nThe dance went on for about ten minutes as the drum kept the tempo going. The performers must be really fit to keep the action going at the frantic pace.\n\nMy friend had hung two red packets at a height of about three meters above the door of his shop. These red packets were prizes for the lions. They will have to reach up and take the packets. So after the round of dancing, the red lion reached up to take one of the packets. this was accomplished by having the front performer stand on the shoulders of the back performer. It was by no means an easy feat, but they performed well in getting a red packet. In similar fashion the yellow lion reached up and took the second red packet.\n\nAfter claiming their prizes, the two lions stage a final round of dancing. When the dance concluded, the spectators gave them a hearty round of applause. It was a fine performance.\n\nThe members of the troupe then had snacks and drinks that were prepared for them. Finally the troupe packed their things and got on their truck to go and stage another performance somewhere else in town."
    },
    {
        "id": "040ea52f2df6411c8d1c5153df2ea6ae",
        "title": "Describe a time when the health authorities carried out fogging in your area",
        "content": "Dengue fever is an ever-present threat in our country and often the health authorities carry out fogging to destroy the adult Aedes Egypti mosquitoes that carry the disease-causing virus.\nWe heard that one of our neighbors was hospitalized with dengue fever. Two days later, just as the sun was setting, a van carrying officials from the Health Department arrived in our neighborhood. Two uniformed men went round the houses informing the occupants that they were carrying out fogging in the area, including inside each house. everyone was to come out of their houses.\n\nTwo other men, each armed with a fogging machine and wearing a gas mask, then proceeded to fog the area.\n\nThe machines made a very loud wailing noise and produced huge amounts of smoke. This smoke was the very substance that killed mosquitoes, or for that matter, many small insects that come in contact with it. It had a slightly pungent smell to it and we were advised not to breathe it in. After all it killed mosquitoes and insects. It was definitely not good for us to breathe it in.\n\nThe men went from house to house fogging the compound and the inside of each house. As all the occupants had to come out, some elderly residents were helped out by younger ones. So for about half an hour, all the residents in our neighborhood stood or sat outside while they watch the men fog their houses. During that time, neighbors exchanged stories and news about the dengue situation and the victim who was still in hospital. It was actually a  bit of a social event for the residents.\n\nThe smoke dissipated after the men left. Then house by house, the occupants returned to their homes that would be free of mosquitoes for a day or so. The residual smell was tolerable. It was a change from having to put up with irritating mosquitoes on most days.\n\nFogging was an effective way of destroying mosquitoes but it did not eradicate them, for soon the larvae that were living in water would soon emerge as adult mosquitoes to bite and possibly endanger us once again."
    },
    {
        "id": "682d2462f1ea42999e191ed938009e66",
        "title": "In a dilemma",
        "content": "Write a story telling what you did when you found yourself in a dilemma.\n \nWe were having a history lesson with Mrs. Lee. She was droning on and many of us must be feeling utterly bored. I, for one, was wishing that time would pass faster. Anyhow as she turned her back to write on the blackboard, I saw Becky throw a piece of chalk at her. The chalk hit her on the head.\nShe turned round, picked up the chalk and looked at the class. \"Who threw the chalk ?\" she demanded.\n\nHer eyes glared at us. \"Now who did this ?\" she demanded again. There was no answer.\n\nShe looked around the class and finally her eyes stopped on me. She pointed her finger at me and said, \"You, stand up and tell me who did it !\"\n\nI was in a dilemma. I did not know what to do but I remained quiet.\n\n\"All right, you, you, you and you,\" she pointed out some of my classmates, all boys, \"Stand up ! Who did it ?\"\n\nThey stood up but incredibly nobody said anything. We were all in a dilemma. To tell the teacher was to betray our classmate, and to not tell her was to disobey her. Both choices were unpleasant.\n\nTension rose. A minute later, she said to those standing, \"You follow me to the headmaster's office.\" So we trudged behind her to the headmaster's office. Becky was one of us.\n\nWe did not wait long at the office. The headmaster gave each of us a cut on the palm. I did not know whether I had done right or wrong I only knew that I did not know what to do when faced with the dilemma. Fortunately I never had to face that again, because Becky stopped his mischief. He had to, for we would have bashed  him up if he repeated it."
    },
    {
        "id": "9332ea94ea114edcabf588826fdfe844",
        "title": "A silly mistake",
        "content": "Write a story in which the character made a silly mistake and then had to cope with the consequences of the mistake.\n \nJuliana had a million things to do every day. Looking after the daily needs of a husband, a toddler and two school-going children was a full-time job. She had to cook the meals, clean the house, wash the clothes, fetch the children to and from school, do the shopping and do many other things that a wife and mother had to do.\n\nThe sheer workload that she had to deal with sometimes caused her to make silly mistakes. She made one such silly mistake when she was preparing dinner one evening. In her rush to get dinner ready she forgot she had already put salt into the curry chicken she was making. So twice she put salt into the curry. It was way too much salt. the curry was inedible.\n\nShe did not know that she had made the mistake until dinner began. The surprise look on the faces of her husband and her children when they tasted the curry told her of her mistake. Tears welled in her eyes. What a silly thing to do, but it was done.\n\nHer husband Raymond was very understanding. He knew how much Juliana had to do every day and her mistake was unintentional . He got up, hugged his wife, and said, \"No need to get upset. I tis just a mistake. Let us go for dinenr tonight.\" The children sounded their approval.\n\nSo together they cleared the dining table, changed their clothes and drove out to town to have a nice dinner at the dried chicken restaurant."
    },
    {
        "id": "38dde19598b94c49a9d83db1b2094188",
        "title": "Facing up to a bully",
        "content": "Write a story in which the person who was bullied finally faced up to the bully\n \nDerek was in Standard One and he was a well-mannered boy. His parents taught him to behave himself in school and not to fight with other boys. However his mild manner was wrongly perceived as weakness by some of the rougher boys. So one of them, an overweight boy that stood at least two inches taller than Derek, took to bullying him.\n\nIt began with shoving. Then the bully started hitting Derek as and when he felt like it. Recess time became an unpleasant time for Derek for the bully and his cronies would come looking for him. He did not fight back nor did he tell his parents or teachers because he did to want to cause any trouble. So he endured the bullying, for a few weeks.\n\nGradually the bullying got worse and Derek knew he had to face up to the bully, for better or for worse. So during recess one day, he stood in the shade of a tree and waited for the bully to show up. True to form, the bully came. This time Derek was ready. He held a short stick hidden behind his back.\n\nThe bully came with clenched fists but before he could land a punch, Derek lashed out with his stick on the bully's legs. The bully cried out in pain and collapsed on the ground. Derek raised the stick to strike again but stopped when he saw that the bully was crying and begging him for mercy.\n\nTeachers and prefects arrived to see what the commotion was all about. He and the bully were taken to the headmaster's office and each given two cuts for fighting. It was worth it. The bully never troubled him again."
    },
    {
        "id": "564ca51c1a2340728d02b5f68d2c7376",
        "title": "Write a story about an event that changed a person's life",
        "content": "Once of the things about Aaron was that he could never sit still. He was young and full of life, always running around doing things and being busy. Never did he suspect that one day all these things would end.\n\nAaron's school life was a productive one. As he was blessed with a strong and healthy body, he excelled in sports and games. His forte was the short sprints. He was fast and one of the best in the state. In studies he was no laggard either. He performed well enough in his studies to secure a place in a university.\n\nLife in the university was one big round of fun and studies. The three years there earned him a Bachelor of Arts degree. On graduation he landed a lucrative job in an international company. Life was certainly good to Aaron, or so it seemed.\n\nThree months after beginning his career, he bought a car. It was a second-hand car that had been modified for speed. The car fitted Aaron's personality well. It was fast. he drive it at breakneck speeds along the expressways, risking his life and the lives of other road users. He imagined that he was the best driver around and he was immune to accidents.\n\nOne day he overtook a tanker but got too close to it. The rear end of his car touched the tanker and his car was sent somersaulting into the crash barrier in the middle of the expressway. Aaron's car was a complete wreck but miraculously he survived the horrendous accident.\n\nThey took him to hospital where the doctors treated him for cuts and bruises. There was one thing they could do nothing about. His spine was broken and he was paralysed from the chest down.\n\nThe accident marked a major turning point in Aaron's life. From then on he could no longer run around as he pleased. He had to spend the rest of his life in a wheelchair. He had to sit still whether he liked it or not.\n\nThe first three months of his new enforced living was the hardest to bear. He sank to the depths of depression. Everything has changed. He lost his job, his car and the life that he was used to. He ahd to face up to reality and adjust his life accordingly. It was not going to be easy but he had no choice. He had to get out of his self-pity and take whatever action to make his life worth living again."
    },
    {
        "id": "a4a00e81dfb94c00add870bd6a306bff",
        "title": "Energy needs and sources",
        "content": "Write about the energy needs of the world and the sources of energy that are available\n \nThe energy needs of the world are unending and ever increasing. We need energy for transport, industry, lighting, warmth, cooking etc. Without sufficient energy, the airplanes will stop flying, industry will grind to a halt, cities will be plunged into darkness -- in short -- the world as we know it will cease to exist.\nThere are many types of energy sources. Our ancestors used wood and other combustible material for burning in order to generate heat and light. Today we make use of fossil fuel and we harness solar, wind, water, chemical and nuclear energy for powering the many devices that we have invented.\n\nMost of these energy sources are non-renewable, that is, they become depleted in time. An example is fossil fuel. Its supply is limited and it is a matter of time before it runs out. An example of a renewable energy source is wood. Trees can be grown but the process takes a long time.\n\nThe use of some of these energy sources causes pollution. The burning of wood and fossil fuel produces smoke and other gases. Harnessing energy from nuclear fission produces dangerous by-products that are difficult to manage. By contrast, hydroelectric power, solar energy and wind energy are examples of non-polluting energy sources.\n\nAs the population of the world keeps increasing, there is an urgent need to find and use more renewable and non-polluting energy sources."
    },
    {
        "id": "48318c90f70b4bae96693504245a24e6",
        "title": "Nuclear energy",
        "content": "Write about the pros and cons of using nuclear energy as a energy source.\n \nNuclear fission or the splitting of the nucleus of an atom releases great amounts of energy, much more than any other conventional energy source. Nuclear energy has enormous potential as an energy source. There is almost limitless supply of energy. However, radioactive by-products and waste post serious health and environmental risks.\n\nThe atomic or nuclear bomb is the uncontrolled release of nuclear energy. The tremendous power and deadliness of this is evident when Hiroshima and Nagasaki was destroyed by atomic bombs at the end of World War II in 1945. The devastation was enormous, nothing like what human beings had seen before. it is not something to be repeated. Even so, the major powers of the world now possess enough atomic bombs to wipe out the entire population of the world. It is a chilling thought that human beings are now able to wipe themselves out. We can only hope that they have the sense not to.\n\nIn a nuclear reactor, the release of nuclear energy is controlled. This energy is used for various purposes such as for generating electricity and driving submarines. However, the reactor has to be maintained carefully. An accident is potentially disastrous. The leakage of radioactive substances can cause death to living things and pollution of the environment, such as that which occurred at Chernobyl.\n\nAs it is now, nuclear energy bolds enormous potential as an energy source but it is not totally safe to use. Perhaps one day, with more research and knowledge, human beings will learn how to harness nuclear energy safely."
    },
    {
        "id": "513ef9b18c974661a1018f9440ec6e16",
        "title": "Describe a concert, variety show or a show performed on stage",
        "content": "On the weekend before Christmas, a large shopping complex in my town organized a show for disabled and underprivileged children. The show was held at the foyer of their complex building.\nDisabled and underprivileged children from several homes in town were ferried to the complex where they were seated in chairs in front of the stage that was decorated for the occasion. Also present were some local dignitaries, parents and members of the public.\n\nAt 8:30 p., the concert kicked off with a rousing dance routine by members of a dancing school. These young dancers danced and pranced with such skills and coordination that left the audience wanting for more. At the end of the dance, the thunderous applause from the audience showed how much they appreciated the performance.\n\nBy then the foyer was filled to capacity. Shoppers and visitors stopped to watch the show.\n\nNext were songs by some local singes and members of church groups. they performed remarkably well and got the audience, especially the young children, to sing along with them. The spirit of Christmas was well and alive a the show.\n\nAs in all Christmas celebrations, Santa Claus made his appearance. Few people would have guessed that the jolly old gentleman was, in real life, the rotund complex manager Mr. Dennis Ong. He really played the part of Santa Claus well. Dressed in a red costume and sporting a huge cotton beard, he came on stage with sacks of toys and gifts, much to the delight of the little children who clapped their hands in appreciation.\n\nOne by one, the children were ushered onto the stage where they received a gift each from Santa. Two of the children were on wheelchairs but that did not deter them from joining in the fun and joy. As there were many gifts, Santa also invited young members of the public to go on stage to receive the gifts. Soon all the gifts were distributed.\n\nFinally all the performers cam eon stage to sing \"Silent Night\". Many members of the public sang along as well. It was a short but meaningful show. For the disabled and underprivileged children, it was indeed a happy occasion."
    },
    {
        "id": "25b1487843774108a7af4c5b70e5057c",
        "title": "Bad company",
        "content": "Write a composition on how to spot and avoid bad company.\n \nMixing with bad company is what every youngster should avoid. The reason is simple. In such a company, sooner or later the youngster will be exposed to activities that are possibly unhealthy, unwholesome, antisocial, dishonest, illegal or even criminal. Once exposed, the negative effects can last a long time, perhaps for a lifetime.\nThe company you keep will determine largely what you do, how you think and where your life will proceed. In other words, keeping bad company will eventually ruin your life.\n\nBad company is not hard to spot. For example if your friends smoke, then chances are you will catch on. If they take alcohol or drugs, chances are you will be tempted to give them a try. One try leads to another and it will not be long before you are hooked. Alcoholism, lung diseases, AIDS or a miserable life may in store for you. So for your own wellbeing, it is better to avoid such friends. There is no need to make enemies of them. Just avoid them.\n\nIf you mix around with friends who vandalize public property, shop-life, scratch cars or extort money, then it is time to call it quits with them. Such behavior will lead to more serious offences and it is a matter of time when you are on the wrong side of the law. Get out quick before it it too late.\n\nMake friends with good and decent people. keep away from bad company."
    },
    {
        "id": "7f18af492adc44beb7e60c5dc82d6a02",
        "title": "The problems of being in debt",
        "content": "Neither a borrower nor a lender be -- so goes the famous saying from Shakespeare. How true it is. Being in debt is one of the heaviest burdens for anyone to carry. The borrower of money, no matter how small or large the amount, owes the lender. And until the debt is paid, the burden weighs down the borrower, sometimes terribly.\nWhen my father was young, he bought a house after he got married. He took a loan from the bank to pay for the house, and for the next thirty years, he had to work hard to repay the loan. There was a period when he was out of work, and our family had to dig deep into whatever savings we had to service the loan. Those were difficult days, and I could see my parents age visibly. My mother had to find work in a factory to help make ends meet. Anyhow the days are easier now with my eldest brother and sister working. My father says it will take another five years to repay the loan completely. What a relief that would be when the time comes.\n\nThere is an uncle of mine who is perpetually borrowing money from anyone who would lend him. It is not that he does not work, but somehow he misuses the money by spending it on unnecessary things. The terrible thing is that he almost never repays his debt. Our family has to bear the burden and this is really unpleasant.\n\nOnce he borrowed money from some moneylenders and missed out on the repayments. The loan sharks came looking for him and threatened his life. We again had to dig up whatever we can to pay these people off so as to prevent any serious thing from happening to him. We hope that he has learned his lesson. If this sort of thing should happen again, I doubt that anyone can help him out. He has practically exhausted what we have saved.\n\nDespite the problems of being in debt, borrowing and lending is still necessary in this world. Banks give loans to borrowers to set up their businesses or to buy houses and cars. The government and other bodies give loans to student to further their studies. Family members help one another out in times of financial need. So borrowing and lending is part and parcel of living. The important thing is to repay whatever that is borrowed. Only when repayment is done are the problems over. Certainly it is best not to be a borrower or a lender, but then who can be sure that they will not become one ?"
    },
    {
        "id": "0144da74589c42ffb00aa128e2fb315a",
        "title": "Write a story which involves a blind or disabled person",
        "content": "The sun was setting as Samuel sat in his car near the railway station. He was waiting to pick up his nephew from the station. As he had found a place to park and the air had cooled down, he decided against getting out fo the car. His nephew knew where to find him.\n\nThe road that passed by the railway station was a busy one but there was a single lights-operated crossing that periodically turned green for about ten seconds for the pedestrians. As if by magic all vehicles stopped before the crossing every time this happened.\n\nPresently Samuel saw a blind man walking very slowly on the other side of the road. There was no one else on the other side. On reaching the traffic lights, the blind man stopped. It appeared that he wanted to cross. Samuel was curious to see how a blind man managed a crossing like this.\n\nThe lights turned green for the pedestrian and the vehicles stopped, but the blind man did not move. Ten seconds passed and the vehicles sped off again. Three times in a row the lights turned green for the blind man to cross but he did not. Obviously he was not going to make it on his own.\n\nSamuel got out of his car and crossed over to the other side of the road at the next change of lights. He asked the blind man whether he wanted to cross the road. The blind man nodded. So when the lights changed again, Samuel quickly helped the man cross the road. It took more than ten seconds but the waiting vehicles did not move until the duo had crossed safely.\n\nOnce across, Samuel asked the blind man where he wanted to go. The man said he wanted to go to the canteen. Canteen ? He must mean the canteen in the railway station. So Samuel took the man by the hand and led him to the canteen. On the way he met his nephew Tony. On seeing his uncle with the blind man, Tony offered to take over the task of leading the blind man.\n\nAt the canteen, the proprietor came out and took over. The blind man was one of his relatives. He thanked the helpful duo and led the blind man inside.\n\nHaving done what they could, Samuel and Tony headed towards their car. They were glad they could see. Being blind was certainly a big handicap."
    },
    {
        "id": "05539516408d491896b13f576a259ebc",
        "title": "A talk on road safety",
        "content": "Good afternoon, ladies and gentlemen, boys and girls.\n\nToday I want to talk about the importance of road safety.\n\nMany people think that accidents only happen to other people. They talk as though they are immune to it. But accidents can happen to anyone, and when it happens on the road, the consequences can be severe or even fatal. An experienced road-user has this to say. \"You may take a thousand risks and get away with it every time, but it takes only one accident, just one, to cause you injury or death.\"\n\nHow true this is. I once had a friend who was a daredevil motorcyclist on the road, risking his life and that of others with his reckless attitude. Well, he must have cheated death more than a thousand times but it took only one accident to end his life.\n\nMost accidents are caused by the errors of the road-users. Very infrequently does vehicle defect or mechanical failure cause an accident. Usually it is the person using the vehicle who is at fault. A person who is under the influence of alcohol or drugs is not fit to be using a vehicle because his or her judgment is compromised. The person may behave erratically or dangerously on the road and hence the increasing the chances of causing accidents. Many drivers involved in accidents tested positive for dugs or alcohol. So do not drive if you are under the influence of drugs or alcohol, and do not sit in a vehicle driven by such a person. Better still, keep away from drugs or alcohol. They are not of no benefit to you at all.\n\nKnow all traffic rules and obey them. If you see people speeding recklessly, jumping queues, jumping red lights, parking illegally etc., please do not follow their example, or try to teach them anything. Leave them alone or make a report to the police. Don't try to deal with them on your own because that would likely create conflict. There have been cases of driver bashing up others because of a misunderstanding. Don't become a victim of such  conflict. If you are involved in an accident, remain calm and don't argue with the other party. Just call the police and let them handle the situation.\n\nIn a more serious accident, injuries or death may have occurred. Again remain calm and call for assistance if you are able to. Otherwise wait for assistance to arrive.\n\nThe best policy however, is to avoid accidents, for in an accident, it does not really matter who is right or wrong. What matters is who is left.\n\nRead safety is your responsibility"
    },
    {
        "id": "a1affd661c1d4584a7482e12852d16ec",
        "title": "'Smart' traffic lights",
        "content": "Traffic lights are important components of the road systems of a town or city. Their importance becomes obvious when they stop working. When this happens, the junction at which they operate is then reduced to chaos as drivers curse and swear to try to get across.\nDespite their importance, some traffic lights, especially older ones, are not 'smart', meaning they turn n or off at fixed predetermined intervals regardless of whether it is midday or midnight. It is fine at midday when the roads are packed and waiting for one minute at a red light is normal. However waiting for one minute at a red light at midnight when here are no vehicles around seems like forever. One is tempted to beat the lights.\n\nFortunately in my town, the planners have installed 'smart' traffic lights that change their lights according to the absence or presence of cars near the junction. This works very well, especially in the night. One does not have to wait forever for the lights to change.\n\nThe 'smart' traffic lights have detectors buried just under the road just behind the line where vehicles stop at the lights. The detectors are hardly visible but if one is observant, one can see a rectangular box on the road about the same width and length of a car behind every line. Each detector can detect any vehicle that stops on top of or passes over it. When this happens, it indicates to the control box to change the lights to green as soon as possible. So the lights stay red or green according to the traffic volume registered by the detectors. It is pleasing to arrive at an empty junction to see the lights quickly change to green when one stops behind the line. One does not have to wait long.\n\nThe only setback to this system is that many drivers are not aware of the detectors. Some stop beyond the stop line or before it and wonder why the lights do not change to green for them. The detector did not register their presence so the lights do not change quickly.\n\nI suppose 'smart' traffic lights require smart drivers as well. My parents know the drill well. So we never have problems at the 'smart' traffic lights."
    },
    {
        "id": "430760f435454a7c98134918e35a874b",
        "title": "A long night",
        "content": "Write a story in which the character had to go through a whole night without sleep.\n \nLittle Susie had been complaining about a stomachache for the whole day. The family doctor did not think that it was serious and sent her home. However in the evening her condition got worse and Carrie, her mother, was very worried.\nAt nine in the night, Carrie decided that they should go to the hospital and see a doctor there. So here husband took her and Susie to the hospital. At the hospital, the doctor examined Susie and diagnosed her as having acute appendicitis. He arranged for immediate surgery. Things moved quickly and the hospital staff got Susie ready for the operation.\n\nThey wheeled Susie into the operation theater while Carrie waited outside. Her husband returned home to be with their other two children who were waiting for news of their little kid sister.\n\nAn hour later, Susie was wheeled out of the operation room. The doctor assured Carrie that the operation was successful. There was no complication. Carrie was so relieved. Thank goodness she decided to come to the hospital.\n\nCarrie's husband came back to the hospital to see if things were okay. He was also very relieved. As there was nothing else that he could do, he returned home to look after the children. Carrie remained in the hospital with Susie. The hospital provided a reclining chair for Carrie to sleep on but sleep was impossible. She was just too concerned for Susie.\n\nThe next morning dawned bright and cheery. It had been a long stressful night, but everything turned out well."
    },
    {
        "id": "f7bb719648e54dc6b09263b31305e4cc",
        "title": "Mistaken identity",
        "content": "Write a story based on how someone was mistaken for another person\n \nThomas was driving his car along a quiet country road with his friend Paul on the passenger seat. Paul's arm was in a sling as he had broken it a few weeks ago.\nThe quiet drive suddenly turned into a nightmare when a car with three men in it overtook them. The man at the back seat pointed a gun at Thomas and motioned him to stop. Horrified, Thomas had no choice but to comply. He stopped by the roadside. The two friends sat petrified, wondering what that was all about.\n\nQuickly, the three men in the car got out. All of them had guns which they pointed at the two friends. One of them cried out in a loud voice for the two friends to get out of the car with their hands up. Again they had no choice but to comply. Paul, of course, could only raise one hand, the other being in a sling.\n\nOne of the men took out a badge and identified himself as a police officer. His men frisked Paul and Thomas. Satisfied that they were unarmed, he demanded to see the friends' identity card. Paul and Thomas handed their ICs over to the police officer. the officer scrutinized the cards.\n\n\"Sorry, we apologize for the inconvenience. we thought that you were someone else. We are looking for a desperate fugitive with a broken arm and we had to check you out,\" the officer explained. With that they left the two friends.\n\nIt took a few minutes before Paul and Thomas regained their composure. It was just a case of mistaken identity, and it was a really frightening one."
    },
    {
        "id": "61c60a2bf05a4339b58e773bf2be0e5c",
        "title": "Snatch thieves",
        "content": "Write a story that involves a snatch thief.\n \nIt was lunch time in the city. Sally and two of her colleagues left their office and walked towards their favorite restaurant a short distance away. Sally had a handbag slung over her shoulder.\nAt a crossing, they waited for the light to turn green. When it did, Sally, her colleagues and many other people crossed over to the other side of the road. Suddenly from the traffic that had stopped at the crossing, a motorcycle leapt forward. Two men were on it. In a flash, they were beside Sally and the pillion rider grabbed her handbag. The force of the grab sent Sally tumbling to the ground. The strap broke and the pillion rider held the handbag in his hand. The rider turned the throttle and the motorcycle sped off down the road, weaving between other vehicles in their rush to get away.\n\nFortune did not favor the thieves. A few seconds later, they crashed into a tanker in the middle of the road. The two men were sent flying, hitting other vehicles before falling on the road. They lay motionless.\n\nThe whole sequence of events occurred in less than fifteen seconds. In that time, two distracted drivers crashed into the vehicles in front of them. Finally all traffic stopped. Some men rushed to the thieves and pulled them to the roadside.\n\nSally sat on the kerb with her colleagues by her side. She was badly shaken by the whole incident. She had some cuts and bruises on her body. Otherwise she was all right."
    },
    {
        "id": "4f3fe90c9f8b47d383acdc4c57f36fc0",
        "title": "Getting lost",
        "content": "Write a story in which the character lost his or her way while going to an unfamiliar destination.\n \nTen years had passed since Fannie and her friend Laura left school. Fannie used to wonder how Laura was until they chanced upon each other in the market one day.\nFannie promised to visit Laura the coming Sunday morning. So on the appointed day, Fannie drove her car into the housing estate where Laura lived. Ten years was a long time and the once-familiar surroundings had changed drastically. Everything seemed strange. Fannie tried to look for familiar landmarks but she could not see any.\n\nShe drove in the direction that she thought was the way to Laura's house, but the more she drove the more she realized that she did not know where she was. She was lost. It was incredible how she could lose her way in a place that once she knew like the back of her hand, but the fact remained that she was lost.\n\nThere was only one thing to do, and that was to call Laura and ask for help. Thank God for the mobile phone. She parked her car by a mini market and made the call to Laura. Laura said she would come to the mini market.\n\nA few minutes later, Laura appeared in her car. Fannie was very relieved. She followed Laura to her house where the two friends renewed their friendship over a cup of tea."
    }
]