[
    {
        "id": "2006faac04d04778a62969bfcaefcd22",
        "word": "law",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/lɔː/",
            "us": "/lɔː/"
        },
        "nearby": [
            {
                "word": "lavish on",
                "pos": "phrasal verb"
            },
            {
                "word": "lavish upon",
                "pos": "phrasal verb"
            },
            {
                "word": "law",
                "pos": "noun"
            },
            {
                "word": "Bonar Law",
                "pos": ""
            },
            {
                "word": "law-abiding",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a rule that deals with a particular crime, agreement, etc.",
                    "vi": "quy tắc xử lý một tội phạm cụ thể, thỏa thuận, v.v."
                },
                "examples": [
                    {
                        "en": "to pass a law (= officially make it part of the system of laws)",
                        "vi": "để thông qua luật (= chính thức biến nó thành một phần của hệ thống luật)"
                    },
                    {
                        "en": "law against (doing) something Police don't have the resources to enforce the law against dumping waste.",
                        "vi": "luật chống lại (làm) điều gì đó Cảnh sát không có đủ nguồn lực để thực thi luật chống đổ chất thải."
                    },
                    {
                        "en": "(informal) There ought to be a law against it!",
                        "vi": "(không chính thức) Cần phải có luật chống lại nó!"
                    },
                    {
                        "en": "law on something The company's actions violated the law on equal employment.",
                        "vi": "luật về điều gì đó Các hành động của công ty đã vi phạm luật về việc làm bình đẳng."
                    },
                    {
                        "en": "The suspects were in clear violation of immigration laws.",
                        "vi": "Các nghi phạm rõ ràng đã vi phạm luật nhập cư."
                    }
                ]
            },
            {
                "define": {
                    "en": "the whole system of rules that everyone in a country or society must obey",
                    "vi": "toàn bộ hệ thống quy tắc mà mọi người trong một quốc gia hoặc xã hội phải tuân theo"
                },
                "examples": [
                    {
                        "en": "If they entered the building they would be breaking the law.",
                        "vi": "Nếu họ bước vào tòa nhà, họ sẽ phạm luật."
                    },
                    {
                        "en": "The reforms have recently become law.",
                        "vi": "Những cải cách gần đây đã trở thành luật."
                    },
                    {
                        "en": "The Civil Rights Act of 1964 became the law of the land on July 2, 1964.",
                        "vi": "Đạo luật Quyền Công dân năm 1964 trở thành luật đất đai vào ngày 2 tháng 7 năm 1964."
                    },
                    {
                        "en": "state/federal law",
                        "vi": "luật tiểu bang / liên bang"
                    },
                    {
                        "en": "State law prohibits gambling in public places.",
                        "vi": "Luật tiểu bang nghiêm cấm đánh bạc ở nơi công cộng."
                    },
                    {
                        "en": "against the law In Sweden it is against the law to hit a child.",
                        "vi": "chống lại luật pháp Ở Thụy Điển, việc đánh một đứa trẻ là vi phạm pháp luật."
                    },
                    {
                        "en": "within the law Defence attorneys can use any means within the law to get their client off.",
                        "vi": "trong luật Các luật sư bào chữa có thể sử dụng bất kỳ phương tiện nào trong luật để đuổi khách hàng của họ."
                    },
                    {
                        "en": "outside the law to operate outside the law",
                        "vi": "ngoài pháp luật hoạt động ngoài pháp luật"
                    },
                    {
                        "en": "by law British schools are required by law to publish their exam results.",
                        "vi": "theo luật Các trường ở Anh được yêu cầu theo luật phải công bố kết quả kỳ thi của họ."
                    },
                    {
                        "en": "under the (…) law | under… law Under existing law, journalists cannot refuse to provide information to a jury.",
                        "vi": "theo (…) luật | theo… luật Theo luật hiện hành, các nhà báo không thể từ chối cung cấp thông tin cho bồi thẩm đoàn."
                    },
                    {
                        "en": "above the law Do not think you are above the law (= that you cannot be punished by the law).",
                        "vi": "Trên cả luật pháp Đừng nghĩ rằng bạn ở trên luật pháp (= rằng bạn không thể bị trừng phạt bởi luật pháp)."
                    },
                    {
                        "en": "They acted in accordance with the law of the country.",
                        "vi": "Họ đã hành động phù hợp với luật pháp của đất nước."
                    },
                    {
                        "en": "The constitution guarantees equality before the law for all.",
                        "vi": "Hiến pháp bảo đảm sự bình đẳng trước pháp luật cho tất cả mọi người."
                    },
                    {
                        "en": "law enforcement agencies/officials",
                        "vi": "các cơ quan / quan chức thực thi pháp luật"
                    },
                    {
                        "en": "(humorous) Kate's word was law in the Brown household.",
                        "vi": "(hài hước) Lời của Kate là luật trong gia đình Brown."
                    }
                ]
            },
            {
                "define": {
                    "en": "a particular branch of the law",
                    "vi": "một nhánh luật cụ thể"
                },
                "examples": [
                    {
                        "en": "He specializes in international law.",
                        "vi": "Ông ấy chuyên về luật quốc tế."
                    },
                    {
                        "en": "tax/employment law",
                        "vi": "luật thuế / việc làm"
                    },
                    {
                        "en": "according to… law According to copyright law, the author is the owner of the material.",
                        "vi": "theo… luật Theo luật bản quyền, tác giả là chủ sở hữu của tài liệu."
                    }
                ]
            },
            {
                "define": {
                    "en": "the study of the law as a subject at university, etc.; the profession of being a lawyer",
                    "vi": "nghiên cứu luật như một môn học ở trường đại học, v.v.; nghề luật sư"
                },
                "examples": [
                    {
                        "en": "a law student/professor",
                        "vi": "một sinh viên luật / giáo sư"
                    },
                    {
                        "en": "Jane is studying law.",
                        "vi": "Jane đang học luật."
                    },
                    {
                        "en": "(North American English) He's in law school.",
                        "vi": "(Tiếng Anh Bắc Mỹ) Anh ấy đang học trường luật."
                    },
                    {
                        "en": "(British English) He's at law school.",
                        "vi": "(Anh Anh) Anh ấy đang ở trường luật."
                    },
                    {
                        "en": "What made you go into law?",
                        "vi": "Điều gì đã khiến bạn sa vào pháp luật?"
                    },
                    {
                        "en": "a law firm",
                        "vi": "một công ty luật"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to refer to the police and the legal system",
                    "vi": "dùng để chỉ cảnh sát và hệ thống pháp luật"
                },
                "examples": [
                    {
                        "en": "Jim is always getting into trouble with the law.",
                        "vi": "Jim luôn gặp rắc rối với luật pháp."
                    },
                    {
                        "en": "She was well known for her brushes with the law.",
                        "vi": "Cô ấy nổi tiếng với những bàn chải của mình với luật pháp."
                    }
                ]
            },
            {
                "define": {
                    "en": "the fact that something always happens in the same way in an activity or in nature",
                    "vi": "thực tế là một cái gì đó luôn xảy ra theo cùng một cách trong một hoạt động hoặc trong tự nhiên"
                },
                "examples": [
                    {
                        "en": "The usual laws of supply and demand do not seem to apply in this case.",
                        "vi": "Quy luật cung và cầu thông thường dường như không áp dụng trong trường hợp này."
                    },
                    {
                        "en": "the laws of nature/physics",
                        "vi": "quy luật tự nhiên / vật lý"
                    }
                ]
            },
            {
                "define": {
                    "en": "a scientific rule that somebody has stated to explain a natural process",
                    "vi": "một quy tắc khoa học mà ai đó đã nêu ra để giải thích một quá trình tự nhiên"
                },
                "examples": [
                    {
                        "en": "the first law of thermodynamics",
                        "vi": "định luật đầu tiên của nhiệt động lực học"
                    },
                    {
                        "en": "Do you remember anything about Ohm's Law?",
                        "vi": "Bạn có nhớ gì về Định luật Ohm không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "one of the rules that controls an organization or activity",
                    "vi": "một trong những quy tắc kiểm soát một tổ chức hoặc hoạt động"
                },
                "examples": [
                    {
                        "en": "the laws of the Church",
                        "vi": "luật của Giáo hội"
                    },
                    {
                        "en": "The first law of kung fu is to defend yourself.",
                        "vi": "Luật đầu tiên của kung fu là tự vệ."
                    },
                    {
                        "en": "the laws of cricket",
                        "vi": "luật chơi cricket"
                    }
                ]
            },
            {
                "define": {
                    "en": "a rule for good behaviour or how you should behave in a particular place or situation",
                    "vi": "quy tắc cho hành vi tốt hoặc cách bạn nên cư xử trong một địa điểm hoặc tình huống cụ thể"
                },
                "examples": [
                    {
                        "en": "He frequently behaved as though moral laws did not exist.",
                        "vi": "Anh ta thường cư xử như thể luật đạo đức không tồn tại."
                    },
                    {
                        "en": "Their world is shaped by their parents' attitudes and the unspoken laws of the street.",
                        "vi": "Thế giới của chúng được định hình bởi thái độ của cha mẹ và những luật bất thành văn trên đường phố."
                    }
                ]
            },
            {
                "define": {
                    "en": "to behave in an independent way and ignore rules or what other people want you to do",
                    "vi": "cư xử theo cách độc lập và phớt lờ các quy tắc hoặc những gì người khác muốn bạn làm"
                },
                "examples": [
                    {
                        "en": "Boys of that age are a law unto themselves.",
                        "vi": "Con trai ở độ tuổi đó là một quy luật đối với bản thân."
                    }
                ]
            },
            {
                "define": {
                    "en": "to ask a court to settle a problem or disagreement",
                    "vi": "yêu cầu tòa án giải quyết vấn đề hoặc bất đồng"
                },
                "examples": [
                    {
                        "en": "They went to law to get back their property.",
                        "vi": "Họ đã tìm đến pháp luật để lấy lại tài sản của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "a situation in which people obey the law and behave in a peaceful way",
                    "vi": "một tình huống mà mọi người tuân theo luật pháp và cư xử một cách hòa bình"
                },
                "examples": [
                    {
                        "en": "The government struggled to maintain law and order.",
                        "vi": "Chính phủ đã đấu tranh để duy trì luật pháp và trật tự."
                    },
                    {
                        "en": "After the riots, the military was brought in to restore law and order.",
                        "vi": "Sau cuộc bạo loạn, quân đội đã được đưa đến để khôi phục lại luật pháp và trật tự."
                    },
                    {
                        "en": "They claim to be the party of law and order.",
                        "vi": "Họ tự xưng là đảng của luật pháp và trật tự."
                    },
                    {
                        "en": "Martial law was imposed to prevent the breakdown of law and order.",
                        "vi": "Thiết quân luật đã được áp dụng để ngăn chặn sự phá vỡ luật pháp và trật tự."
                    }
                ]
            },
            {
                "define": {
                    "en": "the principle that one thing will happen as often as another if you try enough times",
                    "vi": "nguyên tắc rằng một việc sẽ xảy ra thường xuyên như một điều khác nếu bạn cố gắng đủ lần"
                },
                "examples": [
                    {
                        "en": "Keep applying and by the law of averages you'll get a job sooner or later.",
                        "vi": "Hãy tiếp tục nộp đơn và theo quy luật trung bình bạn sẽ sớm có việc làm."
                    }
                ]
            },
            {
                "define": {
                    "en": "a situation in which people are prepared to harm other people in order to succeed",
                    "vi": "một tình huống trong đó mọi người chuẩn bị để làm hại người khác để thành công"
                },
                "examples": [
                    {
                        "en": "These criminal gangs only recognize the law of the jungle.",
                        "vi": "Các băng nhóm tội phạm này chỉ thừa nhận luật rừng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to tell somebody with force what they should or should not do",
                    "vi": "buộc phải nói với ai đó những gì họ nên làm hoặc không nên làm"
                },
                "examples": [
                    {
                        "en": "My dad started laying down the law about what time I should come home.",
                        "vi": "Bố tôi bắt đầu đặt ra luật về thời gian tôi nên về nhà."
                    }
                ]
            },
            {
                "define": {
                    "en": "the exact words of a law or rule rather than its general meaning",
                    "vi": "những từ chính xác của một luật hoặc quy tắc hơn là ý nghĩa chung của nó"
                },
                "examples": [
                    {
                        "en": "They insist on sticking to the letter of the law.",
                        "vi": "Họ nhất quyết bám sát luật lệ."
                    },
                    {
                        "en": "We might be guilty of slightly bending the letter of the law.",
                        "vi": "Chúng tôi có thể phạm tội khi hơi bẻ cong văn bản của luật pháp."
                    },
                    {
                        "en": "In spite of the difficulties it would cause her family, the judge stuck to the letter of the law and jailed her.",
                        "vi": "Bất chấp những khó khăn mà nó sẽ gây ra cho gia đình cô, thẩm phán vẫn tuân theo luật lệ và bỏ tù cô."
                    }
                ]
            },
            {
                "define": {
                    "en": "in trouble with the police",
                    "vi": "gặp rắc rối với cảnh sát"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "if you already have or control something, it is difficult for somebody else to take it away from you, even if they have the legal right to it",
                    "vi": "nếu bạn đã có hoặc kiểm soát một thứ gì đó, thì rất khó để người khác lấy đi nó khỏi bạn, ngay cả khi họ có quyền hợp pháp đối với nó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the condition in which all members of society, including its political leaders, accept the authority of the law",
                    "vi": "điều kiện trong đó tất cả các thành viên của xã hội, bao gồm cả các nhà lãnh đạo chính trị của nó, chấp nhận thẩm quyền của pháp luật"
                },
                "examples": [
                    {
                        "en": "Democracy and the rule of law are yet to be firmly established in the country.",
                        "vi": "Dân chủ và pháp quyền vẫn chưa được thiết lập vững chắc trong nước."
                    }
                ]
            },
            {
                "define": {
                    "en": "to do something illegal in order to punish somebody for doing something wrong, instead of letting the police deal with them",
                    "vi": "làm điều gì đó bất hợp pháp để trừng phạt ai đó đã làm điều gì đó sai trái, thay vì để cảnh sát xử lý họ"
                },
                "examples": [
                    {
                        "en": "After a series of burglaries in the area, the police are worried that residents might take the law into their own hands.",
                        "vi": "Sau hàng loạt vụ trộm trên địa bàn, cảnh sát lo ngại cư dân có thể sa lưới pháp luật."
                    },
                    {
                        "en": "When police failed to arrest the suspect, local people took the law into their own hands and beat him up.",
                        "vi": "Khi cảnh sát không bắt được nghi phạm, người dân địa phương đã lao vào luật pháp và đánh anh ta tới tấp."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to tell somebody who is criticizing you that you are not doing anything wrong",
                    "vi": "được sử dụng để nói với ai đó đang chỉ trích bạn rằng bạn không làm gì sai"
                },
                "examples": [
                    {
                        "en": "I'll sing if I want to—there's no law against it.",
                        "vi": "Tôi sẽ hát nếu tôi muốn - không có luật nào chống lại điều đó."
                    }
                ]
            }
        ]
    },
    {
        "id": "25a9fed667c64a4d8816d6c010158ce6",
        "word": "act",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ækt/",
            "us": "/ækt/"
        },
        "nearby": [
            {
                "word": "acrylic",
                "pos": "noun"
            },
            {
                "word": "act",
                "pos": "verb"
            },
            {
                "word": "act",
                "pos": "noun"
            },
            {
                "word": "ACT",
                "pos": "abbreviation"
            },
            {
                "word": "act for",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a particular thing that somebody does",
                    "vi": "một điều cụ thể mà ai đó làm"
                },
                "examples": [
                    {
                        "en": "You have committed a serious criminal act.",
                        "vi": "Bạn đã thực hiện một hành vi tội phạm nghiêm trọng."
                    },
                    {
                        "en": "act of something an act of kindness",
                        "vi": "hành động một cái gì đó một hành động tử tế"
                    },
                    {
                        "en": "This was one of the most appalling acts of terror of recent times.",
                        "vi": "Đây là một trong những hành động khủng bố kinh hoàng nhất trong thời gian gần đây."
                    },
                    {
                        "en": "acts of terrorism/violence/aggression",
                        "vi": "hành động khủng bố / bạo lực / xâm lược"
                    },
                    {
                        "en": "They performed acts of great heroism.",
                        "vi": "Họ đã thực hiện những hành động của chủ nghĩa anh hùng tuyệt vời."
                    },
                    {
                        "en": "The murder was the act of a psychopath.",
                        "vi": "Vụ giết người là hành động của một kẻ tâm thần."
                    }
                ]
            },
            {
                "define": {
                    "en": "a law that has been passed by a parliament",
                    "vi": "một luật đã được quốc hội thông qua"
                },
                "examples": [
                    {
                        "en": "an Act of Congress/Parliament",
                        "vi": "một Đạo luật của Quốc hội / Nghị viện"
                    },
                    {
                        "en": "the Care Act 2014",
                        "vi": "Đạo luật Chăm sóc 2014"
                    },
                    {
                        "en": "to pass/repeal/amend an Act",
                        "vi": "để thông qua / bãi bỏ / sửa đổi một Đạo luật"
                    },
                    {
                        "en": "under an Act A Committee on Safety of Medicines was set up under the Act.",
                        "vi": "theo Đạo luật Một Ủy ban về An toàn Thuốc được thành lập theo Đạo luật."
                    }
                ]
            },
            {
                "define": {
                    "en": "a way of behaving that is not sincere but is intended to have a particular effect on others",
                    "vi": "một cách cư xử không chân thành nhưng nhằm gây ảnh hưởng cụ thể đến người khác"
                },
                "examples": [
                    {
                        "en": "Don't take her seriously—it's all an act.",
                        "vi": "Đừng coi cô ấy nghiêm túc — tất cả chỉ là một hành động."
                    },
                    {
                        "en": "You could tell she was just putting on an act.",
                        "vi": "Bạn có thể biết cô ấy chỉ đang diễn."
                    }
                ]
            },
            {
                "define": {
                    "en": "one of the main divisions of a play, an opera, etc.",
                    "vi": "một trong những bộ phận chính của một vở kịch, một vở opera, v.v."
                },
                "examples": [
                    {
                        "en": "a play in five acts",
                        "vi": "một vở kịch trong năm màn"
                    },
                    {
                        "en": "The hero dies in Act 5, Scene 3.",
                        "vi": "Người anh hùng chết trong Màn 5, Cảnh 3."
                    },
                    {
                        "en": "The king is killed in the opening act.",
                        "vi": "Nhà vua bị giết trong màn mở đầu."
                    }
                ]
            },
            {
                "define": {
                    "en": "a performance, especially one of several short pieces of entertainment in a show",
                    "vi": "một buổi biểu diễn, đặc biệt là một trong số vài phần giải trí ngắn trong một chương trình"
                },
                "examples": [
                    {
                        "en": "a circus/comedy/magic act",
                        "vi": "một vở xiếc / hài kịch / ảo thuật"
                    },
                    {
                        "en": "her one-woman poetry act",
                        "vi": "hành động thơ một người phụ nữ của cô ấy"
                    }
                ]
            },
            {
                "define": {
                    "en": "a performer or group of musicians",
                    "vi": "một nghệ sĩ biểu diễn hoặc một nhóm nhạc sĩ"
                },
                "examples": [
                    {
                        "en": "They were one of rock's most impressive live acts.",
                        "vi": "Họ là một trong những buổi biểu diễn trực tiếp ấn tượng nhất của rock."
                    }
                ]
            },
            {
                "define": {
                    "en": "an event caused by natural forces beyond human control, such as a storm, a flood or an earthquake",
                    "vi": "một sự kiện gây ra bởi các lực lượng tự nhiên ngoài tầm kiểm soát của con người, chẳng hạn như bão, lũ lụt hoặc động đất"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be/become involved in an activity that somebody else has started, especially to get something for yourself",
                    "vi": "tham gia / tham gia vào một hoạt động mà người khác đã bắt đầu, đặc biệt là để có được thứ gì đó cho chính bạn"
                },
                "examples": [
                    {
                        "en": "Other manufacturers are getting in on the act, creating their own versions of the popular toy.",
                        "vi": "Các nhà sản xuất khác đang vào cuộc, tạo ra các phiên bản đồ chơi phổ biến của riêng họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to start behaving in a moral or responsible way",
                    "vi": "để bắt đầu cư xử một cách có đạo đức hoặc có trách nhiệm"
                },
                "examples": [
                    {
                        "en": "He cleaned up his act and came off drugs.",
                        "vi": "Anh ta đã dọn dẹp hành vi của mình và bỏ ma túy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to go away or be impossible to find when people need or want you",
                    "vi": "đi xa hoặc không thể tìm thấy khi mọi người cần hoặc muốn bạn"
                },
                "examples": [
                    {
                        "en": "The cat had done a disappearing act.",
                        "vi": "Con mèo đã thực hiện một hành động biến mất."
                    }
                ]
            },
            {
                "define": {
                    "en": "to organize yourself and your activities in a more effective way in order to achieve something",
                    "vi": "tổ chức bản thân và các hoạt động của bạn theo cách hiệu quả hơn để đạt được điều gì đó"
                },
                "examples": [
                    {
                        "en": "He needs to get his act together if he's going to pass.",
                        "vi": "Anh ấy cần phải tập hợp lại hành động của mình nếu anh ấy sẽ vượt qua."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person or event that is so good or successful at something that it will be difficult for anyone/anything else coming after them to be as good or successful",
                    "vi": "một người hoặc một sự kiện quá tốt hoặc thành công ở một thứ gì đó mà sẽ khó cho bất kỳ ai / bất cứ điều gì khác sau họ trở nên tốt hoặc thành công"
                },
                "examples": [
                    {
                        "en": "She has been an excellent principal and will be a hard act to follow.",
                        "vi": "Cô ấy đã là một hiệu trưởng xuất sắc và sẽ là một hành động khó để noi theo."
                    },
                    {
                        "en": "Their contribution will prove a tough act to follow.",
                        "vi": "Sự đóng góp của họ sẽ chứng minh một hành động khó khăn để làm theo."
                    }
                ]
            },
            {
                "define": {
                    "en": "while you are doing something",
                    "vi": "trong khi bạn đang làm gì đó"
                },
                "examples": [
                    {
                        "en": "He was caught in the act of stealing a car.",
                        "vi": "Anh ta bị bắt quả tang khi đang thực hiện hành vi trộm xe."
                    },
                    {
                        "en": "It is often difficult to tell when someone is using drugs unless they are caught in the act.",
                        "vi": "Thường rất khó để biết ai đó đang sử dụng ma túy trừ khi họ bị bắt quả tang."
                    }
                ]
            },
            {
                "define": {
                    "en": "to tell somebody with force that they must not do something",
                    "vi": "buộc phải nói với ai đó rằng họ không được làm điều gì đó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "3f566a3d88d94373a42b482623db423b",
        "word": "illegal",
        "pos": "adjective",
        "level": "b1",
        "phonetic": {
            "uk": "/ɪˈliːɡl/",
            "us": "/ɪˈliːɡl/"
        },
        "nearby": [
            {
                "word": "ill-defined",
                "pos": "adjective"
            },
            {
                "word": "ill-disposed",
                "pos": "adjective"
            },
            {
                "word": "illegal",
                "pos": "adjective"
            },
            {
                "word": "illegal",
                "pos": "noun"
            },
            {
                "word": "illegality",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "not allowed by the law",
                    "vi": "không được luật pháp cho phép"
                },
                "examples": [
                    {
                        "en": "illegal drugs/firearms/substances",
                        "vi": "ma túy / súng / chất bất hợp pháp"
                    },
                    {
                        "en": "She promised to crack down on illegal immigration.",
                        "vi": "Cô hứa sẽ trấn áp tình trạng nhập cư bất hợp pháp."
                    },
                    {
                        "en": "illegal immigrants/aliens",
                        "vi": "người nhập cư bất hợp pháp / người nước ngoài"
                    },
                    {
                        "en": "His illegal activities landed him in jail several times.",
                        "vi": "Các hoạt động bất hợp pháp của anh ta đã khiến anh ta phải ngồi tù nhiều lần."
                    },
                    {
                        "en": "illegal mining/fishing/gambling",
                        "vi": "khai thác / đánh bắt cá / cờ bạc bất hợp pháp"
                    },
                    {
                        "en": "These proposals are unethical and possibly illegal.",
                        "vi": "Những đề xuất này là phi đạo đức và có thể là bất hợp pháp."
                    },
                    {
                        "en": "it is illegal to do something It's illegal to drive through a red light.",
                        "vi": "làm điều gì đó là vi phạm pháp luật Lái xe vượt đèn đỏ là bất hợp pháp."
                    },
                    {
                        "en": "it is illegal for somebody to do something It is illegal for anyone under 18 to possess fireworks in a public place.",
                        "vi": "Ai đó làm điều gì đó là bất hợp pháp Mọi người dưới 18 tuổi sở hữu pháo hoa ở nơi công cộng là bất hợp pháp."
                    }
                ]
            }
        ]
    },
    {
        "id": "d856963df0cc485f97b2d47125cdc868",
        "word": "illegally",
        "pos": "adverb",
        "level": "b1",
        "phonetic": {
            "uk": "/ɪˈliːɡəli/",
            "us": "/ɪˈliːɡəli/"
        },
        "nearby": [
            {
                "word": "illegal",
                "pos": "noun"
            },
            {
                "word": "illegality",
                "pos": "noun"
            },
            {
                "word": "illegally",
                "pos": "adverb"
            },
            {
                "word": "illegible",
                "pos": "adjective"
            },
            {
                "word": "illegibly",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "in a way that is not allowed by the law",
                    "vi": "theo cách mà pháp luật không cho phép"
                },
                "examples": [
                    {
                        "en": "an illegally parked car",
                        "vi": "một chiếc xe đậu trái phép"
                    },
                    {
                        "en": "He entered the country illegally.",
                        "vi": "Anh ta nhập cảnh bất hợp pháp."
                    }
                ]
            }
        ]
    },
    {
        "id": "7d6106618d4546a29c122e567966ce22",
        "word": "legal",
        "pos": "adjective",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈliːɡl/",
            "us": "/ˈliːɡl/"
        },
        "nearby": [
            {
                "word": "legacy",
                "pos": "noun"
            },
            {
                "word": "legacy",
                "pos": "adjective"
            },
            {
                "word": "legal",
                "pos": "adjective"
            },
            {
                "word": "legal action",
                "pos": "noun"
            },
            {
                "word": "legal age",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "connected with the law",
                    "vi": "kết nối với luật pháp"
                },
                "examples": [
                    {
                        "en": "the legal profession/system",
                        "vi": "hệ thống / nghề luật"
                    },
                    {
                        "en": "to take/seek legal advice",
                        "vi": "để thực hiện / tìm kiếm lời khuyên pháp lý"
                    },
                    {
                        "en": "a legal adviser/expert/team",
                        "vi": "một cố vấn pháp lý / chuyên gia / nhóm"
                    },
                    {
                        "en": "legal fees/costs",
                        "vi": "phí / chi phí pháp lý"
                    },
                    {
                        "en": "They are currently facing a long legal battle in the US courts.",
                        "vi": "Họ hiện đang phải đối mặt với một cuộc chiến pháp lý kéo dài tại tòa án Hoa Kỳ."
                    },
                    {
                        "en": "Campaigners have have threatened to mount a legal challenge on human rights grounds.",
                        "vi": "Các nhà vận động đã đe dọa đưa ra một thách thức pháp lý trên cơ sở nhân quyền."
                    }
                ]
            },
            {
                "define": {
                    "en": "allowed or required by law",
                    "vi": "luật pháp cho phép hoặc yêu cầu"
                },
                "examples": [
                    {
                        "en": "legal rights/obligations",
                        "vi": "quyền / nghĩa vụ pháp lý"
                    },
                    {
                        "en": "The legal status of refugees was defined in the Refugee Convention of 1951.",
                        "vi": "Địa vị pháp lý của người tị nạn được xác định trong Công ước về người tị nạn năm 1951."
                    },
                    {
                        "en": "The driver was more than three times over the legal limit (= the amount of alcohol you are allowed to have in your body when you are driving).",
                        "vi": "Người lái xe đã vượt quá giới hạn luật định gấp ba lần (= lượng cồn bạn được phép có trong người khi lái xe)."
                    },
                    {
                        "en": "Should euthanasia be made legal?",
                        "vi": "Euthanasia có nên được coi là hợp pháp không?"
                    },
                    {
                        "en": "legal for somebody substances such as alcohol and nicotine that are legal for adults",
                        "vi": "hợp pháp đối với một số chất như rượu và nicotin hợp pháp đối với người lớn"
                    },
                    {
                        "en": "legal to do Many of these products are actually legal to use in the United States.",
                        "vi": "hợp pháp để làm Nhiều sản phẩm trong số này thực sự hợp pháp để sử dụng ở Hoa Kỳ."
                    },
                    {
                        "en": "it is legal (for somebody) to do something It is now perfectly legal to gamble online in Nevada.",
                        "vi": "nó là hợp pháp (đối với ai đó) để làm điều gì đó Giờ đây đánh bạc trực tuyến ở Nevada là hoàn toàn hợp pháp."
                    }
                ]
            }
        ]
    },
    {
        "id": "3e6135ddd39542bbabda837bc0748caa",
        "word": "legally",
        "pos": "adverb",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈliːɡəli/",
            "us": "/ˈliːɡəli/"
        },
        "nearby": [
            {
                "word": "legalization",
                "pos": "noun"
            },
            {
                "word": "legalize",
                "pos": "verb"
            },
            {
                "word": "legally",
                "pos": "adverb"
            },
            {
                "word": "legal pad",
                "pos": "noun"
            },
            {
                "word": "legal proceedings",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "in a way that is connected with the law",
                    "vi": "theo cách có liên quan với luật pháp"
                },
                "examples": [
                    {
                        "en": "a legally binding agreement",
                        "vi": "một thỏa thuận ràng buộc pháp lý"
                    },
                    {
                        "en": "to be legally responsible for somebody/something",
                        "vi": "chịu trách nhiệm pháp lý cho ai đó / cái gì đó"
                    },
                    {
                        "en": "Legally, there is not a lot we can do.",
                        "vi": "Về mặt pháp lý, chúng ta không thể làm được gì nhiều."
                    },
                    {
                        "en": "It’s an important case both legally and politically.",
                        "vi": "Đó là một trường hợp quan trọng cả về mặt pháp lý và chính trị."
                    }
                ]
            },
            {
                "define": {
                    "en": "in a way that is allowed or required by law",
                    "vi": "theo cách được pháp luật cho phép hoặc yêu cầu"
                },
                "examples": [
                    {
                        "en": "You are legally entitled to a full refund.",
                        "vi": "Bạn được hoàn tiền đầy đủ một cách hợp pháp."
                    },
                    {
                        "en": "The drug can be sold legally in some states.",
                        "vi": "Thuốc có thể được bán hợp pháp ở một số tiểu bang."
                    }
                ]
            }
        ]
    },
    {
        "id": "b1264e55c25b4e36a17505451f9b0752",
        "word": "order",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈɔːdə(r)/",
            "us": "/ˈɔːrdər/"
        },
        "nearby": [
            {
                "word": "ordain",
                "pos": "verb"
            },
            {
                "word": "ordeal",
                "pos": "noun"
            },
            {
                "word": "order",
                "pos": "noun"
            },
            {
                "word": "order",
                "pos": "verb"
            },
            {
                "word": "order about",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the way in which people or things are placed or arranged in relation to each other",
                    "vi": "cách mà mọi người hoặc mọi thứ được đặt hoặc sắp xếp trong mối quan hệ với nhau"
                },
                "examples": [
                    {
                        "en": "in… order The names are listed in alphabetical order.",
                        "vi": "theo thứ tự… Tên được liệt kê theo thứ tự bảng chữ cái."
                    },
                    {
                        "en": "The winning scores, in reverse order, are as follows.",
                        "vi": "Điểm số chiến thắng, theo thứ tự ngược lại, như sau."
                    },
                    {
                        "en": "in the/a… order Put the words in the correct order.",
                        "vi": "theo thứ tự / a… Đặt các từ theo đúng thứ tự."
                    },
                    {
                        "en": "Let's take the problems in a different order.",
                        "vi": "Hãy giải quyết các vấn đề theo một thứ tự khác."
                    },
                    {
                        "en": "in order of something arranged in order of preference/importance/priority",
                        "vi": "thứ tự của một cái gì đó được sắp xếp theo thứ tự ưu tiên / quan trọng / ưu tiên"
                    },
                    {
                        "en": "out of order Scenes in films are often shot out of order.",
                        "vi": "trật tự Các cảnh trong phim thường được quay không theo thứ tự."
                    },
                    {
                        "en": "Make sure you get the chronological order right.",
                        "vi": "Đảm bảo rằng bạn có đúng thứ tự thời gian."
                    }
                ]
            },
            {
                "define": {
                    "en": "the state of being carefully and neatly arranged",
                    "vi": "trạng thái được sắp xếp cẩn thận và gọn gàng"
                },
                "examples": [
                    {
                        "en": "in/into order It was time she put her life in order.",
                        "vi": "vào / vào trật tự Đã đến lúc cô ấy đặt cuộc sống của mình vào trật tự."
                    },
                    {
                        "en": "The house had been kept in good order.",
                        "vi": "Ngôi nhà đã được giữ trong một trật tự tốt."
                    },
                    {
                        "en": "Get your ideas into some sort of order before beginning to write.",
                        "vi": "Hãy sắp xếp các ý tưởng của bạn theo một thứ tự nào đó trước khi bắt đầu viết."
                    },
                    {
                        "en": "It is one of the functions of art to bring order out of chaos.",
                        "vi": "Nó là một trong những chức năng của nghệ thuật để mang lại trật tự khỏi hỗn loạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "the state that exists when people obey laws, rules or authority",
                    "vi": "nhà nước tồn tại khi mọi người tuân theo luật pháp, quy tắc hoặc thẩm quyền"
                },
                "examples": [
                    {
                        "en": "The army has been sent to maintain order in the capital.",
                        "vi": "Quân đội đã được cử đến để duy trì trật tự ở thủ đô."
                    },
                    {
                        "en": "The police struggled to restore order.",
                        "vi": "Cảnh sát rất vất vả để vãn hồi trật tự."
                    },
                    {
                        "en": "in order Some teachers find it difficult to keep their classes in order.",
                        "vi": "trật tự Một số giáo viên cảm thấy khó khăn để giữ cho lớp học của họ có trật tự."
                    },
                    {
                        "en": "to order He soon brought the rebels to order.",
                        "vi": "để ra lệnh Ông đã sớm đưa những người nổi dậy để đặt hàng."
                    },
                    {
                        "en": "The film was banned as a potential threat to public order.",
                        "vi": "Bộ phim đã bị cấm như một mối đe dọa tiềm tàng đối với trật tự công cộng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a request for food or drinks in a restaurant, bar, etc.",
                    "vi": "yêu cầu đồ ăn hoặc thức uống trong nhà hàng, quán bar, v.v."
                },
                "examples": [
                    {
                        "en": "The waiter came to take their orders.",
                        "vi": "Người phục vụ đến nhận đơn đặt hàng của họ."
                    },
                    {
                        "en": "You place your order at the front counter.",
                        "vi": "Bạn đặt hàng tại quầy trước."
                    },
                    {
                        "en": "a food/drink(s) order",
                        "vi": "một (các) món ăn / đồ uống"
                    },
                    {
                        "en": "order for something an order for steak and fries",
                        "vi": "gọi món gì đó gọi món bít tết và khoai tây chiên"
                    }
                ]
            },
            {
                "define": {
                    "en": "food or drinks that you ask for in a restaurant, bar, etc.",
                    "vi": "thức ăn hoặc đồ uống mà bạn yêu cầu tại nhà hàng, quán bar, v.v."
                },
                "examples": [
                    {
                        "en": "The waiter brought my order.",
                        "vi": "Người phục vụ mang món cho tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a request to make or supply goods",
                    "vi": "yêu cầu sản xuất hoặc cung cấp hàng hóa"
                },
                "examples": [
                    {
                        "en": "order for something I would like to place an order for ten copies of this book.",
                        "vi": "đặt hàng cho một cái gì đó Tôi muốn đặt hàng mười bản của cuốn sách này."
                    },
                    {
                        "en": "Complete the online order form.",
                        "vi": "Hoàn thành mẫu đơn đặt hàng trực tuyến."
                    },
                    {
                        "en": "order fulfilment/processing",
                        "vi": "thực hiện / xử lý đơn hàng"
                    },
                    {
                        "en": "on order The machine parts are still on order (= they have been ordered but have not yet been received).",
                        "vi": "theo đơn đặt hàng Các bộ phận máy vẫn đang được đặt hàng (= chúng đã được đặt hàng nhưng vẫn chưa được nhận)."
                    },
                    {
                        "en": "to order These items can be made to order (= produced especially for a particular customer).",
                        "vi": "để đặt hàng Những mặt hàng này có thể được thực hiện theo đơn đặt hàng (= được sản xuất đặc biệt cho một khách hàng cụ thể)."
                    }
                ]
            },
            {
                "define": {
                    "en": "goods supplied in response to a particular order that somebody has placed",
                    "vi": "hàng hóa được cung cấp để đáp ứng một đơn đặt hàng cụ thể mà ai đó đã đặt"
                },
                "examples": [
                    {
                        "en": "The stationery order has arrived.",
                        "vi": "Đơn đặt hàng văn phòng phẩm đã đến."
                    }
                ]
            },
            {
                "define": {
                    "en": "something that somebody is told to do by somebody in authority",
                    "vi": "điều gì đó mà ai đó được bảo phải làm bởi ai đó có thẩm quyền"
                },
                "examples": [
                    {
                        "en": "Dogs can be trained to obey orders.",
                        "vi": "Chó có thể được huấn luyện để tuân theo mệnh lệnh."
                    },
                    {
                        "en": "Their defence was that they were only following orders.",
                        "vi": "Biện hộ của họ là họ chỉ làm theo mệnh lệnh."
                    },
                    {
                        "en": "to disobey/defy orders",
                        "vi": "không tuân theo / bất chấp mệnh lệnh"
                    },
                    {
                        "en": "order from somebody She takes orders only from the president.",
                        "vi": "lệnh từ ai đó Cô ấy chỉ nhận lệnh từ tổng thống."
                    },
                    {
                        "en": "order to do something The general gave the order to advance.",
                        "vi": "lệnh làm gì đó Tướng quân ra lệnh tiến quân."
                    },
                    {
                        "en": "order for somebody/something to do something He issued orders for the work to begin.",
                        "vi": "ra lệnh cho ai đó / điều gì đó làm điều gì đó Anh ta ra lệnh cho công việc bắt đầu."
                    },
                    {
                        "en": "under orders (to do something) I'm under orders not to let anyone in.",
                        "vi": "theo lệnh (để làm điều gì đó) Tôi được lệnh không cho bất cứ ai vào."
                    },
                    {
                        "en": "by (the) order of somebody/something Interest rates can be controlled by order of the central bank.",
                        "vi": "bởi (lệnh) của ai đó / cái gì đó Lãi suất có thể được kiểm soát theo lệnh của ngân hàng trung ương."
                    },
                    {
                        "en": "(informal) No sugar for me—doctor's orders.",
                        "vi": "(không chính thức) Không đường cho tôi — theo đơn của bác sĩ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a formal written instruction for somebody to be paid money or to do something",
                    "vi": "một hướng dẫn chính thức bằng văn bản để ai đó được trả tiền hoặc làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "You can cash the order at any post office.",
                        "vi": "Bạn có thể thanh toán đơn hàng tại bất kỳ bưu điện nào."
                    }
                ]
            },
            {
                "define": {
                    "en": "the way that a society, the world, etc. is arranged, with its system of rules and customs",
                    "vi": "cách mà một xã hội, thế giới, v.v. được sắp xếp, với hệ thống luật lệ và phong tục của nó"
                },
                "examples": [
                    {
                        "en": "a change in the political and social order",
                        "vi": "thay đổi trật tự chính trị và xã hội"
                    },
                    {
                        "en": "the natural order of things",
                        "vi": "trật tự tự nhiên của mọi thứ"
                    },
                    {
                        "en": "He was seen as a threat to the established order.",
                        "vi": "Anh ta được coi là một mối đe dọa đối với trật tự đã được thiết lập."
                    },
                    {
                        "en": "A new world order seems to be emerging.",
                        "vi": "Một trật tự thế giới mới dường như đang xuất hiện."
                    },
                    {
                        "en": "The old order in Europe saw rapid change in the late 1980s.",
                        "vi": "Trật tự cũ ở châu Âu đã chứng kiến sự thay đổi nhanh chóng vào cuối những năm 1980."
                    }
                ]
            },
            {
                "define": {
                    "en": "a social class",
                    "vi": "một tầng lớp xã hội"
                },
                "examples": [
                    {
                        "en": "the lower orders",
                        "vi": "các đơn đặt hàng thấp hơn"
                    }
                ]
            },
            {
                "define": {
                    "en": "a group into which animals, plants, etc. that have similar characteristics are divided, smaller than a class and larger than a family",
                    "vi": "Nhóm động vật, thực vật, v.v. có các đặc điểm giống nhau được phân chia, nhỏ hơn một lớp và lớn hơn một họ"
                },
                "examples": [
                    {
                        "en": "the order of primates",
                        "vi": "trật tự của các loài linh trưởng"
                    }
                ]
            },
            {
                "define": {
                    "en": "a group of people living in a religious community, especially monks or nuns",
                    "vi": "một nhóm người sống trong một cộng đồng tôn giáo, đặc biệt là các nhà sư hoặc nữ tu"
                },
                "examples": [
                    {
                        "en": "religious orders",
                        "vi": "các dòng tu"
                    },
                    {
                        "en": "the Benedictine order",
                        "vi": "lệnh Benedictine"
                    }
                ]
            },
            {
                "define": {
                    "en": "a group of people who have been given a special honour by a queen, king, president, etc.",
                    "vi": "một nhóm người được nữ hoàng, nhà vua, tổng thống, v.v. đặc biệt tôn vinh."
                },
                "examples": [
                    {
                        "en": "The Order of the Garter is an ancient order of chivalry.",
                        "vi": "Order of the Garter là một trật tự hiệp sĩ cổ xưa."
                    }
                ]
            },
            {
                "define": {
                    "en": "a badge or ribbon worn by members of an order who have been given a special honour",
                    "vi": "một huy hiệu hoặc dải băng được đeo bởi các thành viên của một đơn đặt hàng đã được vinh danh đặc biệt"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a secret society whose members meet for special ceremonies",
                    "vi": "một hội kín có các thành viên gặp nhau cho những buổi lễ đặc biệt"
                },
                "examples": [
                    {
                        "en": "the Ancient Order of Druids",
                        "vi": "Giáo đoàn Druids cổ đại"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be/become a priest",
                    "vi": "trở thành / trở thành một linh mục"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be very difficult to do",
                    "vi": "rất khó để làm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to order somebody to obey the formal rules of a meeting; to start a formal meeting",
                    "vi": "ra lệnh cho ai đó tuân theo các quy tắc chính thức của một cuộc họp; để bắt đầu một cuộc họp chính thức"
                },
                "examples": [
                    {
                        "en": "The argument continued until the chairman called them both to order.",
                        "vi": "Cuộc tranh cãi tiếp tục cho đến khi chủ tọa gọi cả hai ra trật tự."
                    },
                    {
                        "en": "The president brought the meeting to order at 9.15 a.m.",
                        "vi": "Chủ tịch đưa cuộc họp vào trật tự lúc 9 giờ 15 sáng."
                    },
                    {
                        "en": "As the meeting was brought to order, the councillor immediately stood and began to protest.",
                        "vi": "Khi cuộc họp đã đi vào nề nếp, ủy viên hội đồng ngay lập tức đứng dậy và bắt đầu phản đối."
                    }
                ]
            },
            {
                "define": {
                    "en": "to ask people in a meeting to be quiet so that the meeting can start or continue",
                    "vi": "yêu cầu mọi người trong cuộc họp im lặng để cuộc họp có thể bắt đầu hoặc tiếp tục"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be ordered to leave a place, a job, etc.",
                    "vi": "được lệnh rời khỏi một nơi, một công việc, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to order somebody to leave a place, their job, etc.",
                    "vi": "ra lệnh cho ai đó rời khỏi một nơi, công việc của họ, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "that can be used because it is all correct and legal",
                    "vi": "có thể được sử dụng vì tất cả đều đúng và hợp pháp"
                },
                "examples": [
                    {
                        "en": "Is your work permit in order?",
                        "vi": "Giấy phép lao động của bạn có phải là thứ tự không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "as it should be",
                    "vi": "như nó phải là"
                },
                "examples": [
                    {
                        "en": "Is everything in order, sir?",
                        "vi": "Mọi thứ đã ổn chưa, thưa ông?"
                    }
                ]
            },
            {
                "define": {
                    "en": "if something is in order, it is a suitable thing to do or say on a particular occasion",
                    "vi": "nếu một cái gì đó theo thứ tự, đó là một điều thích hợp để làm hoặc nói vào một dịp cụ thể"
                },
                "examples": [
                    {
                        "en": "I think a drink would be in order.",
                        "vi": "Tôi nghĩ rằng một thức uống sẽ được theo thứ tự."
                    },
                    {
                        "en": "Would it be in order for us to examine the manuscript?",
                        "vi": "Có phải để chúng tôi kiểm tra bản thảo không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "allowed according to the rules of a meeting, etc.",
                    "vi": "được phép theo quy tắc của một cuộc họp, v.v."
                },
                "examples": [
                    {
                        "en": "Is it in order to speak now?",
                        "vi": "Nó là để nói bây giờ?"
                    }
                ]
            },
            {
                "define": {
                    "en": "so that something can happen",
                    "vi": "để điều gì đó có thể xảy ra"
                },
                "examples": [
                    {
                        "en": "All those concerned must work together in order that agreement can be reached on this issue.",
                        "vi": "Tất cả những người có liên quan phải làm việc cùng nhau để có thể đạt được thỏa thuận về vấn đề này."
                    }
                ]
            },
            {
                "define": {
                    "en": "with the purpose or intention of doing or achieving something",
                    "vi": "với mục đích hoặc ý định làm hoặc đạt được điều gì đó"
                },
                "examples": [
                    {
                        "en": "She arrived early in order to get a good seat.",
                        "vi": "Cô đến sớm để có chỗ ngồi tốt."
                    },
                    {
                        "en": "In order to get a complete picture, further information is needed.",
                        "vi": "Để có được một bức tranh hoàn chỉnh, cần thêm thông tin."
                    }
                ]
            },
            {
                "define": {
                    "en": "working well",
                    "vi": "làm việc tốt"
                },
                "examples": [
                    {
                        "en": "The engine is now in perfect working order.",
                        "vi": "Động cơ hiện đang hoạt động hoàn hảo."
                    }
                ]
            },
            {
                "define": {
                    "en": "quickly and without trouble",
                    "vi": "nhanh chóng và không gặp khó khăn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a situation in which people obey the law and behave in a peaceful way",
                    "vi": "một tình huống mà mọi người tuân theo luật pháp và cư xử một cách hòa bình"
                },
                "examples": [
                    {
                        "en": "The government struggled to maintain law and order.",
                        "vi": "Chính phủ đã đấu tranh để duy trì luật pháp và trật tự."
                    },
                    {
                        "en": "After the riots, the military was brought in to restore law and order.",
                        "vi": "Sau cuộc bạo loạn, quân đội đã được đưa đến để khôi phục lại luật pháp và trật tự."
                    },
                    {
                        "en": "They claim to be the party of law and order.",
                        "vi": "Họ tự xưng là đảng của luật pháp và trật tự."
                    },
                    {
                        "en": "Martial law was imposed to prevent the breakdown of law and order.",
                        "vi": "Thiết quân luật đã được áp dụng để ngăn chặn sự phá vỡ luật pháp và trật tự."
                    }
                ]
            },
            {
                "define": {
                    "en": "of a high quality or degree; of the highest quality or greatest degree",
                    "vi": "có chất lượng hoặc mức độ cao; chất lượng cao nhất hoặc bằng cấp cao nhất"
                },
                "examples": [
                    {
                        "en": "The job requires diplomatic skills of a high order.",
                        "vi": "Công việc đòi hỏi kỹ năng ngoại giao của một trình tự cao."
                    },
                    {
                        "en": "She was a snob of the first order.",
                        "vi": "Cô ấy là một kẻ hợm hĩnh của đơn đặt hàng đầu tiên."
                    }
                ]
            },
            {
                "define": {
                    "en": "about something; approximately something",
                    "vi": "về một cái gì đó; xấp xỉ một cái gì đó"
                },
                "examples": [
                    {
                        "en": "She earns something in the order of £80 000 a year.",
                        "vi": "Cô ấy kiếm được thứ gì đó với thứ tự £ 80 000 một năm."
                    }
                ]
            },
            {
                "define": {
                    "en": "common, popular or suitable at a particular time or for a particular occasion",
                    "vi": "phổ biến, phổ biến hoặc phù hợp tại một thời điểm cụ thể hoặc cho một dịp cụ thể"
                },
                "examples": [
                    {
                        "en": "Pessimism seems to be the order of the day.",
                        "vi": "Bi quan dường như là thứ tự trong ngày."
                    }
                ]
            },
            {
                "define": {
                    "en": "used by the person in charge of a formal meeting or debate to remind people to obey the rules of the meeting",
                    "vi": "được sử dụng bởi người chủ trì cuộc họp chính thức hoặc cuộc tranh luận để nhắc nhở mọi người tuân theo các quy tắc của cuộc họp"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "not working correctly",
                    "vi": "không hoạt động chính xác"
                },
                "examples": [
                    {
                        "en": "The phone is out of order.",
                        "vi": "Điện thoại bị lỗi."
                    }
                ]
            },
            {
                "define": {
                    "en": "not arranged correctly or neatly",
                    "vi": "sắp xếp không chính xác hoặc gọn gàng"
                },
                "examples": [
                    {
                        "en": "I checked the files and some of the papers were out of order.",
                        "vi": "Tôi đã kiểm tra hồ sơ và một số giấy tờ không đúng thứ tự."
                    }
                ]
            },
            {
                "define": {
                    "en": "behaving in a way that is not acceptable or right",
                    "vi": "hành xử theo cách không thể chấp nhận được hoặc đúng"
                },
                "examples": [
                    {
                        "en": "You were well out of order taking it without asking.",
                        "vi": "Bạn đã mất trật tự để lấy nó mà không cần hỏi."
                    },
                    {
                        "en": "He accepted that he'd been out of order.",
                        "vi": "Anh ta chấp nhận rằng anh ta đã bị mất trật tự."
                    }
                ]
            },
            {
                "define": {
                    "en": "not allowed by the rules of a formal meeting or debate",
                    "vi": "không được phép bởi các quy tắc của một cuộc họp chính thức hoặc cuộc tranh luận"
                },
                "examples": [
                    {
                        "en": "His objection was ruled out of order.",
                        "vi": "Sự phản đối của anh ta đã được loại trừ khỏi trật tự."
                    }
                ]
            },
            {
                "define": {
                    "en": "the order of importance in relation to one another among the members of a group",
                    "vi": "thứ tự quan trọng trong mối quan hệ với nhau giữa các thành viên của một nhóm"
                },
                "examples": [
                    {
                        "en": "New Zealand is at the top of the pecking order of rugby nations.",
                        "vi": "New Zealand là quốc gia đứng đầu bảng xếp hạng các quốc gia chơi bóng bầu dục."
                    },
                    {
                        "en": "to be first in the pecking order",
                        "vi": "đứng đầu trong thứ tự mổ"
                    }
                ]
            },
            {
                "define": {
                    "en": "to organize your own business or improve your own behaviour before you try to criticize somebody else",
                    "vi": "tổ chức công việc kinh doanh của riêng bạn hoặc cải thiện hành vi của chính bạn trước khi bạn cố gắng chỉ trích người khác"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "waiting for a signal to start a race",
                    "vi": "chờ tín hiệu bắt đầu cuộc đua"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "0aa691a91a29446cbf4d8c0ee6b7ab9f",
        "word": "respect",
        "pos": "verb",
        "level": "b1",
        "phonetic": {
            "uk": "/rɪˈspekt/",
            "us": "/rɪˈspekt/"
        },
        "nearby": [
            {
                "word": "respawn",
                "pos": "verb"
            },
            {
                "word": "respect",
                "pos": "noun"
            },
            {
                "word": "respect",
                "pos": "verb"
            },
            {
                "word": "Respect",
                "pos": ""
            },
            {
                "word": "respectability",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to have a very good opinion of somebody/something; to admire somebody/something",
                    "vi": "để có một ý kiến rất tốt về ai đó / cái gì đó; ngưỡng mộ ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "I respect Jack's opinion on most subjects.",
                        "vi": "Tôi tôn trọng ý kiến của Jack về hầu hết các chủ đề."
                    },
                    {
                        "en": "She was a much loved and highly respected teacher.",
                        "vi": "Cô là một giáo viên được nhiều người yêu mến và kính trọng."
                    },
                    {
                        "en": "respect somebody/something for something She had always been honest with me, and I respect her for that.",
                        "vi": "tôn trọng ai đó / điều gì đó vì điều gì đó Cô ấy đã luôn thành thật với tôi và tôi tôn trọng cô ấy vì điều đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be careful about something; to make sure you do not do something that might be considered wrong",
                    "vi": "phải cẩn thận về một cái gì đó; để đảm bảo rằng bạn không làm điều gì đó có thể bị coi là sai"
                },
                "examples": [
                    {
                        "en": "Employers must respect employees' privacy.",
                        "vi": "Người sử dụng lao động phải tôn trọng quyền riêng tư của người lao động."
                    },
                    {
                        "en": "to respect other people’s property",
                        "vi": "tôn trọng tài sản của người khác"
                    },
                    {
                        "en": "I respect your right to disagree.",
                        "vi": "Tôi tôn trọng quyền không đồng ý của bạn."
                    },
                    {
                        "en": "She promised to respect our wishes.",
                        "vi": "Cô ấy hứa sẽ tôn trọng mong muốn của chúng tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to agree not to break a law, principle, etc.",
                    "vi": "đồng ý không vi phạm luật lệ, nguyên tắc, v.v."
                },
                "examples": [
                    {
                        "en": "The new leader has promised to respect the constitution.",
                        "vi": "Nhà lãnh đạo mới đã hứa sẽ tôn trọng hiến pháp."
                    },
                    {
                        "en": "The government has promised to respect human rights.",
                        "vi": "Chính phủ đã hứa sẽ tôn trọng nhân quyền."
                    }
                ]
            }
        ]
    },
    {
        "id": "86e445b36c7d4aa697b2201ed3e6265e",
        "word": "bill",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/bɪl/",
            "us": "/bɪl/"
        },
        "nearby": [
            {
                "word": "bilk",
                "pos": "verb"
            },
            {
                "word": "Sergeant Bilko",
                "pos": ""
            },
            {
                "word": "bill",
                "pos": "noun"
            },
            {
                "word": "bill",
                "pos": "verb"
            },
            {
                "word": "Bill",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a document that shows how much you owe somebody for goods or services",
                    "vi": "một tài liệu cho thấy bạn nợ ai đó bao nhiêu tiền cho hàng hoá hoặc dịch vụ"
                },
                "examples": [
                    {
                        "en": "the phone/electricity/gas bill",
                        "vi": "hóa đơn điện thoại / điện / gas"
                    },
                    {
                        "en": "He is facing a huge tax bill.",
                        "vi": "Anh ấy đang phải đối mặt với một hóa đơn thuế khổng lồ."
                    },
                    {
                        "en": "She always pays her bills on time.",
                        "vi": "Cô ấy luôn thanh toán các hóa đơn của mình đúng hạn."
                    },
                    {
                        "en": "We ran up a massive hotel bill.",
                        "vi": "Chúng tôi đã thanh toán một hóa đơn khách sạn lớn."
                    },
                    {
                        "en": "bill for something I’ll be sending you the bill for the dry-cleaning!",
                        "vi": "hóa đơn cho thứ gì đó Tôi sẽ gửi cho bạn hóa đơn giặt hấp!"
                    },
                    {
                        "en": "The bills are piling up (= there are more and more that have still not been paid).",
                        "vi": "Các hóa đơn đang chồng chất (= ngày càng có nhiều khoản vẫn chưa được thanh toán)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of paper that shows how much you have to pay for the food and drinks that you have had in a restaurant",
                    "vi": "một mảnh giấy cho biết bạn phải trả bao nhiêu cho đồ ăn và thức uống mà bạn đã dùng trong một nhà hàng"
                },
                "examples": [
                    {
                        "en": "Let's ask for the bill.",
                        "vi": "Hãy yêu cầu các hóa đơn."
                    },
                    {
                        "en": "Could we have the bill, please?",
                        "vi": "Chúng tôi có thể lấy hóa đơn không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of paper money",
                    "vi": "một tờ tiền"
                },
                "examples": [
                    {
                        "en": "a ten-dollar bill",
                        "vi": "một tờ mười đô la"
                    }
                ]
            },
            {
                "define": {
                    "en": "a written suggestion for a new law that is presented to a country’s parliament so that its members can discuss it",
                    "vi": "một đề xuất bằng văn bản cho một luật mới được trình lên quốc hội của một quốc gia để các thành viên của quốc gia đó có thể thảo luận về nó"
                },
                "examples": [
                    {
                        "en": "to introduce/approve/oppose a bill",
                        "vi": "giới thiệu / thông qua / phản đối một dự luật"
                    },
                    {
                        "en": "Congress passed the energy bill last month.",
                        "vi": "Quốc hội đã thông qua dự luật năng lượng vào tháng trước."
                    },
                    {
                        "en": "Republicans said they would support the bill.",
                        "vi": "Đảng Cộng hòa cho biết họ sẽ ủng hộ dự luật."
                    },
                    {
                        "en": "the Education Reform Bill",
                        "vi": "Dự luật Cải cách Giáo dục"
                    }
                ]
            },
            {
                "define": {
                    "en": "a programme of entertainment at a theatre, etc.",
                    "vi": "một chương trình giải trí tại nhà hát, v.v."
                },
                "examples": [
                    {
                        "en": "a horror double bill (= two horror films shown one after the other)",
                        "vi": "một hóa đơn kinh dị gấp đôi (= hai bộ phim kinh dị được chiếu lần lượt)"
                    },
                    {
                        "en": "Topping the bill (= the most important performer) is violinist Joshua Bell.",
                        "vi": "Đứng đầu bảng (= nghệ sĩ biểu diễn quan trọng nhất) là nghệ sĩ vĩ cầm Joshua Bell."
                    },
                    {
                        "en": "Mozart is on the bill this evening.",
                        "vi": "Mozart có mặt trong hóa đơn tối nay."
                    }
                ]
            },
            {
                "define": {
                    "en": "a notice in a public place to advertise an event",
                    "vi": "một thông báo ở nơi công cộng để quảng cáo một sự kiện"
                },
                "examples": [
                    {
                        "en": "Post no bills (= a notice warning people not to stick bills in a particular place).",
                        "vi": "Không đăng hóa đơn (= một thông báo cảnh báo mọi người không dán hóa đơn ở một nơi cụ thể)."
                    }
                ]
            },
            {
                "define": {
                    "en": "the hard pointed or curved outer part of a bird’s mouth",
                    "vi": "phần ngoài cứng nhọn hoặc cong của miệng chim"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "having the type of bill mentioned",
                    "vi": "có loại hóa đơn được đề cập"
                },
                "examples": [
                    {
                        "en": "long-billed waders",
                        "vi": "waders thanh toán dài"
                    }
                ]
            },
            {
                "define": {
                    "en": "the stiff front part of a cap that sticks out above your eyes",
                    "vi": "phần trước cứng của một chiếc mũ lưỡi trai nhô ra khỏi mắt bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a report that says somebody is healthy or that something is in good condition",
                    "vi": "một báo cáo nói rằng ai đó khỏe mạnh hoặc một cái gì đó đang ở trong tình trạng tốt"
                },
                "examples": [
                    {
                        "en": "Doctors gave him a clean bill of health after a series of tests and examinations.",
                        "vi": "Các bác sĩ đã cho anh ta một sức khỏe sạch sẽ sau một loạt các xét nghiệm và kiểm tra."
                    },
                    {
                        "en": "The building was given a clean bill of health by the surveyor.",
                        "vi": "Tòa nhà đã được một nhà khảo sát đưa ra một hóa đơn sạch về sức khỏe."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be what is needed in a particular situation or for a particular purpose",
                    "vi": "là những gì cần thiết trong một tình huống cụ thể hoặc cho một mục đích cụ thể"
                },
                "examples": [
                    {
                        "en": "On paper, several of the applicants fit the bill.",
                        "vi": "Trên giấy tờ, một số người nộp đơn phù hợp với hóa đơn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be responsible for paying the cost of something",
                    "vi": "chịu trách nhiệm thanh toán chi phí của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "Once again it will be the taxpayer who has to foot the bill.",
                        "vi": "Một lần nữa, người đóng thuế sẽ là người phải chấp nhận hóa đơn."
                    },
                    {
                        "en": "Who will be footing the bill for the party?",
                        "vi": "Ai sẽ là người lập hóa đơn cho bữa tiệc?"
                    }
                ]
            }
        ]
    },
    {
        "id": "6d423169664e488881c13c713e8b758d",
        "word": "law and order",
        "pos": "idiom",
        "level": "b2",
        "phonetic": {
            "uk": "/lɔː/",
            "us": "/lɔː/"
        },
        "nearby": [
            {
                "word": "lavish on",
                "pos": "phrasal verb"
            },
            {
                "word": "lavish upon",
                "pos": "phrasal verb"
            },
            {
                "word": "law",
                "pos": "noun"
            },
            {
                "word": "Bonar Law",
                "pos": ""
            },
            {
                "word": "law-abiding",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a rule that deals with a particular crime, agreement, etc.",
                    "vi": "quy tắc xử lý một tội phạm cụ thể, thỏa thuận, v.v."
                },
                "examples": [
                    {
                        "en": "to pass a law (= officially make it part of the system of laws)",
                        "vi": "để thông qua luật (= chính thức biến nó thành một phần của hệ thống luật)"
                    },
                    {
                        "en": "law against (doing) something Police don't have the resources to enforce the law against dumping waste.",
                        "vi": "luật chống lại (làm) điều gì đó Cảnh sát không có đủ nguồn lực để thực thi luật chống đổ chất thải."
                    },
                    {
                        "en": "(informal) There ought to be a law against it!",
                        "vi": "(không chính thức) Cần phải có luật chống lại nó!"
                    },
                    {
                        "en": "law on something The company's actions violated the law on equal employment.",
                        "vi": "luật về điều gì đó Các hành động của công ty đã vi phạm luật về việc làm bình đẳng."
                    },
                    {
                        "en": "The suspects were in clear violation of immigration laws.",
                        "vi": "Các nghi phạm rõ ràng đã vi phạm luật nhập cư."
                    }
                ]
            },
            {
                "define": {
                    "en": "the whole system of rules that everyone in a country or society must obey",
                    "vi": "toàn bộ hệ thống quy tắc mà mọi người trong một quốc gia hoặc xã hội phải tuân theo"
                },
                "examples": [
                    {
                        "en": "If they entered the building they would be breaking the law.",
                        "vi": "Nếu họ bước vào tòa nhà, họ sẽ phạm luật."
                    },
                    {
                        "en": "The reforms have recently become law.",
                        "vi": "Những cải cách gần đây đã trở thành luật."
                    },
                    {
                        "en": "The Civil Rights Act of 1964 became the law of the land on July 2, 1964.",
                        "vi": "Đạo luật Quyền Công dân năm 1964 trở thành luật đất đai vào ngày 2 tháng 7 năm 1964."
                    },
                    {
                        "en": "state/federal law",
                        "vi": "luật tiểu bang / liên bang"
                    },
                    {
                        "en": "State law prohibits gambling in public places.",
                        "vi": "Luật tiểu bang nghiêm cấm đánh bạc ở nơi công cộng."
                    },
                    {
                        "en": "against the law In Sweden it is against the law to hit a child.",
                        "vi": "chống lại luật pháp Ở Thụy Điển, việc đánh một đứa trẻ là vi phạm pháp luật."
                    },
                    {
                        "en": "within the law Defence attorneys can use any means within the law to get their client off.",
                        "vi": "trong luật Các luật sư bào chữa có thể sử dụng bất kỳ phương tiện nào trong luật để đuổi khách hàng của họ."
                    },
                    {
                        "en": "outside the law to operate outside the law",
                        "vi": "ngoài pháp luật hoạt động ngoài pháp luật"
                    },
                    {
                        "en": "by law British schools are required by law to publish their exam results.",
                        "vi": "theo luật Các trường ở Anh được yêu cầu theo luật phải công bố kết quả kỳ thi của họ."
                    },
                    {
                        "en": "under the (…) law | under… law Under existing law, journalists cannot refuse to provide information to a jury.",
                        "vi": "theo (…) luật | theo… luật Theo luật hiện hành, các nhà báo không thể từ chối cung cấp thông tin cho bồi thẩm đoàn."
                    },
                    {
                        "en": "above the law Do not think you are above the law (= that you cannot be punished by the law).",
                        "vi": "Trên cả luật pháp Đừng nghĩ rằng bạn ở trên luật pháp (= rằng bạn không thể bị trừng phạt bởi luật pháp)."
                    },
                    {
                        "en": "They acted in accordance with the law of the country.",
                        "vi": "Họ đã hành động phù hợp với luật pháp của đất nước."
                    },
                    {
                        "en": "The constitution guarantees equality before the law for all.",
                        "vi": "Hiến pháp bảo đảm sự bình đẳng trước pháp luật cho tất cả mọi người."
                    },
                    {
                        "en": "law enforcement agencies/officials",
                        "vi": "các cơ quan / quan chức thực thi pháp luật"
                    },
                    {
                        "en": "(humorous) Kate's word was law in the Brown household.",
                        "vi": "(hài hước) Lời của Kate là luật trong gia đình Brown."
                    }
                ]
            },
            {
                "define": {
                    "en": "a particular branch of the law",
                    "vi": "một nhánh luật cụ thể"
                },
                "examples": [
                    {
                        "en": "He specializes in international law.",
                        "vi": "Ông ấy chuyên về luật quốc tế."
                    },
                    {
                        "en": "tax/employment law",
                        "vi": "luật thuế / việc làm"
                    },
                    {
                        "en": "according to… law According to copyright law, the author is the owner of the material.",
                        "vi": "theo… luật Theo luật bản quyền, tác giả là chủ sở hữu của tài liệu."
                    }
                ]
            },
            {
                "define": {
                    "en": "the study of the law as a subject at university, etc.; the profession of being a lawyer",
                    "vi": "nghiên cứu luật như một môn học ở trường đại học, v.v.; nghề luật sư"
                },
                "examples": [
                    {
                        "en": "a law student/professor",
                        "vi": "một sinh viên luật / giáo sư"
                    },
                    {
                        "en": "Jane is studying law.",
                        "vi": "Jane đang học luật."
                    },
                    {
                        "en": "(North American English) He's in law school.",
                        "vi": "(Tiếng Anh Bắc Mỹ) Anh ấy đang học trường luật."
                    },
                    {
                        "en": "(British English) He's at law school.",
                        "vi": "(Anh Anh) Anh ấy đang ở trường luật."
                    },
                    {
                        "en": "What made you go into law?",
                        "vi": "Điều gì đã khiến bạn sa vào pháp luật?"
                    },
                    {
                        "en": "a law firm",
                        "vi": "một công ty luật"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to refer to the police and the legal system",
                    "vi": "dùng để chỉ cảnh sát và hệ thống pháp luật"
                },
                "examples": [
                    {
                        "en": "Jim is always getting into trouble with the law.",
                        "vi": "Jim luôn gặp rắc rối với luật pháp."
                    },
                    {
                        "en": "She was well known for her brushes with the law.",
                        "vi": "Cô ấy nổi tiếng với những bàn chải của mình với luật pháp."
                    }
                ]
            },
            {
                "define": {
                    "en": "the fact that something always happens in the same way in an activity or in nature",
                    "vi": "thực tế là một cái gì đó luôn xảy ra theo cùng một cách trong một hoạt động hoặc trong tự nhiên"
                },
                "examples": [
                    {
                        "en": "The usual laws of supply and demand do not seem to apply in this case.",
                        "vi": "Quy luật cung và cầu thông thường dường như không áp dụng trong trường hợp này."
                    },
                    {
                        "en": "the laws of nature/physics",
                        "vi": "quy luật tự nhiên / vật lý"
                    }
                ]
            },
            {
                "define": {
                    "en": "a scientific rule that somebody has stated to explain a natural process",
                    "vi": "một quy tắc khoa học mà ai đó đã nêu ra để giải thích một quá trình tự nhiên"
                },
                "examples": [
                    {
                        "en": "the first law of thermodynamics",
                        "vi": "định luật đầu tiên của nhiệt động lực học"
                    },
                    {
                        "en": "Do you remember anything about Ohm's Law?",
                        "vi": "Bạn có nhớ gì về Định luật Ohm không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "one of the rules that controls an organization or activity",
                    "vi": "một trong những quy tắc kiểm soát một tổ chức hoặc hoạt động"
                },
                "examples": [
                    {
                        "en": "the laws of the Church",
                        "vi": "luật của Giáo hội"
                    },
                    {
                        "en": "The first law of kung fu is to defend yourself.",
                        "vi": "Luật đầu tiên của kung fu là tự vệ."
                    },
                    {
                        "en": "the laws of cricket",
                        "vi": "luật chơi cricket"
                    }
                ]
            },
            {
                "define": {
                    "en": "a rule for good behaviour or how you should behave in a particular place or situation",
                    "vi": "quy tắc cho hành vi tốt hoặc cách bạn nên cư xử trong một địa điểm hoặc tình huống cụ thể"
                },
                "examples": [
                    {
                        "en": "He frequently behaved as though moral laws did not exist.",
                        "vi": "Anh ta thường cư xử như thể luật đạo đức không tồn tại."
                    },
                    {
                        "en": "Their world is shaped by their parents' attitudes and the unspoken laws of the street.",
                        "vi": "Thế giới của chúng được định hình bởi thái độ của cha mẹ và những luật bất thành văn trên đường phố."
                    }
                ]
            },
            {
                "define": {
                    "en": "to behave in an independent way and ignore rules or what other people want you to do",
                    "vi": "cư xử theo cách độc lập và phớt lờ các quy tắc hoặc những gì người khác muốn bạn làm"
                },
                "examples": [
                    {
                        "en": "Boys of that age are a law unto themselves.",
                        "vi": "Con trai ở độ tuổi đó là một quy luật đối với bản thân."
                    }
                ]
            },
            {
                "define": {
                    "en": "to ask a court to settle a problem or disagreement",
                    "vi": "yêu cầu tòa án giải quyết vấn đề hoặc bất đồng"
                },
                "examples": [
                    {
                        "en": "They went to law to get back their property.",
                        "vi": "Họ đã tìm đến pháp luật để lấy lại tài sản của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "a situation in which people obey the law and behave in a peaceful way",
                    "vi": "một tình huống mà mọi người tuân theo luật pháp và cư xử một cách hòa bình"
                },
                "examples": [
                    {
                        "en": "The government struggled to maintain law and order.",
                        "vi": "Chính phủ đã đấu tranh để duy trì luật pháp và trật tự."
                    },
                    {
                        "en": "After the riots, the military was brought in to restore law and order.",
                        "vi": "Sau cuộc bạo loạn, quân đội đã được đưa đến để khôi phục lại luật pháp và trật tự."
                    },
                    {
                        "en": "They claim to be the party of law and order.",
                        "vi": "Họ tự xưng là đảng của luật pháp và trật tự."
                    },
                    {
                        "en": "Martial law was imposed to prevent the breakdown of law and order.",
                        "vi": "Thiết quân luật đã được áp dụng để ngăn chặn sự phá vỡ luật pháp và trật tự."
                    }
                ]
            },
            {
                "define": {
                    "en": "the principle that one thing will happen as often as another if you try enough times",
                    "vi": "nguyên tắc rằng một việc sẽ xảy ra thường xuyên như một điều khác nếu bạn cố gắng đủ lần"
                },
                "examples": [
                    {
                        "en": "Keep applying and by the law of averages you'll get a job sooner or later.",
                        "vi": "Hãy tiếp tục nộp đơn và theo quy luật trung bình bạn sẽ sớm có việc làm."
                    }
                ]
            },
            {
                "define": {
                    "en": "a situation in which people are prepared to harm other people in order to succeed",
                    "vi": "một tình huống trong đó mọi người chuẩn bị để làm hại người khác để thành công"
                },
                "examples": [
                    {
                        "en": "These criminal gangs only recognize the law of the jungle.",
                        "vi": "Các băng nhóm tội phạm này chỉ thừa nhận luật rừng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to tell somebody with force what they should or should not do",
                    "vi": "buộc phải nói với ai đó những gì họ nên làm hoặc không nên làm"
                },
                "examples": [
                    {
                        "en": "My dad started laying down the law about what time I should come home.",
                        "vi": "Bố tôi bắt đầu đặt ra luật về thời gian tôi nên về nhà."
                    }
                ]
            },
            {
                "define": {
                    "en": "the exact words of a law or rule rather than its general meaning",
                    "vi": "những từ chính xác của một luật hoặc quy tắc hơn là ý nghĩa chung của nó"
                },
                "examples": [
                    {
                        "en": "They insist on sticking to the letter of the law.",
                        "vi": "Họ nhất quyết bám sát luật lệ."
                    },
                    {
                        "en": "We might be guilty of slightly bending the letter of the law.",
                        "vi": "Chúng tôi có thể phạm tội khi hơi bẻ cong văn bản của luật pháp."
                    },
                    {
                        "en": "In spite of the difficulties it would cause her family, the judge stuck to the letter of the law and jailed her.",
                        "vi": "Bất chấp những khó khăn mà nó sẽ gây ra cho gia đình cô, thẩm phán vẫn tuân theo luật lệ và bỏ tù cô."
                    }
                ]
            },
            {
                "define": {
                    "en": "in trouble with the police",
                    "vi": "gặp rắc rối với cảnh sát"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "if you already have or control something, it is difficult for somebody else to take it away from you, even if they have the legal right to it",
                    "vi": "nếu bạn đã có hoặc kiểm soát một thứ gì đó, thì rất khó để người khác lấy đi nó khỏi bạn, ngay cả khi họ có quyền hợp pháp đối với nó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the condition in which all members of society, including its political leaders, accept the authority of the law",
                    "vi": "điều kiện trong đó tất cả các thành viên của xã hội, bao gồm cả các nhà lãnh đạo chính trị của nó, chấp nhận thẩm quyền của pháp luật"
                },
                "examples": [
                    {
                        "en": "Democracy and the rule of law are yet to be firmly established in the country.",
                        "vi": "Dân chủ và pháp quyền vẫn chưa được thiết lập vững chắc trong nước."
                    }
                ]
            },
            {
                "define": {
                    "en": "to do something illegal in order to punish somebody for doing something wrong, instead of letting the police deal with them",
                    "vi": "làm điều gì đó bất hợp pháp để trừng phạt ai đó đã làm điều gì đó sai trái, thay vì để cảnh sát xử lý họ"
                },
                "examples": [
                    {
                        "en": "After a series of burglaries in the area, the police are worried that residents might take the law into their own hands.",
                        "vi": "Sau hàng loạt vụ trộm trên địa bàn, cảnh sát lo ngại cư dân có thể sa lưới pháp luật."
                    },
                    {
                        "en": "When police failed to arrest the suspect, local people took the law into their own hands and beat him up.",
                        "vi": "Khi cảnh sát không bắt được nghi phạm, người dân địa phương đã lao vào luật pháp và đánh anh ta tới tấp."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to tell somebody who is criticizing you that you are not doing anything wrong",
                    "vi": "được sử dụng để nói với ai đó đang chỉ trích bạn rằng bạn không làm gì sai"
                },
                "examples": [
                    {
                        "en": "I'll sing if I want to—there's no law against it.",
                        "vi": "Tôi sẽ hát nếu tôi muốn - không có luật nào chống lại điều đó."
                    }
                ]
            }
        ]
    },
    {
        "id": "80c2a6962ea546ca881cd389ba269c8d",
        "word": "prohibit",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/prəˈhɪbɪt/",
            "us": "/prəˈhɪbɪt/"
        },
        "nearby": [
            {
                "word": "progressivism",
                "pos": "noun"
            },
            {
                "word": "prog rock",
                "pos": "noun"
            },
            {
                "word": "prohibit",
                "pos": "verb"
            },
            {
                "word": "prohibited",
                "pos": "adjective"
            },
            {
                "word": "prohibition",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to stop something from being done or used especially by law",
                    "vi": "để ngăn chặn điều gì đó được thực hiện hoặc sử dụng, đặc biệt là theo luật"
                },
                "examples": [
                    {
                        "en": "prohibit something a law prohibiting the sale of alcohol",
                        "vi": "cấm cái gì đó luật cấm bán rượu"
                    },
                    {
                        "en": "prohibit somebody from doing something Soviet citizens were prohibited from travelling abroad.",
                        "vi": "cấm ai đó làm điều gì đó mà công dân Liên Xô bị cấm ra nước ngoài."
                    },
                    {
                        "en": "prohibit (somebody) doing something The policy prohibits smoking on school grounds.",
                        "vi": "cấm (ai đó) làm điều gì đó Chính sách cấm hút thuốc trong khuôn viên trường học."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make something impossible to do",
                    "vi": "để làm một cái gì đó không thể làm được"
                },
                "examples": [
                    {
                        "en": "The high cost of equipment prohibits many people from taking up this sport.",
                        "vi": "Chi phí thiết bị cao khiến nhiều người không muốn tham gia môn thể thao này."
                    }
                ]
            }
        ]
    },
    {
        "id": "be3b026397614454bacd593d02f41237",
        "word": "prohibition",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˌprəʊɪˈbɪʃn/",
            "us": "/ˌprəʊɪˈbɪʃn/"
        },
        "nearby": [
            {
                "word": "prohibit",
                "pos": "verb"
            },
            {
                "word": "prohibited",
                "pos": "adjective"
            },
            {
                "word": "prohibition",
                "pos": "noun"
            },
            {
                "word": "prohibitionist",
                "pos": "noun"
            },
            {
                "word": "prohibitive",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act of stopping something being done or used, especially by law",
                    "vi": "hành động dừng một cái gì đó đang được thực hiện hoặc sử dụng, đặc biệt là theo luật"
                },
                "examples": [
                    {
                        "en": "the prohibition of smoking in public areas",
                        "vi": "cấm hút thuốc ở các khu vực công cộng"
                    }
                ]
            },
            {
                "define": {
                    "en": "a law or a rule that stops something being done or used",
                    "vi": "một luật hoặc một quy tắc ngăn chặn một cái gì đó được thực hiện hoặc sử dụng"
                },
                "examples": [
                    {
                        "en": "a prohibition against selling alcohol to people under the age of 18",
                        "vi": "cấm bán rượu cho người dưới 18 tuổi"
                    },
                    {
                        "en": "prohibitions on the possession of dangerous weapons",
                        "vi": "cấm sở hữu vũ khí nguy hiểm"
                    }
                ]
            },
            {
                "define": {
                    "en": "(in the US) the period of time from 1920 to 1933 when it was illegal to make and sell alcoholic drinks",
                    "vi": "(ở Mỹ) khoảng thời gian từ năm 1920 đến năm 1933 khi việc pha chế và bán đồ uống có cồn là bất hợp pháp"
                },
                "examples": [
                    {
                        "en": "a Prohibition-era speakeasy",
                        "vi": "một sự kiện thời đại bị cấm"
                    }
                ]
            }
        ]
    },
    {
        "id": "f09c4209b2c9443baf4281c6092fe7ef",
        "word": "regulation",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˌreɡjuˈleɪʃn/",
            "us": "/ˌreɡjuˈleɪʃn/"
        },
        "nearby": [
            {
                "word": "regularly",
                "pos": "adverb"
            },
            {
                "word": "regulate",
                "pos": "verb"
            },
            {
                "word": "regulation",
                "pos": "noun"
            },
            {
                "word": "regulation",
                "pos": "adjective"
            },
            {
                "word": "regulator",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an official rule made by a government or some other authority",
                    "vi": "một quy tắc chính thức do chính phủ hoặc một số cơ quan có thẩm quyền khác đưa ra"
                },
                "examples": [
                    {
                        "en": "too many rules and regulations",
                        "vi": "quá nhiều quy tắc và quy định"
                    },
                    {
                        "en": "fire/building regulations",
                        "vi": "quy định về hỏa hoạn / tòa nhà"
                    },
                    {
                        "en": "the strict regulations governing the sale of weapons",
                        "vi": "các quy định nghiêm ngặt quản lý việc bán vũ khí"
                    },
                    {
                        "en": "To comply with government hygiene regulations, there must be a separate sink for hand washing.",
                        "vi": "Để tuân thủ các quy định về vệ sinh của chính phủ, phải có một bồn rửa tay riêng biệt để rửa tay."
                    },
                    {
                        "en": "against regulations It's against safety regulations to fix these doors open.",
                        "vi": "chống lại các quy định Việc sửa những cánh cửa này mở là vi phạm các quy định an toàn."
                    },
                    {
                        "en": "under the regulations Under the new regulations spending on office equipment will be strictly controlled.",
                        "vi": "theo quy định Theo quy định mới, chi tiêu cho thiết bị văn phòng sẽ được kiểm soát chặt chẽ."
                    }
                ]
            },
            {
                "define": {
                    "en": "controlling something by means of rules",
                    "vi": "kiểm soát một cái gì đó bằng các quy tắc"
                },
                "examples": [
                    {
                        "en": "the voluntary regulation of the press",
                        "vi": "quy chế tự nguyện của báo chí"
                    }
                ]
            }
        ]
    },
    {
        "id": "26bc6270bf054275b7a365dc9c57df90",
        "word": "valid",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈvælɪd/",
            "us": "/ˈvælɪd/"
        },
        "nearby": [
            {
                "word": "valiant",
                "pos": "adjective"
            },
            {
                "word": "valiantly",
                "pos": "adverb"
            },
            {
                "word": "valid",
                "pos": "adjective"
            },
            {
                "word": "validate",
                "pos": "verb"
            },
            {
                "word": "validation",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "that is legally or officially acceptable",
                    "vi": "điều đó được chấp nhận về mặt pháp lý hoặc chính thức"
                },
                "examples": [
                    {
                        "en": "Do you have a valid passport?",
                        "vi": "Bạn có hộ chiếu vẫn còn sử dụng được?"
                    },
                    {
                        "en": "He bought a bus pass valid for one month.",
                        "vi": "Anh ấy đã mua thẻ xe buýt có giá trị trong một tháng."
                    },
                    {
                        "en": "They have a valid claim to compensation.",
                        "vi": "Họ có yêu cầu bồi thường hợp lệ."
                    }
                ]
            },
            {
                "define": {
                    "en": "based on what is logical or true",
                    "vi": "dựa trên những gì logic hoặc đúng"
                },
                "examples": [
                    {
                        "en": "She had valid reasons for not supporting the proposals.",
                        "vi": "Cô ấy có lý do chính đáng để không ủng hộ các đề xuất."
                    },
                    {
                        "en": "The point you make is perfectly valid.",
                        "vi": "Điểm bạn đưa ra là hoàn toàn hợp lệ."
                    },
                    {
                        "en": "That argument is not strictly valid in this case.",
                        "vi": "Lập luận đó không hoàn toàn hợp lệ trong trường hợp này."
                    }
                ]
            },
            {
                "define": {
                    "en": "that is accepted by the system",
                    "vi": "được chấp nhận bởi hệ thống"
                },
                "examples": [
                    {
                        "en": "a valid password",
                        "vi": "một mật khẩu hợp lệ"
                    }
                ]
            }
        ]
    },
    {
        "id": "d77ec5c061f34d38b62c8f6869711028",
        "word": "copyright",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈkɒpiraɪt/",
            "us": "/ˈkɑːpiraɪt/"
        },
        "nearby": [
            {
                "word": "copy in",
                "pos": "phrasal verb"
            },
            {
                "word": "copyist",
                "pos": "noun"
            },
            {
                "word": "copyright",
                "pos": "noun"
            },
            {
                "word": "copyright",
                "pos": "adjective"
            },
            {
                "word": "copyright",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "if a person or an organization holds the copyright on a piece of writing, music, etc., they are the only people who have the legal right to publish, broadcast, perform it, etc., and other people must ask their permission to use it or any part of it",
                    "vi": "nếu một người hoặc một tổ chức giữ bản quyền đối với một tác phẩm viết, nhạc, v.v., họ là những người duy nhất có quyền hợp pháp để xuất bản, phát sóng, biểu diễn nó, v.v. và những người khác phải xin phép họ để sử dụng nó hoặc bất kỳ phần nào của nó"
                },
                "examples": [
                    {
                        "en": "Copyright expires seventy years after the death of the author.",
                        "vi": "Bản quyền hết hạn sau bảy mươi năm sau khi tác giả qua đời."
                    },
                    {
                        "en": "They were sued for breach/infringement of copyright.",
                        "vi": "Họ đã bị kiện vì vi phạm / vi phạm bản quyền."
                    },
                    {
                        "en": "copyright in/on something Who owns the copyright on this song?",
                        "vi": "Copyright in / on something Ai sở hữu bản quyền bài hát này?"
                    },
                    {
                        "en": "out of copyright His work is now out of copyright.",
                        "vi": "hết bản quyền Tác phẩm của anh ấy hiện đã hết bản quyền."
                    },
                    {
                        "en": "in copyright The songs remain in copyright.",
                        "vi": "trong bản quyền Các bài hát vẫn có bản quyền."
                    }
                ]
            }
        ]
    },
    {
        "id": "2bb27741cfb44beaa15e58519cc8035f",
        "word": "copyright",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈkɒpiraɪt/",
            "us": "/ˈkɑːpiraɪt/"
        },
        "nearby": [
            {
                "word": "copyist",
                "pos": "noun"
            },
            {
                "word": "copyright",
                "pos": "noun"
            },
            {
                "word": "copyright",
                "pos": "adjective"
            },
            {
                "word": "copyright",
                "pos": "verb"
            },
            {
                "word": "copyright library",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "protected by copyright; not allowed to be copied without permission",
                    "vi": "được bảo vệ bởi bản quyền; không được phép sao chép nếu không có sự cho phép"
                },
                "examples": [
                    {
                        "en": "copyright material",
                        "vi": "tài liệu bản quyền"
                    }
                ]
            }
        ]
    },
    {
        "id": "501a5a8b6e3b4ecc8ba276e16b577657",
        "word": "copyright",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈkɒpiraɪt/",
            "us": "/ˈkɑːpiraɪt/"
        },
        "nearby": [
            {
                "word": "copyright",
                "pos": "noun"
            },
            {
                "word": "copyright",
                "pos": "adjective"
            },
            {
                "word": "copyright",
                "pos": "verb"
            },
            {
                "word": "copyright library",
                "pos": "noun"
            },
            {
                "word": "copy typist",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to get the copyright for something",
                    "vi": "để có được bản quyền cho một cái gì đó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "d30ce9b2d31742f2906e4978d0a8e6ec",
        "word": "enforce",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/ɪnˈfɔːs/",
            "us": "/ɪnˈfɔːrs/"
        },
        "nearby": [
            {
                "word": "enfeebled",
                "pos": "adjective"
            },
            {
                "word": "enfold",
                "pos": "verb"
            },
            {
                "word": "enforce",
                "pos": "verb"
            },
            {
                "word": "enforceable",
                "pos": "adjective"
            },
            {
                "word": "enforced",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to make sure that people obey a particular law or rule",
                    "vi": "để đảm bảo rằng mọi người tuân theo một luật hoặc quy tắc cụ thể"
                },
                "examples": [
                    {
                        "en": "enforce something It's the job of the police to enforce the law.",
                        "vi": "thực thi một cái gì đó Công việc của cảnh sát là thực thi luật pháp."
                    },
                    {
                        "en": "The legislation will be difficult to enforce.",
                        "vi": "Luật sẽ khó thực thi."
                    },
                    {
                        "en": "United Nations troops enforced a ceasefire in the area.",
                        "vi": "Quân đội Liên Hợp Quốc thực thi lệnh ngừng bắn trong khu vực."
                    },
                    {
                        "en": "enforce something against/on somebody/something (formal or law) The creditor should be at liberty to enforce his rights against the company's property.",
                        "vi": "thực thi điều gì đó chống lại / đối với ai đó / điều gì đó (chính thức hoặc luật pháp) Chủ nợ phải có quyền tự do để thực thi các quyền của mình đối với tài sản của công ty."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make something happen or force somebody to do something",
                    "vi": "để làm điều gì đó xảy ra hoặc buộc ai đó làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "You can't enforce cooperation between the players.",
                        "vi": "Bạn không thể thực thi sự hợp tác giữa những người chơi."
                    }
                ]
            }
        ]
    },
    {
        "id": "58811735157a49c9a6855951d0dbea41",
        "word": "invalid",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ɪnˈvælɪd/",
            "us": "/ɪnˈvælɪd/"
        },
        "nearby": [
            {
                "word": "invade",
                "pos": "verb"
            },
            {
                "word": "invader",
                "pos": "noun"
            },
            {
                "word": "invalid",
                "pos": "adjective"
            },
            {
                "word": "invalid",
                "pos": "noun"
            },
            {
                "word": "invalid",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "not legally or officially acceptable",
                    "vi": "không được chấp nhận về mặt pháp lý hoặc chính thức"
                },
                "examples": [
                    {
                        "en": "The treaty was declared invalid because it had not been ratified.",
                        "vi": "Hiệp ước bị tuyên bố vô hiệu vì nó chưa được phê chuẩn."
                    },
                    {
                        "en": "People with invalid papers are deported to another country.",
                        "vi": "Những người có giấy tờ không hợp lệ bị trục xuất sang nước khác."
                    },
                    {
                        "en": "This action would render the agreement invalid.",
                        "vi": "Hành động này sẽ làm cho thỏa thuận không hợp lệ."
                    }
                ]
            },
            {
                "define": {
                    "en": "not based on all the facts, and therefore not correct",
                    "vi": "không dựa trên tất cả các sự kiện, và do đó không chính xác"
                },
                "examples": [
                    {
                        "en": "an invalid argument",
                        "vi": "một đối số không hợp lệ"
                    }
                ]
            },
            {
                "define": {
                    "en": "of a type that the computer cannot recognize",
                    "vi": "thuộc loại mà máy tính không thể nhận dạng"
                },
                "examples": [
                    {
                        "en": "An error code will be displayed if any invalid information has been entered.",
                        "vi": "Một mã lỗi sẽ được hiển thị nếu bất kỳ thông tin không hợp lệ nào đã được nhập."
                    },
                    {
                        "en": "invalid characters",
                        "vi": "ký tự không hợp lệ"
                    }
                ]
            }
        ]
    },
    {
        "id": "4fa0736c08544911839d940dad94abd4",
        "word": "legality",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/lɪˈɡæləti/",
            "us": "/lɪˈɡæləti/"
        },
        "nearby": [
            {
                "word": "legal holiday",
                "pos": "noun"
            },
            {
                "word": "legalistic",
                "pos": "adjective"
            },
            {
                "word": "legality",
                "pos": "noun"
            },
            {
                "word": "legalization",
                "pos": "noun"
            },
            {
                "word": "legalize",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the fact of being legal",
                    "vi": "thực tế là hợp pháp"
                },
                "examples": [
                    {
                        "en": "They intended to challenge the legality of his claim in the courts.",
                        "vi": "Họ có ý định thách thức tính hợp pháp của đơn kiện của ông tại tòa án."
                    },
                    {
                        "en": "The arrangement is of doubtful legality.",
                        "vi": "Sự sắp xếp có tính hợp pháp đáng ngờ."
                    },
                    {
                        "en": "The court ruling today upheld the legality of military tribunals.",
                        "vi": "Phán quyết của tòa án ngày hôm nay đã duy trì tính hợp pháp của các tòa án quân sự."
                    },
                    {
                        "en": "The government does not recognize the legality of this court.",
                        "vi": "Chính phủ không công nhận tính hợp pháp của tòa án này."
                    }
                ]
            },
            {
                "define": {
                    "en": "the legal aspect of an action or a situation",
                    "vi": "khía cạnh pháp lý của một hành động hoặc một tình huống"
                },
                "examples": [
                    {
                        "en": "You need a lawyer to explain all the legalities of the contracts.",
                        "vi": "Bạn cần một luật sư để giải thích tất cả các tính pháp lý của các hợp đồng."
                    }
                ]
            }
        ]
    },
    {
        "id": "9647322be05340a9983ffac5d7093fe5",
        "word": "legalization",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌliːɡəlaɪˈzeɪʃn/",
            "us": "/ˌliːɡələˈzeɪʃn/"
        },
        "nearby": [
            {
                "word": "legalistic",
                "pos": "adjective"
            },
            {
                "word": "legality",
                "pos": "noun"
            },
            {
                "word": "legalization",
                "pos": "noun"
            },
            {
                "word": "legalize",
                "pos": "verb"
            },
            {
                "word": "legally",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the fact of making something legal",
                    "vi": "thực tế là làm một cái gì đó hợp pháp"
                },
                "examples": [
                    {
                        "en": "They argue for the legalization of soft drugs.",
                        "vi": "Họ lập luận cho việc hợp pháp hóa các loại thuốc mềm."
                    }
                ]
            }
        ]
    },
    {
        "id": "d247ffe66dfb437dab6884ce94f5d167",
        "word": "legalize",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈliːɡəlaɪz/",
            "us": "/ˈliːɡəlaɪz/"
        },
        "nearby": [
            {
                "word": "legality",
                "pos": "noun"
            },
            {
                "word": "legalization",
                "pos": "noun"
            },
            {
                "word": "legalize",
                "pos": "verb"
            },
            {
                "word": "legally",
                "pos": "adverb"
            },
            {
                "word": "legal pad",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to make something legal",
                    "vi": "để làm cho một cái gì đó hợp pháp"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "069fe7078cf647808134bbc78d089788",
        "word": "legislate",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈledʒɪsleɪt/",
            "us": "/ˈledʒɪsleɪt/"
        },
        "nearby": [
            {
                "word": "legionnaire",
                "pos": "noun"
            },
            {
                "word": "legionnaires' disease",
                "pos": "noun"
            },
            {
                "word": "legislate",
                "pos": "verb"
            },
            {
                "word": "legislation",
                "pos": "noun"
            },
            {
                "word": "legislative",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to make a law affecting something",
                    "vi": "để đưa ra luật ảnh hưởng đến một cái gì đó"
                },
                "examples": [
                    {
                        "en": "The King restricted Parliament's power to legislate.",
                        "vi": "Nhà vua hạn chế quyền lập pháp của Nghị viện."
                    },
                    {
                        "en": "They promised to legislate to protect people's right to privacy.",
                        "vi": "Họ hứa sẽ lập pháp để bảo vệ quyền riêng tư của mọi người."
                    },
                    {
                        "en": "legislate against something The government will legislate against discrimination in the workplace.",
                        "vi": "lập pháp chống lại điều gì đó Chính phủ sẽ lập pháp chống phân biệt đối xử tại nơi làm việc."
                    },
                    {
                        "en": "(figurative) You can't legislate against bad luck!",
                        "vi": "(nghĩa bóng) Bạn không thể lập pháp chống lại vận rủi!"
                    },
                    {
                        "en": "legislate for something Parliament legislated for a higher minimum wage.",
                        "vi": "lập pháp cho một cái gì đó mà Nghị viện lập pháp để có mức lương tối thiểu cao hơn."
                    },
                    {
                        "en": "legislate on something The European Parliament will legislate on further integration.",
                        "vi": "lập pháp về điều gì đó Nghị viện Châu Âu sẽ lập pháp về việc hội nhập sâu hơn."
                    }
                ]
            }
        ]
    },
    {
        "id": "3db45efd775643d8b54dacebb937c9b5",
        "word": "legislation",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌledʒɪsˈleɪʃn/",
            "us": "/ˌledʒɪsˈleɪʃn/"
        },
        "nearby": [
            {
                "word": "legionnaires' disease",
                "pos": "noun"
            },
            {
                "word": "legislate",
                "pos": "verb"
            },
            {
                "word": "legislation",
                "pos": "noun"
            },
            {
                "word": "legislative",
                "pos": "adjective"
            },
            {
                "word": "the legislative branch",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a law or a set of laws passed by a parliament",
                    "vi": "một bộ luật hoặc một bộ luật được quốc hội thông qua"
                },
                "examples": [
                    {
                        "en": "an important piece of legislation",
                        "vi": "một phần quan trọng của pháp luật"
                    },
                    {
                        "en": "New legislation on the sale of drugs will be introduced next year.",
                        "vi": "Luật mới về việc bán thuốc sẽ được ban hành vào năm tới."
                    },
                    {
                        "en": "They are calling for tough legislation to tackle this problem.",
                        "vi": "Họ đang kêu gọi luật pháp cứng rắn để giải quyết vấn đề này."
                    }
                ]
            },
            {
                "define": {
                    "en": "the process of making and passing laws",
                    "vi": "quá trình xây dựng và thông qua luật"
                },
                "examples": [
                    {
                        "en": "Legislation will be difficult and will take time.",
                        "vi": "Việc xây dựng pháp luật sẽ khó và mất nhiều thời gian."
                    },
                    {
                        "en": "The terrorist attack prompted knee-jerk legislation.",
                        "vi": "Vụ tấn công khủng bố đã thúc đẩy luật pháp."
                    }
                ]
            }
        ]
    },
    {
        "id": "063d2908c97d41e19cfc82200826fabc",
        "word": "legislative",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈledʒɪslətɪv/",
            "us": "/ˈledʒɪsleɪtɪv/"
        },
        "nearby": [
            {
                "word": "legislate",
                "pos": "verb"
            },
            {
                "word": "legislation",
                "pos": "noun"
            },
            {
                "word": "legislative",
                "pos": "adjective"
            },
            {
                "word": "the legislative branch",
                "pos": "noun"
            },
            {
                "word": "legislator",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "connected with the act of making and passing laws",
                    "vi": "kết nối với hành động xây dựng và thông qua luật"
                },
                "examples": [
                    {
                        "en": "a legislative assembly/body/council",
                        "vi": "hội đồng / cơ quan / hội đồng lập pháp"
                    },
                    {
                        "en": "legislative powers",
                        "vi": "quyền lập pháp"
                    }
                ]
            }
        ]
    },
    {
        "id": "607933402bd4473cb6899cafde0daefd",
        "word": "legitimate",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/lɪˈdʒɪtɪmət/",
            "us": "/lɪˈdʒɪtɪmət/"
        },
        "nearby": [
            {
                "word": "legit",
                "pos": "adjective"
            },
            {
                "word": "legitimacy",
                "pos": "noun"
            },
            {
                "word": "legitimate",
                "pos": "adjective"
            },
            {
                "word": "legitimately",
                "pos": "adverb"
            },
            {
                "word": "legitimize",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "for which there is a fair and acceptable reason",
                    "vi": "mà có một lý do công bằng và có thể chấp nhận được"
                },
                "examples": [
                    {
                        "en": "a legitimate grievance",
                        "vi": "một lời than phiền chính đáng"
                    },
                    {
                        "en": "It seemed a perfectly legitimate question.",
                        "vi": "Đó dường như là một câu hỏi hoàn toàn chính đáng."
                    },
                    {
                        "en": "Politicians are legitimate targets for satire.",
                        "vi": "Các chính trị gia là mục tiêu hợp pháp để châm biếm."
                    }
                ]
            },
            {
                "define": {
                    "en": "allowed and acceptable according to the law",
                    "vi": "được phép và chấp nhận được theo luật"
                },
                "examples": [
                    {
                        "en": "the legitimate government of the country",
                        "vi": "chính phủ hợp pháp của đất nước"
                    },
                    {
                        "en": "Is his business strictly legitimate?",
                        "vi": "Công việc kinh doanh của anh ấy có hợp pháp không?"
                    },
                    {
                        "en": "The legitimate government was reinstated after the uprising.",
                        "vi": "Chính phủ hợp pháp đã được phục hồi sau cuộc nổi dậy."
                    }
                ]
            },
            {
                "define": {
                    "en": "born when its parents are legally married to each other",
                    "vi": "được sinh ra khi cha mẹ của nó kết hôn hợp pháp với nhau"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "af77f9ce4c5d405d94125e3e2f235a76",
        "word": "liable",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈlaɪəbl/",
            "us": "/ˈlaɪəbl/"
        },
        "nearby": [
            {
                "word": "l.h.",
                "pos": "abbreviation"
            },
            {
                "word": "liability",
                "pos": "noun"
            },
            {
                "word": "liable",
                "pos": "adjective"
            },
            {
                "word": "liaise",
                "pos": "verb"
            },
            {
                "word": "liaison",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "legally responsible for paying the cost of something",
                    "vi": "chịu trách nhiệm pháp lý về việc thanh toán chi phí của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "You will be liable for any damage caused.",
                        "vi": "Bạn sẽ phải chịu trách nhiệm cho bất kỳ thiệt hại nào gây ra."
                    },
                    {
                        "en": "The court ruled he could not be held personally liable for his wife's debts.",
                        "vi": "Tòa án phán quyết rằng anh ta không thể chịu trách nhiệm cá nhân về các khoản nợ của vợ mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "likely to do something",
                    "vi": "có khả năng làm một cái gì đó"
                },
                "examples": [
                    {
                        "en": "We're all liable to make mistakes when we're tired.",
                        "vi": "Tất cả chúng ta đều có trách nhiệm mắc sai lầm khi chúng ta mệt mỏi."
                    },
                    {
                        "en": "The bridge is liable to collapse at any moment.",
                        "vi": "Cây cầu có thể sập bất cứ lúc nào."
                    }
                ]
            },
            {
                "define": {
                    "en": "likely to be affected by something",
                    "vi": "có khả năng bị ảnh hưởng bởi một cái gì đó"
                },
                "examples": [
                    {
                        "en": "You are more liable to injury if you exercise infrequently.",
                        "vi": "Bạn dễ bị chấn thương hơn nếu bạn tập thể dục không thường xuyên."
                    }
                ]
            },
            {
                "define": {
                    "en": "likely to be punished by law for something",
                    "vi": "có khả năng bị pháp luật trừng phạt vì điều gì đó"
                },
                "examples": [
                    {
                        "en": "Offenders are liable to fines of up to $500.",
                        "vi": "Người vi phạm có thể bị phạt tiền lên đến $ 500."
                    },
                    {
                        "en": "Advertisers pretending to be private individuals will be liable to prosecution.",
                        "vi": "Các nhà quảng cáo giả danh tư nhân sẽ phải chịu trách nhiệm truy tố."
                    }
                ]
            },
            {
                "define": {
                    "en": "having to do something by law",
                    "vi": "phải làm điều gì đó theo luật"
                },
                "examples": [
                    {
                        "en": "People who earn under a certain amount are not liable to pay tax.",
                        "vi": "Những người có thu nhập dưới một mức nhất định không phải nộp thuế."
                    },
                    {
                        "en": "At 60, he was no longer liable for conscription.",
                        "vi": "Ở tuổi 60, ông không còn phải chịu trách nhiệm về nghĩa vụ quân sự nữa."
                    }
                ]
            }
        ]
    },
    {
        "id": "57897eeca12240a5bbf02aee98661dbc",
        "word": "outlaw",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈaʊtlɔː/",
            "us": "/ˈaʊtlɔː/"
        },
        "nearby": [
            {
                "word": "outlandishly",
                "pos": "adverb"
            },
            {
                "word": "outlast",
                "pos": "verb"
            },
            {
                "word": "outlaw",
                "pos": "verb"
            },
            {
                "word": "outlaw",
                "pos": "noun"
            },
            {
                "word": "outlay",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to make something illegal",
                    "vi": "làm một cái gì đó bất hợp pháp"
                },
                "examples": [
                    {
                        "en": "plans to outlaw the carrying of knives",
                        "vi": "có kế hoạch cấm mang dao"
                    },
                    {
                        "en": "the outlawed nationalist party",
                        "vi": "đảng dân tộc chủ nghĩa ngoài vòng pháp luật"
                    }
                ]
            },
            {
                "define": {
                    "en": "(in the past) to make somebody an outlaw",
                    "vi": "(trong quá khứ) để biến ai đó thành kẻ ngoài vòng pháp luật"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "0dbd271b53b34d93bba5d8fa28ad8ed8",
        "word": "overturn",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌəʊvəˈtɜːn/",
            "us": "/ˌəʊvərˈtɜːrn/"
        },
        "nearby": [
            {
                "word": "overtrain",
                "pos": "verb"
            },
            {
                "word": "overture",
                "pos": "noun"
            },
            {
                "word": "overturn",
                "pos": "verb"
            },
            {
                "word": "overuse",
                "pos": "noun"
            },
            {
                "word": "overuse",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "if something overturns, or if somebody overturns it, it turns into a position in which the top of it is where the bottom of it normally is or on its side",
                    "vi": "nếu một cái gì đó bị lật, hoặc nếu ai đó lật ngược nó, nó sẽ biến thành một vị trí mà ở đó đỉnh của nó là nơi mà đáy của nó bình thường hoặc ở phía bên của nó"
                },
                "examples": [
                    {
                        "en": "The car skidded and overturned.",
                        "vi": "Chiếc xe bị trượt bánh và lật nhào."
                    },
                    {
                        "en": "overturn something He stood up quickly, overturning his chair.",
                        "vi": "lật ngược cái gì đó Anh ta đứng dậy nhanh chóng, lật ngược cái ghế của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to officially decide that a legal decision, etc. is not correct, and to make it no longer legally recognized",
                    "vi": "chính thức quyết định rằng một quyết định pháp lý, v.v. là không đúng và khiến nó không còn được công nhận về mặt pháp lý"
                },
                "examples": [
                    {
                        "en": "to overturn a decision/conviction/verdict",
                        "vi": "lật ngược quyết định / kết án / phán quyết"
                    },
                    {
                        "en": "His sentence was overturned by the appeal court.",
                        "vi": "Bản án của anh ta đã bị hủy bỏ bởi tòa phúc thẩm."
                    },
                    {
                        "en": "He hopes that councillors will overturn the decision.",
                        "vi": "Ông hy vọng rằng các ủy viên hội đồng sẽ lật ngược quyết định."
                    }
                ]
            },
            {
                "define": {
                    "en": "to show that a belief or an idea is not correct",
                    "vi": "để cho thấy rằng một niềm tin hoặc một ý tưởng là không đúng"
                },
                "examples": [
                    {
                        "en": "She completely overturned my preconceptions about film stars.",
                        "vi": "Cô ấy đã hoàn toàn lật ngược định kiến của tôi về các ngôi sao điện ảnh."
                    },
                    {
                        "en": "This argument seems convincing, but is easily overturned.",
                        "vi": "Lập luận này có vẻ thuyết phục, nhưng dễ bị lật tẩy."
                    }
                ]
            }
        ]
    },
    {
        "id": "3bd60714e02d42a980c0a584edd2cd0b",
        "word": "validity",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/vəˈlɪdəti/",
            "us": "/vəˈlɪdəti/"
        },
        "nearby": [
            {
                "word": "validate",
                "pos": "verb"
            },
            {
                "word": "validation",
                "pos": "noun"
            },
            {
                "word": "validity",
                "pos": "noun"
            },
            {
                "word": "validly",
                "pos": "adverb"
            },
            {
                "word": "valise",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the state of being legally or officially acceptable",
                    "vi": "trạng thái được chấp nhận về mặt pháp lý hoặc chính thức"
                },
                "examples": [
                    {
                        "en": "The period of validity of the agreement has expired.",
                        "vi": "Thời hạn hiệu lực của thỏa thuận đã hết."
                    }
                ]
            },
            {
                "define": {
                    "en": "the state of being logical and true",
                    "vi": "trạng thái hợp lý và đúng"
                },
                "examples": [
                    {
                        "en": "We had doubts about the validity of their argument.",
                        "vi": "Chúng tôi đã nghi ngờ về tính hợp lệ của lập luận của họ."
                    }
                ]
            }
        ]
    },
    {
        "id": "26b7fbd7b88341aba24be09a5c11744c",
        "word": "violate",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈvaɪəleɪt/",
            "us": "/ˈvaɪəleɪt/"
        },
        "nearby": [
            {
                "word": "viol",
                "pos": "noun"
            },
            {
                "word": "viola",
                "pos": "noun"
            },
            {
                "word": "violate",
                "pos": "verb"
            },
            {
                "word": "violation",
                "pos": "noun"
            },
            {
                "word": "violator",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to go against or refuse to obey a law, an agreement, etc.",
                    "vi": "đi ngược lại hoặc từ chối tuân theo luật, thỏa thuận, v.v."
                },
                "examples": [
                    {
                        "en": "to violate international law",
                        "vi": "vi phạm luật pháp quốc tế"
                    }
                ]
            },
            {
                "define": {
                    "en": "to upset or not respect somebody’s peace, privacy, etc.",
                    "vi": "làm khó chịu hoặc không tôn trọng hòa bình, quyền riêng tư của ai đó, v.v."
                },
                "examples": [
                    {
                        "en": "She accused the press photographers of violating her privacy.",
                        "vi": "Cô cáo buộc các nhiếp ảnh gia báo chí đã xâm phạm quyền riêng tư của cô."
                    }
                ]
            },
            {
                "define": {
                    "en": "to damage or destroy a holy or special place",
                    "vi": "làm hỏng hoặc phá hủy một thánh địa hoặc một địa điểm đặc biệt"
                },
                "examples": [
                    {
                        "en": "to violate a grave",
                        "vi": "xâm phạm một ngôi mộ"
                    }
                ]
            },
            {
                "define": {
                    "en": "to force somebody to have sex",
                    "vi": "ép ai đó quan hệ tình dục"
                },
                "examples": [
                    {
                        "en": "He had drugged her and then violated her.",
                        "vi": "Anh ta đã đánh thuốc mê cô và sau đó xâm phạm cô."
                    }
                ]
            }
        ]
    },
    {
        "id": "2da1533adbeb450a8271d323c7cbcf1e",
        "word": "abide by",
        "pos": "phrasal verb",
        "level": "c2",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "abhorrent",
                "pos": "adjective"
            },
            {
                "word": "abide",
                "pos": "verb"
            },
            {
                "word": "abide by",
                "pos": "phrasal verb"
            },
            {
                "word": "Abide With Me",
                "pos": ""
            },
            {
                "word": "abiding",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to accept and act according to a law, an agreement, etc.",
                    "vi": "chấp nhận và hành động theo luật, thỏa thuận, v.v."
                },
                "examples": [
                    {
                        "en": "You'll have to abide by the rules of the club.",
                        "vi": "Bạn sẽ phải tuân thủ các quy tắc của câu lạc bộ."
                    },
                    {
                        "en": "We will abide by their decision.",
                        "vi": "Chúng tôi sẽ tuân theo quyết định của họ."
                    }
                ]
            }
        ]
    },
    {
        "id": "a3ed0f38e13249ee8cdc88e6756849ed",
        "word": "age of consent",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌeɪdʒ əv kənˈsent/",
            "us": "/ˌeɪdʒ əv kənˈsent/"
        },
        "nearby": [
            {
                "word": "Agent Orange",
                "pos": "noun"
            },
            {
                "word": "agent provocateur",
                "pos": "noun"
            },
            {
                "word": "age of consent",
                "pos": "noun"
            },
            {
                "word": "the Age of Enlightenment",
                "pos": ""
            },
            {
                "word": "the age of steam",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the age at which somebody is legally old enough to agree to have a sexual relationship",
                    "vi": "độ tuổi mà ai đó đủ tuổi hợp pháp để đồng ý quan hệ tình dục"
                },
                "examples": [
                    {
                        "en": "The girl was under the age of consent.",
                        "vi": "Cô gái chưa đủ tuổi thành niên."
                    }
                ]
            }
        ]
    },
    {
        "id": "f40380db035549ff831570080379803c",
        "word": "binding",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbaɪndɪŋ/",
            "us": "/ˈbaɪndɪŋ/"
        },
        "nearby": [
            {
                "word": "binder",
                "pos": "noun"
            },
            {
                "word": "bindi",
                "pos": "noun"
            },
            {
                "word": "binding",
                "pos": "adjective"
            },
            {
                "word": "binding",
                "pos": "noun"
            },
            {
                "word": "binding theory",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "that must be obeyed because it is accepted in law",
                    "vi": "điều đó phải được tuân theo vì nó được chấp nhận trong luật"
                },
                "examples": [
                    {
                        "en": "a binding promise/agreement/contract",
                        "vi": "một lời hứa / thỏa thuận / hợp đồng ràng buộc"
                    },
                    {
                        "en": "The decision is binding on both parties.",
                        "vi": "Quyết định có giá trị ràng buộc đối với cả hai bên."
                    },
                    {
                        "en": "The judge said the document was not legally binding.",
                        "vi": "Thẩm phán cho rằng tài liệu này không có giá trị pháp lý ràng buộc."
                    }
                ]
            }
        ]
    },
    {
        "id": "9dc9faeb0242414cad0c52b0da1f7f3f",
        "word": "case law",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkeɪs lɔː/",
            "us": "/ˈkeɪs lɔː/"
        },
        "nearby": [
            {
                "word": "cased",
                "pos": "adjective"
            },
            {
                "word": "case history",
                "pos": "noun"
            },
            {
                "word": "case law",
                "pos": "noun"
            },
            {
                "word": "caseload",
                "pos": "noun"
            },
            {
                "word": "casement",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "law based on decisions made by judges in earlier cases",
                    "vi": "luật dựa trên các quyết định của thẩm phán trong các trường hợp trước đó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "204d6b0af54b4c6ca7ec0d575020892c",
        "word": "circuit breaker",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsɜːkɪt breɪkə(r)/",
            "us": "/ˈsɜːrkɪt breɪkər/"
        },
        "nearby": [
            {
                "word": "circuit",
                "pos": "noun"
            },
            {
                "word": "circuit board",
                "pos": "noun"
            },
            {
                "word": "circuit breaker",
                "pos": "noun"
            },
            {
                "word": "circuit court",
                "pos": "noun"
            },
            {
                "word": "circuitous",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a device that will stop an electric current if it becomes dangerous",
                    "vi": "một thiết bị sẽ ngăn dòng điện nếu nó trở nên nguy hiểm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a short period during which laws are in place to limit people's movements, especially to require most people to stay at home in order to stop the spread of disease",
                    "vi": "trong thời gian ngắn có luật để hạn chế việc di chuyển của mọi người, đặc biệt là yêu cầu hầu hết mọi người phải ở nhà để ngăn chặn sự lây lan của dịch bệnh"
                },
                "examples": [
                    {
                        "en": "The four-week circuit breaker will come into force tomorrow with the closure of pubs, bars, restaurants and non-essential shops.",
                        "vi": "Việc cắt mạch điện kéo dài 4 tuần sẽ có hiệu lực vào ngày mai với việc đóng cửa các quán rượu, quán bar, nhà hàng và các cửa hàng không thiết yếu."
                    }
                ]
            }
        ]
    },
    {
        "id": "41ea71154f68437ca6fb304fc3c581a9",
        "word": "common law",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌkɒmən ˈlɔː/",
            "us": "/ˌkɑːmən ˈlɔː/"
        },
        "nearby": [
            {
                "word": "commonhold",
                "pos": "noun"
            },
            {
                "word": "common land",
                "pos": "noun"
            },
            {
                "word": "common law",
                "pos": "noun"
            },
            {
                "word": "common-law husband",
                "pos": "noun"
            },
            {
                "word": "common-law wife",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "(in some countries) the part of the law that has been developed from customs and from decisions made by judges, not created by Parliament",
                    "vi": "(ở một số quốc gia) phần luật được phát triển từ tập quán và từ các quyết định của thẩm phán, không phải do Nghị viện tạo ra"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "2f8d25f823364c339124bb365aa375ad",
        "word": "due diligence",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌdjuː ˈdɪlɪdʒəns/",
            "us": "/ˌduː ˈdɪlɪdʒəns/"
        },
        "nearby": [
            {
                "word": "due",
                "pos": "adverb"
            },
            {
                "word": "due date",
                "pos": "noun"
            },
            {
                "word": "due diligence",
                "pos": "noun"
            },
            {
                "word": "duel",
                "pos": "noun"
            },
            {
                "word": "duel",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "reasonable steps taken by a person or an organization to avoid committing a tort or an offence",
                    "vi": "các bước hợp lý được thực hiện bởi một người hoặc một tổ chức để tránh vi phạm hoặc hành vi phạm tội"
                },
                "examples": [
                    {
                        "en": "The company had taken all reasonable precautions and exercised due diligence to avoid the offence.",
                        "vi": "Công ty đã thực hiện tất cả các biện pháp phòng ngừa hợp lý và thực hiện trách nhiệm giải trình để tránh vi phạm."
                    }
                ]
            },
            {
                "define": {
                    "en": "a careful investigation of the state of a business by a person or organization that is thinking of buying it or investing in it",
                    "vi": "một cuộc điều tra cẩn thận về tình trạng của một doanh nghiệp bởi một người hoặc tổ chức đang nghĩ đến việc mua nó hoặc đầu tư vào nó"
                },
                "examples": [
                    {
                        "en": "Investors are encouraged to perform their own due diligence on a company prior to investment.",
                        "vi": "Các nhà đầu tư được khuyến khích thực hiện thẩm định của riêng họ đối với một công ty trước khi đầu tư."
                    }
                ]
            }
        ]
    },
    {
        "id": "9d500e499fcd4d00accefa2a3956caf5",
        "word": "duty of care",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌdjuːti əv ˈkeə(r)/",
            "us": "/ˌduːti əv ˈker/"
        },
        "nearby": [
            {
                "word": "duty-free",
                "pos": "adverb"
            },
            {
                "word": "duty-free shop",
                "pos": "noun"
            },
            {
                "word": "duty of care",
                "pos": "noun"
            },
            {
                "word": "duty officer",
                "pos": "noun"
            },
            {
                "word": "duvet",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a moral or legal obligation to ensure that other people are safe from physical or mental harm",
                    "vi": "nghĩa vụ đạo đức hoặc pháp lý để đảm bảo rằng người khác được an toàn khỏi bị tổn hại về thể chất hoặc tinh thần"
                },
                "examples": [
                    {
                        "en": "Employers have a duty of care to their employees.",
                        "vi": "Người sử dụng lao động có nghĩa vụ quan tâm đến nhân viên của họ."
                    },
                    {
                        "en": "to owe somebody a duty of care",
                        "vi": "nợ ai đó một nghĩa vụ chăm sóc"
                    },
                    {
                        "en": "The police have failed yet again in their duty of care to people at celebrations or sport events.",
                        "vi": "Cảnh sát đã thất bại một lần nữa trong nhiệm vụ chăm sóc mọi người tại các lễ kỷ niệm hoặc các sự kiện thể thao."
                    }
                ]
            }
        ]
    },
    {
        "id": "985950d978d742dead974b53dd6638b2",
        "word": "fair dealing",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌfeə ˈdiːlɪŋ/",
            "us": "/ˌfer ˈdiːlɪŋ/"
        },
        "nearby": [
            {
                "word": "fair copy",
                "pos": "noun"
            },
            {
                "word": "the Fair Deal",
                "pos": ""
            },
            {
                "word": "fair dealing",
                "pos": "noun"
            },
            {
                "word": "fair dinkum",
                "pos": "adjective, adverb"
            },
            {
                "word": "the fairer sex",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "good and honest behaviour, especially in business",
                    "vi": "hành vi tốt và trung thực, đặc biệt là trong kinh doanh"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a statement of legal policy that allows people to use short pieces of copyright material without permission for news reporting, teaching, research, etc.",
                    "vi": "tuyên bố về chính sách pháp lý cho phép mọi người sử dụng các đoạn ngắn của tài liệu có bản quyền mà không được phép để đưa tin, giảng dạy, nghiên cứu, v.v."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "9ffd19c900294d8caf44b38757e1c894",
        "word": "fair use",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌfeə ˈjuːs/",
            "us": "/ˌfer ˈjuːs/"
        },
        "nearby": [
            {
                "word": "fair trade",
                "pos": "noun"
            },
            {
                "word": "fair-trade",
                "pos": "adjective"
            },
            {
                "word": "fair use",
                "pos": "noun"
            },
            {
                "word": "fairway",
                "pos": "noun"
            },
            {
                "word": "fair-weather",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a statement of legal policy that allows people to use short pieces of copyright material without permission for news reporting, teaching, research, etc.",
                    "vi": "tuyên bố về chính sách pháp lý cho phép mọi người sử dụng các đoạn ngắn của tài liệu có bản quyền mà không được phép để đưa tin, giảng dạy, nghiên cứu, v.v."
                },
                "examples": [
                    {
                        "en": "His use of the lyrics constitutes fair use under copyright law.",
                        "vi": "Việc anh ấy sử dụng lời bài hát được coi là sử dụng hợp pháp theo luật bản quyền."
                    }
                ]
            }
        ]
    },
    {
        "id": "e8ffa152719b4ebbbf28870ba0c78f35",
        "word": "infringe",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ɪnˈfrɪndʒ/",
            "us": "/ɪnˈfrɪndʒ/"
        },
        "nearby": [
            {
                "word": "infrequent",
                "pos": "adjective"
            },
            {
                "word": "infrequently",
                "pos": "adverb"
            },
            {
                "word": "infringe",
                "pos": "verb"
            },
            {
                "word": "infringement",
                "pos": "noun"
            },
            {
                "word": "the INF Treaty",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to break a law or rule",
                    "vi": "phá vỡ luật hoặc quy tắc"
                },
                "examples": [
                    {
                        "en": "The material can be copied without infringing copyright.",
                        "vi": "Tài liệu có thể được sao chép mà không vi phạm bản quyền."
                    },
                    {
                        "en": "Two of the projects are deemed to infringe EU legislation.",
                        "vi": "Hai trong số các dự án bị coi là vi phạm luật của EU."
                    }
                ]
            },
            {
                "define": {
                    "en": "to limit somebody’s legal rights",
                    "vi": "để hạn chế quyền hợp pháp của ai đó"
                },
                "examples": [
                    {
                        "en": "infringe something They said that compulsory identity cards would infringe civil liberties.",
                        "vi": "vi phạm điều gì đó Họ nói rằng chứng minh thư bắt buộc sẽ vi phạm quyền tự do dân sự."
                    },
                    {
                        "en": "infringe on/upon something She refused to answer questions that infringed on her private affairs.",
                        "vi": "xâm phạm điều gì đó Cô ấy từ chối trả lời những câu hỏi xâm phạm đến công việc riêng tư của cô ấy."
                    }
                ]
            }
        ]
    },
    {
        "id": "31ad7cc2002f4d818b7d8814d8e1a9ea",
        "word": "invalidate",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ɪnˈvælɪdeɪt/",
            "us": "/ɪnˈvælɪdeɪt/"
        },
        "nearby": [
            {
                "word": "invalid",
                "pos": "noun"
            },
            {
                "word": "invalid",
                "pos": "verb"
            },
            {
                "word": "invalidate",
                "pos": "verb"
            },
            {
                "word": "invalidation",
                "pos": "noun"
            },
            {
                "word": "invalidity",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to prove that an idea, a story, an argument, etc. is wrong",
                    "vi": "để chứng minh rằng một ý tưởng, một câu chuyện, một lập luận, v.v. là sai"
                },
                "examples": [
                    {
                        "en": "This new piece of evidence invalidates his version of events.",
                        "vi": "Phần bằng chứng mới này làm mất hiệu lực của phiên bản các sự kiện của anh ta."
                    },
                    {
                        "en": "Flawed research methods may invalidate the study’s conclusions.",
                        "vi": "Các phương pháp nghiên cứu sai lầm có thể làm mất hiệu lực của các kết luận của nghiên cứu."
                    }
                ]
            },
            {
                "define": {
                    "en": "if you invalidate a document, a contract, an election, etc., you make it no longer legally or officially acceptable",
                    "vi": "nếu bạn làm mất hiệu lực một tài liệu, một hợp đồng, một cuộc bầu cử, v.v., bạn khiến nó không còn được chấp nhận về mặt pháp lý hoặc chính thức"
                },
                "examples": [
                    {
                        "en": "Misuse of the mattress will invalidate the guarantee",
                        "vi": "Việc lạm dụng nệm sẽ làm mất hiệu lực bảo hành"
                    }
                ]
            }
        ]
    },
    {
        "id": "72b3eb847c5b442882b8bc3d144d50e1",
        "word": "invalidation",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ɪnˌvælɪˈdeɪʃn/",
            "us": "/ɪnˌvælɪˈdeɪʃn/"
        },
        "nearby": [
            {
                "word": "invalid",
                "pos": "verb"
            },
            {
                "word": "invalidate",
                "pos": "verb"
            },
            {
                "word": "invalidation",
                "pos": "noun"
            },
            {
                "word": "invalidity",
                "pos": "noun"
            },
            {
                "word": "invaluable",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act of saying that a document, contract, election, etc. is no longer legally or officially acceptable",
                    "vi": "hành động nói rằng một tài liệu, hợp đồng, cuộc bầu cử, v.v. không còn được chấp nhận về mặt pháp lý hoặc chính thức"
                },
                "examples": [
                    {
                        "en": "the invalidation of the regulation by the High Court",
                        "vi": "Tòa án cấp cao hủy bỏ quy định"
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of proving that an idea, a story, an argument, etc. is wrong",
                    "vi": "hành động chứng minh rằng một ý tưởng, một câu chuyện, một lập luận, v.v. là sai"
                },
                "examples": [
                    {
                        "en": "the invalidation of the theory",
                        "vi": "sự vô hiệu của lý thuyết"
                    }
                ]
            }
        ]
    },
    {
        "id": "87323a74e7d246be995d12c3fe9ad08c",
        "word": "invalidity",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌɪnvəˈlɪdəti/",
            "us": "/ˌɪnvəˈlɪdəti/"
        },
        "nearby": [
            {
                "word": "invalidate",
                "pos": "verb"
            },
            {
                "word": "invalidation",
                "pos": "noun"
            },
            {
                "word": "invalidity",
                "pos": "noun"
            },
            {
                "word": "invaluable",
                "pos": "adjective"
            },
            {
                "word": "invariable",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the state of being unable to take care of yourself because of illness or injury",
                    "vi": "tình trạng không thể tự chăm sóc bản thân vì bệnh tật hoặc chấn thương"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the state of not being legally or officially acceptable",
                    "vi": "tình trạng không được chấp nhận về mặt pháp lý hoặc chính thức"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "38882d7abd244611b1e37d7e35f6b9b8",
        "word": "lawful",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈlɔːfl/",
            "us": "/ˈlɔːfl/"
        },
        "nearby": [
            {
                "word": "law court",
                "pos": "noun"
            },
            {
                "word": "the Law Courts",
                "pos": ""
            },
            {
                "word": "lawful",
                "pos": "adjective"
            },
            {
                "word": "lawfully",
                "pos": "adverb"
            },
            {
                "word": "lawfulness",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "allowed or recognized by law; legal",
                    "vi": "được pháp luật cho phép hoặc thừa nhận; hợp pháp"
                },
                "examples": [
                    {
                        "en": "his lawful heir",
                        "vi": "người thừa kế hợp pháp của anh ấy"
                    },
                    {
                        "en": "Can an act that causes death ever be lawful?",
                        "vi": "Một hành vi gây ra cái chết có bao giờ là hợp pháp không?"
                    },
                    {
                        "en": "She is his lawful wife, and so is entitled to inherit the money.",
                        "vi": "Cô ấy là vợ hợp pháp của anh ấy, và do đó, được quyền thừa kế số tiền."
                    }
                ]
            }
        ]
    },
    {
        "id": "172adf0b81184bf4965aa8de72a80921",
        "word": "lawfully",
        "pos": "adverb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈlɔːfəli/",
            "us": "/ˈlɔːfəli/"
        },
        "nearby": [
            {
                "word": "the Law Courts",
                "pos": ""
            },
            {
                "word": "lawful",
                "pos": "adjective"
            },
            {
                "word": "lawfully",
                "pos": "adverb"
            },
            {
                "word": "lawfulness",
                "pos": "noun"
            },
            {
                "word": "lawks",
                "pos": "exclamation"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "in a way that is allowed or recognized by law; legally",
                    "vi": "theo cách được pháp luật cho phép hoặc thừa nhận; hợp pháp"
                },
                "examples": [
                    {
                        "en": "a lawfully elected government",
                        "vi": "một chính phủ được bầu cử hợp pháp"
                    },
                    {
                        "en": "The jury agreed that the doctor had acted lawfully.",
                        "vi": "Bồi thẩm đoàn đồng ý rằng bác sĩ đã hành động đúng pháp luật."
                    }
                ]
            }
        ]
    },
    {
        "id": "8a2d1e4b4e0e4bcb98e348f46ba348e8",
        "word": "legitimize",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/lɪˈdʒɪtəmaɪz/",
            "us": "/lɪˈdʒɪtəmaɪz/"
        },
        "nearby": [
            {
                "word": "legitimate",
                "pos": "adjective"
            },
            {
                "word": "legitimately",
                "pos": "adverb"
            },
            {
                "word": "legitimize",
                "pos": "verb"
            },
            {
                "word": "legless",
                "pos": "adjective"
            },
            {
                "word": "Lego",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to make something that is wrong or unfair seem acceptable",
                    "vi": "để làm cho một cái gì đó sai hoặc không công bằng có vẻ có thể chấp nhận được"
                },
                "examples": [
                    {
                        "en": "The movie has been criticized for apparently legitimizing violence.",
                        "vi": "Bộ phim đã bị chỉ trích vì dường như hợp pháp hóa bạo lực."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make something legal",
                    "vi": "để làm cho một cái gì đó hợp pháp"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to give a child whose parents are not married to each other the same rights as those whose parents are",
                    "vi": "trao cho một đứa trẻ mà cha mẹ không kết hôn với nhau các quyền như những đứa trẻ có cha mẹ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "2d4bbc7d067a47a7b65312fbce9c8c40",
        "word": "lock down",
        "pos": "phrasal verb",
        "level": "c2",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "lock away",
                "pos": "phrasal verb"
            },
            {
                "word": "lockbox",
                "pos": "noun"
            },
            {
                "word": "lock down",
                "pos": "phrasal verb"
            },
            {
                "word": "lockdown",
                "pos": "noun"
            },
            {
                "word": "John Locke",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to control people's movements within an area because of a dangerous situation, especially in order to prevent the spread of disease",
                    "vi": "để kiểm soát việc di chuyển của người dân trong khu vực vì tình huống nguy hiểm, đặc biệt là để ngăn chặn dịch bệnh lây lan"
                },
                "examples": [
                    {
                        "en": "Those states which locked down most effectively and almost eliminated the virus have done best economically.",
                        "vi": "Những trạng thái khóa hiệu quả nhất và gần như loại bỏ vi rút đã hoạt động tốt nhất về mặt kinh tế."
                    },
                    {
                        "en": "England is being locked down for a third time.",
                        "vi": "Nước Anh đang bị khóa chặt lần thứ ba."
                    }
                ]
            }
        ]
    },
    {
        "id": "6bc33f5a78534cefa4e353f3b7668e1f",
        "word": "probable cause",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌprɒbəbl ˈkɔːz/",
            "us": "/ˌprɑːbəbl ˈkɔːz/"
        },
        "nearby": [
            {
                "word": "probable",
                "pos": "adjective"
            },
            {
                "word": "probable",
                "pos": "noun"
            },
            {
                "word": "probable cause",
                "pos": "noun"
            },
            {
                "word": "probably",
                "pos": "adverb"
            },
            {
                "word": "probate",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "good reason to think that a crime has been committed",
                    "vi": "lý do chính đáng để nghĩ rằng một tội ác đã được thực hiện"
                },
                "examples": [
                    {
                        "en": "If there is probable cause, a judge can rule to give a search warrant.",
                        "vi": "Nếu có nguyên nhân có thể xảy ra, thẩm phán có thể ra phán quyết để đưa ra lệnh khám xét."
                    }
                ]
            }
        ]
    },
    {
        "id": "b64ed73063a64fc99d3b2e555c02a82b",
        "word": "severable",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsevərəbl/",
            "us": "/ˈsevərəbl/"
        },
        "nearby": [
            {
                "word": "the Seven Years War",
                "pos": ""
            },
            {
                "word": "sever",
                "pos": "verb"
            },
            {
                "word": "severable",
                "pos": "adjective"
            },
            {
                "word": "several",
                "pos": "determiner, pronoun"
            },
            {
                "word": "several",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "that can be treated separately from something else",
                    "vi": "cái đó có thể được xử lý riêng biệt với một cái gì đó khác"
                },
                "examples": [
                    {
                        "en": "This provision is not severable from the rest of the law.",
                        "vi": "Quy định này không bị tách rời khỏi phần còn lại của luật."
                    }
                ]
            }
        ]
    },
    {
        "id": "c9ad963550a942c4bbdeaf8d6e768f52",
        "word": "statute",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈstætʃuːt/",
            "us": "/ˈstætʃuːt/"
        },
        "nearby": [
            {
                "word": "status quo",
                "pos": "noun"
            },
            {
                "word": "status symbol",
                "pos": "noun"
            },
            {
                "word": "statute",
                "pos": "noun"
            },
            {
                "word": "statute book",
                "pos": "noun"
            },
            {
                "word": "statute law",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a law that is passed by a parliament, council, etc. and formally written down",
                    "vi": "một luật được quốc hội, hội đồng, v.v. thông qua và chính thức được viết ra"
                },
                "examples": [
                    {
                        "en": "in a statute Penalties are laid down in the statute.",
                        "vi": "trong một quy chế Các hình phạt được quy định trong quy chế."
                    },
                    {
                        "en": "by statute Corporal punishment was banned by statute in 1987.",
                        "vi": "theo luật Việc trừng phạt thân thể đã bị cấm theo luật vào năm 1987."
                    },
                    {
                        "en": "under statute These rights existed at common law, rather than under statute.",
                        "vi": "theo luật Những quyền này tồn tại theo luật thông thường, chứ không phải theo luật."
                    },
                    {
                        "en": "The wording of the statute is ambiguous.",
                        "vi": "Từ ngữ của quy chế là không rõ ràng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a formal rule of an organization or institution",
                    "vi": "một quy tắc chính thức của một tổ chức hoặc thể chế"
                },
                "examples": [
                    {
                        "en": "under a statute Under the statutes of the university they had no power to dismiss him.",
                        "vi": "theo quy chế Theo quy chế của trường đại học, họ không có quyền sa thải anh ta."
                    }
                ]
            }
        ]
    },
    {
        "id": "76decf4b90374f61aa1e7acdc36c3ef3",
        "word": "statute book",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈstætʃuːt bʊk/",
            "us": "/ˈstætʃuːt bʊk/"
        },
        "nearby": [
            {
                "word": "status symbol",
                "pos": "noun"
            },
            {
                "word": "statute",
                "pos": "noun"
            },
            {
                "word": "statute book",
                "pos": "noun"
            },
            {
                "word": "statute law",
                "pos": "noun"
            },
            {
                "word": "statute of limitations",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a collection of all the laws made by a government",
                    "vi": "một bộ sưu tập tất cả các luật do chính phủ đưa ra"
                },
                "examples": [
                    {
                        "en": "on the statute book It's not yet on the statute book (= it has not yet become law).",
                        "vi": "on the statute book Nó vẫn chưa có trong cuốn sách quy chế (= nó vẫn chưa trở thành luật)."
                    },
                    {
                        "en": "This archaic law remained on the statute books until last year.",
                        "vi": "Luật cổ xưa này vẫn còn trên sách quy chế cho đến năm ngoái."
                    }
                ]
            }
        ]
    },
    {
        "id": "2bc9fef4ac3c477bb900b01cfca127d6",
        "word": "statute law",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈstætʃuːt lɔː/",
            "us": "/ˈstætʃuːt lɔː/"
        },
        "nearby": [
            {
                "word": "statute",
                "pos": "noun"
            },
            {
                "word": "statute book",
                "pos": "noun"
            },
            {
                "word": "statute law",
                "pos": "noun"
            },
            {
                "word": "statute of limitations",
                "pos": "noun"
            },
            {
                "word": "statutorily",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "all the written laws of a parliament, etc. as a group",
                    "vi": "tất cả các luật thành văn của quốc hội, v.v. với tư cách là một nhóm"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "ee712c0f1829458f820d0dcd8f962cfb",
        "word": "statutory",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈstætʃətri/",
            "us": "/ˈstætʃətɔːri/"
        },
        "nearby": [
            {
                "word": "statute of limitations",
                "pos": "noun"
            },
            {
                "word": "statutorily",
                "pos": "adverb"
            },
            {
                "word": "statutory",
                "pos": "adjective"
            },
            {
                "word": "statutory holiday",
                "pos": "noun"
            },
            {
                "word": "statutory instrument",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "fixed by law; that must be done by law",
                    "vi": "được ấn định bởi luật pháp; điều đó phải được thực hiện theo luật"
                },
                "examples": [
                    {
                        "en": "The authority failed to carry out its statutory duties.",
                        "vi": "Cơ quan có thẩm quyền không thực hiện được các nhiệm vụ theo luật định của mình."
                    },
                    {
                        "en": "When you buy foods you have certain statutory rights.",
                        "vi": "Khi bạn mua thực phẩm, bạn có một số quyền theo luật định."
                    }
                ]
            }
        ]
    },
    {
        "id": "76f3a764290f449988c86db60deb0ee9",
        "word": "validate",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈvælɪdeɪt/",
            "us": "/ˈvælɪdeɪt/"
        },
        "nearby": [
            {
                "word": "valiantly",
                "pos": "adverb"
            },
            {
                "word": "valid",
                "pos": "adjective"
            },
            {
                "word": "validate",
                "pos": "verb"
            },
            {
                "word": "validation",
                "pos": "noun"
            },
            {
                "word": "validity",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to prove that something is true",
                    "vi": "để chứng minh rằng một cái gì đó là sự thật"
                },
                "examples": [
                    {
                        "en": "to validate a theory",
                        "vi": "để xác thực một lý thuyết"
                    },
                    {
                        "en": "The research findings do not validate the claims made by the manufacturer.",
                        "vi": "Các kết quả nghiên cứu không xác thực các tuyên bố của nhà sản xuất."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make something legally recognized",
                    "vi": "để làm cho một cái gì đó được công nhận hợp pháp"
                },
                "examples": [
                    {
                        "en": "to validate a contract",
                        "vi": "để xác thực hợp đồng"
                    }
                ]
            },
            {
                "define": {
                    "en": "to state officially that something is useful and of an acceptable standard",
                    "vi": "tuyên bố chính thức rằng một cái gì đó hữu ích và đạt tiêu chuẩn có thể chấp nhận được"
                },
                "examples": [
                    {
                        "en": "Check that their courses have been validated by a reputable organization.",
                        "vi": "Kiểm tra xem các khóa học của họ đã được xác nhận bởi một tổ chức có uy tín hay chưa."
                    }
                ]
            },
            {
                "define": {
                    "en": "to recognize the value of a person or their feelings or opinions; to make somebody feel valued",
                    "vi": "để nhận ra giá trị của một người hoặc cảm xúc hoặc ý kiến của họ; để làm cho ai đó cảm thấy có giá trị"
                },
                "examples": [
                    {
                        "en": "validate somebody/something Be sure to validate your child's feelings—don't minimize them.",
                        "vi": "xác thực ai đó / điều gì đó Hãy chắc chắn xác thực cảm xúc của con bạn — đừng giảm thiểu chúng."
                    },
                    {
                        "en": "validate somebody/something as something She seemed to need his admiration to validate her as a person.",
                        "vi": "xác nhận ai đó / cái gì đó như một cái gì đó Cô ấy dường như cần sự ngưỡng mộ của anh ấy để chứng thực cô ấy là một con người."
                    }
                ]
            }
        ]
    },
    {
        "id": "e7b940b174244966ab16316e2c2a6229",
        "word": "validation",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌvælɪˈdeɪʃn/",
            "us": "/ˌvælɪˈdeɪʃn/"
        },
        "nearby": [
            {
                "word": "valid",
                "pos": "adjective"
            },
            {
                "word": "validate",
                "pos": "verb"
            },
            {
                "word": "validation",
                "pos": "noun"
            },
            {
                "word": "validity",
                "pos": "noun"
            },
            {
                "word": "validly",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act of proving that something is true or correct",
                    "vi": "hành động chứng minh điều gì đó là đúng hoặc đúng"
                },
                "examples": [
                    {
                        "en": "There must be some form of external validation of the data.",
                        "vi": "Phải có một số hình thức xác nhận bên ngoài dữ liệu."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of making something legally recognized",
                    "vi": "hành động làm ra thứ gì đó được pháp luật công nhận"
                },
                "examples": [
                    {
                        "en": "validation of web service contracts",
                        "vi": "xác nhận hợp đồng dịch vụ web"
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of stating officially that something is useful and of an acceptable standard",
                    "vi": "hành động tuyên bố chính thức rằng một cái gì đó hữu ích và đạt tiêu chuẩn có thể chấp nhận được"
                },
                "examples": [
                    {
                        "en": "an agreement on the validation of the institution's degree courses",
                        "vi": "một thỏa thuận về việc xác nhận các khóa học cấp bằng của tổ chức"
                    }
                ]
            },
            {
                "define": {
                    "en": "the feeling that others recognize that you are right or good enough",
                    "vi": "cảm giác mà người khác công nhận rằng bạn đúng hoặc đủ tốt"
                },
                "examples": [
                    {
                        "en": "We seek validation from our peers.",
                        "vi": "Chúng tôi tìm kiếm sự xác nhận từ các đồng nghiệp của chúng tôi."
                    }
                ]
            }
        ]
    },
    {
        "id": "5381868ba4554b638ea5875552afba4c",
        "word": "void",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/vɔɪd/",
            "us": "/vɔɪd/"
        },
        "nearby": [
            {
                "word": "voice recognition",
                "pos": "noun"
            },
            {
                "word": "void",
                "pos": "noun"
            },
            {
                "word": "void",
                "pos": "adjective"
            },
            {
                "word": "void",
                "pos": "verb"
            },
            {
                "word": "void deck",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "completely without something",
                    "vi": "hoàn toàn không có thứ gì đó"
                },
                "examples": [
                    {
                        "en": "The sky was void of stars.",
                        "vi": "Bầu trời không có các vì sao."
                    }
                ]
            },
            {
                "define": {
                    "en": "not correct or legally valid",
                    "vi": "không đúng hoặc không có giá trị pháp lý"
                },
                "examples": [
                    {
                        "en": "The agreement was declared void.",
                        "vi": "Thỏa thuận đã bị tuyên bố vô hiệu."
                    },
                    {
                        "en": "an impediment which rendered the marriage void",
                        "vi": "một trở ngại khiến hôn nhân vô hiệu"
                    }
                ]
            },
            {
                "define": {
                    "en": "empty",
                    "vi": "trống rỗng"
                },
                "examples": [
                    {
                        "en": "void spaces",
                        "vi": "không gian trống"
                    }
                ]
            },
            {
                "define": {
                    "en": "having no legal force; not valid",
                    "vi": "không có lực lượng pháp lý; không hợp lệ"
                },
                "examples": [
                    {
                        "en": "The contract was declared null and void.",
                        "vi": "Hợp đồng đã được tuyên bố là vô hiệu."
                    },
                    {
                        "en": "They declared the agreement null and void.",
                        "vi": "Họ tuyên bố thỏa thuận vô hiệu."
                    }
                ]
            }
        ]
    },
    {
        "id": "52d36306cd084d24bba43f03afd13ca2",
        "word": "waive",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/weɪv/",
            "us": "/weɪv/"
        },
        "nearby": [
            {
                "word": "waitstaff",
                "pos": "noun"
            },
            {
                "word": "wait up",
                "pos": "phrasal verb"
            },
            {
                "word": "waive",
                "pos": "verb"
            },
            {
                "word": "waiver",
                "pos": "noun"
            },
            {
                "word": "wake",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to choose not to demand something in a particular case, even though you have a legal or official right to do so",
                    "vi": "chọn không yêu cầu điều gì đó trong một trường hợp cụ thể, mặc dù bạn có quyền hợp pháp hoặc chính thức để làm như vậy"
                },
                "examples": [
                    {
                        "en": "He waived his right to appeal against the verdict.",
                        "vi": "Anh từ bỏ quyền kháng cáo bản án."
                    },
                    {
                        "en": "We have decided to waive the tuition fees in your case.",
                        "vi": "Chúng tôi đã quyết định miễn học phí trong trường hợp của bạn."
                    },
                    {
                        "en": "He has agreed to waive his rights to the money.",
                        "vi": "Anh ta đã đồng ý từ bỏ quyền của mình đối với số tiền này."
                    }
                ]
            }
        ]
    }
]