[
    {
        "id": "316de5bdb90449e68461416f969e8cbc",
        "word": "match",
        "pos": "verb",
        "level": "a2",
        "phonetic": {
            "uk": "/mætʃ/",
            "us": "/mætʃ/"
        },
        "nearby": [
            {
                "word": "matatu",
                "pos": "noun"
            },
            {
                "word": "match",
                "pos": "noun"
            },
            {
                "word": "match",
                "pos": "verb"
            },
            {
                "word": "matcha",
                "pos": "noun"
            },
            {
                "word": "match against",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to find somebody/something that goes together with or is connected with another person or thing",
                    "vi": "để tìm ai đó / điều gì đó đi cùng với hoặc được kết nối với người hoặc vật khác"
                },
                "examples": [
                    {
                        "en": "match A and B Match the words and pictures.",
                        "vi": "nối A và B Nối các từ và hình ảnh."
                    },
                    {
                        "en": "match A to/with B The aim of the competition is to match the quote to the person who said it.",
                        "vi": "match A to / with B Mục đích của cuộc thi là nối câu trích dẫn với người đã nói."
                    },
                    {
                        "en": "The agency tries to match single people with suitable partners.",
                        "vi": "Cơ quan cố gắng kết hợp những người độc thân với những người bạn đời phù hợp."
                    },
                    {
                        "en": "match somebody/something for something The control group in the experiment was matched for age and sex.",
                        "vi": "khớp ai đó / cái gì đó cho cái gì Nhóm đối chứng trong thử nghiệm được khớp về độ tuổi và giới tính."
                    }
                ]
            },
            {
                "define": {
                    "en": "if two things match or if one thing matches another, they are the same or very similar",
                    "vi": "nếu hai thứ trùng khớp hoặc nếu một thứ trùng khớp với một thứ khác, chúng giống nhau hoặc rất giống nhau"
                },
                "examples": [
                    {
                        "en": "Her fingerprints match those found at the scene of the crime.",
                        "vi": "Dấu vân tay của cô ấy khớp với dấu vân tay được tìm thấy tại hiện trường vụ án."
                    },
                    {
                        "en": "A man matching his description was seen running from a car.",
                        "vi": "Một người đàn ông phù hợp với mô tả của anh ta đã được nhìn thấy đang chạy từ một chiếc xe hơi."
                    },
                    {
                        "en": "As a couple they are not very well matched (= they are not very suitable for each other).",
                        "vi": "Là một cặp, họ không hợp nhau lắm (= họ không hợp với nhau lắm)."
                    },
                    {
                        "en": "The two sets of figures don't match.",
                        "vi": "Hai bộ số liệu không khớp nhau."
                    }
                ]
            },
            {
                "define": {
                    "en": "if two things match, or if one thing matches another, they have the same colour, pattern, or style and therefore look attractive together",
                    "vi": "nếu hai thứ trùng khớp hoặc nếu một thứ trùng khớp với một thứ khác, chúng có cùng màu sắc, họa tiết hoặc kiểu dáng và do đó trông hấp dẫn với nhau"
                },
                "examples": [
                    {
                        "en": "match (something) Her dark hair matched the colour of her eyes.",
                        "vi": "phù hợp (cái gì đó) Mái tóc sẫm màu của cô ấy phù hợp với màu mắt của cô ấy."
                    },
                    {
                        "en": "None of these glasses match (= they are all different).",
                        "vi": "Không có kính nào trong số này phù hợp (= chúng đều khác nhau)."
                    },
                    {
                        "en": "to match (something) The doors were painted blue to match the walls.",
                        "vi": "để phù hợp với (một cái gì đó) Các cánh cửa được sơn màu xanh lam để phù hợp với các bức tường."
                    },
                    {
                        "en": "I've got her a scarf with gloves to match.",
                        "vi": "Tôi có cho cô ấy một chiếc khăn quàng cổ với găng tay để phù hợp."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be as good, interesting, successful, etc. as somebody/something else",
                    "vi": "trở nên tốt, thú vị, thành công, v.v. như ai đó / điều gì đó khác"
                },
                "examples": [
                    {
                        "en": "The profits made in the first year have never been matched.",
                        "vi": "Lợi nhuận thu được trong năm đầu tiên chưa từng có."
                    },
                    {
                        "en": "Job opportunities in the industry do not match the level of interest.",
                        "vi": "Cơ hội việc làm trong ngành không tương xứng với mức độ yêu thích."
                    },
                    {
                        "en": "The teams were evenly matched.",
                        "vi": "Các đội đã đồng đều nhau."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make something the same as or better than something else",
                    "vi": "để làm cho một cái gì đó giống hoặc tốt hơn một cái gì đó khác"
                },
                "examples": [
                    {
                        "en": "The company was unable to match his current salary.",
                        "vi": "Công ty không thể phù hợp với mức lương hiện tại của anh ấy."
                    },
                    {
                        "en": "They have reduced all their stock by 10% to match competitors’ prices.",
                        "vi": "Họ đã giảm 10% hàng tồn kho để phù hợp với giá của các đối thủ cạnh tranh."
                    }
                ]
            },
            {
                "define": {
                    "en": "to provide something that is suitable for or enough for a particular situation",
                    "vi": "để cung cấp một cái gì đó phù hợp hoặc đủ cho một tình huống cụ thể"
                },
                "examples": [
                    {
                        "en": "Investment in hospitals is needed now to match the future needs of the country.",
                        "vi": "Đầu tư cho bệnh viện là cần thiết ngay bây giờ để phù hợp với nhu cầu tương lai của đất nước."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be like a particular person or thing",
                    "vi": "giống một người hoặc một vật cụ thể"
                },
                "examples": [
                    {
                        "en": "Police have arrested two men matching the descriptions of the robbers.",
                        "vi": "Cảnh sát đã bắt giữ hai người đàn ông phù hợp với mô tả của những tên cướp."
                    }
                ]
            },
            {
                "define": {
                    "en": "to combine things in different ways for different purposes",
                    "vi": "để kết hợp mọi thứ theo nhiều cách khác nhau cho các mục đích khác nhau"
                },
                "examples": [
                    {
                        "en": "You can mix and match courses to suit your requirements.",
                        "vi": "Bạn có thể kết hợp và kết hợp các khóa học để phù hợp với yêu cầu của bạn."
                    }
                ]
            }
        ]
    },
    {
        "id": "548e2a70b8fb4611871ecd53490bd4e8",
        "word": "fit",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/fɪt/",
            "us": "/fɪt/"
        },
        "nearby": [
            {
                "word": "fist-pumping",
                "pos": "noun"
            },
            {
                "word": "fistula",
                "pos": "noun"
            },
            {
                "word": "fit",
                "pos": "verb"
            },
            {
                "word": "fit",
                "pos": "adjective"
            },
            {
                "word": "fit",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to be the right shape and size for somebody/something",
                    "vi": "có hình dạng và kích thước phù hợp với ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "I tried the dress on but it didn't fit.",
                        "vi": "Tôi đã thử chiếc váy nhưng nó không vừa."
                    },
                    {
                        "en": "That jacket fits well.",
                        "vi": "Chiếc áo khoác đó vừa vặn."
                    },
                    {
                        "en": "My shoes fit perfectly.",
                        "vi": "Đôi giày của tôi vừa vặn hoàn hảo."
                    },
                    {
                        "en": "a close-fitting dress",
                        "vi": "váy liền thân"
                    },
                    {
                        "en": "fit somebody/something I can't find clothes to fit me.",
                        "vi": "vừa với ai đó / cái gì đó mà tôi không thể tìm thấy quần áo để vừa với mình."
                    },
                    {
                        "en": "The key doesn't fit the lock.",
                        "vi": "Chìa khóa không vừa với ổ khóa."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be of the right size, type or number to go somewhere",
                    "vi": "có kích thước, loại hoặc số phù hợp để đi đâu đó"
                },
                "examples": [
                    {
                        "en": "I'd like to have a desk in the room but it won't fit.",
                        "vi": "Tôi muốn có một cái bàn trong phòng nhưng nó không vừa."
                    },
                    {
                        "en": "+ adv./prep. All the kids will fit in the back of the car.",
                        "vi": "Err:509"
                    },
                    {
                        "en": "This device is small enough to fit in a pocket.",
                        "vi": "Thiết bị này đủ nhỏ để vừa trong túi."
                    },
                    {
                        "en": "His arms fitted snugly around me.",
                        "vi": "Vòng tay của anh ấy vừa khít ôm lấy tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to put clothes on somebody and make them the right size and shape",
                    "vi": "để mặc quần áo cho ai đó và làm cho họ có kích thước và hình dạng phù hợp"
                },
                "examples": [
                    {
                        "en": "be fitted for something I'm going to be fitted for my wedding dress today.",
                        "vi": "được trang bị cho một cái gì đó tôi sẽ được trang bị cho chiếc váy cưới của tôi ngày hôm nay."
                    }
                ]
            },
            {
                "define": {
                    "en": "to put or fix something somewhere",
                    "vi": "để đặt hoặc sửa chữa một cái gì đó ở đâu đó"
                },
                "examples": [
                    {
                        "en": "fit something + adv./prep. They fitted a smoke alarm to the ceiling.",
                        "vi": "phù hợp với cái gì đó + adv./prep. Họ lắp một thiết bị báo động khói lên trần nhà."
                    },
                    {
                        "en": "uPVC windows have been fitted throughout the house.",
                        "vi": "Cửa sổ uPVC đã được lắp trong toàn bộ ngôi nhà."
                    },
                    {
                        "en": "fit something with something The rooms were all fitted with smoke alarms.",
                        "vi": "phù hợp với thứ gì đó Các phòng đều được trang bị hệ thống báo động khói."
                    }
                ]
            },
            {
                "define": {
                    "en": "to put or join something in the right place",
                    "vi": "để đặt hoặc tham gia một cái gì đó vào đúng vị trí"
                },
                "examples": [
                    {
                        "en": "fit + adv./prep. The glass fits on top of the jug to form a lid.",
                        "vi": "phù hợp + adv./prep. Thủy tinh nằm gọn trên miệng bình để tạo thành nắp."
                    },
                    {
                        "en": "How do these two parts fit together?",
                        "vi": "Làm thế nào để hai bộ phận này ăn khớp với nhau?"
                    },
                    {
                        "en": "fit something + adv./prep. We fitted together the pieces of the puzzle.",
                        "vi": "phù hợp với cái gì đó + adv./prep. Chúng tôi đã lắp các mảnh ghép lại với nhau."
                    },
                    {
                        "en": "If the top of the box fits badly, the contents will spill out.",
                        "vi": "Nếu nắp hộp vừa vặn không tốt, đồ bên trong sẽ tràn ra ngoài."
                    }
                ]
            },
            {
                "define": {
                    "en": "to agree with, match or be suitable for something; to make something do this",
                    "vi": "đồng ý với, phù hợp hoặc phù hợp với một cái gì đó; để làm một cái gì đó làm điều này"
                },
                "examples": [
                    {
                        "en": "Something doesn't quite fit here.",
                        "vi": "Có gì đó không hoàn toàn phù hợp ở đây."
                    },
                    {
                        "en": "fit into something His pictures don't fit into any category.",
                        "vi": "phù hợp với một cái gì đó Hình ảnh của anh ấy không phù hợp với bất kỳ thể loại nào."
                    },
                    {
                        "en": "fit with something The words fit perfectly with the music.",
                        "vi": "phù hợp với một cái gì đó Lời nói hoàn toàn phù hợp với âm nhạc."
                    },
                    {
                        "en": "fit something The facts certainly fit your theory.",
                        "vi": "phù hợp với một cái gì đó Các sự kiện chắc chắn phù hợp với lý thuyết của bạn."
                    },
                    {
                        "en": "to fit a description/profile",
                        "vi": "để phù hợp với một mô tả / hồ sơ"
                    },
                    {
                        "en": "The punishment ought to fit the crime.",
                        "vi": "Hình phạt phải phù hợp với tội ác."
                    },
                    {
                        "en": "We tailor our programs to fit their needs.",
                        "vi": "Chúng tôi điều chỉnh các chương trình của mình để phù hợp với nhu cầu của họ."
                    },
                    {
                        "en": "Most organizations do not fit this model.",
                        "vi": "Hầu hết các tổ chức không phù hợp với mô hình này."
                    },
                    {
                        "en": "fit something to something We should fit the punishment to the crime.",
                        "vi": "phù hợp với điều gì đó Chúng ta nên phù hợp với hình phạt cho tội phạm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody/something suitable for a particular job or situation",
                    "vi": "để làm cho ai đó / cái gì đó phù hợp với một công việc hoặc tình huống cụ thể"
                },
                "examples": [
                    {
                        "en": "fit somebody/something for something His experience fitted him perfectly for the job.",
                        "vi": "phù hợp với ai đó / cái gì đó cho một cái gì đó Kinh nghiệm của anh ấy phù hợp với anh ấy một cách hoàn hảo cho công việc."
                    },
                    {
                        "en": "fit somebody/something to something She was well fitted to the role of tragic heroine.",
                        "vi": "phù hợp với ai đó / cái gì đó với cái gì Cô ấy rất phù hợp với vai nữ anh hùng bi kịch."
                    },
                    {
                        "en": "fit somebody/something to do something His experience fitted him to do the job.",
                        "vi": "phù hợp với ai đó / điều gì đó để làm điều gì đó Kinh nghiệm của anh ấy đã trang bị anh ấy để làm công việc."
                    },
                    {
                        "en": "Natural selection will see to it that animals are well fitted to survive in their environment.",
                        "vi": "Chọn lọc tự nhiên sẽ thấy rằng động vật được trang bị tốt để tồn tại trong môi trường của chúng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be like a particular person or thing",
                    "vi": "giống một người hoặc một vật cụ thể"
                },
                "examples": [
                    {
                        "en": "A child answering the description of the missing boy was found safe and well in London yesterday.",
                        "vi": "Một đứa trẻ trả lời mô tả về cậu bé mất tích đã được tìm thấy an toàn và khỏe mạnh ở London ngày hôm qua."
                    },
                    {
                        "en": "We're all looking for quick, healthy meals, and pasta fits this description.",
                        "vi": "Tất cả chúng ta đều đang tìm kiếm những bữa ăn nhanh chóng, lành mạnh và mì ống phù hợp với mô tả này."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that somebody will/will not get a particular job or position because they have/do not have the appearance, personality, etc. that the employer wants, even when this should not be important",
                    "vi": "được sử dụng để nói rằng ai đó sẽ / sẽ không nhận được một công việc hoặc vị trí cụ thể bởi vì họ có / không có ngoại hình, tính cách, v.v. mà nhà tuyển dụng mong muốn, ngay cả khi điều này không quan trọng"
                },
                "examples": [
                    {
                        "en": "If your face fits, you'll get the job.",
                        "vi": "Nếu khuôn mặt của bạn phù hợp, bạn sẽ nhận được công việc."
                    },
                    {
                        "en": "It doesn't matter how well qualified you are; if your face doesn't fit, you don't stand a chance.",
                        "vi": "Không quan trọng là bạn có đủ điều kiện như thế nào; nếu khuôn mặt của bạn không phù hợp, bạn không có cơ hội."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be what is needed in a particular situation or for a particular purpose",
                    "vi": "là những gì cần thiết trong một tình huống cụ thể hoặc cho một mục đích cụ thể"
                },
                "examples": [
                    {
                        "en": "On paper, several of the applicants fit the bill.",
                        "vi": "Trên giấy tờ, một số người nộp đơn phù hợp với hóa đơn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be the perfect size or shape for somebody",
                    "vi": "trở thành kích thước hoặc hình dạng hoàn hảo cho ai đó"
                },
                "examples": [
                    {
                        "en": "The dress fits me like a glove.",
                        "vi": "Chiếc váy vừa vặn với tôi như một chiếc găng tay."
                    }
                ]
            },
            {
                "define": {
                    "en": "if you feel that a remark applies to you, you should accept it and take it as a warning or criticism",
                    "vi": "nếu bạn cảm thấy rằng một nhận xét áp dụng cho bạn, bạn nên chấp nhận nó và coi nó như một lời cảnh báo hoặc chỉ trích"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "9d39f7f4099c43fe91ae2889509743e2",
        "word": "conform",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/kənˈfɔːm/",
            "us": "/kənˈfɔːrm/"
        },
        "nearby": [
            {
                "word": "conflicting",
                "pos": "adjective"
            },
            {
                "word": "confluence",
                "pos": "noun"
            },
            {
                "word": "conform",
                "pos": "verb"
            },
            {
                "word": "conformability",
                "pos": "noun"
            },
            {
                "word": "conformable",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to behave and think in the same way as most other people in a group or society",
                    "vi": "cư xử và suy nghĩ theo cách giống như hầu hết những người khác trong một nhóm hoặc xã hội"
                },
                "examples": [
                    {
                        "en": "There is considerable pressure on teenagers to conform.",
                        "vi": "Có một áp lực đáng kể đối với thanh thiếu niên phải tuân theo."
                    },
                    {
                        "en": "conform to something He refused to conform to the local customs.",
                        "vi": "phù hợp với một cái gì đó Ông từ chối để phù hợp với phong tục địa phương."
                    }
                ]
            },
            {
                "define": {
                    "en": "to obey a rule, law, etc.",
                    "vi": "tuân theo quy tắc, luật pháp, v.v."
                },
                "examples": [
                    {
                        "en": "The building does not conform with safety regulations.",
                        "vi": "Tòa nhà không tuân thủ các quy định về an toàn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to agree with or match something",
                    "vi": "đồng ý với hoặc phù hợp với một cái gì đó"
                },
                "examples": [
                    {
                        "en": "conform to something It did not conform to the usual stereotype of an industrial city.",
                        "vi": "phù hợp với một cái gì đó Nó không phù hợp với khuôn mẫu thông thường của một thành phố công nghiệp."
                    },
                    {
                        "en": "conform with something Wordsworth changed the ideas of his poem to conform with his later religious and political opinions.",
                        "vi": "phù hợp với điều gì đó Wordsworth đã thay đổi các ý tưởng trong bài thơ của mình để phù hợp với các quan điểm tôn giáo và chính trị sau này của ông."
                    },
                    {
                        "en": "the attempt to force science to conform with a political or social ideology",
                        "vi": "nỗ lực buộc khoa học phải phù hợp với một hệ tư tưởng chính trị hoặc xã hội"
                    }
                ]
            }
        ]
    },
    {
        "id": "261afcc5d3a743b6986a43eb04da8d18",
        "word": "conformity",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/kənˈfɔːməti/",
            "us": "/kənˈfɔːrməti/"
        },
        "nearby": [
            {
                "word": "conformist",
                "pos": "noun"
            },
            {
                "word": "conformist",
                "pos": "adjective"
            },
            {
                "word": "conformity",
                "pos": "noun"
            },
            {
                "word": "confound",
                "pos": "verb"
            },
            {
                "word": "confounded",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "behaviour or actions that follow the accepted rules of society",
                    "vi": "hành vi hoặc các hành động tuân theo các quy tắc được chấp nhận của xã hội"
                },
                "examples": [
                    {
                        "en": "a society of outward religious conformity",
                        "vi": "một xã hội hướng ngoại tuân thủ tôn giáo"
                    },
                    {
                        "en": "(in) conformity to/with something They act in unthinking conformity to customs.",
                        "vi": "(trong) sự phù hợp với / với một cái gì đó Họ hành động thiếu suy nghĩ về sự phù hợp với phong tục."
                    }
                ]
            },
            {
                "define": {
                    "en": "following the rules of something; conforming to something",
                    "vi": "tuân theo các quy tắc của một cái gì đó; phù hợp với một cái gì đó"
                },
                "examples": [
                    {
                        "en": "regulations that are in conformity with European law",
                        "vi": "các quy định phù hợp với luật pháp Châu Âu"
                    }
                ]
            }
        ]
    },
    {
        "id": "426787adf0c149b58794a86fa64846ba",
        "word": "in accordance with something",
        "pos": "idiom",
        "level": "c1",
        "phonetic": {
            "uk": "/əˈkɔːdns/",
            "us": "/əˈkɔːrdns/"
        },
        "nearby": [
            {
                "word": "accord",
                "pos": "noun"
            },
            {
                "word": "accord",
                "pos": "verb"
            },
            {
                "word": "accordance",
                "pos": "noun"
            },
            {
                "word": "accordingly",
                "pos": "adverb"
            },
            {
                "word": "according to",
                "pos": "preposition"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "according to a rule or the way that somebody says that something should be done",
                    "vi": "theo một quy tắc hoặc theo cách mà ai đó nói rằng điều gì đó nên được thực hiện"
                },
                "examples": [
                    {
                        "en": "in accordance with legal requirements",
                        "vi": "phù hợp với các yêu cầu pháp lý"
                    },
                    {
                        "en": "We acted in accordance with my parents’ wishes.",
                        "vi": "Chúng tôi đã hành động phù hợp với mong muốn của bố mẹ tôi."
                    }
                ]
            }
        ]
    },
    {
        "id": "e32a2ccb2b52465486f397959f7344d6",
        "word": "match",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/mætʃ/",
            "us": "/mætʃ/"
        },
        "nearby": [
            {
                "word": "Mata Hari",
                "pos": "noun"
            },
            {
                "word": "matatu",
                "pos": "noun"
            },
            {
                "word": "match",
                "pos": "noun"
            },
            {
                "word": "match",
                "pos": "verb"
            },
            {
                "word": "matcha",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a sports event where people or teams compete against each other",
                    "vi": "một sự kiện thể thao nơi mọi người hoặc các đội thi đấu với nhau"
                },
                "examples": [
                    {
                        "en": "(British English) a football match",
                        "vi": "(Anh Anh) một trận đấu bóng đá"
                    },
                    {
                        "en": "(North American English, British English) a tennis match",
                        "vi": "(Tiếng Anh Bắc Mỹ, tiếng Anh Anh) một trận đấu quần vợt"
                    },
                    {
                        "en": "a league match",
                        "vi": "một trận đấu giải đấu"
                    },
                    {
                        "en": "They are playing an important match against Liverpool on Saturday.",
                        "vi": "Họ sẽ chơi một trận đấu quan trọng với Liverpool vào thứ Bảy."
                    },
                    {
                        "en": "to win/lose a match",
                        "vi": "thắng / thua một trận đấu"
                    },
                    {
                        "en": "I'll probably watch the match on TV.",
                        "vi": "Tôi có thể sẽ xem trận đấu trên TV."
                    },
                    {
                        "en": "Dublin took on Toulouse in their opening match of the European Cup.",
                        "vi": "Dublin tiếp Toulouse trong trận mở màn Cúp C1 châu Âu."
                    },
                    {
                        "en": "Ireland took the match (= won) 2–1 .",
                        "vi": "Ireland bắt trận (= thắng) 2–1."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who is equal to somebody else in strength, skill, intelligence, etc.",
                    "vi": "một người ngang bằng với người khác về sức mạnh, kỹ năng, trí thông minh, v.v."
                },
                "examples": [
                    {
                        "en": "a/no match for somebody (at something) I was no match for him at tennis.",
                        "vi": "/ no match for somebody (at something) Tôi không phù hợp với anh ta ở môn quần vợt."
                    },
                    {
                        "en": "We should be a match for most teams.",
                        "vi": "Chúng tôi sẽ là một đối thủ của hầu hết các đội."
                    },
                    {
                        "en": "somebody’s match (at something) I was his match at tennis.",
                        "vi": "trận đấu của ai đó (ở cái gì đó) Tôi là trận đấu của anh ấy ở môn quần vợt."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person or thing that combines well with somebody/something else",
                    "vi": "một người hoặc sự vật kết hợp tốt với ai đó / thứ gì đó khác"
                },
                "examples": [
                    {
                        "en": "The curtains and carpet are a good match.",
                        "vi": "Rèm cửa và thảm rất phù hợp."
                    },
                    {
                        "en": "a… match for somebody Jo and Ian are a perfect match for each other.",
                        "vi": "một… trận đấu cho ai đó Jo và Ian là một kết hợp hoàn hảo cho nhau."
                    },
                    {
                        "en": "a… match between A and B an excellent match between our goals and what your company offers",
                        "vi": "một… trận đấu giữa A và B một trận đấu xuất sắc giữa mục tiêu của chúng tôi và những gì công ty của bạn cung cấp"
                    }
                ]
            },
            {
                "define": {
                    "en": "a thing that is or looks exactly the same as or very similar to something else",
                    "vi": "một thứ giống hoặc giống hệt hoặc rất giống với một thứ khác"
                },
                "examples": [
                    {
                        "en": "I've found a vase that is an exact match of the one I broke.",
                        "vi": "Tôi đã tìm thấy một cái bình trùng khớp chính xác với cái tôi đã làm vỡ."
                    },
                    {
                        "en": "This paint is a close enough colour match to the original.",
                        "vi": "Màu sơn này gần giống với màu gốc."
                    }
                ]
            },
            {
                "define": {
                    "en": "a small stick made of wood or cardboard that is used for lighting a fire, cigarette, etc.",
                    "vi": "một thanh nhỏ làm bằng gỗ hoặc bìa cứng dùng để đốt lửa, hút thuốc lá, v.v."
                },
                "examples": [
                    {
                        "en": "a box of matches",
                        "vi": "một hộp diêm"
                    },
                    {
                        "en": "to strike a match (= to make it burn)",
                        "vi": "để đánh một que diêm (= làm cho nó cháy)"
                    },
                    {
                        "en": "to put a match to something (= set fire to something)",
                        "vi": "to put a match to something (= đốt cháy cái gì đó)"
                    },
                    {
                        "en": "If you suspect a gas leak do not strike a match or use electricity.",
                        "vi": "Nếu bạn nghi ngờ có rò rỉ khí gas, đừng đánh diêm hoặc sử dụng điện."
                    },
                    {
                        "en": "He took all her letters into the yard and put a match to them.",
                        "vi": "Anh ta mang tất cả các bức thư của cô ấy vào sân và đặt một que diêm cho chúng."
                    },
                    {
                        "en": "He lit a match so they could see in the cave.",
                        "vi": "Anh ta châm một que diêm để họ có thể nhìn thấy trong hang."
                    }
                ]
            },
            {
                "define": {
                    "en": "a marriage or a marriage partner",
                    "vi": "một cuộc hôn nhân hoặc một đối tác hôn nhân"
                },
                "examples": [
                    {
                        "en": "He was determined that his daughter should make a good match (= find a suitable husband).",
                        "vi": "Ông đã quyết tâm rằng con gái mình nên làm cho xứng đôi (= tìm một người chồng phù hợp)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to meet somebody who is equal to or even better than you in strength, skill or intelligence",
                    "vi": "để gặp ai đó bằng hoặc thậm chí tốt hơn bạn về sức mạnh, kỹ năng hoặc trí thông minh"
                },
                "examples": [
                    {
                        "en": "He thought he could beat anyone at chess but he’s met his match in Peter.",
                        "vi": "Anh ấy nghĩ rằng anh ấy có thể đánh bại bất kỳ ai ở cờ vua nhưng anh ấy đã gặp trận đấu của mình ở Peter."
                    }
                ]
            },
            {
                "define": {
                    "en": "a man who is chosen as having given the best performance in a game of football (soccer), cricket, etc.",
                    "vi": "một người đàn ông được chọn là người có màn trình diễn tốt nhất trong một trò chơi bóng đá (bóng đá), cricket, v.v."
                },
                "examples": [
                    {
                        "en": "Pogba was named man of the match.",
                        "vi": "Pogba được mệnh danh là người đàn ông của trận đấu."
                    }
                ]
            }
        ]
    },
    {
        "id": "473bd1f552554b1184922811edeedf3d",
        "word": "accord with",
        "pos": "phrasal verb",
        "level": "c2",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "according to",
                "pos": "preposition"
            },
            {
                "word": "accordion",
                "pos": "noun"
            },
            {
                "word": "accord with",
                "pos": "phrasal verb"
            },
            {
                "word": "accost",
                "pos": "verb"
            },
            {
                "word": "account",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to agree with or match something",
                    "vi": "đồng ý với hoặc phù hợp với một cái gì đó"
                },
                "examples": [
                    {
                        "en": "These results accord closely with our predictions.",
                        "vi": "Những kết quả này phù hợp chặt chẽ với dự đoán của chúng tôi."
                    },
                    {
                        "en": "His views accord with public opinion.",
                        "vi": "Quan điểm của anh ấy phù hợp với dư luận."
                    },
                    {
                        "en": "We ensure that our goods accord with modern standards.",
                        "vi": "Chúng tôi đảm bảo rằng hàng hóa của chúng tôi phù hợp với các tiêu chuẩn hiện đại."
                    },
                    {
                        "en": "His version of events does not accord fully with the facts.",
                        "vi": "Phiên bản của các sự kiện của ông không hoàn toàn phù hợp với các sự kiện."
                    }
                ]
            }
        ]
    },
    {
        "id": "5c3c6b4bc13b46ec9db846763ab89cb7",
        "word": "chime with",
        "pos": "phrasal verb",
        "level": "c2",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "chimenea",
                "pos": "noun"
            },
            {
                "word": "chimera",
                "pos": "noun"
            },
            {
                "word": "chime with",
                "pos": "phrasal verb"
            },
            {
                "word": "chimney",
                "pos": "noun"
            },
            {
                "word": "chimney breast",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to agree with something; to be similar to something",
                    "vi": "để đồng ý với một cái gì đó; tương tự như một cái gì đó"
                },
                "examples": [
                    {
                        "en": "His opinions chimed in with the mood of the nation.",
                        "vi": "Ý kiến của ông hòa hợp với tâm trạng của cả nước."
                    }
                ]
            }
        ]
    },
    {
        "id": "ab79de847076494393df3a48e26bcd90",
        "word": "compliant",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/kəmˈplaɪənt/",
            "us": "/kəmˈplaɪənt/"
        },
        "nearby": [
            {
                "word": "complex number",
                "pos": "noun"
            },
            {
                "word": "compliance",
                "pos": "noun"
            },
            {
                "word": "compliant",
                "pos": "adjective"
            },
            {
                "word": "complicate",
                "pos": "verb"
            },
            {
                "word": "complicated",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "too willing to agree with other people or to obey rules",
                    "vi": "quá sẵn sàng đồng ý với người khác hoặc tuân theo các quy tắc"
                },
                "examples": [
                    {
                        "en": "By then, Henry seemed less compliant with his wife's wishes than he had six months before.",
                        "vi": "Lúc đó, Henry có vẻ ít tuân theo mong muốn của vợ hơn 6 tháng trước."
                    },
                    {
                        "en": "We should not be producing compliant students who do not dare to criticize.",
                        "vi": "Chúng ta không nên đào tạo ra những học sinh tuân thủ và không dám phê bình."
                    }
                ]
            },
            {
                "define": {
                    "en": "in agreement with a set of rules",
                    "vi": "đồng ý với một bộ quy tắc"
                },
                "examples": [
                    {
                        "en": "This site is HTML compliant.",
                        "vi": "Trang web này tuân thủ HTML."
                    }
                ]
            }
        ]
    },
    {
        "id": "655441dfcdc54ad4a25098a7c088b09f",
        "word": "conformability",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/kənˌfɔːməˈbɪləti/",
            "us": "/kənˌfɔːrməˈbɪləti/"
        },
        "nearby": [
            {
                "word": "confluence",
                "pos": "noun"
            },
            {
                "word": "conform",
                "pos": "verb"
            },
            {
                "word": "conformability",
                "pos": "noun"
            },
            {
                "word": "conformable",
                "pos": "adjective"
            },
            {
                "word": "conformance",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the fact of being able or willing to agree with, match or obey something",
                    "vi": "thực tế là có thể hoặc sẵn sàng đồng ý, phù hợp hoặc tuân theo điều gì đó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "3273bea80d0345509eee016674c2698d",
        "word": "conformable",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/kənˈfɔːməbl/",
            "us": "/kənˈfɔːrməbl/"
        },
        "nearby": [
            {
                "word": "conform",
                "pos": "verb"
            },
            {
                "word": "conformability",
                "pos": "noun"
            },
            {
                "word": "conformable",
                "pos": "adjective"
            },
            {
                "word": "conformance",
                "pos": "noun"
            },
            {
                "word": "conformation",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "similar in form or nature to something; in agreement with something",
                    "vi": "tương tự về hình thức hoặc tính chất của một cái gì đó; đồng ý với một cái gì đó"
                },
                "examples": [
                    {
                        "en": "What happens in cases where common law is not conformable to the constitution?",
                        "vi": "Điều gì xảy ra trong trường hợp luật chung không phù hợp với hiến pháp?"
                    }
                ]
            },
            {
                "define": {
                    "en": "willing to obey rules or behave and think in the same way as other people",
                    "vi": "sẵn sàng tuân theo các quy tắc hoặc cư xử và suy nghĩ theo cách giống như những người khác"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "aa939fc7be7b4a1eb4cb749598f399eb",
        "word": "conformance",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/kənˈfɔːməns/",
            "us": "/kənˈfɔːrməns/"
        },
        "nearby": [
            {
                "word": "conformability",
                "pos": "noun"
            },
            {
                "word": "conformable",
                "pos": "adjective"
            },
            {
                "word": "conformance",
                "pos": "noun"
            },
            {
                "word": "conformation",
                "pos": "noun"
            },
            {
                "word": "conformist",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the fact of following the rules or standards of something",
                    "vi": "thực tế là tuân theo các quy tắc hoặc tiêu chuẩn của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "You need to ensure conformance to strict quality guidelines.",
                        "vi": "Bạn cần đảm bảo tuân thủ các nguyên tắc chất lượng nghiêm ngặt."
                    }
                ]
            }
        ]
    },
    {
        "id": "32e7907fc3c245d8a9abbe54ef9d2bcd",
        "word": "consonance",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkɒnsənəns/",
            "us": "/ˈkɑːnsənəns/"
        },
        "nearby": [
            {
                "word": "consolidation",
                "pos": "noun"
            },
            {
                "word": "consommé",
                "pos": "noun"
            },
            {
                "word": "consonance",
                "pos": "noun"
            },
            {
                "word": "consonant",
                "pos": "noun"
            },
            {
                "word": "consonant",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "agreement",
                    "vi": "Hiệp định"
                },
                "examples": [
                    {
                        "en": "a policy that is popular because of its consonance with traditional party doctrine",
                        "vi": "một chính sách phổ biến vì nó phù hợp với học thuyết truyền thống của đảng"
                    }
                ]
            },
            {
                "define": {
                    "en": "a combination of musical notes that sound pleasant together",
                    "vi": "sự kết hợp của các nốt nhạc nghe vui tai với nhau"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "362c2157774a496eac0548659fbce48d",
        "word": "consonant",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkɒnsənənt/",
            "us": "/ˈkɑːnsənənt/"
        },
        "nearby": [
            {
                "word": "consonance",
                "pos": "noun"
            },
            {
                "word": "consonant",
                "pos": "noun"
            },
            {
                "word": "consonant",
                "pos": "adjective"
            },
            {
                "word": "consonantal",
                "pos": "adjective"
            },
            {
                "word": "con sordino",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "agreeing with or being the same as something else",
                    "vi": "đồng ý với hoặc giống với một cái gì đó khác"
                },
                "examples": [
                    {
                        "en": "The findings are consonant with other research.",
                        "vi": "Các phát hiện này có liên quan với các nghiên cứu khác."
                    }
                ]
            }
        ]
    },
    {
        "id": "526e6613032c40bf84c62caa208a6062",
        "word": "in conformity with something",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/kənˈfɔːməti/",
            "us": "/kənˈfɔːrməti/"
        },
        "nearby": [
            {
                "word": "conformist",
                "pos": "noun"
            },
            {
                "word": "conformist",
                "pos": "adjective"
            },
            {
                "word": "conformity",
                "pos": "noun"
            },
            {
                "word": "confound",
                "pos": "verb"
            },
            {
                "word": "confounded",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "behaviour or actions that follow the accepted rules of society",
                    "vi": "hành vi hoặc các hành động tuân theo các quy tắc được chấp nhận của xã hội"
                },
                "examples": [
                    {
                        "en": "a society of outward religious conformity",
                        "vi": "một xã hội hướng ngoại tuân thủ tôn giáo"
                    },
                    {
                        "en": "(in) conformity to/with something They act in unthinking conformity to customs.",
                        "vi": "(trong) sự phù hợp với / với một cái gì đó Họ hành động thiếu suy nghĩ về sự phù hợp với phong tục."
                    }
                ]
            },
            {
                "define": {
                    "en": "following the rules of something; conforming to something",
                    "vi": "tuân theo các quy tắc của một cái gì đó; phù hợp với một cái gì đó"
                },
                "examples": [
                    {
                        "en": "regulations that are in conformity with European law",
                        "vi": "các quy định phù hợp với luật pháp Châu Âu"
                    }
                ]
            }
        ]
    },
    {
        "id": "851314f97953405396fd64750e6aa9f5",
        "word": "in keeping (with something)",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkiːpɪŋ/",
            "us": "/ˈkiːpɪŋ/"
        },
        "nearby": [
            {
                "word": "keep from",
                "pos": "phrasal verb"
            },
            {
                "word": "keep in",
                "pos": "phrasal verb"
            },
            {
                "word": "keeping",
                "pos": "noun"
            },
            {
                "word": "keep in with",
                "pos": "phrasal verb"
            },
            {
                "word": "keep off",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "being taken care of by somebody",
                    "vi": "được ai đó chăm sóc"
                },
                "examples": [
                    {
                        "en": "(figurative) Her secrets were safe in his keeping.",
                        "vi": "(nghĩa bóng) Những bí mật của cô đã được anh giữ an toàn."
                    }
                ]
            },
            {
                "define": {
                    "en": "appropriate or expected in a particular situation; in agreement with something",
                    "vi": "thích hợp hoặc được mong đợi trong một tình huống cụ thể; đồng ý với một cái gì đó"
                },
                "examples": [
                    {
                        "en": "The latest results are in keeping with our earlier findings.",
                        "vi": "Các kết quả mới nhất phù hợp với những phát hiện trước đó của chúng tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "not appropriate or expected in a particular situation; not in agreement with something",
                    "vi": "không thích hợp hoặc không được mong đợi trong một tình huống cụ thể; không đồng ý với một cái gì đó"
                },
                "examples": [
                    {
                        "en": "The painting is out of keeping with the rest of the room.",
                        "vi": "Bức tranh không phù hợp với phần còn lại của căn phòng."
                    }
                ]
            }
        ]
    },
    {
        "id": "eb9575a1b8d84a7baa1e53b96b550afa",
        "word": "square",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/skweə(r)/",
            "us": "/skwer/"
        },
        "nearby": [
            {
                "word": "squander",
                "pos": "verb"
            },
            {
                "word": "Squanto",
                "pos": ""
            },
            {
                "word": "square",
                "pos": "adjective"
            },
            {
                "word": "square",
                "pos": "noun"
            },
            {
                "word": "square",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "having four straight equal sides and four angles of 90°",
                    "vi": "có bốn cạnh thẳng bằng nhau và bốn góc 90 °"
                },
                "examples": [
                    {
                        "en": "a square room",
                        "vi": "một căn phòng vuông"
                    }
                ]
            },
            {
                "define": {
                    "en": "forming an angle of 90° exactly or approximately",
                    "vi": "tạo thành một góc 90 ° chính xác hoặc gần đúng"
                },
                "examples": [
                    {
                        "en": "The book had rounded, not square, corners.",
                        "vi": "Cuốn sách được làm tròn, không vuông, các góc."
                    },
                    {
                        "en": "square shoulders",
                        "vi": "vai vuông"
                    },
                    {
                        "en": "He had a firm, square jaw.",
                        "vi": "Anh ta có một cái hàm vuông vức, rắn chắc."
                    }
                ]
            },
            {
                "define": {
                    "en": "used after a number to give a measurement of area",
                    "vi": "được sử dụng sau một số để đo diện tích"
                },
                "examples": [
                    {
                        "en": "an area of 36 square metres/feet/miles/kilometres/inches",
                        "vi": "diện tích 36 mét vuông / feet / dặm / km / inch"
                    }
                ]
            },
            {
                "define": {
                    "en": "used after a unit of measurement to say that something measures the same amount on each of four sides",
                    "vi": "được sử dụng sau một đơn vị đo lường để nói rằng một cái gì đó đo cùng một lượng ở mỗi cạnh trong số bốn cạnh"
                },
                "examples": [
                    {
                        "en": "a carpet four metres square",
                        "vi": "một tấm thảm bốn mét vuông"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to describe something that is broad or that looks solid in shape",
                    "vi": "được sử dụng để mô tả một cái gì đó rộng hoặc có hình dạng rắn chắc"
                },
                "examples": [
                    {
                        "en": "a man of square build",
                        "vi": "người xây dựng hình vuông"
                    }
                ]
            },
            {
                "define": {
                    "en": "level with something or parallel to something",
                    "vi": "mức độ với một cái gì đó hoặc song song với một cái gì đó"
                },
                "examples": [
                    {
                        "en": "tables arranged square with the wall",
                        "vi": "bàn sắp xếp hình vuông với tường"
                    }
                ]
            },
            {
                "define": {
                    "en": "if two people are square, neither of them owes money to the other",
                    "vi": "nếu hai người là hình vuông, không ai trong số họ nợ người kia"
                },
                "examples": [
                    {
                        "en": "Here's the £10 I owe you—now we're square.",
                        "vi": "Đây là £ 10 tôi nợ bạn — bây giờ chúng ta đã vuông tròn."
                    }
                ]
            },
            {
                "define": {
                    "en": "if two teams are square, they have the same number of points",
                    "vi": "Nếu hai đội là hình vuông, họ có cùng số điểm"
                },
                "examples": [
                    {
                        "en": "The teams were all square at half-time.",
                        "vi": "Tất cả các đội đều có hình vuông trong hiệp một."
                    }
                ]
            },
            {
                "define": {
                    "en": "fair or honest, especially in business matters",
                    "vi": "công bằng hoặc trung thực, đặc biệt là trong các vấn đề kinh doanh"
                },
                "examples": [
                    {
                        "en": "a square deal",
                        "vi": "một thỏa thuận vuông"
                    },
                    {
                        "en": "Are you being square with me?",
                        "vi": "Bạn có đang vuông với tôi?"
                    }
                ]
            },
            {
                "define": {
                    "en": "in agreement with something",
                    "vi": "đồng ý với một cái gì đó"
                },
                "examples": [
                    {
                        "en": "That isn't quite square with what you said yesterday.",
                        "vi": "Điều đó không hoàn toàn phù hợp với những gì bạn đã nói ngày hôm qua."
                    }
                ]
            },
            {
                "define": {
                    "en": "considered to be boring, for example because they are old-fashioned or work too hard at school",
                    "vi": "được coi là nhàm chán, chẳng hạn như vì họ cổ hủ hoặc làm việc quá sức ở trường"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a good meal that satisfies your hunger",
                    "vi": "một bữa ăn ngon giúp bạn thỏa mãn cơn đói"
                },
                "examples": [
                    {
                        "en": "He looks as though he hasn't had a square meal for weeks.",
                        "vi": "Anh ấy trông như thể anh ấy đã không được ăn một bữa no trong nhiều tuần."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who does not feel happy or comfortable in a particular situation, or who is not suitable for it",
                    "vi": "một người không cảm thấy hạnh phúc hoặc thoải mái trong một tình huống cụ thể, hoặc người không phù hợp với nó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "2e25784e96f444e6a1cabd558823a73a",
        "word": "square with",
        "pos": "phrasal verb",
        "level": "c2",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "square root",
                "pos": "noun"
            },
            {
                "word": "square up",
                "pos": "phrasal verb"
            },
            {
                "word": "square with",
                "pos": "phrasal verb"
            },
            {
                "word": "squarish",
                "pos": "adjective"
            },
            {
                "word": "squash",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to make two ideas, facts or situations agree or combine well with each other; to agree or be consistent with another idea, fact or situation",
                    "vi": "để làm cho hai ý tưởng, sự kiện hoặc tình huống đồng ý hoặc kết hợp tốt với nhau; đồng ý hoặc nhất quán với một ý tưởng, thực tế hoặc tình huống khác"
                },
                "examples": [
                    {
                        "en": "The interests of farmers need to be squared with those of consumers.",
                        "vi": "Lợi ích của nông dân cần được bình phương với lợi ích của người tiêu dùng."
                    },
                    {
                        "en": "How can you square this with your conscience?",
                        "vi": "Làm thế nào bạn có thể giải quyết điều này với lương tâm của bạn?"
                    },
                    {
                        "en": "Your theory does not square with the facts.",
                        "vi": "Lý thuyết của bạn không phù hợp với thực tế."
                    },
                    {
                        "en": "What she was being asked to do did not square with her political beliefs.",
                        "vi": "Những gì cô ấy được yêu cầu làm không phù hợp với niềm tin chính trị của cô ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to ask permission or check with somebody that they approve of what you want to do",
                    "vi": "để yêu cầu sự cho phép hoặc kiểm tra với ai đó rằng họ chấp thuận những gì bạn muốn làm"
                },
                "examples": [
                    {
                        "en": "I think I'll be able to come, but I'll square it with my parents first.",
                        "vi": "Tôi nghĩ tôi sẽ có thể đến, nhưng tôi sẽ giải quyết vấn đề này với bố mẹ tôi trước."
                    }
                ]
            }
        ]
    },
    {
        "id": "2485607a2b5542429da998ccf40aa4e7",
        "word": "tie in",
        "pos": "phrasal verb",
        "level": "c2",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "tie down",
                "pos": "phrasal verb"
            },
            {
                "word": "tie-dye",
                "pos": "verb"
            },
            {
                "word": "tie in",
                "pos": "phrasal verb"
            },
            {
                "word": "tie-in",
                "pos": "noun"
            },
            {
                "word": "tie off",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to match or agree with something",
                    "vi": "để phù hợp hoặc đồng ý với một cái gì đó"
                },
                "examples": [
                    {
                        "en": "This evidence ties in closely with what we already know.",
                        "vi": "Bằng chứng này liên quan chặt chẽ với những gì chúng ta đã biết."
                    }
                ]
            },
            {
                "define": {
                    "en": "to link something or be linked to something; to happen, or arrange for something to happen, at the same time as something else",
                    "vi": "để liên kết một cái gì đó hoặc được liên kết với một cái gì đó; để xảy ra, hoặc sắp xếp cho một cái gì đó xảy ra, cùng lúc với một cái gì đó khác"
                },
                "examples": [
                    {
                        "en": "The concert will tie in with the festival of dance taking place the same weekend.",
                        "vi": "Buổi hòa nhạc sẽ gắn liền với lễ hội khiêu vũ diễn ra vào cuối tuần."
                    }
                ]
            }
        ]
    }
]