[
    {
        "id": "84a87bf65ef74ab78f42edd71113c3b4",
        "word": "farming",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈfɑːmɪŋ/",
            "us": "/ˈfɑːrmɪŋ/"
        },
        "nearby": [
            {
                "word": "farmhand",
                "pos": "noun"
            },
            {
                "word": "farmhouse",
                "pos": "noun"
            },
            {
                "word": "farming",
                "pos": "noun"
            },
            {
                "word": "farmland",
                "pos": "noun"
            },
            {
                "word": "farm out",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the business of managing or working on a farm",
                    "vi": "kinh doanh quản lý hoặc làm việc trên một trang trại"
                },
                "examples": [
                    {
                        "en": "to take up farming",
                        "vi": "nhận làm nông nghiệp"
                    },
                    {
                        "en": "organic farming",
                        "vi": "canh tác hữu cơ"
                    },
                    {
                        "en": "sheep/fish/salmon farming",
                        "vi": "nuôi cừu / cá / cá hồi"
                    },
                    {
                        "en": "modern farming methods",
                        "vi": "phương pháp canh tác hiện đại"
                    },
                    {
                        "en": "a farming community",
                        "vi": "một cộng đồng nông dân"
                    },
                    {
                        "en": "the British farming industry",
                        "vi": "ngành nông nghiệp của Anh"
                    }
                ]
            }
        ]
    },
    {
        "id": "4cc5703bf3ca4cdd933c026212c7058c",
        "word": "feed",
        "pos": "verb",
        "level": "a2",
        "phonetic": {
            "uk": "/fiːd/",
            "us": "/fiːd/"
        },
        "nearby": [
            {
                "word": "feebleness",
                "pos": "noun"
            },
            {
                "word": "feebly",
                "pos": "adverb"
            },
            {
                "word": "feed",
                "pos": "verb"
            },
            {
                "word": "feed",
                "pos": "noun"
            },
            {
                "word": "feed back",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to give food to a person or an animal",
                    "vi": "đưa thức ăn cho người hoặc động vật"
                },
                "examples": [
                    {
                        "en": "feed somebody/something/yourself Have you fed the cat yet?",
                        "vi": "cho ai đó ăn / cái gì đó / bản thân Bạn đã cho mèo ăn chưa?"
                    },
                    {
                        "en": "The baby can't feed itself yet (= can't put food into its own mouth).",
                        "vi": "Em bé chưa thể tự ăn (= không thể tự đút thức ăn vào miệng)."
                    },
                    {
                        "en": "feed somebody/something sth It's important to feed children a well-balanced diet.",
                        "vi": "cho ai đó ăn / cái gì đó sth Điều quan trọng là phải cho trẻ ăn một chế độ ăn uống cân bằng."
                    },
                    {
                        "en": "He has to be fed liquids through a tube in his stomach.",
                        "vi": "Anh ta phải được cung cấp chất lỏng thông qua một ống dẫn trong dạ dày của mình."
                    },
                    {
                        "en": "feed somebody/something (on) something The cattle are fed (on) barley.",
                        "vi": "cho ai đó ăn một cái gì đó (trên) một cái gì đó Gia súc được cho ăn (trên) lúa mạch."
                    },
                    {
                        "en": "feed something to somebody/something The barley is fed to the cattle.",
                        "vi": "cho ai đó ăn một cái gì đó / cái gì đó Lúa mạch được cho gia súc ăn."
                    },
                    {
                        "en": "feed somebody/something with something The animals are fed with hay and grass.",
                        "vi": "cho ai đó ăn / cái gì đó bằng cái gì Các con vật được cho ăn bằng cỏ khô."
                    }
                ]
            },
            {
                "define": {
                    "en": "to eat food",
                    "vi": "ăn thức ăn"
                },
                "examples": [
                    {
                        "en": "Slugs and snails feed at night.",
                        "vi": "Sên và ốc kiếm ăn vào ban đêm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to provide food for a person or group of people",
                    "vi": "cung cấp thức ăn cho một người hoặc một nhóm người"
                },
                "examples": [
                    {
                        "en": "They have a large family to feed.",
                        "vi": "Họ có một gia đình lớn để nuôi."
                    },
                    {
                        "en": "There's enough here to feed an army.",
                        "vi": "Ở đây có đủ để nuôi một đội quân."
                    },
                    {
                        "en": "Have they been feeding you well?",
                        "vi": "Họ đã cho bạn ăn tốt chưa?"
                    },
                    {
                        "en": "They struggled to feed and clothe the children.",
                        "vi": "Họ phải vật lộn để kiếm ăn và mặc cho lũ trẻ."
                    },
                    {
                        "en": "Having another mouth (= person) to feed can be a strain.",
                        "vi": "Có một miệng (= người) khác để cho ăn có thể là một căng thẳng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to give a plant a special substance to make it grow",
                    "vi": "cung cấp cho cây một chất đặc biệt để làm cho nó phát triển"
                },
                "examples": [
                    {
                        "en": "Feed the plants once a week.",
                        "vi": "Cho cây ăn mỗi tuần một lần."
                    }
                ]
            },
            {
                "define": {
                    "en": "to give advice, information, etc. to somebody/something",
                    "vi": "để đưa ra lời khuyên, thông tin, v.v. cho ai đó / điều gì đó"
                },
                "examples": [
                    {
                        "en": "be fed something We are constantly fed gossip and speculation by the media.",
                        "vi": "được cho ăn một thứ gì đó Chúng tôi liên tục bị giới truyền thông đưa tin về những lời đàm tiếu và suy đoán."
                    },
                    {
                        "en": "be fed with something The media were being fed with accusations and lies.",
                        "vi": "được nuôi dưỡng bằng một cái gì đó Các phương tiện truyền thông đã bị đưa tin bằng những lời buộc tội và dối trá."
                    },
                    {
                        "en": "be fed to somebody Gossip and speculation are constantly fed to us by the media.",
                        "vi": "được đưa cho ai đó Tin đồn và suy đoán liên tục được truyền thông cho chúng ta."
                    }
                ]
            },
            {
                "define": {
                    "en": "to supply something to somebody/something",
                    "vi": "cung cấp một cái gì đó cho ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "be fed (by something) The lake is fed by a river.",
                        "vi": "be feed (by something) The lake is feed by a river."
                    },
                    {
                        "en": "A is fed with B The electricity line is fed with power through an underground cable.",
                        "vi": "được cấp nguồn cho B Đường dây được cấp điện qua một cáp ngầm."
                    },
                    {
                        "en": "B is fed into A Power is fed into the electricity line through an underground cable.",
                        "vi": "B được cấp vào A Nguồn điện được cấp vào đường dây điện thông qua một dây cáp ngầm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to put or push something into or through a machine",
                    "vi": "để đặt hoặc đẩy một cái gì đó vào hoặc thông qua một cái máy"
                },
                "examples": [
                    {
                        "en": "feed A (with B) He fed the meter with coins.",
                        "vi": "feed A (with B) He fed đồng hồ đo bằng đồng xu."
                    },
                    {
                        "en": "feed B into A He fed coins into the meter.",
                        "vi": "feed B vào A Anh ấy cho xu vào đồng hồ."
                    },
                    {
                        "en": "The information was fed into the data store.",
                        "vi": "Thông tin đã được đưa vào kho dữ liệu."
                    },
                    {
                        "en": "feed something into/through something The fabric is fed through the machine.",
                        "vi": "đưa một cái gì đó vào / thông qua một cái gì đó Vải được đưa qua máy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to satisfy a need, desire, etc. and keep it strong",
                    "vi": "để thỏa mãn nhu cầu, mong muốn, v.v. và giữ cho nó mạnh mẽ"
                },
                "examples": [
                    {
                        "en": "For drug addicts, the need to feed the addiction takes priority over everything else.",
                        "vi": "Đối với những người nghiện ma túy, nhu cầu nuôi dưỡng cơn nghiện được ưu tiên hơn mọi thứ khác."
                    }
                ]
            },
            {
                "define": {
                    "en": "to harm somebody who has helped you or supported you",
                    "vi": "làm hại ai đó đã giúp đỡ bạn hoặc hỗ trợ bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to eat a lot of food or too much food",
                    "vi": "ăn nhiều hoặc ăn quá nhiều"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "27d618f7d70843e287e5f21cf890148d",
        "word": "fish farm",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈfɪʃ fɑːm/",
            "us": "/ˈfɪʃ fɑːrm/"
        },
        "nearby": [
            {
                "word": "fishery",
                "pos": "noun"
            },
            {
                "word": "fisheye",
                "pos": "noun"
            },
            {
                "word": "fish farm",
                "pos": "noun"
            },
            {
                "word": "fish finger",
                "pos": "noun"
            },
            {
                "word": "fish for",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a place where fish are bred (= kept in order to produce young) as a business",
                    "vi": "một nơi mà cá được nuôi (= nuôi để sản xuất con non) như một doanh nghiệp"
                },
                "examples": [
                    {
                        "en": "Critics say that fish farms generate high levels of disease and parasites.",
                        "vi": "Những người chỉ trích nói rằng các trang trại nuôi cá tạo ra nhiều dịch bệnh và ký sinh trùng."
                    }
                ]
            }
        ]
    },
    {
        "id": "13c8ad8bc58048f099fb82ca6d25db00",
        "word": "commercial farming",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/kəˌmɜːʃl ˈfɑːmɪŋ/",
            "us": "/kəˌmɜːrʃl ˈfɑːrmɪŋ/"
        },
        "nearby": [
            {
                "word": "commercial bank",
                "pos": "noun"
            },
            {
                "word": "commercial break",
                "pos": "noun"
            },
            {
                "word": "commercial farming",
                "pos": "noun"
            },
            {
                "word": "commercialism",
                "pos": "noun"
            },
            {
                "word": "commercialization",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a method of farming that produces crops or animals for sale, usually on a large scale and using modern methods and equipment",
                    "vi": "một phương thức canh tác sản xuất cây trồng hoặc vật nuôi để bán, thường ở quy mô lớn và sử dụng các phương pháp và thiết bị hiện đại"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "3f1e7a1ff1a34c4a87c642358409a17a",
        "word": "food chain",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈfuːd tʃeɪn/",
            "us": "/ˈfuːd tʃeɪn/"
        },
        "nearby": [
            {
                "word": "food",
                "pos": "noun"
            },
            {
                "word": "food bank",
                "pos": "noun"
            },
            {
                "word": "food chain",
                "pos": "noun"
            },
            {
                "word": "food court",
                "pos": "noun"
            },
            {
                "word": "food group",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a series of living creatures in which each type of creature feeds on the one below it in the series",
                    "vi": "một loạt các sinh vật sống trong đó mỗi loại sinh vật ăn sinh vật bên dưới nó trong loạt"
                },
                "examples": [
                    {
                        "en": "Insects are fairly low down (on) the food chain.",
                        "vi": "Côn trùng nằm khá thấp trong chuỗi thức ăn."
                    },
                    {
                        "en": "Pesticides work their way up the food chain from plants, through insects and birds to humans.",
                        "vi": "Thuốc trừ sâu hoạt động theo cách của chúng trong chuỗi thức ăn từ thực vật, thông qua côn trùng và chim sang người."
                    },
                    {
                        "en": "efforts to ensure that dioxins do not enter the food chain",
                        "vi": "nỗ lực đảm bảo rằng dioxin không xâm nhập vào chuỗi thức ăn"
                    }
                ]
            },
            {
                "define": {
                    "en": "a system or structure in which the people or organizations that are part of it are seen as having different levels of importance, success, etc.",
                    "vi": "một hệ thống hoặc cấu trúc trong đó những người hoặc tổ chức là một phần của nó được coi là có mức độ quan trọng, mức độ thành công khác nhau, v.v."
                },
                "examples": [
                    {
                        "en": "These guys are at the top of the food chain when it comes to earnings.",
                        "vi": "Những người này đứng đầu chuỗi thức ăn khi nói đến thu nhập."
                    }
                ]
            },
            {
                "define": {
                    "en": "the series of stages that food passes along as it goes from being grown or produced to being sold and then eaten",
                    "vi": "một loạt các giai đoạn mà thực phẩm trải qua khi nó được trồng hoặc sản xuất đến khi được bán và sau đó được ăn"
                },
                "examples": [
                    {
                        "en": "They are focused on ensuring that contaminated crops do not enter the food chain.",
                        "vi": "Họ tập trung vào việc đảm bảo rằng cây trồng bị ô nhiễm không xâm nhập vào chuỗi thức ăn."
                    }
                ]
            }
        ]
    },
    {
        "id": "fc700c23fc02498f9ddfec9ec9f91c6a",
        "word": "keep",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/kiːp/",
            "us": "/kiːp/"
        },
        "nearby": [
            {
                "word": "keenly",
                "pos": "adverb"
            },
            {
                "word": "keenness",
                "pos": "noun"
            },
            {
                "word": "keep",
                "pos": "verb"
            },
            {
                "word": "keep",
                "pos": "noun"
            },
            {
                "word": "keep after",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to continue to have something and not give it back or throw it away",
                    "vi": "tiếp tục có một thứ gì đó và không trả lại hoặc vứt bỏ nó"
                },
                "examples": [
                    {
                        "en": "He kept all her letters.",
                        "vi": "Anh đã giữ tất cả các bức thư của cô."
                    },
                    {
                        "en": "She handed the waiter a hundred dollar bill and told him to keep the change.",
                        "vi": "Cô đưa cho người phục vụ một tờ một trăm đô la và bảo anh ta giữ tiền lẻ."
                    },
                    {
                        "en": "Always keep a backup of the file.",
                        "vi": "Luôn giữ một bản sao lưu của tệp."
                    }
                ]
            },
            {
                "define": {
                    "en": "to put or store something in a particular place",
                    "vi": "để đặt hoặc lưu trữ một cái gì đó ở một nơi cụ thể"
                },
                "examples": [
                    {
                        "en": "Keep your passport in a safe place.",
                        "vi": "Giữ hộ chiếu của bạn ở một nơi an toàn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to save something for somebody",
                    "vi": "để tiết kiệm một cái gì đó cho ai đó"
                },
                "examples": [
                    {
                        "en": "keep something for somebody Please keep a seat for me.",
                        "vi": "giữ một cái gì đó cho ai đó Xin hãy giữ một chỗ cho tôi."
                    },
                    {
                        "en": "The man in the shop said he'd keep it for me until Friday.",
                        "vi": "Người đàn ông trong cửa hàng nói rằng anh ta sẽ giữ nó cho tôi cho đến thứ sáu."
                    },
                    {
                        "en": "keep somebody something Please keep me a seat.",
                        "vi": "Giữ cho ai đó một cái gì đó Xin hãy giữ cho tôi một chỗ ngồi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to stay in a particular condition or position; to make somebody/something do this",
                    "vi": "để ở trong một điều kiện hoặc vị trí cụ thể; để khiến ai đó / điều gì đó làm điều này"
                },
                "examples": [
                    {
                        "en": "keep + adj. We huddled together to keep warm.",
                        "vi": "keep + adj. Chúng tôi xúm vào nhau để giữ ấm."
                    },
                    {
                        "en": "I could not keep silent any longer.",
                        "vi": "Tôi không thể tiếp tục im lặng được nữa."
                    },
                    {
                        "en": "keep + adv./prep. The notice said ‘Keep off (= Do not walk on) the grass’.",
                        "vi": "keep + adv./prep. Thông báo có nội dung 'Tránh đi (= Không đi trên) cỏ'."
                    },
                    {
                        "en": "Keep left along the wall.",
                        "vi": "Đi bên trái dọc theo bức tường."
                    },
                    {
                        "en": "keep somebody/something + adj. The doctors worked miracles to keep him alive.",
                        "vi": "giữ ai đó / cái gì đó + adj. Các bác sĩ đã làm phép màu để giữ cho anh ta sống."
                    },
                    {
                        "en": "Winning the contract means they can now keep the factory open.",
                        "vi": "Giành được hợp đồng có nghĩa là bây giờ họ có thể tiếp tục mở nhà máy."
                    },
                    {
                        "en": "She kept the children amused for hours.",
                        "vi": "Cô giữ cho bọn trẻ thích thú trong nhiều giờ."
                    },
                    {
                        "en": "Keep your PIN safe.",
                        "vi": "Giữ mã PIN của bạn an toàn."
                    },
                    {
                        "en": "keep somebody/something + adv./prep. He kept his coat on.",
                        "vi": "giữ ai đó / cái gì đó + adv./prep. Anh ấy vẫn mặc áo khoác."
                    },
                    {
                        "en": "Don't keep us in suspense—what happened next?",
                        "vi": "Đừng khiến chúng tôi hồi hộp — điều gì đã xảy ra tiếp theo?"
                    },
                    {
                        "en": "keep something She had trouble keeping her balance.",
                        "vi": "giữ một cái gì đó Cô đã gặp khó khăn trong việc giữ thăng bằng."
                    },
                    {
                        "en": "keep somebody/something doing something I'm very sorry to keep you waiting.",
                        "vi": "giữ ai đó / cái gì đó đang làm gì đó Tôi rất xin lỗi vì đã để bạn phải chờ đợi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to continue doing something; to do something repeatedly",
                    "vi": "để tiếp tục làm điều gì đó; làm điều gì đó lặp đi lặp lại"
                },
                "examples": [
                    {
                        "en": "keep doing something Keep smiling!",
                        "vi": "tiếp tục làm điều gì đó Hãy mỉm cười!"
                    },
                    {
                        "en": "Why does everyone keep saying that?",
                        "vi": "Tại sao mọi người cứ nói như vậy?"
                    },
                    {
                        "en": "Things just keep getting worse.",
                        "vi": "Mọi thứ cứ trở nên tồi tệ hơn."
                    },
                    {
                        "en": "keep on doing something Don't keep on interrupting me!",
                        "vi": "tiếp tục làm điều gì đó Đừng tiếp tục làm gián đoạn tôi!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to know something and not tell it to anyone",
                    "vi": "để biết điều gì đó và không nói điều đó với bất kỳ ai"
                },
                "examples": [
                    {
                        "en": "Can you keep a secret?",
                        "vi": "Bạn có thể giữ bí mật không?"
                    },
                    {
                        "en": "She kept her past secret from us all.",
                        "vi": "Cô ấy đã giữ bí mật về quá khứ của mình với tất cả chúng tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to do what you have promised to do; to go where you have agreed to go",
                    "vi": "để làm những gì bạn đã hứa sẽ làm; đi đến nơi bạn đã đồng ý đi"
                },
                "examples": [
                    {
                        "en": "She kept her promise to visit them.",
                        "vi": "Cô đã giữ lời hứa sẽ đến thăm họ."
                    },
                    {
                        "en": "Mary kept her word and Henry was never informed.",
                        "vi": "Mary giữ lời và Henry không bao giờ được thông báo."
                    },
                    {
                        "en": "He failed to keep his appointment at the clinic.",
                        "vi": "Anh ta đã thất bại trong cuộc hẹn của mình tại phòng khám."
                    }
                ]
            },
            {
                "define": {
                    "en": "to write down something as a record",
                    "vi": "để viết ra một cái gì đó như một bản ghi"
                },
                "examples": [
                    {
                        "en": "She kept a diary for over twenty years.",
                        "vi": "Cô ấy đã giữ một cuốn nhật ký trong hơn hai mươi năm."
                    },
                    {
                        "en": "We keep a record of all complaints that we receive.",
                        "vi": "Chúng tôi lưu giữ hồ sơ về tất cả các khiếu nại mà chúng tôi nhận được."
                    },
                    {
                        "en": "Keep a note of where each item can be found.",
                        "vi": "Hãy ghi chú về nơi có thể tìm thấy từng vật phẩm."
                    },
                    {
                        "en": "I kept a weekly account of my workload and activities.",
                        "vi": "Tôi giữ một tài khoản hàng tuần về khối lượng công việc và các hoạt động của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to own and care for animals",
                    "vi": "sở hữu và chăm sóc động vật"
                },
                "examples": [
                    {
                        "en": "to keep bees/goats/hens",
                        "vi": "để nuôi ong / dê / gà mái"
                    },
                    {
                        "en": "My grandmother kept chickens in her back yard.",
                        "vi": "Bà tôi nuôi gà ở sân sau nhà."
                    },
                    {
                        "en": "Residents are not allowed to keep pets.",
                        "vi": "Cư dân không được phép nuôi thú cưng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to own and manage a shop or restaurant",
                    "vi": "sở hữu và quản lý một cửa hàng hoặc nhà hàng"
                },
                "examples": [
                    {
                        "en": "Her father kept a grocer's shop.",
                        "vi": "Cha cô giữ một cửa hàng tạp hóa."
                    }
                ]
            },
            {
                "define": {
                    "en": "to provide what is necessary for somebody to live; to support somebody by paying for food, etc.",
                    "vi": "cung cấp những gì cần thiết để ai đó sống; để hỗ trợ ai đó bằng cách trả tiền cho thức ăn, v.v."
                },
                "examples": [
                    {
                        "en": "He scarcely earns enough to keep himself and his family.",
                        "vi": "Anh ấy hầu như không kiếm đủ tiền để nuôi sống bản thân và gia đình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to delay somebody",
                    "vi": "trì hoãn ai đó"
                },
                "examples": [
                    {
                        "en": "You're an hour late—what kept you?",
                        "vi": "Bạn đến muộn một giờ - điều gì đã giữ chân bạn?"
                    },
                    {
                        "en": "I won't keep you long. I've just got a couple of quick questions.",
                        "vi": "Tôi sẽ không giữ bạn lâu đâu. Tôi vừa có một vài câu hỏi nhanh."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to ask or talk about somebody’s health",
                    "vi": "dùng để hỏi hoặc nói về sức khỏe của ai đó"
                },
                "examples": [
                    {
                        "en": "How is your mother keeping?",
                        "vi": "Mẹ bạn đang giữ như thế nào?"
                    },
                    {
                        "en": "We're all keeping well.",
                        "vi": "Tất cả chúng tôi đang giữ tốt."
                    }
                ]
            },
            {
                "define": {
                    "en": "to remain in good condition",
                    "vi": "để duy trì trong tình trạng tốt"
                },
                "examples": [
                    {
                        "en": "Finish off the pie—it won't keep.",
                        "vi": "Hoàn thành chiếc bánh - nó sẽ không giữ được nữa."
                    },
                    {
                        "en": "Milk and cream should keep quite well in a fridge.",
                        "vi": "Sữa và kem nên bảo quản khá tốt trong tủ lạnh."
                    },
                    {
                        "en": "(informal, figurative) ‘I'd love to hear about it, but I'm late already.’ ‘That's OK—it'll keep (= I can tell you about it later).’",
                        "vi": "(thân mật, nghĩa bóng) 'Tôi rất muốn nghe về nó, nhưng tôi đã muộn rồi.' 'Không sao đâu — nó sẽ giữ lại (= Tôi có thể kể cho bạn nghe về điều đó sau).'"
                    }
                ]
            },
            {
                "define": {
                    "en": "to protect somebody from something",
                    "vi": "để bảo vệ ai đó khỏi một cái gì đó"
                },
                "examples": [
                    {
                        "en": "keep somebody May the Lord bless you and keep you (= used in prayers in the Christian Church).",
                        "vi": "giữ ai đó Cầu Chúa ban phước và giữ cho bạn (= được sử dụng trong các buổi cầu nguyện trong Nhà thờ Thiên chúa giáo)."
                    },
                    {
                        "en": "keep somebody from something His only thought was to keep the boy from harm.",
                        "vi": "Giữ ai đó khỏi điều gì đó Suy nghĩ duy nhất của anh ấy là giữ cho cậu bé khỏi bị tổn hại."
                    }
                ]
            },
            {
                "define": {
                    "en": "to guard or protect the goal or wicket",
                    "vi": "để bảo vệ hoặc bảo vệ khung thành hoặc wicket"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to make an effort to live normally when you are in a difficult situation or when you have experienced great pain and difficulty",
                    "vi": "cố gắng sống bình thường khi gặp hoàn cảnh khó khăn hoặc khi gặp khó khăn, đau đớn"
                },
                "examples": [
                    {
                        "en": "You just have to keep yourself busy and keep going.",
                        "vi": "Bạn chỉ cần giữ cho mình bận rộn và tiếp tục đi."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to encourage somebody to continue doing something",
                    "vi": "được sử dụng để khuyến khích ai đó tiếp tục làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "Keep going, Sarah, you're nearly there.",
                        "vi": "Tiếp tục đi, Sarah, bạn sắp hoàn thành rồi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be enough for somebody until they get what they are waiting for",
                    "vi": "là đủ cho ai đó cho đến khi họ đạt được những gì họ đang chờ đợi"
                },
                "examples": [
                    {
                        "en": "Have an apple to keep you going till dinner time.",
                        "vi": "Có một quả táo để bạn tiếp tục đến giờ ăn tối."
                    }
                ]
            }
        ]
    },
    {
        "id": "79950ff275fb48eeaef1b4e17a12fe58",
        "word": "milk",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/mɪlk/",
            "us": "/mɪlk/"
        },
        "nearby": [
            {
                "word": "militiaman",
                "pos": "noun"
            },
            {
                "word": "milk",
                "pos": "noun"
            },
            {
                "word": "milk",
                "pos": "verb"
            },
            {
                "word": "milk chocolate",
                "pos": "noun"
            },
            {
                "word": "milk float",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to take milk from a cow, goat, etc.",
                    "vi": "lấy sữa từ bò, dê, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to obtain as much money, advantage, etc. for yourself as you can from a particular situation, especially in a dishonest way",
                    "vi": "để có được càng nhiều tiền, lợi thế, v.v. cho bản thân bạn càng tốt từ một tình huống cụ thể, đặc biệt là theo cách không trung thực"
                },
                "examples": [
                    {
                        "en": "milk A (from B) She's milked a small fortune from the company over the years.",
                        "vi": "sữa A (từ B) Cô ấy đã vắt kiệt một khối tài sản nhỏ từ công ty trong những năm qua."
                    },
                    {
                        "en": "milk B (of A) She's milked the company of a small fortune.",
                        "vi": "milk B (of A) Cô ấy vắt sữa công ty của một gia tài nhỏ."
                    },
                    {
                        "en": "I know he's had a hard time lately, but he's certainly milking it for all it's worth (= using it as an excuse to do things that people would normally object to).",
                        "vi": "Tôi biết gần đây anh ấy đã có một khoảng thời gian khó khăn, nhưng anh ấy chắc chắn vắt sữa vì tất cả những gì xứng đáng (= sử dụng nó như một cái cớ để làm những việc mà mọi người thường phản đối)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to get from somebody/something all the money, help, information, etc. they have, usually giving nothing in return",
                    "vi": "nhận từ ai đó / thứ gì đó tất cả tiền bạc, sự giúp đỡ, thông tin, v.v. mà họ có, thường không mang lại lợi ích gì"
                },
                "examples": [
                    {
                        "en": "By earning millions from racing and giving pennies back, the bookmakers are milking the sport dry.",
                        "vi": "Bằng cách kiếm hàng triệu đô la từ việc đua xe và trả lại đồng xu, các nhà cái đang vắt kiệt sức lực của môn thể thao này."
                    }
                ]
            }
        ]
    },
    {
        "id": "4f1a65b1baa54cbd9f0ff9e492c11f52",
        "word": "breed",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/briːd/",
            "us": "/briːd/"
        },
        "nearby": [
            {
                "word": "breech birth",
                "pos": "noun"
            },
            {
                "word": "breeches",
                "pos": "noun"
            },
            {
                "word": "breed",
                "pos": "verb"
            },
            {
                "word": "breed",
                "pos": "noun"
            },
            {
                "word": "breeder",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to have sex and produce young",
                    "vi": "quan hệ tình dục và sản xuất trẻ"
                },
                "examples": [
                    {
                        "en": "Many animals breed only at certain times of the year.",
                        "vi": "Nhiều loài động vật chỉ sinh sản vào những thời điểm nhất định trong năm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to keep animals or plants in order to produce young ones for a particular purpose",
                    "vi": "giữ động vật hoặc thực vật để tạo ra những con non cho một mục đích cụ thể"
                },
                "examples": [
                    {
                        "en": "breed something (for/as something) The rabbits are bred for their long coats.",
                        "vi": "giống một cái gì đó (cho / như một cái gì đó) Những con thỏ được lai tạo để có bộ lông dài của chúng."
                    },
                    {
                        "en": "Greyhounds were originally bred as hunting dogs.",
                        "vi": "Greyhounds ban đầu được nuôi làm chó săn."
                    },
                    {
                        "en": "the first panda to be bred in captivity",
                        "vi": "gấu trúc đầu tiên được nuôi nhốt"
                    },
                    {
                        "en": "breed from something She's a lovely cat. Will you breed from her?",
                        "vi": "giống từ một cái gì đó Cô ấy là một con mèo đáng yêu. Bạn sẽ lai tạo từ cô ấy?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be the cause of something",
                    "vi": "là nguyên nhân của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "Nothing breeds success like success.",
                        "vi": "Không có gì tạo ra thành công giống như thành công."
                    }
                ]
            },
            {
                "define": {
                    "en": "to educate somebody in a particular way as they are growing up",
                    "vi": "để giáo dục ai đó theo một cách cụ thể khi họ đang lớn lên"
                },
                "examples": [
                    {
                        "en": "Fear of failure was bred into him at an early age.",
                        "vi": "Nỗi sợ thất bại đã được nuôi dưỡng trong anh ngay từ khi còn nhỏ."
                    }
                ]
            },
            {
                "define": {
                    "en": "born and having grown up in a particular place with a particular background and education",
                    "vi": "sinh ra và lớn lên ở một nơi cụ thể với nền tảng và nền giáo dục cụ thể"
                },
                "examples": [
                    {
                        "en": "He was born and bred in Boston.",
                        "vi": "Anh sinh ra và lớn lên ở Boston."
                    },
                    {
                        "en": "I'm a Londoner, born and bred.",
                        "vi": "Tôi là người London, sinh ra và lớn lên."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have a lot of babies in a short space of time",
                    "vi": "sinh nhiều con trong một khoảng thời gian ngắn"
                },
                "examples": [
                    {
                        "en": "These rodents breed like rabbits.",
                        "vi": "Những loài gặm nhấm này sinh sản giống như thỏ."
                    }
                ]
            },
            {
                "define": {
                    "en": "knowing somebody/something very well may cause you to lose respect for them/it",
                    "vi": "biết rất rõ ai đó / điều gì đó có thể khiến bạn mất đi sự tôn trọng đối với họ / điều đó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "ed1244bdeb5f4288a49c9bd42f34a308",
        "word": "factory farming",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈfæktri fɑːmɪŋ/",
            "us": "/ˈfæktri fɑːrmɪŋ/"
        },
        "nearby": [
            {
                "word": "the Factory Acts",
                "pos": "noun"
            },
            {
                "word": "factory farm",
                "pos": "noun"
            },
            {
                "word": "factory farming",
                "pos": "noun"
            },
            {
                "word": "factory floor",
                "pos": "noun"
            },
            {
                "word": "factory ship",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a method of farming in which animals are kept inside in small spaces and are fed special food so that a large amount of meat, milk, etc. is produced as quickly and cheaply as possible",
                    "vi": "một phương pháp chăn nuôi trong đó động vật được nuôi trong không gian nhỏ và được cho ăn thức ăn đặc biệt để một lượng lớn thịt, sữa, v.v. được sản xuất nhanh nhất và rẻ nhất có thể"
                },
                "examples": [
                    {
                        "en": "the factory farming of beef, pork and chicken",
                        "vi": "nhà máy chăn nuôi thịt bò, thịt lợn và thịt gà"
                    }
                ]
            }
        ]
    },
    {
        "id": "d4726124f6d64d858c6cd2ea63df35a4",
        "word": "intensive",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ɪnˈtensɪv/",
            "us": "/ɪnˈtensɪv/"
        },
        "nearby": [
            {
                "word": "intensify",
                "pos": "verb"
            },
            {
                "word": "intensity",
                "pos": "noun"
            },
            {
                "word": "intensive",
                "pos": "adjective"
            },
            {
                "word": "intensive care",
                "pos": "noun"
            },
            {
                "word": "intensively",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "involving a lot of work or activity done in a short time",
                    "vi": "liên quan đến nhiều công việc hoặc hoạt động được thực hiện trong một thời gian ngắn"
                },
                "examples": [
                    {
                        "en": "an intensive language course",
                        "vi": "một khóa học ngôn ngữ chuyên sâu"
                    },
                    {
                        "en": "two weeks of intensive training",
                        "vi": "hai tuần đào tạo chuyên sâu"
                    },
                    {
                        "en": "intensive diplomatic negotiations",
                        "vi": "đàm phán ngoại giao chuyên sâu"
                    },
                    {
                        "en": "highly intensive courses for business and professional people",
                        "vi": "các khóa học chuyên sâu dành cho doanh nhân và những người chuyên nghiệp"
                    }
                ]
            },
            {
                "define": {
                    "en": "complete and extremely detailed; done with a lot of care",
                    "vi": "đầy đủ và cực kỳ chi tiết; được thực hiện với rất nhiều sự chăm sóc"
                },
                "examples": [
                    {
                        "en": "His disappearance has been the subject of intensive investigation.",
                        "vi": "Sự biến mất của anh ta đã là chủ đề của cuộc điều tra chuyên sâu."
                    }
                ]
            },
            {
                "define": {
                    "en": "aimed at producing as much food as possible using as little land or as little money as possible",
                    "vi": "nhằm mục đích sản xuất nhiều lương thực nhất có thể bằng cách sử dụng càng ít đất hoặc càng ít tiền càng tốt"
                },
                "examples": [
                    {
                        "en": "Traditionally reared animals grow more slowly than those reared under intensive farming conditions.",
                        "vi": "Động vật nuôi theo phương pháp truyền thống tăng trưởng chậm hơn so với vật nuôi được nuôi trong điều kiện thâm canh."
                    },
                    {
                        "en": "intensive agriculture",
                        "vi": "nông nghiệp thâm canh"
                    }
                ]
            }
        ]
    },
    {
        "id": "2347845f454c425e9b886ed62960bece",
        "word": "livestock",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈlaɪvstɒk/",
            "us": "/ˈlaɪvstɑːk/"
        },
        "nearby": [
            {
                "word": "livery yard",
                "pos": "noun"
            },
            {
                "word": "lives",
                "pos": "noun"
            },
            {
                "word": "livestock",
                "pos": "noun"
            },
            {
                "word": "live stream",
                "pos": "noun"
            },
            {
                "word": "live-stream",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the animals kept on a farm, for example cows or sheep",
                    "vi": "động vật được nuôi trong trang trại, ví dụ như bò hoặc cừu"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c3a066af3a5c44c2b4c42a7f60aa48f4",
        "word": "milking",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈmɪlkɪŋ/",
            "us": "/ˈmɪlkɪŋ/"
        },
        "nearby": [
            {
                "word": "milk chocolate",
                "pos": "noun"
            },
            {
                "word": "milk float",
                "pos": "noun"
            },
            {
                "word": "milking",
                "pos": "noun"
            },
            {
                "word": "milkmaid",
                "pos": "noun"
            },
            {
                "word": "milkman",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the process of taking milk from a cow, etc.",
                    "vi": "quy trình lấy sữa từ bò, v.v."
                },
                "examples": [
                    {
                        "en": "to do the milking",
                        "vi": "vắt sữa"
                    },
                    {
                        "en": "milking machines/sheds",
                        "vi": "máy vắt sữa / nhà kho"
                    }
                ]
            }
        ]
    },
    {
        "id": "65668a9199cf4e90b4491ed5e67ef946",
        "word": "raise",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/reɪz/",
            "us": "/reɪz/"
        },
        "nearby": [
            {
                "word": "rainwear",
                "pos": "noun"
            },
            {
                "word": "rainy",
                "pos": "adjective"
            },
            {
                "word": "raise",
                "pos": "verb"
            },
            {
                "word": "raise",
                "pos": "noun"
            },
            {
                "word": "raised",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to lift or move something to a higher level",
                    "vi": "để nâng hoặc di chuyển thứ gì đó lên cấp độ cao hơn"
                },
                "examples": [
                    {
                        "en": "She raised the gun and fired.",
                        "vi": "Cô ta nâng súng lên và bắn."
                    },
                    {
                        "en": "He raised a hand in greeting.",
                        "vi": "Anh giơ tay chào."
                    },
                    {
                        "en": "She raised her eyes from her work.",
                        "vi": "Cô ấy ngước mắt lên khỏi công việc của mình."
                    },
                    {
                        "en": "raise something up He slowly raised his head up.",
                        "vi": "nâng một cái gì đó lên Anh ta từ từ ngẩng đầu lên."
                    }
                ]
            },
            {
                "define": {
                    "en": "to move somebody/something/yourself to a standing, sitting or vertical position",
                    "vi": "để di chuyển ai đó / cái gì đó / bạn đến vị trí đứng, ngồi hoặc thẳng đứng"
                },
                "examples": [
                    {
                        "en": "raise somebody/something/yourself + adv./prep. Somehow we managed to raise her to her feet.",
                        "vi": "nâng cao ai đó / cái gì đó / chính mình + adv./prep. Bằng cách nào đó, chúng tôi đã cố gắng nâng cô ấy lên được."
                    },
                    {
                        "en": "He raised himself up on one elbow.",
                        "vi": "Anh ta nâng người lên bằng một khuỷu tay."
                    },
                    {
                        "en": "raise somebody/something The security man raised the barrier for me.",
                        "vi": "nâng cao ai đó / cái gì đó Người đàn ông an ninh đã nâng rào cản cho tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to increase the amount or level of something",
                    "vi": "để tăng số lượng hoặc mức độ của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "raise something to raise prices/taxes",
                        "vi": "tăng một cái gì đó để tăng giá / thuế"
                    },
                    {
                        "en": "We need to raise public awareness of the issue.",
                        "vi": "Chúng ta cần nâng cao nhận thức của cộng đồng về vấn đề này."
                    },
                    {
                        "en": "How can we raise standards in schools?",
                        "vi": "Làm thế nào chúng ta có thể nâng cao tiêu chuẩn trong trường học?"
                    },
                    {
                        "en": "raise something to something They raised their offer to $500.",
                        "vi": "nâng một cái gì đó lên một cái gì đó Họ đã tăng đề nghị của họ lên 500 đô la."
                    },
                    {
                        "en": "Don't tell her about the job until you know for sure—we don't want to raise her hopes (= make her hope too much).",
                        "vi": "Đừng nói với cô ấy về công việc cho đến khi bạn biết chắc chắn — chúng tôi không muốn cô ấy nuôi hy vọng (= khiến cô ấy hy vọng quá nhiều)."
                    },
                    {
                        "en": "I've never heard him even raise his voice (= speak louder because he was angry).",
                        "vi": "Tôi chưa bao giờ nghe thấy anh ấy thậm chí lớn giọng (= nói to hơn vì anh ấy tức giận)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to bring or collect money or people together; to manage to get or form something",
                    "vi": "để mang hoặc thu tiền hoặc người với nhau; quản lý để có được hoặc hình thành một cái gì đó"
                },
                "examples": [
                    {
                        "en": "We are raising money for charity.",
                        "vi": "Chúng tôi đang gây quỹ từ thiện."
                    },
                    {
                        "en": "They are holding a quiz to help raise funds for the club.",
                        "vi": "Họ đang tổ chức một cuộc kiểm tra để giúp gây quỹ cho câu lạc bộ."
                    },
                    {
                        "en": "The event raised over £30 000 for cancer research.",
                        "vi": "Sự kiện đã quyên góp được hơn £ 30 000 cho nghiên cứu ung thư."
                    },
                    {
                        "en": "He set about raising an army.",
                        "vi": "Anh ta bắt đầu xây dựng một đội quân."
                    }
                ]
            },
            {
                "define": {
                    "en": "to mention something for people to discuss or somebody to deal with",
                    "vi": "đề cập đến điều gì đó để mọi người thảo luận hoặc ai đó giải quyết"
                },
                "examples": [
                    {
                        "en": "The book raises many important questions.",
                        "vi": "Cuốn sách đặt ra nhiều câu hỏi quan trọng."
                    },
                    {
                        "en": "I'm glad you raised the subject of money.",
                        "vi": "Tôi rất vui vì bạn đã nêu ra chủ đề về tiền bạc."
                    },
                    {
                        "en": "I have raised this issue with the environmental health office.",
                        "vi": "Tôi đã nêu vấn đề này với văn phòng sức khỏe môi trường."
                    },
                    {
                        "en": "Local residents have raised concerns about late-night noise.",
                        "vi": "Cư dân địa phương đã đưa ra lo ngại về tiếng ồn vào đêm khuya."
                    },
                    {
                        "en": "You raise some interesting points.",
                        "vi": "Bạn nêu ra một số điểm thú vị."
                    }
                ]
            },
            {
                "define": {
                    "en": "to cause or produce a feeling or reaction",
                    "vi": "để gây ra hoặc tạo ra cảm giác hoặc phản ứng"
                },
                "examples": [
                    {
                        "en": "to raise doubts in people’s minds",
                        "vi": "làm dấy lên những nghi ngờ trong tâm trí mọi người"
                    },
                    {
                        "en": "The plans for the new development have raised angry protests from local residents.",
                        "vi": "Các kế hoạch cho sự phát triển mới đã làm dấy lên phản đối giận dữ từ cư dân địa phương."
                    },
                    {
                        "en": "It wasn't an easy audience but he raised a laugh with his joke.",
                        "vi": "Đó không phải là một khán giả dễ tính nhưng anh ấy đã gây cười với trò đùa của mình."
                    },
                    {
                        "en": "It had been a difficult day but she managed to raise a smile.",
                        "vi": "Đó là một ngày khó khăn nhưng cô ấy đã cố gắng nở một nụ cười."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make something happen or appear",
                    "vi": "để làm cho một cái gì đó xảy ra hoặc xuất hiện"
                },
                "examples": [
                    {
                        "en": "She raised the alarm when he failed to return home.",
                        "vi": "Cô đã báo động khi anh không thể trở về nhà."
                    },
                    {
                        "en": "The horses' hooves raised a cloud of dust.",
                        "vi": "Vó ngựa nổi lên một đám bụi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to care for a child or young animal until it is able to take care of itself",
                    "vi": "chăm sóc trẻ em hoặc động vật non cho đến khi nó có thể tự chăm sóc"
                },
                "examples": [
                    {
                        "en": "raise somebody/something She raised five children on her own.",
                        "vi": "raise somebody / something Cô ấy đã nuôi năm đứa con một mình."
                    },
                    {
                        "en": "They were both raised in the South.",
                        "vi": "Cả hai đều lớn lên ở miền Nam."
                    },
                    {
                        "en": "kids raised on a diet of hamburgers",
                        "vi": "những đứa trẻ được nuôi dưỡng bằng chế độ ăn kiêng bánh mì kẹp thịt"
                    },
                    {
                        "en": "raise somebody/something (as) something They raised her (as) a Catholic.",
                        "vi": "raise somebody / something (as) something Họ đã nuôi dạy cô ấy (với tư cách) là một người Công giáo."
                    },
                    {
                        "en": "I was born and raised a city boy.",
                        "vi": "Tôi sinh ra và lớn lên là một cậu bé thành phố."
                    }
                ]
            },
            {
                "define": {
                    "en": "to breed (= keep and produce young from) particular farm animals; to grow particular crops",
                    "vi": "để lai tạo (= giữ và sản xuất con non từ) các động vật nông trại cụ thể; để trồng các loại cây trồng cụ thể"
                },
                "examples": [
                    {
                        "en": "Farmers cleared the land in order to raise cattle.",
                        "vi": "Nông dân khai khẩn đất đai để chăn nuôi gia súc."
                    },
                    {
                        "en": "They raise corn, soybeans and alfalfa on 460 acres.",
                        "vi": "Họ trồng ngô, đậu nành và cỏ linh lăng trên 460 mẫu Anh."
                    }
                ]
            },
            {
                "define": {
                    "en": "to end the limits on somebody/something",
                    "vi": "để chấm dứt giới hạn đối với ai đó / điều gì đó"
                },
                "examples": [
                    {
                        "en": "to raise a blockade/ban/siege",
                        "vi": "để tăng cường phong tỏa / cấm / bao vây"
                    }
                ]
            },
            {
                "define": {
                    "en": "to contact somebody and speak to them by radio or phone",
                    "vi": "liên hệ với ai đó và nói chuyện với họ qua radio hoặc điện thoại"
                },
                "examples": [
                    {
                        "en": "We managed to raise him on his mobile phone.",
                        "vi": "Chúng tôi đã cố gắng nâng cao anh ấy trên điện thoại di động của anh ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody who has died come to life again",
                    "vi": "để làm cho ai đó đã chết sống lại"
                },
                "examples": [
                    {
                        "en": "Christians believe that God raised Jesus from the dead.",
                        "vi": "Cơ đốc nhân tin rằng Đức Chúa Trời đã làm cho Chúa Giê-su sống lại từ cõi chết."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make a higher bet than another player in a card game",
                    "vi": "đặt cược cao hơn người chơi khác trong trò chơi bài"
                },
                "examples": [
                    {
                        "en": "I'll raise you another hundred dollars.",
                        "vi": "Tôi sẽ tăng cho bạn một trăm đô la nữa."
                    }
                ]
            },
            {
                "define": {
                    "en": "to multiply an amount by itself a particular number of times",
                    "vi": "nhân một số tiền với chính nó một số lần cụ thể"
                },
                "examples": [
                    {
                        "en": "3 raised to the power of 3 is 27 (= 3 × 3 × 3).",
                        "vi": "3 được nâng lên lũy thừa của 3 là 27 (= 3 × 3 × 3)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to build something",
                    "vi": "để xây dựng một cái gì đó"
                },
                "examples": [
                    {
                        "en": "Our priority will be to raise a boundary wall and prevent trespassing.",
                        "vi": "Ưu tiên của chúng tôi sẽ là xây dựng một bức tường ranh giới và ngăn chặn sự xâm phạm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to create a document such as an invoice or a petition",
                    "vi": "để tạo một tài liệu như hóa đơn hoặc đơn thỉnh cầu"
                },
                "examples": [
                    {
                        "en": "They have been raising a petition against the war.",
                        "vi": "Họ đã đưa ra một bản kiến nghị phản đối chiến tranh."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody angry",
                    "vi": "làm cho ai đó tức giận"
                },
                "examples": [
                    {
                        "en": "Her controversial article is bound to raise hackles.",
                        "vi": "Bài báo gây tranh cãi của cô ấy chắc chắn sẽ làm dấy lên những lời dị nghị."
                    }
                ]
            },
            {
                "define": {
                    "en": "to do nothing to help somebody",
                    "vi": "không làm gì để giúp ai đó"
                },
                "examples": [
                    {
                        "en": "The children never lift a finger to help around the house.",
                        "vi": "Những đứa trẻ không bao giờ nhấc một ngón tay để giúp đỡ xung quanh nhà."
                    }
                ]
            },
            {
                "define": {
                    "en": "to do nothing to help somebody",
                    "vi": "không làm gì để giúp ai đó"
                },
                "examples": [
                    {
                        "en": "The children never raised a finger to help around the house.",
                        "vi": "Những đứa trẻ không bao giờ giơ một ngón tay lên để giúp đỡ xung quanh nhà."
                    }
                ]
            },
            {
                "define": {
                    "en": "to increase the level of something, especially your demands or the risks in a situation",
                    "vi": "để nâng cao mức độ của điều gì đó, đặc biệt là nhu cầu của bạn hoặc rủi ro trong một tình huống"
                },
                "examples": [
                    {
                        "en": "This year tournament organizers have upped the ante by offering record prize money for the top two teams.",
                        "vi": "Các nhà tổ chức giải đấu năm nay đã nâng cao thành tích bằng cách đưa ra số tiền thưởng kỷ lục cho hai đội đứng đầu."
                    }
                ]
            },
            {
                "define": {
                    "en": "to set a new, higher standard of quality or performance",
                    "vi": "để thiết lập một tiêu chuẩn mới, cao hơn về chất lượng hoặc hiệu suất"
                },
                "examples": [
                    {
                        "en": "The factory has raised the bar on productivity, food safety and quality.",
                        "vi": "Nhà máy đã nâng cao năng suất, chất lượng vệ sinh an toàn thực phẩm."
                    },
                    {
                        "en": "This latest computer game raises the bar for interface design.",
                        "vi": "Trò chơi máy tính mới nhất này nâng cao tiêu chuẩn cho thiết kế giao diện."
                    },
                    {
                        "en": "The awards go to people who have truly raised the bar.",
                        "vi": "Giải thưởng sẽ được trao cho những người đã thực sự nâng tầm."
                    },
                    {
                        "en": "Perhaps the new admission requirements raised the bar too high.",
                        "vi": "Có lẽ các yêu cầu nhập học mới đã nâng mức quá cao."
                    }
                ]
            },
            {
                "define": {
                    "en": "to show that you think something is bad or are surprised by something",
                    "vi": "để thể hiện rằng bạn nghĩ điều gì đó tồi tệ hoặc đang ngạc nhiên trước điều gì đó"
                },
                "examples": [
                    {
                        "en": "Eyebrows were raised when he arrived without his wife.",
                        "vi": "Lông mày nhướng lên khi anh đến mà không có vợ đi cùng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to hold up your glass and wish somebody happiness, good luck, etc. before you drink",
                    "vi": "nâng ly và chúc ai đó hạnh phúc, may mắn, v.v. trước khi uống"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to hit or threaten to hit somebody",
                    "vi": "đánh hoặc đe dọa đánh ai đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to protest angrily, especially in a way that causes trouble for somebody",
                    "vi": "phản đối một cách giận dữ, đặc biệt là theo cách gây rắc rối cho ai đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to produce or make somebody produce a lot of noise in a building, for example by shouting or cheering",
                    "vi": "để tạo ra hoặc khiến ai đó tạo ra nhiều tiếng ồn trong một tòa nhà, chẳng hạn như bằng cách la hét hoặc cổ vũ"
                },
                "examples": [
                    {
                        "en": "Their cheers raised the roof.",
                        "vi": "Tiếng hò reo của họ đã nâng nóc nhà."
                    }
                ]
            },
            {
                "define": {
                    "en": "to expect more/less from a situation",
                    "vi": "mong đợi nhiều hơn / ít hơn từ một tình huống"
                },
                "examples": [
                    {
                        "en": "If they can’t afford such a big house, they’ll just have to lower their sights a little.",
                        "vi": "Nếu họ không đủ khả năng mua một ngôi nhà lớn như vậy, họ sẽ phải hạ thấp tầm nhìn của mình một chút."
                    },
                    {
                        "en": "After failing to get into university, he lowered his sights and got a job in a shop.",
                        "vi": "Sau khi không vào được đại học, anh ta hạ thấp tầm nhìn và kiếm việc làm trong một cửa hàng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody feel more cheerful or brave",
                    "vi": "để làm cho ai đó cảm thấy vui vẻ hoặc dũng cảm hơn"
                },
                "examples": [
                    {
                        "en": "The sunny weather raised my spirits a little.",
                        "vi": "Thời tiết nắng đẹp làm tinh thần tôi phấn chấn hơn một chút."
                    }
                ]
            },
            {
                "define": {
                    "en": "to increase/decrease the amount of excitement, emotion, etc. in a situation",
                    "vi": "để tăng / giảm mức độ phấn khích, cảm xúc, v.v. trong một tình huống"
                },
                "examples": [
                    {
                        "en": "His angry refusal to agree raised the temperature of the meeting.",
                        "vi": "Việc anh giận dữ từ chối đồng ý đã làm tăng nhiệt độ của cuộc họp."
                    },
                    {
                        "en": "The government tried to lower the political temperature by agreeing to some of the demands.",
                        "vi": "Chính phủ đã cố gắng hạ nhiệt độ chính trị bằng cách đồng ý với một số yêu cầu."
                    }
                ]
            },
            {
                "define": {
                    "en": "if something unpleasant rears its head or rears its ugly head, it appears or happens",
                    "vi": "nếu một cái gì đó khó chịu dựng lên đầu nó hoặc che cái đầu xấu xí của nó, nó sẽ xuất hiện hoặc xảy ra"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "78ffaf4424304fe39cf9fe64c377eba1",
        "word": "abattoir",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈæbətwɑː(r)/",
            "us": "/ˈæbətwɑːr/"
        },
        "nearby": [
            {
                "word": "abate",
                "pos": "verb"
            },
            {
                "word": "abatement",
                "pos": "noun"
            },
            {
                "word": "abattoir",
                "pos": "noun"
            },
            {
                "word": "abaya",
                "pos": "noun"
            },
            {
                "word": "abba",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a building where animals are killed for food",
                    "vi": "một tòa nhà nơi động vật bị giết để làm thức ăn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "f96fca6965564659bedf4710655db74d",
        "word": "battery",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbætri/",
            "us": "/ˈbætəri/"
        },
        "nearby": [
            {
                "word": "Battersea Dogs & Cats Home",
                "pos": ""
            },
            {
                "word": "Battersea Power Station",
                "pos": ""
            },
            {
                "word": "battery",
                "pos": "noun"
            },
            {
                "word": "battery farm",
                "pos": "noun"
            },
            {
                "word": "battery farming",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a device that is placed inside a car engine, clock, radio, etc. and that produces the electricity that makes it work",
                    "vi": "một thiết bị được đặt bên trong động cơ ô tô, đồng hồ, radio, v.v. và tạo ra điện để làm cho nó hoạt động"
                },
                "examples": [
                    {
                        "en": "to replace the batteries",
                        "vi": "thay pin"
                    },
                    {
                        "en": "a rechargeable battery",
                        "vi": "pin có thể sạc lại"
                    },
                    {
                        "en": "battery-powered/-operated",
                        "vi": "chạy bằng pin / vận hành"
                    },
                    {
                        "en": "a car battery",
                        "vi": "ắc quy ô tô"
                    },
                    {
                        "en": "The battery is flat (= it is no longer producing electricity).",
                        "vi": "Pin bị chai (= nó không còn sản xuất điện nữa)."
                    },
                    {
                        "en": "With our product you get longer battery life.",
                        "vi": "Với sản phẩm của chúng tôi, bạn sẽ có thời lượng pin lâu hơn."
                    },
                    {
                        "en": "The bicycle even has a built-in battery charger for a mobile phone.",
                        "vi": "Chiếc xe đạp thậm chí còn được tích hợp bộ sạc pin cho điện thoại di động."
                    },
                    {
                        "en": "Isolated farms used wind turbines to charge batteries.",
                        "vi": "Các trang trại biệt lập đã sử dụng tuabin gió để sạc pin."
                    },
                    {
                        "en": "a lithium/AA battery",
                        "vi": "một pin lithium / AA"
                    }
                ]
            },
            {
                "define": {
                    "en": "electrical power that comes from a battery",
                    "vi": "năng lượng điện đến từ pin"
                },
                "examples": [
                    {
                        "en": "My phone ran out of battery, so I plugged it in to charge.",
                        "vi": "Điện thoại của tôi hết pin nên tôi cắm sạc."
                    },
                    {
                        "en": "The display tells you how much battery is left.",
                        "vi": "Màn hình cho bạn biết lượng pin còn lại."
                    }
                ]
            },
            {
                "define": {
                    "en": "a large number of things or people of the same type",
                    "vi": "một số lượng lớn những thứ hoặc những người cùng loại"
                },
                "examples": [
                    {
                        "en": "He faced a battery of questions.",
                        "vi": "Anh ta phải đối mặt với một loạt câu hỏi."
                    },
                    {
                        "en": "a battery of reporters",
                        "vi": "một loạt phóng viên"
                    }
                ]
            },
            {
                "define": {
                    "en": "a number of large guns that are used together",
                    "vi": "một số loại súng lớn được sử dụng cùng nhau"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a large number of small cages that are joined together and are used for keeping chickens, etc. in on a farm",
                    "vi": "một số lượng lớn các lồng nhỏ được ghép lại với nhau và được sử dụng để nuôi gà, v.v. trong một trang trại"
                },
                "examples": [
                    {
                        "en": "a battery hen",
                        "vi": "một con gà mái pin"
                    },
                    {
                        "en": "battery eggs",
                        "vi": "trứng pin"
                    },
                    {
                        "en": "intensive battery farming methods",
                        "vi": "phương pháp thâm canh pin"
                    }
                ]
            },
            {
                "define": {
                    "en": "the crime of attacking somebody physically",
                    "vi": "tội tấn công ai đó về thể chất"
                },
                "examples": [
                    {
                        "en": "He was charged with battery after a fight at a night club.",
                        "vi": "Anh ta đã bị sạc pin sau khi đánh nhau tại một câu lạc bộ đêm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to get back your strength and energy by resting for a while",
                    "vi": "để lấy lại sức lực và năng lượng của bạn bằng cách nghỉ ngơi một lúc"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "0033d93e55d8492dafbaf0b4b4e7463a",
        "word": "battery farm",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbætri fɑːm/",
            "us": "/ˈbætəri fɑːrm/"
        },
        "nearby": [
            {
                "word": "Battersea Power Station",
                "pos": ""
            },
            {
                "word": "battery",
                "pos": "noun"
            },
            {
                "word": "battery farm",
                "pos": "noun"
            },
            {
                "word": "battery farming",
                "pos": "noun"
            },
            {
                "word": "Battery Park",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a farm where large numbers of chickens or other animals are kept in very small cages or crowded conditions",
                    "vi": "một trang trại nơi số lượng lớn gà hoặc các động vật khác được nuôi trong những lồng rất nhỏ hoặc trong điều kiện đông đúc"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "1593349be45c4d9ebba597b322632a37",
        "word": "brand",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/brænd/",
            "us": "/brænd/"
        },
        "nearby": [
            {
                "word": "branch off",
                "pos": "phrasal verb"
            },
            {
                "word": "branch out",
                "pos": "phrasal verb"
            },
            {
                "word": "brand",
                "pos": "noun"
            },
            {
                "word": "Max Brand",
                "pos": ""
            },
            {
                "word": "brand",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a type of product, service, etc. made or offered by a particular company under a particular name",
                    "vi": "một loại sản phẩm, dịch vụ, v.v. được sản xuất hoặc cung cấp bởi một công ty cụ thể dưới một tên cụ thể"
                },
                "examples": [
                    {
                        "en": "a well-known brand of toothpaste",
                        "vi": "một nhãn hiệu kem đánh răng nổi tiếng"
                    },
                    {
                        "en": "(British English) You pay less for the supermarket's own brand.",
                        "vi": "(Tiếng Anh Anh) Bạn trả ít hơn cho thương hiệu riêng của siêu thị."
                    },
                    {
                        "en": "(North American English) You pay less for the store brand.",
                        "vi": "(Tiếng Anh Bắc Mỹ) Bạn trả ít hơn cho thương hiệu cửa hàng."
                    },
                    {
                        "en": "luxury/premium brands",
                        "vi": "thương hiệu cao cấp / cao cấp"
                    },
                    {
                        "en": "We compared our product with the leading brands.",
                        "vi": "Chúng tôi đã so sánh sản phẩm của mình với các thương hiệu hàng đầu."
                    },
                    {
                        "en": "How can we build our brand?",
                        "vi": "Làm thế nào chúng ta có thể xây dựng thương hiệu của mình?"
                    },
                    {
                        "en": "brand loyalty (= when customers continue buying the same brand)",
                        "vi": "lòng trung thành với thương hiệu (= khi khách hàng tiếp tục mua cùng một thương hiệu)"
                    },
                    {
                        "en": "brand awareness/recognition",
                        "vi": "nhận biết / công nhận thương hiệu"
                    },
                    {
                        "en": "brand image/values",
                        "vi": "hình ảnh / giá trị thương hiệu"
                    }
                ]
            },
            {
                "define": {
                    "en": "a particular type or kind of something",
                    "vi": "một loại cụ thể hoặc một cái gì đó"
                },
                "examples": [
                    {
                        "en": "an unorthodox brand of humour",
                        "vi": "một thương hiệu hài hước không chính thống"
                    },
                    {
                        "en": "I don’t think Bertha would appreciate your particular brand of sympathy.",
                        "vi": "Tôi không nghĩ Bertha sẽ đánh giá cao thương hiệu thông cảm cụ thể của bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a mark made with a piece of hot metal, especially on farm animals to show who owns them",
                    "vi": "một dấu hiệu được làm bằng một mảnh kim loại nóng, đặc biệt là trên động vật trang trại để cho biết ai sở hữu chúng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "66e612d12838433a807008c597568c2f",
        "word": "butcher",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbʊtʃə(r)/",
            "us": "/ˈbʊtʃər/"
        },
        "nearby": [
            {
                "word": "butch",
                "pos": "adjective"
            },
            {
                "word": "butcher",
                "pos": "noun"
            },
            {
                "word": "butcher",
                "pos": "verb"
            },
            {
                "word": "butcher block",
                "pos": "noun"
            },
            {
                "word": "butcher's block",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to kill people in a very cruel and violent way",
                    "vi": "giết người một cách rất dã man và bạo lực"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to kill animals and cut them up for use as meat",
                    "vi": "giết động vật và xẻ thịt để làm thịt"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to make something less good or successful by doing it very badly",
                    "vi": "làm điều gì đó kém tốt hơn hoặc thành công bằng cách làm điều đó rất tệ"
                },
                "examples": [
                    {
                        "en": "The script was good, but those guys butchered it.",
                        "vi": "Kịch bản rất hay, nhưng những kẻ đó đã mổ xẻ nó."
                    }
                ]
            }
        ]
    },
    {
        "id": "ecb4290b41e94577ba8080847a309bc5",
        "word": "carcass",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkɑːkəs/",
            "us": "/ˈkɑːrkəs/"
        },
        "nearby": [
            {
                "word": "carburettor",
                "pos": "noun"
            },
            {
                "word": "carburize",
                "pos": "verb"
            },
            {
                "word": "carcass",
                "pos": "noun"
            },
            {
                "word": "carcinogen",
                "pos": "noun"
            },
            {
                "word": "carcinogenic",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the dead body of an animal, especially of a large one or of one that is ready for cutting up as meat",
                    "vi": "xác chết của một con vật, đặc biệt là một con lớn hoặc một con đã sẵn sàng để xẻ thịt làm thịt"
                },
                "examples": [
                    {
                        "en": "vultures scavenging for carcasses on the road",
                        "vi": "kền kền nhặt xác trên đường"
                    },
                    {
                        "en": "She boiled up the chicken carcass (= the bones of a cooked chicken) to make soup.",
                        "vi": "Cô ấy luộc xác gà (= xương của một con gà đã được nấu chín) để làm súp."
                    }
                ]
            }
        ]
    },
    {
        "id": "0c8b7f6e58794232829bd5560b8eefbc",
        "word": "castrate",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/kæˈstreɪt/",
            "us": "/ˈkæstreɪt/"
        },
        "nearby": [
            {
                "word": "castor sugar",
                "pos": "noun"
            },
            {
                "word": "cast out",
                "pos": "phrasal verb"
            },
            {
                "word": "castrate",
                "pos": "verb"
            },
            {
                "word": "castration",
                "pos": "noun"
            },
            {
                "word": "casual",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to remove the testicles of a male animal or person",
                    "vi": "cắt bỏ tinh hoàn của động vật đực hoặc người"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "3af0d4bbbef64b42802d61e387229080",
        "word": "castration",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/kæˈstreɪʃn/",
            "us": "/kæˈstreɪʃn/"
        },
        "nearby": [
            {
                "word": "cast out",
                "pos": "phrasal verb"
            },
            {
                "word": "castrate",
                "pos": "verb"
            },
            {
                "word": "castration",
                "pos": "noun"
            },
            {
                "word": "casual",
                "pos": "adjective"
            },
            {
                "word": "casual",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act of removing the testicles of a male animal or person",
                    "vi": "Hành động cắt bỏ tinh hoàn của động vật hoặc người đực"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "0a7dcd37965e430c94c54b91f1211647",
        "word": "fatten",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈfætn/",
            "us": "/ˈfætn/"
        },
        "nearby": [
            {
                "word": "fat shaming",
                "pos": "noun"
            },
            {
                "word": "fatso",
                "pos": "noun"
            },
            {
                "word": "fatten",
                "pos": "verb"
            },
            {
                "word": "fattening",
                "pos": "adjective"
            },
            {
                "word": "fattism",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to make somebody/something fatter, especially an animal before killing it for food; to become fatter",
                    "vi": "để làm cho ai đó / cái gì đó béo hơn, đặc biệt là một con vật trước khi giết nó để làm thực phẩm; trở nên béo hơn"
                },
                "examples": [
                    {
                        "en": "The piglets are taken from the sow to be fattened for market.",
                        "vi": "Lợn con được lấy ra từ lợn nái để vỗ béo bán ra thị trường."
                    },
                    {
                        "en": "She's very thin after her illness—but we'll soon fatten her up.",
                        "vi": "Cô ấy rất gầy sau khi ốm - nhưng chúng tôi sẽ sớm vỗ béo cho cô ấy."
                    }
                ]
            }
        ]
    },
    {
        "id": "2897f5e9ff49447bb3f4a3d959a03f1e",
        "word": "fodder",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈfɒdə(r)/",
            "us": "/ˈfɑːdər/"
        },
        "nearby": [
            {
                "word": "focus group",
                "pos": "noun"
            },
            {
                "word": "focus puller",
                "pos": "noun"
            },
            {
                "word": "fodder",
                "pos": "noun"
            },
            {
                "word": "foe",
                "pos": "noun"
            },
            {
                "word": "foehn",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "food for horses and farm animals",
                    "vi": "thức ăn cho ngựa và động vật trang trại"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "people or things that are considered to have only one use",
                    "vi": "những người hoặc những thứ được coi là chỉ có một công dụng"
                },
                "examples": [
                    {
                        "en": "Without education, these children will end up as factory fodder (= only able to work in a factory).",
                        "vi": "Nếu không được học hành, những đứa trẻ này sẽ trở thành thức ăn cho gia đình (= chỉ có thể làm việc trong một nhà máy)."
                    },
                    {
                        "en": "This story will be more fodder for the gossip columnists.",
                        "vi": "Câu chuyện này sẽ là thức ăn ngon hơn cho những người phụ trách chuyên mục buôn chuyện."
                    },
                    {
                        "en": "He regarded lists of rules, regulations and procedures as dustbin fodder (= only fit to be thrown away).",
                        "vi": "Ông coi danh sách các quy tắc, quy định và thủ tục như một thùng rác (= chỉ phù hợp để vứt đi)."
                    }
                ]
            }
        ]
    },
    {
        "id": "31ea124132424aef9bf67620a44bcf7c",
        "word": "foot-and-mouth disease",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌfʊt ən ˈmaʊθ dɪziːz/",
            "us": "/ˌfʊt ən ˈmaʊθ dɪziːz/"
        },
        "nearby": [
            {
                "word": "foot",
                "pos": "verb"
            },
            {
                "word": "footage",
                "pos": "noun"
            },
            {
                "word": "foot-and-mouth disease",
                "pos": "noun"
            },
            {
                "word": "football",
                "pos": "noun"
            },
            {
                "word": "the Football Association",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a disease of cows, sheep, etc., that causes painful places on the mouth and feet",
                    "vi": "bệnh của bò, cừu, v.v. gây đau ở miệng và bàn chân"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "991af3c001c1446083f5ac2fbb5e91b0",
        "word": "free-range",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌfriː ˈreɪndʒ/",
            "us": "/ˌfriː ˈreɪndʒ/"
        },
        "nearby": [
            {
                "word": "Freepost",
                "pos": "noun"
            },
            {
                "word": "free radical",
                "pos": "noun"
            },
            {
                "word": "free-range",
                "pos": "adjective"
            },
            {
                "word": "free-range",
                "pos": "adverb"
            },
            {
                "word": "freeride",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "connected with a system of farming in which animals are kept in natural conditions and can move around freely",
                    "vi": "kết nối với một hệ thống canh tác trong đó động vật được nuôi trong điều kiện tự nhiên và có thể di chuyển tự do"
                },
                "examples": [
                    {
                        "en": "free-range chickens",
                        "vi": "gà thả rông"
                    },
                    {
                        "en": "free-range eggs",
                        "vi": "trứng thả rông"
                    }
                ]
            }
        ]
    },
    {
        "id": "a89aa454f2f64019887eaf4e092f491e",
        "word": "graze",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ɡreɪz/",
            "us": "/ɡreɪz/"
        },
        "nearby": [
            {
                "word": "grayscale",
                "pos": "noun"
            },
            {
                "word": "Gray's Elegy",
                "pos": ""
            },
            {
                "word": "graze",
                "pos": "verb"
            },
            {
                "word": "graze",
                "pos": "noun"
            },
            {
                "word": "grazier",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to eat grass that is growing in a field",
                    "vi": "ăn cỏ đang mọc trên cánh đồng"
                },
                "examples": [
                    {
                        "en": "There were cows grazing beside the river.",
                        "vi": "Có những con bò đang gặm cỏ bên sông."
                    },
                    {
                        "en": "graze on something The horses were grazing on the lush grass.",
                        "vi": "gặm cỏ trên một cái gì đó Những con ngựa đang gặm cỏ trên bãi cỏ tươi tốt."
                    },
                    {
                        "en": "graze something The field had been grazed by sheep.",
                        "vi": "chăn thả một cái gì đó Cánh đồng đã được chăn thả bởi những con cừu."
                    }
                ]
            },
            {
                "define": {
                    "en": "to put cows, sheep, etc. in a field so that they can eat the grass there",
                    "vi": "đưa bò, cừu, v.v. vào một cánh đồng để chúng có thể ăn cỏ ở đó"
                },
                "examples": [
                    {
                        "en": "The land is used by local people to graze their animals.",
                        "vi": "Đất được người dân địa phương sử dụng để chăn thả gia súc của họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to eat small amounts of food many times during the day, often while doing other things, instead of eating three meals",
                    "vi": "ăn một lượng nhỏ thức ăn nhiều lần trong ngày, thường xuyên khi đang làm việc khác, thay vì ăn ba bữa"
                },
                "examples": [
                    {
                        "en": "I have this really bad habit of grazing on junk food.",
                        "vi": "Tôi có một thói quen xấu là gặm đồ ăn vặt."
                    },
                    {
                        "en": "Some patients find it better to graze, eating lots of small snacks throughout the day.",
                        "vi": "Một số bệnh nhân thấy tốt hơn nên chăn thả, ăn nhiều đồ ăn nhẹ trong ngày."
                    },
                    {
                        "en": "Grazing is becoming the American way of eating.",
                        "vi": "Chăn thả đang trở thành cách ăn uống của người Mỹ."
                    },
                    {
                        "en": "Food grazing can lead to obesity.",
                        "vi": "Thức ăn chăn thả có thể dẫn đến béo phì."
                    }
                ]
            },
            {
                "define": {
                    "en": "to break the surface of your skin by rubbing it against something rough",
                    "vi": "để phá vỡ bề mặt da của bạn bằng cách cọ xát nó với một thứ gì đó thô ráp"
                },
                "examples": [
                    {
                        "en": "I fell and grazed my knee.",
                        "vi": "Tôi bị ngã và sượt qua đầu gối."
                    },
                    {
                        "en": "He grazed his elbow on a sharp piece of rock.",
                        "vi": "Anh ta sượt qua khuỷu tay của mình trên một mảnh đá sắc nhọn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to touch something lightly while passing it",
                    "vi": "chạm nhẹ vào một cái gì đó trong khi đi qua nó"
                },
                "examples": [
                    {
                        "en": "The bullet grazed his cheek.",
                        "vi": "Viên đạn sượt qua má anh."
                    },
                    {
                        "en": "The bullet only grazed his shoulder.",
                        "vi": "Viên đạn chỉ sượt qua vai anh."
                    }
                ]
            }
        ]
    },
    {
        "id": "10e2d20366c548ae919f5970d03b3b41",
        "word": "herd",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/hɜːd/",
            "us": "/hɜːrd/"
        },
        "nearby": [
            {
                "word": "Herculean",
                "pos": "adjective"
            },
            {
                "word": "herd",
                "pos": "noun"
            },
            {
                "word": "herd",
                "pos": "verb"
            },
            {
                "word": "herder",
                "pos": "noun"
            },
            {
                "word": "herd immunity",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to move or make somebody/something move in a particular direction",
                    "vi": "để di chuyển hoặc làm cho ai đó / cái gì đó di chuyển theo một hướng cụ thể"
                },
                "examples": [
                    {
                        "en": "+ adv./prep. We all herded on to the bus.",
                        "vi": "Err:509"
                    },
                    {
                        "en": "herd somebody/something + adv./prep. They were herded together into trucks and driven away.",
                        "vi": "bầy đàn ai đó / cái gì đó + adv./prep. Chúng được dồn vào xe tải và lái đi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to keep or look after a group of animals; to make animals move together as a group",
                    "vi": "để giữ hoặc chăm sóc một nhóm động vật; để làm cho động vật di chuyển cùng nhau như một nhóm"
                },
                "examples": [
                    {
                        "en": "a shepherd herding his flock",
                        "vi": "một người chăn cừu chăn bầy của mình"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to describe a very difficult task, especially one that involves organizing people",
                    "vi": "được sử dụng để mô tả một nhiệm vụ rất khó khăn, đặc biệt là một nhiệm vụ liên quan đến việc tổ chức con người"
                },
                "examples": [
                    {
                        "en": "Managing a political party is a lot like herding cats.",
                        "vi": "Quản lý một đảng chính trị cũng giống như việc chăn gia súc."
                    }
                ]
            }
        ]
    },
    {
        "id": "70f87a7b805f465087ecb6bbac56a462",
        "word": "hoof-and-mouth disease",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌhuːf ən ˈmaʊθ dɪziːz/",
            "us": "/ˌhuːf ən ˈmaʊθ dɪziːz/"
        },
        "nearby": [
            {
                "word": "hoof",
                "pos": "noun"
            },
            {
                "word": "hoof",
                "pos": "verb"
            },
            {
                "word": "hoof-and-mouth disease",
                "pos": "noun"
            },
            {
                "word": "hoo-ha",
                "pos": "noun"
            },
            {
                "word": "hook",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a disease of cows, sheep, etc., that causes painful places on the mouth and feet",
                    "vi": "bệnh của bò, cừu, v.v. gây đau ở miệng và bàn chân"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "dddaed22c26141f5a009a413130f0020",
        "word": "husbandry",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈhʌzbəndri/",
            "us": "/ˈhʌzbəndri/"
        },
        "nearby": [
            {
                "word": "husband",
                "pos": "noun"
            },
            {
                "word": "husband",
                "pos": "verb"
            },
            {
                "word": "husbandry",
                "pos": "noun"
            },
            {
                "word": "hush",
                "pos": "verb"
            },
            {
                "word": "hush",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "farming, especially when done carefully and well",
                    "vi": "nông nghiệp, đặc biệt là khi được thực hiện cẩn thận và tốt"
                },
                "examples": [
                    {
                        "en": "animal/crop husbandry",
                        "vi": "chăn nuôi / trồng trọt"
                    }
                ]
            },
            {
                "define": {
                    "en": "the careful use of food, money and supplies",
                    "vi": "sử dụng cẩn thận thực phẩm, tiền bạc và vật dụng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "34619e9b16ab4a54bdfea5544904dcbb",
        "word": "lamb",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/læm/",
            "us": "/læm/"
        },
        "nearby": [
            {
                "word": "lamb",
                "pos": "noun"
            },
            {
                "word": "Lady Caroline Lamb",
                "pos": ""
            },
            {
                "word": "lamb",
                "pos": "verb"
            },
            {
                "word": "Charles Lamb",
                "pos": ""
            },
            {
                "word": "lambada",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to give birth to a lamb",
                    "vi": "sinh ra một con cừu non"
                },
                "examples": [
                    {
                        "en": "She’s due to lamb in two weeks’ time.",
                        "vi": "Cô ấy sẽ đến thịt cừu trong thời gian hai tuần."
                    }
                ]
            }
        ]
    },
    {
        "id": "147d114b8593422d842104e174e787c6",
        "word": "meal",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/miːl/",
            "us": "/miːl/"
        },
        "nearby": [
            {
                "word": "meadowlark",
                "pos": "noun"
            },
            {
                "word": "meagre",
                "pos": "adjective"
            },
            {
                "word": "meal",
                "pos": "noun"
            },
            {
                "word": "mealie",
                "pos": "noun"
            },
            {
                "word": "mealie meal",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an occasion when people eat food, especially breakfast, lunch or dinner",
                    "vi": "một dịp mà mọi người ăn thức ăn, đặc biệt là bữa sáng, bữa trưa hoặc bữa tối"
                },
                "examples": [
                    {
                        "en": "Try not to eat between meals.",
                        "vi": "Cố gắng không ăn giữa các bữa ăn."
                    },
                    {
                        "en": "Lunch is his main meal of the day.",
                        "vi": "Bữa trưa là bữa ăn chính trong ngày của anh ấy."
                    },
                    {
                        "en": "(especially British English) to go out for a meal (= to go to a restaurant to have a meal)",
                        "vi": "(đặc biệt là tiếng Anh Anh) để đi ăn ngoài (= đi đến nhà hàng để dùng bữa)"
                    },
                    {
                        "en": "What time would you like your evening meal?",
                        "vi": "Bạn muốn ăn tối lúc mấy giờ?"
                    }
                ]
            },
            {
                "define": {
                    "en": "the food that is eaten at a meal",
                    "vi": "thức ăn được ăn trong một bữa ăn"
                },
                "examples": [
                    {
                        "en": "Enjoy your meal.",
                        "vi": "Ăn ngon miệng nhé."
                    },
                    {
                        "en": "a three-course meal",
                        "vi": "một bữa ăn ba món"
                    },
                    {
                        "en": "They are learning to cook simple, healthy meals.",
                        "vi": "Họ đang học cách nấu những bữa ăn đơn giản, lành mạnh."
                    }
                ]
            },
            {
                "define": {
                    "en": "grain that has been made into a powder, used as food for animals and for making flour",
                    "vi": "ngũ cốc đã được làm thành bột, dùng làm thức ăn cho động vật và làm bột mì"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to spend a lot of time, energy, etc. doing something in a way that other people think is unnecessary and/or annoying",
                    "vi": "dành nhiều thời gian, năng lượng, v.v. để làm điều gì đó theo cách mà người khác nghĩ là không cần thiết và / hoặc gây phiền nhiễu"
                },
                "examples": [
                    {
                        "en": "Why do you have to make such a meal of everything?",
                        "vi": "Tại sao bạn phải làm một bữa ăn của tất cả mọi thứ?"
                    }
                ]
            },
            {
                "define": {
                    "en": "a good meal that satisfies your hunger",
                    "vi": "một bữa ăn ngon giúp bạn thỏa mãn cơn đói"
                },
                "examples": [
                    {
                        "en": "He looks as though he hasn't had a square meal for weeks.",
                        "vi": "Anh ấy trông như thể anh ấy đã không được ăn một bữa no trong nhiều tuần."
                    }
                ]
            }
        ]
    },
    {
        "id": "2f6c023eaaa9404cbff02d858778d5e6",
        "word": "on the hoof",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/huːf/",
            "us": "/huːf/"
        },
        "nearby": [
            {
                "word": "hoody",
                "pos": "noun"
            },
            {
                "word": "hooey",
                "pos": "noun"
            },
            {
                "word": "hoof",
                "pos": "noun"
            },
            {
                "word": "hoof",
                "pos": "verb"
            },
            {
                "word": "hoof-and-mouth disease",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the hard part of the foot of some animals, for example horses",
                    "vi": "phần cứng của bàn chân của một số động vật, ví dụ như ngựa"
                },
                "examples": [
                    {
                        "en": "The horse tossed its head and stamped its hooves nervously.",
                        "vi": "Con ngựa hất đầu, dập vó đầy lo lắng."
                    }
                ]
            },
            {
                "define": {
                    "en": "meat that is sold, transported, etc. on the hoof is sold, etc. while the cow, sheep, etc. is still alive",
                    "vi": "thịt được bán, vận chuyển, vv trên móng heo được bán, vv trong khi bò, cừu, vv vẫn còn sống"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "if you do something on the hoof, you do it quickly and without giving it your full attention because you are doing something else at the same time",
                    "vi": "nếu bạn làm điều gì đó trên móng, bạn sẽ làm điều đó một cách nhanh chóng và không tập trung hoàn toàn vào nó bởi vì bạn đang làm việc khác cùng lúc"
                },
                "examples": [
                    {
                        "en": "I often have lunch on the hoof between two appointments.",
                        "vi": "Tôi thường ăn trưa nhẹ nhàng giữa hai cuộc hẹn."
                    },
                    {
                        "en": "the consequences of making government policy on the hoof",
                        "vi": "hậu quả của việc hoạch định chính sách của chính phủ về móng"
                    }
                ]
            }
        ]
    },
    {
        "id": "712463c8b14b4bc094a6d7e9e75eaa8c",
        "word": "pasteurization",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌpɑːstʃəraɪˈzeɪʃn/",
            "us": "/ˌpæstʃərəˈzeɪʃn/"
        },
        "nearby": [
            {
                "word": "pastel",
                "pos": "noun"
            },
            {
                "word": "pastern",
                "pos": "noun"
            },
            {
                "word": "pasteurization",
                "pos": "noun"
            },
            {
                "word": "pasteurize",
                "pos": "verb"
            },
            {
                "word": "pastiche",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the process of heating a liquid, especially milk, to a particular temperature and then cooling it, in order to kill harmful bacteria",
                    "vi": "Quá trình làm nóng chất lỏng, đặc biệt là sữa, đến một nhiệt độ cụ thể và sau đó làm lạnh, để tiêu diệt vi khuẩn có hại"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "4b15c45e10a1437f9c69b2ffb5016afc",
        "word": "pasteurize",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpɑːstʃəraɪz/",
            "us": "/ˈpæstʃəraɪz/"
        },
        "nearby": [
            {
                "word": "pastern",
                "pos": "noun"
            },
            {
                "word": "pasteurization",
                "pos": "noun"
            },
            {
                "word": "pasteurize",
                "pos": "verb"
            },
            {
                "word": "pastiche",
                "pos": "noun"
            },
            {
                "word": "pastille",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to heat a liquid, especially milk, to a particular temperature and then cool it, in order to kill harmful bacteria",
                    "vi": "để làm nóng chất lỏng, đặc biệt là sữa, đến một nhiệt độ cụ thể và sau đó làm nguội, nhằm tiêu diệt vi khuẩn có hại"
                },
                "examples": [
                    {
                        "en": "pasteurized milk",
                        "vi": "sữa tiệt trùng"
                    }
                ]
            }
        ]
    },
    {
        "id": "9341119c4d5e4789a46ba180aeaa69f2",
        "word": "pasture",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpɑːstʃə(r)/",
            "us": "/ˈpæstʃər/"
        },
        "nearby": [
            {
                "word": "the past tense",
                "pos": "noun"
            },
            {
                "word": "pasturage",
                "pos": "noun"
            },
            {
                "word": "pasture",
                "pos": "noun"
            },
            {
                "word": "pasture",
                "pos": "verb"
            },
            {
                "word": "pastureland",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "land covered with grass that is suitable for feeding animals on",
                    "vi": "đất phủ cỏ thích hợp cho gia súc ăn"
                },
                "examples": [
                    {
                        "en": "an area of permanent/rough/rich pasture",
                        "vi": "một khu vực đồng cỏ lâu dài / gồ ghề / phong phú"
                    },
                    {
                        "en": "high mountain pastures",
                        "vi": "đồng cỏ trên núi cao"
                    },
                    {
                        "en": "The cattle were put out to pasture.",
                        "vi": "Gia súc được đưa ra đồng cỏ."
                    },
                    {
                        "en": "We drove through mile after mile of land cleared for pasture.",
                        "vi": "Chúng tôi đã lái xe qua dặm này qua dặm khác của vùng đất được dọn sạch để làm đồng cỏ."
                    },
                    {
                        "en": "By the time we got the cows back into the pasture, it was dark.",
                        "vi": "Vào thời điểm chúng tôi đưa những con bò trở lại đồng cỏ, trời đã tối."
                    }
                ]
            },
            {
                "define": {
                    "en": "the circumstances of your life, work, etc.",
                    "vi": "hoàn cảnh cuộc sống, công việc của bạn, v.v."
                },
                "examples": [
                    {
                        "en": "I felt we were off to greener pastures (= a better way of life).",
                        "vi": "Tôi cảm thấy chúng tôi đã đến những đồng cỏ xanh hơn (= một cách sống tốt hơn)."
                    },
                    {
                        "en": "(British English) She decided it was time to move on to pastures new (= a new job, place to live, etc.).",
                        "vi": "(Tiếng Anh Anh) Cô ấy quyết định đã đến lúc chuyển sang đồng cỏ mới (= một công việc mới, nơi ở, v.v.)."
                    }
                ]
            }
        ]
    },
    {
        "id": "c250a225368248c18ccbcec54c3637ef",
        "word": "pasture",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpɑːstʃə(r)/",
            "us": "/ˈpæstʃər/"
        },
        "nearby": [
            {
                "word": "pasturage",
                "pos": "noun"
            },
            {
                "word": "pasture",
                "pos": "noun"
            },
            {
                "word": "pasture",
                "pos": "verb"
            },
            {
                "word": "pastureland",
                "pos": "noun"
            },
            {
                "word": "pasty1",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to put animals in a field to feed on grass",
                    "vi": "đưa động vật vào ruộng để ăn cỏ"
                },
                "examples": [
                    {
                        "en": "pasture something The villagers relied on the commons for pasturing their sheep.",
                        "vi": "một cái gì đó đồng cỏ Dân làng dựa vào đồng cỏ để chăn cừu của họ."
                    },
                    {
                        "en": "be pastured on something The cattle were pastured on rich meadow grass.",
                        "vi": "được chăn trên một cái gì đó Gia súc đã được chăn thả trên đồng cỏ phong phú."
                    }
                ]
            }
        ]
    },
    {
        "id": "325e4002591643519f832e9f78efcac7",
        "word": "pen",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/pen/",
            "us": "/pen/"
        },
        "nearby": [
            {
                "word": "Pembrokeshire",
                "pos": ""
            },
            {
                "word": "pemmican",
                "pos": "noun"
            },
            {
                "word": "pen",
                "pos": "noun"
            },
            {
                "word": "pen",
                "pos": "verb"
            },
            {
                "word": "penal",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an instrument made of plastic or metal used for writing with ink (= coloured liquid for writing, etc.)",
                    "vi": "một dụng cụ làm bằng nhựa hoặc kim loại dùng để viết bằng mực (= chất lỏng màu để viết, v.v.)"
                },
                "examples": [
                    {
                        "en": "an ink pen",
                        "vi": "một cây bút mực"
                    },
                    {
                        "en": "Let me grab a pen.",
                        "vi": "Để tôi lấy một cây bút."
                    },
                    {
                        "en": "to use pen and paper",
                        "vi": "sử dụng bút và giấy"
                    },
                    {
                        "en": "pen and ink",
                        "vi": "bút và mực"
                    },
                    {
                        "en": "in pen a message written in red pen (= using a red pen)",
                        "vi": "trong bút một thông điệp viết bằng bút đỏ (= dùng bút đỏ)"
                    },
                    {
                        "en": "from the pen of somebody (figurative) a new book from the pen of (= written by) Zadie Smith",
                        "vi": "từ cây bút của ai đó (nghĩa bóng) một cuốn sách mới từ cây bút của (= được viết bởi) Zadie Smith"
                    }
                ]
            },
            {
                "define": {
                    "en": "a small piece of land surrounded by a fence in which farm animals are kept",
                    "vi": "một mảnh đất nhỏ được bao quanh bởi hàng rào, trong đó các trang trại được nuôi nhốt"
                },
                "examples": [
                    {
                        "en": "a sheep pen",
                        "vi": "một cái bút cừu"
                    }
                ]
            },
            {
                "define": {
                    "en": "a penitentiary (= a prison)",
                    "vi": "một nhà tù (= một nhà tù)"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "people who write books, poems, etc. have a greater effect on history and human affairs than soldiers and wars",
                    "vi": "người viết sách, làm thơ, v.v ... có tác dụng đối với lịch sử và con người hơn là binh lính và chiến tranh."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to write or start to write something",
                    "vi": "để viết hoặc bắt đầu viết một cái gì đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a small mistake in something that you write or say",
                    "vi": "một lỗi nhỏ trong một cái gì đó mà bạn viết hoặc nói"
                },
                "examples": [
                    {
                        "en": "Sorry, it was a slip of the pen—I meant to write ‘pheasants’, not ‘peasants’.",
                        "vi": "Xin lỗi, đó là một vết trượt của bút — tôi muốn viết \"gà lôi\", không phải \"nông dân\"."
                    }
                ]
            }
        ]
    },
    {
        "id": "7f7b5513025e4c62af9c82b2cd723a85",
        "word": "pigsty",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpɪɡstaɪ/",
            "us": "/ˈpɪɡstaɪ/"
        },
        "nearby": [
            {
                "word": "pigskin",
                "pos": "noun"
            },
            {
                "word": "pig-sticking",
                "pos": "noun"
            },
            {
                "word": "pigsty",
                "pos": "noun"
            },
            {
                "word": "pigswill",
                "pos": "noun"
            },
            {
                "word": "pigtail",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small building or area where pigs are kept",
                    "vi": "một tòa nhà nhỏ hoặc khu vực nuôi lợn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a very dirty or untidy place",
                    "vi": "một nơi rất bẩn thỉu hoặc bừa bộn"
                },
                "examples": [
                    {
                        "en": "Honestly, this room’s a pigsty!",
                        "vi": "Thành thật mà nói, căn phòng này là một cái chuồng lợn!"
                    }
                ]
            }
        ]
    },
    {
        "id": "55a4ad4105be45a9b0be6b0828fc7b65",
        "word": "rear",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/rɪə(r)/",
            "us": "/rɪr/"
        },
        "nearby": [
            {
                "word": "rear",
                "pos": "adjective"
            },
            {
                "word": "rear",
                "pos": "noun"
            },
            {
                "word": "rear",
                "pos": "verb"
            },
            {
                "word": "rear admiral",
                "pos": "noun"
            },
            {
                "word": "rear end",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to care for young children or animals until they are fully grown",
                    "vi": "chăm sóc trẻ nhỏ hoặc động vật cho đến khi chúng trưởng thành hoàn toàn"
                },
                "examples": [
                    {
                        "en": "She reared a family of five on her own.",
                        "vi": "Cô ấy đã tự mình nuôi một gia đình năm người."
                    },
                    {
                        "en": "Lions usually manage to rear about half the number of cubs born to them.",
                        "vi": "Sư tử thường quản lý để nuôi khoảng một nửa số đàn con do chúng sinh ra."
                    }
                ]
            },
            {
                "define": {
                    "en": "to keep and breed (= produce young from) animals or birds, for example on a farm",
                    "vi": "để giữ và nhân giống (= sản xuất con non từ) động vật hoặc chim, ví dụ như trong một trang trại"
                },
                "examples": [
                    {
                        "en": "to rear cattle",
                        "vi": "để nuôi gia súc"
                    }
                ]
            },
            {
                "define": {
                    "en": "to raise itself on its back legs, with the front legs in the air",
                    "vi": "tự nâng mình lên bằng hai chân sau, với hai chân trước trên không"
                },
                "examples": [
                    {
                        "en": "The horse reared, throwing its rider.",
                        "vi": "Con ngựa rống lên, hất tung người cưỡi ngựa."
                    }
                ]
            },
            {
                "define": {
                    "en": "to seem to lean over you, especially in a way that makes you feel frightened",
                    "vi": "dường như nghiêng về phía bạn, đặc biệt là theo cách khiến bạn cảm thấy sợ hãi"
                },
                "examples": [
                    {
                        "en": "The great bulk of the building reared up against the night sky.",
                        "vi": "Phần lớn của tòa nhà nhô lên trên bầu trời đêm."
                    }
                ]
            },
            {
                "define": {
                    "en": "if something unpleasant rears its head or rears its ugly head, it appears or happens",
                    "vi": "nếu một cái gì đó khó chịu dựng lên đầu nó hoặc che cái đầu xấu xí của nó, nó sẽ xuất hiện hoặc xảy ra"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "6c576726634c489ab3fd039f1fc99ebb",
        "word": "run",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/rʌn/",
            "us": "/rʌn/"
        },
        "nearby": [
            {
                "word": "rumpy pumpy",
                "pos": "noun"
            },
            {
                "word": "run",
                "pos": "verb"
            },
            {
                "word": "run",
                "pos": "noun"
            },
            {
                "word": "runabout",
                "pos": "noun"
            },
            {
                "word": "run across",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an act of running; a period of time spent running or the distance that somebody runs",
                    "vi": "một hành động chạy; một khoảng thời gian đã dành để chạy hoặc khoảng cách mà ai đó chạy"
                },
                "examples": [
                    {
                        "en": "I go for a run every morning.",
                        "vi": "Tôi chạy bộ mỗi sáng."
                    },
                    {
                        "en": "a five-mile run",
                        "vi": "chạy năm dặm"
                    },
                    {
                        "en": "The event comprised a 1500m swim, 40km bike ride and 10km run.",
                        "vi": "Sự kiện bao gồm bơi 1500m, đạp xe 40 km và chạy 10km."
                    },
                    {
                        "en": "Catching sight of her he broke into a run (= started running).",
                        "vi": "Bắt gặp cô ấy, anh ấy lao vào chạy (= bắt đầu chạy)."
                    },
                    {
                        "en": "I decided to make a run for it (= to escape by running).",
                        "vi": "Tôi quyết định chạy cho nó (= chạy trốn)."
                    },
                    {
                        "en": "at a run She took the stairs at a run.",
                        "vi": "lúc chạy Cô ấy đã chạy bộ lên cầu thang."
                    },
                    {
                        "en": "The Ethiopian is aiming to produce his second record-breaking run of the week.",
                        "vi": "Tay vợt người Ethiopia đang đặt mục tiêu tạo ra kỷ lục thứ hai trong tuần."
                    },
                    {
                        "en": "The race consists of an eight-mile cross-country run followed by an army assault course.",
                        "vi": "Cuộc đua bao gồm một cuộc chạy xuyên quốc gia dài 8 dặm, sau đó là một cuộc đua tấn công của quân đội."
                    }
                ]
            },
            {
                "define": {
                    "en": "a trip by car, plane, boat, etc., especially a short one or one that is made regularly",
                    "vi": "một chuyến đi bằng ô tô, máy bay, thuyền, v.v., đặc biệt là một chuyến ngắn hoặc một chuyến được thực hiện thường xuyên"
                },
                "examples": [
                    {
                        "en": "They took the car out for a run.",
                        "vi": "Họ dắt xe ra ngoài chạy thử."
                    },
                    {
                        "en": "We went for a run in his new car.",
                        "vi": "Chúng tôi đã đi một vòng trong chiếc xe mới của anh ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "a period of something good or bad happening; a series of successes or failures",
                    "vi": "một khoảng thời gian của điều gì đó tốt hoặc xấu đang xảy ra; một loạt thành công hoặc thất bại"
                },
                "examples": [
                    {
                        "en": "a run of good/bad luck",
                        "vi": "một sự may mắn / tốt"
                    },
                    {
                        "en": "Liverpool lost to Leeds, ending an unbeaten run of 18 games.",
                        "vi": "Liverpool để thua Leeds, chấm dứt chuỗi 18 trận bất bại."
                    },
                    {
                        "en": "Manchester United have finally ended their run of victories.",
                        "vi": "Manchester United cuối cùng đã kết thúc chuỗi chiến thắng của họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a series of performances of a play or film",
                    "vi": "một loạt các buổi biểu diễn của một vở kịch hoặc một bộ phim"
                },
                "examples": [
                    {
                        "en": "The show had a record-breaking run in the London theatre.",
                        "vi": "Buổi biểu diễn đã đạt kỷ lục chạy tại nhà hát London."
                    }
                ]
            },
            {
                "define": {
                    "en": "the amount of a product that a company decides to make at one time",
                    "vi": "số lượng sản phẩm mà một công ty quyết định sản xuất tại một thời điểm"
                },
                "examples": [
                    {
                        "en": "The first print run of 6 000 copies sold out.",
                        "vi": "Đợt in đầu tiên với 6 000 bản đã được bán hết."
                    }
                ]
            },
            {
                "define": {
                    "en": "a situation when many people sell dollars, etc. and the value of the money falls",
                    "vi": "tình huống khi nhiều người bán đô la, v.v. và giá trị của tiền giảm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a situation when many people suddenly want to take their money out of a bank",
                    "vi": "một tình huống khi nhiều người đột nhiên muốn mang tiền của họ ra khỏi ngân hàng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a situation when many people suddenly want to buy something",
                    "vi": "một tình huống khi nhiều người đột nhiên muốn mua một thứ gì đó"
                },
                "examples": [
                    {
                        "en": "There's been a run on barbecues with the hot weather.",
                        "vi": "Đã có người chạy trên tiệc nướng với thời tiết nóng bức."
                    }
                ]
            },
            {
                "define": {
                    "en": "the way things usually happen; the way things seem to be happening on a particular occasion",
                    "vi": "cách mọi thứ thường xảy ra; cách mọi thứ dường như đang xảy ra vào một dịp cụ thể"
                },
                "examples": [
                    {
                        "en": "In the normal run of things the only exercise he gets is climbing in and out of taxis.",
                        "vi": "Trong quá trình hoạt động bình thường, bài tập duy nhất mà anh ấy nhận được là leo lên và xuống taxi."
                    },
                    {
                        "en": "(British English) Wise scored in the 15th minute against the run of play (= although the other team had seemed more likely to score).",
                        "vi": "(Anh Anh) Wise đã ghi bàn ở phút thứ 15 trong trận đấu (= mặc dù đội kia dường như có nhiều khả năng ghi bàn hơn)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a sloping track used in skiing and some other sports",
                    "vi": "đường dốc dùng trong trượt tuyết và một số môn thể thao khác"
                },
                "examples": [
                    {
                        "en": "a ski/toboggan run",
                        "vi": "trượt tuyết / chạy xe trượt băng"
                    }
                ]
            },
            {
                "define": {
                    "en": "a point scored in the game of cricket or baseball",
                    "vi": "một điểm ghi được trong trò chơi cricket hoặc bóng chày"
                },
                "examples": [
                    {
                        "en": "Our team won by four runs.",
                        "vi": "Đội của chúng tôi đã thắng trong bốn lượt chạy."
                    }
                ]
            },
            {
                "define": {
                    "en": "an act of trying to get elected to public office",
                    "vi": "một hành động cố gắng để được bầu vào văn phòng công cộng"
                },
                "examples": [
                    {
                        "en": "He made an unsuccessful run for governor in 2008.",
                        "vi": "Ông đã không thành công trong việc tranh cử chức thống đốc vào năm 2008."
                    },
                    {
                        "en": "Senator Blake's run for the presidency",
                        "vi": "Thượng nghị sĩ Blake tranh cử tổng thống"
                    }
                ]
            },
            {
                "define": {
                    "en": "an area with a fence, walls, etc. in which animals or birds are kept as pets or on a farm",
                    "vi": "một khu vực có hàng rào, tường, v.v. trong đó động vật hoặc chim được nuôi làm thú cưng hoặc trong trang trại"
                },
                "examples": [
                    {
                        "en": "a chicken run",
                        "vi": "một con gà chạy"
                    }
                ]
            },
            {
                "define": {
                    "en": "a series of notes sung or played quickly up or down the scale",
                    "vi": "một loạt nốt nhạc được hát hoặc chơi nhanh chóng lên hoặc xuống thang âm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a series of cards held by one player",
                    "vi": "một loạt các thẻ do một người chơi nắm giữ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a long thin hole in tights or stockings where some threads have broken",
                    "vi": "một lỗ mỏng dài trên quần tất hoặc tất chân nơi một số sợi chỉ bị đứt"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "diarrhoea (= an illness in which waste matter is emptied from the bowels much more frequently than normal, and in liquid form)",
                    "vi": "tiêu chảy (= một bệnh trong đó chất thải được thải ra khỏi ruột thường xuyên hơn nhiều so với bình thường và ở dạng lỏng)"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the average type of something",
                    "vi": "loại trung bình của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "He was very different from the general run of movie stars.",
                        "vi": "Anh ấy rất khác với cuộc sống chung của các ngôi sao điện ảnh."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody try very hard, using all their skill and effort, in order to beat you in a game or competition",
                    "vi": "để khiến ai đó cố gắng rất nhiều, sử dụng tất cả kỹ năng và nỗ lực của họ, để đánh bại bạn trong một trò chơi hoặc cuộc thi"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to give somebody/get/have permission to make full use of something",
                    "vi": "để cho ai đó / nhận / có quyền sử dụng đầy đủ thứ gì đó"
                },
                "examples": [
                    {
                        "en": "Her dogs have the run of the house.",
                        "vi": "Những con chó của cô ấy đã chạy trong nhà."
                    }
                ]
            },
            {
                "define": {
                    "en": "relating to a longer period in the future",
                    "vi": "liên quan đến một khoảng thời gian dài hơn trong tương lai"
                },
                "examples": [
                    {
                        "en": "This measure inevitably means higher taxes in the long run.",
                        "vi": "Biện pháp này chắc chắn có nghĩa là thuế cao hơn trong thời gian dài."
                    }
                ]
            },
            {
                "define": {
                    "en": "relating to the immediate future",
                    "vi": "liên quan đến tương lai trước mắt"
                },
                "examples": [
                    {
                        "en": "In the short run, unemployment may fall.",
                        "vi": "Trong ngắn hạn, tỷ lệ thất nghiệp có thể giảm xuống."
                    }
                ]
            },
            {
                "define": {
                    "en": "trying to avoid being captured",
                    "vi": "cố gắng tránh bị bắt"
                },
                "examples": [
                    {
                        "en": "He's on the run from the police.",
                        "vi": "Anh ta đang chạy trốn khỏi cảnh sát."
                    },
                    {
                        "en": "The prisoners have now been on the run for three days.",
                        "vi": "Các tù nhân hiện đã chạy trốn được ba ngày."
                    }
                ]
            },
            {
                "define": {
                    "en": "continuously active and moving around",
                    "vi": "liên tục hoạt động và di chuyển xung quanh"
                },
                "examples": [
                    {
                        "en": "I've been on the run all day and I'm exhausted.",
                        "vi": "Tôi đã chạy cả ngày và tôi kiệt sức."
                    },
                    {
                        "en": "Here are some quick recipes for when you're eating on the run (= in a hurry).",
                        "vi": "Dưới đây là một số công thức nấu ăn nhanh khi bạn đang ăn trên đường chạy trốn (= vội vàng)."
                    },
                    {
                        "en": "I usually eat breakfast on the run.",
                        "vi": "Tôi thường ăn sáng trên đường chạy trốn."
                    }
                ]
            }
        ]
    },
    {
        "id": "6060aba9e14245b088ade1109abfb898",
        "word": "runt",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/rʌnt/",
            "us": "/rʌnt/"
        },
        "nearby": [
            {
                "word": "run past",
                "pos": "phrasal verb"
            },
            {
                "word": "run play",
                "pos": "noun"
            },
            {
                "word": "runt",
                "pos": "noun"
            },
            {
                "word": "run through",
                "pos": "phrasal verb"
            },
            {
                "word": "run-through",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the smallest, weakest animal of the young that are born from the same mother at the same time",
                    "vi": "con vật nhỏ nhất, yếu ớt nhất của con non được sinh ra từ cùng một mẹ"
                },
                "examples": [
                    {
                        "en": "the runt of the litter",
                        "vi": "thời gian của lứa"
                    }
                ]
            },
            {
                "define": {
                    "en": "a rude way of referring to somebody who is small, weak or unimportant",
                    "vi": "một cách thô lỗ để ám chỉ ai đó nhỏ bé, yếu ớt hoặc không quan trọng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "56b2b186f055451e942aac59329f54cc",
        "word": "shear",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ʃɪə(r)/",
            "us": "/ʃɪr/"
        },
        "nearby": [
            {
                "word": "shea butter",
                "pos": "noun"
            },
            {
                "word": "sheaf",
                "pos": "noun"
            },
            {
                "word": "shear",
                "pos": "verb"
            },
            {
                "word": "George Shearing",
                "pos": ""
            },
            {
                "word": "shears",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to cut the wool off a sheep",
                    "vi": "cắt lông cừu khỏi một con cừu"
                },
                "examples": [
                    {
                        "en": "It was time for the sheep to be shorn.",
                        "vi": "Đã đến lúc bầy cừu không còn nữa."
                    },
                    {
                        "en": "sheep shearing",
                        "vi": "xén lông cừu"
                    }
                ]
            },
            {
                "define": {
                    "en": "to cut off somebody’s hair",
                    "vi": "cắt tóc của ai đó"
                },
                "examples": [
                    {
                        "en": "shorn hair",
                        "vi": "cắt ngắn tóc"
                    },
                    {
                        "en": "The prisoners’ hair was shorn.",
                        "vi": "Tóc của tù nhân đã ngắn lại."
                    }
                ]
            },
            {
                "define": {
                    "en": "to break under pressure; to cut through something and make it break",
                    "vi": "để phá vỡ dưới áp lực; để cắt qua một cái gì đó và làm cho nó vỡ ra"
                },
                "examples": [
                    {
                        "en": "The bolts holding the wheel in place sheared off.",
                        "vi": "Các bu lông giữ bánh xe tại chỗ bị cắt ra."
                    }
                ]
            }
        ]
    },
    {
        "id": "dc20f623a62e43919a0d6997f2ac0659",
        "word": "sheep dip",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈʃiːp dɪp/",
            "us": "/ˈʃiːp dɪp/"
        },
        "nearby": [
            {
                "word": "sheen",
                "pos": "noun"
            },
            {
                "word": "sheep",
                "pos": "noun"
            },
            {
                "word": "sheep dip",
                "pos": "noun"
            },
            {
                "word": "sheepdog",
                "pos": "noun"
            },
            {
                "word": "sheepfold",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a liquid which is used to kill insects, etc. in a sheep’s coat; the container in which sheep are put to treat them with this",
                    "vi": "một chất lỏng được sử dụng để giết côn trùng, vv trong áo cừu; cái hộp đựng những con cừu được đưa vào để xử lý chúng bằng cái này"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "f2cb24910979403a9f80561eec21b43a",
        "word": "silage",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsaɪlɪdʒ/",
            "us": "/ˈsaɪlɪdʒ/"
        },
        "nearby": [
            {
                "word": "Sikh",
                "pos": "noun"
            },
            {
                "word": "Sikh",
                "pos": "adjective"
            },
            {
                "word": "silage",
                "pos": "noun"
            },
            {
                "word": "Silbury Hill",
                "pos": ""
            },
            {
                "word": "Silchester",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "grass or other green crops that are stored without being dried and are used to feed farm animals in winter",
                    "vi": "cỏ hoặc các loại cây xanh khác được bảo quản mà không bị khô và được sử dụng để làm thức ăn cho vật nuôi trong trang trại vào mùa đông"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "aea71180c3274f7aa4894f5309448320",
        "word": "slaughter",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈslɔːtə(r)/",
            "us": "/ˈslɔːtər/"
        },
        "nearby": [
            {
                "word": "slatternly",
                "pos": "adjective"
            },
            {
                "word": "slaty",
                "pos": "adjective"
            },
            {
                "word": "slaughter",
                "pos": "noun"
            },
            {
                "word": "slaughter",
                "pos": "verb"
            },
            {
                "word": "slaughterhouse",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the killing of animals for their meat",
                    "vi": "giết động vật để lấy thịt của chúng"
                },
                "examples": [
                    {
                        "en": "cows taken for slaughter",
                        "vi": "bò đem đi giết thịt"
                    }
                ]
            },
            {
                "define": {
                    "en": "the cruel killing of large numbers of people at one time, especially in a war",
                    "vi": "sự giết hại dã man của một số lượng lớn người cùng một lúc, đặc biệt là trong một cuộc chiến tranh"
                },
                "examples": [
                    {
                        "en": "the wholesale slaughter of innocent people",
                        "vi": "buôn bán tàn sát người vô tội"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to describe people who are going to do something dangerous without realizing it",
                    "vi": "được sử dụng để mô tả những người sẽ làm điều gì đó nguy hiểm mà không nhận ra nó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a6304822907b4beab1677e69fd495cea",
        "word": "slaughter",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈslɔːtə(r)/",
            "us": "/ˈslɔːtər/"
        },
        "nearby": [
            {
                "word": "slaty",
                "pos": "adjective"
            },
            {
                "word": "slaughter",
                "pos": "noun"
            },
            {
                "word": "slaughter",
                "pos": "verb"
            },
            {
                "word": "slaughterhouse",
                "pos": "noun"
            },
            {
                "word": "Slav",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to kill an animal, usually for its meat",
                    "vi": "giết một con vật, thường là để lấy thịt của nó"
                },
                "examples": [
                    {
                        "en": "The lambs are taken to the local abattoir to be slaughtered.",
                        "vi": "Những con cừu non được đưa đến lò mổ địa phương để làm thịt."
                    }
                ]
            },
            {
                "define": {
                    "en": "to kill a large number of people or animals violently",
                    "vi": "giết một số lượng lớn người hoặc động vật một cách thô bạo"
                },
                "examples": [
                    {
                        "en": "Men, women and children were slaughtered and villages destroyed.",
                        "vi": "Đàn ông, phụ nữ và trẻ em bị tàn sát và làng mạc bị phá hủy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to defeat somebody/something by a large number of points in a sports game, competition, etc.",
                    "vi": "để đánh bại ai đó / cái gì đó bằng một số điểm lớn trong một trò chơi thể thao, cuộc thi, v.v."
                },
                "examples": [
                    {
                        "en": "We were slaughtered 10–1 by the home team.",
                        "vi": "Chúng tôi đã bị đội chủ nhà tàn sát với tỷ số 10–1."
                    }
                ]
            }
        ]
    },
    {
        "id": "c60d09675558426b98b39a8283b8b308",
        "word": "slaughterhouse",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈslɔːtəhaʊs/",
            "us": "/ˈslɔːtərhaʊs/"
        },
        "nearby": [
            {
                "word": "slaughter",
                "pos": "noun"
            },
            {
                "word": "slaughter",
                "pos": "verb"
            },
            {
                "word": "slaughterhouse",
                "pos": "noun"
            },
            {
                "word": "Slav",
                "pos": "noun"
            },
            {
                "word": "slave",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a building where animals are killed for food",
                    "vi": "một tòa nhà nơi động vật bị giết để làm thức ăn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "ad2bf503a0d94ba3a7fb546ad9239ead",
        "word": "stud",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/stʌd/",
            "us": "/stʌd/"
        },
        "nearby": [
            {
                "word": "stuck",
                "pos": "verb"
            },
            {
                "word": "stuck-up",
                "pos": "adjective"
            },
            {
                "word": "stud",
                "pos": "noun"
            },
            {
                "word": "stud",
                "pos": "verb"
            },
            {
                "word": "studded",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small piece of jewellery with a part that is pushed through a hole in your ear, nose, etc.",
                    "vi": "một món đồ trang sức nhỏ với một bộ phận được đẩy qua một lỗ trên tai, mũi, v.v."
                },
                "examples": [
                    {
                        "en": "diamond studs",
                        "vi": "đinh tán kim cương"
                    },
                    {
                        "en": "He has a small stud.",
                        "vi": "Anh ấy có một cái đinh nhỏ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a small, round piece of metal that is attached to the surface of something, especially for decoration",
                    "vi": "một miếng kim loại tròn, nhỏ được gắn vào bề mặt của một thứ gì đó, đặc biệt là để trang trí"
                },
                "examples": [
                    {
                        "en": "a leather jacket with studs on the back",
                        "vi": "một chiếc áo khoác da có đinh tán ở phía sau"
                    }
                ]
            },
            {
                "define": {
                    "en": "one of several small metal or plastic objects that are fixed to the bottom part of a football boot or sports shoe",
                    "vi": "một trong nhiều vật nhỏ bằng kim loại hoặc nhựa được cố định vào phần dưới cùng của giày bóng đá hoặc giày thể thao"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a small metal object used in the past for fastening a collar onto a shirt",
                    "vi": "một vật kim loại nhỏ được sử dụng trong quá khứ để buộc cổ áo vào áo sơ mi"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "an animal, especially a horse, that is kept for breeding (= producing young); a place where animals, especially horses, are kept for breeding",
                    "vi": "một con vật, đặc biệt là một con ngựa, được nuôi để làm giống (= sản xuất con non); một nơi mà động vật, đặc biệt là ngựa, được giữ để sinh sản"
                },
                "examples": [
                    {
                        "en": "a stud farm",
                        "vi": "một trang trại đực giống"
                    },
                    {
                        "en": "The horse was retired from racing and put out to stud (= kept for breeding).",
                        "vi": "Con ngựa đã bị loại khỏi cuộc đua và đưa ra làm giống (= được giữ lại để làm giống)."
                    },
                    {
                        "en": "horses at stud",
                        "vi": "ngựa ở chuồng"
                    }
                ]
            },
            {
                "define": {
                    "en": "a man who has many sexual partners and who is thought to be sexually attractive",
                    "vi": "một người đàn ông có nhiều bạn tình và người được cho là hấp dẫn về tình dục"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "15f823f17eac40d19ae002cdb69dae19",
        "word": "team",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/tiːm/",
            "us": "/tiːm/"
        },
        "nearby": [
            {
                "word": "tea leaf",
                "pos": "noun"
            },
            {
                "word": "tealight",
                "pos": "noun"
            },
            {
                "word": "team",
                "pos": "noun"
            },
            {
                "word": "team",
                "pos": "verb"
            },
            {
                "word": "team building",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a group of people who play a particular game or sport against another group of people",
                    "vi": "một nhóm người chơi một trò chơi hoặc môn thể thao cụ thể với một nhóm người khác"
                },
                "examples": [
                    {
                        "en": "a football/basketball/soccer team",
                        "vi": "một đội bóng đá / bóng rổ / bóng đá"
                    },
                    {
                        "en": "They play volleyball for the national team.",
                        "vi": "Họ chơi bóng chuyền cho đội tuyển quốc gia."
                    },
                    {
                        "en": "We played against a team from the neighbouring school.",
                        "vi": "Chúng tôi đã đấu với một đội từ trường lân cận."
                    },
                    {
                        "en": "(British English) Whose team are you in?",
                        "vi": "(Anh Anh) Bạn đang ở trong đội của ai?"
                    },
                    {
                        "en": "(North American English) Whose team are you on?",
                        "vi": "(Tiếng Anh Bắc Mỹ) Bạn thuộc đội của ai?"
                    },
                    {
                        "en": "The team is/are not playing very well this season.",
                        "vi": "Đội đang / đang chơi không tốt trong mùa giải này."
                    },
                    {
                        "en": "a team event (= one played by groups of people rather than individual players)",
                        "vi": "sự kiện đồng đội (= sự kiện được chơi bởi nhiều nhóm người chứ không phải người chơi cá nhân)"
                    }
                ]
            },
            {
                "define": {
                    "en": "a group of people who work together at a particular job",
                    "vi": "một nhóm người làm việc cùng nhau trong một công việc cụ thể"
                },
                "examples": [
                    {
                        "en": "a team member/leader",
                        "vi": "một thành viên / trưởng nhóm"
                    },
                    {
                        "en": "a member of the senior management team",
                        "vi": "một thành viên của nhóm quản lý cấp cao"
                    },
                    {
                        "en": "She leads a research team of twenty scientists.",
                        "vi": "Cô dẫn đầu một nhóm nghiên cứu gồm 20 nhà khoa học."
                    },
                    {
                        "en": "He joined the legal team five years ago.",
                        "vi": "Anh ấy đã gia nhập đội pháp lý cách đây 5 năm."
                    },
                    {
                        "en": "team of somebody A team of experts has/have been called in to investigate.",
                        "vi": "nhóm của ai đó Một nhóm chuyên gia đã / đã được gọi đến để điều tra."
                    },
                    {
                        "en": "He works with a team of researchers.",
                        "vi": "Anh ấy làm việc với một nhóm các nhà nghiên cứu."
                    },
                    {
                        "en": "She was part of the design team working on the project.",
                        "vi": "Cô ấy là một phần của nhóm thiết kế làm việc trong dự án."
                    },
                    {
                        "en": "as a team We're learning to work together as a team.",
                        "vi": "như một nhóm Chúng tôi đang học cách làm việc cùng nhau như một nhóm."
                    }
                ]
            },
            {
                "define": {
                    "en": "two or more animals that are used together to pull a cart, etc.",
                    "vi": "hai hoặc nhiều động vật được sử dụng cùng nhau để kéo xe, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to give up something that is important to you or to do something that is unpleasant in order to benefit your friends or colleagues",
                    "vi": "từ bỏ điều gì đó quan trọng đối với bạn hoặc làm điều gì đó khó chịu để mang lại lợi ích cho bạn bè hoặc đồng nghiệp của bạn"
                },
                "examples": [
                    {
                        "en": "Sometimes you have to take one for the team.",
                        "vi": "Đôi khi bạn phải lấy một cái cho cả đội."
                    },
                    {
                        "en": "I know it sounds unfair, but we need you to take one for the team.",
                        "vi": "Tôi biết điều đó nghe có vẻ không công bằng, nhưng chúng tôi cần bạn lấy một quả cho đội."
                    }
                ]
            }
        ]
    },
    {
        "id": "6dfc9f0a40794d24ba51bcb3afa1f450",
        "word": "trough",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/trɒf/",
            "us": "/trɔːf/"
        },
        "nearby": [
            {
                "word": "troublesome",
                "pos": "adjective"
            },
            {
                "word": "trouble spot",
                "pos": "noun"
            },
            {
                "word": "trough",
                "pos": "noun"
            },
            {
                "word": "trounce",
                "pos": "verb"
            },
            {
                "word": "troupe",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a long, narrow open container for animals to eat or drink from",
                    "vi": "một hộp dài và hẹp mở rộng cho động vật ăn hoặc uống"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a long narrow region of low air pressure between two regions of higher pressure",
                    "vi": "một vùng khí áp thấp hẹp dài giữa hai vùng khí áp cao hơn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a period of time when the level of something is low, especially a time when a business or the economy is not growing",
                    "vi": "một khoảng thời gian mà mức độ của một cái gì đó thấp, đặc biệt là thời điểm khi một doanh nghiệp hoặc nền kinh tế không phát triển"
                },
                "examples": [
                    {
                        "en": "There have been peaks and troughs in the long-term trend of unemployment.",
                        "vi": "Đã có những đỉnh và đáy trong xu hướng thất nghiệp dài hạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a low area between two waves in the sea, or two hills",
                    "vi": "một khu vực thấp giữa hai con sóng trên biển, hoặc hai ngọn đồi"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "if you say that people have their noses in the trough, you mean that they are trying to get a lot of money for themselves",
                    "vi": "nếu bạn nói rằng mọi người có cái mũi của họ, bạn có nghĩa là họ đang cố gắng kiếm thật nhiều tiền cho mình"
                },
                "examples": []
            }
        ]
    }
]