[
    {
        "id": "601224ffe04b40e5815524773fb54481",
        "word": "die",
        "pos": "verb",
        "level": "a1",
        "phonetic": {
            "uk": "/daɪ/",
            "us": "/daɪ/"
        },
        "nearby": [
            {
                "word": "Dido and Aeneas",
                "pos": ""
            },
            {
                "word": "‘Babe' Didrikson",
                "pos": ""
            },
            {
                "word": "die",
                "pos": "verb"
            },
            {
                "word": "die",
                "pos": "noun"
            },
            {
                "word": "die away",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to stop living",
                    "vi": "ngừng sống"
                },
                "examples": [
                    {
                        "en": "My father died suddenly at the age of 48.",
                        "vi": "Cha tôi đột ngột qua đời ở tuổi 48."
                    },
                    {
                        "en": "At least six people have died in the accident.",
                        "vi": "Ít nhất sáu người đã chết trong vụ tai nạn."
                    },
                    {
                        "en": "That plant's going to die if you don't water it!",
                        "vi": "Cây sẽ chết nếu bạn không tưới nước cho nó!"
                    },
                    {
                        "en": "He later died in hospital.",
                        "vi": "Anh ta sau đó đã chết trong bệnh viện."
                    },
                    {
                        "en": "They died fighting for their country.",
                        "vi": "Họ đã chết để chiến đấu cho đất nước của họ."
                    },
                    {
                        "en": "She died peacefully after a long illness.",
                        "vi": "Cô ra đi thanh thản sau một trận ốm dài."
                    },
                    {
                        "en": "to die with dignity",
                        "vi": "chết với phẩm giá"
                    },
                    {
                        "en": "die of/from something to die of/from cancer (= cancer is the cause of death)",
                        "vi": "chết vì / vì cái gì đó chết vì / vì ung thư (= ung thư là nguyên nhân của cái chết)"
                    },
                    {
                        "en": "die with something A further 156 people have died with Covid-19 (= they had the disease when they died).",
                        "vi": "chết vì thứ gì đó Có thêm 156 người đã chết với Covid-19 (= họ mắc bệnh khi chết)."
                    },
                    {
                        "en": "die for something He was ready to die for his cause.",
                        "vi": "chết vì điều gì đó Ngài đã sẵn sàng chết vì chính nghĩa của mình."
                    },
                    {
                        "en": "I'll never forget it to my dying day (= until I die).",
                        "vi": "Tôi sẽ không bao giờ quên nó cho đến ngày chết của tôi (= cho đến khi tôi chết)."
                    },
                    {
                        "en": "(informal) I nearly died when I saw him there (= it was very embarrassing).",
                        "vi": "(thân mật) Tôi suýt chết khi nhìn thấy anh ấy ở đó (= nó rất xấu hổ)."
                    },
                    {
                        "en": "die a… death to die a natural/slow/horrible/violent death",
                        "vi": "chết một… cái chết để chết một cái chết tự nhiên / chậm chạp / kinh khủng / bạo lực"
                    },
                    {
                        "en": "die + adj. She died young.",
                        "vi": "chết + adj. Cô ấy chết trẻ."
                    },
                    {
                        "en": "At least they died happy.",
                        "vi": "Ít ra thì họ cũng vui vẻ chết đi được."
                    },
                    {
                        "en": "die + noun He died a hero.",
                        "vi": "die + danh từ Anh ấy đã chết một anh hùng."
                    },
                    {
                        "en": "He died a poor man.",
                        "vi": "Anh ta đã chết một người đàn ông tội nghiệp."
                    }
                ]
            },
            {
                "define": {
                    "en": "to stop existing; to disappear",
                    "vi": "ngừng tồn tại; biến mất"
                },
                "examples": [
                    {
                        "en": "The old customs are dying.",
                        "vi": "Những phong tục cũ đang chết dần."
                    },
                    {
                        "en": "His secret died with him (= he never told anyone).",
                        "vi": "Bí mật của anh ấy đã chết cùng anh ấy (= anh ấy chưa bao giờ nói với ai)."
                    },
                    {
                        "en": "The words died on my lips (= I stopped speaking).",
                        "vi": "Lời nói đã chết trên môi tôi (= Tôi ngừng nói)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to stop working",
                    "vi": "ngừng làm việc"
                },
                "examples": [
                    {
                        "en": "My phone died and I had no way to contact you.",
                        "vi": "Điện thoại của tôi đã chết và tôi không có cách nào để liên lạc với bạn."
                    },
                    {
                        "en": "The engine spluttered and died.",
                        "vi": "Động cơ nổ tung tóe và chết máy."
                    },
                    {
                        "en": "My car just died on me.",
                        "vi": "Xe tôi vừa chết máy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to want something or want to do something very much",
                    "vi": "muốn một cái gì đó hoặc muốn làm một cái gì đó rất nhiều"
                },
                "examples": [
                    {
                        "en": "I'm dying for a glass of water.",
                        "vi": "Tôi đang chết vì một cốc nước."
                    },
                    {
                        "en": "I'm dying to know what happened.",
                        "vi": "Tôi muốn biết chuyện gì đã xảy ra."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to emphasize that you are telling the truth or will do what you promise",
                    "vi": "được sử dụng để nhấn mạnh rằng bạn đang nói sự thật hoặc sẽ làm những gì bạn hứa"
                },
                "examples": [
                    {
                        "en": "I saw him do it—cross my heart.",
                        "vi": "Tôi đã thấy anh ấy làm điều đó - trái tim tôi rất vui."
                    }
                ]
            },
            {
                "define": {
                    "en": "to fail completely",
                    "vi": "thất bại hoàn toàn"
                },
                "examples": [
                    {
                        "en": "The play got terrible reviews and quickly died a death.",
                        "vi": "Vở kịch bị đánh giá khủng khiếp và nhanh chóng chết một cách chết chóc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to die because you are old or ill",
                    "vi": "chết vì bạn già hoặc ốm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to find something extremely funny",
                    "vi": "để tìm một cái gì đó cực kỳ vui nhộn"
                },
                "examples": [
                    {
                        "en": "I nearly died laughing when she said that.",
                        "vi": "Tôi gần chết cười khi cô ấy nói vậy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to die or become ill and fall down in very large numbers",
                    "vi": "chết hoặc bị bệnh và ngã xuống với số lượng rất lớn"
                },
                "examples": [
                    {
                        "en": "People were dropping like flies in the intense heat.",
                        "vi": "Mọi người đang thả mình như ruồi trong cái nóng gay gắt."
                    }
                ]
            },
            {
                "define": {
                    "en": "a situation where you need to act in a very determined way or taking a great risk, because there is no alternative",
                    "vi": "một tình huống mà bạn cần phải hành động một cách rất kiên quyết hoặc chấp nhận rủi ro lớn, bởi vì không có sự thay thế"
                },
                "examples": [
                    {
                        "en": "At this stage in the competition it's do or die.",
                        "vi": "Ở giai đoạn này trong cuộc thi, nó có thể làm hoặc chết."
                    }
                ]
            },
            {
                "define": {
                    "en": "do not stop hoping",
                    "vi": "đừng ngừng hy vọng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to say that things change very slowly",
                    "vi": "từng nói rằng mọi thứ thay đổi rất chậm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "if you think something is to die for, you really want it, and would do anything to get it",
                    "vi": "nếu bạn nghĩ rằng một cái gì đó phải chết vì nó, bạn thực sự muốn nó và sẽ làm bất cứ điều gì để có được nó"
                },
                "examples": [
                    {
                        "en": "She was wearing a dress to die for.",
                        "vi": "Cô ấy đã mặc một chiếc váy để chết."
                    }
                ]
            }
        ]
    },
    {
        "id": "6e9711ed4f7143ccbcacf56e4c9c68a8",
        "word": "dead",
        "pos": "adjective",
        "level": "a2",
        "phonetic": {
            "uk": "/ded/",
            "us": "/ded/"
        },
        "nearby": [
            {
                "word": "deaconess",
                "pos": "noun"
            },
            {
                "word": "deactivate",
                "pos": "verb"
            },
            {
                "word": "dead",
                "pos": "adjective"
            },
            {
                "word": "dead",
                "pos": "noun"
            },
            {
                "word": "dead",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "no longer alive",
                    "vi": "Không còn sống nữa"
                },
                "examples": [
                    {
                        "en": "My mother's dead; she died in 2017.",
                        "vi": "Mẹ tôi đã chết; cô ấy đã chết vào năm 2017."
                    },
                    {
                        "en": "a dead person/animal",
                        "vi": "một người / động vật chết"
                    },
                    {
                        "en": "dead leaves/wood/skin",
                        "vi": "lá chết / gỗ / da"
                    },
                    {
                        "en": "Catherine's dead body lay peacefully on the bed.",
                        "vi": "Xác chết của Catherine nằm yên bình trên giường."
                    },
                    {
                        "en": "He was shot dead by a gunman outside his home.",
                        "vi": "Anh ta đã bị bắn chết bởi một tay súng bên ngoài nhà của mình."
                    },
                    {
                        "en": "A high school shooting has left six students dead.",
                        "vi": "Một vụ nổ súng ở trường trung học đã khiến sáu học sinh thiệt mạng."
                    },
                    {
                        "en": "She was pronounced dead at the scene of the accident.",
                        "vi": "Cô được cho là đã chết tại hiện trường vụ tai nạn."
                    },
                    {
                        "en": "The poor child looks more dead than alive.",
                        "vi": "Đứa trẻ tội nghiệp trông chết hơn còn sống."
                    },
                    {
                        "en": "He was missing, presumed dead.",
                        "vi": "Anh ta mất tích, được cho là đã chết."
                    },
                    {
                        "en": "(informal) He dropped dead (= died suddenly) last week.",
                        "vi": "(không chính thức) Anh ấy đã chết (= chết đột ngột) vào tuần trước."
                    },
                    {
                        "en": "dead from/of something One short year later, Fred would be dead from a drug overdose.",
                        "vi": "chết vì / của thứ gì đó Một năm sau đó, Fred chết vì dùng ma túy quá liều."
                    },
                    {
                        "en": "(figurative) In ten years he'll be dead and buried as a politician.",
                        "vi": "(nghĩa bóng) Trong mười năm nữa, anh ta sẽ chết và được chôn cất như một chính trị gia."
                    }
                ]
            },
            {
                "define": {
                    "en": "not working because of a lack of power",
                    "vi": "không hoạt động vì thiếu điện"
                },
                "examples": [
                    {
                        "en": "a dead battery",
                        "vi": "pin chết"
                    },
                    {
                        "en": "Suddenly the phone went dead.",
                        "vi": "Đột nhiên điện thoại chết máy."
                    },
                    {
                        "en": "John's mobile was completely dead.",
                        "vi": "Điện thoại di động của John đã hoàn toàn chết."
                    }
                ]
            },
            {
                "define": {
                    "en": "no longer believed in or aimed for",
                    "vi": "không còn tin tưởng hoặc nhắm đến"
                },
                "examples": [
                    {
                        "en": "Many believe the peace plan is dead.",
                        "vi": "Nhiều người tin rằng kế hoạch hòa bình đã chết."
                    },
                    {
                        "en": "Unfortunately racism is not yet dead.",
                        "vi": "Thật không may, phân biệt chủng tộc vẫn chưa chết."
                    },
                    {
                        "en": "Though the idea may be dead, it is far from being buried (= people still talk about it, even though there is nothing new to say).",
                        "vi": "Mặc dù ý tưởng có thể đã chết, nhưng nó còn lâu mới bị chôn vùi (= mọi người vẫn nói về nó, mặc dù không có gì mới để nói)."
                    }
                ]
            },
            {
                "define": {
                    "en": "belonging to the past; no longer practised or fashionable",
                    "vi": "thuộc về quá khứ; không còn thực hành hoặc thời trang"
                },
                "examples": [
                    {
                        "en": "Is the Western a dead art form?",
                        "vi": "Phương Tây có phải là một loại hình nghệ thuật đã chết?"
                    },
                    {
                        "en": "a dead language (= one that is no longer spoken, for example Latin)",
                        "vi": "ngôn ngữ đã chết (= ngôn ngữ không còn được sử dụng, ví dụ như tiếng Latinh)"
                    }
                ]
            },
            {
                "define": {
                    "en": "finished; not able to be used any more",
                    "vi": "đã kết thúc; không thể được sử dụng nữa"
                },
                "examples": [
                    {
                        "en": "dead matches",
                        "vi": "trận đấu chết"
                    },
                    {
                        "en": "There were two dead bottles of wine on the table.",
                        "vi": "Có hai chai rượu đã chết trên bàn."
                    }
                ]
            },
            {
                "define": {
                    "en": "very quiet, without activity or interest",
                    "vi": "rất yên tĩnh, không có hoạt động hoặc quan tâm"
                },
                "examples": [
                    {
                        "en": "There were no theatres, no cinemas, no coffee bars. It was dead as anything.",
                        "vi": "Không có rạp hát, không có rạp chiếu phim, không có quán cà phê. Nó đã chết như bất cứ điều gì."
                    }
                ]
            },
            {
                "define": {
                    "en": "without activity; with nobody buying or selling anything",
                    "vi": "không có hoạt động; không ai mua hoặc bán bất cứ thứ gì"
                },
                "examples": [
                    {
                        "en": "‘The market is absolutely dead this morning,’ said one foreign exchange trader.",
                        "vi": "Một nhà kinh doanh ngoại hối cho biết: “Thị trường đã chết trong sáng nay."
                    },
                    {
                        "en": "Winter is traditionally the dead season for the housing market.",
                        "vi": "Theo truyền thống, mùa đông là mùa chết của thị trường nhà đất."
                    }
                ]
            },
            {
                "define": {
                    "en": "extremely tired; not well",
                    "vi": "mệt mỏi vô cùng; không tốt"
                },
                "examples": [
                    {
                        "en": "half dead with cold and hunger",
                        "vi": "chết một nửa vì lạnh và đói"
                    },
                    {
                        "en": "She felt dead on her feet and didn't have the energy to question them further.",
                        "vi": "Cô cảm thấy như chết đứng và không còn sức lực để tra hỏi chúng thêm nữa."
                    }
                ]
            },
            {
                "define": {
                    "en": "unable to feel because of cold, etc.",
                    "vi": "không thể cảm thấy vì lạnh, v.v."
                },
                "examples": [
                    {
                        "en": "My left arm had gone dead.",
                        "vi": "Cánh tay trái của tôi đã chết."
                    }
                ]
            },
            {
                "define": {
                    "en": "unable to feel or understand emotions",
                    "vi": "không thể cảm nhận hoặc hiểu được cảm xúc"
                },
                "examples": [
                    {
                        "en": "He was dead to all feelings of pity.",
                        "vi": "Anh đã chết trước tất cả cảm giác thương hại."
                    }
                ]
            },
            {
                "define": {
                    "en": "showing no emotion",
                    "vi": "không biểu lộ cảm xúc"
                },
                "examples": [
                    {
                        "en": "She said, ‘I'm sorry, too,’ in a quiet, dead voice.",
                        "vi": "Cô ấy nói, 'Tôi cũng xin lỗi,' bằng một giọng chết lặng."
                    },
                    {
                        "en": "His usually dead grey eyes were sparkling.",
                        "vi": "Đôi mắt xám thường chết của anh ấy lấp lánh."
                    }
                ]
            },
            {
                "define": {
                    "en": "complete or exact",
                    "vi": "đầy đủ hoặc chính xác"
                },
                "examples": [
                    {
                        "en": "a dead silence/calm",
                        "vi": "một sự im lặng chết chóc / bình tĩnh"
                    },
                    {
                        "en": "the dead centre of the target",
                        "vi": "trung tâm chết của mục tiêu"
                    },
                    {
                        "en": "The car gave a sudden jerk and came to a dead stop.",
                        "vi": "Chiếc xe bị giật một cách đột ngột và dừng lại."
                    },
                    {
                        "en": "(informal) Her face was a dead giveaway (= made it very obvious) that something was going on.",
                        "vi": "(thân mật) Khuôn mặt của cô ấy là một món quà chết chóc (= thể hiện rất rõ ràng) rằng có điều gì đó đang xảy ra."
                    },
                    {
                        "en": "(British English) This horse is a dead cert for (= will certainly win) the race tomorrow.",
                        "vi": "(Tiếng Anh Anh) Con ngựa này là chứng chỉ đã chết cho (= chắc chắn sẽ thắng) cuộc đua vào ngày mai."
                    },
                    {
                        "en": "She crumpled to the floor in a dead faint (= completely unconscious).",
                        "vi": "Cô gục xuống sàn trong tình trạng ngất xỉu (= hoàn toàn bất tỉnh)."
                    }
                ]
            },
            {
                "define": {
                    "en": "never having been alive",
                    "vi": "chưa bao giờ sống"
                },
                "examples": [
                    {
                        "en": "dead matter (= for example rock)",
                        "vi": "vật chất chết (= ví dụ đá)"
                    },
                    {
                        "en": "a dead planet (= one with no life on it)",
                        "vi": "một hành tinh chết (= một hành tinh không có sự sống trên đó)"
                    }
                ]
            },
            {
                "define": {
                    "en": "outside the playing area",
                    "vi": "bên ngoài khu vui chơi"
                },
                "examples": [
                    {
                        "en": "There was a dead ball with five seconds to go in the game.",
                        "vi": "Có một quả bóng chết còn năm giây nữa trong trò chơi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be dead",
                    "vi": "chết"
                },
                "examples": [
                    {
                        "en": "You'll be sorry you said that when I'm dead and gone.",
                        "vi": "Bạn sẽ rất tiếc vì đã nói điều đó khi tôi chết và ra đi."
                    },
                    {
                        "en": "That won't happen until long after I'm dead and gone.",
                        "vi": "Điều đó sẽ không xảy ra cho đến khi tôi chết và ra đi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to look very like somebody",
                    "vi": "trông rất giống ai đó"
                },
                "examples": [
                    {
                        "en": "She's a dead ringer for a girl I used to know.",
                        "vi": "Cô ấy là kẻ phá đám cho một cô gái tôi từng quen."
                    }
                ]
            },
            {
                "define": {
                    "en": "completely dead; no longer interesting or relevant",
                    "vi": "chết hoàn toàn; không còn thú vị hoặc phù hợp"
                },
                "examples": [
                    {
                        "en": "In the second half both teams made substitutions to try and liven things up, but the game was as dead as a dodo.",
                        "vi": "Trong hiệp hai, cả hai đội đã thay người để cố gắng và làm sống động mọi thứ, nhưng trận đấu diễn ra như chết vì dodo."
                    }
                ]
            },
            {
                "define": {
                    "en": "completely dead",
                    "vi": "chết hoàn toàn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a plan, an event, etc. that has failed or is certain to fail and that is therefore not worth discussing",
                    "vi": "một kế hoạch, một sự kiện, v.v. đã thất bại hoặc chắc chắn thất bại và điều đó không đáng bàn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "an influence that controls or limits something",
                    "vi": "một ảnh hưởng kiểm soát hoặc hạn chế một cái gì đó"
                },
                "examples": [
                    {
                        "en": "We need to free business from the dead hand of bureaucracy.",
                        "vi": "Chúng ta cần giải phóng doanh nghiệp khỏi bàn tay chết chóc của bộ máy quan liêu."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person or plan that is dead in the water has failed and has little hope of succeeding in the future",
                    "vi": "một người hoặc kế hoạch chết trong nước đã thất bại và có rất ít hy vọng thành công trong tương lai"
                },
                "examples": [
                    {
                        "en": "His leadership campaign is dead in the water.",
                        "vi": "Chiến dịch lãnh đạo của anh ta đã chết trong nước."
                    }
                ]
            },
            {
                "define": {
                    "en": "in serious trouble",
                    "vi": "gặp rắc rối nghiêm trọng"
                },
                "examples": [
                    {
                        "en": "If anyone finds out, you're dead meat.",
                        "vi": "Nếu ai đó phát hiện ra, bạn sẽ chết."
                    }
                ]
            },
            {
                "define": {
                    "en": "(of an accident victim or other patient) already dead when arriving at a hospital",
                    "vi": "(của một nạn nhân tai nạn hoặc bệnh nhân khác) đã chết khi đến bệnh viện"
                },
                "examples": [
                    {
                        "en": "She was pronounced dead on arrival.",
                        "vi": "Cô ấy được cho là đã chết khi đến nơi."
                    },
                    {
                        "en": "He didn’t even make it to hospital: DOA.",
                        "vi": "Anh ấy thậm chí còn không đến được bệnh viện: DOA."
                    },
                    {
                        "en": "Many of the casualties were dead on arrival.",
                        "vi": "Nhiều người trong số những người thương vong đã chết khi đến nơi."
                    }
                ]
            },
            {
                "define": {
                    "en": "very unlikely to be successful; not working when it is delivered",
                    "vi": "rất khó thành công; không hoạt động khi nó được giao"
                },
                "examples": [
                    {
                        "en": "The bill was dead on arrival in the Senate.",
                        "vi": "Dự luật đã chết khi đến Thượng viện."
                    },
                    {
                        "en": "The software was DOA.",
                        "vi": "Phần mềm là DOA."
                    }
                ]
            },
            {
                "define": {
                    "en": "in a deep sleep",
                    "vi": "trong một giấc ngủ sâu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to waste your effort by trying to do something that is no longer possible",
                    "vi": "lãng phí nỗ lực của bạn bằng cách cố gắng làm điều gì đó mà không còn khả thi"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to impress somebody very much",
                    "vi": "để gây ấn tượng với ai đó rất nhiều"
                },
                "examples": [
                    {
                        "en": "You look fabulous—you'll knock ’em dead tonight.",
                        "vi": "Trông bạn thật tuyệt vời - bạn sẽ đánh gục họ đêm nay."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to show you are strongly opposed to something",
                    "vi": "được sử dụng để cho thấy bạn phản đối mạnh mẽ điều gì đó"
                },
                "examples": [
                    {
                        "en": "She moves into our home over my dead body.",
                        "vi": "Cô ấy chuyển đến nhà của chúng tôi trên xác chết của tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that you would not like to wear particular clothes, or to be in a particular situation",
                    "vi": "từng nói rằng bạn không muốn mặc quần áo cụ thể hoặc ở trong một tình huống cụ thể"
                },
                "examples": [
                    {
                        "en": "She wouldn't be seen dead in a hat.",
                        "vi": "Cô ấy sẽ không bị coi là chết trong chiếc mũ."
                    },
                    {
                        "en": "He wouldn't be caught dead going to a club with his mother.",
                        "vi": "Anh ta sẽ không bị bắt chết khi đi câu lạc bộ với mẹ mình."
                    }
                ]
            }
        ]
    },
    {
        "id": "dd8c14e5afb7472d9d18e2b47fab4087",
        "word": "death",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/deθ/",
            "us": "/deθ/"
        },
        "nearby": [
            {
                "word": "dearly",
                "pos": "adverb"
            },
            {
                "word": "dearth",
                "pos": "noun"
            },
            {
                "word": "death",
                "pos": "noun"
            },
            {
                "word": "deathbed",
                "pos": "noun"
            },
            {
                "word": "death blow",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the fact of somebody dying or being killed",
                    "vi": "thực tế là ai đó chết hoặc bị giết"
                },
                "examples": [
                    {
                        "en": "the anniversary of his wife’s death",
                        "vi": "ngày giỗ của vợ"
                    },
                    {
                        "en": "his sudden/untimely/premature death",
                        "vi": "cái chết đột ngột / không đúng lúc / sớm của anh ấy"
                    },
                    {
                        "en": "the tragic death of a child",
                        "vi": "cái chết bi thảm của một đứa trẻ"
                    },
                    {
                        "en": "The jury returned a verdict of accidental death.",
                        "vi": "Bồi thẩm đoàn đã trả lại phán quyết về cái chết do tai nạn."
                    },
                    {
                        "en": "It is believed she died a violent death.",
                        "vi": "Người ta tin rằng cô ấy đã chết một cái chết dữ dội."
                    },
                    {
                        "en": "He suffered a slow and painful death.",
                        "vi": "Anh ta phải chịu một cái chết chậm rãi và đau đớn."
                    },
                    {
                        "en": "death from something an increase in deaths from cancer",
                        "vi": "tử vong do cái gì đó gia tăng số ca tử vong do ung thư"
                    }
                ]
            },
            {
                "define": {
                    "en": "the end of life; the state of being dead",
                    "vi": "cuối đời; trạng thái của cái chết"
                },
                "examples": [
                    {
                        "en": "Police are trying to establish the cause of death.",
                        "vi": "Cảnh sát đang cố gắng xác định nguyên nhân cái chết."
                    },
                    {
                        "en": "The disease can cause death unless the patient is treated promptly.",
                        "vi": "Bệnh có thể khiến người bệnh tử vong nếu không được điều trị kịp thời."
                    },
                    {
                        "en": "Do you believe in life after death?",
                        "vi": "Bạn có tin vào cuộc sống sau khi chết?"
                    },
                    {
                        "en": "He was sentenced to death (= to be executed).",
                        "vi": "Anh ta bị kết án tử hình (= bị tử hình)."
                    },
                    {
                        "en": "to death Millions of people starved to death (= were killed by lack of food).",
                        "vi": "đến chết Hàng triệu người chết đói (= bị giết vì thiếu lương thực)."
                    },
                    {
                        "en": "He's drinking himself to death (= so that it will kill him).",
                        "vi": "Anh ta đang tự uống rượu đến chết (= để nó giết anh ta)."
                    },
                    {
                        "en": "to beat/kick/stab, etc. somebody to death",
                        "vi": "đánh / đá / đâm, v.v. ai đó đến chết"
                    }
                ]
            },
            {
                "define": {
                    "en": "the stopping of biochemical processes of life in a cell or tissue, in a way that cannot be reversed",
                    "vi": "sự dừng các quá trình sinh hóa của sự sống trong tế bào hoặc mô, theo cách không thể đảo ngược"
                },
                "examples": [
                    {
                        "en": "This process becomes irreversible and leads to cell death.",
                        "vi": "Quá trình này trở nên không thể đảo ngược và dẫn đến chết tế bào."
                    }
                ]
            },
            {
                "define": {
                    "en": "the permanent end or destruction of something",
                    "vi": "sự kết thúc vĩnh viễn hoặc sự phá hủy của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "the death of all my plans",
                        "vi": "cái chết của tất cả các kế hoạch của tôi"
                    },
                    {
                        "en": "the death of fascism",
                        "vi": "cái chết của chủ nghĩa phát xít"
                    },
                    {
                        "en": "By 1740 European feudalism was in its death throes.",
                        "vi": "Đến năm 1740, chế độ phong kiến châu Âu đang trong giai đoạn tàn lụi."
                    },
                    {
                        "en": "Delivering on time is a matter of life and death for a small company.",
                        "vi": "Giao hàng đúng hạn là vấn đề sinh tử đối với một công ty nhỏ."
                    }
                ]
            },
            {
                "define": {
                    "en": "the power that destroys life, imagined as human in form",
                    "vi": "sức mạnh hủy diệt cuộc sống, được tưởng tượng như con người trong hình dạng"
                },
                "examples": [
                    {
                        "en": "Death is often shown in paintings as a human skeleton.",
                        "vi": "Cái chết thường được thể hiện trong các bức tranh là một bộ xương người."
                    },
                    {
                        "en": "Death marched in and took him away.",
                        "vi": "Thần chết hành quân đến và đưa anh ta đi."
                    }
                ]
            },
            {
                "define": {
                    "en": "so ill that you may die",
                    "vi": "ốm đến nỗi bạn có thể chết"
                },
                "examples": [
                    {
                        "en": "I suppose you won’t be coming to the party if you’re at death’s door!",
                        "vi": "Tôi cho rằng bạn sẽ không đến bữa tiệc nếu bạn đang ở ngưỡng cửa tử thần!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to worry or upset somebody very much",
                    "vi": "lo lắng hoặc buồn phiền ai đó rất nhiều"
                },
                "examples": [
                    {
                        "en": "Those kids will be the death of me.",
                        "vi": "Những đứa trẻ đó sẽ là tử thần của tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to catch a very bad cold",
                    "vi": "bị cảm lạnh rất nặng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to survive in a situation where you could have died",
                    "vi": "để tồn tại trong một tình huống mà bạn có thể đã chết"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to risk your life by doing something that you know is dangerous",
                    "vi": "mạo hiểm mạng sống của bạn bằng cách làm điều gì đó mà bạn biết là nguy hiểm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to fail completely",
                    "vi": "thất bại hoàn toàn"
                },
                "examples": [
                    {
                        "en": "The play got terrible reviews and quickly died a death.",
                        "vi": "Vở kịch bị đánh giá khủng khiếp và nhanh chóng chết một cách chết chóc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to do or perform something so often that people become tired of seeing or hearing it",
                    "vi": "làm hoặc thực hiện một điều gì đó thường xuyên đến mức mọi người cảm thấy mệt mỏi khi nhìn hoặc nghe thấy nó"
                },
                "examples": [
                    {
                        "en": "That joke's been done to death.",
                        "vi": "Trò đùa đó đã được thực hiện đến chết."
                    }
                ]
            },
            {
                "define": {
                    "en": "a terrible thing that could happen",
                    "vi": "một điều khủng khiếp có thể xảy ra"
                },
                "examples": [
                    {
                        "en": "At the last minute the hero saves her from a fate worse than death.",
                        "vi": "Vào phút cuối, người hùng cứu cô khỏi số phận còn hơn cả cái chết."
                    }
                ]
            },
            {
                "define": {
                    "en": "to fight until one of the two people or groups is dead, or until one person or group defeats the other",
                    "vi": "chiến đấu cho đến khi một trong hai người hoặc nhóm chết, hoặc cho đến khi một người hoặc nhóm đánh bại người kia"
                },
                "examples": [
                    {
                        "en": "The soldiers were prepared to fight to the death if they had to.",
                        "vi": "Những người lính đã sẵn sàng chiến đấu đến chết nếu họ phải làm vậy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to use an idea, a story, etc. so often that it is no longer interesting",
                    "vi": "sử dụng một ý tưởng, một câu chuyện, v.v. thường xuyên đến mức nó không còn thú vị nữa"
                },
                "examples": [
                    {
                        "en": "The story has been flogged to death in the press.",
                        "vi": "Câu chuyện đã được tung lên mạng trên báo chí."
                    }
                ]
            },
            {
                "define": {
                    "en": "to frighten somebody very much",
                    "vi": "làm ai đó sợ hãi rất nhiều"
                },
                "examples": [
                    {
                        "en": "Spiders frighten him to death.",
                        "vi": "Nhện khiến anh ta sợ đến chết đi sống lại."
                    }
                ]
            },
            {
                "define": {
                    "en": "to hold somebody/something very tightly or keep something in a very determined way because you are afraid",
                    "vi": "giữ ai đó / cái gì đó thật chặt hoặc giữ một cái gì đó một cách rất kiên quyết bởi vì bạn sợ"
                },
                "examples": [
                    {
                        "en": "You get a job, then you get a mortgage and then you hang on like grim death to your job to pay off the mortgage.",
                        "vi": "Bạn kiếm được một công việc, sau đó bạn nhận được một khoản thế chấp và sau đó bạn cứ như chết đi sống lại với công việc của mình để trả nợ thế chấp."
                    }
                ]
            },
            {
                "define": {
                    "en": "an event that seems good, but is certain to make something else fail",
                    "vi": "một sự kiện có vẻ tốt, nhưng chắc chắn sẽ làm cho thứ khác thất bại"
                },
                "examples": [
                    {
                        "en": "An award can be the kiss of death for a writer.",
                        "vi": "Một giải thưởng có thể là nụ hôn của thần chết đối với một nhà văn."
                    },
                    {
                        "en": "That TV commercial was the kiss of death to his career as a serious actor.",
                        "vi": "Quảng cáo truyền hình đó là nụ hôn chết chóc đối với sự nghiệp diễn viên nghiêm túc của anh ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "the possibility or belief that people continue to exist in some form after they die",
                    "vi": "khả năng hoặc niềm tin rằng con người tiếp tục tồn tại dưới một hình thức nào đó sau khi họ chết"
                },
                "examples": [
                    {
                        "en": "Do you believe in life after death?",
                        "vi": "Bạn có tin vào cuộc sống sau khi chết?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to look or feel very ill or tired",
                    "vi": "trông hoặc cảm thấy rất ốm hoặc mệt mỏi"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to describe a situation that is very important or serious",
                    "vi": "được sử dụng để mô tả một tình huống rất quan trọng hoặc nghiêm trọng"
                },
                "examples": [
                    {
                        "en": "You mustn't let anyone know— it's a matter of life and death.",
                        "vi": "Bạn không được để bất kỳ ai biết - đó là vấn đề sống chết."
                    },
                    {
                        "en": "These talks are a matter of life or death for the factory.",
                        "vi": "Những cuộc đàm phán này là vấn đề sống chết của nhà máy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to kill somebody as a punishment",
                    "vi": "giết ai đó như một hình phạt"
                },
                "examples": [
                    {
                        "en": "The prisoner will be put to death at dawn.",
                        "vi": "Tù nhân sẽ bị xử tử vào lúc bình minh."
                    }
                ]
            },
            {
                "define": {
                    "en": "extremely; very much",
                    "vi": "cực kì; rất nhiều"
                },
                "examples": [
                    {
                        "en": "to be bored to death",
                        "vi": "chán chết đi được"
                    },
                    {
                        "en": "I'm sick to death of your endless criticism.",
                        "vi": "Tôi phát ốm chết vì những lời chỉ trích vô tận của bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "until somebody is dead",
                    "vi": "cho đến khi ai đó chết"
                },
                "examples": [
                    {
                        "en": "a fight to the death",
                        "vi": "một cuộc chiến đến chết"
                    }
                ]
            }
        ]
    },
    {
        "id": "b44de42455814634bc6db2ee21a28451",
        "word": "bury",
        "pos": "verb",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈberi/",
            "us": "/ˈberi/"
        },
        "nearby": [
            {
                "word": "Burundi",
                "pos": "noun"
            },
            {
                "word": "Burundian",
                "pos": "noun, adjective"
            },
            {
                "word": "bury",
                "pos": "verb"
            },
            {
                "word": "bury yourself in",
                "pos": "phrasal verb"
            },
            {
                "word": "bus",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to place a dead body in the ground",
                    "vi": "đặt một xác chết dưới đất"
                },
                "examples": [
                    {
                        "en": "bury somebody/something They killed her and buried her body.",
                        "vi": "chôn ai đó / cái gì đó Họ đã giết cô ấy và chôn xác cô ấy."
                    },
                    {
                        "en": "bury somebody/something + adv./prep. He was buried in Highgate Cemetery.",
                        "vi": "chôn ai đó / cái gì đó + adv./prep. Ông được chôn cất tại Nghĩa trang Highgate."
                    },
                    {
                        "en": "(figurative) Their ambitions were finally dead and buried.",
                        "vi": "(nghĩa bóng) Tham vọng của họ cuối cùng đã chết và bị chôn vùi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to lose somebody by death",
                    "vi": "để mất ai đó bằng cái chết"
                },
                "examples": [
                    {
                        "en": "She's 85 and has buried three husbands.",
                        "vi": "Bà 85 tuổi và đã chôn cất ba đời chồng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to hide something in the ground",
                    "vi": "giấu một cái gì đó dưới đất"
                },
                "examples": [
                    {
                        "en": "bury something We used to dig for hours, looking for buried treasure.",
                        "vi": "chôn thứ gì đó Chúng ta đã từng đào hàng giờ, tìm kiếm kho báu bị chôn vùi."
                    },
                    {
                        "en": "They plan to bury a time capsule containing work from every child in the school.",
                        "vi": "Họ dự định chôn một viên thời gian chứa công việc của mọi đứa trẻ trong trường."
                    },
                    {
                        "en": "bury something + adv./prep. The dog had buried its bone in the garden.",
                        "vi": "chôn cái gì đó + adv./prep. Con chó đã chôn xương trong vườn."
                    },
                    {
                        "en": "The waste is buried deep underground.",
                        "vi": "Chất thải được chôn sâu dưới lòng đất."
                    }
                ]
            },
            {
                "define": {
                    "en": "to cover somebody/something with soil, rocks, leaves, etc.",
                    "vi": "để che phủ ai đó / thứ gì đó bằng đất, đá, lá cây, v.v."
                },
                "examples": [
                    {
                        "en": "bury somebody/something A landslide buried about 25 people yesterday.",
                        "vi": "chôn ai đó / cái gì đó Một trận lở đất đã chôn vùi khoảng 25 người vào ngày hôm qua."
                    },
                    {
                        "en": "bury somebody/something + adv./prep. The house was buried under ten feet of snow.",
                        "vi": "chôn ai đó / cái gì đó + adv./prep. Ngôi nhà đã bị chôn vùi dưới lớp tuyết dày 10 feet."
                    },
                    {
                        "en": "Another vehicle was found buried under rubble.",
                        "vi": "Một phương tiện khác được tìm thấy bị chôn vùi dưới đống đổ nát."
                    },
                    {
                        "en": "bury somebody/something + adj. The miners were buried alive when the tunnel collapsed.",
                        "vi": "chôn ai đó / cái gì đó + adj. Những người thợ mỏ bị chôn sống khi đường hầm bị sập."
                    }
                ]
            },
            {
                "define": {
                    "en": "to cover something so that it cannot be seen",
                    "vi": "để che một cái gì đó để nó không thể được nhìn thấy"
                },
                "examples": [
                    {
                        "en": "Your letter got buried under a pile of papers.",
                        "vi": "Bức thư của bạn đã bị chôn vùi dưới một đống giấy tờ."
                    },
                    {
                        "en": "He buried his face in his hands and wept.",
                        "vi": "Anh vùi mặt vào tay mình và khóc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to ignore or hide a feeling, a mistake, etc.",
                    "vi": "bỏ qua hoặc che giấu một cảm giác, một sai lầm, v.v."
                },
                "examples": [
                    {
                        "en": "She had learnt to bury her feelings.",
                        "vi": "Cô đã học cách chôn giấu cảm xúc của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to put something deeply into something else",
                    "vi": "đặt một cái gì đó sâu vào một cái gì đó khác"
                },
                "examples": [
                    {
                        "en": "He walked slowly, his hands buried in his pockets.",
                        "vi": "Anh chậm rãi bước đi, hai tay vùi vào túi quần."
                    },
                    {
                        "en": "She always has her head buried in a book.",
                        "vi": "Cô ấy luôn vùi đầu vào sách."
                    }
                ]
            },
            {
                "define": {
                    "en": "to stop not being friendly and become friends again",
                    "vi": "ngừng không thân thiện và trở thành bạn bè một lần nữa"
                },
                "examples": [
                    {
                        "en": "After not speaking to each other for years, the two brothers decided to bury the hatchet.",
                        "vi": "Sau nhiều năm không nói với nhau lời nào, hai anh em quyết định chôn cất cái hầm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to refuse to admit that a problem exists or refuse to deal with it",
                    "vi": "từ chối thừa nhận rằng một vấn đề tồn tại hoặc từ chối giải quyết nó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to give the most important point of a news story near the end instead of at the beginning",
                    "vi": "để đưa ra điểm quan trọng nhất của một câu chuyện tin tức ở gần cuối thay vì ở đầu"
                },
                "examples": [
                    {
                        "en": "Unfortunately, he buried the lede in the last paragraph of the story.",
                        "vi": "Thật không may, anh ta đã chôn con chì trong đoạn cuối của câu chuyện."
                    }
                ]
            }
        ]
    },
    {
        "id": "a80086069bb44c0d8307603d121a2a79",
        "word": "burial",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈberiəl/",
            "us": "/ˈberiəl/"
        },
        "nearby": [
            {
                "word": "burgundy",
                "pos": "noun"
            },
            {
                "word": "burgundy",
                "pos": "adjective"
            },
            {
                "word": "burial",
                "pos": "noun"
            },
            {
                "word": "burial ground",
                "pos": "noun"
            },
            {
                "word": "burka",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act or ceremony of burying a dead body",
                    "vi": "hành động hoặc nghi lễ chôn cất một xác chết"
                },
                "examples": [
                    {
                        "en": "a burial place/mound/site",
                        "vi": "một nơi chôn cất / gò đất / địa điểm"
                    },
                    {
                        "en": "Her body was sent home for burial.",
                        "vi": "Thi thể của cô đã được đưa về nhà để mai táng."
                    },
                    {
                        "en": "His family insisted he should be given a proper burial.",
                        "vi": "Gia đình anh khẳng định anh nên được chôn cất đàng hoàng."
                    },
                    {
                        "en": "baptism, marriage and burial services",
                        "vi": "lễ rửa tội, hôn nhân và mai táng"
                    }
                ]
            }
        ]
    },
    {
        "id": "48d404e25daa41c68b866c71c32d25d6",
        "word": "cemetery",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈsemətri/",
            "us": "/ˈseməteri/"
        },
        "nearby": [
            {
                "word": "cementation",
                "pos": "noun"
            },
            {
                "word": "cement mixer",
                "pos": "noun"
            },
            {
                "word": "cemetery",
                "pos": "noun"
            },
            {
                "word": "cenotaph",
                "pos": "noun"
            },
            {
                "word": "censer",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an area of land used for burying dead people, especially one that is not next to a church",
                    "vi": "một khu đất được sử dụng để chôn cất người chết, đặc biệt là một khu vực không cạnh nhà thờ"
                },
                "examples": [
                    {
                        "en": "He was buried in a private cemetery.",
                        "vi": "Ông được chôn cất tại một nghĩa trang riêng."
                    }
                ]
            }
        ]
    },
    {
        "id": "c692bb9dd3d24393beb8659f1617a538",
        "word": "coffin",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈkɒfɪn/",
            "us": "/ˈkɔːfɪn/"
        },
        "nearby": [
            {
                "word": "coffee-table book",
                "pos": "noun"
            },
            {
                "word": "coffer",
                "pos": "noun"
            },
            {
                "word": "coffin",
                "pos": "noun"
            },
            {
                "word": "cog",
                "pos": "noun"
            },
            {
                "word": "cogency",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a box in which a dead body is buried or cremated",
                    "vi": "một cái hộp trong đó một xác chết được chôn cất hoặc hỏa táng"
                },
                "examples": [
                    {
                        "en": "A procession of mourners slowly followed the coffin.",
                        "vi": "Một đoàn xe tang chậm rãi đi sau linh cữu."
                    },
                    {
                        "en": "the flag-draped coffins of soldiers coming home",
                        "vi": "quan tài phủ cờ của binh lính trở về nhà"
                    }
                ]
            },
            {
                "define": {
                    "en": "something that makes the end or failure of an organization, somebody’s plans, etc. more likely to happen",
                    "vi": "điều gì đó làm cho sự kết thúc hoặc thất bại của một tổ chức, kế hoạch của ai đó, v.v. có nhiều khả năng xảy ra hơn"
                },
                "examples": [
                    {
                        "en": "This latest defeat is another nail in the government's coffin.",
                        "vi": "Thất bại mới nhất này là một chiếc đinh khác trong quan tài của chính phủ."
                    }
                ]
            }
        ]
    },
    {
        "id": "a5c2212373eb4bd9b81741a5bddf9233",
        "word": "funeral",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈfjuːnərəl/",
            "us": "/ˈfjuːnərəl/"
        },
        "nearby": [
            {
                "word": "fundraiser",
                "pos": "noun"
            },
            {
                "word": "fundraising",
                "pos": "noun"
            },
            {
                "word": "funeral",
                "pos": "noun"
            },
            {
                "word": "funeral director",
                "pos": "noun"
            },
            {
                "word": "funeral parlour",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a ceremony, often a religious one, for burying or cremating (= burning) a dead person",
                    "vi": "một nghi lễ, thường là một nghi lễ tôn giáo, để chôn hoặc hỏa táng (= thiêu) một người đã chết"
                },
                "examples": [
                    {
                        "en": "Hundreds of people attended the funeral.",
                        "vi": "Hàng trăm người đã đến tham dự lễ tang."
                    },
                    {
                        "en": "a funeral procession",
                        "vi": "một đám tang"
                    },
                    {
                        "en": "a funeral march (= a sad piece of music suitable for funerals)",
                        "vi": "a tang diễu hành (= một bản nhạc buồn thích hợp cho tang lễ)"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to tell somebody that they, and nobody else, will have to deal with the unpleasant results of their own actions",
                    "vi": "được sử dụng để nói với ai đó rằng họ, và không ai khác, sẽ phải đối mặt với những kết quả khó chịu do hành động của chính họ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "2f9a9788fb314f71a9acb7b1b3640539",
        "word": "grave",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ɡreɪv/",
            "us": "/ɡreɪv/"
        },
        "nearby": [
            {
                "word": "gratuity",
                "pos": "noun"
            },
            {
                "word": "Grauman's Chinese Theater",
                "pos": ""
            },
            {
                "word": "grave1",
                "pos": "noun"
            },
            {
                "word": "grave1",
                "pos": "adjective"
            },
            {
                "word": "grave2",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a place in the ground where a dead person is buried",
                    "vi": "một nơi chôn cất người chết trong lòng đất"
                },
                "examples": [
                    {
                        "en": "We visited Grandma's grave.",
                        "vi": "Chúng tôi đến thăm mộ Bà."
                    },
                    {
                        "en": "British war graves in France and Belgium",
                        "vi": "Những ngôi mộ chiến tranh của Anh ở Pháp và Bỉ"
                    },
                    {
                        "en": "in a grave The plague victims were buried in a mass grave.",
                        "vi": "trong một ngôi mộ Các nạn nhân của bệnh dịch đã được chôn cất trong một ngôi mộ tập thể."
                    },
                    {
                        "en": "on a grave There were flowers on the grave.",
                        "vi": "trên mộ Đã có hoa trên mộ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a way of referring to death or a person’s death",
                    "vi": "một cách đề cập đến cái chết hoặc cái chết của một người"
                },
                "examples": [
                    {
                        "en": "Is there life beyond the grave (= life after death)?",
                        "vi": "Có sự sống bên ngoài nấm mồ (= cuộc sống sau khi chết) không?"
                    },
                    {
                        "en": "He followed her to the grave (= died soon after her).",
                        "vi": "Anh ấy theo cô ấy đến mộ (= chết ngay sau cô ấy)."
                    },
                    {
                        "en": "She smoked herself into an early grave (= died young as a result of smoking).",
                        "vi": "Cô ấy đã tự hút thuốc vào một ngôi mộ sớm (= chết trẻ do hút thuốc)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to do something that will have very harmful results for you",
                    "vi": "làm điều gì đó sẽ có kết quả rất có hại cho bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a way of referring to the whole of a person’s life, from birth until death",
                    "vi": "một cách đề cập đến toàn bộ cuộc đời của một người, từ khi sinh ra cho đến khi chết"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be so old or ill that you are not likely to live much longer",
                    "vi": "già hoặc ốm đến nỗi bạn không có khả năng sống lâu hơn nữa"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "likely to be very shocked or angry",
                    "vi": "có khả năng rất sốc hoặc tức giận"
                },
                "examples": [
                    {
                        "en": "My father would turn in his grave if he knew.",
                        "vi": "Cha tôi sẽ lật tẩy nếu ông ấy biết."
                    }
                ]
            }
        ]
    },
    {
        "id": "2f3b25095d0f49d28f2abd56307693b7",
        "word": "graveyard",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈɡreɪvjɑːd/",
            "us": "/ˈɡreɪvjɑːrd/"
        },
        "nearby": [
            {
                "word": "graveside",
                "pos": "noun"
            },
            {
                "word": "gravestone",
                "pos": "noun"
            },
            {
                "word": "graveyard",
                "pos": "noun"
            },
            {
                "word": "graveyard shift",
                "pos": "noun"
            },
            {
                "word": "gravid",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an area of land, often near a church, where people are buried",
                    "vi": "một khu đất, thường gần nhà thờ, nơi chôn cất người ta"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a place where things or people that are not wanted are sent or left",
                    "vi": "một nơi mà những thứ hoặc những người không muốn được gửi đi hoặc để lại"
                },
                "examples": [
                    {
                        "en": "a graveyard for cars",
                        "vi": "một nghĩa địa cho ô tô"
                    },
                    {
                        "en": "The club has become a graveyard for mediocre provincial bands.",
                        "vi": "Câu lạc bộ đã trở thành nghĩa địa cho những ban nhạc tầm thường của tỉnh."
                    }
                ]
            }
        ]
    },
    {
        "id": "ac1354b96be94ca0baa32372439c2077",
        "word": "pass away",
        "pos": "phrasal verb",
        "level": "c1",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "pass around",
                "pos": "phrasal verb"
            },
            {
                "word": "pass as",
                "pos": "phrasal verb"
            },
            {
                "word": "pass away",
                "pos": "phrasal verb"
            },
            {
                "word": "passbook",
                "pos": "noun"
            },
            {
                "word": "pass by",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to die. People say ‘pass away’ to avoid saying ‘die’.",
                    "vi": "chết. Người ta nói 'chết đi' để tránh nói 'chết đi'."
                },
                "examples": [
                    {
                        "en": "His mother passed away last year.",
                        "vi": "Mẹ anh ấy đã qua đời vào năm ngoái."
                    }
                ]
            },
            {
                "define": {
                    "en": "to stop existing",
                    "vi": "ngừng tồn tại"
                },
                "examples": [
                    {
                        "en": "civilizations that have passed away",
                        "vi": "nền văn minh đã qua đời"
                    }
                ]
            }
        ]
    },
    {
        "id": "6c5dd10fa583457eac98ff73dfdb5128",
        "word": "remains",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/rɪˈmeɪnz/",
            "us": "/rɪˈmeɪnz/"
        },
        "nearby": [
            {
                "word": "Remainer",
                "pos": "noun"
            },
            {
                "word": "remaining",
                "pos": "adjective"
            },
            {
                "word": "remains",
                "pos": "noun"
            },
            {
                "word": "remake",
                "pos": "noun"
            },
            {
                "word": "remake",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the parts of something that are left after the other parts have been used, eaten, removed, etc.",
                    "vi": "các bộ phận của một thứ gì đó còn sót lại sau khi các bộ phận khác đã được sử dụng, ăn, loại bỏ, v.v."
                },
                "examples": [
                    {
                        "en": "She fed the remains of her lunch to the dog.",
                        "vi": "Cô cho con chó ăn những phần còn lại trong bữa trưa của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "the parts of ancient objects and buildings that have survived and are discovered in the present day",
                    "vi": "các bộ phận của các đồ vật và tòa nhà cổ đại còn tồn tại và được khám phá cho đến ngày nay"
                },
                "examples": [
                    {
                        "en": "The museum has an impressive collection of prehistoric remains.",
                        "vi": "Bảo tàng có một bộ sưu tập ấn tượng về các di tích thời tiền sử."
                    },
                    {
                        "en": "the remains of a Roman fort",
                        "vi": "tàn tích của một pháo đài La Mã"
                    }
                ]
            },
            {
                "define": {
                    "en": "the body of a dead person or animal",
                    "vi": "xác của một người hoặc động vật đã chết"
                },
                "examples": [
                    {
                        "en": "They had discovered human remains.",
                        "vi": "Họ đã phát hiện ra hài cốt của con người."
                    }
                ]
            }
        ]
    },
    {
        "id": "5bed4f89a5b2464eb1fd16455a5de9c4",
        "word": "ash",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/æʃ/",
            "us": "/æʃ/"
        },
        "nearby": [
            {
                "word": "asexually",
                "pos": "adverb"
            },
            {
                "word": "ash blonde",
                "pos": "noun"
            },
            {
                "word": "ash",
                "pos": "noun"
            },
            {
                "word": "ASH",
                "pos": "abbreviation"
            },
            {
                "word": "ashamed",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the grey or black powder that is left after something, especially tobacco, wood or coal, has burnt",
                    "vi": "bột màu xám hoặc đen còn sót lại sau một thứ gì đó, đặc biệt là thuốc lá, gỗ hoặc than, đã cháy"
                },
                "examples": [
                    {
                        "en": "cigarette ash",
                        "vi": "tro thuốc lá"
                    },
                    {
                        "en": "black volcanic ash",
                        "vi": "tro núi lửa đen"
                    },
                    {
                        "en": "Ash from the volcano fell over a wide area.",
                        "vi": "Tro từ núi lửa rơi xuống trên một khu vực rộng lớn."
                    },
                    {
                        "en": "She flicked ash out of the window carelessly.",
                        "vi": "Cô bất cẩn hất tro ra ngoài cửa sổ."
                    }
                ]
            },
            {
                "define": {
                    "en": "what is left after something has been destroyed by burning",
                    "vi": "những gì còn lại sau khi một cái gì đó đã bị phá hủy bằng cách đốt cháy"
                },
                "examples": [
                    {
                        "en": "The town was reduced to ashes in the fighting.",
                        "vi": "Thị trấn đã biến thành tro tàn trong cuộc giao tranh."
                    },
                    {
                        "en": "the glowing ashes of the campfire",
                        "vi": "tro tàn rực sáng của lửa trại"
                    },
                    {
                        "en": "The fire had died to cold ashes.",
                        "vi": "Ngọn lửa đã tàn thành tro lạnh."
                    },
                    {
                        "en": "(figurative) The party had risen, like a phoenix, from the ashes of electoral disaster.",
                        "vi": "(nghĩa bóng) Đảng đã trỗi dậy, như một con phượng hoàng, từ đống tro tàn của thảm họa bầu cử."
                    },
                    {
                        "en": "She had seen all her dreams turn to ashes.",
                        "vi": "Cô đã thấy tất cả những giấc mơ của mình đều biến thành tro bụi."
                    }
                ]
            },
            {
                "define": {
                    "en": "the powder that is left after a dead person’s body has been cremated (= burned)",
                    "vi": "bột còn sót lại sau khi xác một người chết đã được hỏa táng (= thiêu)"
                },
                "examples": [
                    {
                        "en": "She wanted her ashes to be scattered at sea.",
                        "vi": "Cô muốn tro của mình được rải trên biển."
                    }
                ]
            },
            {
                "define": {
                    "en": "a forest tree with grey bark",
                    "vi": "cây rừng có vỏ màu xám"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the hard pale wood of the ash tree",
                    "vi": "gỗ nhạt màu cứng của cây tần bì"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the letter æ, used in Old English, and as a phonetic symbol to represent the vowel sound in cat",
                    "vi": "chữ æ, được sử dụng trong tiếng Anh cổ, và như một biểu tượng ngữ âm để biểu thị nguyên âm trong mèo"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to behave in a way that shows that you are sorry for something that you have done",
                    "vi": "cư xử theo cách thể hiện rằng bạn xin lỗi vì điều gì đó mà bạn đã làm"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "b18ea6cba71148699cdb92965de0516a",
        "word": "assisted dying",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/əˌsɪstɪd ˈdaɪɪŋ/",
            "us": "/əˌsɪstɪd ˈdaɪɪŋ/"
        },
        "nearby": [
            {
                "word": "assistantship",
                "pos": "noun"
            },
            {
                "word": "assisted area",
                "pos": "noun"
            },
            {
                "word": "assisted dying",
                "pos": "noun"
            },
            {
                "word": "assisted living",
                "pos": "noun"
            },
            {
                "word": "assisted suicide",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act of a person ending their life with the help of a doctor, because they are suffering from a disease that has no cure",
                    "vi": "Hành động của một người tự kết liễu cuộc đời mình với sự giúp đỡ của bác sĩ, vì họ đang mắc phải một căn bệnh vô phương cứu chữa"
                },
                "examples": [
                    {
                        "en": "The Bill seeks to legalize the choice of assisted dying for terminally ill adults with less than six months to live.",
                        "vi": "Dự luật tìm cách hợp pháp hóa lựa chọn được hỗ trợ chết cho những người lớn mắc bệnh nan y chỉ còn sống được dưới sáu tháng."
                    }
                ]
            }
        ]
    },
    {
        "id": "acecfa3e9bd542cea184f965859cab06",
        "word": "at rest",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/rest/",
            "us": "/rest/"
        },
        "nearby": [
            {
                "word": "respray",
                "pos": "noun"
            },
            {
                "word": "respray",
                "pos": "verb"
            },
            {
                "word": "rest",
                "pos": "noun"
            },
            {
                "word": "rest",
                "pos": "verb"
            },
            {
                "word": "rest area",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the part of something that remains",
                    "vi": "một phần của cái gì đó vẫn còn"
                },
                "examples": [
                    {
                        "en": "Take what you want and throw the rest away.",
                        "vi": "Lấy những gì bạn muốn và vứt bỏ những thứ còn lại."
                    },
                    {
                        "en": "the rest of something The country enjoys friendly relations with the rest of the world.",
                        "vi": "phần còn lại của điều gì đó Đất nước có quan hệ hữu nghị với phần còn lại của thế giới."
                    },
                    {
                        "en": "How would you like to spend the rest of the day?",
                        "vi": "Bạn muốn dành thời gian còn lại trong ngày như thế nào?"
                    },
                    {
                        "en": "for the rest of something I'm not doing this job for the rest of my life.",
                        "vi": "cho phần còn lại của một cái gì đó tôi sẽ không làm công việc này trong suốt phần đời còn lại của tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "the people or things that remain; the others",
                    "vi": "những người hoặc những thứ còn lại; những người khác"
                },
                "examples": [
                    {
                        "en": "The first question was difficult, but the rest were pretty easy.",
                        "vi": "Câu hỏi đầu tiên rất khó, nhưng những câu còn lại khá dễ."
                    },
                    {
                        "en": "the rest of something Don't blame Alex. He's human, like the rest of us.",
                        "vi": "phần còn lại của điều gì đó Đừng đổ lỗi cho Alex. Anh ấy là con người, giống như phần còn lại của chúng ta."
                    }
                ]
            },
            {
                "define": {
                    "en": "a period of relaxing, sleeping or doing nothing after a period of activity",
                    "vi": "một khoảng thời gian thư giãn, ngủ hoặc không làm gì sau một thời gian hoạt động"
                },
                "examples": [
                    {
                        "en": "I had a good night's rest.",
                        "vi": "Tôi đã có một đêm nghỉ ngơi tốt."
                    },
                    {
                        "en": "We stopped for a well-earned rest.",
                        "vi": "Chúng tôi dừng lại để nghỉ ngơi kiếm được nhiều tiền."
                    },
                    {
                        "en": "rest from something to have/take a rest from all your hard work",
                        "vi": "nghỉ ngơi từ một cái gì đó để có / nghỉ ngơi sau tất cả công việc khó khăn của bạn"
                    },
                    {
                        "en": "Try to get some rest—you have a busy day tomorrow.",
                        "vi": "Hãy cố gắng nghỉ ngơi — ngày mai bạn có một ngày bận rộn."
                    },
                    {
                        "en": "There are no matches tomorrow, which is a rest day, but the tournament resumes on Monday.",
                        "vi": "Không có trận đấu nào vào ngày mai, đó là một ngày nghỉ ngơi, nhưng giải đấu sẽ tiếp tục vào thứ Hai."
                    }
                ]
            },
            {
                "define": {
                    "en": "an object that is used to support or hold something",
                    "vi": "một đối tượng được sử dụng để hỗ trợ hoặc giữ một cái gì đó"
                },
                "examples": [
                    {
                        "en": "an armrest (= for example on a seat or chair)",
                        "vi": "tay vịn (= ví dụ trên ghế hoặc ghế)"
                    }
                ]
            },
            {
                "define": {
                    "en": "a period of silence between notes; a sign that shows a rest between notes",
                    "vi": "khoảng thời gian im lặng giữa các nốt nhạc; một dấu hiệu cho thấy phần còn lại giữa các ghi chú"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used at the end of a list to mean everything else that you might expect to be on the list",
                    "vi": "được sử dụng ở cuối danh sách để có nghĩa là mọi thứ khác mà bạn có thể mong đợi sẽ có trong danh sách"
                },
                "examples": [
                    {
                        "en": "He wants a big house and an expensive car and all the rest of it.",
                        "vi": "Anh ta muốn một ngôi nhà lớn và một chiếc xe hơi đắt tiền và tất cả những thứ còn lại."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that the actual amount or number of something is much higher than somebody has stated",
                    "vi": "được sử dụng để nói rằng số lượng hoặc số lượng thực tế của một cái gì đó cao hơn nhiều so với ai đó đã tuyên bố"
                },
                "examples": [
                    {
                        "en": "‘It cost 250 pounds…’ ‘And the rest, and the rest!’",
                        "vi": "Nó có giá 250 bảng Anh ... \"Và phần còn lại, và phần còn lại!\""
                    }
                ]
            },
            {
                "define": {
                    "en": "not moving",
                    "vi": "không di chuyển"
                },
                "examples": [
                    {
                        "en": "At rest the insect looks like a dead leaf.",
                        "vi": "Lúc còn lại, con côn trùng trông giống như một chiếc lá chết."
                    }
                ]
            },
            {
                "define": {
                    "en": "dead and therefore free from trouble or worry. People say ‘at rest’ to avoid saying ‘dead’.",
                    "vi": "chết và do đó không có rắc rối hoặc lo lắng. Người ta nói 'at rest' để tránh nói 'dead'."
                },
                "examples": [
                    {
                        "en": "She now lies at rest in the churchyard.",
                        "vi": "Bây giờ cô ấy nằm yên nghỉ trong sân nhà thờ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to stop moving",
                    "vi": "ngừng di chuyển"
                },
                "examples": [
                    {
                        "en": "The car crashed through the barrier and came to rest in a field.",
                        "vi": "Chiếc xe lao qua rào chắn và đến nằm nghỉ ở một cánh đồng."
                    },
                    {
                        "en": "His eyes came to rest on Clara's face.",
                        "vi": "Mắt anh dừng lại trên khuôn mặt của Clara."
                    },
                    {
                        "en": "The ball rolled down the hill and came to rest against a tree.",
                        "vi": "Quả bóng lăn xuống đồi và đến dựa vào một cái cây."
                    }
                ]
            },
            {
                "define": {
                    "en": "apart from that; considering other matters",
                    "vi": "ngoài điều đó ra; xem xét các vấn đề khác"
                },
                "examples": [
                    {
                        "en": "The book has some interesting passages about the author's childhood. For the rest, it is extremely dull.",
                        "vi": "Cuốn sách có một số đoạn thú vị về tuổi thơ của tác giả. Đối với phần còn lại, nó vô cùng buồn tẻ."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to tell somebody to stop talking about something because they are annoying you",
                    "vi": "được sử dụng để nói với ai đó ngừng nói về điều gì đó bởi vì họ đang làm phiền bạn"
                },
                "examples": [
                    {
                        "en": "Give it a rest! You’ve been complaining all day.",
                        "vi": "Hãy cho nó một phần còn lại! Bạn đã phàn nàn cả ngày."
                    }
                ]
            },
            {
                "define": {
                    "en": "to stop doing something for a while",
                    "vi": "ngừng làm điều gì đó trong một thời gian"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to bury somebody. People say ‘to lay somebody to rest’ to avoid saying ‘to bury’ somebody.",
                    "vi": "để chôn cất ai đó. Người ta nói \"để ai đó yên nghỉ\" tránh nói \"chôn\" ai đó."
                },
                "examples": [
                    {
                        "en": "George was laid to rest beside his parents.",
                        "vi": "George đã được an nghỉ bên cạnh cha mẹ mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to stop something by showing it is not true",
                    "vi": "ngăn chặn điều gì đó bằng cách cho thấy nó không phải là sự thật"
                },
                "examples": [
                    {
                        "en": "The announcement finally laid all the speculation about their future to rest.",
                        "vi": "Thông báo cuối cùng đã đặt tất cả những suy đoán về tương lai của họ sẽ yên nghỉ."
                    }
                ]
            },
            {
                "define": {
                    "en": "used when somebody is complaining that they have a lot of work to do",
                    "vi": "được sử dụng khi ai đó phàn nàn rằng họ còn nhiều việc phải làm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to do or say something to make somebody stop worrying about something",
                    "vi": "làm hoặc nói điều gì đó để khiến ai đó ngừng lo lắng về điều gì đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used when you are telling a story to say that you do not need to tell the end of it, because everyone knows it already",
                    "vi": "được sử dụng khi bạn đang kể một câu chuyện để nói rằng bạn không cần phải kể phần cuối của nó, vì mọi người đều biết điều đó rồi"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "1185b3e3b55745229cc9ccd92c7c5ecb",
        "word": "autopsy",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɔːtɒpsi/",
            "us": "/ˈɔːtɑːpsi/"
        },
        "nearby": [
            {
                "word": "autonomy",
                "pos": "noun"
            },
            {
                "word": "autopilot",
                "pos": "noun"
            },
            {
                "word": "autopsy",
                "pos": "noun"
            },
            {
                "word": "auto racing",
                "pos": "noun"
            },
            {
                "word": "autorickshaw",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an official examination of a dead body by a specially trained doctor in order to discover the cause of death",
                    "vi": "một cuộc kiểm tra chính thức xác chết bởi một bác sĩ được đào tạo đặc biệt để tìm ra nguyên nhân cái chết"
                },
                "examples": [
                    {
                        "en": "an autopsy report",
                        "vi": "một báo cáo khám nghiệm tử thi"
                    },
                    {
                        "en": "to perform an autopsy",
                        "vi": "để thực hiện một cuộc khám nghiệm tử thi"
                    }
                ]
            }
        ]
    },
    {
        "id": "0050589034a9477db0bd29a26506d8ce",
        "word": "bier",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/bɪə(r)/",
            "us": "/bɪr/"
        },
        "nearby": [
            {
                "word": "biennial",
                "pos": "noun"
            },
            {
                "word": "biennially",
                "pos": "adverb"
            },
            {
                "word": "bier",
                "pos": "noun"
            },
            {
                "word": "Ambrose Bierce",
                "pos": ""
            },
            {
                "word": "biff",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a frame on which the dead body or the coffin is placed or carried at a funeral",
                    "vi": "khung để xác người chết hoặc quan tài được đặt hoặc khiêng trong đám tang"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "688d30a5e79d481699d72552d8d159b2",
        "word": "burial ground",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈberiəl ɡraʊnd/",
            "us": "/ˈberiəl ɡraʊnd/"
        },
        "nearby": [
            {
                "word": "burgundy",
                "pos": "adjective"
            },
            {
                "word": "burial",
                "pos": "noun"
            },
            {
                "word": "burial ground",
                "pos": "noun"
            },
            {
                "word": "burka",
                "pos": "noun"
            },
            {
                "word": "Edmund Burke",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a place where dead bodies are buried, especially an ancient place",
                    "vi": "một nơi chôn cất xác chết, đặc biệt là một nơi cổ xưa"
                },
                "examples": [
                    {
                        "en": "a prehistoric burial ground",
                        "vi": "một khu chôn cất thời tiền sử"
                    },
                    {
                        "en": "We visited the site of an ancient burial ground.",
                        "vi": "Chúng tôi đến thăm khu mộ cổ."
                    }
                ]
            }
        ]
    },
    {
        "id": "c96be0b92d734f99a069fb9e7ef1183c",
        "word": "cadaver",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/kəˈdævə(r)/",
            "us": "/kəˈdævər/"
        },
        "nearby": [
            {
                "word": "cad",
                "pos": "noun"
            },
            {
                "word": "CAD",
                "pos": "noun"
            },
            {
                "word": "cadaver",
                "pos": "noun"
            },
            {
                "word": "cadaverous",
                "pos": "adjective"
            },
            {
                "word": "Cadbury",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a dead human body",
                    "vi": "một cơ thể người chết"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "487a51c38358449481776f3acc2fac8a",
        "word": "casket",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkɑːskɪt/",
            "us": "/ˈkæskɪt/"
        },
        "nearby": [
            {
                "word": "casino capitalism",
                "pos": "noun"
            },
            {
                "word": "cask",
                "pos": "noun"
            },
            {
                "word": "casket",
                "pos": "noun"
            },
            {
                "word": "Cassandra",
                "pos": "noun"
            },
            {
                "word": "Mary Cassatt",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small decorated box for holding jewellery or other valuable things, especially in the past",
                    "vi": "một chiếc hộp nhỏ được trang trí để đựng đồ trang sức hoặc những thứ có giá trị khác, đặc biệt là trong quá khứ"
                },
                "examples": [
                    {
                        "en": "Inside lay a casket of gold coins.",
                        "vi": "Bên trong đặt một quan tài tiền vàng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a box in which a dead body is buried or cremated",
                    "vi": "một cái hộp trong đó một xác chết được chôn cất hoặc hỏa táng"
                },
                "examples": [
                    {
                        "en": "A procession of mourners slowly followed the casket.",
                        "vi": "Một đoàn người đưa tang chậm rãi theo sau quan tài."
                    }
                ]
            }
        ]
    },
    {
        "id": "09581d6f5d494bc984b492217dcd3af5",
        "word": "catacombs",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkætəkuːmz/",
            "us": "/ˈkætəkəʊmz/"
        },
        "nearby": [
            {
                "word": "cataclysm",
                "pos": "noun"
            },
            {
                "word": "cataclysmic",
                "pos": "adjective"
            },
            {
                "word": "catacombs",
                "pos": "noun"
            },
            {
                "word": "catafalque",
                "pos": "noun"
            },
            {
                "word": "Catalan",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a series of underground tunnels used for burying dead people, especially in ancient times",
                    "vi": "một loạt các đường hầm dưới lòng đất được sử dụng để chôn cất người chết, đặc biệt là trong thời cổ đại"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "2a330d3f53ca463594ab7948df33d3ed",
        "word": "catafalque",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkætəfælk/",
            "us": "/ˈkætəfælk/"
        },
        "nearby": [
            {
                "word": "cataclysmic",
                "pos": "adjective"
            },
            {
                "word": "catacombs",
                "pos": "noun"
            },
            {
                "word": "catafalque",
                "pos": "noun"
            },
            {
                "word": "Catalan",
                "pos": "noun"
            },
            {
                "word": "Catalan",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a decorated platform on which the dead body of a famous person is placed before a funeral",
                    "vi": "một bục trang trí, trên đó xác chết của một người nổi tiếng được đặt trước đám tang"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "ad47370d5aeb414cb9f069a8bc4da8d9",
        "word": "chapel of rest",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌtʃæpl əv ˈrest/",
            "us": "/ˌtʃæpl əv ˈrest/"
        },
        "nearby": [
            {
                "word": "chapatti",
                "pos": "noun"
            },
            {
                "word": "chapel",
                "pos": "noun"
            },
            {
                "word": "chapel of rest",
                "pos": "noun"
            },
            {
                "word": "chaperone",
                "pos": "noun"
            },
            {
                "word": "chaperone",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a room at an undertaker's where dead bodies are kept before the funeral",
                    "vi": "một căn phòng tại nhà chôn cất người chết trước khi tang lễ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a6c25521e9b34ad58c5d25e656e1a757",
        "word": "corpse",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/kɔːps/",
            "us": "/kɔːrps/"
        },
        "nearby": [
            {
                "word": "corps",
                "pos": "noun"
            },
            {
                "word": "corps de ballet",
                "pos": "noun"
            },
            {
                "word": "corpse",
                "pos": "noun"
            },
            {
                "word": "corpsman",
                "pos": "noun"
            },
            {
                "word": "corpulence",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a dead body, especially of a human",
                    "vi": "một xác chết, đặc biệt là của một con người"
                },
                "examples": [
                    {
                        "en": "The corpse was barely recognizable.",
                        "vi": "Xác chết hầu như không thể nhận ra."
                    }
                ]
            }
        ]
    },
    {
        "id": "d39525ae17c84c42b2687e87c1e52dcb",
        "word": "cremains",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/krəˈmeɪnz/",
            "us": "/krəˈmeɪnz/"
        },
        "nearby": [
            {
                "word": "creepy",
                "pos": "adjective"
            },
            {
                "word": "creepy-crawly",
                "pos": "noun"
            },
            {
                "word": "cremains",
                "pos": "noun"
            },
            {
                "word": "cremate",
                "pos": "verb"
            },
            {
                "word": "cremation",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the powder that is left after a dead person’s body has been cremated (= burned)",
                    "vi": "bột còn sót lại sau khi xác một người chết đã được hỏa táng (= thiêu)"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "fdc2fd175e1c4990b6590423538a2d93",
        "word": "cremate",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/krəˈmeɪt/",
            "us": "/ˈkriːmeɪt/"
        },
        "nearby": [
            {
                "word": "creepy-crawly",
                "pos": "noun"
            },
            {
                "word": "cremains",
                "pos": "noun"
            },
            {
                "word": "cremate",
                "pos": "verb"
            },
            {
                "word": "cremation",
                "pos": "noun"
            },
            {
                "word": "crematorium",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to burn a dead body, especially as part of a funeral ceremony",
                    "vi": "đốt xác chết, đặc biệt là một phần của lễ tang"
                },
                "examples": [
                    {
                        "en": "be cremated When she dies she wants to be cremated, not buried.",
                        "vi": "được hỏa táng Khi chết cô ấy muốn được hỏa táng, không được chôn cất."
                    }
                ]
            }
        ]
    },
    {
        "id": "0e6894fbcd654968b288516bf6d6eb63",
        "word": "cremation",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/krəˈmeɪʃn/",
            "us": "/krəˈmeɪʃn/"
        },
        "nearby": [
            {
                "word": "cremains",
                "pos": "noun"
            },
            {
                "word": "cremate",
                "pos": "verb"
            },
            {
                "word": "cremation",
                "pos": "noun"
            },
            {
                "word": "crematorium",
                "pos": "noun"
            },
            {
                "word": "crème brûlée",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act of cremating somebody",
                    "vi": "hành động hỏa táng ai đó"
                },
                "examples": [
                    {
                        "en": "More people are choosing cremation rather than burial.",
                        "vi": "Nhiều người đang chọn hỏa táng hơn là chôn cất."
                    }
                ]
            },
            {
                "define": {
                    "en": "a funeral at which the dead person is cremated",
                    "vi": "một đám tang mà người chết được hỏa táng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "871fe0414f554382a531646e24ead28f",
        "word": "crematorium",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌkreməˈtɔːriəm/",
            "us": "/ˌkriːməˈtɔːriəm/"
        },
        "nearby": [
            {
                "word": "cremate",
                "pos": "verb"
            },
            {
                "word": "cremation",
                "pos": "noun"
            },
            {
                "word": "crematorium",
                "pos": "noun"
            },
            {
                "word": "crème brûlée",
                "pos": "noun"
            },
            {
                "word": "crème caramel",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a building in which the bodies of dead people are burned",
                    "vi": "tòa nhà thiêu xác người chết"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "f8c7567303ee4d5bb7a1b1abd838fa26",
        "word": "deceased",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/dɪˈsiːst/",
            "us": "/dɪˈsiːst/"
        },
        "nearby": [
            {
                "word": "Decca",
                "pos": ""
            },
            {
                "word": "decease",
                "pos": "noun"
            },
            {
                "word": "deceased",
                "pos": "adjective"
            },
            {
                "word": "deceit",
                "pos": "noun"
            },
            {
                "word": "deceitful",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "dead",
                    "vi": "chết"
                },
                "examples": [
                    {
                        "en": "her deceased parents",
                        "vi": "cha mẹ đã mất của cô ấy"
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who has died, especially recently",
                    "vi": "một người đã chết, đặc biệt là gần đây"
                },
                "examples": [
                    {
                        "en": "the family of the deceased",
                        "vi": "gia đình của những người đã khuất"
                    }
                ]
            }
        ]
    },
    {
        "id": "3397f5db9cc74e76aa54d5ae9730458d",
        "word": "departed",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/dɪˈpɑːtɪd/",
            "us": "/dɪˈpɑːrtɪd/"
        },
        "nearby": [
            {
                "word": "depanneur",
                "pos": "noun"
            },
            {
                "word": "depart",
                "pos": "verb"
            },
            {
                "word": "departed",
                "pos": "adjective"
            },
            {
                "word": "depart from",
                "pos": "phrasal verb"
            },
            {
                "word": "department",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "dead. People say ‘departed’ to avoid saying ‘dead’",
                    "vi": "chết. Người ta nói 'ra đi' để tránh nói 'chết'"
                },
                "examples": [
                    {
                        "en": "your dear departed brother",
                        "vi": "người anh em thân yêu đã ra đi của bạn"
                    }
                ]
            },
            {
                "define": {
                    "en": "the person who has died",
                    "vi": "người đã chết"
                },
                "examples": [
                    {
                        "en": "According to the story, the spirit of the departed returns to inhabit his wife.",
                        "vi": "Theo câu chuyện, linh hồn của người đã khuất trở về trú ngụ tại vợ ông."
                    }
                ]
            }
        ]
    },
    {
        "id": "bf0a9a51ca1d4d93a63712c7af87e4fa",
        "word": "depart this life",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/dɪˈpɑːt/",
            "us": "/dɪˈpɑːrt/"
        },
        "nearby": [
            {
                "word": "dep.",
                "pos": "abbreviation"
            },
            {
                "word": "depanneur",
                "pos": "noun"
            },
            {
                "word": "depart",
                "pos": "verb"
            },
            {
                "word": "departed",
                "pos": "adjective"
            },
            {
                "word": "depart from",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to leave a place, especially to start a trip",
                    "vi": "rời khỏi một nơi, đặc biệt là để bắt đầu một chuyến đi"
                },
                "examples": [
                    {
                        "en": "depart (for…) (from…) Flights for Rome depart from Terminal 3.",
                        "vi": "khởi hành (cho…) (từ…) Các chuyến bay đến Rome khởi hành từ Nhà ga số 3."
                    },
                    {
                        "en": "She waited until the last of the guests had departed.",
                        "vi": "Cô đợi cho đến khi những vị khách cuối cùng rời đi."
                    },
                    {
                        "en": "depart something (North American English) The train departed Amritsar at 6.15 p.m.",
                        "vi": "khởi hành một cái gì đó (tiếng Anh Bắc Mỹ) Chuyến tàu khởi hành từ Amritsar lúc 6 giờ 15 chiều"
                    }
                ]
            },
            {
                "define": {
                    "en": "to leave your job",
                    "vi": "rời khỏi công việc của bạn"
                },
                "examples": [
                    {
                        "en": "the departing president",
                        "vi": "tổng thống rời đi"
                    },
                    {
                        "en": "depart something He departed his job December 16.",
                        "vi": "khởi hành một cái gì đó Anh ấy khởi hành công việc của mình vào ngày 16 tháng 12."
                    }
                ]
            },
            {
                "define": {
                    "en": "to die. People say ‘depart this life’ to avoid saying ‘die’.",
                    "vi": "chết. Người ta nói 'từ giã cuộc đời này' để tránh nói 'chết đi'."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "35a6773c9cf64f1ab9531d15553606d5",
        "word": "epitaph",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈepɪtɑːf/",
            "us": "/ˈepɪtæf/"
        },
        "nearby": [
            {
                "word": "epistle",
                "pos": "noun"
            },
            {
                "word": "epistolary",
                "pos": "adjective"
            },
            {
                "word": "epitaph",
                "pos": "noun"
            },
            {
                "word": "epithet",
                "pos": "noun"
            },
            {
                "word": "epitome",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "words that are written or said about a dead person, especially words on a gravestone",
                    "vi": "những từ được viết hoặc nói về một người đã chết, đặc biệt là những từ trên bia mộ"
                },
                "examples": [
                    {
                        "en": "His epitaph read: ‘A just and noble countryman’.",
                        "vi": "Văn bia của ông viết: 'Một người dân quê công chính và cao quý'."
                    }
                ]
            },
            {
                "define": {
                    "en": "something that is left to remind people of a particular person, a period of time or an event",
                    "vi": "thứ gì đó còn lại để nhắc nhở mọi người về một người cụ thể, một khoảng thời gian hoặc một sự kiện"
                },
                "examples": [
                    {
                        "en": "These slums are an epitaph to the housing policy of the 1960s.",
                        "vi": "Những khu ổ chuột này là một văn bia cho chính sách nhà ở của những năm 1960."
                    }
                ]
            }
        ]
    },
    {
        "id": "04023092f3df41349ae9b2993fc44e7c",
        "word": "funeral director",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈfjuːnərəl dərektə(r)/",
            "us": "/ˈfjuːnərəl dərektər/"
        },
        "nearby": [
            {
                "word": "fundraising",
                "pos": "noun"
            },
            {
                "word": "funeral",
                "pos": "noun"
            },
            {
                "word": "funeral director",
                "pos": "noun"
            },
            {
                "word": "funeral parlour",
                "pos": "noun"
            },
            {
                "word": "funerary",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an undertaker (= a person whose job is to prepare the bodies of dead people to be buried or cremated, and to arrange funerals)",
                    "vi": "một người đảm nhận (= một người có công việc chuẩn bị thi thể người chết để chôn cất hoặc hỏa táng, và sắp xếp tang lễ)"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "b10647914d9d4e1b92fae0180997cdfc",
        "word": "gravestone",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɡreɪvstəʊn/",
            "us": "/ˈɡreɪvstəʊn/"
        },
        "nearby": [
            {
                "word": "Robert Graves",
                "pos": ""
            },
            {
                "word": "graveside",
                "pos": "noun"
            },
            {
                "word": "gravestone",
                "pos": "noun"
            },
            {
                "word": "graveyard",
                "pos": "noun"
            },
            {
                "word": "graveyard shift",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a stone that is put on a grave, showing the name, etc. of the person buried there",
                    "vi": "một hòn đá được đặt trên một ngôi mộ, ghi tên người, v.v. của người được chôn ở đó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "522757a3cd6545899b7d97fbf189d970",
        "word": "hearse",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/hɜːs/",
            "us": "/hɜːrs/"
        },
        "nearby": [
            {
                "word": "hear out",
                "pos": "phrasal verb"
            },
            {
                "word": "hearsay",
                "pos": "noun"
            },
            {
                "word": "hearse",
                "pos": "noun"
            },
            {
                "word": "William Randolph Hearst",
                "pos": ""
            },
            {
                "word": "heart",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a long vehicle used for carrying the coffin (= the box for the dead body) at a funeral",
                    "vi": "một chiếc xe dài được sử dụng để chở quan tài (= hộp đựng xác chết) tại một đám tang"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "4e9be5c9c89d4fbabadf69f2f479b5e7",
        "word": "inter",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ɪnˈtɜː(r)/",
            "us": "/ɪnˈtɜːr/"
        },
        "nearby": [
            {
                "word": "intentionally",
                "pos": "adverb"
            },
            {
                "word": "intently",
                "pos": "adverb"
            },
            {
                "word": "inter",
                "pos": "verb"
            },
            {
                "word": "inter-",
                "pos": "prefix"
            },
            {
                "word": "Interac",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to bury a dead person",
                    "vi": "chôn một người chết"
                },
                "examples": [
                    {
                        "en": "be interred The princess was interred on an island in the middle of a lake.",
                        "vi": "được can thiệp Công chúa bị giam giữ trên một hòn đảo giữa hồ."
                    }
                ]
            }
        ]
    },
    {
        "id": "6b27d2b313c84e0d941c5698a5814305",
        "word": "interment",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ɪnˈtɜːmənt/",
            "us": "/ɪnˈtɜːrmənt/"
        },
        "nearby": [
            {
                "word": "intermediate",
                "pos": "noun"
            },
            {
                "word": "intermediate technology",
                "pos": "noun"
            },
            {
                "word": "interment",
                "pos": "noun"
            },
            {
                "word": "intermesh",
                "pos": "verb"
            },
            {
                "word": "intermezzo",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act of burying a dead person",
                    "vi": "hành động chôn cất một người chết"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "6c2681112be94457abb46e8df5eb4c23",
        "word": "mausoleum",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌmɔːzəˈliːəm/",
            "us": "/ˌmɔːzəˈliːəm/"
        },
        "nearby": [
            {
                "word": "Mauritian",
                "pos": "noun, adjective"
            },
            {
                "word": "Mauritius",
                "pos": ""
            },
            {
                "word": "mausoleum",
                "pos": "noun"
            },
            {
                "word": "mauve",
                "pos": "noun"
            },
            {
                "word": "mauve",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a special building made to hold the dead body of an important person or the dead bodies of a family",
                    "vi": "một tòa nhà đặc biệt được xây dựng để giữ xác chết của một người quan trọng hoặc xác chết của một gia đình"
                },
                "examples": [
                    {
                        "en": "the royal mausoleum",
                        "vi": "lăng mộ hoàng gia"
                    }
                ]
            }
        ]
    },
    {
        "id": "7c5f33e9b5334849ade610b0854abe78",
        "word": "morgue",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/mɔːɡ/",
            "us": "/mɔːrɡ/"
        },
        "nearby": [
            {
                "word": "Rhodri Morgan",
                "pos": ""
            },
            {
                "word": "morganatic",
                "pos": "adjective"
            },
            {
                "word": "morgue",
                "pos": "noun"
            },
            {
                "word": "Professor Moriarty",
                "pos": ""
            },
            {
                "word": "moribund",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a building in which dead bodies are kept before they are buried or cremated (= burned)",
                    "vi": "một tòa nhà trong đó xác người chết được lưu giữ trước khi chôn cất hoặc hỏa táng (= thiêu)"
                },
                "examples": [
                    {
                        "en": "They found his body lying in the city morgue.",
                        "vi": "Họ tìm thấy xác anh nằm trong nhà xác thành phố."
                    },
                    {
                        "en": "This place is like a morgue!",
                        "vi": "Nơi này giống như một nhà xác!"
                    }
                ]
            },
            {
                "define": {
                    "en": "a place where dead bodies that have been found are kept until they can be identified",
                    "vi": "nơi lưu giữ những xác chết được tìm thấy cho đến khi xác định được danh tính"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "aba881143b2341e9b9a0919f5edd2779",
        "word": "mortal",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmɔːtl/",
            "us": "/ˈmɔːrtl/"
        },
        "nearby": [
            {
                "word": "Morse code",
                "pos": "noun"
            },
            {
                "word": "morsel",
                "pos": "noun"
            },
            {
                "word": "mortal",
                "pos": "adjective"
            },
            {
                "word": "mortal",
                "pos": "noun"
            },
            {
                "word": "mortality",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "that cannot live forever and must die",
                    "vi": "không thể sống mãi mãi và phải chết"
                },
                "examples": [
                    {
                        "en": "We are all mortal.",
                        "vi": "Tất cả chúng ta đều là người phàm."
                    }
                ]
            },
            {
                "define": {
                    "en": "causing death or likely to cause death; very serious",
                    "vi": "gây chết người hoặc có khả năng gây chết người; rất nghiêm trọng"
                },
                "examples": [
                    {
                        "en": "a mortal blow/wound",
                        "vi": "một đòn chí mạng / vết thương"
                    },
                    {
                        "en": "to be in mortal danger",
                        "vi": "gặp nguy hiểm chết người"
                    },
                    {
                        "en": "(figurative) Her reputation suffered a mortal blow as a result of the scandal.",
                        "vi": "(nghĩa bóng) Danh tiếng của cô bị giáng một đòn chí mạng do hậu quả của vụ bê bối."
                    }
                ]
            },
            {
                "define": {
                    "en": "lasting until death",
                    "vi": "kéo dài cho đến chết"
                },
                "examples": [
                    {
                        "en": "mortal enemies",
                        "vi": "Kẻ thù nguy hiểm"
                    },
                    {
                        "en": "They were locked in mortal combat (= a fight that will only end with the death of one of them).",
                        "vi": "Họ bị nhốt trong trận chiến sinh tử (= một cuộc chiến sẽ chỉ kết thúc với cái chết của một trong số họ)."
                    }
                ]
            },
            {
                "define": {
                    "en": "extreme",
                    "vi": "vô cùng"
                },
                "examples": [
                    {
                        "en": "We lived in mortal dread of him discovering our secret.",
                        "vi": "Chúng tôi đã sống trong nỗi sợ hãi chết chóc về việc anh ta phát hiện ra bí mật của chúng tôi."
                    }
                ]
            }
        ]
    },
    {
        "id": "35d0569ade3e45ca846f21ffa2691a13",
        "word": "mortician",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/mɔːˈtɪʃn/",
            "us": "/mɔːrˈtɪʃn/"
        },
        "nearby": [
            {
                "word": "mortgagee",
                "pos": "noun"
            },
            {
                "word": "mortgagor",
                "pos": "noun"
            },
            {
                "word": "mortician",
                "pos": "noun"
            },
            {
                "word": "mortification",
                "pos": "noun"
            },
            {
                "word": "mortify",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person whose job is to prepare the bodies of dead people to be buried or cremated, and to arrange funerals",
                    "vi": "một người có công việc chuẩn bị thi thể người chết để chôn cất hoặc hỏa táng và tổ chức tang lễ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c75896a2073b47bd9e8a5200f5ecf987",
        "word": "mortuary",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmɔːtʃəri/",
            "us": "/ˈmɔːrtʃueri/"
        },
        "nearby": [
            {
                "word": "mortise lock",
                "pos": "noun"
            },
            {
                "word": "'Jelly Roll' Morton",
                "pos": ""
            },
            {
                "word": "mortuary",
                "pos": "noun"
            },
            {
                "word": "mosaic",
                "pos": "noun"
            },
            {
                "word": "Moselle",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a room or building, for example part of a hospital, in which dead bodies are kept before they are buried or cremated (= burned)",
                    "vi": "một căn phòng hoặc tòa nhà, ví dụ như một phần của bệnh viện, trong đó xác người chết được lưu giữ trước khi chôn cất hoặc hỏa táng (= thiêu)"
                },
                "examples": [
                    {
                        "en": "They put the body in the hospital mortuary.",
                        "vi": "Họ đưa thi thể vào nhà xác của bệnh viện."
                    },
                    {
                        "en": "He works at the public mortuary.",
                        "vi": "Anh ấy làm việc tại nhà xác."
                    }
                ]
            },
            {
                "define": {
                    "en": "a place where dead people are prepared for being buried or cremated (= burned) and where visitors can see the body",
                    "vi": "nơi người chết được chuẩn bị để chôn cất hoặc hỏa táng (= thiêu) và nơi du khách có thể nhìn thấy thi thể"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "b11efced9cdb45c18477544785c5ba3e",
        "word": "mourner",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmɔːnə(r)/",
            "us": "/ˈmɔːrnər/"
        },
        "nearby": [
            {
                "word": "Mount Vernon",
                "pos": ""
            },
            {
                "word": "mourn",
                "pos": "verb"
            },
            {
                "word": "mourner",
                "pos": "noun"
            },
            {
                "word": "mournful",
                "pos": "adjective"
            },
            {
                "word": "mournfully",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who attends a funeral, especially a friend or a relative of the dead person",
                    "vi": "một người đến dự đám tang, đặc biệt là bạn bè hoặc người thân của người chết"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a59362c20311425193a9372fc40bf255",
        "word": "mummify",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmʌmɪfaɪ/",
            "us": "/ˈmʌmɪfaɪ/"
        },
        "nearby": [
            {
                "word": "mummer",
                "pos": "noun"
            },
            {
                "word": "Mummerset",
                "pos": "noun"
            },
            {
                "word": "mummify",
                "pos": "verb"
            },
            {
                "word": "mummy",
                "pos": "noun"
            },
            {
                "word": "mummy's boy",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to preserve a dead body by treating it with special oils and wrapping it in cloth",
                    "vi": "để bảo quản một xác chết bằng cách xử lý nó với các loại dầu đặc biệt và bọc nó trong vải"
                },
                "examples": [
                    {
                        "en": "be mummified Animals held such a prominent place in ancient Egyptian society that tens of millions were mummified.",
                        "vi": "được ướp xác Động vật giữ một vị trí nổi bật trong xã hội Ai Cập cổ đại đến mức hàng chục triệu người đã được ướp xác."
                    },
                    {
                        "en": "a mummified body/cat",
                        "vi": "một xác ướp / mèo"
                    }
                ]
            }
        ]
    },
    {
        "id": "7c38c02df5d94316ae9304e76bc7ad9c",
        "word": "post-mortem",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌpəʊst ˈmɔːtəm/",
            "us": "/ˌpəʊst ˈmɔːrtəm/"
        },
        "nearby": [
            {
                "word": "postmodernist",
                "pos": "noun"
            },
            {
                "word": "postmodifier",
                "pos": "noun"
            },
            {
                "word": "post-mortem",
                "pos": "noun"
            },
            {
                "word": "postnatal",
                "pos": "adjective"
            },
            {
                "word": "postnatal depression",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a medical examination of the body of a dead person in order to find out how they died",
                    "vi": "kiểm tra y tế cơ thể của một người chết để tìm hiểu xem họ đã chết như thế nào"
                },
                "examples": [
                    {
                        "en": "to do/conduct/carry out a post-mortem",
                        "vi": "làm / tiến hành / thực hiện khám nghiệm tử thi"
                    },
                    {
                        "en": "post-mortem on somebody The post-mortem on the child revealed that she had been poisoned.",
                        "vi": "Khám nghiệm tử thi đối với một người nào đó Việc khám nghiệm tử thi đối với đứa trẻ cho thấy rằng cô đã bị đầu độc."
                    },
                    {
                        "en": "They’re doing a post-mortem on her today.",
                        "vi": "Hôm nay họ đang khám nghiệm tử thi cô ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "a discussion or an examination of an event after it has happened, especially in order to find out why it failed",
                    "vi": "một cuộc thảo luận hoặc kiểm tra một sự kiện sau khi nó đã xảy ra, đặc biệt là để tìm ra lý do tại sao nó không thành công"
                },
                "examples": [
                    {
                        "en": "to hold a post-mortem on the party’s election defeat",
                        "vi": "tổ chức khám nghiệm tử thi về thất bại trong cuộc bầu cử của đảng"
                    }
                ]
            }
        ]
    },
    {
        "id": "43c18c37ad1647f3bce5a6ac978a4fce",
        "word": "pyre",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpaɪə(r)/",
            "us": "/ˈpaɪər/"
        },
        "nearby": [
            {
                "word": "pyramid scheme",
                "pos": "noun"
            },
            {
                "word": "pyramid selling",
                "pos": "noun"
            },
            {
                "word": "pyre",
                "pos": "noun"
            },
            {
                "word": "pyrethrum",
                "pos": "noun"
            },
            {
                "word": "Pyrex",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a large pile of wood on which a dead body is placed and burned in a funeral ceremony",
                    "vi": "một đống gỗ lớn, trên đó có một xác chết được đặt và đốt trong một buổi lễ tang lễ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "de5fcc1d01c64abb9f64e03a550dbfaf",
        "word": "remembrance",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/rɪˈmembrəns/",
            "us": "/rɪˈmembrəns/"
        },
        "nearby": [
            {
                "word": "remember",
                "pos": "verb"
            },
            {
                "word": "remember me to",
                "pos": "phrasal verb"
            },
            {
                "word": "remembrance",
                "pos": "noun"
            },
            {
                "word": "Remembrance Sunday",
                "pos": "noun"
            },
            {
                "word": "remind",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act or process of remembering an event in the past or a person who is dead",
                    "vi": "hành động hoặc quá trình ghi nhớ một sự kiện trong quá khứ hoặc một người đã chết"
                },
                "examples": [
                    {
                        "en": "in remembrance of somebody/something A service was held in remembrance of local soldiers killed in the war.",
                        "vi": "để tưởng nhớ ai đó / điều gì đó Một buổi lễ được tổ chức để tưởng nhớ những người lính địa phương đã thiệt mạng trong chiến tranh."
                    },
                    {
                        "en": "a remembrance service",
                        "vi": "một dịch vụ tưởng nhớ"
                    },
                    {
                        "en": "(formal) He smiled at the remembrance of their first kiss.",
                        "vi": "(trang trọng) Anh ấy mỉm cười khi nhớ lại nụ hôn đầu tiên của họ."
                    },
                    {
                        "en": "a chapel/garden of remembrance (= in memory of people who have died)",
                        "vi": "nhà nguyện / khu vườn tưởng nhớ (= tưởng nhớ những người đã mất)"
                    }
                ]
            },
            {
                "define": {
                    "en": "an object that causes you to remember somebody/something; a memory of somebody/something",
                    "vi": "một đối tượng khiến bạn nhớ ai đó / cái gì đó; ký ức về ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "The cenotaph stands as a remembrance of those killed during the war.",
                        "vi": "Cenotaph tượng trưng cho sự tưởng nhớ những người đã thiệt mạng trong chiến tranh."
                    },
                    {
                        "en": "The group shared their remembrances of life at school.",
                        "vi": "Nhóm đã chia sẻ những kỷ niệm của họ về cuộc sống ở trường."
                    }
                ]
            }
        ]
    },
    {
        "id": "988c0f4585d147cba31ed3db2b4dd0c0",
        "word": "sarcophagus",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/sɑːˈkɒfəɡəs/",
            "us": "/sɑːrˈkɑːfəɡəs/"
        },
        "nearby": [
            {
                "word": "sarcastically",
                "pos": "adverb"
            },
            {
                "word": "sarcoma",
                "pos": "noun"
            },
            {
                "word": "sarcophagus",
                "pos": "noun"
            },
            {
                "word": "sardine",
                "pos": "noun"
            },
            {
                "word": "sardonic",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a stone coffin (= box that a dead person is buried in), especially one that is decorated, used in ancient times",
                    "vi": "quan tài bằng đá (= chiếc hộp chôn người chết), đặc biệt là chiếc được trang trí, được sử dụng trong thời cổ đại"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c368bcfe1dad4064b9854324e69a924b",
        "word": "sepulchre",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈseplkə(r)/",
            "us": "/ˈseplkər/"
        },
        "nearby": [
            {
                "word": "septuplet",
                "pos": "noun"
            },
            {
                "word": "sepulchral",
                "pos": "adjective"
            },
            {
                "word": "sepulchre",
                "pos": "noun"
            },
            {
                "word": "sequel",
                "pos": "noun"
            },
            {
                "word": "sequence",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a place for a dead body, either cut in rock or built of stone",
                    "vi": "một nơi cho một xác chết, được cắt bằng đá hoặc xây bằng đá"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "af6fc6d933cf4045a27ac30e38252f20",
        "word": "shroud",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ʃraʊd/",
            "us": "/ʃraʊd/"
        },
        "nearby": [
            {
                "word": "Shropshire",
                "pos": ""
            },
            {
                "word": "A Shropshire Lad",
                "pos": ""
            },
            {
                "word": "shroud",
                "pos": "noun"
            },
            {
                "word": "shroud",
                "pos": "verb"
            },
            {
                "word": "shroud-waving",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a piece of cloth that a dead person’s body is wrapped in before it is buried",
                    "vi": "mảnh vải quấn xác người chết trước khi chôn cất"
                },
                "examples": [
                    {
                        "en": "a burial shroud",
                        "vi": "một tấm vải liệm"
                    }
                ]
            },
            {
                "define": {
                    "en": "a thing that covers, surrounds or hides something",
                    "vi": "một thứ bao phủ, bao quanh hoặc che giấu một thứ gì đó"
                },
                "examples": [
                    {
                        "en": "The organization is cloaked in a shroud of secrecy.",
                        "vi": "Tổ chức được che giấu trong một tấm vải bí mật."
                    },
                    {
                        "en": "a shroud of smoke",
                        "vi": "một làn khói"
                    },
                    {
                        "en": "a shroud of darkness/mist",
                        "vi": "một tấm màn che của bóng tối / sương mù"
                    }
                ]
            }
        ]
    },
    {
        "id": "3d9b858a410a4cc6afdbc2f9be7c9738",
        "word": "undertaker",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈʌndəteɪkə(r)/",
            "us": "/ˈʌndərteɪkər/"
        },
        "nearby": [
            {
                "word": "understudy",
                "pos": "verb"
            },
            {
                "word": "undertake",
                "pos": "verb"
            },
            {
                "word": "undertaker",
                "pos": "noun"
            },
            {
                "word": "undertaking",
                "pos": "noun"
            },
            {
                "word": "under-the-counter",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person whose job is to prepare the bodies of dead people to be buried or cremated, and to arrange funerals",
                    "vi": "một người có công việc chuẩn bị thi thể người chết để chôn cất hoặc hỏa táng và tổ chức tang lễ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "54eda397eb0042cf8e13c390ff10504b",
        "word": "urn",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ɜːn/",
            "us": "/ɜːrn/"
        },
        "nearby": [
            {
                "word": "urine",
                "pos": "noun"
            },
            {
                "word": "URL",
                "pos": "abbreviation"
            },
            {
                "word": "urn",
                "pos": "noun"
            },
            {
                "word": "URN",
                "pos": "abbreviation"
            },
            {
                "word": "urological",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a tall decorated container, especially one used for holding the ashes of a dead person",
                    "vi": "một cái hộp đựng cao được trang trí, đặc biệt là cái dùng để đựng tro cốt của một người đã chết"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a large metal container with a tap, used for making and/or serving tea or coffee",
                    "vi": "một hộp kim loại lớn có vòi, được sử dụng để pha và / hoặc phục vụ trà hoặc cà phê"
                },
                "examples": [
                    {
                        "en": "a tea urn",
                        "vi": "một bình trà"
                    },
                    {
                        "en": "an urn filled with hot soup",
                        "vi": "một bình đựng đầy súp nóng"
                    }
                ]
            }
        ]
    },
    {
        "id": "86a25f737f4445c59baf7f7fe20503f5",
        "word": "wake",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/weɪk/",
            "us": "/weɪk/"
        },
        "nearby": [
            {
                "word": "waiver",
                "pos": "noun"
            },
            {
                "word": "wake",
                "pos": "verb"
            },
            {
                "word": "wake",
                "pos": "noun"
            },
            {
                "word": "wakeboard",
                "pos": "verb"
            },
            {
                "word": "wakeboarding",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an occasion before or after a funeral when people gather to remember the dead person, traditionally held the night before the funeral to watch over the body before it is buried",
                    "vi": "Một dịp trước hoặc sau đám tang khi mọi người tập trung để tưởng nhớ người đã khuất, theo truyền thống được tổ chức vào đêm trước lễ tang để trông coi thi thể trước khi chôn cất."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the track that a boat or ship leaves behind on the surface of the water",
                    "vi": "dấu vết mà một chiếc thuyền hoặc con tàu để lại trên mặt nước"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "coming after or following somebody/something",
                    "vi": "đến sau hoặc theo sau ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "There have been demonstrations on the streets in the wake of the recent bomb attack.",
                        "vi": "Đã có nhiều cuộc biểu tình trên đường phố sau vụ đánh bom gần đây."
                    },
                    {
                        "en": "A group of reporters followed in her wake.",
                        "vi": "Một nhóm phóng viên đã theo sau cô ấy."
                    },
                    {
                        "en": "The storm left a trail of destruction in its wake.",
                        "vi": "Cơn bão đã để lại dấu vết của sự tàn phá sau khi nó thức dậy."
                    }
                ]
            }
        ]
    },
    {
        "id": "d68a79bbe5ce4af8ba7b8f0469f26388",
        "word": "winding sheet",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈwaɪndɪŋ ʃiːt/",
            "us": "/ˈwaɪndɪŋ ʃiːt/"
        },
        "nearby": [
            {
                "word": "winding",
                "pos": "adjective"
            },
            {
                "word": "winding-down",
                "pos": "noun"
            },
            {
                "word": "winding sheet",
                "pos": "noun"
            },
            {
                "word": "wind instrument",
                "pos": "noun"
            },
            {
                "word": "The Wind in the Willows",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "(especially in the past) a piece of cloth that a dead person’s body was wrapped in before it was buried",
                    "vi": "(đặc biệt là trong quá khứ) một mảnh vải mà xác một người chết được quấn vào trước khi chôn cất"
                },
                "examples": []
            }
        ]
    }
]