[
    {
        "id": "f3586b09ed9e405e871c3c4c683cd035",
        "word": "hate",
        "pos": "verb",
        "level": "a1",
        "phonetic": {
            "uk": "/heɪt/",
            "us": "/heɪt/"
        },
        "nearby": [
            {
                "word": "hatchling",
                "pos": "noun"
            },
            {
                "word": "hatchway",
                "pos": "noun"
            },
            {
                "word": "hate",
                "pos": "verb"
            },
            {
                "word": "hate",
                "pos": "noun"
            },
            {
                "word": "hate crime",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to dislike somebody/something very much",
                    "vi": "không thích ai đó / điều gì đó rất nhiều"
                },
                "examples": [
                    {
                        "en": "hate somebody/yourself The two boys hated each other.",
                        "vi": "ghét ai đó / chính mình Hai chàng trai ghét nhau."
                    },
                    {
                        "en": "Sometimes I really hate him.",
                        "vi": "Đôi khi tôi thực sự ghét anh ấy."
                    },
                    {
                        "en": "He was her most hated enemy.",
                        "vi": "Anh là kẻ thù đáng ghét nhất của cô."
                    },
                    {
                        "en": "hate something I hate spinach.",
                        "vi": "ghét một cái gì đó Tôi ghét rau bina."
                    },
                    {
                        "en": "I really hate Monday mornings.",
                        "vi": "Tôi thực sự ghét buổi sáng thứ Hai."
                    },
                    {
                        "en": "I hate the way she always criticizes me.",
                        "vi": "Tôi ghét cách cô ấy luôn chỉ trích tôi."
                    },
                    {
                        "en": "hate it… He hated it in France (= did not like the life there).",
                        "vi": "ghét nó… Anh ấy ghét nó ở Pháp (= không thích cuộc sống ở đó)."
                    },
                    {
                        "en": "She's hating it at university.",
                        "vi": "Cô ấy ghét nó ở trường đại học."
                    },
                    {
                        "en": "hate it when… I hate it when people cry.",
                        "vi": "ghét nó khi… tôi ghét nó khi mọi người khóc."
                    },
                    {
                        "en": "Don't you just hate it when everyone gets the joke except you?",
                        "vi": "Bạn không chỉ ghét nó khi tất cả mọi người nhận được trò đùa ngoại trừ bạn?"
                    },
                    {
                        "en": "hate it that… He hated it that she was right.",
                        "vi": "ghét điều đó… Anh ghét điều đó là cô đã đúng."
                    },
                    {
                        "en": "hate doing something She hates making mistakes.",
                        "vi": "ghét làm điều gì đó Cô ấy ghét mắc sai lầm."
                    },
                    {
                        "en": "I hate coming home late.",
                        "vi": "Tôi ghét về nhà muộn."
                    },
                    {
                        "en": "hate to do something He hated to be away from his family.",
                        "vi": "ghét làm điều gì đó Anh ghét phải xa gia đình."
                    },
                    {
                        "en": "She's a person who hates to make mistakes.",
                        "vi": "Cô ấy là một người không thích mắc sai lầm."
                    },
                    {
                        "en": "I hate to see him suffering like this.",
                        "vi": "Tôi ghét nhìn thấy anh ấy đau khổ như thế này."
                    },
                    {
                        "en": "I hate to think what would have happened if you hadn't been there.",
                        "vi": "Tôi ghét nghĩ điều gì sẽ xảy ra nếu bạn không có ở đó."
                    },
                    {
                        "en": "hate somebody/something doing something He hates anyone parking in his space.",
                        "vi": "ghét ai đó / cái gì đó đang làm điều gì đó Anh ấy ghét bất cứ ai đậu xe trong không gian của anh ấy."
                    },
                    {
                        "en": "hate somebody/something to do something I'd hate anything to happen to him.",
                        "vi": "ghét ai đó / điều gì đó làm điều gì đó Tôi ghét bất cứ điều gì xảy ra với anh ta."
                    },
                    {
                        "en": "She would have hated him to see how her hands shook.",
                        "vi": "Cô sẽ ghét anh ta khi nhìn thấy tay cô bắt đầu như thế nào."
                    },
                    {
                        "en": "hate for somebody/something to do something I'd hate for all this to go to waste.",
                        "vi": "ghét ai đó / điều gì đó làm điều gì đó Tôi ghét để tất cả những thứ này trở nên lãng phí."
                    },
                    {
                        "en": "hate somebody/yourself for something The country's police force was widely hated for its brutality.",
                        "vi": "ghét ai đó / bản thân vì điều gì đó Lực lượng cảnh sát của đất nước này được nhiều người căm ghét vì sự tàn bạo của nó."
                    },
                    {
                        "en": "hate somebody/yourself for doing something I hated myself for feeling jealous.",
                        "vi": "ghét ai đó / bản thân bạn vì đã làm điều gì đó Tôi ghét bản thân vì cảm thấy ghen tị."
                    },
                    {
                        "en": "When children are taught to hate, the whole future of society is in danger.",
                        "vi": "Khi trẻ em được dạy về sự căm ghét, toàn bộ tương lai của xã hội đang gặp nguy hiểm."
                    }
                ]
            },
            {
                "define": {
                    "en": "used when saying something that you would prefer not to have to say, or when politely asking to do something",
                    "vi": "được sử dụng khi nói điều gì đó mà bạn không muốn phải nói hoặc khi lịch sự yêu cầu làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "I hate to say it, but I don't think their marriage will last.",
                        "vi": "Tôi ghét phải nói ra điều đó, nhưng tôi không nghĩ cuộc hôn nhân của họ sẽ kéo dài."
                    },
                    {
                        "en": "I'd hate to say how many hours I've spent trying to fix my computer.",
                        "vi": "Tôi không muốn nói rằng tôi đã dành bao nhiêu giờ để sửa máy tính của mình."
                    },
                    {
                        "en": "I hate to trouble you, but could I use your phone?",
                        "vi": "Tôi ghét làm phiền bạn, nhưng tôi có thể sử dụng điện thoại của bạn?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to dislike somebody very much",
                    "vi": "không thích ai đó rất nhiều"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "3ab585859fe148859d748e69bd68ac18",
        "word": "dislike",
        "pos": "verb",
        "level": "b1",
        "phonetic": {
            "uk": "/dɪsˈlaɪk/",
            "us": "/dɪsˈlaɪk/"
        },
        "nearby": [
            {
                "word": "diskette",
                "pos": "noun"
            },
            {
                "word": "disk jockey",
                "pos": "noun"
            },
            {
                "word": "dislike",
                "pos": "verb"
            },
            {
                "word": "dislike",
                "pos": "noun"
            },
            {
                "word": "dislocate",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to not like somebody/something",
                    "vi": "không thích ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "dislike somebody/something Why do you dislike him so much?",
                        "vi": "không thích ai đó / điều gì đó Tại sao bạn lại không thích anh ta đến vậy?"
                    },
                    {
                        "en": "She disliked her boss intensely.",
                        "vi": "Cô ghét ông chủ của mình một cách mãnh liệt."
                    },
                    {
                        "en": "There are very few foods that I actively dislike.",
                        "vi": "Có rất ít thức ăn mà tôi chủ động không thích."
                    },
                    {
                        "en": "dislike doing something I dislike being away from my family.",
                        "vi": "không thích làm điều gì đó Tôi không thích xa gia đình."
                    },
                    {
                        "en": "Much as she disliked going to funerals (= although she did not like it at all), she knew she had to be there.",
                        "vi": "Dù cô ấy không thích đi dự đám tang (= mặc dù cô ấy không thích điều đó chút nào), nhưng cô ấy biết mình phải có mặt ở đó."
                    },
                    {
                        "en": "dislike somebody/something doing something He disliked her staying away from home.",
                        "vi": "không thích ai đó / điều gì đó làm điều gì đó Anh ấy không thích cô ấy ở xa nhà."
                    },
                    {
                        "en": "dislike it when… He disliked it when she behaved badly in front of his mother.",
                        "vi": "không thích khi… Anh không thích khi cô cư xử tệ bạc trước mặt mẹ anh."
                    },
                    {
                        "en": "dislike something about somebody/something What did you dislike about the movie?",
                        "vi": "không thích điều gì đó về ai đó / điều gì đó Bạn không thích điều gì về bộ phim?"
                    }
                ]
            }
        ]
    },
    {
        "id": "fff6ec1620284558a36114dd8dbd91b6",
        "word": "dislike",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/dɪsˈlaɪk/",
            "us": "/dɪsˈlaɪk/"
        },
        "nearby": [
            {
                "word": "disk jockey",
                "pos": "noun"
            },
            {
                "word": "dislike",
                "pos": "verb"
            },
            {
                "word": "dislike",
                "pos": "noun"
            },
            {
                "word": "dislocate",
                "pos": "verb"
            },
            {
                "word": "dislocation",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a feeling of not liking somebody/something",
                    "vi": "cảm giác không thích ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "dislike of somebody/something He did not try to hide his dislike of his boss.",
                        "vi": "không thích ai đó / điều gì đó Anh ta không cố gắng che giấu sự không thích của mình đối với ông chủ của mình."
                    },
                    {
                        "en": "dislike for somebody/something They could barely conceal their dislike for each other.",
                        "vi": "không thích ai đó / điều gì đó Họ hầu như không thể che giấu sự không thích của họ đối với nhau."
                    },
                    {
                        "en": "dislike to somebody/something She took an instant dislike to the house and the neighbourhood.",
                        "vi": "không thích ai đó / điều gì đó Cô ấy đã ngay lập tức không thích ngôi nhà và khu phố."
                    }
                ]
            },
            {
                "define": {
                    "en": "a thing that you do not like",
                    "vi": "một điều mà bạn không thích"
                },
                "examples": [
                    {
                        "en": "I've told you all my likes and dislikes.",
                        "vi": "Tôi đã nói với bạn tất cả những điều tôi thích và không thích."
                    }
                ]
            }
        ]
    },
    {
        "id": "bd04e447554a49bf87631bfbc44ecd10",
        "word": "enemy",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈenəmi/",
            "us": "/ˈenəmi/"
        },
        "nearby": [
            {
                "word": "end zone",
                "pos": "noun"
            },
            {
                "word": "enema",
                "pos": "noun"
            },
            {
                "word": "enemy",
                "pos": "noun"
            },
            {
                "word": "energetic",
                "pos": "adjective"
            },
            {
                "word": "energetically",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who hates somebody or who acts or speaks against somebody/something",
                    "vi": "một người ghét ai đó hoặc hành động hoặc nói chống lại ai đó / điều gì đó"
                },
                "examples": [
                    {
                        "en": "She didn't have an enemy in the world.",
                        "vi": "Cô ấy không có kẻ thù trên thế giới."
                    },
                    {
                        "en": "He has a lot of enemies in the company.",
                        "vi": "Anh ta có rất nhiều kẻ thù trong công ty."
                    },
                    {
                        "en": "After just one day, she had already made an enemy of her manager.",
                        "vi": "Chỉ sau một ngày, cô đã trở thành kẻ thù của người quản lý của mình."
                    },
                    {
                        "en": "They united in the face of a common enemy.",
                        "vi": "Họ đoàn kết khi đối mặt với kẻ thù chung."
                    },
                    {
                        "en": "They used to be friends but they are now sworn enemies (= are determined not to become friends again).",
                        "vi": "Họ đã từng là bạn bè nhưng giờ đây họ đã trở thành kẻ thù không đội trời chung (= quyết tâm không trở thành bạn bè nữa)."
                    },
                    {
                        "en": "James Moriarty was Sherlock Holmes's mortal enemy.",
                        "vi": "James Moriarty là kẻ thù truyền kiếp của Sherlock Holmes."
                    },
                    {
                        "en": "It is rare to find a prominent politician with few political enemies.",
                        "vi": "Thật hiếm khi tìm thấy một chính trị gia lỗi lạc với ít kẻ thù chính trị."
                    },
                    {
                        "en": "The state has a duty to protect its citizens against external enemies.",
                        "vi": "Nhà nước có nhiệm vụ bảo vệ công dân của mình trước những kẻ thù bên ngoài."
                    },
                    {
                        "en": "Birds are the natural enemies of many insect pests (= they kill them).",
                        "vi": "Chim là kẻ thù tự nhiên của nhiều loài côn trùng gây hại (= chúng giết chúng)."
                    },
                    {
                        "en": "The enemy of my enemy is my friend.",
                        "vi": "Kẻ thù của kẻ thù của tôi là bạn của tôi."
                    },
                    {
                        "en": "‘We will defeat the enemies of freedom,’ said the president.",
                        "vi": "Tổng thống nói: “Chúng ta sẽ đánh bại những kẻ thù của tự do."
                    }
                ]
            },
            {
                "define": {
                    "en": "a country or group that you are fighting a war against; the soldiers, etc. of this country or group",
                    "vi": "quốc gia hoặc nhóm mà bạn đang chiến đấu chống lại; những người lính, v.v. của quốc gia hoặc nhóm này"
                },
                "examples": [
                    {
                        "en": "The enemy was/were forced to retreat.",
                        "vi": "Đối phương đã / buộc phải rút lui."
                    },
                    {
                        "en": "to fight/defeat the enemy",
                        "vi": "chiến đấu / đánh bại kẻ thù"
                    },
                    {
                        "en": "enemy forces/combatants",
                        "vi": "quân địch / chiến binh"
                    },
                    {
                        "en": "The men came under enemy fire.",
                        "vi": "Những người đàn ông đã đến dưới làn đạn của kẻ thù."
                    },
                    {
                        "en": "They were dropped by parachute behind enemy lines (= in the area controlled by the enemy)",
                        "vi": "Họ được thả dù xuống sau chiến tuyến của địch (= trong khu vực do địch kiểm soát)"
                    }
                ]
            },
            {
                "define": {
                    "en": "anything that harms something or prevents it from being successful",
                    "vi": "bất cứ điều gì làm tổn hại đến điều gì đó hoặc ngăn cản nó thành công"
                },
                "examples": [
                    {
                        "en": "Poverty and ignorance are the enemies of progress.",
                        "vi": "Nghèo đói và thiếu hiểu biết là kẻ thù của sự tiến bộ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be the cause of your own problems",
                    "vi": "là nguyên nhân của các vấn đề của riêng bạn"
                },
                "examples": [
                    {
                        "en": "Her indecisiveness makes her her own worst enemy.",
                        "vi": "Sự thiếu quyết đoán của cô ấy khiến cô ấy trở thành kẻ thù tồi tệ nhất của chính mình."
                    },
                    {
                        "en": "Some dancers become their own worst enemies, criticizing themselves for every imperfection.",
                        "vi": "Một số vũ công trở thành kẻ thù tồi tệ nhất của chính họ, chỉ trích bản thân vì mọi sự không hoàn hảo."
                    }
                ]
            }
        ]
    },
    {
        "id": "8df817b3793f4f1fa8403c617809ffa5",
        "word": "hate",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/heɪt/",
            "us": "/heɪt/"
        },
        "nearby": [
            {
                "word": "hatchway",
                "pos": "noun"
            },
            {
                "word": "hate",
                "pos": "verb"
            },
            {
                "word": "hate",
                "pos": "noun"
            },
            {
                "word": "hate crime",
                "pos": "noun"
            },
            {
                "word": "hateful",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a very strong feeling of dislike for somebody",
                    "vi": "một cảm giác không thích ai đó rất mạnh mẽ"
                },
                "examples": [
                    {
                        "en": "She gave him a look of real hate.",
                        "vi": "Cô nhìn anh thật sự rất ghét."
                    },
                    {
                        "en": "a strange relationship built on love and hate",
                        "vi": "một mối quan hệ kỳ lạ được xây dựng trên tình yêu và sự căm ghét"
                    },
                    {
                        "en": "hate for somebody/something She was full of hate for the people who had betrayed her.",
                        "vi": "căm thù ai đó / điều gì đó Cô ấy đầy căm thù những người đã phản bội cô ấy."
                    },
                    {
                        "en": "a hate campaign (= cruel comments made about somebody over a period of time in order to damage their reputation)",
                        "vi": "một chiến dịch căm thù (= những nhận xét tàn nhẫn được đưa ra về ai đó trong một khoảng thời gian nhằm làm tổn hại danh tiếng của họ)"
                    }
                ]
            },
            {
                "define": {
                    "en": "a person or thing that you hate",
                    "vi": "một người hoặc điều mà bạn ghét"
                },
                "examples": [
                    {
                        "en": "Plastic flowers have always been a particular hate of mine.",
                        "vi": "Hoa nhựa luôn là thứ tôi ghét nhất."
                    }
                ]
            },
            {
                "define": {
                    "en": "something that you particularly dislike",
                    "vi": "một cái gì đó mà bạn đặc biệt không thích"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a40ff59b10e948b79bcdb1fb31004df7",
        "word": "despise",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/dɪˈspaɪz/",
            "us": "/dɪˈspaɪz/"
        },
        "nearby": [
            {
                "word": "despicable",
                "pos": "adjective"
            },
            {
                "word": "despicably",
                "pos": "adverb"
            },
            {
                "word": "despise",
                "pos": "verb"
            },
            {
                "word": "despite",
                "pos": "preposition"
            },
            {
                "word": "despoil",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to dislike and have no respect for somebody/something",
                    "vi": "không thích và không tôn trọng ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "despise somebody/something She despised gossip in any form.",
                        "vi": "khinh thường ai đó / cái gì đó Cô ấy coi thường chuyện tầm phào dưới mọi hình thức."
                    },
                    {
                        "en": "I don’t know why they despise me so much.",
                        "vi": "Tôi không biết tại sao họ lại khinh thường tôi đến vậy."
                    },
                    {
                        "en": "despise somebody/yourself for (doing) something He despised himself for being so cowardly.",
                        "vi": "khinh thường ai đó / bản thân bạn vì (đang làm) điều gì đó Anh ta coi thường bản thân vì quá hèn nhát."
                    },
                    {
                        "en": "She thoroughly despised him for his weakness.",
                        "vi": "Cô hoàn toàn coi thường anh vì sự yếu đuối của anh."
                    }
                ]
            }
        ]
    },
    {
        "id": "e2ab7a32b61846a8832eb171f8eb86f4",
        "word": "disgust",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/dɪsˈɡʌst/",
            "us": "/dɪsˈɡʌst/"
        },
        "nearby": [
            {
                "word": "disguise",
                "pos": "verb"
            },
            {
                "word": "disguise",
                "pos": "noun"
            },
            {
                "word": "disgust",
                "pos": "noun"
            },
            {
                "word": "disgust",
                "pos": "verb"
            },
            {
                "word": "Disgusted, Tunbridge Wells",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a strong feeling of dislike for somebody/something that you feel is unacceptable, or for something that looks, smells, etc. unpleasant",
                    "vi": "cảm giác không thích mạnh mẽ đối với ai đó / điều gì đó mà bạn cảm thấy không thể chấp nhận được hoặc đối với thứ gì đó có vẻ ngoài, có mùi, v.v. khó chịu"
                },
                "examples": [
                    {
                        "en": "The idea fills me with disgust.",
                        "vi": "Ý tưởng làm tôi kinh tởm."
                    },
                    {
                        "en": "disgust for somebody I can only feel disgust for these criminals.",
                        "vi": "ghê tởm đối với ai đó Tôi chỉ có thể cảm thấy ghê tởm đối với những tên tội phạm này."
                    },
                    {
                        "en": "disgust at/with something She expressed her disgust at the programme in a tweet.",
                        "vi": "ghê tởm với / với điều gì đó Cô ấy bày tỏ sự ghê tởm của mình với chương trình trong một dòng tweet."
                    },
                    {
                        "en": "in disgust He walked away in disgust",
                        "vi": "trong sự kinh tởm Anh ta bỏ đi trong sự kinh tởm"
                    },
                    {
                        "en": "She wrinkled her nose in disgust at the smell.",
                        "vi": "Cô ấy nhăn mũi ghê tởm trước cái mùi đó."
                    },
                    {
                        "en": "with disgust He regarded the cubes of fat with disgust.",
                        "vi": "với sự ghê tởm Anh ta nhìn những khối chất béo một cách ghê tởm."
                    },
                    {
                        "en": "to somebody's disgust Much to my disgust, they refused to help.",
                        "vi": "đối với sự ghê tởm của ai đó Rất nhiều đối với sự ghê tởm của tôi, họ đã từ chối giúp đỡ."
                    }
                ]
            }
        ]
    },
    {
        "id": "ed09b384a69144238d8d8464713f3524",
        "word": "prejudice",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈpredʒədɪs/",
            "us": "/ˈpredʒədɪs/"
        },
        "nearby": [
            {
                "word": "pre-install",
                "pos": "verb"
            },
            {
                "word": "prejudge",
                "pos": "verb"
            },
            {
                "word": "prejudice",
                "pos": "noun"
            },
            {
                "word": "prejudice",
                "pos": "verb"
            },
            {
                "word": "prejudiced",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an unreasonable dislike of or preference for a person, group, custom, etc., especially when it is based on their race, religion, sex, etc.",
                    "vi": "sự không thích hoặc sở thích vô lý đối với một người, một nhóm người, phong tục, v.v., đặc biệt khi nó dựa trên chủng tộc, tôn giáo, giới tính của họ, v.v."
                },
                "examples": [
                    {
                        "en": "a victim of racial prejudice",
                        "vi": "nạn nhân của định kiến chủng tộc"
                    },
                    {
                        "en": "Their decision was based on ignorance and prejudice.",
                        "vi": "Quyết định của họ dựa trên sự thiếu hiểu biết và thành kiến."
                    },
                    {
                        "en": "prejudice against somebody/something There was often prejudice against people with disabilities.",
                        "vi": "thành kiến với ai đó / cái gì đó Thường có thành kiến với người khuyết tật."
                    },
                    {
                        "en": "prejudice in favour of somebody/something She admitted to a prejudice in favour of British universities.",
                        "vi": "thành kiến ủng hộ ai đó / điều gì Cô ấy thừa nhận thành kiến ủng hộ các trường đại học Anh."
                    }
                ]
            },
            {
                "define": {
                    "en": "without affecting any other legal matter",
                    "vi": "mà không ảnh hưởng đến bất kỳ vấn đề pháp lý nào khác"
                },
                "examples": [
                    {
                        "en": "They agreed to pay compensation without prejudice (= without admitting guilt).",
                        "vi": "Họ đồng ý bồi thường mà không có thành kiến (= không thừa nhận tội lỗi)."
                    }
                ]
            }
        ]
    },
    {
        "id": "80373ce50ea54d869d5262212f11cb48",
        "word": "put off",
        "pos": "phrasal verb",
        "level": "c1",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "put in for",
                "pos": "phrasal verb"
            },
            {
                "word": "put into",
                "pos": "phrasal verb"
            },
            {
                "word": "put off",
                "pos": "phrasal verb"
            },
            {
                "word": "put on",
                "pos": "phrasal verb"
            },
            {
                "word": "put-on",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to cancel a meeting or an arrangement that you have made with somebody",
                    "vi": "để hủy một cuộc họp hoặc một thỏa thuận mà bạn đã thực hiện với ai đó"
                },
                "examples": [
                    {
                        "en": "It's too late to put them off now.",
                        "vi": "Đã quá muộn để loại bỏ chúng ngay bây giờ."
                    },
                    {
                        "en": "She put him off with the excuse that she had too much work to do.",
                        "vi": "Cô gạt anh ra với lý do cô có quá nhiều việc phải làm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody dislike somebody/something or not trust them/it",
                    "vi": "làm cho ai đó không thích ai đó / điều gì đó hoặc không tin tưởng họ / điều đó"
                },
                "examples": [
                    {
                        "en": "She's very clever but her manner does tend to put people off.",
                        "vi": "Cô ấy rất thông minh nhưng cách cư xử của cô ấy có xu hướng khiến mọi người thất vọng."
                    },
                    {
                        "en": "Don't be put off by how it looks—it tastes delicious.",
                        "vi": "Đừng để ý đến vẻ ngoài của nó — nó có vị rất ngon."
                    }
                ]
            },
            {
                "define": {
                    "en": "to interrupt somebody who is trying to give all their attention to something that they are doing",
                    "vi": "ngắt lời ai đó đang cố gắng tập trung hết sức vào việc gì đó mà họ đang làm"
                },
                "examples": [
                    {
                        "en": "Don't put me off when I'm trying to concentrate.",
                        "vi": "Đừng làm tôi khó chịu khi tôi đang cố gắng tập trung."
                    },
                    {
                        "en": "The sudden noise put her off her game.",
                        "vi": "Tiếng ồn đột ngột khiến cô ấy không thể chơi được nữa."
                    }
                ]
            },
            {
                "define": {
                    "en": "to stop in order to allow somebody to leave",
                    "vi": "dừng lại để cho phép ai đó rời đi"
                },
                "examples": [
                    {
                        "en": "I asked the bus driver to put me off at the station.",
                        "vi": "Tôi yêu cầu tài xế xe buýt đưa tôi xuống nhà ga."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody lose interest in or enthusiasm for something/somebody",
                    "vi": "để làm cho ai đó mất hứng thú hoặc nhiệt tình với điều gì đó / ai đó"
                },
                "examples": [
                    {
                        "en": "He was put off science by bad teaching.",
                        "vi": "Ông ấy đã bị sa thải khỏi khoa học bởi cách giảng dạy tồi tệ."
                    },
                    {
                        "en": "put somebody off doing something The accident put her off driving for life.",
                        "vi": "dập tắt ai đó đang làm gì đó Vụ tai nạn khiến cô ấy phải lái xe cả đời."
                    }
                ]
            },
            {
                "define": {
                    "en": "to change something to a later time or date",
                    "vi": "để thay đổi một cái gì đó thành một thời gian hoặc ngày sau đó"
                },
                "examples": [
                    {
                        "en": "We've had to put off our wedding until September.",
                        "vi": "Chúng tôi đã phải hoãn đám cưới của mình cho đến tháng Chín."
                    },
                    {
                        "en": "put off doing something He keeps putting off going to the dentist.",
                        "vi": "dừng làm việc gì đó Anh ấy vẫn tiếp tục bỏ đi đến nha sĩ."
                    }
                ]
            }
        ]
    },
    {
        "id": "08609084a36e40da94efd5156c90d657",
        "word": "resistance",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/rɪˈzɪstəns/",
            "us": "/rɪˈzɪstəns/"
        },
        "nearby": [
            {
                "word": "resinous",
                "pos": "adjective"
            },
            {
                "word": "resist",
                "pos": "verb"
            },
            {
                "word": "resistance",
                "pos": "noun"
            },
            {
                "word": "resistant",
                "pos": "adjective"
            },
            {
                "word": "resister",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "dislike of or opposition to a plan, an idea, etc.; the act of refusing to obey",
                    "vi": "không thích hoặc phản đối một kế hoạch, một ý tưởng, v.v.; hành động từ chối tuân theo"
                },
                "examples": [
                    {
                        "en": "As with all new ideas it met with resistance.",
                        "vi": "Như với tất cả những ý tưởng mới, nó vấp phải sự phản kháng."
                    },
                    {
                        "en": "resistance to somebody/something There has been a lot of resistance to this new law.",
                        "vi": "kháng cự với ai đó / điều gì đó Đã có rất nhiều sự phản đối đối với luật mới này."
                    },
                    {
                        "en": "Resistance to change has nearly destroyed the industry.",
                        "vi": "Sự phản kháng lại sự thay đổi đã gần như phá hủy ngành công nghiệp này."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of using force to oppose somebody/something",
                    "vi": "hành động sử dụng vũ lực để chống lại ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "There were a number of episodes of armed resistance during the early years of occupation.",
                        "vi": "Có một số cuộc kháng chiến vũ trang trong những năm đầu bị chiếm đóng."
                    },
                    {
                        "en": "The defenders put up a strong resistance.",
                        "vi": "Các hậu vệ đã đưa ra một sự kháng cự mạnh mẽ."
                    },
                    {
                        "en": "resistance to somebody/something The demonstrators offered little or no resistance to the police.",
                        "vi": "kháng cự với ai đó / điều gì đó Người biểu tình đề nghị ít hoặc không chống lại cảnh sát."
                    }
                ]
            },
            {
                "define": {
                    "en": "the power not to be affected by something",
                    "vi": "sức mạnh không bị ảnh hưởng bởi một cái gì đó"
                },
                "examples": [
                    {
                        "en": "AIDS lowers the body's resistance to infection.",
                        "vi": "AIDS làm giảm sức đề kháng của cơ thể đối với nhiễm trùng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a force that stops something moving or makes it move more slowly",
                    "vi": "một lực ngăn một thứ gì đó chuyển động hoặc làm cho nó chuyển động chậm hơn"
                },
                "examples": [
                    {
                        "en": "wind/air resistance (= in the design of planes or cars)",
                        "vi": "sức cản của gió / không khí (= trong thiết kế máy bay hoặc ô tô)"
                    }
                ]
            },
            {
                "define": {
                    "en": "the opposition of a substance or device to the flow of an electrical current",
                    "vi": "sự đối lập của một chất hoặc thiết bị với dòng điện"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a secret organization that resists the authorities, especially in a country that an enemy has control of",
                    "vi": "một tổ chức bí mật chống lại chính quyền, đặc biệt là ở một quốc gia mà kẻ thù nắm quyền kiểm soát"
                },
                "examples": [
                    {
                        "en": "resistance fighters",
                        "vi": "người kháng chiến"
                    }
                ]
            },
            {
                "define": {
                    "en": "(to choose, etc.) the easiest way of doing something",
                    "vi": "(để lựa chọn, v.v.) cách dễ nhất để làm điều gì đó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "ad67eff2d1f74d2592ac03db91fba252",
        "word": "abide",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/əˈbaɪd/",
            "us": "/əˈbaɪd/"
        },
        "nearby": [
            {
                "word": "abhorrence",
                "pos": "noun"
            },
            {
                "word": "abhorrent",
                "pos": "adjective"
            },
            {
                "word": "abide",
                "pos": "verb"
            },
            {
                "word": "abide by",
                "pos": "phrasal verb"
            },
            {
                "word": "Abide With Me",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to dislike somebody/something so much that you hate having to be with or deal with them",
                    "vi": "không thích ai đó / điều gì đó đến mức bạn ghét phải ở bên cạnh hoặc đối phó với họ"
                },
                "examples": [
                    {
                        "en": "I can't abide people with no sense of humour.",
                        "vi": "Tôi không thể tiếp tay những người không có khiếu hài hước."
                    },
                    {
                        "en": "He couldn't abide the thought of being cooped up in an office.",
                        "vi": "Anh ta không thể chấp nhận ý nghĩ bị nhốt trong văn phòng."
                    },
                    {
                        "en": "I can’t abide people who look down on others.",
                        "vi": "Tôi không thể tiếp tay cho những người coi thường người khác."
                    }
                ]
            },
            {
                "define": {
                    "en": "to stay or live in a place",
                    "vi": "ở lại hoặc sống ở một nơi"
                },
                "examples": [
                    {
                        "en": "May joy and peace abide in us all.",
                        "vi": "Cầu mong niềm vui và hòa bình ở trong tất cả chúng ta."
                    }
                ]
            }
        ]
    },
    {
        "id": "a564be5088f04068b7619240708a1ef3",
        "word": "allergic",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/əˈlɜːdʒɪk/",
            "us": "/əˈlɜːrdʒɪk/"
        },
        "nearby": [
            {
                "word": "Allen screw",
                "pos": "noun"
            },
            {
                "word": "allergen",
                "pos": "noun"
            },
            {
                "word": "allergic",
                "pos": "adjective"
            },
            {
                "word": "allergist",
                "pos": "noun"
            },
            {
                "word": "allergy",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "having an allergy to something",
                    "vi": "bị dị ứng với thứ gì đó"
                },
                "examples": [
                    {
                        "en": "I like cats but unfortunately I'm allergic to them.",
                        "vi": "Tôi thích mèo nhưng tiếc là tôi bị dị ứng với chúng."
                    }
                ]
            },
            {
                "define": {
                    "en": "caused by an allergy",
                    "vi": "do dị ứng"
                },
                "examples": [
                    {
                        "en": "an allergic reaction/rash",
                        "vi": "phản ứng dị ứng / phát ban"
                    }
                ]
            },
            {
                "define": {
                    "en": "having a strong dislike of something/somebody",
                    "vi": "rất không thích một cái gì đó / ai đó"
                },
                "examples": [
                    {
                        "en": "You could see he was allergic to housework.",
                        "vi": "Bạn có thể thấy anh ấy bị dị ứng với việc nhà."
                    }
                ]
            }
        ]
    },
    {
        "id": "6da7afe2d1b94b93808ab4447aee490f",
        "word": "anathema",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/əˈnæθəmə/",
            "us": "/əˈnæθəmə/"
        },
        "nearby": [
            {
                "word": "anarchy",
                "pos": "noun"
            },
            {
                "word": "Anasazi",
                "pos": "noun"
            },
            {
                "word": "anathema",
                "pos": "noun"
            },
            {
                "word": "anatomical",
                "pos": "adjective"
            },
            {
                "word": "anatomically",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a thing or an idea that you hate because it is the opposite of what you believe",
                    "vi": "một điều hoặc một ý tưởng mà bạn ghét vì nó đối lập với những gì bạn tin tưởng"
                },
                "examples": [
                    {
                        "en": "Racial prejudice is (an) anathema to me.",
                        "vi": "Định kiến về chủng tộc là (một) nỗi đau đối với tôi."
                    }
                ]
            }
        ]
    },
    {
        "id": "8732ca2316d344469699bb62953f2583",
        "word": "antipathetic",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌæntɪpəˈθetɪk/",
            "us": "/ˌæntɪpəˈθetɪk/"
        },
        "nearby": [
            {
                "word": "antiparticle",
                "pos": "noun"
            },
            {
                "word": "antipasto",
                "pos": "noun"
            },
            {
                "word": "antipathetic",
                "pos": "adjective"
            },
            {
                "word": "antipathy",
                "pos": "noun"
            },
            {
                "word": "anti-personnel",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "feeling strong dislike for somebody/something",
                    "vi": "cảm thấy rất không thích ai đó / điều gì đó"
                },
                "examples": [
                    {
                        "en": "antipathetic to change",
                        "vi": "phản cảm để thay đổi"
                    }
                ]
            }
        ]
    },
    {
        "id": "96961e4ee38c4f5da38f2d327d40bc8d",
        "word": "antipathy",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ænˈtɪpəθi/",
            "us": "/ænˈtɪpəθi/"
        },
        "nearby": [
            {
                "word": "antipasto",
                "pos": "noun"
            },
            {
                "word": "antipathetic",
                "pos": "adjective"
            },
            {
                "word": "antipathy",
                "pos": "noun"
            },
            {
                "word": "anti-personnel",
                "pos": "adjective"
            },
            {
                "word": "antiperspirant",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a strong feeling of dislike",
                    "vi": "một cảm giác không thích mạnh mẽ"
                },
                "examples": [
                    {
                        "en": "personal/mutual antipathy",
                        "vi": "ác cảm cá nhân / lẫn nhau"
                    },
                    {
                        "en": "a growing antipathy towards the idea",
                        "vi": "sự ác cảm ngày càng tăng đối với ý tưởng"
                    },
                    {
                        "en": "His professional judgement was coloured by his personal antipathies.",
                        "vi": "Đánh giá chuyên môn của anh ấy được tô màu bởi những phản ứng cá nhân của anh ấy."
                    }
                ]
            }
        ]
    },
    {
        "id": "4424a73c0120461c9ab1f7f39b3efecb",
        "word": "finicky",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈfɪnɪki/",
            "us": "/ˈfɪnɪki/"
        },
        "nearby": [
            {
                "word": "fingertip",
                "pos": "noun"
            },
            {
                "word": "finial",
                "pos": "noun"
            },
            {
                "word": "finicky",
                "pos": "adjective"
            },
            {
                "word": "finings",
                "pos": "noun"
            },
            {
                "word": "finish",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "too worried about what you eat, wear, etc.; disliking many things",
                    "vi": "quá lo lắng về những gì bạn ăn, mặc, vv; không thích nhiều thứ"
                },
                "examples": [
                    {
                        "en": "a finicky eater",
                        "vi": "một kẻ ăn uống khéo léo"
                    }
                ]
            },
            {
                "define": {
                    "en": "needing great care and attention to detail",
                    "vi": "cần sự cẩn thận và chú ý đến từng chi tiết"
                },
                "examples": [
                    {
                        "en": "It's a very finicky job.",
                        "vi": "Đó là một công việc rất khó khăn."
                    }
                ]
            }
        ]
    },
    {
        "id": "9abbfb64effb4990a2d041c5e43f08a7",
        "word": "frenemy",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈfrenəmi/",
            "us": "/ˈfrenəmi/"
        },
        "nearby": [
            {
                "word": "French window",
                "pos": "noun"
            },
            {
                "word": "Frenchwoman",
                "pos": "noun"
            },
            {
                "word": "frenemy",
                "pos": "noun"
            },
            {
                "word": "frenetic",
                "pos": "adjective"
            },
            {
                "word": "frenetically",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person or organization that you are friends with because it is useful or necessary to be their friend, even though you really dislike or disagree with them",
                    "vi": "một người hoặc tổ chức mà bạn là bạn bè vì điều đó là hữu ích hoặc cần thiết để trở thành bạn của họ, mặc dù bạn thực sự không thích hoặc không đồng ý với họ"
                },
                "examples": [
                    {
                        "en": "The internet giant is seen by many as a frenemy, a company they cannot afford not to work with.",
                        "vi": "Người khổng lồ internet được nhiều người coi là kẻ thù không đội trời chung, một công ty mà họ không thể không hợp tác."
                    }
                ]
            }
        ]
    },
    {
        "id": "718c922257b44ddc8bccec2b8e7c8609",
        "word": "grudge",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ɡrʌdʒ/",
            "us": "/ɡrʌdʒ/"
        },
        "nearby": [
            {
                "word": "Grub Street",
                "pos": "noun"
            },
            {
                "word": "grub up",
                "pos": "phrasal verb"
            },
            {
                "word": "grudge",
                "pos": "noun"
            },
            {
                "word": "grudge",
                "pos": "verb"
            },
            {
                "word": "grudging",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a feeling of anger or dislike towards somebody because of something bad they have done to you in the past",
                    "vi": "cảm giác tức giận hoặc không thích ai đó vì điều gì đó tồi tệ mà họ đã làm với bạn trong quá khứ"
                },
                "examples": [
                    {
                        "en": "I bear him no grudge.",
                        "vi": "Tôi không có ác cảm với anh ta."
                    },
                    {
                        "en": "He has a grudge against the world.",
                        "vi": "Anh ta có một mối hận thù với thế giới."
                    },
                    {
                        "en": "She has harboured a grudge against me for years.",
                        "vi": "Cô ấy đã nuôi mối hận thù với tôi trong nhiều năm."
                    },
                    {
                        "en": "I don't hold any grudges now.",
                        "vi": "Bây giờ tôi không còn thù hận gì nữa."
                    },
                    {
                        "en": "He's a man with a grudge.",
                        "vi": "Anh ta là một người đàn ông có ác cảm."
                    },
                    {
                        "en": "England beat New Zealand in a grudge match (= a match where there is strong dislike between the teams).",
                        "vi": "Anh đánh bại New Zealand trong một trận đấu đầy thù hận (= một trận đấu mà giữa các đội có sự bất hòa gay gắt)."
                    }
                ]
            }
        ]
    },
    {
        "id": "c2bdfbb46e794dc2919108d90f02feec",
        "word": "hate, be sick of, etc. the sight of somebody/something",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/saɪt/",
            "us": "/saɪt/"
        },
        "nearby": [
            {
                "word": "sigh",
                "pos": "verb"
            },
            {
                "word": "sigh",
                "pos": "noun"
            },
            {
                "word": "sight",
                "pos": "noun"
            },
            {
                "word": "sight",
                "pos": "verb"
            },
            {
                "word": "sighted",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the ability to see",
                    "vi": "khả năng nhìn thấy"
                },
                "examples": [
                    {
                        "en": "to lose your sight (= to become blind)",
                        "vi": "mất thị lực (= trở nên mù lòa)"
                    },
                    {
                        "en": "She has very good sight.",
                        "vi": "Cô ấy có thị giác rất tốt."
                    },
                    {
                        "en": "The disease has affected her sight.",
                        "vi": "Căn bệnh đã ảnh hưởng đến thị giác của cô."
                    },
                    {
                        "en": "He has very little sight in his right eye.",
                        "vi": "Anh ta có rất ít thị lực ở mắt phải."
                    },
                    {
                        "en": "It's important that you have regular sight tests.",
                        "vi": "Điều quan trọng là bạn phải kiểm tra thị lực thường xuyên."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of seeing somebody/something",
                    "vi": "hành động nhìn thấy ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "sight of somebody/something She kept sight of him in her mirror.",
                        "vi": "nhìn thấy ai đó / cái gì đó Cô ấy luôn nhìn thấy anh ấy trong gương của cô ấy."
                    },
                    {
                        "en": "She caught sight of a car in the distance.",
                        "vi": "Cô bắt gặp một chiếc ô tô ở đằng xa."
                    },
                    {
                        "en": "After ten days at sea, we had our first sight of land.",
                        "vi": "Sau mười ngày lênh đênh trên biển, chúng tôi đã có cái nhìn đầu tiên về đất liền."
                    },
                    {
                        "en": "The mere sight of him makes me want to scream.",
                        "vi": "Chỉ nhìn thấy anh ấy thôi cũng khiến tôi muốn hét lên."
                    },
                    {
                        "en": "sight of somebody/something doing something The sight of him hobbling off so early in the match depressed everyone.",
                        "vi": "Cảnh tượng ai đó / điều gì đó đang làm gì đó Cảnh anh ta tập tễnh đi rất sớm trong trận đấu khiến mọi người chán nản."
                    },
                    {
                        "en": "at the sight He laughed quietly to himself at the sight.",
                        "vi": "trước cảnh tượng này. Anh ấy cười lặng lẽ với chính mình khi nhìn thấy."
                    },
                    {
                        "en": "at the sight of somebody/something I have been known to faint at the sight of blood.",
                        "vi": "khi nhìn thấy ai đó / điều gì đó mà tôi được biết là đã ngất xỉu khi nhìn thấy máu."
                    },
                    {
                        "en": "on sight The soldiers were given orders to shoot on sight (= as soon as they saw somebody).",
                        "vi": "trên tầm nhìn Các binh sĩ được lệnh bắn ngay (= ngay khi họ nhìn thấy ai đó)."
                    }
                ]
            },
            {
                "define": {
                    "en": "the area or distance within which somebody can see or something can be seen",
                    "vi": "khu vực hoặc khoảng cách mà trong đó ai đó có thể nhìn thấy hoặc một cái gì đó có thể được nhìn thấy"
                },
                "examples": [
                    {
                        "en": "in sight There was no one in sight.",
                        "vi": "trong tầm nhìn Không có ai trong tầm nhìn."
                    },
                    {
                        "en": "They stole everything in sight.",
                        "vi": "Họ đã đánh cắp mọi thứ trong tầm mắt."
                    },
                    {
                        "en": "The end is in sight (= will happen soon).",
                        "vi": "Sự kết thúc đang ở trong tầm mắt (= sẽ sớm xảy ra)."
                    },
                    {
                        "en": "The goats ate everything in sight.",
                        "vi": "Những con dê đã ăn tất cả mọi thứ trong tầm nhìn."
                    },
                    {
                        "en": "in sight of somebody/something At last we came in sight of a few houses.",
                        "vi": "trong tầm nhìn của ai đó / cái gì đó Cuối cùng chúng tôi đã nhìn thấy một vài ngôi nhà."
                    },
                    {
                        "en": "A bicycle came into sight on the main road.",
                        "vi": "Một chiếc xe đạp xuất hiện trên đường chính."
                    },
                    {
                        "en": "within sight They marched on and by the following afternoon the enemy was within sight.",
                        "vi": "trong tầm nhìn Họ hành quân và đến chiều hôm sau kẻ thù đã trong tầm mắt."
                    },
                    {
                        "en": "within sight of somebody/something He sprinted ahead as they came within sight of the finishing line.",
                        "vi": "trong tầm nhìn của ai đó / cái gì đó Anh ta chạy nhanh về phía trước khi họ đến gần vạch đích."
                    },
                    {
                        "en": "out of sight Leave any valuables in your car out of sight.",
                        "vi": "khuất tầm nhìn Để mọi vật có giá trị trong xe của bạn khuất tầm nhìn."
                    },
                    {
                        "en": "Keep out of sight (= stay where you cannot be seen).",
                        "vi": "Tránh xa tầm mắt (= ở nơi bạn không thể nhìn thấy)."
                    },
                    {
                        "en": "out of somebody's sight She never lets her daughter out of her sight (= always keeps her where she can see her).",
                        "vi": "ra khỏi tầm nhìn của ai đó Cô ấy không bao giờ để con gái mình khuất tầm mắt (= luôn giữ cô ấy ở nơi cô ấy có thể nhìn thấy)."
                    },
                    {
                        "en": "Get out of my sight! (= Go away!)",
                        "vi": "Hãy ra khỏi tầm mắt của tôi! (= Biến đi!)"
                    },
                    {
                        "en": "The boat disappeared from sight.",
                        "vi": "Con thuyền biến mất khỏi tầm mắt."
                    },
                    {
                        "en": "The house was hidden from sight behind some trees.",
                        "vi": "Ngôi nhà khuất sau vài cái cây."
                    }
                ]
            },
            {
                "define": {
                    "en": "a thing that you see or can see",
                    "vi": "một thứ mà bạn thấy hoặc có thể thấy"
                },
                "examples": [
                    {
                        "en": "Roadside stalls are a common sight in the city.",
                        "vi": "Những quầy hàng ven đường là cảnh thường thấy ở thành phố."
                    },
                    {
                        "en": "It's a spectacular sight as the flamingos lift into the air.",
                        "vi": "Đó là một cảnh tượng ngoạn mục khi những con hồng hạc bay lên không trung."
                    },
                    {
                        "en": "The museum attempts to recreate the sights and sounds of wartime Britain.",
                        "vi": "Bảo tàng cố gắng tái tạo các điểm tham quan và âm thanh của nước Anh thời chiến."
                    },
                    {
                        "en": "He was a sorry sight, soaked to the skin and shivering.",
                        "vi": "Anh ta là một cảnh tượng đáng tiếc, ướt sũng da và rùng mình."
                    },
                    {
                        "en": "The bird is now a rare sight in this country.",
                        "vi": "Loài chim này hiện là cảnh hiếm gặp ở đất nước này."
                    },
                    {
                        "en": "He became a familiar sight on the streets of Oxford.",
                        "vi": "Anh trở thành cảnh tượng quen thuộc trên đường phố Oxford."
                    },
                    {
                        "en": "The gardens were a beautiful sight to behold in the twilight.",
                        "vi": "Những khu vườn là một cảnh đẹp đáng để chiêm ngưỡng trong buổi hoàng hôn."
                    }
                ]
            },
            {
                "define": {
                    "en": "the interesting places, especially in a town or city, that are often visited by tourists",
                    "vi": "những địa điểm thú vị, đặc biệt là ở một thị trấn hoặc thành phố, thường được khách du lịch ghé thăm"
                },
                "examples": [
                    {
                        "en": "We're going to Paris for the weekend to see the sights.",
                        "vi": "Chúng tôi sẽ đến Paris vào cuối tuần để xem các điểm tham quan."
                    },
                    {
                        "en": "The next day I did the sights of the city.",
                        "vi": "Ngày hôm sau, tôi đã tham quan thành phố."
                    },
                    {
                        "en": "It's best if you can get someone local to show you the sights.",
                        "vi": "Tốt nhất là bạn có thể nhờ người dân địa phương chỉ cho bạn các điểm tham quan."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person or thing that looks silly, untidy, unpleasant, etc.",
                    "vi": "một người hoặc một vật trông ngớ ngẩn, không gọn gàng, khó ưa, v.v."
                },
                "examples": [
                    {
                        "en": "She looks a sight in that hat!",
                        "vi": "Cô ấy trông một cảnh tượng trong chiếc mũ đó!"
                    }
                ]
            },
            {
                "define": {
                    "en": "a device that you look through to aim a gun, etc. or to look at something through a telescope, etc.",
                    "vi": "một thiết bị mà bạn nhìn qua để nhắm súng, v.v. hoặc để nhìn thứ gì đó qua kính thiên văn, v.v."
                },
                "examples": [
                    {
                        "en": "He had the deer in his sights now.",
                        "vi": "Bây giờ anh ta đã có con nai trong tầm ngắm của mình."
                    },
                    {
                        "en": "to align the sights on the target",
                        "vi": "để sắp xếp các điểm tham quan trên mục tiêu"
                    },
                    {
                        "en": "(figurative) Even as a young actress, she always had Hollywood firmly in her sights (= as her final goal).",
                        "vi": "(nghĩa bóng) Ngay cả khi còn là một nữ diễn viên trẻ, cô luôn có Hollywood vững chắc trong tầm ngắm của mình (= là mục tiêu cuối cùng của cô)."
                    }
                ]
            },
            {
                "define": {
                    "en": "when you first begin to consider something",
                    "vi": "khi bạn lần đầu tiên bắt đầu xem xét điều gì đó"
                },
                "examples": [
                    {
                        "en": "At first sight, it may look like a generous offer, but always read the small print.",
                        "vi": "Ngay từ cái nhìn đầu tiên, nó có thể giống như một lời đề nghị hào phóng, nhưng hãy luôn đọc phần in nhỏ."
                    }
                ]
            },
            {
                "define": {
                    "en": "when you see somebody/something for the first time",
                    "vi": "khi bạn nhìn thấy ai đó / cái gì đó lần đầu tiên"
                },
                "examples": [
                    {
                        "en": "It was love at first sight (= we fell in love the first time we saw each other).",
                        "vi": "Đó là tình yêu sét đánh (= chúng tôi đã yêu ngay từ lần đầu tiên nhìn thấy nhau)."
                    },
                    {
                        "en": "We fell in love with the house at first sight.",
                        "vi": "Chúng tôi đã yêu ngôi nhà ngay từ cái nhìn đầu tiên."
                    },
                    {
                        "en": "He looked at first sight like a tourist.",
                        "vi": "Anh ta nhìn từ cái nhìn đầu tiên như một khách du lịch."
                    }
                ]
            },
            {
                "define": {
                    "en": "to hate, etc. somebody/something very much",
                    "vi": "ghét, v.v. ai đó / điều gì đó rất nhiều"
                },
                "examples": [
                    {
                        "en": "I can't stand the sight of him!",
                        "vi": "Tôi không thể chịu được khi nhìn thấy anh ấy!"
                    },
                    {
                        "en": "We've shared an office for too long and we're sick of the sight of each other.",
                        "vi": "Chúng tôi đã ở chung một văn phòng quá lâu và chúng tôi phát ngán khi nhìn thấy nhau."
                    }
                ]
            },
            {
                "define": {
                    "en": "to appear, especially when moving gradually closer from a long way off",
                    "vi": "xuất hiện, đặc biệt là khi di chuyển dần đến gần hơn từ một khoảng cách xa"
                },
                "examples": [
                    {
                        "en": "A ship hove into sight.",
                        "vi": "Một con tàu lao vào tầm ngắm."
                    },
                    {
                        "en": "Like a galleon in full sail, Cara hove into view.",
                        "vi": "Giống như một chiếc thuyền buồm căng đầy, Cara lao vào tầm mắt."
                    }
                ]
            },
            {
                "define": {
                    "en": "in somebody’s opinion",
                    "vi": "theo ý kiến của ai đó"
                },
                "examples": [
                    {
                        "en": "We are all equal in the sight of God.",
                        "vi": "Tất cả chúng ta đều bình đẳng trước mắt Đức Chúa Trời."
                    }
                ]
            },
            {
                "define": {
                    "en": "to recognize somebody without knowing them well",
                    "vi": "nhận ra ai đó mà không cần biết rõ về họ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to become no longer able to see somebody/something",
                    "vi": "trở nên không còn có thể nhìn thấy ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "They finally lost sight of land.",
                        "vi": "Cuối cùng họ đã mất dấu đất."
                    }
                ]
            },
            {
                "define": {
                    "en": "to stop considering something; to forget something",
                    "vi": "ngừng xem xét điều gì đó; để quên một cái gì đó"
                },
                "examples": [
                    {
                        "en": "We must not lose sight of our original aim.",
                        "vi": "Chúng ta không được đánh mất mục tiêu ban đầu của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "not pleasant to look at",
                    "vi": "không dễ chịu khi nhìn vào"
                },
                "examples": [
                    {
                        "en": "You should have seen him in his swimming trunks—not a pretty sight!",
                        "vi": "Bạn nên nhìn thấy anh ấy trong chiếc quần bơi của anh ấy — không phải là một cảnh đẹp!"
                    }
                ]
            },
            {
                "define": {
                    "en": "impossible for anyone to find or see",
                    "vi": "không ai có thể tìm thấy hoặc nhìn thấy"
                },
                "examples": [
                    {
                        "en": "I wanted to talk to him but he was nowhere to be found.",
                        "vi": "Tôi muốn nói chuyện với anh ấy nhưng không thấy anh ấy đâu cả."
                    },
                    {
                        "en": "The children were nowhere to be seen.",
                        "vi": "Những đứa trẻ đã không còn được nhìn thấy."
                    },
                    {
                        "en": "A peace settlement is nowhere in sight (= is not likely in the near future).",
                        "vi": "Một khu định cư hòa bình không có ở đâu trong tầm mắt (= không có khả năng xảy ra trong tương lai gần)."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say somebody will quickly be forgotten when they are no longer with you",
                    "vi": "từng nói ai đó sẽ nhanh chóng bị lãng quên khi họ không còn ở bên bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to expect more/less from a situation",
                    "vi": "mong đợi nhiều hơn / ít hơn từ một tình huống"
                },
                "examples": [
                    {
                        "en": "If they can’t afford such a big house, they’ll just have to lower their sights a little.",
                        "vi": "Nếu họ không đủ khả năng mua một ngôi nhà lớn như vậy, họ sẽ phải hạ thấp tầm nhìn của mình một chút."
                    },
                    {
                        "en": "After failing to get into university, he lowered his sights and got a job in a shop.",
                        "vi": "Sau khi không vào được đại học, anh ta hạ thấp tầm nhìn và kiếm việc làm trong một cửa hàng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to decide that you want something and to try very hard to get it",
                    "vi": "quyết định rằng bạn muốn một cái gì đó và cố gắng rất nhiều để có được nó"
                },
                "examples": [
                    {
                        "en": "She's set her sights on getting into Harvard.",
                        "vi": "Cô ấy đặt mục tiêu vào Harvard."
                    },
                    {
                        "en": "I had set my sights on a career in journalism.",
                        "vi": "Tôi đã đặt mục tiêu vào sự nghiệp báo chí."
                    }
                ]
            },
            {
                "define": {
                    "en": "very much better; much too good, etc.",
                    "vi": "tốt hơn rất nhiều; nhiều quá tốt, v.v."
                },
                "examples": [
                    {
                        "en": "She's done a darn sight better than I have.",
                        "vi": "Cô ấy đã thực hiện một cảnh đẹp hơn tôi có."
                    },
                    {
                        "en": "It's worth a damn sight more than I thought.",
                        "vi": "Nó đáng để xem hơn tôi nghĩ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person or thing that you are pleased to see; something that is very pleasant to look at",
                    "vi": "một người hoặc một điều mà bạn hài lòng khi nhìn thấy; một cái gì đó rất dễ chịu khi nhìn vào"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "if you buy something sight unseen, you do not have an opportunity to see it before you buy it",
                    "vi": "nếu bạn mua một thứ gì đó mà bạn không thể nhìn thấy, bạn sẽ không có cơ hội để nhìn thấy nó trước khi mua nó"
                },
                "examples": [
                    {
                        "en": "I bought it, sight unseen.",
                        "vi": "Tôi đã mua nó, không thể nhìn thấy."
                    }
                ]
            }
        ]
    },
    {
        "id": "d6540ebb05934fc9aff2dec892817197",
        "word": "have a thing about somebody/something",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/θɪŋ/",
            "us": "/θɪŋ/"
        },
        "nearby": [
            {
                "word": "thine",
                "pos": "pronoun"
            },
            {
                "word": "thine",
                "pos": "determiner"
            },
            {
                "word": "thing",
                "pos": "noun"
            },
            {
                "word": "thingamajig",
                "pos": "noun"
            },
            {
                "word": "thingummy",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an object whose name you do not use because you do not need to or want to, or because you do not know it",
                    "vi": "một đối tượng mà bạn không sử dụng tên vì bạn không cần hoặc không muốn, hoặc vì bạn không biết nó"
                },
                "examples": [
                    {
                        "en": "Can you pass me that thing over there?",
                        "vi": "Bạn có thể chuyển cho tôi cái thứ đó ở đằng kia được không?"
                    },
                    {
                        "en": "She's very fond of sweet things (= sweet foods).",
                        "vi": "Cô ấy rất thích đồ ngọt (= đồ ăn ngọt)."
                    },
                    {
                        "en": "He's just bought one of those exercise things.",
                        "vi": "Anh ấy vừa mua một trong những thứ đó."
                    },
                    {
                        "en": "Turn that thing off while I'm talking to you!",
                        "vi": "Tắt nó đi khi tôi đang nói chuyện với bạn!"
                    }
                ]
            },
            {
                "define": {
                    "en": "an object that is not alive in the way that people and plants are",
                    "vi": "một vật thể không sống động như con người và thực vật"
                },
                "examples": [
                    {
                        "en": "Don't treat her like that—she's a person, not a thing!",
                        "vi": "Đừng đối xử với cô ấy như vậy - cô ấy là người, không phải vật!"
                    },
                    {
                        "en": "He's good at making things with his hands.",
                        "vi": "Anh ấy giỏi làm mọi thứ bằng đôi tay của mình."
                    },
                    {
                        "en": "She took no interest in the people and things around her.",
                        "vi": "Cô không quan tâm đến những người và những thứ xung quanh mình."
                    },
                    {
                        "en": "Books may one day become a thing of the past (= something that no longer exists).",
                        "vi": "Sách một ngày nào đó có thể trở thành dĩ vãng (= thứ không còn tồn tại)."
                    },
                    {
                        "en": "I need to buy a few basic things like bread and milk.",
                        "vi": "Tôi cần mua một vài thứ cơ bản như bánh mì và sữa."
                    }
                ]
            },
            {
                "define": {
                    "en": "objects, clothing or tools that belong to somebody or are used for a particular purpose",
                    "vi": "đồ vật, quần áo hoặc công cụ của ai đó hoặc được sử dụng cho một mục đích cụ thể"
                },
                "examples": [
                    {
                        "en": "Shall I help you pack your things?",
                        "vi": "Tôi sẽ giúp bạn đóng gói đồ đạc của bạn chứ?"
                    },
                    {
                        "en": "Bring your swimming things with you.",
                        "vi": "Mang theo đồ bơi của bạn với bạn."
                    },
                    {
                        "en": "I'll just clear away the breakfast things.",
                        "vi": "Tôi sẽ dọn đồ ăn sáng đi."
                    },
                    {
                        "en": "Put your things (= coat, etc.) on and let's go.",
                        "vi": "Mặc đồ của bạn (= áo khoác, v.v.) vào và đi thôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a fact, an event, a situation or an action; what somebody says or thinks",
                    "vi": "một thực tế, một sự kiện, một tình huống hoặc một hành động; những gì ai đó nói hoặc nghĩ"
                },
                "examples": [
                    {
                        "en": "They talked about many things, like books, music and films.",
                        "vi": "Họ nói về nhiều thứ, như sách, nhạc và phim."
                    },
                    {
                        "en": "There are a lot of things she doesn't know about me.",
                        "vi": "Có rất nhiều điều cô ấy không biết về tôi."
                    },
                    {
                        "en": "There's another thing I need to tell you.",
                        "vi": "Có một điều tôi cần nói với bạn."
                    },
                    {
                        "en": "Bad things happen to good people.",
                        "vi": "Những điều tồi tệ xảy ra với những người tốt."
                    },
                    {
                        "en": "I've got lots of things to do today.",
                        "vi": "Hôm nay tôi có rất nhiều việc phải làm."
                    },
                    {
                        "en": "He has things on his mind.",
                        "vi": "Anh ấy có nhiều thứ trong tâm trí của mình."
                    },
                    {
                        "en": "The most important thing in life is to have fun!",
                        "vi": "Điều quan trọng nhất trong cuộc sống là vui vẻ!"
                    },
                    {
                        "en": "She said the first thing that came into her head.",
                        "vi": "Cô ấy nói điều đầu tiên nảy ra trong đầu mình."
                    },
                    {
                        "en": "Forgetting her was the only thing in the world I found I couldn't do.",
                        "vi": "Quên cô ấy là điều duy nhất trên thế giới này tôi thấy mình không thể làm được."
                    },
                    {
                        "en": "He found the whole thing (= the situation) very boring.",
                        "vi": "Anh ấy thấy toàn bộ sự việc (= tình huống) rất nhàm chán."
                    },
                    {
                        "en": "Let's forget the whole thing (= everything).",
                        "vi": "Hãy quên toàn bộ điều (= mọi thứ)."
                    },
                    {
                        "en": "Among other things, I have to deal with mail and keep the accounts.",
                        "vi": "Trong số những thứ khác, tôi phải xử lý thư và giữ các tài khoản."
                    },
                    {
                        "en": "I like camping, climbing and that sort of thing.",
                        "vi": "Tôi thích cắm trại, leo núi và những thứ đại loại như vậy."
                    },
                    {
                        "en": "‘Why did you tell her our secret?’ ‘I did no such thing!’",
                        "vi": "Tại sao bạn lại nói cho cô ấy biết bí mật của chúng tôi?' 'Tôi không làm điều tương tự!'"
                    },
                    {
                        "en": "There's no such thing as a typical day in this job.",
                        "vi": "Không có cái gọi là một ngày điển hình trong công việc này."
                    },
                    {
                        "en": "One thing is for sure—it will be a memorable evening!",
                        "vi": "Có một điều chắc chắn - đó sẽ là một buổi tối đáng nhớ!"
                    },
                    {
                        "en": "The main thing to remember is to switch off the burglar alarm.",
                        "vi": "Điều chính cần nhớ là tắt báo động chống trộm."
                    }
                ]
            },
            {
                "define": {
                    "en": "the general situation, as it affects somebody",
                    "vi": "tình hình chung, vì nó ảnh hưởng đến ai đó"
                },
                "examples": [
                    {
                        "en": "Things haven't gone entirely to plan.",
                        "vi": "Mọi thứ không hoàn toàn theo kế hoạch."
                    },
                    {
                        "en": "I wish things could have been different.",
                        "vi": "Tôi ước mọi thứ có thể khác đi."
                    },
                    {
                        "en": "(informal) Hi, Jane! How are things?",
                        "vi": "(thân mật) Xin chào, Jane! Mọi thứ thế nào?"
                    },
                    {
                        "en": "As things stand at present, he seems certain to win.",
                        "vi": "Khi mọi thứ diễn ra ở thời điểm hiện tại, anh ấy có vẻ chắc chắn sẽ giành chiến thắng."
                    },
                    {
                        "en": "All things considered (= considering all the difficulties or problems), she's done very well.",
                        "vi": "Tất cả những điều được xem xét (= xem xét tất cả những khó khăn hoặc vấn đề), cô ấy đã hoàn thành rất tốt."
                    },
                    {
                        "en": "They're trying to change things for the better.",
                        "vi": "Họ đang cố gắng thay đổi mọi thứ để tốt hơn."
                    },
                    {
                        "en": "Things have changed over the last few years.",
                        "vi": "Mọi thứ đã thay đổi trong vài năm qua."
                    },
                    {
                        "en": "He's happy with the way things have worked out.",
                        "vi": "Anh ấy hạnh phúc với cách mọi thứ đã diễn ra."
                    },
                    {
                        "en": "Why do you make things so difficult for yourself?",
                        "vi": "Tại sao bạn lại tự làm mọi thứ trở nên khó khăn như vậy?"
                    }
                ]
            },
            {
                "define": {
                    "en": "a quality or a concept",
                    "vi": "một chất lượng hoặc một khái niệm"
                },
                "examples": [
                    {
                        "en": "Reality and truth are not the same thing.",
                        "vi": "Thực tế và sự thật không giống nhau."
                    },
                    {
                        "en": "The two of them have one thing in common—they never give up.",
                        "vi": "Hai người họ có một điểm chung - họ không bao giờ bỏ cuộc."
                    },
                    {
                        "en": "The good thing about this job is all the travelling.",
                        "vi": "Điều tốt về công việc này là tất cả các chuyến du lịch."
                    }
                ]
            },
            {
                "define": {
                    "en": "what is needed or socially acceptable",
                    "vi": "những gì cần thiết hoặc được xã hội chấp nhận"
                },
                "examples": [
                    {
                        "en": "You need something to cheer you up—I know just the thing!",
                        "vi": "Bạn cần một cái gì đó để cổ vũ bạn — tôi chỉ biết một điều!"
                    },
                    {
                        "en": "to say the right/wrong thing",
                        "vi": "nói điều đúng / sai"
                    },
                    {
                        "en": "The best thing to do is to apologize.",
                        "vi": "Điều tốt nhất nên làm là xin lỗi."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that something is important or real",
                    "vi": "được sử dụng để nói rằng một cái gì đó quan trọng hoặc có thật"
                },
                "examples": [
                    {
                        "en": "I don't understand why these corny films are still a thing in 2020.",
                        "vi": "Tôi không hiểu tại sao những bộ phim ngô nghê này vẫn là một thứ trong năm 2020."
                    },
                    {
                        "en": "I'm not sure that ‘modular techno music’ is really a thing.",
                        "vi": "Tôi không chắc rằng 'nhạc công nghệ mô-đun' có thực sự là một thứ."
                    }
                ]
            },
            {
                "define": {
                    "en": "used with negatives to mean ‘anything’ in order to emphasize what you are saying",
                    "vi": "được sử dụng với phủ định để có nghĩa là 'bất cứ điều gì' để nhấn mạnh những gì bạn đang nói"
                },
                "examples": [
                    {
                        "en": "I haven't got a thing to wear!",
                        "vi": "Tôi không có thứ để mặc!"
                    },
                    {
                        "en": "She hasn't had a thing to eat all day.",
                        "vi": "Cô ấy đã không có một thứ để ăn cả ngày."
                    },
                    {
                        "en": "There wasn't a thing we could do to help.",
                        "vi": "Chúng tôi không thể giúp được gì."
                    },
                    {
                        "en": "Ignore what he said—it doesn't mean a thing.",
                        "vi": "Bỏ qua những gì anh ta nói — nó không có nghĩa gì cả."
                    }
                ]
            },
            {
                "define": {
                    "en": "all that can be described in a particular way",
                    "vi": "tất cả những gì có thể được mô tả theo một cách cụ thể"
                },
                "examples": [
                    {
                        "en": "She loves all things Japanese.",
                        "vi": "Cô ấy yêu tất cả những thứ của Nhật Bản."
                    }
                ]
            },
            {
                "define": {
                    "en": "a living creature",
                    "vi": "một sinh vật sống"
                },
                "examples": [
                    {
                        "en": "All living things are composed of cells.",
                        "vi": "Tất cả các sinh vật đều được cấu tạo bởi các tế bào."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to talk to or about a person or an animal, to show how you feel about them",
                    "vi": "được sử dụng để nói chuyện với hoặc về một người hoặc một con vật, để cho thấy bạn cảm thấy thế nào về chúng"
                },
                "examples": [
                    {
                        "en": "You silly thing!",
                        "vi": "Đồ ngớ ngẩn!"
                    },
                    {
                        "en": "You must be starving, you poor things.",
                        "vi": "Bạn hẳn đang chết đói, bạn là những thứ tội nghiệp."
                    },
                    {
                        "en": "The cat's very ill, poor old thing.",
                        "vi": "Con mèo rất ốm, cái cũ đáng thương."
                    },
                    {
                        "en": "The baby's a pretty little thing.",
                        "vi": "Đứa bé là một thứ nhỏ xinh."
                    }
                ]
            },
            {
                "define": {
                    "en": "if the conditions stay the same; if other conditions are the same",
                    "vi": "nếu các điều kiện giữ nguyên; nếu các điều kiện khác giống nhau"
                },
                "examples": [
                    {
                        "en": "All things being equal, we should finish the job tomorrow.",
                        "vi": "Tất cả mọi thứ đều bình đẳng, chúng ta nên hoàn thành công việc vào ngày mai."
                    },
                    {
                        "en": "All other things being equal, the bigger fighter should win.",
                        "vi": "Tất cả những thứ khác bằng nhau, đấu sĩ lớn hơn sẽ giành chiến thắng."
                    }
                ]
            },
            {
                "define": {
                    "en": "used when you do not want to complete a list",
                    "vi": "được sử dụng khi bạn không muốn hoàn thành một danh sách"
                },
                "examples": [
                    {
                        "en": "She likes nice clothes and things like that.",
                        "vi": "Cô ấy thích quần áo đẹp và những thứ tương tự."
                    },
                    {
                        "en": "I've been busy shopping and things.",
                        "vi": "Tôi đang bận mua sắm và nhiều thứ."
                    }
                ]
            },
            {
                "define": {
                    "en": "as was shown or proved by later events",
                    "vi": "như đã được hiển thị hoặc chứng minh bởi các sự kiện sau đó"
                },
                "examples": [
                    {
                        "en": "I didn't need my umbrella, as it turned out (= because it didn't rain).",
                        "vi": "Hóa ra tôi không cần ô của mình (= vì trời không mưa)."
                    }
                ]
            },
            {
                "define": {
                    "en": "as was shown or proved by later events",
                    "vi": "như đã được hiển thị hoặc chứng minh bởi các sự kiện sau đó"
                },
                "examples": [
                    {
                        "en": "As things turned out, the weather—and the whole weekend—were perfect.",
                        "vi": "Khi mọi thứ diễn ra, thời tiết — và cả ngày cuối tuần — đều hoàn hảo."
                    }
                ]
            },
            {
                "define": {
                    "en": "to please everyone by changing your attitudes or opinions to suit different people",
                    "vi": "để làm hài lòng tất cả mọi người bằng cách thay đổi thái độ hoặc quan điểm của bạn để phù hợp với những người khác nhau"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be understood or used in different ways by different people",
                    "vi": "được những người khác nhau hiểu hoặc sử dụng theo những cách khác nhau"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be socially acceptable behaviour",
                    "vi": "là hành vi được xã hội chấp nhận"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be lucky that…",
                    "vi": "may mắn rằng…"
                },
                "examples": [
                    {
                        "en": "It's a good thing we got here early.",
                        "vi": "Đó là một điều tốt khi chúng tôi đến đây sớm."
                    },
                    {
                        "en": "It's a good thing you remembered to turn off the gas!",
                        "vi": "Bạn nhớ tắt ga là điều tốt!"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that although something seems to be bad, it could have good results",
                    "vi": "từng nói rằng mặc dù điều gì đó có vẻ không tốt nhưng nó có thể có kết quả tốt"
                },
                "examples": [
                    {
                        "en": "We didn't want the press to get hold of the story, but it might be no bad thing.",
                        "vi": "Chúng tôi không muốn báo chí nắm bắt được câu chuyện, nhưng nó có thể không phải là điều tồi tệ."
                    },
                    {
                        "en": "It's no bad thing to express your anger.",
                        "vi": "Việc bày tỏ sự tức giận của bạn không có gì là xấu cả."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have found a job, situation or style of life that is pleasant or easy",
                    "vi": "để tìm được một công việc, hoàn cảnh hoặc phong cách sống hài lòng hoặc dễ dàng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to imagine that you can see or hear something that is in fact not there",
                    "vi": "tưởng tượng rằng bạn có thể nhìn thấy hoặc nghe thấy một cái gì đó mà thực tế là không có ở đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "people say chance would be a fine thing to show that they would like to do or have the thing that somebody has mentioned, but that they do not think that it is very likely",
                    "vi": "mọi người nói rằng cơ hội sẽ là một điều tốt để thể hiện rằng họ muốn làm hoặc có điều mà ai đó đã đề cập, nhưng họ không nghĩ rằng nó rất có thể"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a situation in which somebody only just wins or loses, for example in a competition or an election",
                    "vi": "một tình huống trong đó ai đó chỉ thắng hoặc thua, ví dụ như trong một cuộc thi hoặc một cuộc bầu cử"
                },
                "examples": [
                    {
                        "en": "Mr Taylor’s election defeat was a close-run thing.",
                        "vi": "Thất bại trong cuộc bầu cử của ông Taylor là một điều gần như sắp xảy ra."
                    },
                    {
                        "en": "The invasion never happened but it was a close-run thing.",
                        "vi": "Cuộc xâm lược không bao giờ xảy ra nhưng nó là một điều gần như chạy."
                    }
                ]
            },
            {
                "define": {
                    "en": "a situation in which success or failure is equally possible",
                    "vi": "một tình huống mà thành công hay thất bại đều có thể xảy ra"
                },
                "examples": [
                    {
                        "en": "We got him out in the end, but it was a close thing.",
                        "vi": "Cuối cùng thì chúng tôi cũng đưa được anh ta ra ngoài, nhưng đó là một điều gần như tuyệt vời."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have the same result or meaning",
                    "vi": "để có cùng một kết quả hoặc ý nghĩa"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to do what you want to do or what interests you, without thinking about other people; to be independent",
                    "vi": "làm những gì bạn muốn làm hoặc những gì bạn quan tâm, mà không nghĩ đến người khác; độc lập"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to have a powerful emotional effect on somebody",
                    "vi": "để có một hiệu ứng cảm xúc mạnh mẽ đối với ai đó"
                },
                "examples": [
                    {
                        "en": "That song just does things to me.",
                        "vi": "Bài hát đó chỉ làm những điều đối với tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "early in the morning/late in the evening",
                    "vi": "sáng sớm / chiều tối"
                },
                "examples": [
                    {
                        "en": "I need the report on my desk first thing Monday morning.",
                        "vi": "Tôi cần báo cáo trên bàn làm việc đầu tiên vào sáng thứ Hai."
                    },
                    {
                        "en": "I took the dog for a walk last thing before going to bed.",
                        "vi": "Tôi dắt chó đi dạo lần cuối trước khi đi ngủ."
                    }
                ]
            },
            {
                "define": {
                    "en": "the most important matters must be dealt with first",
                    "vi": "những vấn đề quan trọng nhất phải được giải quyết trước tiên"
                },
                "examples": [
                    {
                        "en": "We have a lot to discuss, but, first things first, let's have a cup of coffee!",
                        "vi": "Chúng ta có rất nhiều điều để thảo luận, nhưng, điều đầu tiên, chúng ta hãy uống một tách cà phê!"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to introduce one of two or more reasons for doing something",
                    "vi": "được sử dụng để giới thiệu một trong hai hoặc nhiều lý do để làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "‘Why don't you get a car?’ ‘Well, for one thing, I can't drive!’",
                        "vi": "Tại sao bạn không lấy một chiếc xe hơi?' 'À, có một điều, tôi không thể lái xe!'"
                    }
                ]
            },
            {
                "define": {
                    "en": "to have something arranged in the way that you want, even though other people want it to be arranged differently",
                    "vi": "sắp xếp thứ gì đó theo cách bạn muốn, mặc dù người khác muốn nó được sắp xếp theo cách khác"
                },
                "examples": [
                    {
                        "en": "The German team weren't going to let the English have everything their own way.",
                        "vi": "Đội tuyển Đức sẽ không để người Anh có mọi thứ theo cách riêng của họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have a strong like or dislike of somebody/something in a way that seems strange or unreasonable",
                    "vi": "thích hoặc không thích ai đó / điều gì đó theo cách có vẻ kỳ lạ hoặc không hợp lý"
                },
                "examples": [
                    {
                        "en": "She has a thing about men with beards.",
                        "vi": "Cô ấy có quan điểm về đàn ông có râu."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be sexually attracted to somebody; to like something very much",
                    "vi": "bị thu hút tình dục bởi ai đó; thích một cái gì đó rất nhiều"
                },
                "examples": [
                    {
                        "en": "Liz has always had a thing for guys in bands.",
                        "vi": "Liz luôn thích những chàng trai trong ban nhạc."
                    },
                    {
                        "en": "He has a thing for the new girl in the office.",
                        "vi": "Anh ta có một thứ cho cô gái mới trong văn phòng."
                    },
                    {
                        "en": "Jamie has a thing for fast cars.",
                        "vi": "Jamie thích những chiếc xe chạy nhanh."
                    }
                ]
            },
            {
                "define": {
                    "en": "in the way that things usually happen",
                    "vi": "theo cách mà mọi thứ thường xảy ra"
                },
                "examples": [
                    {
                        "en": "In the nature of things, young people often rebel against their parents.",
                        "vi": "Trong bản chất của sự việc, những người trẻ tuổi thường nổi loạn chống lại cha mẹ của họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "B is very different from A, for example it is more difficult, serious or important",
                    "vi": "B rất khác với A, ví dụ nó khó hơn, nghiêm túc hơn hoặc quan trọng hơn"
                },
                "examples": [
                    {
                        "en": "Romance is one thing; marriage is quite another.",
                        "vi": "Lãng mạn là một chuyện; hôn nhân là hoàn toàn khác."
                    },
                    {
                        "en": "It's one thing to tease your sister, but it's another to hit her.",
                        "vi": "Chọc ghẹo em gái bạn là một chuyện, nhưng đánh cô ấy lại là một chuyện khác."
                    }
                ]
            },
            {
                "define": {
                    "en": "it isn’t something that you really enjoy or are interested in",
                    "vi": "nó không phải là thứ mà bạn thực sự thích thú hoặc quan tâm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "it is something that only a particular group understands",
                    "vi": "nó là thứ mà chỉ một nhóm cụ thể mới hiểu được"
                },
                "examples": [
                    {
                        "en": "You wouldn't know what it means—it's a girl thing.",
                        "vi": "Bạn sẽ không biết nó có nghĩa là gì - đó là một điều của con gái."
                    }
                ]
            },
            {
                "define": {
                    "en": "to know/tell somebody some useful, interesting or surprising information about somebody/something",
                    "vi": "để biết / nói với ai đó một số thông tin hữu ích, thú vị hoặc đáng ngạc nhiên về ai đó / điều gì đó"
                },
                "examples": [
                    {
                        "en": "She's been married five times, so she knows a thing or two about men!",
                        "vi": "Cô ấy đã kết hôn năm lần, vì vậy cô ấy biết một hoặc hai điều về đàn ông!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to make something seem more important than it really is",
                    "vi": "để làm cho một cái gì đó có vẻ quan trọng hơn nó thực sự"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a situation in which you are successful, but which could also have ended badly",
                    "vi": "một tình huống mà bạn thành công, nhưng cũng có thể kết thúc tồi tệ"
                },
                "examples": [
                    {
                        "en": "Phew! That was a near thing! It could have been a disaster.",
                        "vi": "Phù! Đó là một điều gần! Nó có thể là một thảm họa."
                    },
                    {
                        "en": "We won in the end but it was a near thing.",
                        "vi": "Cuối cùng thì chúng tôi cũng giành chiến thắng nhưng đó là điều gần như xa vời."
                    }
                ]
            },
            {
                "define": {
                    "en": "to know nothing at all about something/somebody",
                    "vi": "không biết gì về điều gì đó / ai đó"
                },
                "examples": [
                    {
                        "en": "We’ve lived next to him for years, but we still don’t know the first thing about him.",
                        "vi": "Chúng tôi đã sống bên cạnh anh ấy trong nhiều năm, nhưng chúng tôi vẫn không biết điều đầu tiên về anh ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "not considered socially acceptable",
                    "vi": "không được xã hội coi là chấp nhận được"
                },
                "examples": [
                    {
                        "en": "It wouldn't be quite the thing to turn up in running gear.",
                        "vi": "Nó sẽ không phải là một điều hoàn toàn để bật lên trong thiết bị chạy."
                    }
                ]
            },
            {
                "define": {
                    "en": "not healthy or normal",
                    "vi": "không khỏe mạnh hay bình thường"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to say that you do not want to discuss or think about something bad or unpleasant that has happened, but just accept it",
                    "vi": "được sử dụng để nói rằng bạn không muốn thảo luận hoặc nghĩ về điều gì đó tồi tệ hoặc khó chịu đã xảy ra, nhưng chỉ cần chấp nhận nó"
                },
                "examples": [
                    {
                        "en": "It wasn't your fault. It was just one of those things.",
                        "vi": "Đó không phải lỗi của bạn. Đó chỉ là một trong những điều đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to complain that a lot of unpleasant things keep happening to you",
                    "vi": "từng phàn nàn rằng có rất nhiều điều khó chịu liên tục xảy ra với bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to suggest that the way one event or action leads to others is so obvious that it does not need to be stated",
                    "vi": "được sử dụng để gợi ý rằng cách một sự kiện hoặc hành động dẫn đến những sự kiện hoặc hành động khác quá rõ ràng đến mức không cần phải nêu"
                },
                "examples": [
                    {
                        "en": "He offered me a ride home one night, and, well, one thing led to another and now we're married!",
                        "vi": "Anh ấy đề nghị tôi đi nhờ xe về nhà vào một đêm, và, chuyện này đã dẫn đến chuyện khác và bây giờ chúng tôi đã kết hôn!"
                    }
                ]
            },
            {
                "define": {
                    "en": "used before mentioning a worry or problem you have with something",
                    "vi": "được sử dụng trước khi đề cập đến một lo lắng hoặc vấn đề bạn gặp phải với một cái gì đó"
                },
                "examples": [
                    {
                        "en": "I'd love to come—the only thing is I might be late.",
                        "vi": "Tôi rất muốn đến — điều duy nhất là tôi có thể đến muộn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to work, study, etc. too hard or for too long",
                    "vi": "làm việc, học tập, v.v. quá vất vả hoặc quá lâu"
                },
                "examples": [
                    {
                        "en": "He's been overdoing things recently.",
                        "vi": "Anh ấy đã làm quá mọi thứ gần đây."
                    },
                    {
                        "en": "I overdid it in the gym and hurt my back.",
                        "vi": "Tôi đã tập quá liều trong phòng tập thể dục và bị đau lưng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to take a risk because you have successfully avoided problems in the past",
                    "vi": "chấp nhận rủi ro vì bạn đã thành công trong việc tránh các vấn đề trong quá khứ"
                },
                "examples": [
                    {
                        "en": "You didn't get caught last time, but don't push your luck!",
                        "vi": "Bạn đã không bị bắt lần trước, nhưng đừng đẩy vận may của bạn!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to take a risk because you have successfully avoided problems in the past",
                    "vi": "chấp nhận rủi ro vì bạn đã thành công trong việc tránh các vấn đề trong quá khứ"
                },
                "examples": [
                    {
                        "en": "Don't push things—we don't want it all to go wrong now.",
                        "vi": "Đừng thúc ép mọi thứ — chúng tôi không muốn mọi thứ trở nên sai trái ngay bây giờ."
                    }
                ]
            },
            {
                "define": {
                    "en": "actually what somebody claims that something is",
                    "vi": "thực sự những gì ai đó tuyên bố rằng một cái gì đó là"
                },
                "examples": [
                    {
                        "en": "Are you sure it's the real thing (= love), not just infatuation?",
                        "vi": "Bạn có chắc đó là điều thực sự (= tình yêu), không chỉ là mê đắm?"
                    }
                ]
            },
            {
                "define": {
                    "en": "the way things seem to be organized; the way somebody wants everything to be organized",
                    "vi": "cách mọi thứ dường như được tổ chức; cách ai đó muốn mọi thứ được tổ chức"
                },
                "examples": [
                    {
                        "en": "My personal problems are not really important in the overall scheme of things.",
                        "vi": "Vấn đề cá nhân của tôi không thực sự quan trọng trong sơ đồ tổng thể của mọi thứ."
                    },
                    {
                        "en": "This small annoyance isn't much in the grand scheme of things.",
                        "vi": "Điều khó chịu nhỏ này không nhiều trong kế hoạch lớn của mọi thứ."
                    },
                    {
                        "en": "I don't think marriage figures in his scheme of things.",
                        "vi": "Tôi không nghĩ hôn nhân có trong kế hoạch của anh ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "the way things are likely to develop in the future",
                    "vi": "cách mọi thứ có thể phát triển trong tương lai"
                },
                "examples": [
                    {
                        "en": "Are solar-powered cars the shape of things to come?",
                        "vi": "Những chiếc ô tô chạy bằng năng lượng mặt trời có phải là hình dạng của những thứ sắp tới không?"
                    },
                    {
                        "en": "This new system could be the shape of things to come.",
                        "vi": "Hệ thống mới này có thể là hình dạng của những thứ sắp tới."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say ‘yes’ to a suggestion or request",
                    "vi": "được sử dụng để nói 'có' với một đề xuất hoặc yêu cầu"
                },
                "examples": [
                    {
                        "en": "‘Are you coming?’ ‘Sure thing.’",
                        "vi": "Bạn có đến không?' 'Chắc chắn rồi.'"
                    }
                ]
            },
            {
                "define": {
                    "en": "to relax and avoid working too hard or doing too much",
                    "vi": "thư giãn và tránh làm việc quá sức hoặc làm quá nhiều"
                },
                "examples": [
                    {
                        "en": "The doctor told me to take it easy for a few weeks.",
                        "vi": "Bác sĩ dặn tôi phải chịu khó trong vài tuần."
                    },
                    {
                        "en": "I like to take things easy when I’m on holiday.",
                        "vi": "Tôi thích làm mọi thứ dễ dàng khi tôi đi nghỉ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to not think about what will happen in the future",
                    "vi": "không nghĩ về những gì sẽ xảy ra trong tương lai"
                },
                "examples": [
                    {
                        "en": "I don't know if he'll get better. We're just taking it one day at a time.",
                        "vi": "Tôi không biết liệu anh ấy có khỏe hơn không. Chúng tôi chỉ dùng nó một ngày một lần."
                    }
                ]
            },
            {
                "define": {
                    "en": "to not think about what will happen in the future",
                    "vi": "không nghĩ về những gì sẽ xảy ra trong tương lai"
                },
                "examples": [
                    {
                        "en": "I don't know if he'll get better. We're just taking things one day at a time.",
                        "vi": "Tôi không biết liệu anh ấy có khỏe hơn không. Chúng tôi chỉ xem xét mọi thứ một ngày một lần."
                    }
                ]
            },
            {
                "define": {
                    "en": "there is only one possible course of action",
                    "vi": "chỉ có một cách hành động"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to say that you should accept an unpleasant situation or event because you cannot change it",
                    "vi": "được sử dụng để nói rằng bạn nên chấp nhận một tình huống hoặc sự kiện khó chịu bởi vì bạn không thể thay đổi nó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a situation or an activity of the type mentioned",
                    "vi": "một tình huống hoặc một hoạt động thuộc loại được đề cập"
                },
                "examples": [
                    {
                        "en": "She really didn't want to be involved in the whole family thing.",
                        "vi": "Cô thực sự không muốn dính dáng đến chuyện của cả gia đình."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to introduce an important fact, reason or explanation",
                    "vi": "được sử dụng để giới thiệu một sự kiện, lý do hoặc lời giải thích quan trọng"
                },
                "examples": [
                    {
                        "en": "I'm sorry my assignment isn't finished. The thing is, I've had a lot of other work this week.",
                        "vi": "Tôi xin lỗi bài tập của tôi chưa hoàn thành. Vấn đề là, tôi đã có rất nhiều công việc khác trong tuần này."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to introduce a problem about something/somebody",
                    "vi": "được sử dụng để giới thiệu một vấn đề về một cái gì đó / ai đó"
                },
                "examples": [
                    {
                        "en": "The thing with Karl is, he's always late.",
                        "vi": "Vấn đề với Karl là anh ấy luôn đến muộn."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to refer to ghosts and other supernatural things that cannot be explained",
                    "vi": "dùng để chỉ ma và những thứ siêu nhiên khác không thể giải thích được"
                },
                "examples": [
                    {
                        "en": "There are mysterious lights in the sky and things that go bump in the night.",
                        "vi": "Có những ánh sáng bí ẩn trên bầu trời và những thứ va chạm trong đêm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to do what people or society expect, especially in a difficult situation",
                    "vi": "để làm những gì mọi người hoặc xã hội mong đợi, đặc biệt là trong một tình huống khó khăn"
                },
                "examples": [
                    {
                        "en": "He did the decent thing and resigned.",
                        "vi": "Anh ta đã làm điều tử tế và từ chức."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that, although something is pleasant, you do not want to have too much of it",
                    "vi": "thường nói rằng, mặc dù một cái gì đó dễ chịu, bạn không muốn có quá nhiều"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "because you have been busy with various problems, events or things you had to do",
                    "vi": "bởi vì bạn đã bận rộn với nhiều vấn đề, sự kiện hoặc những việc bạn phải làm"
                },
                "examples": [
                    {
                        "en": "I completely forgot her birthday, what with one thing and another.",
                        "vi": "Tôi hoàn toàn quên mất sinh nhật của cô ấy, những gì với thứ này và thứ khác."
                    }
                ]
            },
            {
                "define": {
                    "en": "to arrange something in a particular way, especially by being clever",
                    "vi": "sắp xếp thứ gì đó theo một cách cụ thể, đặc biệt là bằng cách khéo léo"
                },
                "examples": [
                    {
                        "en": "Can you work it so that we get free tickets?",
                        "vi": "Bạn có thể làm việc đó để chúng tôi nhận được vé miễn phí không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to arrange something in a particular way, especially by being clever",
                    "vi": "sắp xếp thứ gì đó theo một cách cụ thể, đặc biệt là bằng cách khéo léo"
                },
                "examples": [
                    {
                        "en": "Can you work things so that we get Friday afternoon off?",
                        "vi": "Bạn có thể làm việc để chúng ta được nghỉ chiều thứ Sáu không?"
                    }
                ]
            }
        ]
    },
    {
        "id": "7762afadeb8b468689cd23411dc669e4",
        "word": "have against",
        "pos": "phrasal verb",
        "level": "c2",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "have",
                "pos": "verb"
            },
            {
                "word": "have",
                "pos": "auxiliary verb"
            },
            {
                "word": "have against",
                "pos": "phrasal verb"
            },
            {
                "word": "have back",
                "pos": "phrasal verb"
            },
            {
                "word": "have in",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to dislike somebody/something for a particular reason",
                    "vi": "không thích ai đó / điều gì đó vì một lý do cụ thể"
                },
                "examples": [
                    {
                        "en": "What have you got against Ruth? She's always been good to you.",
                        "vi": "Bạn có gì để chống lại Ruth? Cô ấy luôn tốt với bạn."
                    }
                ]
            }
        ]
    },
    {
        "id": "6e5562fb8c82436f99f38b0cf318f965",
        "word": "have no time for somebody/something",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/taɪm/",
            "us": "/taɪm/"
        },
        "nearby": [
            {
                "word": "timbre",
                "pos": "noun"
            },
            {
                "word": "Timbuktu",
                "pos": "noun"
            },
            {
                "word": "time",
                "pos": "noun"
            },
            {
                "word": "time",
                "pos": "verb"
            },
            {
                "word": "Time",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "what is measured in minutes, hours, days, etc.",
                    "vi": "những gì được đo bằng phút, giờ, ngày, v.v."
                },
                "examples": [
                    {
                        "en": "The world exists in time and space.",
                        "vi": "Thế giới tồn tại trong thời gian và không gian."
                    },
                    {
                        "en": "The changing seasons mark the passage of time.",
                        "vi": "Sự thay đổi của các mùa đánh dấu thời gian trôi qua."
                    },
                    {
                        "en": "in time A visit to the museum will take you back in time to the 1930s.",
                        "vi": "trong thời gian Một chuyến thăm bảo tàng sẽ đưa bạn ngược dòng thời gian trở về những năm 1930."
                    },
                    {
                        "en": "At this point in time, it seems unlikely that he will write any more books.",
                        "vi": "Vào thời điểm này, có vẻ như anh ấy sẽ không viết thêm cuốn sách nào nữa."
                    },
                    {
                        "en": "over time Perceptions change over time (= as time passes).",
                        "vi": "theo thời gian Nhận thức thay đổi theo thời gian (= khi thời gian trôi qua)."
                    },
                    {
                        "en": "As time goes on I love this city more and more.",
                        "vi": "Theo thời gian, tôi ngày càng yêu thành phố này nhiều hơn."
                    },
                    {
                        "en": "As time went by we saw less and less of each other.",
                        "vi": "Thời gian trôi qua chúng tôi ngày càng ít gặp nhau hơn."
                    },
                    {
                        "en": "The main character is able to travel through time.",
                        "vi": "Nhân vật chính có thể du hành xuyên thời gian."
                    }
                ]
            },
            {
                "define": {
                    "en": "the time shown on a clock in minutes and hours",
                    "vi": "thời gian được hiển thị trên đồng hồ tính bằng phút và giờ"
                },
                "examples": [
                    {
                        "en": "What time is it/What’s the time?",
                        "vi": "Mấy giờ rồi / Mấy giờ rồi?"
                    },
                    {
                        "en": "Do you have the time?",
                        "vi": "Bạn có thời gian không?"
                    },
                    {
                        "en": "(British English) What time do you make it?",
                        "vi": "(Anh Anh) Mấy giờ bạn thực hiện nó?"
                    },
                    {
                        "en": "(North American English) What time do you have?",
                        "vi": "(Tiếng Anh Bắc Mỹ) Bạn có mấy giờ?"
                    },
                    {
                        "en": "Let me just check the time.",
                        "vi": "Hãy để tôi chỉ cần kiểm tra thời gian."
                    },
                    {
                        "en": "The time is now half past ten.",
                        "vi": "Bây giờ là 10 giờ rưỡi."
                    },
                    {
                        "en": "(British English) Can she tell the time yet (= say what time it is by looking at a clock)?",
                        "vi": "(Tiếng Anh Anh) Cô ấy có thể cho biết thời gian chưa (= nói mấy giờ rồi bằng cách nhìn đồng hồ)?"
                    },
                    {
                        "en": "(North American English) Can she tell time yet?",
                        "vi": "(Tiếng Anh Bắc Mỹ) Cô ấy có thể cho biết thời gian chưa?"
                    },
                    {
                        "en": "My watch keeps perfect time (= always shows the correct time).",
                        "vi": "Đồng hồ của tôi giữ thời gian hoàn hảo (= luôn hiển thị thời gian chính xác)."
                    },
                    {
                        "en": "Look at the time! We'll be late.",
                        "vi": "Nhìn thời gian! Chúng tôi sẽ đến muộn."
                    },
                    {
                        "en": "This time tomorrow I'll be in Canada.",
                        "vi": "Giờ này, ngày mai tôi sẽ ở Canada."
                    }
                ]
            },
            {
                "define": {
                    "en": "the time measured in a particular part of the world",
                    "vi": "thời gian được đo ở một phần cụ thể của thế giới"
                },
                "examples": [
                    {
                        "en": "6 o’clock local time",
                        "vi": "6 giờ giờ địa phương"
                    },
                    {
                        "en": "We're two hours behind Central European Time.",
                        "vi": "Chúng tôi chậm hơn hai giờ so với Giờ Trung Âu."
                    }
                ]
            },
            {
                "define": {
                    "en": "the time when something happens or when something should happen",
                    "vi": "thời điểm khi điều gì đó xảy ra hoặc khi điều gì đó nên xảy ra"
                },
                "examples": [
                    {
                        "en": "What time do you finish work?",
                        "vi": "Khi nào bạn hoàn thành công việc?"
                    },
                    {
                        "en": "The baby loves bath time.",
                        "vi": "Em bé thích thời gian tắm."
                    },
                    {
                        "en": "A computer screen shows arrival and departure times.",
                        "vi": "Màn hình máy tính hiển thị thời gian đến và đi."
                    },
                    {
                        "en": "time to do something I think it's time to go to bed.",
                        "vi": "đến lúc làm việc gì đó Tôi nghĩ đã đến giờ đi ngủ."
                    },
                    {
                        "en": "This is hardly the time to discuss politics.",
                        "vi": "Đây hầu như không phải là lúc để thảo luận về chính trị."
                    },
                    {
                        "en": "time for something It's time for lunch.",
                        "vi": "thời gian cho một cái gì đó Đã đến giờ ăn trưa."
                    },
                    {
                        "en": "time (that)… It's time the kids were in bed.",
                        "vi": "thời gian (đó)… Đã đến lúc bọn trẻ đã lên giường."
                    },
                    {
                        "en": "It's time that farmers listened to consumers.",
                        "vi": "Đã đến lúc người nông dân lắng nghe người tiêu dùng."
                    },
                    {
                        "en": "by the time (that)… By the time you get there the meeting will be over.",
                        "vi": "đến lúc (đó)… Khi bạn đến đó, cuộc họp sẽ kết thúc."
                    },
                    {
                        "en": "at a… time Have I called at a bad time? Shall I call back later?",
                        "vi": "tại một thời điểm… Tôi đã gọi vào một thời điểm xấu? Tôi có nên gọi lại sau không?"
                    },
                    {
                        "en": "We stock six different beers at any one time.",
                        "vi": "Chúng tôi dự trữ sáu loại bia khác nhau cùng một lúc."
                    },
                    {
                        "en": "at the time I didn't realize it at the time, but that was the best day of my life.",
                        "vi": "tại thời điểm đó tôi đã không nhận ra điều đó vào thời điểm đó, nhưng đó là ngày tuyệt vời nhất trong cuộc đời tôi."
                    },
                    {
                        "en": "The promotion came at just the right time for me.",
                        "vi": "Chương trình khuyến mãi đến vào đúng thời điểm đối với tôi."
                    },
                    {
                        "en": "The new product will launch when the time is right.",
                        "vi": "Sản phẩm mới sẽ ra mắt khi đến thời điểm thích hợp."
                    },
                    {
                        "en": "You'll feel differently about it when the time comes (= when it happens).",
                        "vi": "Bạn sẽ cảm thấy khác về nó khi thời gian đến (= khi nó xảy ra)."
                    },
                    {
                        "en": "around the time of something Several articles were published around the time of his death in 2018.",
                        "vi": "khoảng thời gian xảy ra Một số bài báo đã được xuất bản vào khoảng thời gian ông qua đời vào năm 2018."
                    }
                ]
            },
            {
                "define": {
                    "en": "an amount of time; the amount of time available to work, rest, etc.",
                    "vi": "một khoảng thời gian; khoảng thời gian có sẵn để làm việc, nghỉ ngơi, v.v."
                },
                "examples": [
                    {
                        "en": "I can't go with you—I don't have time.",
                        "vi": "Tôi không thể đi với bạn — tôi không có thời gian."
                    },
                    {
                        "en": "He spends a lot of his time working.",
                        "vi": "Anh ấy dành nhiều thời gian của mình cho công việc."
                    },
                    {
                        "en": "time for something Do you have time for a chat?",
                        "vi": "thời gian cho việc gì đó Bạn có thời gian để trò chuyện không?"
                    },
                    {
                        "en": "time to do something Allow plenty of time to get to the airport.",
                        "vi": "thời gian để làm điều gì đó Dành nhiều thời gian để đến sân bay."
                    },
                    {
                        "en": "I can probably make the time to see them.",
                        "vi": "Tôi có thể dành thời gian để xem chúng."
                    },
                    {
                        "en": "It takes time to make changes in the law.",
                        "vi": "Cần có thời gian để thực hiện các thay đổi trong luật."
                    },
                    {
                        "en": "We have no time to lose (= we must hurry).",
                        "vi": "Chúng ta không có thời gian để mất (= chúng ta phải nhanh lên)."
                    },
                    {
                        "en": "We got to the airport with time to spare.",
                        "vi": "Chúng tôi đến sân bay với thời gian rảnh rỗi."
                    },
                    {
                        "en": "She plans to study overseas for an extended period of time.",
                        "vi": "Cô ấy dự định sẽ đi du học trong một thời gian dài."
                    },
                    {
                        "en": "What do you like to do in your free time?",
                        "vi": "Bạn thích làm gì trong thời gian rảnh?"
                    },
                    {
                        "en": "She doesn’t have much spare time.",
                        "vi": "Cô ấy không có nhiều thời gian rảnh rỗi."
                    },
                    {
                        "en": "Sorry, I can’t spare the time.",
                        "vi": "Xin lỗi, tôi không thể rảnh rỗi."
                    },
                    {
                        "en": "Don't waste any more time!",
                        "vi": "Đừng lãng phí thời gian nữa!"
                    },
                    {
                        "en": "What a waste of time!",
                        "vi": "Thật là lãng phí thời gian!"
                    },
                    {
                        "en": "Time's running out for them to complete the project.",
                        "vi": "Sắp hết thời gian để họ hoàn thành dự án."
                    },
                    {
                        "en": "I didn't finish the test—I ran out of time.",
                        "vi": "Tôi đã không hoàn thành bài kiểm tra — tôi đã hết thời gian."
                    },
                    {
                        "en": "Time's up—have you worked out the answer yet?",
                        "vi": "Đã hết giờ — bạn đã tìm ra câu trả lời chưa?"
                    },
                    {
                        "en": "He never takes any time off (= time spent not working).",
                        "vi": "Anh ấy không bao giờ nghỉ (= thời gian không làm việc)."
                    },
                    {
                        "en": "Jane's worked here for some time (= for a fairly long period of time).",
                        "vi": "Jane đã làm việc ở đây một thời gian (= trong một khoảng thời gian khá dài)."
                    },
                    {
                        "en": "Do it now please—not in three hours' time (= three hours from now).",
                        "vi": "Vui lòng làm ngay bây giờ — không phải sau ba giờ nữa (= ba giờ kể từ bây giờ)."
                    },
                    {
                        "en": "The journey time is two hours.",
                        "vi": "Thời gian hành trình là hai giờ."
                    },
                    {
                        "en": "I don’t want to take up too much of your precious time.",
                        "vi": "Tôi không muốn chiếm quá nhiều thời gian quý báu của bạn."
                    },
                    {
                        "en": "What’s the hurry? We have all the time in the world.",
                        "vi": "Có việc gì vội vậy? Chúng tôi có tất cả thời gian trên thế giới."
                    }
                ]
            },
            {
                "define": {
                    "en": "a period of time, either long or short, during which you do something or something happens",
                    "vi": "một khoảng thời gian, dài hoặc ngắn, trong đó bạn làm điều gì đó hoặc điều gì đó xảy ra"
                },
                "examples": [
                    {
                        "en": "His injuries will take a long time to heal.",
                        "vi": "Vết thương của anh ấy sẽ mất nhiều thời gian để chữa lành."
                    },
                    {
                        "en": "It took them a long time to get home.",
                        "vi": "Họ mất một thời gian dài để về đến nhà."
                    },
                    {
                        "en": "Did you have to wait a long time to see the doctor?",
                        "vi": "Bạn đã phải đợi lâu để gặp bác sĩ?"
                    },
                    {
                        "en": "for a time I lived in Egypt for a time.",
                        "vi": "trong một thời gian tôi đã sống ở Ai Cập trong một thời gian."
                    },
                    {
                        "en": "I was only there for a short time.",
                        "vi": "Tôi chỉ ở đó trong một thời gian ngắn."
                    },
                    {
                        "en": "The early morning is the best time of day.",
                        "vi": "Buổi sáng sớm là thời điểm tốt nhất trong ngày."
                    },
                    {
                        "en": "Her parents died a long time ago.",
                        "vi": "Cha mẹ cô đã mất từ lâu."
                    },
                    {
                        "en": "At one time (= at a period of time in the past) Emily was my best friend.",
                        "vi": "Tại một thời điểm (= vào một khoảng thời gian trong quá khứ) Emily là bạn thân nhất của tôi."
                    },
                    {
                        "en": "Mr Curtis was the manager in my time (= when I was working there).",
                        "vi": "Ông Curtis là người quản lý vào thời của tôi (= khi tôi đang làm việc ở đó)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a period of history connected with particular events or experiences in people’s lives",
                    "vi": "một giai đoạn lịch sử kết nối với các sự kiện hoặc trải nghiệm cụ thể trong cuộc sống của mọi người"
                },
                "examples": [
                    {
                        "en": "at the time of something The movie is set at the time of the Russian Revolution.",
                        "vi": "at the time of something Bộ phim lấy bối cảnh vào thời kỳ Cách mạng Nga."
                    },
                    {
                        "en": "in… time(s) the politician who promised ‘peace in our time’",
                        "vi": "trong… thời gian, chính trị gia đã hứa 'hòa bình trong thời đại của chúng ta'"
                    },
                    {
                        "en": "in ancient times",
                        "vi": "trong thời cổ đại"
                    },
                    {
                        "en": "The Industrial Revolution took place in Victorian times.",
                        "vi": "Cách mạng Công nghiệp diễn ra vào thời Victoria."
                    },
                    {
                        "en": "the violent times we live in (= the present period of history)",
                        "vi": "thời kỳ bạo lực mà chúng ta đang sống (= thời kỳ hiện tại của lịch sử)"
                    },
                    {
                        "en": "in times of something in times of trouble",
                        "vi": "trong thời gian của một cái gì đó trong thời gian khó khăn"
                    },
                    {
                        "en": "The business was successful, even during difficult times.",
                        "vi": "Công việc kinh doanh đã thành công, ngay cả trong thời kỳ khó khăn."
                    },
                    {
                        "en": "Times are hard for the unemployed.",
                        "vi": "Thời buổi khó khăn cho những người thất nghiệp."
                    },
                    {
                        "en": "Times have changed since Grandma was young.",
                        "vi": "Thời thế đã thay đổi kể từ khi Bà còn trẻ."
                    }
                ]
            },
            {
                "define": {
                    "en": "an occasion when you do something or when something happens",
                    "vi": "một dịp khi bạn làm điều gì đó hoặc khi điều gì đó xảy ra"
                },
                "examples": [
                    {
                        "en": "Every time I hear that song I feel happy.",
                        "vi": "Mỗi khi tôi nghe bài hát đó tôi cảm thấy hạnh phúc."
                    },
                    {
                        "en": "It doesn't matter if you don't win every time (= every time you play).",
                        "vi": "Sẽ không có vấn đề gì nếu bạn không thắng mọi lần (= mọi lần bạn chơi)."
                    },
                    {
                        "en": "Next time you're here let's have lunch together.",
                        "vi": "Lần sau khi bạn ở đây, chúng ta hãy ăn trưa cùng nhau."
                    },
                    {
                        "en": "He failed his driving test three times.",
                        "vi": "Anh ấy đã trượt bài kiểm tra lái xe của mình ba lần."
                    },
                    {
                        "en": "He's determined to pass this time.",
                        "vi": "Anh ấy quyết tâm vượt qua thời gian này."
                    },
                    {
                        "en": "When was the last time you saw her?",
                        "vi": "Lần cuối cùng bạn nhìn thấy cô ấy là khi nào?"
                    },
                    {
                        "en": "I see her two or three times a week.",
                        "vi": "Tôi gặp cô ấy hai hoặc ba lần một tuần."
                    },
                    {
                        "en": "How many times (= how often) do I have to tell you not to do that?",
                        "vi": "Tôi phải nói với bạn bao nhiêu lần (= bao lâu một lần)?"
                    },
                    {
                        "en": "(especially North American English) I remember one time (= once) we had to abandon our car in the snow.",
                        "vi": "(đặc biệt là tiếng Anh ở Bắc Mỹ) Tôi nhớ có một lần (= một lần) chúng tôi phải bỏ xe trong tuyết."
                    },
                    {
                        "en": "(formal) At no time did I give my consent to the plan.",
                        "vi": "(chính thức) Không lúc nào tôi đồng ý với kế hoạch."
                    }
                ]
            },
            {
                "define": {
                    "en": "an event or occasion that you experience in a particular way",
                    "vi": "một sự kiện hoặc dịp mà bạn trải nghiệm theo một cách cụ thể"
                },
                "examples": [
                    {
                        "en": "Did you have a good time in Spain?",
                        "vi": "Bạn đã có một thời gian vui vẻ ở Tây Ban Nha?"
                    },
                    {
                        "en": "They're having a hard time dealing with her illness.",
                        "vi": "Họ đang gặp khó khăn trong việc đối phó với căn bệnh của cô ấy."
                    },
                    {
                        "en": "I had an awful time in the hospital.",
                        "vi": "Tôi đã có một khoảng thời gian tồi tệ trong bệnh viện."
                    },
                    {
                        "en": "Mike and I shared some really good times.",
                        "vi": "Mike và tôi đã chia sẻ những khoảng thời gian rất vui vẻ."
                    }
                ]
            },
            {
                "define": {
                    "en": "how long somebody takes to run a race or complete an event",
                    "vi": "Ai đó mất bao lâu để chạy một cuộc đua hoặc hoàn thành một sự kiện"
                },
                "examples": [
                    {
                        "en": "The winner's time was 11.6 seconds.",
                        "vi": "Thời gian của người chiến thắng là 11,6 giây."
                    },
                    {
                        "en": "She completed the 500 metres in record time (= faster than any previous runner).",
                        "vi": "Cô ấy đã hoàn thành 500 mét trong thời gian kỷ lục (= nhanh hơn bất kỳ người chạy nào trước đó)."
                    },
                    {
                        "en": "one of the fastest times ever",
                        "vi": "một trong những thời gian nhanh nhất từ trước đến nay"
                    }
                ]
            },
            {
                "define": {
                    "en": "the number of beats (= units of rhythm) in a bar of music",
                    "vi": "số lượng nhịp (= đơn vị nhịp điệu) trong một ô nhịp nhạc"
                },
                "examples": [
                    {
                        "en": "This piece is in four-four time.",
                        "vi": "Phần này là bốn bốn lần."
                    },
                    {
                        "en": "a slow waltz time",
                        "vi": "thời gian trôi chậm"
                    },
                    {
                        "en": "The conductor beat time with a baton.",
                        "vi": "Nhạc trưởng đánh thời gian bằng dùi cui."
                    }
                ]
            },
            {
                "define": {
                    "en": "the correct speed and rhythm of a piece of music",
                    "vi": "tốc độ và nhịp điệu chính xác của một bản nhạc"
                },
                "examples": [
                    {
                        "en": "in time to something Try and dance in time to the music (= with the same speed and rhythm).",
                        "vi": "đúng lúc đến một thứ gì đó Cố gắng và nhảy đúng lúc theo điệu nhạc (= với cùng tốc độ và nhịp điệu)."
                    },
                    {
                        "en": "Clap your hands to keep time (= sing or move with the correct speed and rhythm).",
                        "vi": "Vỗ tay để giữ thời gian (= hát hoặc di chuyển với tốc độ và nhịp điệu chính xác)."
                    },
                    {
                        "en": "in/out of time to play in/out of time (= follow/not follow the correct speed and rhythm)",
                        "vi": "vào / hết thời gian để phát vào / hết thời gian (= theo / không theo đúng tốc độ và nhịp điệu)"
                    },
                    {
                        "en": "He always plays in perfect time.",
                        "vi": "Anh ấy luôn chơi trong thời gian hoàn hảo."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that something should have happened before now",
                    "vi": "từng nói rằng điều gì đó đáng lẽ phải xảy ra trước đây"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "if you do something against time, you do it as fast as you can because you do not have much time",
                    "vi": "nếu bạn làm điều gì đó chống lại thời gian, bạn làm điều đó nhanh nhất có thể vì bạn không có nhiều thời gian"
                },
                "examples": [
                    {
                        "en": "They're working against time to try and get people out of the rubble alive.",
                        "vi": "Họ đang làm việc với thời gian để cố gắng đưa mọi người ra khỏi đống đổ nát còn sống."
                    }
                ]
            },
            {
                "define": {
                    "en": "earlier/later than was expected",
                    "vi": "sớm hơn / muộn hơn dự kiến"
                },
                "examples": [
                    {
                        "en": "We finished 15 minutes ahead of time.",
                        "vi": "Chúng tôi đã hoàn thành trước thời hạn 15 phút."
                    },
                    {
                        "en": "The plane took off an hour behind time.",
                        "vi": "Máy bay cất cánh chậm hơn một giờ so với thời gian."
                    }
                ]
            },
            {
                "define": {
                    "en": "having advanced or new ideas that other people use or copy later",
                    "vi": "có ý tưởng nâng cao hoặc ý tưởng mới mà người khác sử dụng hoặc sao chép sau này"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "during the whole of a particular period of time",
                    "vi": "trong toàn bộ một khoảng thời gian cụ thể"
                },
                "examples": [
                    {
                        "en": "The letter was in my pocket all the time (= while I was looking for it).",
                        "vi": "Bức thư đã ở trong túi của tôi mọi lúc (= trong khi tôi đang tìm kiếm nó)."
                    }
                ]
            },
            {
                "define": {
                    "en": "very often; repeatedly",
                    "vi": "rất thường xuyên; nhiều lần"
                },
                "examples": [
                    {
                        "en": "She leaves the lights on all the time.",
                        "vi": "Cô ấy để đèn sáng mọi lúc."
                    }
                ]
            },
            {
                "define": {
                    "en": "always",
                    "vi": "luôn"
                },
                "examples": [
                    {
                        "en": "Our representatives are ready to help you at all times.",
                        "vi": "Đại diện của chúng tôi sẵn sàng trợ giúp bạn mọi lúc."
                    },
                    {
                        "en": "Hot water is available at all times.",
                        "vi": "Nước nóng luôn có sẵn."
                    }
                ]
            },
            {
                "define": {
                    "en": "even when the circumstances are very good",
                    "vi": "ngay cả khi hoàn cảnh rất tốt"
                },
                "examples": [
                    {
                        "en": "He's never very happy at the best of times—he'll be much worse now!",
                        "vi": "Anh ấy không bao giờ hạnh phúc vào những thời điểm tốt nhất - bây giờ anh ấy sẽ tồi tệ hơn nhiều!"
                    }
                ]
            },
            {
                "define": {
                    "en": "at one time; together",
                    "vi": "cùng một lúc; cùng với nhau"
                },
                "examples": [
                    {
                        "en": "She was laughing and crying at the same time.",
                        "vi": "Cô ấy vừa cười vừa khóc."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to introduce a fact that is different and must be considered",
                    "vi": "được sử dụng để giới thiệu một sự thật khác biệt và phải được xem xét"
                },
                "examples": [
                    {
                        "en": "You have to be firm, but at the same time you should try and be sympathetic.",
                        "vi": "Bạn phải vững vàng, nhưng đồng thời cũng nên cố gắng và thông cảm."
                    }
                ]
            },
            {
                "define": {
                    "en": "separately or in groups of two, three, etc. on each occasion",
                    "vi": "riêng biệt hoặc theo nhóm hai, ba, v.v. vào mỗi dịp"
                },
                "examples": [
                    {
                        "en": "We had to go and see the principal one at a time.",
                        "vi": "Chúng tôi phải đến gặp hiệu trưởng một lượt."
                    },
                    {
                        "en": "She ran up the stairs two at a time.",
                        "vi": "Cô ấy chạy lên cầu thang cùng một lúc hai người."
                    },
                    {
                        "en": "He surfs the internet for hours at a time.",
                        "vi": "Anh ấy lướt Internet hàng giờ liền."
                    }
                ]
            },
            {
                "define": {
                    "en": "at the age you are (especially when you are not young)",
                    "vi": "ở độ tuổi của bạn (đặc biệt là khi bạn không còn trẻ)"
                },
                "examples": [
                    {
                        "en": "Eyesight doesn't get any better at my time of life.",
                        "vi": "Thị lực của tôi không tốt hơn chút nào vào thời điểm còn sống."
                    }
                ]
            },
            {
                "define": {
                    "en": "sometimes",
                    "vi": "thỉnh thoảng"
                },
                "examples": [
                    {
                        "en": "He can be really bad-tempered at times.",
                        "vi": "Đôi khi anh ấy có thể rất nóng tính."
                    },
                    {
                        "en": "The rain will become heavy at times in the afternoon.",
                        "vi": "Cơn mưa sẽ trở nên nặng hạt vào buổi chiều."
                    },
                    {
                        "en": "He can be rather moody at times.",
                        "vi": "Đôi khi anh ấy có thể khá thất thường."
                    }
                ]
            },
            {
                "define": {
                    "en": "to mark or follow the rhythm of music, by waving a stick, tapping your foot (= hitting it against the floor), etc.",
                    "vi": "để đánh dấu hoặc theo nhịp điệu của âm nhạc, bằng cách vẫy gậy, gõ chân (= đập xuống sàn), v.v."
                },
                "examples": [
                    {
                        "en": "She beat time with her fingers.",
                        "vi": "Cô ấy đánh bại thời gian bằng những ngón tay của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "happening before you were born or can remember or before you lived, worked, etc. somewhere",
                    "vi": "xảy ra trước khi bạn được sinh ra hoặc có thể nhớ hoặc trước khi bạn sống, làm việc, v.v. ở đâu đó"
                },
                "examples": [
                    {
                        "en": "‘Were you taught by Professor Pascal?’ ‘No, he was before my time.’",
                        "vi": "Bạn đã được dạy bởi Giáo sư Pascal? 'Không, anh ấy đến trước thời đại của tôi.'"
                    }
                ]
            },
            {
                "define": {
                    "en": "before the usual time in somebody’s life when something happens",
                    "vi": "trước thời điểm bình thường trong cuộc sống của ai đó khi một điều gì đó xảy ra"
                },
                "examples": [
                    {
                        "en": "She got old before her time.",
                        "vi": "Cô ấy già đi trước thời đại."
                    }
                ]
            },
            {
                "define": {
                    "en": "old-fashioned in your ideas, methods, etc.",
                    "vi": "lỗi thời trong các ý tưởng, phương pháp của bạn, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be able to take advantage of opportunities when they come",
                    "vi": "để có thể tận dụng các cơ hội khi chúng đến"
                },
                "examples": [
                    {
                        "en": "His success was down to being in the right place at the right time.",
                        "vi": "Thành công của anh ấy là do đến đúng nơi, đúng lúc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to still be alive after the time when you were expected to die",
                    "vi": "vẫn còn sống sau thời gian mà bạn được cho là sẽ chết"
                },
                "examples": [
                    {
                        "en": "He’s been living on borrowed time ever since his last heart attack.",
                        "vi": "Anh ấy đã sống dựa vào thời gian vay mượn kể từ cơn đau tim cuối cùng của anh ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be doing something that other people are likely to soon stop you from doing",
                    "vi": "làm điều gì đó mà người khác có khả năng sớm ngăn cản bạn làm"
                },
                "examples": [
                    {
                        "en": "According to the latest opinion polls, the government is living on borrowed time.",
                        "vi": "Theo các cuộc thăm dò dư luận mới nhất, chính phủ đang sống dựa vào thời gian vay mượn."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to encourage somebody who has not been successful at something",
                    "vi": "được sử dụng để khuyến khích ai đó đã không thành công trong một cái gì đó"
                },
                "examples": [
                    {
                        "en": "Never mind— better luck next time.",
                        "vi": "Đừng bận tâm - chúc bạn may mắn lần sau."
                    },
                    {
                        "en": "If you didn't win a prize, better luck next time.",
                        "vi": "Nếu bạn không giành được giải thưởng, chúc bạn may mắn lần sau."
                    }
                ]
            },
            {
                "define": {
                    "en": "to wait for the right time to do something",
                    "vi": "đợi thời điểm thích hợp để làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "He decided to bide his time until he got an opportunity to talk to her alone.",
                        "vi": "Anh quyết định dành thời gian cho đến khi có cơ hội nói chuyện riêng với cô."
                    }
                ]
            },
            {
                "define": {
                    "en": "to do something in order to delay an event, a decision, etc.",
                    "vi": "để làm điều gì đó nhằm trì hoãn một sự kiện, một quyết định, v.v."
                },
                "examples": [
                    {
                        "en": "The negotiators kept the gunman talking to buy time for the hostages.",
                        "vi": "Các nhà đàm phán đã giữ cho tay súng nói chuyện để câu giờ cho các con tin."
                    }
                ]
            },
            {
                "define": {
                    "en": "to say or decide that it is time for something to finish",
                    "vi": "để nói hoặc quyết định rằng đã đến lúc điều gì đó phải kết thúc"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a very difficult or unpleasant job or time",
                    "vi": "một công việc hoặc thời gian rất khó khăn hoặc khó chịu"
                },
                "examples": [
                    {
                        "en": "I've had a devil of a job finding you.",
                        "vi": "Tôi đã có một công việc quỷ dữ tìm thấy bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to spend time in prison",
                    "vi": "ở tù"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "whenever there is a choice",
                    "vi": "bất cứ khi nào có sự lựa chọn"
                },
                "examples": [
                    {
                        "en": "I don't really like cities—give me the countryside every time.",
                        "vi": "Tôi không thực sự thích thành phố — cứ đưa tôi về vùng nông thôn."
                    }
                ]
            },
            {
                "define": {
                    "en": "if you do something for old times’ sake, you do it because it is connected with something good that happened to you in the past",
                    "vi": "nếu bạn làm điều gì đó vì lợi ích của thời xưa, bạn làm điều đó vì nó được kết nối với điều gì đó tốt đẹp đã xảy ra với bạn trong quá khứ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "for a short period of time but not permanently",
                    "vi": "trong một khoảng thời gian ngắn nhưng không phải là vĩnh viễn"
                },
                "examples": [
                    {
                        "en": "You can leave your suitcase here for the time being.",
                        "vi": "Bạn có thể để vali ở đây tạm thời."
                    }
                ]
            },
            {
                "define": {
                    "en": "beginning on that day; from that time",
                    "vi": "bắt đầu từ ngày đó; Từ thời điểm đó"
                },
                "examples": [
                    {
                        "en": "From that time forth she gave me endless friendship and encouragement.",
                        "vi": "Kể từ đó, cô ấy đã dành cho tôi tình bạn và sự động viên vô tận."
                    }
                ]
            },
            {
                "define": {
                    "en": "occasionally but not regularly",
                    "vi": "thỉnh thoảng nhưng không thường xuyên"
                },
                "examples": [
                    {
                        "en": "She has to work at weekends from time to time.",
                        "vi": "Cô ấy thỉnh thoảng phải làm việc vào cuối tuần."
                    }
                ]
            },
            {
                "define": {
                    "en": "to delay something so that you can have more time to make a decision, deal with a problem, etc.",
                    "vi": "trì hoãn việc gì đó để bạn có thêm thời gian đưa ra quyết định, giải quyết vấn đề, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to deliberately make a situation difficult and unpleasant for somebody",
                    "vi": "cố tình tạo ra một tình huống khó khăn và khó chịu cho ai đó"
                },
                "examples": [
                    {
                        "en": "They really gave me a hard time at the interview.",
                        "vi": "Họ thực sự đã gây khó khăn cho tôi trong buổi phỏng vấn."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that you prefer a particular thing or person to the one that has just been mentioned",
                    "vi": "được sử dụng để nói rằng bạn thích một điều hoặc một người cụ thể hơn một điều vừa được đề cập"
                },
                "examples": [
                    {
                        "en": "We don't go out much. Give me a quiet night in front of the TV any day!",
                        "vi": "Chúng tôi không đi chơi nhiều. Cho tôi một đêm yên tĩnh trước TV bất cứ ngày nào!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to have no difficulties or problems",
                    "vi": "không gặp khó khăn hay vấn đề gì"
                },
                "examples": [
                    {
                        "en": "He’s had an easy time of it since he married Lucy.",
                        "vi": "Anh ấy đã có một khoảng thời gian dễ dàng kể từ khi kết hôn với Lucy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to enjoy yourself very much",
                    "vi": "để tận hưởng bản thân rất nhiều"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to like and be interested in somebody/something",
                    "vi": "thích và quan tâm đến ai đó / điều gì đó"
                },
                "examples": [
                    {
                        "en": "I've always had a lot of time for Mary.",
                        "vi": "Tôi luôn dành nhiều thời gian cho Mary."
                    }
                ]
            },
            {
                "define": {
                    "en": "to dislike somebody/something",
                    "vi": "không thích ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "I have no time for lazy people like Steve.",
                        "vi": "Tôi không có thời gian cho những người lười biếng như Steve."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have many problems or difficulties to deal with; to not be successful",
                    "vi": "có nhiều vấn đề hoặc khó khăn để giải quyết; không thành công"
                },
                "examples": [
                    {
                        "en": "He’s had a thin time of it since losing his job.",
                        "vi": "Anh ấy đã có một khoảng thời gian mỏng manh kể từ khi mất việc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to enjoy yourself very much",
                    "vi": "để tận hưởng bản thân rất nhiều"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to have nothing to do or not be busy",
                    "vi": "không có gì để làm hoặc không bận"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to enjoy yourself very much; to have a very good time",
                    "vi": "để tận hưởng bản thân rất nhiều; để có một thời gian rất tốt"
                },
                "examples": [
                    {
                        "en": "The kids had a whale of a time at the theme park.",
                        "vi": "Những đứa trẻ đã có một thời gian chơi cá voi ở công viên giải trí."
                    }
                ]
            },
            {
                "define": {
                    "en": "when enough time has passed",
                    "vi": "khi đủ thời gian trôi qua"
                },
                "examples": [
                    {
                        "en": "It is possible that in the course of time a cure for cancer will be found.",
                        "vi": "Có thể trong một thời gian nữa sẽ tìm ra phương pháp chữa khỏi bệnh ung thư."
                    },
                    {
                        "en": "In the course of time, I began to understand.",
                        "vi": "Theo dòng thời gian, tôi bắt đầu hiểu."
                    }
                ]
            },
            {
                "define": {
                    "en": "when the time is appropriate, usually after a long period",
                    "vi": "khi đến thời điểm thích hợp, thường là sau một thời gian dài"
                },
                "examples": [
                    {
                        "en": "I have no doubt that she’ll tell us in the fullness of time.",
                        "vi": "Tôi không nghi ngờ gì rằng cô ấy sẽ nói với chúng tôi trong thời gian đầy đủ."
                    }
                ]
            },
            {
                "define": {
                    "en": "early; with enough time so that you are not in a hurry",
                    "vi": "sớm; có đủ thời gian để bạn không vội vàng"
                },
                "examples": [
                    {
                        "en": "Get to the airport in good time.",
                        "vi": "Đến sân bay trong thời gian tốt."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that something will be done or will happen at the appropriate time and not before",
                    "vi": "được sử dụng để nói rằng một cái gì đó sẽ được thực hiện hoặc sẽ xảy ra vào thời điểm thích hợp chứ không phải trước"
                },
                "examples": [
                    {
                        "en": "Be patient, Emily! All in good time.",
                        "vi": "Hãy kiên nhẫn, Emily! Tất cả trong thời gian tốt."
                    }
                ]
            },
            {
                "define": {
                    "en": "at the very last moment; just before something bad happens, so that you manage to avoid it, but only just",
                    "vi": "vào thời điểm cuối cùng; ngay trước khi điều gì đó tồi tệ xảy ra, để bạn có thể tránh nó, nhưng chỉ"
                },
                "examples": [
                    {
                        "en": "They escaped from the smoke-filled house just in the nick of time.",
                        "vi": "Họ thoát khỏi ngôi nhà đầy khói chỉ trong gang tấc."
                    }
                ]
            },
            {
                "define": {
                    "en": "so soon or so quickly that it is surprising",
                    "vi": "sớm hay nhanh đến mức đáng ngạc nhiên"
                },
                "examples": [
                    {
                        "en": "The kids will be leaving home in no time.",
                        "vi": "Những đứa trẻ sẽ rời khỏi nhà trong thời gian ngắn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a long time ago in the past",
                    "vi": "cách đây rất lâu trong quá khứ"
                },
                "examples": [
                    {
                        "en": "In olden times people would gather in town squares to gossip and exchange stories.",
                        "vi": "Vào thời xa xưa, mọi người thường tụ tập ở quảng trường thị trấn để tán gẫu và trao đổi những câu chuyện."
                    }
                ]
            },
            {
                "define": {
                    "en": "how and when you want to, even though this might annoy other people",
                    "vi": "làm thế nào và khi nào bạn muốn, mặc dù điều này có thể làm phiền người khác"
                },
                "examples": [
                    {
                        "en": "He always does the work, but in his own sweet time.",
                        "vi": "Anh ấy luôn luôn làm công việc, nhưng trong thời gian ngọt ngào của riêng mình."
                    },
                    {
                        "en": "She just ignores all the criticism and continues on her own sweet way.",
                        "vi": "Cô ấy bỏ qua tất cả những lời chỉ trích và tiếp tục con đường ngọt ngào của riêng mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "when you are ready and not sooner",
                    "vi": "khi bạn đã sẵn sàng và không sớm hơn"
                },
                "examples": [
                    {
                        "en": "Don't hassle him! He'll do it in his own good time.",
                        "vi": "Đừng làm phiền anh ấy! Anh ấy sẽ làm điều đó trong thời gian tốt của riêng mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "in your free time and not when you usually work or study",
                    "vi": "trong thời gian rảnh rỗi của bạn và không phải khi bạn thường làm việc hoặc học tập"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "after a period of time when a situation has changed",
                    "vi": "sau một khoảng thời gian khi tình hình đã thay đổi"
                },
                "examples": [
                    {
                        "en": "They learned to accept their stepmother in time.",
                        "vi": "Họ học cách chấp nhận mẹ kế của mình đúng lúc."
                    },
                    {
                        "en": "You'll get used to the work in time.",
                        "vi": "Bạn sẽ quen với công việc trong thời gian."
                    }
                ]
            },
            {
                "define": {
                    "en": "not late; with enough time to be able to do something",
                    "vi": "khong tre; có đủ thời gian để có thể làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "Will we be in time for the six o'clock train?",
                        "vi": "Chúng ta sẽ đến kịp chuyến tàu sáu giờ chứ?"
                    },
                    {
                        "en": "The ambulance got there just in time (= to save somebody's life).",
                        "vi": "Xe cấp cứu đến đó đúng lúc (= để cứu sống ai đó)."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that you think somebody should do something soon",
                    "vi": "từng nói rằng bạn nghĩ ai đó nên làm điều gì đó sớm"
                },
                "examples": [
                    {
                        "en": "It's about time you cleaned your room!",
                        "vi": "Đã đến lúc bạn dọn dẹp phòng của mình!"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that something will definitely happen, although you are not sure when",
                    "vi": "được sử dụng để nói rằng điều gì đó chắc chắn sẽ xảy ra, mặc dù bạn không chắc khi nào"
                },
                "examples": [
                    {
                        "en": "It's only a matter of time before they bring out their own version of the software.",
                        "vi": "Chỉ còn là vấn đề thời gian trước khi họ đưa ra phiên bản phần mềm của riêng mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to change and develop your ideas, way of working, etc. so that you do what is modern and what is expected",
                    "vi": "để thay đổi và phát triển ý tưởng, cách làm việc, v.v. của bạn để bạn làm những gì hiện đại và những gì được mong đợi"
                },
                "examples": [
                    {
                        "en": "Many complained that the Royal Family had failed to move with the times.",
                        "vi": "Nhiều người phàn nàn rằng Hoàng gia đã thất bại trong việc di chuyển theo thời đại."
                    }
                ]
            },
            {
                "define": {
                    "en": "to spend time doing something that is not important while you are waiting for something else to happen",
                    "vi": "dành thời gian làm điều gì đó không quan trọng trong khi bạn đang chờ đợi điều gì khác xảy ra"
                },
                "examples": [
                    {
                        "en": "We killed time playing cards.",
                        "vi": "Chúng tôi đã giết thời gian chơi bài."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say hello to somebody you have not seen for a long time",
                    "vi": "đã từng chào ai đó mà bạn đã lâu không gặp"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to complete a journey quickly",
                    "vi": "để hoàn thành một cuộc hành trình một cách nhanh chóng"
                },
                "examples": [
                    {
                        "en": "We made excellent time and arrived in Spain in two days.",
                        "vi": "Chúng tôi đã có thời gian tuyệt vời và đến Tây Ban Nha sau hai ngày."
                    }
                ]
            },
            {
                "define": {
                    "en": "to do something quickly or very often because you wish you had started doing it sooner",
                    "vi": "làm điều gì đó nhanh chóng hoặc rất thường xuyên bởi vì bạn ước mình bắt đầu làm điều đó sớm hơn"
                },
                "examples": [
                    {
                        "en": "I’ll have to work hard now to make up for lost time.",
                        "vi": "Bây giờ tôi sẽ phải làm việc chăm chỉ để bù lại thời gian đã mất."
                    }
                ]
            },
            {
                "define": {
                    "en": "many times; frequently",
                    "vi": "nhiều lần; thường xuyên"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to pass the time while you wait for something more interesting",
                    "vi": "để trôi qua thời gian trong khi bạn chờ đợi điều gì đó thú vị hơn"
                },
                "examples": [
                    {
                        "en": "I'm just marking time in this job—I'm hoping to get into journalism.",
                        "vi": "Tôi chỉ đang đánh dấu thời gian cho công việc này — tôi hy vọng sẽ tham gia vào ngành báo chí."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make marching movements without moving forwards",
                    "vi": "để thực hiện các chuyển động diễu hành mà không cần di chuyển về phía trước"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "on the next, first, etc. occasion that the same thing happens",
                    "vi": "vào dịp tiếp theo, đầu tiên, v.v. mà điều tương tự xảy ra"
                },
                "examples": [
                    {
                        "en": "He repeated none of the errors he'd made first time round.",
                        "vi": "Anh ấy không lặp lại lỗi nào mà anh ấy đã mắc phải trong lần đầu tiên."
                    },
                    {
                        "en": "This time round it was not so easy.",
                        "vi": "Lần này nó không phải là dễ dàng như vậy."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that something is usually true or almost always happens",
                    "vi": "được sử dụng để nói rằng điều gì đó thường đúng hoặc hầu như luôn xảy ra"
                },
                "examples": [
                    {
                        "en": "Nine times out of ten she gives the right answer.",
                        "vi": "Chín lần trong số mười cô ấy đưa ra câu trả lời đúng."
                    }
                ]
            },
            {
                "define": {
                    "en": "almost always",
                    "vi": "gần như luôn luôn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to say that something should have happened before now",
                    "vi": "từng nói rằng điều gì đó đáng lẽ phải xảy ra trước đây"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to refuse to speak to somebody because you do not like or respect them",
                    "vi": "từ chối nói chuyện với ai đó vì bạn không thích hoặc không tôn trọng họ"
                },
                "examples": [
                    {
                        "en": "Since the success of her novel, people shake her hand who once wouldn't have given her the time of day.",
                        "vi": "Kể từ thành công của cuốn tiểu thuyết của cô ấy, mọi người bắt tay cô ấy, những người đã từng không cho cô ấy thời gian trong ngày."
                    }
                ]
            },
            {
                "define": {
                    "en": "now is the best time to do something, not in the future",
                    "vi": "bây giờ là thời điểm tốt nhất để làm điều gì đó, không phải trong tương lai"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "that has ever existed",
                    "vi": "điều đó đã từng tồn tại"
                },
                "examples": [
                    {
                        "en": "Many rated him the best singer of all time.",
                        "vi": "Nhiều người đánh giá anh là ca sĩ xuất sắc nhất mọi thời đại."
                    }
                ]
            },
            {
                "define": {
                    "en": "used, especially at the beginning of stories, to mean ‘a long time ago in the past’",
                    "vi": "được sử dụng, đặc biệt là ở đầu câu chuyện, có nghĩa là 'cách đây rất lâu trong quá khứ'"
                },
                "examples": [
                    {
                        "en": "Once upon a time there was a beautiful princess.",
                        "vi": "Ngày xửa ngày xưa có một nàng công chúa xinh đẹp."
                    }
                ]
            },
            {
                "define": {
                    "en": "at the arranged or correct time; not late",
                    "vi": "vào thời gian đã sắp xếp hoặc chính xác; khong tre"
                },
                "examples": [
                    {
                        "en": "The train arrived right on time.",
                        "vi": "Chuyến tàu đến đúng giờ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to say hello to somebody and have a short conversation with them",
                    "vi": "chào ai đó và trò chuyện ngắn với họ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to find or create reasons why something has to be delayed, often so you have longer to prepare for it",
                    "vi": "để tìm hoặc tạo ra lý do tại sao một cái gì đó phải bị trì hoãn, vì vậy bạn có nhiều thời gian hơn để chuẩn bị cho nó"
                },
                "examples": [
                    {
                        "en": "His legal team, clearly playing for time, sought to have the case heard a month later.",
                        "vi": "Đội ngũ pháp lý của anh ấy, rõ ràng là chơi đúng lúc, đã tìm cách đưa vụ việc ra xét xử một tháng sau đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "a situation in which you have to do something or finish something very fast before it is too late",
                    "vi": "một tình huống mà bạn phải làm một cái gì đó hoặc hoàn thành một cái gì đó rất nhanh trước khi quá muộn"
                },
                "examples": [
                    {
                        "en": "Getting food to the starving refugees is now a race against time.",
                        "vi": "Kiếm thức ăn cho những người tị nạn chết đói giờ đây là một cuộc chạy đua với thời gian."
                    }
                ]
            },
            {
                "define": {
                    "en": "something that you feel shows what things are like now, especially how bad they are",
                    "vi": "điều gì đó mà bạn cảm thấy cho thấy mọi thứ hiện tại như thế nào, đặc biệt là mức độ tồi tệ của chúng"
                },
                "examples": [
                    {
                        "en": "The increasing number of people owning guns is an alarming sign of the times.",
                        "vi": "Việc ngày càng có nhiều người sở hữu súng là một dấu hiệu đáng báo động của thời đại."
                    }
                ]
            },
            {
                "define": {
                    "en": "it is better to deal with something immediately because if you wait it may become worse or more difficult and cause extra work",
                    "vi": "tốt hơn hết là bạn nên giải quyết việc gì đó ngay lập tức vì nếu bạn chờ đợi, nó có thể trở nên tồi tệ hơn hoặc khó khăn hơn và gây ra thêm công việc"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to not think about what will happen in the future",
                    "vi": "không nghĩ về những gì sẽ xảy ra trong tương lai"
                },
                "examples": [
                    {
                        "en": "I don't know if he'll get better. We're just taking it one day at a time.",
                        "vi": "Tôi không biết liệu anh ấy có khỏe hơn không. Chúng tôi chỉ dùng nó một ngày một lần."
                    }
                ]
            },
            {
                "define": {
                    "en": "to use as much time as you need without hurrying",
                    "vi": "để sử dụng nhiều thời gian như bạn cần mà không cần vội vàng"
                },
                "examples": [
                    {
                        "en": "There's no rush—take your time.",
                        "vi": "Không có gì vội vàng - hãy dành thời gian của bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say you think somebody is late or is too slow in doing something",
                    "vi": "từng nói rằng bạn nghĩ ai đó đến muộn hoặc quá chậm trong việc làm việc gì đó"
                },
                "examples": [
                    {
                        "en": "You certainly took your time getting here!",
                        "vi": "Bạn chắc chắn đã mất thời gian của bạn để đến đây!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to spend some time away from your usual work or activity in order to rest or do something else instead",
                    "vi": "dành một chút thời gian rời khỏi công việc hoặc hoạt động thường ngày của bạn để nghỉ ngơi hoặc làm việc khác thay vào đó"
                },
                "examples": [
                    {
                        "en": "She is taking time out from her music career for a year.",
                        "vi": "Cô ấy đang dành thời gian cho sự nghiệp âm nhạc của mình trong một năm."
                    }
                ]
            },
            {
                "define": {
                    "en": "the fact that something has not happened before does not mean that it will never happen",
                    "vi": "thực tế là điều gì đó chưa xảy ra trước đây không có nghĩa là nó sẽ không bao giờ xảy ra"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used when you have failed to do something twice and hope that you will succeed the third time",
                    "vi": "được sử dụng khi bạn đã thất bại trong việc làm điều gì đó hai lần và hy vọng rằng bạn sẽ thành công lần thứ ba"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "often; on many or all occasions",
                    "vi": "thường; trong nhiều hoặc tất cả các dịp"
                },
                "examples": [
                    {
                        "en": "You will get a perfect result time after time if you follow these instructions.",
                        "vi": "Bạn sẽ nhận được một kết quả hoàn hảo theo thời gian nếu bạn làm theo các hướng dẫn này."
                    },
                    {
                        "en": "Time and again, the girls have shown how strong and determined they can be.",
                        "vi": "Hết lần này đến lần khác, các cô gái đã chứng tỏ rằng họ có thể mạnh mẽ và quyết tâm như thế nào."
                    }
                ]
            },
            {
                "define": {
                    "en": "one and a half times the usual rate of pay",
                    "vi": "gấp rưỡi mức lương thông thường"
                },
                "examples": [
                    {
                        "en": "We get time and a half on Sundays.",
                        "vi": "Chúng tôi có thời gian rưỡi vào Chủ nhật."
                    }
                ]
            },
            {
                "define": {
                    "en": "time seems to pass very quickly",
                    "vi": "thời gian dường như trôi qua rất nhanh"
                },
                "examples": [
                    {
                        "en": "How time flies! I've got to go now.",
                        "vi": "Thời gian trôi qua làm sao! Tôi phải đi bây giờ."
                    },
                    {
                        "en": "Time has flown since the holiday began.",
                        "vi": "Thời gian đã trôi đi kể từ khi kỳ nghỉ bắt đầu."
                    }
                ]
            },
            {
                "define": {
                    "en": "time is valuable, and should not be wasted",
                    "vi": "thời gian là quý giá và không nên lãng phí"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to say that somebody can wait for something to happen or can wait before doing something",
                    "vi": "được sử dụng để nói rằng ai đó có thể đợi điều gì đó xảy ra hoặc có thể đợi trước khi làm điều gì đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to say that something used to happen in the past",
                    "vi": "được sử dụng để nói rằng một cái gì đó đã từng xảy ra trong quá khứ"
                },
                "examples": [
                    {
                        "en": "Time was when you could go for a walk in the country and not see another person for miles.",
                        "vi": "Đó là lúc bạn có thể đi dạo trong nước và không nhìn thấy một người nào khác trong hàng dặm."
                    },
                    {
                        "en": "Time was when we never needed to lock our house at night.",
                        "vi": "Đó là lúc chúng ta không bao giờ cần khóa nhà vào ban đêm."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that you will have to wait for some time to find out the result of a situation",
                    "vi": "thường nói rằng bạn sẽ phải đợi một thời gian để tìm ra kết quả của một tình huống"
                },
                "examples": [
                    {
                        "en": "Only time will tell if the treatment has been successful.",
                        "vi": "Chỉ có thời gian mới biết liệu việc điều trị có thành công hay không."
                    }
                ]
            },
            {
                "define": {
                    "en": "during the whole of a particular period of time",
                    "vi": "trong toàn bộ một khoảng thời gian cụ thể"
                },
                "examples": [
                    {
                        "en": "My keys were in my pocket the whole time (= while I was looking for them).",
                        "vi": "Chìa khóa của tôi đã ở trong túi của tôi suốt thời gian qua (= trong khi tôi đang tìm kiếm chúng)."
                    }
                ]
            },
            {
                "define": {
                    "en": "very often; repeatedly",
                    "vi": "rất thường xuyên; nhiều lần"
                },
                "examples": [
                    {
                        "en": "He drums his fingers on the table the whole time—it's very annoying.",
                        "vi": "Anh ấy đánh trống những ngón tay của mình trên bàn suốt - điều đó rất khó chịu."
                    }
                ]
            }
        ]
    },
    {
        "id": "e016c522cbf346c8a40298a4bfdc357e",
        "word": "have no use for somebody",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/juːs/",
            "us": "/juːs/"
        },
        "nearby": [
            {
                "word": "USDAW",
                "pos": ""
            },
            {
                "word": "use",
                "pos": "verb"
            },
            {
                "word": "use",
                "pos": "noun"
            },
            {
                "word": "used1",
                "pos": "adjective"
            },
            {
                "word": "used2",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act of using something; the state of being used",
                    "vi": "hành động sử dụng một cái gì đó; trạng thái được sử dụng"
                },
                "examples": [
                    {
                        "en": "A ban was imposed on the use of chemical weapons.",
                        "vi": "Một lệnh cấm đã được áp dụng đối với việc sử dụng vũ khí hóa học."
                    },
                    {
                        "en": "You can't justify the use of military force.",
                        "vi": "Bạn không thể biện minh cho việc sử dụng vũ lực quân sự."
                    },
                    {
                        "en": "I'm not sure that this is the most valuable use of my time.",
                        "vi": "Tôi không chắc rằng đây là cách sử dụng thời gian có giá trị nhất của tôi."
                    },
                    {
                        "en": "for… use These videos are intended for classroom use.",
                        "vi": "để… sử dụng Những video này nhằm mục đích sử dụng trong lớp học."
                    },
                    {
                        "en": "for use in something The software is designed for use in schools.",
                        "vi": "để sử dụng vào việc gì đó Phần mềm được thiết kế để sử dụng trong trường học."
                    },
                    {
                        "en": "in use The chapel was built in the 12th century and is still in use today.",
                        "vi": "đang sử dụng Nhà nguyện được xây dựng vào thế kỷ 12 và vẫn còn được sử dụng cho đến ngày nay."
                    },
                    {
                        "en": "for the use of somebody (formal) The bar is for the use of members only.",
                        "vi": "để sử dụng ai đó (trang trọng) Thanh chỉ dành cho các thành viên sử dụng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a purpose for which something is used; a way in which something is or can be used",
                    "vi": "một mục đích mà một cái gì đó được sử dụng; một cách mà một cái gì đó được hoặc có thể được sử dụng"
                },
                "examples": [
                    {
                        "en": "The plant has various medical uses.",
                        "vi": "Cây có nhiều công dụng y tế."
                    },
                    {
                        "en": "This chemical has a wide range of industrial uses.",
                        "vi": "Hóa chất này được sử dụng rộng rãi trong công nghiệp."
                    },
                    {
                        "en": "use for something Can you find a use for this old table?",
                        "vi": "sử dụng cho cái gì Bạn có thể tìm thấy một cách sử dụng cho cái bàn cũ này?"
                    },
                    {
                        "en": "I'm sure you'll think of a use for it.",
                        "vi": "Tôi chắc rằng bạn sẽ nghĩ ra cách sử dụng nó."
                    },
                    {
                        "en": "What use is a mouse without a computer?",
                        "vi": "Chuột không có máy tính có ích gì?"
                    }
                ]
            },
            {
                "define": {
                    "en": "the right or opportunity to use something, for example something that belongs to somebody else",
                    "vi": "quyền hoặc cơ hội để sử dụng thứ gì đó, ví dụ như thứ gì đó thuộc về người khác"
                },
                "examples": [
                    {
                        "en": "I have the use of the car this week.",
                        "vi": "Tôi có việc sử dụng chiếc xe trong tuần này."
                    }
                ]
            },
            {
                "define": {
                    "en": "the ability to use your mind or body",
                    "vi": "khả năng sử dụng trí óc hoặc cơ thể của bạn"
                },
                "examples": [
                    {
                        "en": "He lost the use of his legs (= became unable to walk) in an accident.",
                        "vi": "Anh ấy mất khả năng sử dụng chân (= không thể đi lại) trong một vụ tai nạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a particular word or phrase, used with a particular meaning",
                    "vi": "một từ hoặc cụm từ cụ thể, được sử dụng với một ý nghĩa cụ thể"
                },
                "examples": [
                    {
                        "en": "The phrase ‘all told’ comes from an old use of the verb ‘tell’, meaning ‘to count’.",
                        "vi": "Cụm từ 'all said' xuất phát từ cách sử dụng cũ của động từ 'tell', có nghĩa là 'đếm'."
                    }
                ]
            },
            {
                "define": {
                    "en": "to not be useful or helpful",
                    "vi": "không hữu ích hoặc hữu ích"
                },
                "examples": [
                    {
                        "en": "You can throw those away—they're no use to anyone.",
                        "vi": "Bạn có thể vứt chúng đi — chúng chẳng có ích gì đối với bất kỳ ai."
                    },
                    {
                        "en": "It's of no practical use to me.",
                        "vi": "Nó không có ích gì đối với tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be useful",
                    "vi": "trở nên hữu ích"
                },
                "examples": [
                    {
                        "en": "Can I be of any use (= can I help)?",
                        "vi": "Tôi có thể sử dụng được gì không (= tôi có thể giúp gì)?"
                    },
                    {
                        "en": "Could this old coat be of use to you?",
                        "vi": "Chiếc áo khoác cũ này có thể sử dụng được cho bạn không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to start/stop being used",
                    "vi": "để bắt đầu / ngừng được sử dụng"
                },
                "examples": [
                    {
                        "en": "When did this word come into common use?",
                        "vi": "Từ này được sử dụng phổ biến khi nào?"
                    },
                    {
                        "en": "These pesticides are gradually going out of use.",
                        "vi": "Các loại thuốc trừ sâu này đang dần hết tác dụng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to dislike somebody",
                    "vi": "không thích ai đó"
                },
                "examples": [
                    {
                        "en": "I've no use for people who don't make an effort.",
                        "vi": "Tôi không có ích gì cho những người không nỗ lực."
                    }
                ]
            },
            {
                "define": {
                    "en": "to not need something",
                    "vi": "không cần một cái gì đó"
                },
                "examples": [
                    {
                        "en": "Living underground and having little use for eyes, moles are virtually blind.",
                        "vi": "Sống dưới lòng đất và ít sử dụng cho mắt, nốt ruồi hầu như bị mù."
                    },
                    {
                        "en": "I have no use for my golf clubs any more.",
                        "vi": "Tôi không còn sử dụng gậy đánh gôn của mình nữa."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be useful sometimes",
                    "vi": "đôi khi hữu ích"
                },
                "examples": [
                    {
                        "en": "I know you don't like him, but he has his uses.",
                        "vi": "Tôi biết bạn không thích anh ta, nhưng anh ta có lợi ích của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that there is no point in doing something because it will not be successful or have a good result",
                    "vi": "thường nói rằng không có ích gì khi làm một việc gì đó vì nó sẽ không thành công hoặc không có kết quả tốt"
                },
                "examples": [
                    {
                        "en": "What's the use of worrying about it?",
                        "vi": "Lo lắng về nó có ích gì?"
                    },
                    {
                        "en": "It's no use—I can't persuade her.",
                        "vi": "Nó không có ích gì — tôi không thể thuyết phục cô ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to use something/somebody, especially in order to get an advantage",
                    "vi": "để sử dụng một cái gì đó / ai đó, đặc biệt là để có được lợi thế"
                },
                "examples": [
                    {
                        "en": "We could make better use of our resources.",
                        "vi": "Chúng tôi có thể sử dụng tốt hơn các nguồn lực của mình."
                    },
                    {
                        "en": "to make effective use of technology",
                        "vi": "để sử dụng hiệu quả công nghệ"
                    },
                    {
                        "en": "You should make use of your contacts.",
                        "vi": "Bạn nên tận dụng danh bạ của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be able to use something for a purpose, and get an advantage from doing so",
                    "vi": "để có thể sử dụng một cái gì đó cho một mục đích và có được lợi thế khi làm như vậy"
                },
                "examples": [
                    {
                        "en": "She'll be able to put her languages to good use in her new job.",
                        "vi": "Cô ấy sẽ có thể sử dụng tốt ngôn ngữ của mình trong công việc mới."
                    },
                    {
                        "en": "Don't throw that box away—I'm sure I could put it to some use.",
                        "vi": "Đừng vứt chiếc hộp đó đi — tôi chắc rằng tôi có thể sử dụng nó."
                    }
                ]
            }
        ]
    },
    {
        "id": "cde8c1bb17c04948974f03251ceeada1",
        "word": "misogynist",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/mɪˈsɒdʒɪnɪst/",
            "us": "/mɪˈsɑːdʒɪnɪst/"
        },
        "nearby": [
            {
                "word": "misnomer",
                "pos": "noun"
            },
            {
                "word": "miso",
                "pos": "noun"
            },
            {
                "word": "misogynist",
                "pos": "noun"
            },
            {
                "word": "misogynistic",
                "pos": "adjective"
            },
            {
                "word": "misogyny",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who hates or dislikes women or believes they are not as good as men",
                    "vi": "một người ghét hoặc không thích phụ nữ hoặc tin rằng họ không tốt như nam giới"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "7baeac5b96534d598cb56865f6fbf27b",
        "word": "misogynistic",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/mɪˌsɒdʒɪˈnɪstɪk/",
            "us": "/mɪˌsɑːdʒɪˈnɪstɪk/"
        },
        "nearby": [
            {
                "word": "miso",
                "pos": "noun"
            },
            {
                "word": "misogynist",
                "pos": "noun"
            },
            {
                "word": "misogynistic",
                "pos": "adjective"
            },
            {
                "word": "misogyny",
                "pos": "noun"
            },
            {
                "word": "misplace",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "typical of the behaviour and beliefs of a person who hates or dislikes women or believes they are not as good as men",
                    "vi": "điển hình về hành vi và niềm tin của một người ghét hoặc không thích phụ nữ hoặc tin rằng họ không tốt như nam giới"
                },
                "examples": [
                    {
                        "en": "misogynistic attitudes",
                        "vi": "thái độ sai lầm"
                    }
                ]
            }
        ]
    },
    {
        "id": "0f9d1fa9dc3e446998d6ca3fe6d81a6f",
        "word": "-phobe",
        "pos": "combining form",
        "level": "c2",
        "phonetic": {
            "uk": "/fəʊb/",
            "us": "/fəʊb/"
        },
        "nearby": [
            {
                "word": "phloem",
                "pos": "noun"
            },
            {
                "word": "phlox",
                "pos": "noun"
            },
            {
                "word": "-phobe",
                "pos": "combining form"
            },
            {
                "word": "phobia",
                "pos": "noun"
            },
            {
                "word": "phobic",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who dislikes a particular thing or particular people",
                    "vi": "một người không thích một thứ cụ thể hoặc những người cụ thể"
                },
                "examples": [
                    {
                        "en": "Anglophobe",
                        "vi": "Anglophobe"
                    },
                    {
                        "en": "xenophobe",
                        "vi": "bài ngoại"
                    }
                ]
            }
        ]
    },
    {
        "id": "dc78f7a58a3e4d0aac596f898eea42eb",
        "word": "prejudiced",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpredʒədɪst/",
            "us": "/ˈpredʒədɪst/"
        },
        "nearby": [
            {
                "word": "prejudice",
                "pos": "noun"
            },
            {
                "word": "prejudice",
                "pos": "verb"
            },
            {
                "word": "prejudiced",
                "pos": "adjective"
            },
            {
                "word": "prejudicial",
                "pos": "adjective"
            },
            {
                "word": "prelate",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "having an unreasonable dislike of or preference for somebody/something, especially based on their race, religion, sex, etc.",
                    "vi": "có sự không thích hoặc ưa thích bất hợp lý đối với ai đó / điều gì đó, đặc biệt là dựa trên chủng tộc, tôn giáo, giới tính của họ, v.v."
                },
                "examples": [
                    {
                        "en": "Few people will admit to being racially prejudiced.",
                        "vi": "Sẽ ít người thừa nhận mình bị thành kiến về chủng tộc."
                    },
                    {
                        "en": "prejudiced (against/in favour of somebody/something) They are prejudiced against older applicants.",
                        "vi": "có thành kiến (chống lại / ủng hộ ai đó / cái gì đó) Họ có thành kiến với những người nộp đơn lớn tuổi hơn."
                    },
                    {
                        "en": "(humorous) I think it's an excellent article, but then I'm prejudiced—I wrote it.",
                        "vi": "(hài hước) Tôi nghĩ đó là một bài báo xuất sắc, nhưng sau đó tôi bị định kiến — tôi đã viết nó."
                    }
                ]
            }
        ]
    },
    {
        "id": "e88bb4e61e9f4e57ad3ce77a757b82f2",
        "word": "repugnance",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/rɪˈpʌɡnəns/",
            "us": "/rɪˈpʌɡnəns/"
        },
        "nearby": [
            {
                "word": "repudiation",
                "pos": "noun"
            },
            {
                "word": "repudiatory",
                "pos": "adjective"
            },
            {
                "word": "repugnance",
                "pos": "noun"
            },
            {
                "word": "repugnant",
                "pos": "adjective"
            },
            {
                "word": "repulse",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a very strong feeling of dislike for something",
                    "vi": "một cảm giác rất mạnh mẽ của không thích một cái gì đó"
                },
                "examples": [
                    {
                        "en": "She was trying to overcome her physical repugnance for him.",
                        "vi": "Cô đang cố gắng vượt qua nỗi ám ảnh về thể xác của mình dành cho anh."
                    }
                ]
            }
        ]
    },
    {
        "id": "ee995dd93a6e46f1b1f6853a6ffaf1cc",
        "word": "repulsion",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/rɪˈpʌlʃn/",
            "us": "/rɪˈpʌlʃn/"
        },
        "nearby": [
            {
                "word": "repugnant",
                "pos": "adjective"
            },
            {
                "word": "repulse",
                "pos": "verb"
            },
            {
                "word": "repulsion",
                "pos": "noun"
            },
            {
                "word": "repulsive",
                "pos": "adjective"
            },
            {
                "word": "repulsively",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a feeling of very strong dislike of something that you find extremely unpleasant",
                    "vi": "một cảm giác rất không thích một cái gì đó mà bạn cảm thấy vô cùng khó chịu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the force by which objects tend to push each other away",
                    "vi": "lực mà các vật có xu hướng đẩy nhau ra xa"
                },
                "examples": [
                    {
                        "en": "the forces of attraction and repulsion",
                        "vi": "lực hút và lực đẩy"
                    }
                ]
            }
        ]
    },
    {
        "id": "80acaed4bddd45938806502b674a1479",
        "word": "somebody’s pet hate",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/heɪt/",
            "us": "/heɪt/"
        },
        "nearby": [
            {
                "word": "hatchway",
                "pos": "noun"
            },
            {
                "word": "hate",
                "pos": "verb"
            },
            {
                "word": "hate",
                "pos": "noun"
            },
            {
                "word": "hate crime",
                "pos": "noun"
            },
            {
                "word": "hateful",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a very strong feeling of dislike for somebody",
                    "vi": "một cảm giác không thích ai đó rất mạnh mẽ"
                },
                "examples": [
                    {
                        "en": "She gave him a look of real hate.",
                        "vi": "Cô nhìn anh thật sự rất ghét."
                    },
                    {
                        "en": "a strange relationship built on love and hate",
                        "vi": "một mối quan hệ kỳ lạ được xây dựng trên tình yêu và sự căm ghét"
                    },
                    {
                        "en": "hate for somebody/something She was full of hate for the people who had betrayed her.",
                        "vi": "căm thù ai đó / điều gì đó Cô ấy đầy căm thù những người đã phản bội cô ấy."
                    },
                    {
                        "en": "a hate campaign (= cruel comments made about somebody over a period of time in order to damage their reputation)",
                        "vi": "một chiến dịch căm thù (= những nhận xét tàn nhẫn được đưa ra về ai đó trong một khoảng thời gian nhằm làm tổn hại danh tiếng của họ)"
                    }
                ]
            },
            {
                "define": {
                    "en": "a person or thing that you hate",
                    "vi": "một người hoặc điều mà bạn ghét"
                },
                "examples": [
                    {
                        "en": "Plastic flowers have always been a particular hate of mine.",
                        "vi": "Hoa nhựa luôn là thứ tôi ghét nhất."
                    }
                ]
            },
            {
                "define": {
                    "en": "something that you particularly dislike",
                    "vi": "một cái gì đó mà bạn đặc biệt không thích"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "2559fae39ea2446f8b55ad4d64fedad9",
        "word": "somebody’s pet hate",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/pet/",
            "us": "/pet/"
        },
        "nearby": [
            {
                "word": "pet",
                "pos": "noun"
            },
            {
                "word": "pet",
                "pos": "verb"
            },
            {
                "word": "pet",
                "pos": "adjective"
            },
            {
                "word": "PET",
                "pos": "noun"
            },
            {
                "word": "PETA",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "that you are very interested in",
                    "vi": "mà bạn rất quan tâm"
                },
                "examples": [
                    {
                        "en": "his pet subject/theory/project, etc.",
                        "vi": "chủ đề / lý thuyết / dự án thú cưng của anh ấy, v.v."
                    }
                ]
            },
            {
                "define": {
                    "en": "something that you particularly dislike",
                    "vi": "một cái gì đó mà bạn đặc biệt không thích"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "f5234c2d27cb43d792acdcbc75ee6e3f",
        "word": "somebody’s pet peeve",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/piːv/",
            "us": "/piːv/"
        },
        "nearby": [
            {
                "word": "peer-reviewed",
                "pos": "adjective"
            },
            {
                "word": "peer-to-peer",
                "pos": "adjective"
            },
            {
                "word": "peeve",
                "pos": "noun"
            },
            {
                "word": "peeved",
                "pos": "adjective"
            },
            {
                "word": "peevish",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "something that you particularly dislike",
                    "vi": "một cái gì đó mà bạn đặc biệt không thích"
                },
                "examples": []
            }
        ]
    }
]