[
    {
        "id": "0991069dada24babb35ed30c299eef7f",
        "word": "play",
        "pos": "verb",
        "level": "a1",
        "phonetic": {
            "uk": "/pleɪ/",
            "us": "/pleɪ/"
        },
        "nearby": [
            {
                "word": "plausible",
                "pos": "adjective"
            },
            {
                "word": "plausibly",
                "pos": "adverb"
            },
            {
                "word": "play",
                "pos": "verb"
            },
            {
                "word": "play",
                "pos": "noun"
            },
            {
                "word": "playable",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to do things for pleasure, as children do; to enjoy yourself, rather than work",
                    "vi": "làm những việc vì niềm vui, như những đứa trẻ vẫn làm; để tận hưởng bản thân, thay vì làm việc"
                },
                "examples": [
                    {
                        "en": "You'll have to play inside today.",
                        "vi": "Bạn sẽ phải chơi bên trong hôm nay."
                    },
                    {
                        "en": "There's a time to work and a time to play.",
                        "vi": "Có thời gian để làm việc và thời gian để vui chơi."
                    },
                    {
                        "en": "play with somebody/something A group of kids were playing with a ball in the street.",
                        "vi": "chơi với ai đó / cái gì đó Một nhóm trẻ em đang chơi với một quả bóng trên đường phố."
                    },
                    {
                        "en": "I haven't got anybody to play with!",
                        "vi": "Tôi không có ai để chơi cùng!"
                    },
                    {
                        "en": "play something Let's play a different game.",
                        "vi": "chơi thứ gì đó Hãy chơi một trò chơi khác."
                    }
                ]
            },
            {
                "define": {
                    "en": "to pretend to be or do something for fun",
                    "vi": "giả vờ hoặc làm điều gì đó để giải trí"
                },
                "examples": [
                    {
                        "en": "play something Let's play pirates.",
                        "vi": "chơi gì đó Hãy chơi cướp biển."
                    },
                    {
                        "en": "play at something Let's play at pirates!",
                        "vi": "chơi tại một cái gì đó Hãy chơi với cướp biển!"
                    },
                    {
                        "en": "play at doing something They were playing at being cowboys.",
                        "vi": "chơi khi làm một cái gì đó Họ đã chơi khi trở thành cao bồi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be involved in a game; to compete against somebody in a game",
                    "vi": "được tham gia vào một trò chơi; để cạnh tranh với ai đó trong một trò chơi"
                },
                "examples": [
                    {
                        "en": "play something to play football/cards",
                        "vi": "chơi thứ gì đó để chơi bóng đá / bài"
                    },
                    {
                        "en": "play something with/against somebody I usually play chess with my brother.",
                        "vi": "chơi thứ gì đó với / chống lại ai đó Tôi thường chơi cờ với anh trai mình."
                    },
                    {
                        "en": "play somebody France are playing Wales tomorrow.",
                        "vi": "chơi ai đó Pháp sẽ đấu với xứ Wales vào ngày mai."
                    },
                    {
                        "en": "play somebody at something Have you played her at squash yet?",
                        "vi": "chơi ai đó ở trò chơi nào đó Bạn đã chơi cô ấy ở trò chơi bóng quần chưa?"
                    },
                    {
                        "en": "play for somebody He plays for Cleveland.",
                        "vi": "chơi cho ai đó Anh ấy chơi cho Cleveland."
                    },
                    {
                        "en": "play against somebody France are playing against Wales on Saturday.",
                        "vi": "đấu với ai đó Pháp sẽ đấu với xứ Wales vào thứ Bảy."
                    },
                    {
                        "en": "play with somebody I like football, but I don't have anyone to play with.",
                        "vi": "chơi với ai đó mà tôi thích bóng đá, nhưng tôi không có ai để chơi cùng."
                    },
                    {
                        "en": "+ adv./prep. Evans played very well.",
                        "vi": "Err:509"
                    }
                ]
            },
            {
                "define": {
                    "en": "to take a particular position in a sports team",
                    "vi": "đảm nhận một vị trí cụ thể trong một đội thể thao"
                },
                "examples": [
                    {
                        "en": "+ adv./prep. Who's playing on the wing?",
                        "vi": "Err:509"
                    },
                    {
                        "en": "+ noun I've never played right back before.",
                        "vi": "Err:509"
                    }
                ]
            },
            {
                "define": {
                    "en": "to include somebody in a sports team",
                    "vi": "đưa ai đó vào đội thể thao"
                },
                "examples": [
                    {
                        "en": "I think we should play Matt on the wing.",
                        "vi": "Tôi nghĩ chúng tôi nên chơi Matt ở cánh."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make contact with the ball and hit or kick it in the way mentioned",
                    "vi": "tiếp xúc với bóng và đánh hoặc đá theo cách đã đề cập"
                },
                "examples": [
                    {
                        "en": "She played the ball and ran forward.",
                        "vi": "Cô chơi bóng và chạy về phía trước."
                    },
                    {
                        "en": "He played a backhand volley.",
                        "vi": "Anh ấy đã chơi một cú vô lê trái tay."
                    }
                ]
            },
            {
                "define": {
                    "en": "to move a piece in chess, etc.",
                    "vi": "để di chuyển một quân cờ trong cờ vua, v.v."
                },
                "examples": [
                    {
                        "en": "She played her bishop.",
                        "vi": "Cô ấy đã đóng vai giám mục của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to put a card face upwards on the table, showing its value",
                    "vi": "đặt một quân bài ngửa lên trên bàn, thể hiện giá trị của nó"
                },
                "examples": [
                    {
                        "en": "to play your ace/a trump",
                        "vi": "chơi át chủ bài / một con át chủ bài của bạn"
                    },
                    {
                        "en": "He played out of turn!",
                        "vi": "Anh ấy đã chơi hết lượt!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to perform music on a musical instrument",
                    "vi": "biểu diễn âm nhạc trên một nhạc cụ"
                },
                "examples": [
                    {
                        "en": "play (something) She played Mozart's Piano Concerto No. 20.",
                        "vi": "chơi (cái gì đó) Cô ấy đã chơi bản hòa tấu piano số 20 của Mozart."
                    },
                    {
                        "en": "The music is well played and beautifully recorded.",
                        "vi": "Âm nhạc được chơi tốt và thu âm đẹp."
                    },
                    {
                        "en": "In the distance a band was playing.",
                        "vi": "Ở đằng xa, một ban nhạc đang chơi."
                    },
                    {
                        "en": "play on something He sat in the corner, playing softly on his guitar.",
                        "vi": "chơi trên một cái gì đó Anh ngồi trong góc, chơi nhẹ nhàng trên cây đàn của anh."
                    },
                    {
                        "en": "play something on something He played a tune on his harmonica.",
                        "vi": "chơi một cái gì đó trên một cái gì đó Anh ấy chơi một giai điệu trên chiếc kèn harmonica của mình."
                    },
                    {
                        "en": "play something to somebody Play that new piece to us.",
                        "vi": "chơi một cái gì đó cho ai đó Chơi bài mới đó cho chúng tôi."
                    },
                    {
                        "en": "play somebody something Play us that new piece.",
                        "vi": "chơi ai đó một cái gì đó Chơi cho chúng tôi tác phẩm mới đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have the skill of performing on a musical instrument",
                    "vi": "có kỹ năng biểu diễn trên một nhạc cụ"
                },
                "examples": [
                    {
                        "en": "Do you play a musical instrument?",
                        "vi": "Bạn có chơi nhạc cụ gì không?"
                    },
                    {
                        "en": "to play the piano/violin/flute",
                        "vi": "chơi piano / violin / sáo"
                    },
                    {
                        "en": "I'm learning to play sax.",
                        "vi": "Tôi đang học chơi sax."
                    }
                ]
            },
            {
                "define": {
                    "en": "to use an MP3 player, a CD player, etc. to make it possible to hear a song, an album, a CD, etc.",
                    "vi": "sử dụng máy nghe nhạc MP3, máy nghe nhạc CD, v.v. để có thể nghe một bài hát, album, CD, v.v."
                },
                "examples": [
                    {
                        "en": "I played some music to drown out the noise.",
                        "vi": "Tôi bật một số bản nhạc để át đi tiếng ồn."
                    },
                    {
                        "en": "They're always playing that song on the radio.",
                        "vi": "Họ luôn phát bài hát đó trên radio."
                    }
                ]
            },
            {
                "define": {
                    "en": "(of a song, an album, etc.) to be heard",
                    "vi": "(của một bài hát, một album, v.v.) sẽ được nghe"
                },
                "examples": [
                    {
                        "en": "My favourite song was playing on the radio.",
                        "vi": "Bài hát yêu thích của tôi đã được phát trên radio."
                    }
                ]
            },
            {
                "define": {
                    "en": "to start working; to make a video or DVD start working",
                    "vi": "để bắt đầu làm việc; để làm cho một video hoặc DVD bắt đầu hoạt động"
                },
                "examples": [
                    {
                        "en": "These videos won't play on my computer.",
                        "vi": "Những video này sẽ không phát trên máy tính của tôi."
                    },
                    {
                        "en": "play something Click below to play videos.",
                        "vi": "chơi thứ gì đó Nhấp vào bên dưới để phát video."
                    },
                    {
                        "en": "Nothing happens when I try to play a DVD.",
                        "vi": "Không có gì xảy ra khi tôi cố gắng phát một đĩa DVD."
                    },
                    {
                        "en": "A short video was played to the court showing the inside of the house.",
                        "vi": "Một đoạn video ngắn đã được phát tới tòa án cho thấy bên trong ngôi nhà."
                    }
                ]
            },
            {
                "define": {
                    "en": "to act in a play, film, etc.; to act the role of somebody",
                    "vi": "đóng một vở kịch, một bộ phim, v.v.; đóng vai trò của ai đó"
                },
                "examples": [
                    {
                        "en": "play something to play a role/part",
                        "vi": "chơi một cái gì đó để đóng một vai trò / một phần"
                    },
                    {
                        "en": "The part of Elizabeth was played by Cate Blanchett.",
                        "vi": "Phần Elizabeth do Cate Blanchett thủ vai."
                    },
                    {
                        "en": "He had always wanted to play Othello.",
                        "vi": "Anh ấy luôn muốn chơi Othello."
                    },
                    {
                        "en": "He was chosen to play the role of Judas.",
                        "vi": "Anh được chọn để đóng vai Judas."
                    },
                    {
                        "en": "She usually plays historical characters.",
                        "vi": "Cô thường đóng vai các nhân vật lịch sử."
                    },
                    {
                        "en": "play opposite somebody She played opposite Brad Pitt (= she and Brad Pitt played the two leading roles).",
                        "vi": "chơi đối diện với ai đó Cô ấy đã đóng vai đối diện với Brad Pitt (= cô ấy và Brad Pitt đóng hai vai chính)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to pretend to be something that you are not",
                    "vi": "giả vờ là một cái gì đó mà bạn không phải là"
                },
                "examples": [
                    {
                        "en": "The children were dressed as soldiers, but they were just playing.",
                        "vi": "Bọn trẻ ăn mặc như những người lính, nhưng chúng chỉ đang chơi đùa."
                    },
                    {
                        "en": "+ adj. I decided it was safer to play dead.",
                        "vi": "Err:509"
                    },
                    {
                        "en": "+ noun She enjoys playing the wronged wife.",
                        "vi": "Err:509"
                    }
                ]
            },
            {
                "define": {
                    "en": "to behave as though you are a particular type of person",
                    "vi": "cư xử như thể bạn là một kiểu người cụ thể"
                },
                "examples": [
                    {
                        "en": "This is no time to play the hero.",
                        "vi": "Đây không phải là lúc để đóng vai anh hùng."
                    },
                    {
                        "en": "She always did enjoy playing the victim.",
                        "vi": "Cô ấy luôn thích đóng vai nạn nhân."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be performed",
                    "vi": "phải được thực hiện"
                },
                "examples": [
                    {
                        "en": "A production of ‘Carmen’ was playing to packed houses.",
                        "vi": "Một sản phẩm của 'Carmen' đã được phát cho những ngôi nhà đóng gói."
                    }
                ]
            },
            {
                "define": {
                    "en": "to give a performance in a particular place",
                    "vi": "để trình diễn ở một địa điểm cụ thể"
                },
                "examples": [
                    {
                        "en": "The band are playing 11 cities around the country.",
                        "vi": "Ban nhạc đang chơi ở 11 thành phố trên khắp đất nước."
                    },
                    {
                        "en": "I've played some fantastic venues.",
                        "vi": "Tôi đã chơi một số địa điểm tuyệt vời."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have an effect or influence on something",
                    "vi": "có ảnh hưởng hoặc ảnh hưởng đến một cái gì đó"
                },
                "examples": [
                    {
                        "en": "Social media played an important part in the last election.",
                        "vi": "Mạng xã hội đóng một vai trò quan trọng trong cuộc bầu cử vừa qua."
                    },
                    {
                        "en": "Farming plays a crucial role in maintaining the landscape.",
                        "vi": "Trồng trọt đóng một vai trò quan trọng trong việc duy trì cảnh quan."
                    },
                    {
                        "en": "High environmental temperatures may also play a role.",
                        "vi": "Nhiệt độ môi trường cao cũng có thể đóng một vai trò nào đó."
                    },
                    {
                        "en": "Businesses can play their part by contributing some of their profits.",
                        "vi": "Các doanh nghiệp có thể đóng góp một phần lợi nhuận của mình."
                    },
                    {
                        "en": "All countries have a part to play in protecting the environment.",
                        "vi": "Tất cả các quốc gia đều có vai trò trong việc bảo vệ môi trường."
                    }
                ]
            },
            {
                "define": {
                    "en": "to trick somebody for fun",
                    "vi": "lừa ai đó cho vui"
                },
                "examples": [
                    {
                        "en": "Children ran around the village playing tricks.",
                        "vi": "Trẻ con chạy quanh làng chơi trò lố."
                    },
                    {
                        "en": "I played a trick on him just to see his reaction.",
                        "vi": "Tôi đã chơi một trò lừa với anh ta chỉ để xem phản ứng của anh ta."
                    }
                ]
            },
            {
                "define": {
                    "en": "to deal with a situation in the way mentioned",
                    "vi": "để đối phó với một tình huống theo cách đã đề cập"
                },
                "examples": [
                    {
                        "en": "He played the situation carefully for maximum advantage.",
                        "vi": "Anh ấy đã chơi các tình huống một cách cẩn thận để có lợi thế tối đa."
                    }
                ]
            },
            {
                "define": {
                    "en": "to do something without being serious about it or putting much effort into it",
                    "vi": "để làm điều gì đó mà không nghiêm túc về nó hoặc đặt nhiều nỗ lực vào nó"
                },
                "examples": [
                    {
                        "en": "play at something He was just playing at it before—now he's serious.",
                        "vi": "chơi ở thứ gì đó Anh ấy chỉ chơi ở đó trước đây — giờ anh ấy đang nghiêm túc."
                    },
                    {
                        "en": "play at doing something They were playing at being villains, like in the movies.",
                        "vi": "chơi để làm một cái gì đó Họ đã chơi để trở thành nhân vật phản diện, giống như trong các bộ phim."
                    },
                    {
                        "en": "play something (with something) Officials are playing politics with farm programs.",
                        "vi": "chơi cái gì đó (với cái gì đó) Các quan chức đang chơi trò chính trị với các chương trình nông trại."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be willing to work with other people in a helpful way, especially so that somebody can get what they want",
                    "vi": "sẵn sàng làm việc với những người khác theo cách hữu ích, đặc biệt là để ai đó có thể đạt được những gì họ muốn"
                },
                "examples": [
                    {
                        "en": "He needs another loan, but the bank won't play.",
                        "vi": "Anh ta cần một khoản vay khác, nhưng ngân hàng sẽ không chơi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to move or appear quickly and lightly, often changing direction or shape",
                    "vi": "di chuyển hoặc xuất hiện một cách nhanh chóng và nhẹ nhàng, thường thay đổi hướng hoặc hình dạng"
                },
                "examples": [
                    {
                        "en": "Sunlight played on the surface of the lake.",
                        "vi": "Ánh nắng vờn trên mặt hồ."
                    },
                    {
                        "en": "A small smile played on her lips.",
                        "vi": "Một nụ cười nhỏ nở trên môi cô."
                    }
                ]
            },
            {
                "define": {
                    "en": "when a fountain plays, it produces a steady stream of water",
                    "vi": "khi một đài phun nước phát, nó tạo ra một dòng nước ổn định"
                },
                "examples": [
                    {
                        "en": "Two huge fountains were playing outside the entrance.",
                        "vi": "Hai đài phun nước khổng lồ đang phát bên ngoài lối vào."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have plenty of money, time, etc. for doing something",
                    "vi": "có nhiều tiền, thời gian, v.v. để làm một việc gì đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to masturbate",
                    "vi": "thủ dâm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to ask in an angry way about what somebody is doing",
                    "vi": "từng hỏi một cách giận dữ về những gì ai đó đang làm"
                },
                "examples": [
                    {
                        "en": "What do you think you are playing at?",
                        "vi": "Bạn nghĩ bạn đang chơi gì?"
                    }
                ]
            }
        ]
    },
    {
        "id": "51fe9c50652a4039a91c8afdb8bef7be",
        "word": "practice",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/ˈpræktɪs/",
            "us": "/ˈpræktɪs/"
        },
        "nearby": [
            {
                "word": "practically",
                "pos": "adverb"
            },
            {
                "word": "practical nurse",
                "pos": "noun"
            },
            {
                "word": "practice",
                "pos": "noun"
            },
            {
                "word": "practice",
                "pos": "verb"
            },
            {
                "word": "practise",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "doing an activity or training regularly so that you can improve your skill; the time you spend doing this",
                    "vi": "thực hiện một hoạt động hoặc đào tạo thường xuyên để bạn có thể cải thiện kỹ năng của mình; thời gian bạn dành để làm việc này"
                },
                "examples": [
                    {
                        "en": "conversation practice",
                        "vi": "luyện tập giao tiếp"
                    },
                    {
                        "en": "It takes a lot of practice to play the violin well.",
                        "vi": "Cần phải luyện tập rất nhiều để chơi tốt đàn Violin."
                    },
                    {
                        "en": "There's a basketball practice every Friday evening.",
                        "vi": "Có một buổi tập bóng rổ vào tối thứ Sáu hàng tuần."
                    },
                    {
                        "en": "She does an hour's piano practice every day.",
                        "vi": "Cô ấy tập piano một giờ mỗi ngày."
                    },
                    {
                        "en": "with practice With practice you will become more skilled.",
                        "vi": "với thực hành Với thực hành, bạn sẽ trở nên thành thạo hơn."
                    },
                    {
                        "en": "practice in doing something I've had a lot of practice in saying ‘no’ recently!",
                        "vi": "thực hành làm điều gì đó Tôi đã thực hành rất nhiều trong việc nói 'không' gần đây!"
                    },
                    {
                        "en": "It takes years of practice to get it right.",
                        "vi": "Phải mất nhiều năm thực hành để làm cho nó đúng."
                    },
                    {
                        "en": "We had an extra practice session on Friday.",
                        "vi": "Chúng tôi đã có một buổi luyện tập bổ sung vào thứ Sáu."
                    }
                ]
            },
            {
                "define": {
                    "en": "action rather than ideas",
                    "vi": "hành động hơn là ý tưởng"
                },
                "examples": [
                    {
                        "en": "the theory and practice of teaching",
                        "vi": "lý thuyết và thực hành giảng dạy"
                    },
                    {
                        "en": "She's determined to put her new ideas into practice.",
                        "vi": "Cô ấy quyết tâm đưa những ý tưởng mới của mình vào thực tế."
                    },
                    {
                        "en": "in practice the complications that arise in actual practice",
                        "vi": "trong thực tế, những phức tạp nảy sinh trong thực tế"
                    }
                ]
            },
            {
                "define": {
                    "en": "a way of doing something that is the usual or expected way in a particular organization or situation",
                    "vi": "một cách thực hiện một cái gì đó theo cách thông thường hoặc theo cách mong đợi trong một tổ chức hoặc tình huống cụ thể"
                },
                "examples": [
                    {
                        "en": "Wearing gloves should be standard practice when handling pesticides.",
                        "vi": "Mang găng tay nên là thực hành tiêu chuẩn khi xử lý thuốc trừ sâu."
                    },
                    {
                        "en": "These methods remain current practice.",
                        "vi": "Những phương pháp này vẫn là thông lệ hiện tại."
                    },
                    {
                        "en": "It is a common practice to include recommendations for further action in the report.",
                        "vi": "Thông lệ phổ biến là đưa các khuyến nghị về hành động tiếp theo trong báo cáo."
                    },
                    {
                        "en": "Everyone knows it is good business practice to listen to your customers.",
                        "vi": "Mọi người đều biết lắng nghe khách hàng của bạn là một phương pháp kinh doanh tốt."
                    },
                    {
                        "en": "childcare policy and practice",
                        "vi": "chính sách và thực hành chăm sóc trẻ em"
                    },
                    {
                        "en": "a review of pay and working practices",
                        "vi": "đánh giá về lương và cách thức làm việc"
                    },
                    {
                        "en": "Religious practices differ from group to group.",
                        "vi": "Thực hành tôn giáo khác nhau giữa các nhóm."
                    },
                    {
                        "en": "I am constantly adopting new practices on my farm.",
                        "vi": "Tôi liên tục áp dụng các phương pháp mới trong trang trại của mình."
                    },
                    {
                        "en": "The goverment has changed its accounting practices.",
                        "vi": "Chính phủ đã thay đổi thông lệ kế toán của mình."
                    },
                    {
                        "en": "practice of doing something We will follow the practice of going in alphabetical order.",
                        "vi": "Thực hành làm điều gì đó Chúng ta sẽ theo dõi thực hành đi theo thứ tự bảng chữ cái."
                    },
                    {
                        "en": "The company has ended its practice of pumping raw sewage out to sea.",
                        "vi": "Công ty đã chấm dứt hoạt động bơm nước thải thô ra biển."
                    }
                ]
            },
            {
                "define": {
                    "en": "a thing that is done regularly; a habit or a custom",
                    "vi": "một việc được thực hiện thường xuyên; một thói quen hay một tập quán"
                },
                "examples": [
                    {
                        "en": "practice of doing something the German practice of giving workers a say in how their company is run",
                        "vi": "thực hành làm điều gì đó, thực hành của người Đức là cho người lao động có tiếng nói trong cách điều hành công ty của họ"
                    },
                    {
                        "en": "it is somebody's practice to do something It is his practice to read several books a week.",
                        "vi": "Ai đó thực hành để làm điều gì đó Đó là thực hành của anh ta để đọc vài cuốn sách một tuần."
                    }
                ]
            },
            {
                "define": {
                    "en": "the work or the business of some professional people such as doctors, dentists and lawyers; the place where they work",
                    "vi": "công việc hoặc công việc kinh doanh của một số người chuyên nghiệp như bác sĩ, nha sĩ và luật sư; nơi họ làm việc"
                },
                "examples": [
                    {
                        "en": "the practice of medicine",
                        "vi": "thực hành y học"
                    },
                    {
                        "en": "clinical/medical practice",
                        "vi": "thực hành lâm sàng / y tế"
                    },
                    {
                        "en": "Students should have prior experience of veterinary practice.",
                        "vi": "Sinh viên nên có kinh nghiệm thực hành thú y trước."
                    },
                    {
                        "en": "in practice My solicitor is no longer in practice.",
                        "vi": "trên thực tế Luật sư của tôi không còn làm việc nữa."
                    },
                    {
                        "en": "a successful medical/dental/law practice",
                        "vi": "hành nghề y tế / nha khoa / luật thành công"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be/become less good at doing something than you were because you have not spent time doing it recently",
                    "vi": "trở nên kém giỏi hơn khi làm một việc gì đó so với trước đây bởi vì bạn đã không dành thời gian để làm việc đó gần đây"
                },
                "examples": [
                    {
                        "en": "Don't ask me to speak French! I'm out of practice.",
                        "vi": "Đừng yêu cầu tôi nói tiếng Pháp! Tôi không tập luyện nữa."
                    },
                    {
                        "en": "If you don't play regularly you soon get out of practice.",
                        "vi": "Nếu bạn không chơi thường xuyên, bạn sẽ sớm bỏ tập."
                    }
                ]
            },
            {
                "define": {
                    "en": "in reality",
                    "vi": "thực tế"
                },
                "examples": [
                    {
                        "en": "Prisoners have legal rights, but in practice these rights are not always respected.",
                        "vi": "Tù nhân có các quyền hợp pháp, nhưng trên thực tế không phải lúc nào các quyền này cũng được tôn trọng."
                    },
                    {
                        "en": "The idea sounds fine in theory, but would it work in practice?",
                        "vi": "Về lý thuyết thì ý tưởng này nghe có vẻ ổn, nhưng liệu nó có hoạt động trong thực tế không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "a way of encouraging people by telling them that if you do an activity regularly and try to improve your skill, you will become very good at it",
                    "vi": "một cách khuyến khích mọi người bằng cách nói với họ rằng nếu bạn thực hiện một hoạt động thường xuyên và cố gắng cải thiện kỹ năng của mình, bạn sẽ trở nên rất giỏi trong việc đó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "5dfec4ef3a2a47f183804ab0c9fc773e",
        "word": "practise",
        "pos": "verb",
        "level": "a1",
        "phonetic": {
            "uk": "/ˈpræktɪs/",
            "us": "/ˈpræktɪs/"
        },
        "nearby": [
            {
                "word": "practice",
                "pos": "noun"
            },
            {
                "word": "practice",
                "pos": "verb"
            },
            {
                "word": "practise",
                "pos": "verb"
            },
            {
                "word": "practised",
                "pos": "adjective"
            },
            {
                "word": "practising",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to do an activity or train regularly so that you can improve your skill",
                    "vi": "thực hiện một hoạt động hoặc đào tạo thường xuyên để bạn có thể cải thiện kỹ năng của mình"
                },
                "examples": [
                    {
                        "en": "You need to practise every day.",
                        "vi": "Bạn cần luyện tập mỗi ngày."
                    },
                    {
                        "en": "practise for something She's practising for her piano exam.",
                        "vi": "luyện tập cho điều gì đó Cô ấy đang luyện tập cho kỳ thi piano của mình."
                    },
                    {
                        "en": "practise something I've been practising my serve for weeks.",
                        "vi": "thực hành một cái gì đó mà tôi đã thực hành giao bóng của mình trong nhiều tuần."
                    },
                    {
                        "en": "She diligently practised her violin every day.",
                        "vi": "Cô chăm chỉ luyện tập đàn violin của mình mỗi ngày."
                    },
                    {
                        "en": "practise something on somebody/something He usually wants to practise his English on me.",
                        "vi": "thực hành điều gì đó với ai đó / điều gì đó Anh ấy thường muốn thực hành tiếng Anh của anh ấy với tôi."
                    },
                    {
                        "en": "practise on somebody/something I learned hairdressing by practising on my sister.",
                        "vi": "thực hành trên ai đó / một cái gì đó tôi đã học làm tóc bằng cách thực hành trên em gái của tôi."
                    },
                    {
                        "en": "practise doing something Practise reversing the car into the garage.",
                        "vi": "thực hành làm gì đó Thực hành lùi ô tô vào ga ra."
                    }
                ]
            },
            {
                "define": {
                    "en": "to work as a doctor, lawyer, etc.",
                    "vi": "làm bác sĩ, luật sư, v.v."
                },
                "examples": [
                    {
                        "en": "There are over 50 000 solicitors practising in England and Wales.",
                        "vi": "Có hơn 50 000 luật sư hành nghề ở Anh và xứ Wales."
                    },
                    {
                        "en": "practise as something She practised as a barrister for many years.",
                        "vi": "thực hành như một cái gì đó Cô ấy đã thực hành như một luật sư trong nhiều năm."
                    },
                    {
                        "en": "practise something He was banned from practising medicine.",
                        "vi": "thực hành một cái gì đó Ông đã bị cấm hành nghề y."
                    },
                    {
                        "en": "She practised law for more than a decade.",
                        "vi": "Cô đã hành nghề luật hơn một thập kỷ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to do something regularly as part of your normal behaviour",
                    "vi": "thường xuyên làm điều gì đó như một phần của hành vi bình thường của bạn"
                },
                "examples": [
                    {
                        "en": "to practise self-restraint/safe sex",
                        "vi": "thực hành tự kiềm chế / tình dục an toàn"
                    },
                    {
                        "en": "Do you still practise your religion?",
                        "vi": "Bạn vẫn thực hành tôn giáo của bạn?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to do the things yourself that you tell other people to do",
                    "vi": "tự mình làm những việc mà bạn bảo người khác làm"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "2aa27d61a4fe48da972f1205d13a859a",
        "word": "sing",
        "pos": "verb",
        "level": "a1",
        "phonetic": {
            "uk": "/sɪŋ/",
            "us": "/sɪŋ/"
        },
        "nearby": [
            {
                "word": "sing-song",
                "pos": "adjective"
            },
            {
                "word": "sing",
                "pos": "noun"
            },
            {
                "word": "sing",
                "pos": "verb"
            },
            {
                "word": "sing along",
                "pos": "phrasal verb"
            },
            {
                "word": "singalong",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to make musical sounds with your voice in the form of a song or tune",
                    "vi": "để tạo ra âm thanh âm nhạc bằng giọng nói của bạn dưới dạng một bài hát hoặc giai điệu"
                },
                "examples": [
                    {
                        "en": "I just can't sing in tune!",
                        "vi": "Tôi chỉ không thể hát đúng điệu!"
                    },
                    {
                        "en": "I always wanted to be on stage, singing and dancing.",
                        "vi": "Tôi luôn muốn được lên sân khấu, hát và nhảy."
                    },
                    {
                        "en": "He was dancing around and singing at the top of his voice (= very loudly).",
                        "vi": "Anh ấy đã nhảy xung quanh và hát ở đỉnh giọng của mình (= rất lớn)."
                    },
                    {
                        "en": "The role is traditionally sung by a tenor.",
                        "vi": "Vai trò truyền thống được hát bởi một giọng nam cao."
                    },
                    {
                        "en": "She usually sings in the shower.",
                        "vi": "Cô ấy thường hát trong lúc tắm."
                    },
                    {
                        "en": "I was invited to sing in a choir.",
                        "vi": "Tôi được mời hát trong một dàn hợp xướng."
                    },
                    {
                        "en": "The chorus sang beautifully.",
                        "vi": "Dàn đồng ca hát hay."
                    },
                    {
                        "en": "sing to somebody He was singing softly to the baby.",
                        "vi": "hát cho ai đó Anh ấy đang hát nhẹ nhàng cho em bé nghe."
                    },
                    {
                        "en": "sing something to sing a hymn/an anthem",
                        "vi": "hát một cái gì đó để hát một bài thánh ca / một bài hát"
                    },
                    {
                        "en": "Now I'd like to sing a song by the Beatles.",
                        "vi": "Bây giờ tôi muốn hát một bài hát của The Beatles."
                    },
                    {
                        "en": "sing something to somebody Will you sing a song to us?",
                        "vi": "hát gì đó cho ai đó Bạn sẽ hát một bài hát cho chúng tôi nghe chứ?"
                    },
                    {
                        "en": "We all sang ‘Happy Birthday’ to her.",
                        "vi": "Tất cả chúng tôi đã hát 'Happy Birthday' cho cô ấy nghe."
                    },
                    {
                        "en": "sing somebody something Will you sing us a song?",
                        "vi": "hát ai đó cái gì đó Bạn sẽ hát cho chúng tôi một bài hát?"
                    },
                    {
                        "en": "sing somebody to sleep She sang the baby to sleep (= sang until the baby went to sleep).",
                        "vi": "sing somebody to sleep She sing the baby to sleep (= hát cho đến khi em bé đi ngủ)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make high musical sounds",
                    "vi": "để tạo ra âm thanh âm nhạc cao"
                },
                "examples": [
                    {
                        "en": "The birds were singing outside my window.",
                        "vi": "Những con chim đang hót bên ngoài cửa sổ của tôi."
                    },
                    {
                        "en": "Birds started singing because they thought dawn had broken.",
                        "vi": "Chim bắt đầu hót vì chúng nghĩ rằng bình minh đã ló dạng."
                    },
                    {
                        "en": "Every bird in the field was singing its heart out (= singing loudly, as if it was very happy).",
                        "vi": "Mọi con chim trên đồng đều cất tiếng hót vang dội (= hót to, như thể nó rất vui)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make a high ringing sound like a whistle (= a small metal or plastic tube that you blow to make a loud high sound)",
                    "vi": "để tạo ra âm thanh chuông lớn như tiếng còi (= một ống kim loại hoặc nhựa nhỏ mà bạn thổi để tạo ra âm thanh lớn)"
                },
                "examples": [
                    {
                        "en": "Bullets sang past my ears.",
                        "vi": "Tiếng đạn văng vẳng bên tai tôi."
                    },
                    {
                        "en": "She felt faint and the blood was singing in her head.",
                        "vi": "Cô cảm thấy ngất xỉu và máu đang chảy trong đầu."
                    },
                    {
                        "en": "The kettle was singing away on the stove.",
                        "vi": "Chiếc ấm đang hót trên bếp."
                    }
                ]
            },
            {
                "define": {
                    "en": "used for saying that a situation may still change, for example that a contest, election, etc. is not finished yet, and somebody still has a chance to win it",
                    "vi": "được sử dụng để nói rằng một tình huống vẫn có thể thay đổi, chẳng hạn như một cuộc thi, cuộc bầu cử, v.v. vẫn chưa kết thúc và ai đó vẫn có cơ hội giành chiến thắng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to change your opinion about somebody/something or your attitude towards somebody/something",
                    "vi": "để thay đổi quan điểm của bạn về ai đó / điều gì đó hoặc thái độ của bạn đối với ai đó / điều gì đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to show that you are in agreement with each other by saying the same things in public",
                    "vi": "để thể hiện rằng bạn đồng ý với nhau bằng cách nói những điều giống nhau ở nơi công cộng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to praise somebody very highly",
                    "vi": "để khen ngợi ai đó rất cao"
                },
                "examples": [
                    {
                        "en": "She's always singing his praises.",
                        "vi": "Cô ấy luôn ca ngợi anh ấy."
                    }
                ]
            }
        ]
    },
    {
        "id": "5adb62f684e240e0b6157c32005f6f5a",
        "word": "song",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/sɒŋ/",
            "us": "/sɔːŋ/"
        },
        "nearby": [
            {
                "word": "sonata",
                "pos": "noun"
            },
            {
                "word": "son et lumière",
                "pos": "noun"
            },
            {
                "word": "song",
                "pos": "noun"
            },
            {
                "word": "songbird",
                "pos": "noun"
            },
            {
                "word": "songbook",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a short piece of music with words that you sing",
                    "vi": "một đoạn nhạc ngắn với những từ mà bạn hát"
                },
                "examples": [
                    {
                        "en": "a love/pop/rock song",
                        "vi": "một bài hát tình yêu / pop / rock"
                    },
                    {
                        "en": "We sang a song together.",
                        "vi": "Chúng tôi đã hát một bài hát cùng nhau."
                    },
                    {
                        "en": "the theme song to the hit TV show",
                        "vi": "bài hát chủ đề của chương trình truyền hình ăn khách"
                    },
                    {
                        "en": "a hit/popular/traditional song",
                        "vi": "một bài hát hit / nổi tiếng / truyền thống"
                    },
                    {
                        "en": "to write/record/perform/play a song",
                        "vi": "để viết / ghi âm / biểu diễn / phát một bài hát"
                    },
                    {
                        "en": "to listen to/hear a song",
                        "vi": "để nghe / nghe một bài hát"
                    },
                    {
                        "en": "She taught us the words of a French song.",
                        "vi": "Cô ấy đã dạy chúng tôi lời của một bài hát tiếng Pháp."
                    },
                    {
                        "en": "What's your favourite song from the show?",
                        "vi": "Bài hát yêu thích của bạn trong chương trình là gì?"
                    },
                    {
                        "en": "the best song on the album",
                        "vi": "bài hát hay nhất trong album"
                    },
                    {
                        "en": "songs about love",
                        "vi": "bài hát về tình yêu"
                    },
                    {
                        "en": "a song of praise/love",
                        "vi": "một bài hát ca ngợi / tình yêu"
                    },
                    {
                        "en": "song by somebody a collection of songs by various artists",
                        "vi": "bài hát của ai đó một bộ sưu tập các bài hát của các nghệ sĩ khác nhau"
                    }
                ]
            },
            {
                "define": {
                    "en": "songs in general; music for singing",
                    "vi": "các bài hát nói chung; âm nhạc để hát"
                },
                "examples": [
                    {
                        "en": "The story is told through song and dance.",
                        "vi": "Câu chuyện được kể thông qua bài hát và điệu múa."
                    },
                    {
                        "en": "Suddenly he burst into song (= started to sing).",
                        "vi": "Đột nhiên anh ấy bật lên bài hát (= bắt đầu hát)."
                    },
                    {
                        "en": "I hate it when characters break into song (= start to sing) for no apparent reason.",
                        "vi": "Tôi ghét điều đó khi các nhân vật lao vào bài hát (= bắt đầu hát) mà không có lý do rõ ràng."
                    },
                    {
                        "en": "in song Their voices were raised in song.",
                        "vi": "trong bài hát Giọng hát của họ đã được cất lên trong bài hát."
                    },
                    {
                        "en": "Important historical events were commemorated in song.",
                        "vi": "Các sự kiện lịch sử quan trọng đã được tưởng nhớ trong bài hát."
                    }
                ]
            },
            {
                "define": {
                    "en": "the musical sounds that birds make",
                    "vi": "âm thanh âm nhạc mà chim tạo ra"
                },
                "examples": [
                    {
                        "en": "the song of the blackbird",
                        "vi": "bài hát của chim sơn ca"
                    }
                ]
            },
            {
                "define": {
                    "en": "very cheaply; at a low price",
                    "vi": "rất rẻ; với giá thấp"
                },
                "examples": [
                    {
                        "en": "She bought the painting for a song.",
                        "vi": "Cô ấy mua bức tranh cho một bài hát."
                    },
                    {
                        "en": "The property is going for a song because they need to sell it fast.",
                        "vi": "Tài sản đang đi hót vì cần bán gấp."
                    }
                ]
            },
            {
                "define": {
                    "en": "working or performing well",
                    "vi": "làm việc hoặc hoạt động tốt"
                },
                "examples": [
                    {
                        "en": "The whole team was on song.",
                        "vi": "Toàn đội đã hát."
                    }
                ]
            },
            {
                "define": {
                    "en": "to show that you are in agreement with each other by saying the same things in public",
                    "vi": "để thể hiện rằng bạn đồng ý với nhau bằng cách nói những điều giống nhau ở nơi công cộng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "if you make a song and dance about something, you complain or talk about it too much when this is not necessary",
                    "vi": "nếu bạn tạo ra một bài hát và nhảy về điều gì đó, bạn phàn nàn hoặc nói về nó quá nhiều khi điều này là không cần thiết"
                },
                "examples": [
                    {
                        "en": "She gives generously to charity without making a song and dance about it.",
                        "vi": "Cô ấy hào phóng cho tổ chức từ thiện mà không cần sáng tác một bài hát và khiêu vũ về nó."
                    }
                ]
            },
            {
                "define": {
                    "en": "a long explanation about something, or excuse for something",
                    "vi": "giải thích dài dòng về điều gì đó hoặc bào chữa cho điều gì đó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "ba97e86435654a518902e45f3900375e",
        "word": "write",
        "pos": "verb",
        "level": "a1",
        "phonetic": {
            "uk": "/raɪt/",
            "us": "/raɪt/"
        },
        "nearby": [
            {
                "word": "writ",
                "pos": "noun"
            },
            {
                "word": "writ",
                "pos": "verb"
            },
            {
                "word": "write",
                "pos": "verb"
            },
            {
                "word": "write away",
                "pos": "phrasal verb"
            },
            {
                "word": "write back",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to make letters or numbers on a surface, especially using a pen or a pencil",
                    "vi": "để tạo các chữ cái hoặc số trên bề mặt, đặc biệt là sử dụng bút mực hoặc bút chì"
                },
                "examples": [
                    {
                        "en": "In some countries children don't start learning to read and write until they are six.",
                        "vi": "Ở một số quốc gia, trẻ em không bắt đầu học đọc và viết cho đến khi sáu tuổi."
                    },
                    {
                        "en": "write in something Please write in pen on both sides of the paper.",
                        "vi": "Viết gì đó Hãy viết bằng bút trên cả hai mặt của tờ giấy."
                    },
                    {
                        "en": "write with something I haven't got anything to write with.",
                        "vi": "viết với thứ mà tôi không có gì để viết."
                    },
                    {
                        "en": "write something Write your name at the top of the paper.",
                        "vi": "viết gì đó Viết tên của bạn lên đầu tờ giấy."
                    },
                    {
                        "en": "The teacher wrote the answers on the board.",
                        "vi": "Giáo viên ghi câu trả lời lên bảng."
                    },
                    {
                        "en": "The ‘b’ had been wrongly written as a ‘d’.",
                        "vi": "Chữ 'b' đã bị viết sai thành chữ 'd'."
                    }
                ]
            },
            {
                "define": {
                    "en": "to produce something in written form so that people can read, perform or use it, etc.",
                    "vi": "để tạo ra một thứ gì đó ở dạng văn bản để mọi người có thể đọc, trình diễn hoặc sử dụng nó, v.v."
                },
                "examples": [
                    {
                        "en": "write something to write a novel/song/computer program",
                        "vi": "viết gì đó để viết tiểu thuyết / bài hát / chương trình máy tính"
                    },
                    {
                        "en": "to write an article/essay",
                        "vi": "để viết một bài báo / bài luận"
                    },
                    {
                        "en": "Who was ‘The Grapes of Wrath’ written by?",
                        "vi": "The Grapes of Wrath' được viết bởi ai?"
                    },
                    {
                        "en": "Which opera did Verdi write first?",
                        "vi": "Verdi viết vở opera nào đầu tiên?"
                    },
                    {
                        "en": "He hopes to write a book about his experiences one day.",
                        "vi": "Anh ấy hy vọng một ngày nào đó sẽ viết một cuốn sách về những trải nghiệm của mình."
                    },
                    {
                        "en": "She had to write a report on the project.",
                        "vi": "Cô phải viết báo cáo về dự án."
                    },
                    {
                        "en": "The text is very well written.",
                        "vi": "Văn bản được viết rất tốt."
                    },
                    {
                        "en": "The play was originally written for British television.",
                        "vi": "Vở kịch ban đầu được viết cho truyền hình Anh."
                    },
                    {
                        "en": "write about something I wanted to travel and then write about it.",
                        "vi": "viết về điều gì đó tôi muốn đi du lịch và sau đó viết về nó."
                    },
                    {
                        "en": "write for something He writes for the ‘New Yorker’ (= works as a writer).",
                        "vi": "viết cho một cái gì đó Anh ấy viết cho 'New Yorker' (= làm việc với tư cách là một nhà văn)."
                    },
                    {
                        "en": "No decision has been made at the time of writing.",
                        "vi": "Không có quyết định nào được đưa ra tại thời điểm viết bài."
                    },
                    {
                        "en": "write somebody something She wrote him several poems.",
                        "vi": "viết cho ai đó một cái gì đó Cô ấy đã viết cho anh ấy vài bài thơ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to put information, a message of good wishes, etc. in a letter or an email and send it to somebody",
                    "vi": "để đưa thông tin, thông điệp chúc tốt lành, v.v. vào một bức thư hoặc email và gửi nó cho ai đó"
                },
                "examples": [
                    {
                        "en": "Bye! Don't forget to write.",
                        "vi": "Từ biệt! Đừng quên viết."
                    },
                    {
                        "en": "I'm writing to enquire about language courses.",
                        "vi": "Tôi viết thư để hỏi về các khóa học ngôn ngữ."
                    },
                    {
                        "en": "write to somebody She wrote to him in France.",
                        "vi": "viết thư cho ai đó Cô ấy đã viết thư cho anh ấy ở Pháp."
                    },
                    {
                        "en": "write something to somebody I wrote a letter to the Publicity Department.",
                        "vi": "viết một cái gì đó cho ai đó Tôi đã viết một lá thư cho Cục Xuất bản."
                    },
                    {
                        "en": "write somebody something I wrote the Publicity Department a letter.",
                        "vi": "viết cho ai đó một cái gì đó Tôi đã viết một lá thư cho Bộ Công bố."
                    },
                    {
                        "en": "write that… She wrote that they were all fine.",
                        "vi": "viết rằng… Cô ấy viết rằng tất cả đều ổn."
                    },
                    {
                        "en": "write somebody (North American English) Write me while you're away.",
                        "vi": "viết cho ai đó (tiếng Anh Bắc Mỹ) Viết cho tôi khi bạn đi vắng."
                    },
                    {
                        "en": "write somebody that… (North American English) He wrote me that he would be arriving Monday.",
                        "vi": "viết cho ai đó rằng… (Tiếng Anh Bắc Mỹ) Anh ấy đã viết cho tôi rằng anh ấy sẽ đến vào thứ Hai."
                    },
                    {
                        "en": "write doing something They wrote thanking us for the present.",
                        "vi": "Viết làm điều gì đó Họ đã viết cảm ơn chúng tôi cho hiện tại."
                    }
                ]
            },
            {
                "define": {
                    "en": "to state the information or the words mentioned",
                    "vi": "để nêu thông tin hoặc các từ được đề cập"
                },
                "examples": [
                    {
                        "en": "write that… The author writes that this theory has now been disproved.",
                        "vi": "viết rằng… Tác giả viết rằng lý thuyết này hiện đã bị bác bỏ."
                    },
                    {
                        "en": "write of something Ancient historians wrote of a lost continent beneath the ocean.",
                        "vi": "viết về một cái gì đó Các sử gia cổ đại đã viết về một lục địa bị mất tích bên dưới đại dương."
                    },
                    {
                        "en": "She wrote of her life in Africa.",
                        "vi": "Cô ấy đã viết về cuộc sống của mình ở Châu Phi."
                    },
                    {
                        "en": "+ speech ‘Of all my books,’ wrote Dickens, ‘I like this the best.’",
                        "vi": "Err:509"
                    }
                ]
            },
            {
                "define": {
                    "en": "to put information in the appropriate places on a form",
                    "vi": "để đưa thông tin vào những vị trí thích hợp trên một biểu mẫu"
                },
                "examples": [
                    {
                        "en": "write something (out) to write (out) a cheque",
                        "vi": "viết gì đó (ra) để viết (ra) séc"
                    },
                    {
                        "en": "write somebody something The doctor wrote her a prescription for more antibiotics.",
                        "vi": "viết cho ai đó điều gì đó Bác sĩ đã kê cho cô ấy một đơn thuốc cho nhiều loại thuốc kháng sinh hơn."
                    },
                    {
                        "en": "write somebody out something I'll write you out a receipt.",
                        "vi": "viết cho ai đó một cái gì đó Tôi sẽ viết cho bạn một biên lai."
                    }
                ]
            },
            {
                "define": {
                    "en": "to record data in the memory of a computer",
                    "vi": "để ghi lại dữ liệu trong bộ nhớ của máy tính"
                },
                "examples": [
                    {
                        "en": "An error was reported when he tried to write data to the file for the first time.",
                        "vi": "Đã xảy ra lỗi khi anh ta cố gắng ghi dữ liệu vào tệp lần đầu tiên."
                    }
                ]
            },
            {
                "define": {
                    "en": "to work correctly or in the way mentioned",
                    "vi": "để hoạt động chính xác hoặc theo cách đã đề cập"
                },
                "examples": [
                    {
                        "en": "This pen won't write.",
                        "vi": "Bút này sẽ không viết."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be very obvious to other people from the expression on somebody’s face",
                    "vi": "rất rõ ràng đối với người khác từ biểu hiện trên khuôn mặt của ai đó"
                },
                "examples": [
                    {
                        "en": "Guilt was written all over his face.",
                        "vi": "Cảm giác tội lỗi hiện rõ trên khuôn mặt anh."
                    }
                ]
            },
            {
                "define": {
                    "en": "to show clearly the quality mentioned or the influence of the person mentioned",
                    "vi": "để hiển thị rõ ràng phẩm chất được đề cập hoặc tầm ảnh hưởng của người được đề cập"
                },
                "examples": [
                    {
                        "en": "It was a performance with star quality written all over it.",
                        "vi": "Đó là một màn trình diễn với chất lượng ngôi sao được viết trên đó."
                    },
                    {
                        "en": "This essay has got Mike written all over it.",
                        "vi": "Bài luận này đã được Mike viết tất cả."
                    }
                ]
            },
            {
                "define": {
                    "en": "not especially good; ordinary",
                    "vi": "không đặc biệt tốt; bình thường"
                },
                "examples": [
                    {
                        "en": "The team’s performance was nothing to write home about.",
                        "vi": "Màn trình diễn của đội không có gì đáng để viết về nhà."
                    }
                ]
            },
            {
                "define": {
                    "en": "having no value, especially legally, or because one of the people involved has no intention of doing what they said they would",
                    "vi": "không có giá trị, đặc biệt là về mặt pháp lý, hoặc bởi vì một trong những người liên quan không có ý định làm những gì họ đã nói rằng họ sẽ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used when you are stating that there is nothing more that can be said about something or that something is completely finished",
                    "vi": "được sử dụng khi bạn nói rằng không thể nói gì thêm về điều gì đó hoặc điều gì đó đã hoàn thành"
                },
                "examples": [
                    {
                        "en": "We were doing well but we ran out of money and that’s all she wrote.",
                        "vi": "Chúng tôi đã làm tốt nhưng chúng tôi hết tiền và đó là tất cả những gì cô ấy viết."
                    }
                ]
            }
        ]
    },
    {
        "id": "edd93a1d7d524c3cbcdaeebefbc19d5c",
        "word": "record",
        "pos": "verb",
        "level": "a2",
        "phonetic": {
            "uk": "/rɪˈkɔːd/",
            "us": "/rɪˈkɔːrd/"
        },
        "nearby": [
            {
                "word": "reconvene",
                "pos": "verb"
            },
            {
                "word": "record",
                "pos": "noun"
            },
            {
                "word": "record",
                "pos": "verb"
            },
            {
                "word": "recordable",
                "pos": "adjective"
            },
            {
                "word": "record-breaker",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to keep a permanent account of facts or events by writing them down, filming them, storing them in a computer, etc.",
                    "vi": "để lưu giữ một tài khoản vĩnh viễn về các dữ kiện hoặc sự kiện bằng cách viết chúng ra giấy, quay phim, lưu trữ chúng trong máy tính, v.v."
                },
                "examples": [
                    {
                        "en": "record something Her childhood is recorded in the diaries of those years.",
                        "vi": "ghi lại một cái gì đó Tuổi thơ của cô ấy được ghi lại trong nhật ký của những năm đó."
                    },
                    {
                        "en": "You should record all your expenses during your trip.",
                        "vi": "Bạn nên ghi lại tất cả các khoản chi tiêu trong chuyến đi của mình."
                    },
                    {
                        "en": "record how, what, etc… His job is to record how politicians vote on major issues.",
                        "vi": "ghi lại bằng cách nào, cái gì, v.v.… Công việc của anh ta là ghi lại cách các chính trị gia bỏ phiếu về các vấn đề lớn."
                    },
                    {
                        "en": "record that… She recorded in her diary that they crossed the Equator on 15 June.",
                        "vi": "ghi lại điều đó… Cô ấy đã ghi lại trong nhật ký của mình rằng họ đã vượt qua Xích đạo vào ngày 15 tháng 6."
                    },
                    {
                        "en": "it is recorded that… It is recorded that, by the year 630, four hundred monks were attached to the monastery.",
                        "vi": "nó được ghi lại rằng… Người ta ghi lại rằng, vào năm 630, bốn trăm nhà sư đã gắn bó với tu viện."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make a copy of music, a film, etc. or to convert sound or a performance into a permanent form, so that you can listen to or watch it again",
                    "vi": "để tạo bản sao nhạc, phim, v.v. hoặc chuyển đổi âm thanh hoặc buổi biểu diễn thành dạng vĩnh viễn để bạn có thể nghe hoặc xem lại"
                },
                "examples": [
                    {
                        "en": "record (something) Did you remember to record that programme for me?",
                        "vi": "record (cái gì đó) Bạn có nhớ ghi lại chương trình đó cho tôi không?"
                    },
                    {
                        "en": "a recorded concert",
                        "vi": "một buổi hòa nhạc được ghi lại"
                    },
                    {
                        "en": "Tell me when the machine starts recording.",
                        "vi": "Cho tôi biết khi nào máy bắt đầu ghi."
                    },
                    {
                        "en": "record somebody/something doing something He recorded the class rehearsing before the performance.",
                        "vi": "ghi lại ai đó / cái gì đó đang làm gì đó Anh ấy đã ghi lại cả lớp đang tập dượt trước khi biểu diễn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to perform music so that it can be copied, stored and played back",
                    "vi": "biểu diễn âm nhạc để có thể sao chép, lưu trữ và phát lại"
                },
                "examples": [
                    {
                        "en": "The band is back in the US recording their new album.",
                        "vi": "Ban nhạc đã trở lại Mỹ để thu âm album mới của họ."
                    },
                    {
                        "en": "to record a song",
                        "vi": "để ghi âm một bài hát"
                    },
                    {
                        "en": "They spent the summer touring and recording.",
                        "vi": "Họ đã dành cả mùa hè để lưu diễn và thu âm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make an official or legal statement about something",
                    "vi": "để đưa ra tuyên bố chính thức hoặc hợp pháp về điều gì đó"
                },
                "examples": [
                    {
                        "en": "The coroner recorded a verdict of accidental death.",
                        "vi": "Nhân viên điều tra đã ghi một bản án về cái chết do tai nạn."
                    },
                    {
                        "en": "It is with great regret that we record the death of one of our founder members.",
                        "vi": "Chúng tôi vô cùng tiếc nuối khi ghi lại cái chết của một trong những thành viên sáng lập của chúng tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to show a particular measurement or amount",
                    "vi": "để hiển thị một phép đo hoặc số lượng cụ thể"
                },
                "examples": [
                    {
                        "en": "The thermometer recorded a temperature of 40°C.",
                        "vi": "Nhiệt kế ghi nhiệt độ là 40 ° C."
                    }
                ]
            },
            {
                "define": {
                    "en": "to achieve a particular score or result",
                    "vi": "để đạt được một điểm số hoặc kết quả cụ thể"
                },
                "examples": [
                    {
                        "en": "The team recorded their first win of the season.",
                        "vi": "Đội đã ghi chiến thắng đầu tiên trong mùa giải."
                    },
                    {
                        "en": "to record a victory/high score",
                        "vi": "để ghi một chiến thắng / điểm số cao"
                    }
                ]
            }
        ]
    },
    {
        "id": "69ed0e82cbfc429cb28355a0ad3c3dc1",
        "word": "compose",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/kəmˈpəʊz/",
            "us": "/kəmˈpəʊz/"
        },
        "nearby": [
            {
                "word": "comport",
                "pos": "verb"
            },
            {
                "word": "comportment",
                "pos": "noun"
            },
            {
                "word": "compose",
                "pos": "verb"
            },
            {
                "word": "composed",
                "pos": "adjective"
            },
            {
                "word": "composer",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to write music",
                    "vi": "viết nhạc"
                },
                "examples": [
                    {
                        "en": "Mozart composed his last opera shortly before he died.",
                        "vi": "Mozart đã sáng tác vở opera cuối cùng của mình không lâu trước khi ông qua đời."
                    },
                    {
                        "en": "music specially composed for the occasion",
                        "vi": "âm nhạc được sáng tác đặc biệt cho dịp này"
                    }
                ]
            },
            {
                "define": {
                    "en": "to write a letter, etc. usually with a lot of care and thought",
                    "vi": "để viết một lá thư, v.v. thường là với rất nhiều sự quan tâm và suy nghĩ"
                },
                "examples": [
                    {
                        "en": "She composed a letter of protest.",
                        "vi": "Cô ấy đã soạn một bức thư phản đối."
                    }
                ]
            },
            {
                "define": {
                    "en": "to combine together to form a whole",
                    "vi": "kết hợp với nhau để tạo thành một tổng thể"
                },
                "examples": [
                    {
                        "en": "Ten people compose the committee.",
                        "vi": "Mười người soạn ủy ban."
                    }
                ]
            },
            {
                "define": {
                    "en": "to manage to control your feelings or expression",
                    "vi": "quản lý để kiểm soát cảm xúc hoặc biểu hiện của bạn"
                },
                "examples": [
                    {
                        "en": "compose yourself Emma frowned, making an effort to compose herself.",
                        "vi": "Emma cau mày, cố gắng tự bình tĩnh lại."
                    },
                    {
                        "en": "compose something I was so confused that I could hardly compose my thoughts.",
                        "vi": "sáng tác một cái gì đó tôi đã rất bối rối mà tôi khó có thể soạn ra những suy nghĩ của mình."
                    }
                ]
            }
        ]
    },
    {
        "id": "82bf0537c256487e973688e671062e1b",
        "word": "conduct",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/kənˈdʌkt/",
            "us": "/kənˈdʌkt/"
        },
        "nearby": [
            {
                "word": "condor",
                "pos": "noun"
            },
            {
                "word": "conducive",
                "pos": "adjective"
            },
            {
                "word": "conduct",
                "pos": "verb"
            },
            {
                "word": "conduct",
                "pos": "noun"
            },
            {
                "word": "conductance",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to organize and/or do a particular activity",
                    "vi": "để tổ chức và / hoặc thực hiện một hoạt động cụ thể"
                },
                "examples": [
                    {
                        "en": "to conduct an experiment/inquiry/investigation/interview",
                        "vi": "để thực hiện một thử nghiệm / yêu cầu / điều tra / phỏng vấn"
                    },
                    {
                        "en": "to conduct a survey/poll/study/review",
                        "vi": "để thực hiện một cuộc khảo sát / thăm dò ý kiến / nghiên cứu / đánh giá"
                    },
                    {
                        "en": "to conduct a test/trial",
                        "vi": "để tiến hành một bài kiểm tra / thử nghiệm"
                    },
                    {
                        "en": "to conduct research/business",
                        "vi": "để thực hiện nghiên cứu / kinh doanh"
                    },
                    {
                        "en": "There are concerns about the way in which the firm conducts its acitvities.",
                        "vi": "Có những lo ngại về cách thức mà công ty tiến hành các hoạt động của mình."
                    },
                    {
                        "en": "The battalion had been preparing to conduct operations in the same area.",
                        "vi": "Tiểu đoàn đã chuẩn bị hành quân trong cùng một khu vực."
                    },
                    {
                        "en": "Police conducted a thorough search of the building.",
                        "vi": "Cảnh sát đã tiến hành khám xét toàn bộ tòa nhà."
                    },
                    {
                        "en": "The negotiations have been conducted in a positive manner.",
                        "vi": "Các cuộc đàm phán đã được tiến hành một cách tích cực."
                    },
                    {
                        "en": "They conducted a vigorous campaign for a shorter working week.",
                        "vi": "Họ đã tiến hành một chiến dịch sôi nổi trong một tuần làm việc ngắn hơn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to direct a group of people who are singing or playing music",
                    "vi": "để chỉ đạo một nhóm người đang hát hoặc chơi nhạc"
                },
                "examples": [
                    {
                        "en": "a concert by the London Philharmonic Orchestra, conducted by Marin Alsop",
                        "vi": "một buổi hòa nhạc của Dàn nhạc giao hưởng London, do Marin Alsop chỉ huy"
                    },
                    {
                        "en": "He conducted a programme of Sibelius and Tchaikovsky.",
                        "vi": "Ông đã tiến hành một chương trình của Sibelius và Tchaikovsky."
                    },
                    {
                        "en": "She will conduct works by Brahms and Schumann in tonight's concert.",
                        "vi": "Cô ấy sẽ biểu diễn các tác phẩm của Brahms và Schumann trong buổi hòa nhạc tối nay."
                    },
                    {
                        "en": "She sang Gluck's Orfeo at Covent Garden, with Sir Thomas Beecham conducting.",
                        "vi": "Cô đã hát Gluck's Orfeo tại Covent Garden, với sự chỉ huy của Ngài Thomas Beecham."
                    }
                ]
            },
            {
                "define": {
                    "en": "to lead or guide somebody through or around a place",
                    "vi": "dẫn dắt hoặc hướng dẫn ai đó đi qua hoặc xung quanh một địa điểm"
                },
                "examples": [
                    {
                        "en": "a conducted tour of Athens (= one with a guide, giving information about it)",
                        "vi": "một chuyến tham quan được thực hiện ở Athens (= một chuyến tham quan có hướng dẫn viên, cung cấp thông tin về nó)"
                    },
                    {
                        "en": "The guide conducted us around the ruins of the ancient city.",
                        "vi": "Người hướng dẫn đưa chúng tôi đi quanh những tàn tích của thành phố cổ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to behave in a particular way",
                    "vi": "cư xử theo một cách cụ thể"
                },
                "examples": [
                    {
                        "en": "He conducted himself far better than expected.",
                        "vi": "Anh ấy đã tiến hành bản thân tốt hơn nhiều so với mong đợi."
                    },
                    {
                        "en": "The report challenges them to examine how they conduct themselves in the workplace.",
                        "vi": "Báo cáo thách thức họ kiểm tra cách họ ứng xử tại nơi làm việc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to allow heat or electricity to pass along or through it",
                    "vi": "để cho phép nhiệt hoặc điện truyền qua hoặc đi qua nó"
                },
                "examples": [
                    {
                        "en": "Copper conducts electricity well.",
                        "vi": "Đồng dẫn điện tốt."
                    }
                ]
            }
        ]
    },
    {
        "id": "20e2dde00813484e9925a9ec36d53762",
        "word": "karaoke",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˌkæriˈəʊki/",
            "us": "/ˌkæriˈəʊki/"
        },
        "nearby": [
            {
                "word": "kaput",
                "pos": "adjective"
            },
            {
                "word": "karabiner",
                "pos": "noun"
            },
            {
                "word": "karaoke",
                "pos": "noun"
            },
            {
                "word": "karat",
                "pos": "noun"
            },
            {
                "word": "karate",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a type of entertainment in which a machine plays only the music of popular songs so that people can sing the words themselves",
                    "vi": "một loại hình giải trí trong đó máy chỉ phát nhạc của các bài hát nổi tiếng để mọi người có thể tự hát lời"
                },
                "examples": [
                    {
                        "en": "a karaoke machine/night/bar",
                        "vi": "một máy hát karaoke / đêm / quán bar"
                    }
                ]
            }
        ]
    },
    {
        "id": "8acb74445d644b639822445d4bccd23b",
        "word": "mix",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/mɪks/",
            "us": "/mɪks/"
        },
        "nearby": [
            {
                "word": "mitten",
                "pos": "noun"
            },
            {
                "word": "Mitty",
                "pos": ""
            },
            {
                "word": "mix",
                "pos": "verb"
            },
            {
                "word": "Tom Mix",
                "pos": ""
            },
            {
                "word": "mix",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "if two or more substances or things mix or you mix them, they combine, usually in a way that means they cannot easily be separated",
                    "vi": "nếu hai hoặc nhiều chất hoặc nhiều thứ trộn lẫn với nhau hoặc bạn trộn chúng, chúng kết hợp với nhau, thường theo cách có nghĩa là chúng không thể dễ dàng tách rời"
                },
                "examples": [
                    {
                        "en": "Oil and water do not mix.",
                        "vi": "Dầu và nước không trộn lẫn."
                    },
                    {
                        "en": "mix with something Oil does not mix with water.",
                        "vi": "trộn với một cái gì đó Dầu không trộn với nước."
                    },
                    {
                        "en": "Grief mixed with fear and rage as the people surveyed the ruins of their homes.",
                        "vi": "Đau buồn xen lẫn sợ hãi và phẫn nộ khi mọi người khảo sát đống đổ nát của ngôi nhà của họ."
                    },
                    {
                        "en": "mix A and B (together) Mix all the ingredients together in a bowl.",
                        "vi": "Trộn A và B (với nhau) Trộn tất cả các thành phần với nhau trong một cái bát."
                    },
                    {
                        "en": "If you mix blue and yellow, you get green.",
                        "vi": "Nếu bạn trộn màu xanh lam và màu vàng, bạn sẽ có được màu xanh lá cây."
                    },
                    {
                        "en": "mix A with B I don't like to mix business with pleasure (= combine social events with doing business).",
                        "vi": "kết hợp A với BI không thích kết hợp kinh doanh với niềm vui (= kết hợp các sự kiện xã hội với kinh doanh)."
                    },
                    {
                        "en": "mix A into B Smith often mixed sand into her paint to create a textured surface.",
                        "vi": "trộn A vào B Smith thường trộn cát vào sơn của cô ấy để tạo bề mặt kết cấu."
                    }
                ]
            },
            {
                "define": {
                    "en": "to prepare something by combining two or more different substances",
                    "vi": "để chuẩn bị một cái gì đó bằng cách kết hợp hai hoặc nhiều chất khác nhau"
                },
                "examples": [
                    {
                        "en": "mix something With this range of paints, you can mix your own colours.",
                        "vi": "pha trộn thứ gì đó Với nhiều loại sơn này, bạn có thể pha trộn màu sắc của riêng mình."
                    },
                    {
                        "en": "Be sure to mix the solution properly .",
                        "vi": "Đảm bảo trộn dung dịch đúng cách."
                    },
                    {
                        "en": "mix something for somebody Why don't you mix a cocktail for our guests?",
                        "vi": "pha một thứ gì đó cho ai đó Tại sao bạn không pha một ly cocktail cho khách của chúng tôi?"
                    },
                    {
                        "en": "mix somebody something Why don't you mix our guests a cocktail?",
                        "vi": "pha cho ai đó một thứ gì đó Tại sao bạn không pha cho khách của chúng tôi một ly cocktail?"
                    }
                ]
            },
            {
                "define": {
                    "en": "if two or more things, people or activities do not mix, they are likely to cause problems or danger if they are combined",
                    "vi": "nếu hai hoặc nhiều thứ, con người hoặc hoạt động không kết hợp với nhau, chúng có khả năng gây ra vấn đề hoặc nguy hiểm nếu chúng được kết hợp với nhau"
                },
                "examples": [
                    {
                        "en": "Children and fireworks don't mix.",
                        "vi": "Trẻ em và pháo hoa không trộn lẫn với nhau."
                    },
                    {
                        "en": "These pills won't mix well with alcohol.",
                        "vi": "Những viên thuốc này sẽ không kết hợp tốt với rượu."
                    }
                ]
            },
            {
                "define": {
                    "en": "to meet and talk to different people, especially at social events",
                    "vi": "gặp gỡ và nói chuyện với những người khác nhau, đặc biệt là tại các sự kiện xã hội"
                },
                "examples": [
                    {
                        "en": "We've worked together for years but never mixed socially.",
                        "vi": "Chúng tôi đã làm việc cùng nhau trong nhiều năm nhưng chưa bao giờ lẫn lộn về mặt xã hội."
                    },
                    {
                        "en": "mix with somebody They don't mix much with the neighbours.",
                        "vi": "trộn lẫn với ai đó Họ không trộn lẫn nhiều với những người hàng xóm."
                    },
                    {
                        "en": "She mixed happily with the other children.",
                        "vi": "Cô vui vẻ hòa cùng những đứa trẻ khác."
                    },
                    {
                        "en": "I don't really mix with people my own age.",
                        "vi": "Tôi không thực sự hòa nhập với những người cùng tuổi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to combine different recordings of voices and/or instruments to produce a single piece of music",
                    "vi": "để kết hợp các bản ghi âm giọng nói và / hoặc nhạc cụ khác nhau để tạo ra một bản nhạc"
                },
                "examples": [
                    {
                        "en": "Up to eight tracks can be mixed simultaneously.",
                        "vi": "Có thể trộn tối đa tám bản nhạc cùng một lúc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be/become involved in something, especially something illegal or dishonest",
                    "vi": "tham gia / tham gia vào một cái gì đó, đặc biệt là một cái gì đó bất hợp pháp hoặc không trung thực"
                },
                "examples": [
                    {
                        "en": "Don't tell me you're mixed up in all of this?",
                        "vi": "Đừng nói với tôi rằng bạn đang trộn lẫn trong tất cả những điều này?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be/become friendly with or involved with somebody that other people do not approve of",
                    "vi": "trở nên thân thiện với hoặc gắn bó với ai đó mà người khác không tán thành"
                },
                "examples": [
                    {
                        "en": "He got mixed up with a crowd who were into drugs and crime.",
                        "vi": "Anh ta bị trộn lẫn với một đám đông nghiện ma túy và tội phạm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to combine things in different ways for different purposes",
                    "vi": "để kết hợp mọi thứ theo nhiều cách khác nhau cho các mục đích khác nhau"
                },
                "examples": [
                    {
                        "en": "You can mix and match courses to suit your requirements.",
                        "vi": "Bạn có thể kết hợp và kết hợp các khóa học để phù hợp với yêu cầu của bạn."
                    },
                    {
                        "en": "This mix-and-match approach will appeal to a variety of players.",
                        "vi": "Cách tiếp cận kết hợp và kết hợp này sẽ thu hút nhiều người chơi khác nhau."
                    }
                ]
            },
            {
                "define": {
                    "en": "to argue with somebody or cause trouble",
                    "vi": "tranh luận với ai đó hoặc gây rắc rối"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to do something differently from the way it is usually done",
                    "vi": "để làm điều gì đó khác với cách nó thường được làm"
                },
                "examples": [
                    {
                        "en": "The show has been the same for ten years, so it’s time to mix it up.",
                        "vi": "Chương trình đã giống nhau trong mười năm, vì vậy đã đến lúc kết hợp nó."
                    }
                ]
            }
        ]
    },
    {
        "id": "a14e9071fdfc42caa62304c3f00708d1",
        "word": "the performing arts",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ðə pəˌfɔːmɪŋ ˈɑːts/",
            "us": "/ðə pərˌfɔːrmɪŋ ˈɑːrts/"
        },
        "nearby": [
            {
                "word": "performative",
                "pos": "adjective"
            },
            {
                "word": "performer",
                "pos": "noun"
            },
            {
                "word": "the performing arts",
                "pos": "noun"
            },
            {
                "word": "perfume",
                "pos": "noun"
            },
            {
                "word": "perfume",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "arts such as music, dance and drama which are performed for an audience",
                    "vi": "nghệ thuật như âm nhạc, khiêu vũ và kịch được biểu diễn cho khán giả"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c5469a9feb694340b4387fa69dd4c194",
        "word": "produce",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/prəˈdjuːs/",
            "us": "/prəˈduːs/"
        },
        "nearby": [
            {
                "word": "prodigy",
                "pos": "noun"
            },
            {
                "word": "The Prodigy",
                "pos": ""
            },
            {
                "word": "produce",
                "pos": "verb"
            },
            {
                "word": "produce",
                "pos": "noun"
            },
            {
                "word": "producer",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to make things to be sold, especially in large quantities",
                    "vi": "để làm cho những thứ được bán, đặc biệt là với số lượng lớn"
                },
                "examples": [
                    {
                        "en": "Our company mainly produces goods for export.",
                        "vi": "Công ty chúng tôi chủ yếu sản xuất hàng hóa để xuất khẩu."
                    },
                    {
                        "en": "We pride ourselves on producing high-quality products.",
                        "vi": "Chúng tôi tự hào về việc sản xuất các sản phẩm chất lượng cao."
                    },
                    {
                        "en": "The local factory produces electronic components.",
                        "vi": "Nhà máy địa phương sản xuất các linh kiện điện tử."
                    }
                ]
            },
            {
                "define": {
                    "en": "to grow or make something as part of a natural process; to have a baby or young animal",
                    "vi": "để phát triển hoặc tạo ra thứ gì đó như một phần của quá trình tự nhiên; sinh con hoặc động vật non"
                },
                "examples": [
                    {
                        "en": "The region produces over 50 per cent of the country's wheat.",
                        "vi": "Khu vực này sản xuất hơn 50% lúa mì của cả nước."
                    },
                    {
                        "en": "I would like to find out more about how our food is produced.",
                        "vi": "Tôi muốn tìm hiểu thêm về cách thức sản xuất thực phẩm của chúng tôi."
                    },
                    {
                        "en": "All our meat is locally produced.",
                        "vi": "Tất cả thịt của chúng tôi đều được sản xuất tại địa phương."
                    },
                    {
                        "en": "These shrubs produce bright red berries.",
                        "vi": "Những cây bụi này tạo ra những quả mọng màu đỏ tươi."
                    },
                    {
                        "en": "Under stress, the body produces adrenalin.",
                        "vi": "Khi bị căng thẳng, cơ thể sản xuất adrenalin."
                    },
                    {
                        "en": "Our cat produced kittens last week.",
                        "vi": "Con mèo của chúng tôi đã sản xuất mèo con vào tuần trước."
                    },
                    {
                        "en": "Her duty was to produce an heir to the throne.",
                        "vi": "Nhiệm vụ của cô là tạo ra một người thừa kế ngai vàng."
                    },
                    {
                        "en": "produce something from something The wine is produced from Chardonnay grapes.",
                        "vi": "sản xuất một cái gì đó từ một cái gì đó Rượu được sản xuất từ nho Chardonnay."
                    }
                ]
            },
            {
                "define": {
                    "en": "to create something, especially when skill is needed",
                    "vi": "để tạo ra thứ gì đó, đặc biệt là khi cần có kỹ năng"
                },
                "examples": [
                    {
                        "en": "She produced a delicious meal out of a few leftovers.",
                        "vi": "Cô ấy đã tạo ra một bữa ăn ngon lành từ một ít thức ăn thừa."
                    },
                    {
                        "en": "By 1912 he was producing purely abstract works.",
                        "vi": "Đến năm 1912, ông đã sản xuất các tác phẩm hoàn toàn trừu tượng."
                    },
                    {
                        "en": "United produced their best performance of the season.",
                        "vi": "United đã tạo ra màn trình diễn tốt nhất của họ trong mùa giải."
                    },
                    {
                        "en": "He produces reports on economic and social trends for manufacturers and trade associations.",
                        "vi": "Ông đưa ra các báo cáo về xu hướng kinh tế và xã hội cho các nhà sản xuất và hiệp hội thương mại."
                    }
                ]
            },
            {
                "define": {
                    "en": "to cause a particular result or effect",
                    "vi": "để gây ra một kết quả hoặc hiệu ứng cụ thể"
                },
                "examples": [
                    {
                        "en": "A phone call to the manager produced the result she wanted.",
                        "vi": "Một cuộc điện thoại cho người quản lý đã tạo ra kết quả mà cô ấy mong muốn."
                    },
                    {
                        "en": "His words failed to produce the desired effect.",
                        "vi": "Lời nói của anh ta không tạo được hiệu quả như mong muốn."
                    },
                    {
                        "en": "These reforms will produce little change.",
                        "vi": "Những cải cách này sẽ tạo ra ít thay đổi."
                    },
                    {
                        "en": "The drug produces a feeling of excitement.",
                        "vi": "Thuốc tạo cảm giác hưng phấn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to show something or make something appear from somewhere",
                    "vi": "để hiển thị một cái gì đó hoặc làm cho một cái gì đó xuất hiện từ một nơi nào đó"
                },
                "examples": [
                    {
                        "en": "produce something from/out of something He produced a letter from his pocket.",
                        "vi": "sản xuất một cái gì đó từ / ra một cái gì đó Anh ấy đã sản xuất một bức thư từ trong túi của mình."
                    },
                    {
                        "en": "produce something She failed to produce any evidence to support these claims.",
                        "vi": "sản xuất một cái gì đó Cô ấy không đưa ra được bất kỳ bằng chứng nào để hỗ trợ những tuyên bố này."
                    },
                    {
                        "en": "At the meeting the finance director produced the figures for the previous year.",
                        "vi": "Tại cuộc họp, giám đốc tài chính đưa ra các số liệu của năm trước."
                    }
                ]
            },
            {
                "define": {
                    "en": "if a town, country, etc. produces somebody with a particular skill or quality, the person comes from that town, country, etc.",
                    "vi": "nếu một thị trấn, quốc gia, v.v. tạo ra một người nào đó có kỹ năng hoặc phẩm chất cụ thể, thì người đó đến từ thị trấn, quốc gia đó, v.v."
                },
                "examples": [
                    {
                        "en": "He is the greatest athlete this country has ever produced.",
                        "vi": "Anh ấy là vận động viên vĩ đại nhất mà đất nước này từng sản sinh ra."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be in charge of preparing a film, play, etc. for the public to see",
                    "vi": "chịu trách nhiệm chuẩn bị một bộ phim, vở kịch, v.v. cho công chúng xem"
                },
                "examples": [
                    {
                        "en": "She produced a TV series about adopted children.",
                        "vi": "Cô đã sản xuất một bộ phim truyền hình về những người con nuôi."
                    }
                ]
            }
        ]
    },
    {
        "id": "6dc73bf404514de5b5c2bc0f58c777cd",
        "word": "rehearsal",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/rɪˈhɜːsl/",
            "us": "/rɪˈhɜːrsl/"
        },
        "nearby": [
            {
                "word": "rehear",
                "pos": "verb"
            },
            {
                "word": "rehearing",
                "pos": "noun"
            },
            {
                "word": "rehearsal",
                "pos": "noun"
            },
            {
                "word": "rehearsal dinner",
                "pos": "noun"
            },
            {
                "word": "rehearse",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "time that is spent practising a play or piece of music in preparation for a public performance",
                    "vi": "thời gian dành để luyện tập một vở kịch hoặc một bản nhạc để chuẩn bị cho buổi biểu diễn trước công chúng"
                },
                "examples": [
                    {
                        "en": "to have a rehearsal",
                        "vi": "để có một buổi diễn tập"
                    },
                    {
                        "en": "We only had six days of rehearsal.",
                        "vi": "Chúng tôi chỉ có sáu ngày diễn tập."
                    },
                    {
                        "en": "The leading man broke his leg in the middle of rehearsals.",
                        "vi": "Người dẫn đầu bị gãy chân giữa buổi tập."
                    },
                    {
                        "en": "rehearsal for something rehearsals for ‘Romeo and Juliet’",
                        "vi": "diễn tập cho một cái gì đó diễn tập cho 'Romeo và Juliet'"
                    },
                    {
                        "en": "in rehearsal Our new production of ‘Hamlet’ is currently in rehearsal.",
                        "vi": "đang diễn tập Sản phẩm mới của chúng tôi 'Hamlet' hiện đang trong quá trình diễn tập."
                    },
                    {
                        "en": "a rehearsal room",
                        "vi": "một phòng tập"
                    }
                ]
            },
            {
                "define": {
                    "en": "an experience or event that helps to prepare you for something that is going to happen in the future",
                    "vi": "một trải nghiệm hoặc sự kiện giúp bạn chuẩn bị cho điều gì đó sẽ xảy ra trong tương lai"
                },
                "examples": [
                    {
                        "en": "These training exercises are designed to be a rehearsal for the invasion.",
                        "vi": "Các bài tập huấn luyện này được thiết kế để trở thành một cuộc diễn tập cho cuộc xâm lược."
                    },
                    {
                        "en": "Life is not a rehearsal.",
                        "vi": "Cuộc sống không phải là một cuộc diễn tập."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of repeating something that has been said before",
                    "vi": "hành động lặp lại điều gì đó đã được nói trước đó"
                },
                "examples": [
                    {
                        "en": "We listened to his lengthy rehearsal of the arguments.",
                        "vi": "Chúng tôi đã lắng nghe cuộc diễn tập kéo dài của anh ấy về các lập luận."
                    }
                ]
            }
        ]
    },
    {
        "id": "7c546bc32a78424d9c5f60ff22999d17",
        "word": "release",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/rɪˈliːs/",
            "us": "/rɪˈliːs/"
        },
        "nearby": [
            {
                "word": "relay2",
                "pos": "verb"
            },
            {
                "word": "relay1",
                "pos": "noun"
            },
            {
                "word": "release",
                "pos": "verb"
            },
            {
                "word": "release",
                "pos": "noun"
            },
            {
                "word": "release candidate",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to let somebody come out of a place where they have been kept or stuck and unable to leave or move",
                    "vi": "để cho ai đó thoát ra khỏi một nơi mà họ đã bị giam giữ hoặc bị mắc kẹt và không thể rời đi hoặc di chuyển"
                },
                "examples": [
                    {
                        "en": "release somebody to release a prisoner",
                        "vi": "thả ai đó để trả tự do cho một tù nhân"
                    },
                    {
                        "en": "The hostages were released unharmed.",
                        "vi": "Các con tin được thả mà không hề hấn gì."
                    },
                    {
                        "en": "He was released without charge after questioning by police.",
                        "vi": "Anh ta được thả mà không bị buộc tội sau khi bị cảnh sát thẩm vấn."
                    },
                    {
                        "en": "You will be released on bail and a date for your hearing will be set.",
                        "vi": "Bạn sẽ được tại ngoại và ngày điều trần sẽ được ấn định."
                    },
                    {
                        "en": "release somebody from something to release somebody from prison/jail/hospital",
                        "vi": "thả ai đó khỏi một cái gì đó để giải phóng ai đó khỏi nhà tù / nhà tù / bệnh viện"
                    },
                    {
                        "en": "Firefighters took two hours to release the driver from the wreckage.",
                        "vi": "Các nhân viên cứu hỏa đã mất hai giờ để giải phóng tài xế khỏi đống đổ nát."
                    },
                    {
                        "en": "He was later released from police custody.",
                        "vi": "Anh ta sau đó đã được thả ra khỏi sự giam giữ của cảnh sát."
                    },
                    {
                        "en": "(figurative) Death released him from his suffering.",
                        "vi": "(nghĩa bóng) Cái chết đã giải thoát anh ta khỏi đau khổ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to stop holding something or stop it from being held so that it can move, fly, fall, etc. freely",
                    "vi": "dừng cầm vật gì đó hoặc không giữ vật đó để vật đó có thể di chuyển, bay, rơi, v.v."
                },
                "examples": [
                    {
                        "en": "release something He refused to release her arm.",
                        "vi": "thả ra một cái gì đó Anh từ chối để thả cánh tay của cô."
                    },
                    {
                        "en": "Intense heat is released in the reaction.",
                        "vi": "Phản ứng tỏa nhiệt dữ dội."
                    },
                    {
                        "en": "10 000 balloons were released at the ceremony.",
                        "vi": "10 000 quả bóng bay đã được thả tại buổi lễ."
                    },
                    {
                        "en": "The chemical reaction releases energy in the form of light.",
                        "vi": "Phản ứng hóa học giải phóng năng lượng dưới dạng ánh sáng."
                    },
                    {
                        "en": "release something into something the need to limit the amount of greenhouse gases being released into the atmosphere",
                        "vi": "thải một thứ gì đó vào một thứ cần hạn chế lượng khí nhà kính thải vào khí quyển"
                    },
                    {
                        "en": "The birds were cleaned and fed and released again into the wild.",
                        "vi": "Những con chim đã được làm sạch và cho ăn và thả trở lại tự nhiên."
                    }
                ]
            },
            {
                "define": {
                    "en": "to express feelings such as anger or worry in order to get rid of them",
                    "vi": "thể hiện cảm xúc như tức giận hoặc lo lắng để loại bỏ chúng"
                },
                "examples": [
                    {
                        "en": "She burst into tears, releasing all her pent-up emotions.",
                        "vi": "Cô bật khóc, giải tỏa mọi cảm xúc dồn nén."
                    },
                    {
                        "en": "She laughed, the tension inside her suddenly released.",
                        "vi": "Cô bật cười, sự căng thẳng trong lòng chợt được giải tỏa."
                    }
                ]
            },
            {
                "define": {
                    "en": "to remove something from a fixed position, allowing something else to move or function",
                    "vi": "để loại bỏ một thứ gì đó khỏi một vị trí cố định, cho phép một thứ khác di chuyển hoặc hoạt động"
                },
                "examples": [
                    {
                        "en": "to release the clutch/handbrake/switch",
                        "vi": "để nhả ly hợp / phanh tay / công tắc"
                    },
                    {
                        "en": "Now release the clutch and move away from the kerb.",
                        "vi": "Bây giờ nhả ly hợp và di chuyển ra khỏi lề đường."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make information available to the public",
                    "vi": "để cung cấp thông tin cho công chúng"
                },
                "examples": [
                    {
                        "en": "release something to release a statement/report/document/poll/study",
                        "vi": "phát hành một cái gì đó để phát hành một tuyên bố / báo cáo / tài liệu / thăm dò ý kiến / nghiên cứu"
                    },
                    {
                        "en": "to release figures/results/information/data",
                        "vi": "để đưa ra các số liệu / kết quả / thông tin / dữ liệu"
                    },
                    {
                        "en": "Police have released no further details about the accident.",
                        "vi": "Cảnh sát chưa tiết lộ thêm thông tin chi tiết về vụ tai nạn."
                    },
                    {
                        "en": "release something to somebody The suspect's name has not been released to the public.",
                        "vi": "phát hành một cái gì đó cho ai đó Tên của nghi phạm đã không được công bố cho công chúng."
                    },
                    {
                        "en": "The newly released files reveal the extent of his involvement in the scandal.",
                        "vi": "Các hồ sơ mới được công bố cho thấy mức độ dính líu của anh ta trong vụ bê bối."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make a film, recording or other product available to the public",
                    "vi": "để cung cấp một bộ phim, bản ghi âm hoặc sản phẩm khác cho công chúng"
                },
                "examples": [
                    {
                        "en": "He's planning to release a solo album.",
                        "vi": "Anh ấy đang có kế hoạch phát hành một album solo."
                    },
                    {
                        "en": "to release a film/video",
                        "vi": "để phát hành một bộ phim / video"
                    },
                    {
                        "en": "They've released a new version of the original film.",
                        "vi": "Họ đã phát hành một phiên bản mới của bộ phim gốc."
                    },
                    {
                        "en": "There have been a lot of new products released onto the market.",
                        "vi": "Đã có rất nhiều sản phẩm mới được tung ra thị trường."
                    },
                    {
                        "en": "The series has just recently been released on DVD.",
                        "vi": "Bộ truyện vừa mới được phát hành trên DVD."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make something available that had previously been limited",
                    "vi": "để cung cấp một cái gì đó có sẵn mà trước đây đã bị hạn chế"
                },
                "examples": [
                    {
                        "en": "The new building programme will go ahead as soon as the government releases the funds.",
                        "vi": "Chương trình xây dựng mới sẽ được tiến hành ngay sau khi chính phủ giải phóng ngân quỹ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to free somebody from a duty, responsibility, contract, etc.",
                    "vi": "để giải phóng ai đó khỏi nghĩa vụ, trách nhiệm, hợp đồng, v.v."
                },
                "examples": [
                    {
                        "en": "release somebody The club is releasing some of its older players.",
                        "vi": "thả ai đó Câu lạc bộ đang giải phóng một số cầu thủ lớn tuổi của mình."
                    },
                    {
                        "en": "release somebody from something The new law released employers from their obligation to recognize unions.",
                        "vi": "giải phóng ai đó khỏi điều gì đó Luật mới giải phóng người sử dụng lao động khỏi nghĩa vụ công nhận công đoàn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make something less tight",
                    "vi": "để làm cho một cái gì đó ít chặt chẽ hơn"
                },
                "examples": [
                    {
                        "en": "You need to release the tension in these shoulder muscles.",
                        "vi": "Bạn cần giải phóng sức căng ở các cơ vai này."
                    },
                    {
                        "en": "to release a catch/a screw/a nut/the clutch/the brakes",
                        "vi": "để nhả chốt / vít / đai ốc / ly hợp / phanh"
                    }
                ]
            }
        ]
    },
    {
        "id": "59b2909dd025412b91d5a890fe573483",
        "word": "release",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/rɪˈliːs/",
            "us": "/rɪˈliːs/"
        },
        "nearby": [
            {
                "word": "relay1",
                "pos": "noun"
            },
            {
                "word": "release",
                "pos": "verb"
            },
            {
                "word": "release",
                "pos": "noun"
            },
            {
                "word": "release candidate",
                "pos": "noun"
            },
            {
                "word": "relegate",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act of setting a person or an animal free; the state of being set free",
                    "vi": "hành động thả tự do cho một người hoặc một động vật; trạng thái được tự do"
                },
                "examples": [
                    {
                        "en": "release of somebody/something The government has been working to secure the release of the hostages.",
                        "vi": "thả ai đó / cái gì đó Chính phủ đã làm việc để đảm bảo việc thả con tin."
                    },
                    {
                        "en": "The judges ordered the release of prisoners who were political opponents of the government.",
                        "vi": "Các thẩm phán đã ra lệnh trả tự do cho các tù nhân là đối thủ chính trị của chính phủ."
                    },
                    {
                        "en": "The public demanded her release.",
                        "vi": "Công chúng yêu cầu trả tự do cho cô."
                    },
                    {
                        "en": "release from something Following his release from prison, he moved to London.",
                        "vi": "giải phóng khỏi cái gì đó Sau khi ra tù, anh chuyển đến London."
                    },
                    {
                        "en": "release of somebody from something The release of female prisoners from government jails was part of the deal.",
                        "vi": "thả ai đó khỏi cái gì đó Việc thả các nữ tù nhân khỏi nhà tù của chính phủ là một phần của thỏa thuận."
                    },
                    {
                        "en": "He was granted early release (= from prison).",
                        "vi": "Anh ta được trả tự do sớm (= ra khỏi tù)."
                    },
                    {
                        "en": "She can expect an early release from prison.",
                        "vi": "Cô ấy có thể mong đợi được ra tù sớm."
                    },
                    {
                        "en": "on/upon somebody's release from something Upon his release from jail he found work in a restaurant kitchen.",
                        "vi": "trên / khi ai đó được thả ra khỏi một cái gì đó Sau khi ra tù, anh ta tìm được việc làm trong một nhà bếp của nhà hàng."
                    },
                    {
                        "en": "on/upon somebody's release Upon her release, she fled Germany, living first in Geneva, then Paris.",
                        "vi": "trên / khi ai đó được thả Khi được thả, cô ấy đã trốn khỏi Đức, đầu tiên sống ở Geneva, sau đó là Paris."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of making a film, recording or other product available to the public",
                    "vi": "hành động làm phim, ghi âm hoặc sản phẩm khác có sẵn cho công chúng"
                },
                "examples": [
                    {
                        "en": "The new software is planned for release in April.",
                        "vi": "Phần mềm mới được lên kế hoạch phát hành vào tháng 4."
                    },
                    {
                        "en": "It is very difficult for a Brazilian film to get an American release.",
                        "vi": "Rất khó để một bộ phim Brazil được Mỹ phát hành."
                    },
                    {
                        "en": "The film never received a theatrical release (= was not shown in cinemas).",
                        "vi": "Phim chưa bao giờ được chiếu tại rạp (= không được chiếu trong rạp chiếu phim)."
                    },
                    {
                        "en": "The movie goes on general release (= will be widely shown in cinemas) next week.",
                        "vi": "Phim sẽ được phát hành chung (= sẽ được chiếu rộng rãi tại các rạp chiếu phim) vào tuần tới."
                    },
                    {
                        "en": "I hadn't seen the movie since its original release.",
                        "vi": "Tôi đã không xem bộ phim kể từ khi phát hành ban đầu."
                    },
                    {
                        "en": "the release of a film/report",
                        "vi": "phát hành một bộ phim / báo cáo"
                    },
                    {
                        "en": "upon (something's) release Upon its release, the film received considerable acclaim.",
                        "vi": "khi (cái gì đó) phát hành Khi phát hành, bộ phim đã nhận được sự hoan nghênh đáng kể."
                    },
                    {
                        "en": "It's still seven weeks till the film's official release.",
                        "vi": "Vẫn còn bảy tuần nữa là bộ phim phát hành chính thức."
                    },
                    {
                        "en": "A release date has not been announced yet.",
                        "vi": "Ngày phát hành vẫn chưa được công bố."
                    }
                ]
            },
            {
                "define": {
                    "en": "a thing that is made available to the public, especially a new film or music recording",
                    "vi": "một thứ được cung cấp cho công chúng, đặc biệt là một bộ phim mới hoặc bản ghi âm nhạc"
                },
                "examples": [
                    {
                        "en": "recent/new releases",
                        "vi": "bản phát hành gần đây / mới"
                    },
                    {
                        "en": "the latest releases",
                        "vi": "bản phát hành mới nhất"
                    },
                    {
                        "en": "There are several interesting album releases due out on Friday.",
                        "vi": "Có một số bản phát hành album thú vị sẽ ra mắt vào thứ Sáu."
                    },
                    {
                        "en": "This is a debut release that'll simply take your breath away.",
                        "vi": "Đây là một bản phát hành đầu tay đơn giản sẽ khiến bạn phải hít thở."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of making information available to the public",
                    "vi": "hành động cung cấp thông tin cho công chúng"
                },
                "examples": [
                    {
                        "en": "the release of the report",
                        "vi": "việc phát hành báo cáo"
                    },
                    {
                        "en": "The company issued a news release after the board meeting.",
                        "vi": "Công ty đã đưa ra một thông cáo báo chí sau cuộc họp hội đồng quản trị."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of letting a gas, chemical, etc. move or flow freely",
                    "vi": "hành động để cho khí, hóa chất, v.v. di chuyển hoặc chảy tự do"
                },
                "examples": [
                    {
                        "en": "Release of these hormones gives the body a temporary increase in strength and energy.",
                        "vi": "Việc giải phóng các hormone này mang lại cho cơ thể sự gia tăng tạm thời về sức mạnh và năng lượng."
                    },
                    {
                        "en": "disasters resulting from accidental releases of toxic substances",
                        "vi": "thảm họa do ngẫu nhiên thải ra các chất độc hại"
                    },
                    {
                        "en": "The aim is to control the risks of exposure to chemicals by preventing release at source.",
                        "vi": "Mục đích là để kiểm soát rủi ro tiếp xúc với hóa chất bằng cách ngăn chặn việc thải ra tại nguồn."
                    },
                    {
                        "en": "release of something into something the release of carbon dioxide into the atmosphere",
                        "vi": "giải phóng một cái gì đó vào một cái gì đó giải phóng carbon dioxide vào khí quyển"
                    },
                    {
                        "en": "to monitor radiation releases",
                        "vi": "để theo dõi phóng xạ"
                    }
                ]
            },
            {
                "define": {
                    "en": "the feeling that you are free from pain, worry or some other unpleasant feeling",
                    "vi": "cảm giác rằng bạn không còn đau đớn, lo lắng hoặc một số cảm giác khó chịu khác"
                },
                "examples": [
                    {
                        "en": "a sense of release after the exam",
                        "vi": "một cảm giác giải phóng sau kỳ thi"
                    },
                    {
                        "en": "I think her death was a merciful release.",
                        "vi": "Tôi nghĩ cái chết của cô ấy là một sự giải thoát nhân hậu."
                    },
                    {
                        "en": "It’s just a release of tension.",
                        "vi": "Nó chỉ là một sự giải tỏa căng thẳng."
                    }
                ]
            }
        ]
    },
    {
        "id": "986949dbc2ff498ea8b430a08112785e",
        "word": "hum",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/hʌm/",
            "us": "/hʌm/"
        },
        "nearby": [
            {
                "word": "hullabaloo",
                "pos": "noun"
            },
            {
                "word": "hullo",
                "pos": "exclamation, noun"
            },
            {
                "word": "hum",
                "pos": "verb"
            },
            {
                "word": "hum",
                "pos": "noun"
            },
            {
                "word": "human",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to sing a tune with your lips closed",
                    "vi": "để hát một giai điệu với đôi môi của bạn khép lại"
                },
                "examples": [
                    {
                        "en": "She was humming softly to herself.",
                        "vi": "Cô ấy khẽ ngâm nga một mình."
                    },
                    {
                        "en": "He began to hum along with the music.",
                        "vi": "Anh bắt đầu ngân nga theo điệu nhạc."
                    },
                    {
                        "en": "hum something What's that tune you're humming?",
                        "vi": "ngân nga gì đó Bạn đang ngâm nga giai điệu gì?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to make a low continuous sound",
                    "vi": "để tạo ra âm thanh liên tục thấp"
                },
                "examples": [
                    {
                        "en": "The computers were humming away.",
                        "vi": "Máy tính ồn ào đi xa."
                    },
                    {
                        "en": "The overhead wires hummed with power.",
                        "vi": "Những sợi dây điện trên không vo ve vì nguồn điện."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be full of activity",
                    "vi": "tràn đầy hoạt động"
                },
                "examples": [
                    {
                        "en": "The streets were beginning to hum with life.",
                        "vi": "Đường phố bắt đầu ồn ào với cuộc sống."
                    },
                    {
                        "en": "The whole room was humming now.",
                        "vi": "Cả căn phòng lúc này đang ồn ào."
                    },
                    {
                        "en": "Things were beginning to hum.",
                        "vi": "Mọi thứ bắt đầu ồn ào."
                    }
                ]
            },
            {
                "define": {
                    "en": "to take a long time to make a decision or before you say something",
                    "vi": "mất nhiều thời gian để đưa ra quyết định hoặc trước khi bạn nói điều gì đó"
                },
                "examples": [
                    {
                        "en": "We hummed and hawed for weeks before deciding to buy the house.",
                        "vi": "Chúng tôi ậm ừ cho qua hàng tuần rồi mới quyết định mua nhà."
                    }
                ]
            }
        ]
    },
    {
        "id": "3c75e15ddc3945a795d16d4df3d91e7a",
        "word": "interpretation",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ɪnˌtɜːprəˈteɪʃn/",
            "us": "/ɪnˌtɜːrprəˈteɪʃn/"
        },
        "nearby": [
            {
                "word": "interpret",
                "pos": "verb"
            },
            {
                "word": "interpretable",
                "pos": "adjective"
            },
            {
                "word": "interpretation",
                "pos": "noun"
            },
            {
                "word": "interpretative",
                "pos": "adjective"
            },
            {
                "word": "interpreter",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the particular way in which something is understood or explained",
                    "vi": "cách cụ thể mà một cái gì đó được hiểu hoặc giải thích"
                },
                "examples": [
                    {
                        "en": "Her evidence suggests a different interpretation of the events.",
                        "vi": "Bằng chứng của cô ấy gợi ý một cách giải thích khác về các sự kiện."
                    },
                    {
                        "en": "It is not possible for everyone to put their own interpretation on the law.",
                        "vi": "Không phải ai cũng có thể đặt cách giải thích của mình vào luật."
                    },
                    {
                        "en": "Dreams are open to interpretation (= they can be explained in different ways).",
                        "vi": "Các giấc mơ có thể giải thích được (= chúng có thể được giải thích theo nhiều cách khác nhau)."
                    }
                ]
            },
            {
                "define": {
                    "en": "the particular way in which somebody chooses to perform a piece of music, a role in a play, etc.",
                    "vi": "cách cụ thể mà ai đó chọn để biểu diễn một bản nhạc, một vai trong vở kịch, v.v."
                },
                "examples": [
                    {
                        "en": "a modern interpretation of ‘King Lear’",
                        "vi": "một cách giải thích hiện đại của 'King Lear'"
                    }
                ]
            }
        ]
    },
    {
        "id": "b949d8ed21214da7876f87bced379b7d",
        "word": "pluck",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/plʌk/",
            "us": "/plʌk/"
        },
        "nearby": [
            {
                "word": "plow up",
                "pos": "phrasal verb"
            },
            {
                "word": "ploy",
                "pos": "noun"
            },
            {
                "word": "pluck",
                "pos": "verb"
            },
            {
                "word": "pluck",
                "pos": "noun"
            },
            {
                "word": "pluck at",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to pull out hairs with your fingers or with tweezers",
                    "vi": "nhổ lông bằng ngón tay hoặc nhíp"
                },
                "examples": [
                    {
                        "en": "She plucked out a grey hair.",
                        "vi": "Cô ấy nhổ một sợi tóc bạc."
                    },
                    {
                        "en": "expertly plucked eyebrows",
                        "vi": "nhổ lông mày thành thạo"
                    }
                ]
            },
            {
                "define": {
                    "en": "to pull the feathers off a dead bird, for example a chicken, in order to prepare it for cooking",
                    "vi": "nhổ lông cho một con gia cầm chết, ví dụ như một con gà, để chuẩn bị nấu ăn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to play a musical instrument, especially a guitar, by pulling the strings with your fingers",
                    "vi": "để chơi một nhạc cụ, đặc biệt là guitar, bằng cách dùng ngón tay kéo dây"
                },
                "examples": [
                    {
                        "en": "to pluck the strings of a violin",
                        "vi": "gảy dây đàn vĩ cầm"
                    },
                    {
                        "en": "He took the guitar and plucked at the strings.",
                        "vi": "Anh lấy cây đàn và gảy dây đàn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to remove somebody from a place or situation, especially one that is unpleasant or dangerous",
                    "vi": "để loại bỏ ai đó khỏi một địa điểm hoặc tình huống, đặc biệt là một địa điểm hoặc tình huống khó chịu hoặc nguy hiểm"
                },
                "examples": [
                    {
                        "en": "Police plucked a drowning girl from the river yesterday.",
                        "vi": "Cảnh sát vớt được một cô gái chết đuối trên sông hôm qua."
                    },
                    {
                        "en": "Survivors of the wreck were plucked to safety by a helicopter.",
                        "vi": "Những người sống sót trong xác máy bay đã được đưa đến nơi an toàn bằng trực thăng."
                    },
                    {
                        "en": "She was plucked from obscurity to instant stardom.",
                        "vi": "Cô ấy đã được đưa từ mờ mịt trở thành ngôi sao ngay lập tức."
                    }
                ]
            },
            {
                "define": {
                    "en": "to take hold of something and remove it by pulling it",
                    "vi": "nắm lấy thứ gì đó và loại bỏ nó bằng cách kéo nó"
                },
                "examples": [
                    {
                        "en": "He plucked the wallet from the man's grasp.",
                        "vi": "Anh lấy chiếc ví ra khỏi tay người đàn ông."
                    }
                ]
            },
            {
                "define": {
                    "en": "to pick a fruit, flower, etc. from where it is growing",
                    "vi": "hái trái cây, hoa, v.v. từ nơi nó đang phát triển"
                },
                "examples": [
                    {
                        "en": "I plucked an orange from the tree.",
                        "vi": "Tôi nhổ một quả cam trên cây."
                    }
                ]
            },
            {
                "define": {
                    "en": "to say a name, number, etc. without thinking about it, especially in answer to a question",
                    "vi": "để nói tên, số, v.v. mà không cần suy nghĩ về nó, đặc biệt là khi trả lời một câu hỏi"
                },
                "examples": [
                    {
                        "en": "I just plucked a figure out of the air and said : ‘Would £1 000 seem reasonable to you?’",
                        "vi": "Tôi chỉ lấy một con số trong không khí và nói: '1.000 bảng Anh có vẻ hợp lý với bạn không?'"
                    }
                ]
            },
            {
                "define": {
                    "en": "to make yourself do something even though you are afraid to do it",
                    "vi": "để khiến bản thân làm điều gì đó mặc dù bạn sợ phải làm điều đó"
                },
                "examples": [
                    {
                        "en": "I finally plucked up the courage to ask her for a date.",
                        "vi": "Cuối cùng tôi cũng lấy hết can đảm để ngỏ lời hẹn hò với cô ấy."
                    }
                ]
            }
        ]
    },
    {
        "id": "4fe217c7916540baac93e97eff51f41a",
        "word": "whistle",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈwɪsl/",
            "us": "/ˈwɪsl/"
        },
        "nearby": [
            {
                "word": "whist",
                "pos": "noun"
            },
            {
                "word": "whistle",
                "pos": "noun"
            },
            {
                "word": "whistle",
                "pos": "verb"
            },
            {
                "word": "whistle-blower",
                "pos": "noun"
            },
            {
                "word": "James McNeill Whistler",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to make a high sound or a musical tune by forcing your breath out when your lips are almost closed",
                    "vi": "để tạo ra âm thanh cao hoặc một giai điệu âm nhạc bằng cách cố gắng thở ra khi môi bạn gần như khép lại"
                },
                "examples": [
                    {
                        "en": "whistle (something) to whistle a tune",
                        "vi": "huýt sáo (cái gì đó) để huýt sáo một giai điệu"
                    },
                    {
                        "en": "He whistled in amazement.",
                        "vi": "Anh kinh ngạc huýt sáo."
                    },
                    {
                        "en": "The crowd booed and whistled as the player came onto the field.",
                        "vi": "Đám đông la ó và huýt sáo khi cầu thủ này bước ra sân."
                    },
                    {
                        "en": "whistle to somebody/something She whistled to the dog to come back.",
                        "vi": "huýt sáo với ai đó / cái gì đó Cô ấy huýt sáo để con chó quay lại."
                    },
                    {
                        "en": "whistle at somebody/something Workmen whistled at her as she walked past.",
                        "vi": "huýt sáo với ai đó / cái gì đó Người lao động huýt sáo với cô ấy khi cô ấy đi ngang qua."
                    },
                    {
                        "en": "He whistled at the sheer audacity of the plan.",
                        "vi": "Anh ta huýt sáo trước sự táo bạo tuyệt đối của kế hoạch."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make a loud, high sound by blowing into a whistle",
                    "vi": "để tạo ra âm thanh lớn và cao bằng cách thổi vào một cái còi"
                },
                "examples": [
                    {
                        "en": "The referee whistled for a foul.",
                        "vi": "Trọng tài nổi còi do phạm lỗi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make a loud, high sound",
                    "vi": "để tạo ra âm thanh lớn, cao"
                },
                "examples": [
                    {
                        "en": "The kettle began to whistle.",
                        "vi": "Ấm bắt đầu kêu."
                    },
                    {
                        "en": "The microphone was making a strange whistling sound.",
                        "vi": "Micrô đang phát ra một âm thanh huýt sáo kỳ lạ."
                    },
                    {
                        "en": "The train whistled and shot into the tunnel.",
                        "vi": "Tàu hú còi lao thẳng vào đường hầm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to move quickly, making a loud, high sound",
                    "vi": "di chuyển nhanh chóng, tạo ra âm thanh lớn, cao"
                },
                "examples": [
                    {
                        "en": "The wind whistled down the chimney.",
                        "vi": "Gió rít theo ống khói."
                    },
                    {
                        "en": "A bullet whistled past his ear.",
                        "vi": "Một viên đạn xẹt qua tai anh."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make a high sound",
                    "vi": "để tạo ra âm thanh cao"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to say that you are not going to give somebody something that they have asked for",
                    "vi": "từng nói rằng bạn sẽ không cho ai đó thứ gì đó mà họ đã yêu cầu"
                },
                "examples": [
                    {
                        "en": "If he wants his money he can whistle for it—I’m broke!",
                        "vi": "Nếu anh ta muốn tiền của anh ta, anh ta có thể huýt sáo cho nó - tôi đã phá sản!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to pretend not to be afraid",
                    "vi": "giả vờ không sợ hãi"
                },
                "examples": [
                    {
                        "en": "Instead of whistling in the dark about the inevitable disaster, we should be making plans for when it strikes.",
                        "vi": "Thay vì huýt sáo trong bóng tối về thảm họa không thể tránh khỏi, chúng ta nên lập kế hoạch cho thời điểm nó xảy ra."
                    }
                ]
            }
        ]
    },
    {
        "id": "238804bc55ba416ab32f6cdb8954d1d0",
        "word": "audition",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ɔːˈdɪʃn/",
            "us": "/ɔːˈdɪʃn/"
        },
        "nearby": [
            {
                "word": "audit",
                "pos": "verb"
            },
            {
                "word": "the Audit Commission",
                "pos": "noun"
            },
            {
                "word": "audition",
                "pos": "noun"
            },
            {
                "word": "audition",
                "pos": "verb"
            },
            {
                "word": "auditor",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a short performance given by an actor, a singer, etc., so that somebody can decide whether they are suitable to act in a play, sing in a concert, etc.",
                    "vi": "một buổi biểu diễn ngắn do một diễn viên, ca sĩ, v.v., để ai đó có thể quyết định xem họ có phù hợp để diễn trong một vở kịch, hát trong một buổi hòa nhạc, v.v."
                },
                "examples": [
                    {
                        "en": "Auditions will be held from 9–12 on Friday.",
                        "vi": "Các buổi thử giọng sẽ được tổ chức từ ngày 9–12 vào thứ Sáu."
                    },
                    {
                        "en": "She had an audition for drama school.",
                        "vi": "Cô ấy đã có một buổi thử giọng vào trường kịch nghệ."
                    }
                ]
            }
        ]
    },
    {
        "id": "dfb4bc298fd247c79cd13c53cc3c7f84",
        "word": "audition",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ɔːˈdɪʃn/",
            "us": "/ɔːˈdɪʃn/"
        },
        "nearby": [
            {
                "word": "the Audit Commission",
                "pos": "noun"
            },
            {
                "word": "audition",
                "pos": "noun"
            },
            {
                "word": "audition",
                "pos": "verb"
            },
            {
                "word": "auditor",
                "pos": "noun"
            },
            {
                "word": "auditorium",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to take part in an audition",
                    "vi": "tham gia một buổi thử giọng"
                },
                "examples": [
                    {
                        "en": "She was auditioning for the role of Lady Macbeth.",
                        "vi": "Cô ấy đang thử vai cho Lady Macbeth."
                    },
                    {
                        "en": "Hundreds of people auditioned.",
                        "vi": "Hàng trăm người đã thử giọng."
                    },
                    {
                        "en": "I auditioned and was given the part.",
                        "vi": "Tôi đã thử giọng và được giao một phần."
                    }
                ]
            },
            {
                "define": {
                    "en": "to watch, listen to and judge somebody at an audition",
                    "vi": "để xem, nghe và đánh giá ai đó trong buổi thử giọng"
                },
                "examples": [
                    {
                        "en": "We auditioned over 200 children for the part.",
                        "vi": "Chúng tôi đã thử vai hơn 200 trẻ em."
                    },
                    {
                        "en": "We auditioned several excellent musicians.",
                        "vi": "Chúng tôi đã thử giọng một số nhạc sĩ xuất sắc."
                    }
                ]
            }
        ]
    },
    {
        "id": "d1a5bc644bf842b0b0fdc231dfbc5988",
        "word": "back catalogue",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbæk kætəlɒɡ/",
            "us": "/ˈbæk kætəlɔːɡ/"
        },
        "nearby": [
            {
                "word": "back-burner",
                "pos": "verb"
            },
            {
                "word": "back button",
                "pos": "noun"
            },
            {
                "word": "back catalogue",
                "pos": "noun"
            },
            {
                "word": "backchannel",
                "pos": "noun"
            },
            {
                "word": "backchat",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "all the recorded music previously produced by a musician",
                    "vi": "tất cả các bản nhạc đã ghi do một nhạc sĩ sản xuất trước đó"
                },
                "examples": [
                    {
                        "en": "The entire Beatles' back catalogue has been put online.",
                        "vi": "Toàn bộ danh mục trở lại của Beatles đã được đưa lên mạng."
                    }
                ]
            }
        ]
    },
    {
        "id": "46bb1a735a924b9084f6718159bfd52f",
        "word": "backing",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbækɪŋ/",
            "us": "/ˈbækɪŋ/"
        },
        "nearby": [
            {
                "word": "back-heel",
                "pos": "noun"
            },
            {
                "word": "backhoe",
                "pos": "noun"
            },
            {
                "word": "backing",
                "pos": "noun"
            },
            {
                "word": "backing store",
                "pos": "noun"
            },
            {
                "word": "back issue",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "help and support from somebody to do something; financial support for something",
                    "vi": "giúp đỡ và hỗ trợ từ ai đó để làm điều gì đó; hỗ trợ tài chính cho một cái gì đó"
                },
                "examples": [
                    {
                        "en": "The police gave the proposals their full backing.",
                        "vi": "Cảnh sát đã ủng hộ các đề xuất hoàn toàn của họ."
                    },
                    {
                        "en": "They have won financial backing from the EU.",
                        "vi": "Họ đã giành được sự ủng hộ tài chính từ EU."
                    }
                ]
            },
            {
                "define": {
                    "en": "material attached to the back of something in order to protect it or make it stronger",
                    "vi": "vật liệu được gắn vào mặt sau của một cái gì đó để bảo vệ nó hoặc làm cho nó chắc chắn hơn"
                },
                "examples": [
                    {
                        "en": "Remove the backing paper from the adhesive tape.",
                        "vi": "Lấy giấy lót ra khỏi băng dính."
                    },
                    {
                        "en": "The fabric has a special backing for durability.",
                        "vi": "Vải có lớp nền đặc biệt để tăng độ bền."
                    }
                ]
            },
            {
                "define": {
                    "en": "music that goes with the main singer or tune",
                    "vi": "âm nhạc phù hợp với ca sĩ chính hoặc giai điệu"
                },
                "examples": [
                    {
                        "en": "a backing group/singer/track",
                        "vi": "một nhóm ủng hộ / ca sĩ / bài hát"
                    }
                ]
            }
        ]
    },
    {
        "id": "4824a813236c4fd9ab6592fde0624911",
        "word": "beatbox",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbiːtbɒks/",
            "us": "/ˈbiːtbɑːks/"
        },
        "nearby": [
            {
                "word": "beat",
                "pos": "noun"
            },
            {
                "word": "beat",
                "pos": "adjective"
            },
            {
                "word": "beatbox",
                "pos": "noun"
            },
            {
                "word": "beatbox",
                "pos": "verb"
            },
            {
                "word": "beatboxing",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an electronic machine that produces drum sounds",
                    "vi": "một máy điện tử tạo ra âm thanh trống"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a radio, CD player, etc. that can be carried around and is used for playing loud music",
                    "vi": "radio, đầu đĩa CD, v.v. có thể mang theo và được sử dụng để phát nhạc lớn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a person who uses the voice to make sounds like a drum to create the beat in hip-hop",
                    "vi": "một người sử dụng giọng nói để tạo ra âm thanh như trống để tạo ra nhịp điệu trong hip-hop"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "music that is created using sounds made with the human voice",
                    "vi": "âm nhạc được tạo ra bằng âm thanh được tạo ra bằng giọng nói của con người"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "2e3cf0f4765846a88b2bde02050ba43e",
        "word": "cut",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/kʌt/",
            "us": "/kʌt/"
        },
        "nearby": [
            {
                "word": "customs union",
                "pos": "noun"
            },
            {
                "word": "cut-off",
                "pos": "adjective"
            },
            {
                "word": "cut",
                "pos": "verb"
            },
            {
                "word": "cut",
                "pos": "noun"
            },
            {
                "word": "cut across",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to make an opening or a wound in something, especially with a sharp tool such as a knife or scissors",
                    "vi": "để tạo một vết hở hoặc một vết thương ở một thứ gì đó, đặc biệt là với một công cụ sắc nhọn như dao hoặc kéo"
                },
                "examples": [
                    {
                        "en": "cut something She cut her finger on a piece of glass.",
                        "vi": "cắt một cái gì đó Cô ấy đã cắt ngón tay của mình trên một mảnh thủy tinh."
                    },
                    {
                        "en": "cut yourself He cut himself (= his face) shaving.",
                        "vi": "tự cắt mình Anh ta tự cắt (= khuôn mặt của mình) cạo râu."
                    },
                    {
                        "en": "Sometimes people experiencing distress cut themselves (= deliberately).",
                        "vi": "Đôi khi những người gặp nạn tự cắt cổ mình (= cố ý)."
                    },
                    {
                        "en": "cut something + adj. She had fallen and cut her head open.",
                        "vi": "cắt cái gì đó + adj. Cô ấy đã bị ngã và bị cắt đầu."
                    },
                    {
                        "en": "cut into something She picked up the knife and cut into the meat.",
                        "vi": "cắt thành thứ gì đó Cô cầm con dao lên và cắt vào miếng thịt."
                    },
                    {
                        "en": "cut through something You need a powerful saw to cut through metal.",
                        "vi": "cắt qua một cái gì đó Bạn cần một cái cưa mạnh mẽ để cắt kim loại."
                    },
                    {
                        "en": "(figurative) The canoe cut through the water.",
                        "vi": "(nghĩa bóng) Chiếc ca nô cắt ngang mặt nước."
                    }
                ]
            },
            {
                "define": {
                    "en": "to divide something into two or more pieces with a knife, etc.",
                    "vi": "để chia thứ gì đó thành hai hoặc nhiều mảnh bằng dao, v.v."
                },
                "examples": [
                    {
                        "en": "cut something Don't cut the string, untie the knots.",
                        "vi": "cắt một cái gì đó Đừng cắt dây, hãy cởi các nút thắt."
                    },
                    {
                        "en": "The bus was cut in two by the train.",
                        "vi": "Chiếc xe buýt bị tàu hỏa cắt đôi."
                    },
                    {
                        "en": "Now cut the tomatoes in half.",
                        "vi": "Bây giờ bạn hãy cắt đôi quả cà chua."
                    },
                    {
                        "en": "cut something into something He cut the loaf into thick slices.",
                        "vi": "cắt một cái gì đó thành một cái gì đó Anh ta cắt ổ bánh thành những lát dày."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make something shorter by cutting",
                    "vi": "để làm cho một cái gì đó ngắn hơn bằng cách cắt"
                },
                "examples": [
                    {
                        "en": "cut something She cuts hair for a living.",
                        "vi": "cắt một cái gì đó Cô ấy cắt tóc để kiếm sống."
                    },
                    {
                        "en": "to cut the grass/lawn/hedge",
                        "vi": "cắt cỏ / bãi cỏ / hàng rào"
                    },
                    {
                        "en": "the smell of freshly cut grass",
                        "vi": "mùi cỏ mới cắt"
                    },
                    {
                        "en": "cut something + adj. He's had his hair cut really short.",
                        "vi": "cắt cái gì đó + adj. Anh ấy đã cắt tóc rất ngắn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to remove something or a part of something, using a knife, etc.",
                    "vi": "để loại bỏ một cái gì đó hoặc một phần của cái gì đó, sử dụng một con dao, v.v."
                },
                "examples": [
                    {
                        "en": "cut something First, cut a long piece of string.",
                        "vi": "cắt một cái gì đó Đầu tiên, cắt một đoạn dây dài."
                    },
                    {
                        "en": "cut something from something He cut four thick slices from the loaf.",
                        "vi": "cắt một cái gì đó từ một cái gì đó Anh ta cắt bốn lát dày từ ổ bánh mì."
                    },
                    {
                        "en": "a bunch of cut flowers",
                        "vi": "một bó hoa cắt"
                    },
                    {
                        "en": "cut somebody something I cut them all a piece of birthday cake.",
                        "vi": "cắt cho ai đó một cái gì đó Tôi cắt tất cả họ một miếng bánh sinh nhật."
                    },
                    {
                        "en": "cut something for somebody I cut a piece of birthday cake for them all.",
                        "vi": "cắt một cái gì đó cho ai đó Tôi cắt một miếng bánh sinh nhật cho tất cả họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make or form something by removing material with a knife, etc.",
                    "vi": "để chế tạo hoặc hình thành thứ gì đó bằng cách dùng dao loại bỏ vật liệu, v.v."
                },
                "examples": [
                    {
                        "en": "cut something in something Workmen cut a hole in the pipe.",
                        "vi": "cắt một cái gì đó trong một cái gì đó Người thợ cắt một lỗ trên đường ống."
                    },
                    {
                        "en": "The climbers cut steps in the ice.",
                        "vi": "Những người leo núi cắt bước trong băng."
                    },
                    {
                        "en": "cut something into something homemade biscuits cut into heart shapes",
                        "vi": "cắt một cái gì đó thành một cái gì đó bánh quy tự làm cắt thành hình trái tim"
                    },
                    {
                        "en": "cut something Cut a circle of waxed paper to fit the bottom of the pan.",
                        "vi": "cắt một cái gì đó Cắt một vòng tròn bằng giấy sáp để vừa với đáy chảo."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be capable of cutting",
                    "vi": "có khả năng cắt"
                },
                "examples": [
                    {
                        "en": "This knife won't cut.",
                        "vi": "Con dao này sẽ không cắt."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be capable of being cut",
                    "vi": "có khả năng bị cắt"
                },
                "examples": [
                    {
                        "en": "Sandstone cuts easily.",
                        "vi": "Đá sa thạch cắt dễ dàng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to reduce something by removing a part of it",
                    "vi": "để giảm bớt thứ gì đó bằng cách loại bỏ một phần của nó"
                },
                "examples": [
                    {
                        "en": "cut something to cut costs/prices/spending/taxes",
                        "vi": "cắt giảm thứ gì đó để cắt giảm chi phí / giá cả / chi tiêu / thuế"
                    },
                    {
                        "en": "Buyers will bargain hard to cut the cost of the house they want.",
                        "vi": "Người mua sẽ khó mặc cả để cắt giảm giá thành của ngôi nhà mà họ muốn."
                    },
                    {
                        "en": "a plan to drastically cut emissions",
                        "vi": "một kế hoạch để cắt giảm đáng kể lượng khí thải"
                    },
                    {
                        "en": "cut something by… His salary has been cut by ten per cent.",
                        "vi": "cắt giảm thứ gì đó… Lương của anh ấy đã bị cắt giảm 10%."
                    },
                    {
                        "en": "cut something to… The Bank of England has cut interest rates to 1.5 per cent.",
                        "vi": "cắt giảm thứ gì đó để… Ngân hàng Trung ương Anh đã cắt giảm lãi suất xuống 1,5%."
                    },
                    {
                        "en": "cut something from… to… Could you cut your essay from 5 000 to 3 000 words?",
                        "vi": "cắt một cái gì đó từ… thành… Bạn có thể cắt bài luận của mình từ 5000 đến 3000 từ được không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to allow somebody to escape from somewhere by cutting the rope, object, etc. that is holding them",
                    "vi": "để cho phép ai đó trốn thoát khỏi một nơi nào đó bằng cách cắt dây, đồ vật, v.v. đang giữ họ"
                },
                "examples": [
                    {
                        "en": "cut somebody (from something) The injured driver had to be cut from the wreckage.",
                        "vi": "cắt ai đó (từ cái gì đó) Người lái xe bị thương phải được cắt khỏi đống đổ nát."
                    },
                    {
                        "en": "cut somebody + adj. Two survivors were cut free after being trapped for twenty minutes.",
                        "vi": "cắt ai đó + adj. Hai người sống sót đã được tự do sau khi bị mắc kẹt trong 20 phút."
                    }
                ]
            },
            {
                "define": {
                    "en": "to design and make a piece of clothing in a particular way",
                    "vi": "để thiết kế và may một bộ quần áo theo một cách cụ thể"
                },
                "examples": [
                    {
                        "en": "be cut + adj. The swimsuit was cut high in the leg.",
                        "vi": "được cắt + adj. Bộ áo tắm được xẻ cao ở phần chân."
                    }
                ]
            },
            {
                "define": {
                    "en": "to remove something from something",
                    "vi": "để loại bỏ một cái gì đó khỏi một cái gì đó"
                },
                "examples": [
                    {
                        "en": "This scene was cut from the final version of the movie.",
                        "vi": "Cảnh này đã bị cắt khỏi phiên bản cuối cùng của phim."
                    }
                ]
            },
            {
                "define": {
                    "en": "to delete (= remove) part of a text on a computer screen in order to place it somewhere else",
                    "vi": "để xóa (= remove) một phần của văn bản trên màn hình máy tính để đặt nó ở một nơi khác"
                },
                "examples": [
                    {
                        "en": "You can cut and paste between different programs.",
                        "vi": "Bạn có thể cắt và dán giữa các chương trình khác nhau."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to tell somebody to stop doing something",
                    "vi": "được sử dụng để nói với ai đó ngừng làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "Cut the chatter and get on with your work!",
                        "vi": "Hãy bỏ cuộc nói chuyện phiếm và tiếp tục với công việc của bạn!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to completely end a relationship or all communication with somebody",
                    "vi": "để kết thúc hoàn toàn một mối quan hệ hoặc tất cả các giao tiếp với ai đó"
                },
                "examples": [
                    {
                        "en": "She has cut all ties with her family.",
                        "vi": "Cô ấy đã cắt đứt mọi quan hệ với gia đình mình."
                    },
                    {
                        "en": "He has refused to cut links with these companies.",
                        "vi": "Ông đã từ chối cắt liên kết với các công ty này."
                    }
                ]
            },
            {
                "define": {
                    "en": "to prepare a film or tape by removing parts of it or putting them in a different order",
                    "vi": "để chuẩn bị một bộ phim hoặc băng bằng cách loại bỏ các bộ phận của nó hoặc đặt chúng theo một thứ tự khác"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to stop filming or recording",
                    "vi": "dừng quay phim hoặc ghi âm"
                },
                "examples": [
                    {
                        "en": "The director shouted ‘Cut!’",
                        "vi": "Đạo diễn hét lên 'Cắt!'"
                    }
                ]
            },
            {
                "define": {
                    "en": "to move quickly from one scene to another",
                    "vi": "để chuyển nhanh từ cảnh này sang cảnh khác"
                },
                "examples": [
                    {
                        "en": "The scene cuts from the bedroom to the street.",
                        "vi": "Cảnh cắt từ phòng ngủ ra ngoài đường."
                    }
                ]
            },
            {
                "define": {
                    "en": "to stay away from a class that you should go to",
                    "vi": "tránh xa một lớp học mà bạn nên đến"
                },
                "examples": [
                    {
                        "en": "He's always cutting class.",
                        "vi": "Anh ấy luôn cắt lớp."
                    }
                ]
            },
            {
                "define": {
                    "en": "to hurt somebody emotionally",
                    "vi": "làm tổn thương ai đó về mặt tình cảm"
                },
                "examples": [
                    {
                        "en": "His cruel remarks cut her deeply.",
                        "vi": "Những lời nhận xét tàn nhẫn của anh đã khiến cô bị tổn thương sâu sắc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to divide a pack of playing cards by lifting a section from the top, in order to reveal a card to decide who is to play first, etc.",
                    "vi": "để chia một gói bài chơi bằng cách nâng một phần từ trên xuống, để lộ một lá bài để quyết định ai là người chơi trước, v.v."
                },
                "examples": [
                    {
                        "en": "Let's cut for dealer.",
                        "vi": "Hãy cắt cho đại lý."
                    }
                ]
            },
            {
                "define": {
                    "en": "to cross another line",
                    "vi": "băng qua một đường khác"
                },
                "examples": [
                    {
                        "en": "The line cuts the circle at two points.",
                        "vi": "Đường thẳng cắt đường tròn tại hai điểm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have a new tooth beginning to appear through the gum",
                    "vi": "để có một chiếc răng mới bắt đầu nhú qua nướu"
                },
                "examples": [
                    {
                        "en": "When did she cut her first tooth?",
                        "vi": "Cô ấy cắt chiếc răng đầu tiên khi nào?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to make a sound recording on a record, CD, etc.",
                    "vi": "để thực hiện ghi âm trên bản ghi, CD, v.v."
                },
                "examples": [
                    {
                        "en": "The Beatles cut their first disc in 1962.",
                        "vi": "The Beatles cắt đĩa đầu tiên của họ vào năm 1962."
                    }
                ]
            },
            {
                "define": {
                    "en": "to mix an illegal drug such as heroin with another substance",
                    "vi": "trộn một loại thuốc bất hợp pháp như heroin với một chất khác"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to make a quick or sudden escape",
                    "vi": "để thực hiện một cuộc trốn thoát nhanh chóng hoặc đột ngột"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to (not) be as good as is expected or needed",
                    "vi": "để (không) tốt như mong đợi hoặc cần thiết"
                },
                "examples": [
                    {
                        "en": "He won't cut it as a professional singer.",
                        "vi": "Anh ấy sẽ không cắt nó như một ca sĩ chuyên nghiệp."
                    }
                ]
            }
        ]
    },
    {
        "id": "5f1b40b1944b4a438647d975503b350a",
        "word": "demo",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈdeməʊ/",
            "us": "/ˈdeməʊ/"
        },
        "nearby": [
            {
                "word": "demister",
                "pos": "noun"
            },
            {
                "word": "demiurge",
                "pos": "noun"
            },
            {
                "word": "demo",
                "pos": "noun"
            },
            {
                "word": "demo-",
                "pos": "prefix"
            },
            {
                "word": "demo",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a public meeting or a march (= an organized walk by many people) at which people show that they are protesting against or supporting somebody/something",
                    "vi": "một cuộc họp công khai hoặc một cuộc tuần hành (= một cuộc đi bộ có tổ chức của nhiều người) mà tại đó mọi người cho thấy rằng họ đang phản đối hoặc ủng hộ ai đó / điều gì đó"
                },
                "examples": [
                    {
                        "en": "They all went on the demo.",
                        "vi": "Tất cả đều đã đi vào bản demo."
                    }
                ]
            },
            {
                "define": {
                    "en": "a demonstration (= an act of showing or explaining how something works or is done)",
                    "vi": "một cuộc biểu tình (= một hành động thể hiện hoặc giải thích cách hoạt động hoặc được thực hiện của một cái gì đó)"
                },
                "examples": [
                    {
                        "en": "I'll give you a demo.",
                        "vi": "Tôi sẽ cung cấp cho bạn một bản demo."
                    }
                ]
            },
            {
                "define": {
                    "en": "a version of an app or computer program that you can try out before you buy the full program",
                    "vi": "phiên bản của ứng dụng hoặc chương trình máy tính mà bạn có thể dùng thử trước khi mua toàn bộ chương trình"
                },
                "examples": [
                    {
                        "en": "The full version costs £22.99, but there is a demo to try before you buy.",
                        "vi": "Phiên bản đầy đủ có giá 22,99 bảng Anh, nhưng có một bản demo để bạn dùng thử trước khi mua."
                    }
                ]
            },
            {
                "define": {
                    "en": "a recording of an example of somebody's music",
                    "vi": "bản ghi âm một ví dụ về âm nhạc của ai đó"
                },
                "examples": [
                    {
                        "en": "The band have uploaded three demo tracks recorded last month.",
                        "vi": "Ban nhạc đã tải lên ba bản demo thu âm vào tháng trước."
                    }
                ]
            },
            {
                "define": {
                    "en": "a demographic (= a section of the population who are of a similar age, the same sex, etc.)",
                    "vi": "nhân khẩu học (= một phần dân số ở cùng độ tuổi, cùng giới tính, v.v.)"
                },
                "examples": [
                    {
                        "en": "They're trying to appeal to a younger demo.",
                        "vi": "Họ đang cố gắng thu hút một bản demo trẻ hơn."
                    }
                ]
            }
        ]
    },
    {
        "id": "f4d3fd4edbfd44058fb3f6b87e496b75",
        "word": "laserdisc",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈleɪzədɪsk/",
            "us": "/ˈleɪzərdɪsk/"
        },
        "nearby": [
            {
                "word": "lasciviousness",
                "pos": "noun"
            },
            {
                "word": "laser",
                "pos": "noun"
            },
            {
                "word": "laserdisc",
                "pos": "noun"
            },
            {
                "word": "laser gun",
                "pos": "noun"
            },
            {
                "word": "laser printer",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a plastic disc like a large CD on which large amounts of information, such as video or music, can be stored, now generally replaced by the DVD",
                    "vi": "một đĩa nhựa giống như một đĩa CD lớn có thể lưu trữ một lượng lớn thông tin, chẳng hạn như video hoặc nhạc, hiện nay thường được thay thế bằng DVD"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "d2c99347e3cf4d61957f997d1772b912",
        "word": "mono",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmɒnəʊ/",
            "us": "/ˈmɑːnəʊ/"
        },
        "nearby": [
            {
                "word": "monkish",
                "pos": "adjective"
            },
            {
                "word": "the Duke of Monmouth",
                "pos": ""
            },
            {
                "word": "mono",
                "pos": "adjective"
            },
            {
                "word": "mono",
                "pos": "noun"
            },
            {
                "word": "mono-",
                "pos": "combining form"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "recording or producing sound that comes from only one direction",
                    "vi": "ghi âm hoặc tạo ra âm thanh chỉ phát ra từ một hướng"
                },
                "examples": [
                    {
                        "en": "a mono recording",
                        "vi": "một bản ghi đơn âm"
                    }
                ]
            }
        ]
    },
    {
        "id": "aff48bf1b11842bbbc0dd061c170e852",
        "word": "monophonic",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌmɒnəˈfɒnɪk/",
            "us": "/ˌmɑːnəˈfɑːnɪk/"
        },
        "nearby": [
            {
                "word": "monomer",
                "pos": "noun"
            },
            {
                "word": "mononucleosis",
                "pos": "noun"
            },
            {
                "word": "monophonic",
                "pos": "adjective"
            },
            {
                "word": "monophthong",
                "pos": "noun"
            },
            {
                "word": "monophthongal",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "recording or producing sound that comes from only one direction",
                    "vi": "ghi âm hoặc tạo ra âm thanh chỉ phát ra từ một hướng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "65c66656e32045dc94711fe5794c7141",
        "word": "post-production",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌpəʊst prəˈdʌkʃn/",
            "us": "/ˌpəʊst prəˈdʌkʃn/"
        },
        "nearby": [
            {
                "word": "postpositional",
                "pos": "adjective"
            },
            {
                "word": "postprandial",
                "pos": "adjective"
            },
            {
                "word": "post-production",
                "pos": "adjective"
            },
            {
                "word": "post-production",
                "pos": "noun"
            },
            {
                "word": "post room",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "post-production work on music or on films is done after recording or filming",
                    "vi": "công việc hậu kỳ về âm nhạc hoặc phim được thực hiện sau khi thu âm hoặc quay phim"
                },
                "examples": [
                    {
                        "en": "post-production editing",
                        "vi": "chỉnh sửa hậu kỳ"
                    }
                ]
            }
        ]
    },
    {
        "id": "2837cd4ce67248958ea20ffa8dbea7ce",
        "word": "remix",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈriːmɪks/",
            "us": "/ˈriːmɪks/"
        },
        "nearby": [
            {
                "word": "remittance",
                "pos": "noun"
            },
            {
                "word": "remit to",
                "pos": "phrasal verb"
            },
            {
                "word": "remix",
                "pos": "noun"
            },
            {
                "word": "remix",
                "pos": "verb"
            },
            {
                "word": "remixer",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a new version of a recorded piece of music made by using a machine to arrange the separate parts of the recording in a different way, add new parts, etc.",
                    "vi": "một phiên bản mới của bản nhạc đã ghi được thực hiện bằng cách sử dụng máy để sắp xếp các phần riêng biệt của bản ghi theo một cách khác, thêm các phần mới, v.v."
                },
                "examples": [
                    {
                        "en": "a remix of their first single",
                        "vi": "một bản phối lại của đĩa đơn đầu tiên của họ"
                    },
                    {
                        "en": "an Elton John remix",
                        "vi": "một bản phối lại của Elton John"
                    }
                ]
            }
        ]
    },
    {
        "id": "e5fcadbcc2924a228bf3807a30bd268d",
        "word": "remix",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌriːˈmɪks/",
            "us": "/ˌriːˈmɪks/"
        },
        "nearby": [
            {
                "word": "remit to",
                "pos": "phrasal verb"
            },
            {
                "word": "remix",
                "pos": "noun"
            },
            {
                "word": "remix",
                "pos": "verb"
            },
            {
                "word": "remixer",
                "pos": "noun"
            },
            {
                "word": "remnant",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to make a new version of a recorded piece of music by using a machine to arrange the separate parts of the recording in a different way, add new parts, etc.",
                    "vi": "để tạo phiên bản mới của bản nhạc đã ghi bằng cách sử dụng máy để sắp xếp các phần riêng biệt của bản ghi theo một cách khác, thêm các phần mới, v.v."
                },
                "examples": [
                    {
                        "en": "The band have released a remixed version of their first single.",
                        "vi": "Ban nhạc đã phát hành một phiên bản phối lại của đĩa đơn đầu tiên của họ."
                    }
                ]
            }
        ]
    },
    {
        "id": "7a923f89503540d8877ee9364fe3ca7d",
        "word": "repertoire",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈrepətwɑː(r)/",
            "us": "/ˈrepərtwɑːr/"
        },
        "nearby": [
            {
                "word": "repentant",
                "pos": "adjective"
            },
            {
                "word": "repercussion",
                "pos": "noun"
            },
            {
                "word": "repertoire",
                "pos": "noun"
            },
            {
                "word": "repertory",
                "pos": "noun"
            },
            {
                "word": "repetition",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "all the plays, songs, pieces of music, etc. that a performer knows and can perform",
                    "vi": "tất cả các vở kịch, bài hát, bản nhạc, v.v. mà người biểu diễn biết và có thể biểu diễn"
                },
                "examples": [
                    {
                        "en": "to add to/extend your repertoire",
                        "vi": "để thêm vào / mở rộng tiết mục của bạn"
                    },
                    {
                        "en": "a pianist with a wide repertoire",
                        "vi": "một nghệ sĩ dương cầm với nhiều tiết mục"
                    }
                ]
            },
            {
                "define": {
                    "en": "all the things that a person is able to do",
                    "vi": "tất cả những điều mà một người có thể làm"
                },
                "examples": [
                    {
                        "en": "a young child’s growing verbal repertoire",
                        "vi": "tiết mục bằng lời nói đang lớn của trẻ nhỏ"
                    }
                ]
            }
        ]
    },
    {
        "id": "18857f19e2364acbb7de9d213bac5b51",
        "word": "sample",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsɑːmpl/",
            "us": "/ˈsæmpl/"
        },
        "nearby": [
            {
                "word": "sampan",
                "pos": "noun"
            },
            {
                "word": "samphire",
                "pos": "noun"
            },
            {
                "word": "sample",
                "pos": "noun"
            },
            {
                "word": "sample",
                "pos": "verb"
            },
            {
                "word": "sampler",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a number of people or things taken from a larger group and used in tests to provide information about the group",
                    "vi": "một số người hoặc những thứ được lấy từ một nhóm lớn hơn và được sử dụng trong các bài kiểm tra để cung cấp thông tin về nhóm"
                },
                "examples": [
                    {
                        "en": "The interviews were given to a random sample of students.",
                        "vi": "Các cuộc phỏng vấn được thực hiện cho một mẫu sinh viên ngẫu nhiên."
                    },
                    {
                        "en": "The survey covers a representative sample of schools.",
                        "vi": "Cuộc khảo sát bao gồm một mẫu đại diện của các trường học."
                    },
                    {
                        "en": "a sample survey",
                        "vi": "một cuộc khảo sát mẫu"
                    },
                    {
                        "en": "The current study has a larger sample size than earlier studies.",
                        "vi": "Nghiên cứu hiện tại có kích thước mẫu lớn hơn các nghiên cứu trước đó."
                    },
                    {
                        "en": "We studied a large population sample.",
                        "vi": "Chúng tôi đã nghiên cứu một mẫu dân số lớn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a small amount of a substance taken from a larger amount and tested in order to obtain information about the substance",
                    "vi": "một lượng nhỏ của một chất được lấy từ một lượng lớn hơn và được thử nghiệm để có được thông tin về chất đó"
                },
                "examples": [
                    {
                        "en": "a blood/urine/tissue/DNA sample",
                        "vi": "mẫu máu / nước tiểu / mô / DNA"
                    },
                    {
                        "en": "sample of something Samples of the water contained pesticide.",
                        "vi": "mẫu của cái gì đó Mẫu nước có chứa thuốc trừ sâu."
                    },
                    {
                        "en": "A small sample of blood must be tested by a doctor.",
                        "vi": "Một mẫu máu nhỏ phải được bác sĩ xét nghiệm."
                    },
                    {
                        "en": "to collect/obtain/take a sample",
                        "vi": "để thu thập / lấy / lấy mẫu"
                    },
                    {
                        "en": "We analyzed samples from more than a dozen common tree species.",
                        "vi": "Chúng tôi đã phân tích các mẫu từ hơn một chục loài cây phổ biến."
                    },
                    {
                        "en": "Her sample contained traces of the banned steroid.",
                        "vi": "Mẫu của cô ấy có dấu vết của steroid bị cấm."
                    }
                ]
            },
            {
                "define": {
                    "en": "a small amount or example of something that can be looked at or tried to see what it is like",
                    "vi": "một số lượng nhỏ hoặc ví dụ về một cái gì đó có thể được xem xét hoặc thử để xem nó như thế nào"
                },
                "examples": [
                    {
                        "en": "‘I'd like to see a sample of your work,’ said the manager.",
                        "vi": "Tôi muốn xem một mẫu tác phẩm của bạn, người quản lý nói."
                    },
                    {
                        "en": "a free sample of shampoo",
                        "vi": "một mẫu dầu gội đầu miễn phí"
                    },
                    {
                        "en": "Would you like a sample of the fabric to take home?",
                        "vi": "Bạn có muốn lấy mẫu vải mang về nhà không?"
                    },
                    {
                        "en": "We looked at sample books to choose the fabric.",
                        "vi": "Chúng tôi xem sách mẫu để chọn vải."
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of recorded music or sound that is used in a new piece of music",
                    "vi": "một đoạn nhạc đã ghi hoặc âm thanh được sử dụng trong một bản nhạc mới"
                },
                "examples": [
                    {
                        "en": "‘Candy’ includes a swirling sample from a Walker Brothers song.",
                        "vi": "Candy' bao gồm một mẫu xoáy từ một bài hát của Walker Brothers."
                    }
                ]
            }
        ]
    },
    {
        "id": "e6e4c7d6041848d49133a50ca322b7f8",
        "word": "sample",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsɑːmpl/",
            "us": "/ˈsæmpl/"
        },
        "nearby": [
            {
                "word": "samphire",
                "pos": "noun"
            },
            {
                "word": "sample",
                "pos": "noun"
            },
            {
                "word": "sample",
                "pos": "verb"
            },
            {
                "word": "sampler",
                "pos": "noun"
            },
            {
                "word": "sampling",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to try a small amount of a particular food to see what it is like; to experience something for a short time to see what it is like",
                    "vi": "thử một lượng nhỏ của một loại thực phẩm cụ thể để xem nó như thế nào; trải nghiệm điều gì đó trong một thời gian ngắn để xem nó như thế nào"
                },
                "examples": [
                    {
                        "en": "I sampled the delights of Greek cooking for the first time.",
                        "vi": "Lần đầu tiên tôi thưởng thức món ăn ngon của người Hy Lạp."
                    },
                    {
                        "en": "He put his head out of the window and sampled the morning air.",
                        "vi": "Anh đặt đầu ra ngoài cửa sổ và thưởng thức không khí buổi sáng."
                    },
                    {
                        "en": "We simply had to stop and sample some road-side cuisine.",
                        "vi": "Chúng tôi chỉ cần dừng lại và nếm thử một số món ăn ven đường."
                    }
                ]
            },
            {
                "define": {
                    "en": "to test, question, etc., part of something or of a group of people in order to find out what the rest is like",
                    "vi": "để kiểm tra, đặt câu hỏi, v.v., một phần của điều gì đó hoặc của một nhóm người để tìm hiểu xem phần còn lại như thế nào"
                },
                "examples": [
                    {
                        "en": "12 per cent of the children sampled said they prefer cats to dogs.",
                        "vi": "12% trẻ em được lấy mẫu cho biết chúng thích mèo hơn chó."
                    },
                    {
                        "en": "The survey was done using a group of 100 children randomly sampled from the school population.",
                        "vi": "Cuộc khảo sát được thực hiện bằng cách sử dụng một nhóm 100 trẻ em được lấy mẫu ngẫu nhiên từ học sinh của trường."
                    }
                ]
            },
            {
                "define": {
                    "en": "to record part of a piece of music, or a sound, in order to use it in a new piece of music",
                    "vi": "để ghi lại một phần của một bản nhạc hoặc một âm thanh, để sử dụng nó trong một bản nhạc mới"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "44f3b2ba748d483e9573774f4ec58b74",
        "word": "sampling",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsɑːmplɪŋ/",
            "us": "/ˈsæmplɪŋ/"
        },
        "nearby": [
            {
                "word": "sample",
                "pos": "verb"
            },
            {
                "word": "sampler",
                "pos": "noun"
            },
            {
                "word": "sampling",
                "pos": "noun"
            },
            {
                "word": "sampling error",
                "pos": "noun"
            },
            {
                "word": "Samuel",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the process of taking a sample",
                    "vi": "quá trình lấy mẫu"
                },
                "examples": [
                    {
                        "en": "statistical sampling",
                        "vi": "Lấy mẫu thống kê"
                    }
                ]
            },
            {
                "define": {
                    "en": "the process of copying and recording parts of a piece of music in an electronic form so that they can be used in a different piece of music",
                    "vi": "quá trình sao chép và ghi lại các phần của một bản nhạc ở dạng điện tử để chúng có thể được sử dụng trong một bản nhạc khác"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "97ce5444d30e4148ab045667275b2490",
        "word": "sequencer",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsiːkwənsə(r)/",
            "us": "/ˈsiːkwənsər/"
        },
        "nearby": [
            {
                "word": "sequence",
                "pos": "verb"
            },
            {
                "word": "the sequence of tenses",
                "pos": "noun"
            },
            {
                "word": "sequencer",
                "pos": "noun"
            },
            {
                "word": "sequencing",
                "pos": "noun"
            },
            {
                "word": "sequential",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an electronic instrument for recording and storing sounds so that they can be played later as part of a piece of music",
                    "vi": "một công cụ điện tử để ghi và lưu trữ âm thanh để chúng có thể được phát sau này như một phần của bản nhạc"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "81c3da28538f452e86cfb80edf4829a4",
        "word": "soundcheck",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsaʊndtʃek/",
            "us": "/ˈsaʊndtʃek/"
        },
        "nearby": [
            {
                "word": "soundbox",
                "pos": "noun"
            },
            {
                "word": "sound card",
                "pos": "noun"
            },
            {
                "word": "soundcheck",
                "pos": "noun"
            },
            {
                "word": "sound effect",
                "pos": "noun"
            },
            {
                "word": "sound engineer",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a process of checking that the equipment used for recording music, or for playing music at a concert, is working correctly and producing sound of a good quality",
                    "vi": "quy trình kiểm tra xem thiết bị được sử dụng để ghi âm nhạc hoặc chơi nhạc tại một buổi hòa nhạc có hoạt động chính xác và tạo ra âm thanh có chất lượng tốt hay không"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "f89a40cea5474f13bd31b47f0d69ecce",
        "word": "tune up",
        "pos": "phrasal verb",
        "level": "c2",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "tuner",
                "pos": "noun"
            },
            {
                "word": "tunesmith",
                "pos": "noun"
            },
            {
                "word": "tune up",
                "pos": "phrasal verb"
            },
            {
                "word": "tungsten",
                "pos": "noun"
            },
            {
                "word": "tunic",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to make changes to a musical instrument so that it plays at the correct pitch",
                    "vi": "để thực hiện các thay đổi đối với một nhạc cụ để nó phát ở cao độ chính xác"
                },
                "examples": [
                    {
                        "en": "The orchestra was tuning up as we entered the hall.",
                        "vi": "Dàn nhạc đã được điều chỉnh khi chúng tôi bước vào hội trường."
                    }
                ]
            }
        ]
    }
]