[
    {
        "id": "7973aeb4f42c4dfcbb62a5a4f000085c",
        "word": "reserve",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/rɪˈzɜːv/",
            "us": "/rɪˈzɜːrv/"
        },
        "nearby": [
            {
                "word": "reservation",
                "pos": "noun"
            },
            {
                "word": "reservation policy",
                "pos": "noun"
            },
            {
                "word": "reserve",
                "pos": "noun"
            },
            {
                "word": "reserve",
                "pos": "verb"
            },
            {
                "word": "reserve bank",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a supply of something that is available to be used in the future or when it is needed",
                    "vi": "nguồn cung cấp thứ gì đó có sẵn để sử dụng trong tương lai hoặc khi cần"
                },
                "examples": [
                    {
                        "en": "cash/foreign currency reserves",
                        "vi": "dự trữ tiền mặt / ngoại tệ"
                    },
                    {
                        "en": "large oil and gas reserves",
                        "vi": "trữ lượng dầu khí lớn"
                    },
                    {
                        "en": "reserve funds",
                        "vi": "quỹ dự trữ"
                    },
                    {
                        "en": "reserve of something He discovered unexpected reserves of strength.",
                        "vi": "dự trữ của một cái gì đó Ông đã khám phá ra nguồn dự trữ sức mạnh bất ngờ."
                    },
                    {
                        "en": "The country has the world's largest reserves of coal.",
                        "vi": "Nước này có trữ lượng than lớn nhất thế giới."
                    },
                    {
                        "en": "The company has substantial reserves of capital.",
                        "vi": "Công ty có nguồn vốn dự trữ đáng kể."
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of land that is a protected area for animals, plants, etc.",
                    "vi": "mảnh đất là khu bảo tồn động vật, thực vật, v.v."
                },
                "examples": [
                    {
                        "en": "a wildlife/forest reserve",
                        "vi": "khu bảo tồn động vật hoang dã / rừng"
                    }
                ]
            },
            {
                "define": {
                    "en": "an area of land in the US that is kept separate for Native Americans to live in",
                    "vi": "một khu vực đất ở Hoa Kỳ được giữ riêng biệt cho người Mỹ bản địa sinh sống"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the quality that somebody has when they do not talk easily to other people about their ideas, feelings, etc.",
                    "vi": "phẩm chất mà ai đó có khi họ không dễ dàng nói chuyện với người khác về ý tưởng, cảm xúc của họ, v.v."
                },
                "examples": [
                    {
                        "en": "She found it difficult to make friends because of her natural reserve.",
                        "vi": "Cô cảm thấy khó kết bạn vì tính dự trữ tự nhiên của mình."
                    },
                    {
                        "en": "Jaime always talked to people without reserve.",
                        "vi": "Jaime luôn nói chuyện với mọi người mà không cần dự trữ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a feeling that you do not want to accept or agree to something, etc. until you are quite sure that it is all right to do so",
                    "vi": "cảm giác rằng bạn không muốn chấp nhận hoặc đồng ý với điều gì đó, v.v. cho đến khi bạn chắc chắn rằng làm như vậy là ổn"
                },
                "examples": [
                    {
                        "en": "with reserve Any contract should be treated with reserve until it has been checked.",
                        "vi": "có dự trữ Mọi hợp đồng nên được xử lý bằng dự trữ cho đến khi nó được kiểm tra."
                    },
                    {
                        "en": "without reserve She trusted him without reserve (= completely).",
                        "vi": "không có dự trữ Cô ấy tin tưởng anh ấy mà không cần dự trữ (= hoàn toàn)."
                    }
                ]
            },
            {
                "define": {
                    "en": "an extra player who plays in a team when one of the other players is injured or not available to play",
                    "vi": "một người chơi bổ sung chơi trong một đội khi một trong những người chơi khác bị thương hoặc không có mặt để thi đấu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a team that is below the level of the main team",
                    "vi": "một đội dưới cấp của đội chính"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "an extra military force, etc. that is not part of a country’s regular forces, but is available to be used when needed",
                    "vi": "một lực lượng quân sự bổ sung, v.v. không thuộc lực lượng chính quy của một quốc gia, nhưng sẵn sàng sử dụng khi cần thiết"
                },
                "examples": [
                    {
                        "en": "the Army Reserve",
                        "vi": "quân dự bị"
                    },
                    {
                        "en": "the reserve police",
                        "vi": "cảnh sát dự bị"
                    }
                ]
            },
            {
                "define": {
                    "en": "the lowest price that somebody will accept for something, especially something that is sold at an auction",
                    "vi": "mức giá thấp nhất mà ai đó sẽ chấp nhận cho một thứ gì đó, đặc biệt là thứ được bán trong một cuộc đấu giá"
                },
                "examples": [
                    {
                        "en": "The painting failed to reach to its reserve and was withdrawn from the sale.",
                        "vi": "Bức tranh đã không đạt được mức dự trữ và đã bị thu hồi khỏi việc bán."
                    }
                ]
            },
            {
                "define": {
                    "en": "available to be used in the future or when needed",
                    "vi": "có sẵn để sử dụng trong tương lai hoặc khi cần thiết"
                },
                "examples": [
                    {
                        "en": "The money was being kept in reserve for their retirement.",
                        "vi": "Số tiền đã được giữ để dự trữ cho thời gian nghỉ hưu của họ."
                    },
                    {
                        "en": "200 police officers were held in reserve.",
                        "vi": "200 sĩ quan cảnh sát được giữ trong lực lượng dự bị."
                    }
                ]
            }
        ]
    },
    {
        "id": "5aea2cdb4fbc44f9832be001fa681b70",
        "word": "shuttlecock",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈʃʌtlkɒk/",
            "us": "/ˈʃʌtlkɑːk/"
        },
        "nearby": [
            {
                "word": "shuttle",
                "pos": "noun"
            },
            {
                "word": "shuttle",
                "pos": "verb"
            },
            {
                "word": "shuttlecock",
                "pos": "noun"
            },
            {
                "word": "shuttle diplomacy",
                "pos": "noun"
            },
            {
                "word": "shuttler",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the object that players hit backwards and forwards in the game of badminton",
                    "vi": "vật thể mà người chơi đánh qua lại trong trò chơi cầu lông"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c1c0fb18326c4b22b542ef742fe28d7c",
        "word": "softball",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsɒftbɔːl/",
            "us": "/ˈsɔːftbɔːl/"
        },
        "nearby": [
            {
                "word": "soft-shoe",
                "pos": "verb"
            },
            {
                "word": "soft",
                "pos": "adjective"
            },
            {
                "word": "softball",
                "pos": "noun"
            },
            {
                "word": "soft-boiled",
                "pos": "adjective"
            },
            {
                "word": "soft centre",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a game similar to baseball but played on a smaller field with a larger, softer ball",
                    "vi": "một trò chơi tương tự như bóng chày nhưng được chơi trên một sân nhỏ hơn với một quả bóng lớn hơn, mềm hơn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the ball used in softball",
                    "vi": "bóng được sử dụng trong bóng mềm"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "06c551788f8741c9933f9944bff51067",
        "word": "stand",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/stænd/",
            "us": "/stænd/"
        },
        "nearby": [
            {
                "word": "stand-up",
                "pos": "noun"
            },
            {
                "word": "stand",
                "pos": "verb"
            },
            {
                "word": "stand",
                "pos": "noun"
            },
            {
                "word": "stand-alone",
                "pos": "adjective"
            },
            {
                "word": "stand apart from",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an attitude towards something or an opinion that you make clear to people",
                    "vi": "thái độ đối với điều gì đó hoặc ý kiến mà bạn nói rõ với mọi người"
                },
                "examples": [
                    {
                        "en": "He has avoided taking a firm stand.",
                        "vi": "Anh ấy đã tránh lập trường vững vàng."
                    },
                    {
                        "en": "stand on something The judge takes a tough stand on corruption.",
                        "vi": "đứng về một cái gì đó Thẩm phán có quan điểm cứng rắn về tham nhũng."
                    },
                    {
                        "en": "stand against something I admire their principled stand against the war.",
                        "vi": "chống lại một cái gì đó mà tôi ngưỡng mộ lập trường nguyên tắc của họ chống lại chiến tranh."
                    }
                ]
            },
            {
                "define": {
                    "en": "a strong effort to defend yourself or your opinion about something",
                    "vi": "nỗ lực mạnh mẽ để bảo vệ bản thân hoặc ý kiến của bạn về điều gì đó"
                },
                "examples": [
                    {
                        "en": "They are willing to take a stand and defend what they believe in.",
                        "vi": "Họ sẵn sàng giữ vững lập trường và bảo vệ những gì họ tin tưởng."
                    },
                    {
                        "en": "stand against something We must make a stand against job losses.",
                        "vi": "chống lại điều gì đó Chúng ta phải có lập trường chống lại tình trạng mất việc làm."
                    },
                    {
                        "en": "the rebels’ desperate last stand",
                        "vi": "chỗ đứng cuối cùng tuyệt vọng của phiến quân"
                    }
                ]
            },
            {
                "define": {
                    "en": "a table or structure that goods are sold from, especially in the street or at a market",
                    "vi": "một bảng hoặc cấu trúc mà hàng hóa được bán, đặc biệt là trên đường phố hoặc ở chợ"
                },
                "examples": [
                    {
                        "en": "a lemonade/hot dog/newspaper stand",
                        "vi": "quầy nước chanh / xúc xích / báo"
                    },
                    {
                        "en": "She sells fruit from a roadside stand.",
                        "vi": "Cô bán trái cây ở một quán ven đường."
                    },
                    {
                        "en": "The magazine sold out as soon as it hit the stands (= went on sale).",
                        "vi": "Tạp chí đã bán hết sạch ngay khi xuất hiện trên khán đài (= đã được bán)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a table or a vertical structure where things are displayed or advertised, for example at an exhibition",
                    "vi": "một cái bàn hoặc một cấu trúc thẳng đứng nơi mọi thứ được trưng bày hoặc quảng cáo, chẳng hạn như tại một cuộc triển lãm"
                },
                "examples": [
                    {
                        "en": "a display/an exhibition stand",
                        "vi": "một gian trưng bày / một triển lãm"
                    },
                    {
                        "en": "Oxford University Press’s stand at the book fair",
                        "vi": "Gian hàng của Nhà xuất bản Đại học Oxford tại hội chợ sách"
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of equipment or furniture that you use for holding a particular type of thing",
                    "vi": "một phần của thiết bị hoặc đồ nội thất mà bạn sử dụng để giữ một loại vật cụ thể"
                },
                "examples": [
                    {
                        "en": "a bicycle/microphone/cake stand",
                        "vi": "một chiếc xe đạp / micrô / giá bánh"
                    }
                ]
            },
            {
                "define": {
                    "en": "a large sloping structure at a stadium with rows where people sit or stand to watch the game",
                    "vi": "một cấu trúc dốc lớn ở sân vận động với các hàng nơi mọi người ngồi hoặc đứng để xem trận đấu"
                },
                "examples": [
                    {
                        "en": "We had seats in the east stand.",
                        "vi": "Chúng tôi đã có chỗ ngồi ở khán đài phía đông."
                    }
                ]
            },
            {
                "define": {
                    "en": "the place in court where people stand to give evidence",
                    "vi": "nơi tòa án nơi mọi người đứng để đưa ra bằng chứng"
                },
                "examples": [
                    {
                        "en": "He took the stand as the first witness.",
                        "vi": "Anh đứng ra làm nhân chứng đầu tiên."
                    }
                ]
            },
            {
                "define": {
                    "en": "the period of time in which two people who are batting (= hitting the ball) play together and score points",
                    "vi": "Khoảng thời gian mà hai người đánh bóng (= đánh bóng) chơi với nhau và ghi điểm"
                },
                "examples": [
                    {
                        "en": "Clinch and Harris shared an opening stand of 69.",
                        "vi": "Clinch và Harris chia sẻ điểm mở màn là 69."
                    }
                ]
            },
            {
                "define": {
                    "en": "a place where taxis, buses, etc. park while they are waiting for passengers",
                    "vi": "nơi mà taxi, xe buýt, v.v. đậu trong khi họ đang đợi hành khách"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a group of plants or trees of one kind",
                    "vi": "một nhóm cây hoặc một loại cây"
                },
                "examples": [
                    {
                        "en": "a stand of pines",
                        "vi": "một giá đỡ của cây thông"
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of land that you can buy and use for building a house, etc. on",
                    "vi": "một mảnh đất mà bạn có thể mua và sử dụng để xây nhà, v.v."
                },
                "examples": [
                    {
                        "en": "A developer bought the land and divided it into stands.",
                        "vi": "Một nhà phát triển đã mua khu đất và chia nó thành các gian hàng."
                    }
                ]
            }
        ]
    },
    {
        "id": "37fb8597cb7b4f32b9d51eddcc063a1e",
        "word": "stoppage",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈstɒpɪdʒ/",
            "us": "/ˈstɑːpɪdʒ/"
        },
        "nearby": [
            {
                "word": "stop over",
                "pos": "phrasal verb"
            },
            {
                "word": "stopover",
                "pos": "noun"
            },
            {
                "word": "stoppage",
                "pos": "noun"
            },
            {
                "word": "stopper",
                "pos": "noun"
            },
            {
                "word": "stopper",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a situation in which people stop working as part of a protest or strike",
                    "vi": "một tình huống trong đó mọi người ngừng làm việc như một phần của cuộc biểu tình hoặc đình công"
                },
                "examples": [
                    {
                        "en": "400 workers were involved in the stoppage.",
                        "vi": "400 công nhân đã tham gia vào việc ngừng hoạt động."
                    },
                    {
                        "en": "a two-day stoppage by train drivers",
                        "vi": "hai ngày dừng lại của lái tàu"
                    }
                ]
            },
            {
                "define": {
                    "en": "a situation in which a game is interrupted for a particular reason",
                    "vi": "một tình huống trong đó trò chơi bị gián đoạn vì một lý do cụ thể"
                },
                "examples": [
                    {
                        "en": "Play resumed quickly after the stoppage.",
                        "vi": "Chơi tiếp tục nhanh chóng sau khi dừng."
                    },
                    {
                        "en": "stoppage time (= added on at the end of the game if there have been stoppages)",
                        "vi": "thời gian dừng (= được thêm vào khi kết thúc trò chơi nếu có khoảng dừng)"
                    }
                ]
            },
            {
                "define": {
                    "en": "a situation in which something does not move forward or is blocked",
                    "vi": "một tình huống trong đó một cái gì đó không tiến lên phía trước hoặc bị chặn"
                },
                "examples": [
                    {
                        "en": "a stoppage of blood to the heart",
                        "vi": "máu đến tim ngừng trệ"
                    }
                ]
            },
            {
                "define": {
                    "en": "an amount of money that an employer takes from people’s wages for tax and other payments",
                    "vi": "một số tiền mà người sử dụng lao động lấy từ tiền lương của mọi người để trả thuế và các khoản thanh toán khác"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "b92d1b9558fb4b31873063008c8b4a40",
        "word": "strike rate",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈstraɪk reɪt/",
            "us": "/ˈstraɪk reɪt/"
        },
        "nearby": [
            {
                "word": "strikeout",
                "pos": "noun"
            },
            {
                "word": "striker",
                "pos": "noun"
            },
            {
                "word": "strike rate",
                "pos": "noun"
            },
            {
                "word": "strike through",
                "pos": "phrasal verb"
            },
            {
                "word": "strike up",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the number of times a player is successful in relation to the number of times they try to score or win",
                    "vi": "số lần một người chơi thành công liên quan đến số lần họ cố gắng ghi bàn hoặc giành chiến thắng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "bfe60074228a4bf8b70c998d5cca0a3c",
        "word": "strip",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/strɪp/",
            "us": "/strɪp/"
        },
        "nearby": [
            {
                "word": "string vest",
                "pos": "noun"
            },
            {
                "word": "stringy",
                "pos": "adjective"
            },
            {
                "word": "strip",
                "pos": "noun"
            },
            {
                "word": "strip",
                "pos": "verb"
            },
            {
                "word": "the Strip",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a long narrow piece of paper, metal, cloth, etc.",
                    "vi": "một mảnh giấy dài hẹp, kim loại, vải, v.v."
                },
                "examples": [
                    {
                        "en": "a strip of material",
                        "vi": "một dải vật liệu"
                    },
                    {
                        "en": "Cut the meat into strips.",
                        "vi": "Cắt thịt thành từng dải."
                    }
                ]
            },
            {
                "define": {
                    "en": "a long narrow area of land, sea, etc.",
                    "vi": "một vùng đất, biển dài hẹp, v.v."
                },
                "examples": [
                    {
                        "en": "the Gaza Strip",
                        "vi": "Dải Gaza"
                    },
                    {
                        "en": "a tiny strip of garden",
                        "vi": "một dải vườn nhỏ"
                    },
                    {
                        "en": "The islands are separated by a narrow strip of water.",
                        "vi": "Các hòn đảo được ngăn cách bởi một dải nước hẹp."
                    }
                ]
            },
            {
                "define": {
                    "en": "the uniform that is worn by the members of a sports team when they are playing",
                    "vi": "đồng phục được các thành viên của đội thể thao mặc khi họ thi đấu"
                },
                "examples": [
                    {
                        "en": "Juventus in their famous black and white strip",
                        "vi": "Juventus trong dải đen trắng nổi tiếng của họ"
                    },
                    {
                        "en": "the team’s away strip (= that they use when playing games away from home)",
                        "vi": "dải sân khách của đội (= mà họ sử dụng khi chơi trò chơi xa nhà)"
                    }
                ]
            },
            {
                "define": {
                    "en": "an act of taking your clothes off, especially in a sexually exciting way and in front of an audience",
                    "vi": "một hành động cởi bỏ quần áo của bạn, đặc biệt là theo cách kích thích tình dục và trước mặt khán giả"
                },
                "examples": [
                    {
                        "en": "to do a strip",
                        "vi": "để làm một dải"
                    },
                    {
                        "en": "a strip show",
                        "vi": "một chương trình thoát y"
                    }
                ]
            },
            {
                "define": {
                    "en": "a street that has many shops, stores, restaurants, etc. along it",
                    "vi": "một con phố có nhiều cửa hàng, cửa hiệu, nhà hàng, v.v. dọc theo nó"
                },
                "examples": [
                    {
                        "en": "Sunset Strip",
                        "vi": "Dải Hoàng hôn"
                    }
                ]
            },
            {
                "define": {
                    "en": "a series of drawings inside boxes that tell a story and are often published in newspapers",
                    "vi": "một loạt các bức vẽ bên trong hộp kể một câu chuyện và thường được đăng trên báo"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to speak angrily to somebody who has done something wrong",
                    "vi": "giận dữ nói chuyện với ai đó đã làm điều gì đó sai trái"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "752864b0c4804a2cb657f9d1e35b4d48",
        "word": "tourney",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈtʊəni/",
            "us": "/ˈtʊrni/"
        },
        "nearby": [
            {
                "word": "touristy",
                "pos": "adjective"
            },
            {
                "word": "tournament",
                "pos": "noun"
            },
            {
                "word": "tourney",
                "pos": "noun"
            },
            {
                "word": "tourniquet",
                "pos": "noun"
            },
            {
                "word": "the Tour of Britain",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a sports competition involving a number of teams or players who take part in different games and must leave the competition if they lose. The competition continues until there is only the winner left.",
                    "vi": "một cuộc thi thể thao có một số đội hoặc người chơi tham gia các trò chơi khác nhau và phải rời cuộc thi nếu họ thua. Cuộc thi tiếp tục cho đến khi chỉ còn lại người chiến thắng."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "1ba36cc8ee114b6eac46568f69d6e62e",
        "word": "unmarked",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌʌnˈmɑːkt/",
            "us": "/ˌʌnˈmɑːrkt/"
        },
        "nearby": [
            {
                "word": "unmanned",
                "pos": "adjective"
            },
            {
                "word": "unmannerly",
                "pos": "adjective"
            },
            {
                "word": "unmarked",
                "pos": "adjective"
            },
            {
                "word": "unmarried",
                "pos": "adjective"
            },
            {
                "word": "unmask",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "without a sign or words to show what or where something is",
                    "vi": "không có dấu hiệu hoặc từ ngữ để chỉ cái gì hoặc ở đâu"
                },
                "examples": [
                    {
                        "en": "an unmarked police car",
                        "vi": "một chiếc xe cảnh sát không có nhãn hiệu"
                    },
                    {
                        "en": "He was buried in an unmarked grave.",
                        "vi": "Ông đã được chôn cất trong một ngôi mộ không được đánh dấu."
                    }
                ]
            },
            {
                "define": {
                    "en": "with no player from the other team staying close to prevent them from getting the ball",
                    "vi": "không có cầu thủ nào của đội khác ở gần để ngăn họ lấy bóng"
                },
                "examples": [
                    {
                        "en": "He headed the ball to the unmarked Gray.",
                        "vi": "Anh đánh đầu tung lưới Hùm xám."
                    },
                    {
                        "en": "She was unmarked, six yards from goal.",
                        "vi": "Cô ấy không được đánh dấu, cách khung thành sáu thước."
                    }
                ]
            },
            {
                "define": {
                    "en": "not showing any particular feature or style, such as being formal or informal",
                    "vi": "không thể hiện bất kỳ tính năng hoặc phong cách cụ thể nào, chẳng hạn như trang trọng hoặc không chính thức"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "2a7bcb2a3e5a49dbb7c68da0ca7b4144",
        "word": "volley",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈvɒli/",
            "us": "/ˈvɑːli/"
        },
        "nearby": [
            {
                "word": "vole",
                "pos": "noun"
            },
            {
                "word": "volition",
                "pos": "noun"
            },
            {
                "word": "volley",
                "pos": "noun"
            },
            {
                "word": "volley",
                "pos": "verb"
            },
            {
                "word": "volleyball",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a hit or kick of the ball before it touches the ground",
                    "vi": "một cú đánh hoặc một cú đá của quả bóng trước khi nó chạm đất"
                },
                "examples": [
                    {
                        "en": "She hit a forehand volley into the net.",
                        "vi": "Cô ấy đánh một cú vô lê thuận tay vào lưới."
                    }
                ]
            },
            {
                "define": {
                    "en": "a lot of bullets, stones, etc. that are fired or thrown at the same time",
                    "vi": "nhiều viên đạn, đá, v.v. được bắn hoặc ném cùng một lúc"
                },
                "examples": [
                    {
                        "en": "A volley of shots rang out.",
                        "vi": "Một cú vô lê vang lên."
                    },
                    {
                        "en": "Police fired a volley over the heads of the crowd.",
                        "vi": "Cảnh sát bắn một cú vô lê qua đầu đám đông."
                    },
                    {
                        "en": "The police fired a volley of bullets over the heads of the crowd.",
                        "vi": "Cảnh sát đã bắn một loạt đạn qua đầu đám đông."
                    }
                ]
            },
            {
                "define": {
                    "en": "a lot of questions, comments, offensive remarks, etc. that are directed at somebody quickly one after the other",
                    "vi": "rất nhiều câu hỏi, nhận xét, nhận xét xúc phạm, v.v. nhắm vào người khác nhanh chóng, hết người này đến người khác"
                },
                "examples": [
                    {
                        "en": "She faced a volley of angry questions from her mother.",
                        "vi": "Cô phải đối mặt với vô số câu hỏi giận dữ từ mẹ mình."
                    }
                ]
            }
        ]
    },
    {
        "id": "716d8c90a2294306ad1880291a442e90",
        "word": "volley",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈvɒli/",
            "us": "/ˈvɑːli/"
        },
        "nearby": [
            {
                "word": "volition",
                "pos": "noun"
            },
            {
                "word": "volley",
                "pos": "noun"
            },
            {
                "word": "volley",
                "pos": "verb"
            },
            {
                "word": "volleyball",
                "pos": "noun"
            },
            {
                "word": "Volpone",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to hit or kick the ball before it touches the ground",
                    "vi": "đánh hoặc đá quả bóng trước khi nó chạm đất"
                },
                "examples": [
                    {
                        "en": "He volleyed the ball into the back of the net.",
                        "vi": "Anh vô lê đưa bóng đi chệch khung thành trong gang tấc."
                    }
                ]
            }
        ]
    },
    {
        "id": "5212a1d97780497484f629cba0251d91",
        "word": "wing",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/wɪŋ/",
            "us": "/wɪŋ/"
        },
        "nearby": [
            {
                "word": "wine vinegar",
                "pos": "noun"
            },
            {
                "word": "wine waiter",
                "pos": "noun"
            },
            {
                "word": "wing",
                "pos": "noun"
            },
            {
                "word": "wing",
                "pos": "verb"
            },
            {
                "word": "wing back",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "one of the parts of the body of a bird, insect or bat that it uses for flying",
                    "vi": "một trong những bộ phận trên cơ thể của chim, côn trùng hoặc dơi mà nó sử dụng để bay"
                },
                "examples": [
                    {
                        "en": "The swan flapped its wings noisily.",
                        "vi": "Con thiên nga vỗ cánh ồn ào."
                    },
                    {
                        "en": "wing feathers",
                        "vi": "lông cánh"
                    }
                ]
            },
            {
                "define": {
                    "en": "the wing of a chicken, etc. eaten as food",
                    "vi": "cánh của một con gà, v.v. được ăn làm thức ăn"
                },
                "examples": [
                    {
                        "en": "We ordered the fried chicken wings.",
                        "vi": "Chúng tôi gọi món cánh gà rán."
                    },
                    {
                        "en": "First, fry the chicken wings in the oil until they begin to brown.",
                        "vi": "Đầu tiên, chiên cánh gà trong dầu cho đến khi chúng bắt đầu chuyển sang màu nâu."
                    }
                ]
            },
            {
                "define": {
                    "en": "one of the large flat parts that stick out from the side of a plane and help to keep it in the air when it is flying",
                    "vi": "một trong những bộ phận phẳng lớn nhô ra khỏi thành bên của máy bay và giúp giữ nó trong không khí khi nó đang bay"
                },
                "examples": [
                    {
                        "en": "Salvage teams have been able to recover part of the wing of the plane.",
                        "vi": "Các đội trục vớt đã trục vớt được một phần cánh của máy bay."
                    },
                    {
                        "en": "The right wing grazed the runway on landing.",
                        "vi": "Cánh phải sượt qua đường băng khi hạ cánh."
                    }
                ]
            },
            {
                "define": {
                    "en": "a part of a large building that sticks out from the main part",
                    "vi": "một phần của tòa nhà lớn nhô ra khỏi phần chính"
                },
                "examples": [
                    {
                        "en": "the east wing",
                        "vi": "cánh đông"
                    },
                    {
                        "en": "the new wing of the hospital",
                        "vi": "cánh mới của bệnh viện"
                    },
                    {
                        "en": "Our rooms were in the west wing.",
                        "vi": "Phòng của chúng tôi ở cánh phía tây."
                    }
                ]
            },
            {
                "define": {
                    "en": "a part of a car that is above a wheel",
                    "vi": "một bộ phận của ô tô ở phía trên bánh xe"
                },
                "examples": [
                    {
                        "en": "There was a dent in the nearside wing.",
                        "vi": "Có một vết lõm ở cánh gần."
                    }
                ]
            },
            {
                "define": {
                    "en": "one section of an organization that has a particular function or whose members share the same opinions",
                    "vi": "một bộ phận của tổ chức có một chức năng cụ thể hoặc có các thành viên có cùng quan điểm"
                },
                "examples": [
                    {
                        "en": "The radical wing of the party was dissatisfied with the policies.",
                        "vi": "Cánh cấp tiến của đảng đã không hài lòng với các chính sách."
                    },
                    {
                        "en": "The political wing of the National Resistance Army entered into negotiations with the government.",
                        "vi": "Cánh chính trị của Quân đội Kháng chiến Quốc gia tham gia đàm phán với chính phủ."
                    },
                    {
                        "en": "They're on the left wing of the Labour Party.",
                        "vi": "Họ thuộc cánh trái của Đảng Lao động."
                    }
                ]
            },
            {
                "define": {
                    "en": "either of the attacking players who play towards the side of the playing area in sports such as football (soccer) or hockey",
                    "vi": "một trong các cầu thủ tấn công chơi về phía bên của khu vực chơi trong các môn thể thao như bóng đá (bóng đá) hoặc khúc côn cầu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the far left or right side of the sports field",
                    "vi": "ngoài cùng bên trái hoặc bên phải của sân thể thao"
                },
                "examples": [
                    {
                        "en": "He plays on the wing.",
                        "vi": "Anh ấy chơi ở cánh."
                    }
                ]
            },
            {
                "define": {
                    "en": "the area at either side of the stage that cannot be seen by the audience",
                    "vi": "khu vực ở hai bên của sân khấu mà khán giả không thể nhìn thấy"
                },
                "examples": [
                    {
                        "en": "She watched every performance from the wings.",
                        "vi": "Cô ấy theo dõi mọi màn trình diễn từ đôi cánh."
                    }
                ]
            },
            {
                "define": {
                    "en": "to limit a person’s freedom or power",
                    "vi": "để hạn chế quyền tự do hoặc quyền lực của một người"
                },
                "examples": [
                    {
                        "en": "Having a new baby to take care of has clipped her wings.",
                        "vi": "Có một em bé mới để chăm sóc đã chắp cánh cho cô ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to pass the exams that mean you are allowed to fly a plane",
                    "vi": "để vượt qua các kỳ thi có nghĩa là bạn được phép lái máy bay"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "ready to take over a particular job or be used in a particular situation when needed",
                    "vi": "sẵn sàng đảm nhận một công việc cụ thể hoặc được sử dụng trong một tình huống cụ thể khi cần thiết"
                },
                "examples": [
                    {
                        "en": "She was aware of a whole host of ambitious young managers waiting in the wings.",
                        "vi": "Cô nhận thức được rằng có rất nhiều nhà quản lý trẻ đầy tham vọng đang chờ đợi trong cánh."
                    },
                    {
                        "en": "There's a wealth of talent waiting in the wings of British theatre.",
                        "vi": "Có rất nhiều tài năng đang chờ đợi trong cánh của nhà hát Anh."
                    }
                ]
            },
            {
                "define": {
                    "en": "flying",
                    "vi": "bay"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "with only a very slight chance of success",
                    "vi": "chỉ với một cơ hội thành công rất nhỏ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to become more independent and confident and try new activities, etc.",
                    "vi": "để trở nên độc lập và tự tin hơn và thử các hoạt động mới, v.v."
                },
                "examples": [
                    {
                        "en": "Going to college gave her the chance to spread her wings.",
                        "vi": "Vào đại học đã cho cô cơ hội để chắp cánh cho mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to take care of and help somebody who has less experience of something than you",
                    "vi": "để chăm sóc và giúp đỡ ai đó có ít kinh nghiệm về điều gì đó hơn bạn"
                },
                "examples": [
                    {
                        "en": "Simon's uncle had taken him under his wing.",
                        "vi": "Chú của Simon đã đưa anh ta về dưới trướng của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to fly away",
                    "vi": "bay đi"
                },
                "examples": [
                    {
                        "en": "(figurative) Her imagination took wing.",
                        "vi": "(nghĩa bóng) Trí tưởng tượng của cô ấy đã thành công."
                    }
                ]
            }
        ]
    },
    {
        "id": "45cb091633994c7c825277f225daf7ef",
        "word": "winger",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈwɪŋə(r)/",
            "us": "/ˈwɪŋər/"
        },
        "nearby": [
            {
                "word": "wingding",
                "pos": "noun"
            },
            {
                "word": "winged",
                "pos": "adjective"
            },
            {
                "word": "winger",
                "pos": "noun"
            },
            {
                "word": "wingless",
                "pos": "adjective"
            },
            {
                "word": "wing mirror",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "either of the attacking players who play towards the side of the playing area in sports such as football (soccer) or hockey",
                    "vi": "một trong các cầu thủ tấn công chơi về phía bên của khu vực chơi trong các môn thể thao như bóng đá (bóng đá) hoặc khúc côn cầu"
                },
                "examples": []
            }
        ]
    }
]