[
    {
        "id": "da44682695fe4f5d97ad91d7ba1df415",
        "word": "cinema",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/ˈsɪnəmə/",
            "us": "/ˈsɪnəmə/"
        },
        "nearby": [
            {
                "word": "cine",
                "pos": "adjective"
            },
            {
                "word": "cineaste",
                "pos": "noun"
            },
            {
                "word": "cinema",
                "pos": "noun"
            },
            {
                "word": "cinemagoer",
                "pos": "noun"
            },
            {
                "word": "CinemaScope",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a building in which films are shown",
                    "vi": "một tòa nhà chiếu phim"
                },
                "examples": [
                    {
                        "en": "the local cinema",
                        "vi": "rạp chiếu phim địa phương"
                    },
                    {
                        "en": "in a cinema The film has just opened in cinemas across the UK.",
                        "vi": "trong một rạp chiếu phim Bộ phim vừa được khởi chiếu tại các rạp chiếu phim trên khắp Vương quốc Anh."
                    },
                    {
                        "en": "We were sitting in the cinema, waiting for the film to begin.",
                        "vi": "Chúng tôi đang ngồi trong rạp chiếu phim, chờ bộ phim bắt đầu."
                    },
                    {
                        "en": "at a cinema a screening at a cinema in Leicester Square in London",
                        "vi": "tại một rạp chiếu phim một buổi chiếu tại một rạp chiếu phim ở Quảng trường Leicester ở Luân Đôn"
                    }
                ]
            },
            {
                "define": {
                    "en": "when you go to the cinema or to the movies, you go to a cinema to see a film",
                    "vi": "khi bạn đi xem phim hoặc xem phim, bạn đi đến rạp chiếu phim để xem một bộ phim"
                },
                "examples": [
                    {
                        "en": "I used to go to the cinema every week.",
                        "vi": "Tôi thường đến rạp chiếu phim hàng tuần."
                    },
                    {
                        "en": "How often do you go to the cinema?",
                        "vi": "Bao lâu thì bạn đi xem phim?"
                    },
                    {
                        "en": "at the cinema I haven't seen a film at the cinema for nearly 2 years.",
                        "vi": "ở rạp chiếu phim tôi đã không xem một bộ phim nào ở rạp chiếu phim trong gần 2 năm."
                    },
                    {
                        "en": "Is there anything good on at the cinema at the moment?",
                        "vi": "Có điều gì tốt ở rạp chiếu phim vào lúc này không?"
                    },
                    {
                        "en": "in the cinema I hated it when I saw it in the cinema.",
                        "vi": "trong rạp chiếu phim Tôi ghét nó khi tôi nhìn thấy nó trong rạp chiếu phim."
                    }
                ]
            },
            {
                "define": {
                    "en": "films as an art or an industry",
                    "vi": "phim như một nghệ thuật hay một ngành công nghiệp"
                },
                "examples": [
                    {
                        "en": "one of the great successes of British cinema",
                        "vi": "một trong những thành công lớn của điện ảnh Anh"
                    },
                    {
                        "en": "the most influential film in the history of cinema",
                        "vi": "bộ phim có ảnh hưởng nhất trong lịch sử điện ảnh"
                    },
                    {
                        "en": "He was honoured for his outstanding contribution to cinema.",
                        "vi": "Anh được vinh danh vì đóng góp xuất sắc cho điện ảnh."
                    },
                    {
                        "en": "contemporary/world cinema",
                        "vi": "điện ảnh đương đại / thế giới"
                    },
                    {
                        "en": "mainstream/independent/arthouse/avant-garde cinema",
                        "vi": "rạp chiếu phim chính thống / độc lập / arthouse / tiên phong"
                    },
                    {
                        "en": "She started making films in the last years of silent cinema.",
                        "vi": "Cô bắt đầu đóng phim vào những năm cuối của điện ảnh câm."
                    }
                ]
            }
        ]
    },
    {
        "id": "cee2ba002a3b4499bf8734453fc7cf1e",
        "word": "DVD",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/ˌdiː viː ˈdiː/",
            "us": "/ˌdiː viː ˈdiː/"
        },
        "nearby": [
            {
                "word": "duvet day",
                "pos": "noun"
            },
            {
                "word": "dux",
                "pos": "noun"
            },
            {
                "word": "DVD",
                "pos": "noun"
            },
            {
                "word": "DVLA",
                "pos": ""
            },
            {
                "word": "DVR",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a disk on which large amounts of information, especially films, photographs and video, can be stored, for use on a DVD player or computer (the abbreviation for ‘digital versatile disc’ or ‘digital videodisc’)",
                    "vi": "một đĩa có thể lưu trữ một lượng lớn thông tin, đặc biệt là phim, ảnh và video, để sử dụng trên đầu đĩa DVD hoặc máy tính (viết tắt của 'đĩa đa năng kỹ thuật số' hoặc 'video kỹ thuật số')"
                },
                "examples": [
                    {
                        "en": "Let's just stay in and watch a DVD.",
                        "vi": "Hãy chỉ ở trong và xem một đĩa DVD."
                    },
                    {
                        "en": "a DVD recorder",
                        "vi": "một máy ghi DVD"
                    },
                    {
                        "en": "a DVD drive",
                        "vi": "một ổ đĩa DVD"
                    },
                    {
                        "en": "on DVD Is it available on DVD yet?",
                        "vi": "trên DVD Nó đã có trên DVD chưa?"
                    }
                ]
            }
        ]
    },
    {
        "id": "d5a7a7ca55ef4fa195bc664afe6ee93f",
        "word": "movie",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/ˈmuːvi/",
            "us": "/ˈmuːvi/"
        },
        "nearby": [
            {
                "word": "move over",
                "pos": "phrasal verb"
            },
            {
                "word": "mover",
                "pos": "noun"
            },
            {
                "word": "movie",
                "pos": "noun"
            },
            {
                "word": "moviegoer",
                "pos": "noun"
            },
            {
                "word": "movie rating",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a series of moving pictures recorded with sound that tells a story, watched at a movie theater or on a television or other device",
                    "vi": "một loạt các hình ảnh chuyển động được ghi lại với âm thanh kể một câu chuyện, được xem tại rạp chiếu phim hoặc trên TV hoặc thiết bị khác"
                },
                "examples": [
                    {
                        "en": "You'll love this movie.",
                        "vi": "Bạn sẽ thích bộ phim này."
                    },
                    {
                        "en": "Let's watch a movie tonight.",
                        "vi": "Tối nay xem phim nhé."
                    },
                    {
                        "en": "Have you seen the latest Miyazaki movie?",
                        "vi": "Bạn đã xem bộ phim Miyazaki mới nhất chưa?"
                    },
                    {
                        "en": "to rent/download a movie",
                        "vi": "để thuê / tải xuống một bộ phim"
                    },
                    {
                        "en": "to make a horror movie",
                        "vi": "để làm một bộ phim kinh dị"
                    },
                    {
                        "en": "a movie starring Jennifer Lawrence",
                        "vi": "một bộ phim có sự tham gia của Jennifer Lawrence"
                    },
                    {
                        "en": "a famous movie director",
                        "vi": "một đạo diễn phim nổi tiếng"
                    },
                    {
                        "en": "the Hollywood movie industry",
                        "vi": "ngành công nghiệp điện ảnh Hollywood"
                    },
                    {
                        "en": "a movie studio",
                        "vi": "một xưởng phim"
                    }
                ]
            },
            {
                "define": {
                    "en": "when you go to the movies, you go to a movie theater to see a movie",
                    "vi": "khi bạn đi xem phim, bạn đến rạp chiếu phim để xem một bộ phim"
                },
                "examples": [
                    {
                        "en": "Let's go to the movies.",
                        "vi": "Đi xem phim nào."
                    },
                    {
                        "en": "This weekend at the movies I felt like a kid again.",
                        "vi": "Cuối tuần này khi xem phim, tôi lại cảm thấy mình như một đứa trẻ."
                    }
                ]
            },
            {
                "define": {
                    "en": "movies as an art or an industry",
                    "vi": "phim như một nghệ thuật hay một ngành công nghiệp"
                },
                "examples": [
                    {
                        "en": "I've always wanted to work in the movies.",
                        "vi": "Tôi luôn muốn đóng phim."
                    },
                    {
                        "en": "Is it glamorous like in the movies?",
                        "vi": "Nó có quyến rũ như trong phim không?"
                    }
                ]
            }
        ]
    },
    {
        "id": "1952214a6bfd4c849863d50ef83f17e5",
        "word": "movie theater",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/ˈmuːvi θɪətə(r)/",
            "us": "/ˈmuːvi θiːətər/"
        },
        "nearby": [
            {
                "word": "movie rating",
                "pos": ""
            },
            {
                "word": "movie star",
                "pos": "noun"
            },
            {
                "word": "movie theater",
                "pos": "noun"
            },
            {
                "word": "moving",
                "pos": "adjective"
            },
            {
                "word": "movingly",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a building in which films are shown",
                    "vi": "một tòa nhà chiếu phim"
                },
                "examples": [
                    {
                        "en": "The documentary opens tomorrow in movie theaters nationwide.",
                        "vi": "Phim tài liệu khởi chiếu vào ngày mai tại các rạp trên toàn quốc."
                    }
                ]
            }
        ]
    },
    {
        "id": "a609388db359443ba366a0a9dfba28ea",
        "word": "screen",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/skriːn/",
            "us": "/skriːn/"
        },
        "nearby": [
            {
                "word": "screech",
                "pos": "noun"
            },
            {
                "word": "screed",
                "pos": "noun"
            },
            {
                "word": "screen",
                "pos": "noun"
            },
            {
                "word": "screen",
                "pos": "verb"
            },
            {
                "word": "Screen Actors Guild",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the flat surface at the front of a television, computer, or other electronic device, on which you see pictures or information",
                    "vi": "bề mặt phẳng ở phía trước của TV, máy tính hoặc thiết bị điện tử khác mà bạn nhìn thấy hình ảnh hoặc thông tin trên đó"
                },
                "examples": [
                    {
                        "en": "a computer screen",
                        "vi": "màn hình máy tính"
                    },
                    {
                        "en": "a monitor with a 21-inch screen",
                        "vi": "màn hình có màn hình 21 inch"
                    },
                    {
                        "en": "They were staring at the television screen.",
                        "vi": "Họ đang nhìn chằm chằm vào màn hình tivi."
                    },
                    {
                        "en": "Move your cursor to the top of the screen.",
                        "vi": "Di chuyển con trỏ của bạn lên đầu màn hình."
                    },
                    {
                        "en": "Tessa glanced at the phone's little screen.",
                        "vi": "Tessa liếc nhìn màn hình nhỏ của điện thoại."
                    },
                    {
                        "en": "an LCD/plasma screen",
                        "vi": "một màn hình LCD / plasma"
                    },
                    {
                        "en": "Hundreds of fans watched on giant television screens.",
                        "vi": "Hàng trăm người hâm mộ đã theo dõi trên màn hình tivi khổng lồ."
                    },
                    {
                        "en": "on the screen The image came up on the screen for a few seconds.",
                        "vi": "trên màn hình Hình ảnh hiển thị trên màn hình trong vài giây."
                    },
                    {
                        "en": "The birds appear as red dots on the radar screen.",
                        "vi": "Những con chim xuất hiện dưới dạng chấm đỏ trên màn hình radar."
                    },
                    {
                        "en": "on screen Information can be viewed on screen or printed out.",
                        "vi": "trên màn hình Thông tin có thể được xem trên màn hình hoặc in ra."
                    },
                    {
                        "en": "the screen display",
                        "vi": "màn hình hiển thị"
                    },
                    {
                        "en": "The system was designed with a menu bar at the bottom of the screen.",
                        "vi": "Hệ thống được thiết kế với một thanh menu ở cuối màn hình."
                    }
                ]
            },
            {
                "define": {
                    "en": "the large flat surface that films or pictures are shown on",
                    "vi": "bề mặt phẳng lớn mà phim hoặc hình ảnh được chiếu trên"
                },
                "examples": [
                    {
                        "en": "a cinema/movie screen",
                        "vi": "rạp chiếu phim / màn hình chiếu phim"
                    },
                    {
                        "en": "an eight-screen cinema",
                        "vi": "rạp chiếu phim tám màn hình"
                    },
                    {
                        "en": "The movie will be coming to your screens shortly.",
                        "vi": "Bộ phim sẽ sớm ra rạp."
                    },
                    {
                        "en": "This film should keep you glued to the screen (= unable to stop watching) for two hours.",
                        "vi": "Bộ phim này sẽ khiến bạn dán mắt vào màn hình (= không thể ngừng xem) trong hai giờ."
                    },
                    {
                        "en": "The film hits cinema screens in November.",
                        "vi": "Phim sẽ ra rạp vào tháng 11."
                    },
                    {
                        "en": "The film demands to be seen on a big screen.",
                        "vi": "Bộ phim yêu cầu được xem trên màn hình lớn."
                    }
                ]
            },
            {
                "define": {
                    "en": "films or television in general",
                    "vi": "phim hay truyền hình nói chung"
                },
                "examples": [
                    {
                        "en": "He has adapted the play for the screen.",
                        "vi": "Anh ấy đã chuyển thể vở kịch cho màn ảnh."
                    },
                    {
                        "en": "on screen Some actors never watch themselves on screen.",
                        "vi": "trên màn hình Một số diễn viên không bao giờ xem mình trên màn hình."
                    },
                    {
                        "en": "His face never appears on screen.",
                        "vi": "Khuôn mặt của anh ấy không bao giờ xuất hiện trên màn hình."
                    },
                    {
                        "en": "She was a star of stage and screen (= plays and films).",
                        "vi": "Cô ấy là một ngôi sao của sân khấu và màn ảnh (= vở kịch và phim)."
                    },
                    {
                        "en": "a screen actor",
                        "vi": "một diễn viên màn ảnh"
                    },
                    {
                        "en": "She has great screen presence (= she makes a good impression on screen).",
                        "vi": "Cô ấy có sự hiện diện tuyệt vời trên màn ảnh (= cô ấy tạo được ấn tượng tốt trên màn ảnh)."
                    },
                    {
                        "en": "He made his screen debut in 1954 as a stable boy.",
                        "vi": "Anh xuất hiện lần đầu trên màn ảnh vào năm 1954 với tư cách là một cậu bé ổn định."
                    },
                    {
                        "en": "the screen adaptation (= film) of John Steinbeck's novel East of Eden",
                        "vi": "chuyển thể màn ảnh (= phim) từ tiểu thuyết Phía đông vườn địa đàng của John Steinbeck"
                    }
                ]
            },
            {
                "define": {
                    "en": "the data or images shown on a computer screen",
                    "vi": "dữ liệu hoặc hình ảnh được hiển thị trên màn hình máy tính"
                },
                "examples": [
                    {
                        "en": "Press the F1 key to display a help screen.",
                        "vi": "Nhấn phím F1 để hiển thị màn hình trợ giúp."
                    },
                    {
                        "en": "Can you do a printout of this screen for me?",
                        "vi": "Bạn có thể làm một bản in màn hình này cho tôi được không?"
                    },
                    {
                        "en": "I posted the screen grab on Twitter.",
                        "vi": "Tôi đã đăng bức ảnh chụp màn hình trên Twitter."
                    }
                ]
            },
            {
                "define": {
                    "en": "a tall, flat piece of furniture or equipment that is fixed to a wall, etc. or that can be moved to divide a room or to keep one area hidden or separate",
                    "vi": "một món đồ nội thất hoặc thiết bị cao, bằng phẳng được gắn cố định vào tường, v.v. hoặc có thể được di chuyển để chia phòng hoặc để ẩn hoặc tách biệt một khu vực"
                },
                "examples": [
                    {
                        "en": "The nurse put a screen around the bed.",
                        "vi": "Y tá đặt một màn hình xung quanh giường."
                    },
                    {
                        "en": "A wooden screen hid one corner of the room.",
                        "vi": "Một bức bình phong bằng gỗ che khuất một góc phòng."
                    },
                    {
                        "en": "She went behind the screen and changed into the ballet costume.",
                        "vi": "Cô ấy đi ra sau màn hình và thay trang phục múa ba lê."
                    }
                ]
            },
            {
                "define": {
                    "en": "something that prevents somebody from seeing or being aware of something, or that protects somebody/something",
                    "vi": "thứ gì đó ngăn ai đó nhìn thấy hoặc nhận thức được điều gì đó hoặc điều đó bảo vệ ai đó / điều gì đó"
                },
                "examples": [
                    {
                        "en": "screen (of something) We planted a screen of tall trees.",
                        "vi": "màn hình (của cái gì đó) Chúng tôi trồng một màn hình cây cao."
                    },
                    {
                        "en": "A screen of bodyguards protected the President.",
                        "vi": "Một màn vệ sĩ bảo vệ Tổng thống."
                    },
                    {
                        "en": "behind a screen of something (figurative) All the research was conducted behind a screen of secrecy.",
                        "vi": "đằng sau một tấm bình phong của một cái gì đó (nghĩa bóng) Tất cả các nghiên cứu được tiến hành đằng sau một tấm bình phong bí mật."
                    }
                ]
            },
            {
                "define": {
                    "en": "a wire or plastic net that is held in a frame and fastened on a window, or a door, to let in air but keep out insects",
                    "vi": "một dây hoặc lưới nhựa được giữ trong khung và buộc chặt trên cửa sổ hoặc cửa ra vào để không khí vào nhưng ngăn côn trùng"
                },
                "examples": [
                    {
                        "en": "Do you have screens on your windows?",
                        "vi": "Bạn có màn hình trên cửa sổ của mình không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "a wood or stone structure in a church, that partly separates the main area from the altar or choir",
                    "vi": "cấu trúc bằng gỗ hoặc đá trong nhà thờ, phần nào ngăn cách khu vực chính với bàn thờ hoặc dàn hợp xướng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a system of checking a person or thing to find out whether or not something, typically a disease, is present",
                    "vi": "một hệ thống kiểm tra một người hoặc một vật để tìm xem có hay không một thứ gì đó, điển hình là một căn bệnh,"
                },
                "examples": [
                    {
                        "en": "You should get a health screen every couple of years.",
                        "vi": "Bạn nên kiểm tra sức khỏe vài năm một lần."
                    },
                    {
                        "en": "Candidates for this position must be able to pass a drug screen.",
                        "vi": "Các ứng cử viên cho vị trí này phải có khả năng vượt qua màn kiểm tra thuốc."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that people’s attention is on or not on something",
                    "vi": "được sử dụng để nói rằng sự chú ý của mọi người đang tập trung vào hoặc không vào một cái gì đó"
                },
                "examples": [
                    {
                        "en": "The issue of terrorism is back on the radar screen.",
                        "vi": "Vấn đề khủng bố đã trở lại trên màn hình radar."
                    },
                    {
                        "en": "Since the scandal broke, all other issues seem to have disappeared off the radar screen as far as the media is concerned.",
                        "vi": "Kể từ khi vụ bê bối nổ ra, tất cả các vấn đề khác dường như đã biến mất khỏi màn hình radar theo như phương tiện truyền thông quan tâm."
                    }
                ]
            }
        ]
    },
    {
        "id": "d42d5b3a92444f298c682dcddbbd0434",
        "word": "home cinema",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˌhəʊm ˈsɪnəmə/",
            "us": "/ˌhəʊm ˈsɪnəmə/"
        },
        "nearby": [
            {
                "word": "home brew",
                "pos": "adjective"
            },
            {
                "word": "homebuyer",
                "pos": "noun"
            },
            {
                "word": "home cinema",
                "pos": "noun"
            },
            {
                "word": "homecoming",
                "pos": "noun"
            },
            {
                "word": "home confinement",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "television and video equipment designed to give a similar experience to being in a cinema, with high-quality pictures and sound and a large screen",
                    "vi": "thiết bị truyền hình và video được thiết kế để mang lại trải nghiệm tương tự như đang ở trong rạp chiếu phim, với hình ảnh và âm thanh chất lượng cao và màn hình lớn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "673cc0be5c74463db353589b86adafad",
        "word": "home theater",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˌhəʊm ˈθɪətə(r)/",
            "us": "/ˌhəʊm ˈθiːətər/"
        },
        "nearby": [
            {
                "word": "the home straight",
                "pos": "noun"
            },
            {
                "word": "the home stretch",
                "pos": "noun"
            },
            {
                "word": "home theater",
                "pos": "noun"
            },
            {
                "word": "home town",
                "pos": "noun"
            },
            {
                "word": "home truth",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "television and video equipment designed to give a similar experience to being in a cinema, with high-quality pictures and sound and a large screen",
                    "vi": "thiết bị truyền hình và video được thiết kế để mang lại trải nghiệm tương tự như đang ở trong rạp chiếu phim, với hình ảnh và âm thanh chất lượng cao và màn hình lớn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "9a0ef07ce1c74fff9985c0307a4d488f",
        "word": "booking office",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈbʊkɪŋ ɒfɪs/",
            "us": "/ˈbʊkɪŋ ɑːfɪs/"
        },
        "nearby": [
            {
                "word": "book in",
                "pos": "phrasal verb"
            },
            {
                "word": "booking",
                "pos": "noun"
            },
            {
                "word": "booking office",
                "pos": "noun"
            },
            {
                "word": "book into",
                "pos": "phrasal verb"
            },
            {
                "word": "bookish",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a place where you can buy tickets, at a train or bus station or at a theatre",
                    "vi": "nơi bạn có thể mua vé, ở ga tàu hoặc bến xe buýt hoặc ở rạp hát"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "6eb38e03e6364657a4662ac8987cb04a",
        "word": "box office",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈbɒks ɒfɪs/",
            "us": "/ˈbɑːks ɑːfɪs/"
        },
        "nearby": [
            {
                "word": "box lunch",
                "pos": "noun"
            },
            {
                "word": "box number",
                "pos": "noun"
            },
            {
                "word": "box office",
                "pos": "noun"
            },
            {
                "word": "box room",
                "pos": "noun"
            },
            {
                "word": "box score",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the place at a theatre, cinema, etc. where the tickets are sold",
                    "vi": "địa điểm tại nhà hát, rạp chiếu phim, v.v. nơi bán vé"
                },
                "examples": [
                    {
                        "en": "The movie has been a huge box-office success (= many people have been to see it).",
                        "vi": "Bộ phim đã thành công rực rỡ về mặt phòng vé (= nhiều người đã đến xem)."
                    },
                    {
                        "en": "Box-office receipts have exceeded expectations.",
                        "vi": "Doanh thu phòng vé đã vượt quá mong đợi."
                    },
                    {
                        "en": "The musical has done very well at the box office.",
                        "vi": "Vở nhạc kịch đã đạt thành tích rất tốt tại phòng vé."
                    },
                    {
                        "en": "Tickets are available at the box office.",
                        "vi": "Vé có sẵn tại phòng vé."
                    }
                ]
            }
        ]
    },
    {
        "id": "22e728fddcf94b5fbdf2ce76e68ce6ad",
        "word": "clip",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/klɪp/",
            "us": "/klɪp/"
        },
        "nearby": [
            {
                "word": "clinometer",
                "pos": "noun"
            },
            {
                "word": "Clint",
                "pos": ""
            },
            {
                "word": "clip",
                "pos": "noun"
            },
            {
                "word": "clip",
                "pos": "verb"
            },
            {
                "word": "clip art",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a short part of a film that is shown separately",
                    "vi": "một phần ngắn của phim được chiếu riêng"
                },
                "examples": [
                    {
                        "en": "Here is a clip from her latest movie.",
                        "vi": "Đây là một clip trong bộ phim mới nhất của cô ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "a small metal or plastic object used for holding things together or in place",
                    "vi": "một vật nhỏ bằng kim loại hoặc nhựa được sử dụng để giữ các vật lại gần nhau hoặc tại chỗ"
                },
                "examples": [
                    {
                        "en": "a hair clip",
                        "vi": "một cái kẹp tóc"
                    },
                    {
                        "en": "toe clips on a bicycle",
                        "vi": "kẹp ngón chân trên xe đạp"
                    },
                    {
                        "en": "She put a clip in her hair.",
                        "vi": "Cô ấy cài một chiếc kẹp tóc."
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of jewellery that fastens to your clothes",
                    "vi": "một món đồ trang sức gắn chặt vào quần áo của bạn"
                },
                "examples": [
                    {
                        "en": "a diamond clip",
                        "vi": "một chiếc kẹp kim cương"
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of cutting something to make it shorter",
                    "vi": "hành động cắt một cái gì đó để làm cho nó ngắn hơn"
                },
                "examples": [
                    {
                        "en": "He gave the hedge a clip.",
                        "vi": "Anh ta đã đưa cho hàng rào một cái kẹp."
                    }
                ]
            },
            {
                "define": {
                    "en": "a quick hit with your hand",
                    "vi": "một cú đánh nhanh bằng tay của bạn"
                },
                "examples": [
                    {
                        "en": "She gave him a clip round the ear for being cheeky.",
                        "vi": "Cô ấy đã đưa cho anh ta một cái kẹp quanh tai vì táo bạo."
                    }
                ]
            },
            {
                "define": {
                    "en": "a set of bullets in a metal container that is placed in or attached to a gun for firing",
                    "vi": "một bộ đạn trong hộp kim loại được đặt trong hoặc gắn vào súng để bắn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "quickly",
                    "vi": "Mau"
                },
                "examples": [
                    {
                        "en": "Land prices will rise at a healthy clip.",
                        "vi": "Giá đất sẽ tăng ở mức ổn định."
                    }
                ]
            }
        ]
    },
    {
        "id": "68544d4f18454381b7526648edf8bece",
        "word": "opening night",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˌəʊpənɪŋ ˈnaɪt/",
            "us": "/ˌəʊpənɪŋ ˈnaɪt/"
        },
        "nearby": [
            {
                "word": "opening",
                "pos": "adjective"
            },
            {
                "word": "opening hours",
                "pos": "noun"
            },
            {
                "word": "opening night",
                "pos": "noun"
            },
            {
                "word": "opening time",
                "pos": "noun"
            },
            {
                "word": "opening up",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the first night that, for example, a play is performed or a film is shown to the public",
                    "vi": "đêm đầu tiên, chẳng hạn như một vở kịch được trình diễn hoặc một bộ phim được trình chiếu cho công chúng"
                },
                "examples": [
                    {
                        "en": "tickets for the opera’s opening night",
                        "vi": "vé cho đêm khai mạc của nhà hát opera"
                    },
                    {
                        "en": "The president gave a speech at the opening night of the convention.",
                        "vi": "Tổng thống đã có bài phát biểu tại đêm khai mạc đại hội."
                    }
                ]
            }
        ]
    },
    {
        "id": "55c178aaa3de47aebdd89876b1c3c0f2",
        "word": "preview",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈpriːvjuː/",
            "us": "/ˈpriːvjuː/"
        },
        "nearby": [
            {
                "word": "preventive",
                "pos": "adjective"
            },
            {
                "word": "preverbal",
                "pos": "adjective"
            },
            {
                "word": "preview",
                "pos": "noun"
            },
            {
                "word": "preview",
                "pos": "verb"
            },
            {
                "word": "previous",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an occasion at which you can see a film, a show, etc. before it is shown to the general public",
                    "vi": "một dịp mà bạn có thể xem một bộ phim, một chương trình, v.v. trước khi nó được chiếu cho công chúng"
                },
                "examples": [
                    {
                        "en": "a press preview (= for journalists only)",
                        "vi": "bản xem trước báo chí (= chỉ dành cho nhà báo)"
                    },
                    {
                        "en": "a special preview of our winter fashion collection",
                        "vi": "một bản xem trước đặc biệt của bộ sưu tập thời trang mùa đông của chúng tôi"
                    },
                    {
                        "en": "On today’s show, we’ll have exclusive previews of some of the best new music.",
                        "vi": "Trong chương trình hôm nay, chúng tôi sẽ có các bản xem trước độc quyền của một số bản nhạc mới hay nhất."
                    }
                ]
            },
            {
                "define": {
                    "en": "a description in a newspaper or a magazine that tells you about a film, a television programme, etc. before it is shown to the public",
                    "vi": "mô tả trên một tờ báo hoặc tạp chí cho bạn biết về một bộ phim, một chương trình truyền hình, v.v. trước khi nó được chiếu cho công chúng"
                },
                "examples": [
                    {
                        "en": "Turn to page 12 for a preview of next week's programmes.",
                        "vi": "Hãy lật sang trang 12 để xem trước các chương trình của tuần tới."
                    }
                ]
            },
            {
                "define": {
                    "en": "a series of short scenes from a film or television programme, shown in advance to advertise it",
                    "vi": "một loạt các cảnh ngắn từ một bộ phim hoặc chương trình truyền hình, được chiếu trước để quảng cáo"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a chance to see what something will be like before it happens or is shown",
                    "vi": "cơ hội để xem điều gì đó sẽ như thế nào trước khi nó xảy ra hoặc được hiển thị"
                },
                "examples": [
                    {
                        "en": "Click on the print preview button.",
                        "vi": "Bấm vào nút xem trước bản in."
                    }
                ]
            }
        ]
    },
    {
        "id": "5d81dc6d5b3c43d58491d8b0c7b51961",
        "word": "release",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/rɪˈliːs/",
            "us": "/rɪˈliːs/"
        },
        "nearby": [
            {
                "word": "relay2",
                "pos": "verb"
            },
            {
                "word": "relay1",
                "pos": "noun"
            },
            {
                "word": "release",
                "pos": "verb"
            },
            {
                "word": "release",
                "pos": "noun"
            },
            {
                "word": "release candidate",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to let somebody come out of a place where they have been kept or stuck and unable to leave or move",
                    "vi": "để cho ai đó thoát ra khỏi một nơi mà họ đã bị giam giữ hoặc bị mắc kẹt và không thể rời đi hoặc di chuyển"
                },
                "examples": [
                    {
                        "en": "release somebody to release a prisoner",
                        "vi": "thả ai đó để trả tự do cho một tù nhân"
                    },
                    {
                        "en": "The hostages were released unharmed.",
                        "vi": "Các con tin được thả mà không hề hấn gì."
                    },
                    {
                        "en": "He was released without charge after questioning by police.",
                        "vi": "Anh ta được thả mà không bị buộc tội sau khi bị cảnh sát thẩm vấn."
                    },
                    {
                        "en": "You will be released on bail and a date for your hearing will be set.",
                        "vi": "Bạn sẽ được tại ngoại và ngày điều trần sẽ được ấn định."
                    },
                    {
                        "en": "release somebody from something to release somebody from prison/jail/hospital",
                        "vi": "thả ai đó khỏi một cái gì đó để giải phóng ai đó khỏi nhà tù / nhà tù / bệnh viện"
                    },
                    {
                        "en": "Firefighters took two hours to release the driver from the wreckage.",
                        "vi": "Các nhân viên cứu hỏa đã mất hai giờ để giải phóng tài xế khỏi đống đổ nát."
                    },
                    {
                        "en": "He was later released from police custody.",
                        "vi": "Anh ta sau đó đã được thả ra khỏi sự giam giữ của cảnh sát."
                    },
                    {
                        "en": "(figurative) Death released him from his suffering.",
                        "vi": "(nghĩa bóng) Cái chết đã giải thoát anh ta khỏi đau khổ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to stop holding something or stop it from being held so that it can move, fly, fall, etc. freely",
                    "vi": "dừng cầm vật gì đó hoặc không giữ vật đó để vật đó có thể di chuyển, bay, rơi, v.v."
                },
                "examples": [
                    {
                        "en": "release something He refused to release her arm.",
                        "vi": "thả ra một cái gì đó Anh từ chối để thả cánh tay của cô."
                    },
                    {
                        "en": "Intense heat is released in the reaction.",
                        "vi": "Phản ứng tỏa nhiệt dữ dội."
                    },
                    {
                        "en": "10 000 balloons were released at the ceremony.",
                        "vi": "10 000 quả bóng bay đã được thả tại buổi lễ."
                    },
                    {
                        "en": "The chemical reaction releases energy in the form of light.",
                        "vi": "Phản ứng hóa học giải phóng năng lượng dưới dạng ánh sáng."
                    },
                    {
                        "en": "release something into something the need to limit the amount of greenhouse gases being released into the atmosphere",
                        "vi": "thải một thứ gì đó vào một thứ cần hạn chế lượng khí nhà kính thải vào khí quyển"
                    },
                    {
                        "en": "The birds were cleaned and fed and released again into the wild.",
                        "vi": "Những con chim đã được làm sạch và cho ăn và thả trở lại tự nhiên."
                    }
                ]
            },
            {
                "define": {
                    "en": "to express feelings such as anger or worry in order to get rid of them",
                    "vi": "thể hiện cảm xúc như tức giận hoặc lo lắng để loại bỏ chúng"
                },
                "examples": [
                    {
                        "en": "She burst into tears, releasing all her pent-up emotions.",
                        "vi": "Cô bật khóc, giải tỏa mọi cảm xúc dồn nén."
                    },
                    {
                        "en": "She laughed, the tension inside her suddenly released.",
                        "vi": "Cô bật cười, sự căng thẳng trong lòng chợt được giải tỏa."
                    }
                ]
            },
            {
                "define": {
                    "en": "to remove something from a fixed position, allowing something else to move or function",
                    "vi": "để loại bỏ một thứ gì đó khỏi một vị trí cố định, cho phép một thứ khác di chuyển hoặc hoạt động"
                },
                "examples": [
                    {
                        "en": "to release the clutch/handbrake/switch",
                        "vi": "để nhả ly hợp / phanh tay / công tắc"
                    },
                    {
                        "en": "Now release the clutch and move away from the kerb.",
                        "vi": "Bây giờ nhả ly hợp và di chuyển ra khỏi lề đường."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make information available to the public",
                    "vi": "để cung cấp thông tin cho công chúng"
                },
                "examples": [
                    {
                        "en": "release something to release a statement/report/document/poll/study",
                        "vi": "phát hành một cái gì đó để phát hành một tuyên bố / báo cáo / tài liệu / thăm dò ý kiến / nghiên cứu"
                    },
                    {
                        "en": "to release figures/results/information/data",
                        "vi": "để đưa ra các số liệu / kết quả / thông tin / dữ liệu"
                    },
                    {
                        "en": "Police have released no further details about the accident.",
                        "vi": "Cảnh sát chưa tiết lộ thêm thông tin chi tiết về vụ tai nạn."
                    },
                    {
                        "en": "release something to somebody The suspect's name has not been released to the public.",
                        "vi": "phát hành một cái gì đó cho ai đó Tên của nghi phạm đã không được công bố cho công chúng."
                    },
                    {
                        "en": "The newly released files reveal the extent of his involvement in the scandal.",
                        "vi": "Các hồ sơ mới được công bố cho thấy mức độ dính líu của anh ta trong vụ bê bối."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make a film, recording or other product available to the public",
                    "vi": "để cung cấp một bộ phim, bản ghi âm hoặc sản phẩm khác cho công chúng"
                },
                "examples": [
                    {
                        "en": "He's planning to release a solo album.",
                        "vi": "Anh ấy đang có kế hoạch phát hành một album solo."
                    },
                    {
                        "en": "to release a film/video",
                        "vi": "để phát hành một bộ phim / video"
                    },
                    {
                        "en": "They've released a new version of the original film.",
                        "vi": "Họ đã phát hành một phiên bản mới của bộ phim gốc."
                    },
                    {
                        "en": "There have been a lot of new products released onto the market.",
                        "vi": "Đã có rất nhiều sản phẩm mới được tung ra thị trường."
                    },
                    {
                        "en": "The series has just recently been released on DVD.",
                        "vi": "Bộ truyện vừa mới được phát hành trên DVD."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make something available that had previously been limited",
                    "vi": "để cung cấp một cái gì đó có sẵn mà trước đây đã bị hạn chế"
                },
                "examples": [
                    {
                        "en": "The new building programme will go ahead as soon as the government releases the funds.",
                        "vi": "Chương trình xây dựng mới sẽ được tiến hành ngay sau khi chính phủ giải phóng ngân quỹ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to free somebody from a duty, responsibility, contract, etc.",
                    "vi": "để giải phóng ai đó khỏi nghĩa vụ, trách nhiệm, hợp đồng, v.v."
                },
                "examples": [
                    {
                        "en": "release somebody The club is releasing some of its older players.",
                        "vi": "thả ai đó Câu lạc bộ đang giải phóng một số cầu thủ lớn tuổi của mình."
                    },
                    {
                        "en": "release somebody from something The new law released employers from their obligation to recognize unions.",
                        "vi": "giải phóng ai đó khỏi điều gì đó Luật mới giải phóng người sử dụng lao động khỏi nghĩa vụ công nhận công đoàn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make something less tight",
                    "vi": "để làm cho một cái gì đó ít chặt chẽ hơn"
                },
                "examples": [
                    {
                        "en": "You need to release the tension in these shoulder muscles.",
                        "vi": "Bạn cần giải phóng sức căng ở các cơ vai này."
                    },
                    {
                        "en": "to release a catch/a screw/a nut/the clutch/the brakes",
                        "vi": "để nhả chốt / vít / đai ốc / ly hợp / phanh"
                    }
                ]
            }
        ]
    },
    {
        "id": "a43d093053934f3683bc4a84cf1eda25",
        "word": "release",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/rɪˈliːs/",
            "us": "/rɪˈliːs/"
        },
        "nearby": [
            {
                "word": "relay1",
                "pos": "noun"
            },
            {
                "word": "release",
                "pos": "verb"
            },
            {
                "word": "release",
                "pos": "noun"
            },
            {
                "word": "release candidate",
                "pos": "noun"
            },
            {
                "word": "relegate",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act of setting a person or an animal free; the state of being set free",
                    "vi": "hành động thả tự do cho một người hoặc một động vật; trạng thái được tự do"
                },
                "examples": [
                    {
                        "en": "release of somebody/something The government has been working to secure the release of the hostages.",
                        "vi": "thả ai đó / cái gì đó Chính phủ đã làm việc để đảm bảo việc thả con tin."
                    },
                    {
                        "en": "The judges ordered the release of prisoners who were political opponents of the government.",
                        "vi": "Các thẩm phán đã ra lệnh trả tự do cho các tù nhân là đối thủ chính trị của chính phủ."
                    },
                    {
                        "en": "The public demanded her release.",
                        "vi": "Công chúng yêu cầu trả tự do cho cô."
                    },
                    {
                        "en": "release from something Following his release from prison, he moved to London.",
                        "vi": "giải phóng khỏi cái gì đó Sau khi ra tù, anh chuyển đến London."
                    },
                    {
                        "en": "release of somebody from something The release of female prisoners from government jails was part of the deal.",
                        "vi": "thả ai đó khỏi cái gì đó Việc thả các nữ tù nhân khỏi nhà tù của chính phủ là một phần của thỏa thuận."
                    },
                    {
                        "en": "He was granted early release (= from prison).",
                        "vi": "Anh ta được trả tự do sớm (= ra khỏi tù)."
                    },
                    {
                        "en": "She can expect an early release from prison.",
                        "vi": "Cô ấy có thể mong đợi được ra tù sớm."
                    },
                    {
                        "en": "on/upon somebody's release from something Upon his release from jail he found work in a restaurant kitchen.",
                        "vi": "trên / khi ai đó được thả ra khỏi một cái gì đó Sau khi ra tù, anh ta tìm được việc làm trong một nhà bếp của nhà hàng."
                    },
                    {
                        "en": "on/upon somebody's release Upon her release, she fled Germany, living first in Geneva, then Paris.",
                        "vi": "trên / khi ai đó được thả Khi được thả, cô ấy đã trốn khỏi Đức, đầu tiên sống ở Geneva, sau đó là Paris."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of making a film, recording or other product available to the public",
                    "vi": "hành động làm phim, ghi âm hoặc sản phẩm khác có sẵn cho công chúng"
                },
                "examples": [
                    {
                        "en": "The new software is planned for release in April.",
                        "vi": "Phần mềm mới được lên kế hoạch phát hành vào tháng 4."
                    },
                    {
                        "en": "It is very difficult for a Brazilian film to get an American release.",
                        "vi": "Rất khó để một bộ phim Brazil được Mỹ phát hành."
                    },
                    {
                        "en": "The film never received a theatrical release (= was not shown in cinemas).",
                        "vi": "Phim chưa bao giờ được chiếu tại rạp (= không được chiếu trong rạp chiếu phim)."
                    },
                    {
                        "en": "The movie goes on general release (= will be widely shown in cinemas) next week.",
                        "vi": "Phim sẽ được phát hành chung (= sẽ được chiếu rộng rãi tại các rạp chiếu phim) vào tuần tới."
                    },
                    {
                        "en": "I hadn't seen the movie since its original release.",
                        "vi": "Tôi đã không xem bộ phim kể từ khi phát hành ban đầu."
                    },
                    {
                        "en": "the release of a film/report",
                        "vi": "phát hành một bộ phim / báo cáo"
                    },
                    {
                        "en": "upon (something's) release Upon its release, the film received considerable acclaim.",
                        "vi": "khi (cái gì đó) phát hành Khi phát hành, bộ phim đã nhận được sự hoan nghênh đáng kể."
                    },
                    {
                        "en": "It's still seven weeks till the film's official release.",
                        "vi": "Vẫn còn bảy tuần nữa là bộ phim phát hành chính thức."
                    },
                    {
                        "en": "A release date has not been announced yet.",
                        "vi": "Ngày phát hành vẫn chưa được công bố."
                    }
                ]
            },
            {
                "define": {
                    "en": "a thing that is made available to the public, especially a new film or music recording",
                    "vi": "một thứ được cung cấp cho công chúng, đặc biệt là một bộ phim mới hoặc bản ghi âm nhạc"
                },
                "examples": [
                    {
                        "en": "recent/new releases",
                        "vi": "bản phát hành gần đây / mới"
                    },
                    {
                        "en": "the latest releases",
                        "vi": "bản phát hành mới nhất"
                    },
                    {
                        "en": "There are several interesting album releases due out on Friday.",
                        "vi": "Có một số bản phát hành album thú vị sẽ ra mắt vào thứ Sáu."
                    },
                    {
                        "en": "This is a debut release that'll simply take your breath away.",
                        "vi": "Đây là một bản phát hành đầu tay đơn giản sẽ khiến bạn phải hít thở."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of making information available to the public",
                    "vi": "hành động cung cấp thông tin cho công chúng"
                },
                "examples": [
                    {
                        "en": "the release of the report",
                        "vi": "việc phát hành báo cáo"
                    },
                    {
                        "en": "The company issued a news release after the board meeting.",
                        "vi": "Công ty đã đưa ra một thông cáo báo chí sau cuộc họp hội đồng quản trị."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of letting a gas, chemical, etc. move or flow freely",
                    "vi": "hành động để cho khí, hóa chất, v.v. di chuyển hoặc chảy tự do"
                },
                "examples": [
                    {
                        "en": "Release of these hormones gives the body a temporary increase in strength and energy.",
                        "vi": "Việc giải phóng các hormone này mang lại cho cơ thể sự gia tăng tạm thời về sức mạnh và năng lượng."
                    },
                    {
                        "en": "disasters resulting from accidental releases of toxic substances",
                        "vi": "thảm họa do ngẫu nhiên thải ra các chất độc hại"
                    },
                    {
                        "en": "The aim is to control the risks of exposure to chemicals by preventing release at source.",
                        "vi": "Mục đích là để kiểm soát rủi ro tiếp xúc với hóa chất bằng cách ngăn chặn việc thải ra tại nguồn."
                    },
                    {
                        "en": "release of something into something the release of carbon dioxide into the atmosphere",
                        "vi": "giải phóng một cái gì đó vào một cái gì đó giải phóng carbon dioxide vào khí quyển"
                    },
                    {
                        "en": "to monitor radiation releases",
                        "vi": "để theo dõi phóng xạ"
                    }
                ]
            },
            {
                "define": {
                    "en": "the feeling that you are free from pain, worry or some other unpleasant feeling",
                    "vi": "cảm giác rằng bạn không còn đau đớn, lo lắng hoặc một số cảm giác khó chịu khác"
                },
                "examples": [
                    {
                        "en": "a sense of release after the exam",
                        "vi": "một cảm giác giải phóng sau kỳ thi"
                    },
                    {
                        "en": "I think her death was a merciful release.",
                        "vi": "Tôi nghĩ cái chết của cô ấy là một sự giải thoát nhân hậu."
                    },
                    {
                        "en": "It’s just a release of tension.",
                        "vi": "Nó chỉ là một sự giải tỏa căng thẳng."
                    }
                ]
            }
        ]
    },
    {
        "id": "f9e397e30ae24fa6818ba101c50fd069",
        "word": "screen",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/skriːn/",
            "us": "/skriːn/"
        },
        "nearby": [
            {
                "word": "screed",
                "pos": "noun"
            },
            {
                "word": "screen",
                "pos": "noun"
            },
            {
                "word": "screen",
                "pos": "verb"
            },
            {
                "word": "Screen Actors Guild",
                "pos": "noun"
            },
            {
                "word": "screen door",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to show a film, etc. in a cinema or on television",
                    "vi": "để chiếu một bộ phim, v.v. trong rạp chiếu phim hoặc trên truyền hình"
                },
                "examples": [
                    {
                        "en": "a list of films to be screened as part of the festival",
                        "vi": "danh sách các bộ phim sẽ được chiếu trong khuôn khổ liên hoan"
                    },
                    {
                        "en": "The fight was screened live all over the world.",
                        "vi": "Cuộc chiến được chiếu trực tiếp trên toàn thế giới."
                    },
                    {
                        "en": "The second episode will be screened at the same time tomorrow.",
                        "vi": "Tập thứ hai sẽ được trình chiếu cùng giờ vào ngày mai."
                    },
                    {
                        "en": "The programme was screened on 24 December.",
                        "vi": "Chương trình được chiếu vào ngày 24 tháng 12."
                    }
                ]
            },
            {
                "define": {
                    "en": "to examine people in order to find out if they have a particular disease or illness",
                    "vi": "kiểm tra mọi người để tìm hiểu xem họ có bị bệnh hoặc bệnh tật cụ thể hay không"
                },
                "examples": [
                    {
                        "en": "Men over 55 should be regularly screened for prostate cancer.",
                        "vi": "Nam giới trên 55 tuổi nên thường xuyên tầm soát ung thư tuyến tiền liệt."
                    }
                ]
            },
            {
                "define": {
                    "en": "to find out information about people who work or who want to work for you in order to make sure that they can be trusted",
                    "vi": "để tìm hiểu thông tin về những người đang làm việc hoặc những người muốn làm việc cho bạn để đảm bảo rằng họ có thể được tin cậy"
                },
                "examples": [
                    {
                        "en": "Government employees may be screened by the security services.",
                        "vi": "Các nhân viên chính phủ có thể được kiểm tra bởi các dịch vụ an ninh."
                    },
                    {
                        "en": "All foster parents are carefully screened.",
                        "vi": "Tất cả các bố mẹ nuôi đều được sàng lọc kỹ càng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to check something to see if it is suitable or if you want it",
                    "vi": "để kiểm tra một cái gì đó xem nó có phù hợp không hoặc nếu bạn muốn nó"
                },
                "examples": [
                    {
                        "en": "I use my voicemail to screen my phone calls.",
                        "vi": "Tôi sử dụng thư thoại để sàng lọc các cuộc gọi điện thoại của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to hide or protect something/somebody by placing something in front of or around them",
                    "vi": "để che giấu hoặc bảo vệ một cái gì đó / ai đó bằng cách đặt một cái gì đó trước mặt hoặc xung quanh họ"
                },
                "examples": [
                    {
                        "en": "Dark glasses screened his eyes from the sun.",
                        "vi": "Kính đen che mắt anh khỏi ánh nắng mặt trời."
                    },
                    {
                        "en": "She was driven away from the court, her face screened by a magazine.",
                        "vi": "Cô ấy đã bị đuổi khỏi tòa án, khuôn mặt của cô ấy bị soi bởi một tờ tạp chí."
                    }
                ]
            },
            {
                "define": {
                    "en": "to protect somebody from something dangerous or unpleasant, especially to protect somebody who has done something illegal or dishonest",
                    "vi": "để bảo vệ ai đó khỏi điều gì đó nguy hiểm hoặc khó chịu, đặc biệt là để bảo vệ ai đó đã làm điều gì đó bất hợp pháp hoặc không trung thực"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "8509b49011194516ae443069d9a141e1",
        "word": "screening",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈskriːnɪŋ/",
            "us": "/ˈskriːnɪŋ/"
        },
        "nearby": [
            {
                "word": "screen dump",
                "pos": "noun"
            },
            {
                "word": "screener",
                "pos": "noun"
            },
            {
                "word": "screening",
                "pos": "noun"
            },
            {
                "word": "screen name",
                "pos": "noun"
            },
            {
                "word": "screen off",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act of showing a film or television programme",
                    "vi": "hành động chiếu phim hoặc chương trình truyền hình"
                },
                "examples": [
                    {
                        "en": "This will be the movie's first screening in this country.",
                        "vi": "Đây sẽ là buổi chiếu đầu tiên của bộ phim tại quốc gia này."
                    }
                ]
            },
            {
                "define": {
                    "en": "the testing or examining of a large number of people or things for disease, faults, etc.",
                    "vi": "thử nghiệm hoặc kiểm tra một số lượng lớn người hoặc vật để tìm bệnh tật, lỗi, v.v."
                },
                "examples": [
                    {
                        "en": "breast cancer screening",
                        "vi": "tầm soát ung thư vú"
                    }
                ]
            }
        ]
    },
    {
        "id": "0134f556957244e1898d06ffe9faccd7",
        "word": "season",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈsiːzn/",
            "us": "/ˈsiːzn/"
        },
        "nearby": [
            {
                "word": "seaside",
                "pos": "adjective"
            },
            {
                "word": "seaside postcard",
                "pos": "noun"
            },
            {
                "word": "season",
                "pos": "noun"
            },
            {
                "word": "season",
                "pos": "verb"
            },
            {
                "word": "the Season",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "any of the four main periods of the year: spring, summer, autumn and winter",
                    "vi": "bất kỳ trong bốn thời kỳ chính của năm: xuân, hạ, thu, đông"
                },
                "examples": [
                    {
                        "en": "the changing seasons",
                        "vi": "những mùa thay đổi"
                    },
                    {
                        "en": "Autumn is my favourite season.",
                        "vi": "Mùa thu là mùa yêu thích của tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a period of the year in tropical countries when it is either very dry or it rains a lot",
                    "vi": "một khoảng thời gian trong năm ở các nước nhiệt đới khi trời rất khô hoặc mưa nhiều"
                },
                "examples": [
                    {
                        "en": "In this climate there are no real changes of temperature, just a wet and a dry season.",
                        "vi": "Trong khí hậu này không có sự thay đổi thực sự của nhiệt độ, chỉ có mùa ẩm và mùa khô."
                    },
                    {
                        "en": "Next month is the start of the rainy season.",
                        "vi": "Tháng sau là mùa mưa bắt đầu."
                    }
                ]
            },
            {
                "define": {
                    "en": "a period of time during a year when a particular activity happens or is done",
                    "vi": "một khoảng thời gian trong năm khi một hoạt động cụ thể xảy ra hoặc được thực hiện"
                },
                "examples": [
                    {
                        "en": "the cricket/football/hunting/shooting season",
                        "vi": "mùa cricket / bóng đá / săn bắn / bắn súng"
                    },
                    {
                        "en": "He scored his first goal of the season on Saturday.",
                        "vi": "Anh ấy đã ghi bàn thắng đầu tiên của mùa giải vào thứ Bảy."
                    },
                    {
                        "en": "They achieved their first win of the season.",
                        "vi": "Họ đã giành được chiến thắng đầu tiên trong mùa giải."
                    },
                    {
                        "en": "He will not be offered a new contract at the end of the season.",
                        "vi": "Anh ấy sẽ không được đề nghị hợp đồng mới vào cuối mùa giải."
                    },
                    {
                        "en": "The team have had a dream start to the season.",
                        "vi": "Đội đã có một khởi đầu mùa giải như mơ."
                    },
                    {
                        "en": "The female changes colour during the breeding season.",
                        "vi": "Con cái thay đổi màu sắc trong mùa sinh sản."
                    },
                    {
                        "en": "The growing season for these trees varies depending on species.",
                        "vi": "Mùa sinh trưởng của những cây này thay đổi tùy theo loài."
                    },
                    {
                        "en": "We're in the middle of the roughest hurricane season we've seen in quite some time.",
                        "vi": "Chúng ta đang ở giữa mùa bão khắc nghiệt nhất mà chúng ta từng thấy trong một thời gian khá dài."
                    },
                    {
                        "en": "The hotels are always full during the peak season (= when most people are on holiday).",
                        "vi": "Các khách sạn luôn kín phòng trong mùa cao điểm (= khi hầu hết mọi người đi nghỉ)."
                    },
                    {
                        "en": "(British English) the holiday season",
                        "vi": "(Tiếng Anh Anh) kỳ nghỉ lễ"
                    },
                    {
                        "en": "(especially North American English) the tourist season",
                        "vi": "(đặc biệt là tiếng Anh Bắc Mỹ) mùa du lịch"
                    },
                    {
                        "en": "(North American English) the holiday season (= the time of Thanksgiving, Hanukkah, Christmas and New Year)",
                        "vi": "(Tiếng Anh Bắc Mỹ) mùa lễ (= thời gian của Lễ tạ ơn, lễ Hanukkah, lễ Giáng sinh và năm mới)"
                    },
                    {
                        "en": "(British English) the festive season (= Christmas and New Year)",
                        "vi": "(Tiếng Anh Anh) mùa lễ hội (= Giáng sinh và Năm mới)"
                    },
                    {
                        "en": "the summer blockbuster season",
                        "vi": "mùa phim bom tấn mùa hè"
                    }
                ]
            },
            {
                "define": {
                    "en": "a period of time in which a play is shown in one place; a series of plays, films or television programmes",
                    "vi": "khoảng thời gian mà vở kịch được chiếu ở một nơi; một loạt vở kịch, phim hoặc chương trình truyền hình"
                },
                "examples": [
                    {
                        "en": "The play opens for a second season in London next week.",
                        "vi": "Vở kịch sẽ mở màn cho mùa thứ hai tại London vào tuần tới."
                    },
                    {
                        "en": "a season of films by Alfred Hitchcock",
                        "vi": "một mùa phim của Alfred Hitchcock"
                    }
                ]
            },
            {
                "define": {
                    "en": "a period of time during one year when a particular style of clothes, hair, etc. is popular and fashionable",
                    "vi": "một khoảng thời gian trong suốt một năm khi một kiểu quần áo, kiểu tóc cụ thể, v.v. được ưa chuộng và thời trang"
                },
                "examples": [
                    {
                        "en": "This season's look is soft and romantic.",
                        "vi": "Cái nhìn mùa này thật nhẹ nhàng và lãng mạn."
                    },
                    {
                        "en": "The fashion magazines are full of the new look for the spring season.",
                        "vi": "Các tạp chí thời trang tràn ngập diện mạo mới cho mùa xuân."
                    }
                ]
            },
            {
                "define": {
                    "en": "a set of television or radio programmes that have the same characters or deal with the same subject",
                    "vi": "một tập hợp các chương trình truyền hình hoặc đài phát thanh có các nhân vật giống nhau hoặc đề cập đến cùng một chủ đề"
                },
                "examples": [
                    {
                        "en": "The show begins its second season next week.",
                        "vi": "Chương trình sẽ bắt đầu mùa thứ hai vào tuần sau."
                    },
                    {
                        "en": "I binge-watched an entire season of ‘Mad Men’ (= watched all of the episodes on one occasion) on Sunday.",
                        "vi": "Tôi đã xem toàn bộ một phần của 'Mad Men' (= xem tất cả các tập cùng một lúc) vào Chủ nhật."
                    },
                    {
                        "en": "I can't wait to see the season finale (= last episode in the season).",
                        "vi": "Tôi nóng lòng muốn xem phần cuối cùng (= tập cuối cùng trong phần)."
                    },
                    {
                        "en": "the season opener (= the first episode in the season)",
                        "vi": "phần mở đầu (= tập đầu tiên trong phần)"
                    }
                ]
            },
            {
                "define": {
                    "en": "be/become easily available and ready to eat because it is the right time of year for them",
                    "vi": "trở nên dễ dàng sẵn có và sẵn sàng để ăn vì đây là thời điểm thích hợp trong năm đối với họ"
                },
                "examples": [
                    {
                        "en": "Strawberries are now in season.",
                        "vi": "Dâu tây hiện đã vào mùa."
                    },
                    {
                        "en": "Melons are just coming into season.",
                        "vi": "Các loại dưa vừa vào mùa."
                    }
                ]
            },
            {
                "define": {
                    "en": "be/become ready to have sex and produce young",
                    "vi": "sẵn sàng để quan hệ tình dục và sinh ra trẻ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "not easily available because it is not the right time of year for them",
                    "vi": "không dễ dàng có sẵn vì đây không phải là thời điểm thích hợp trong năm cho họ"
                },
                "examples": [
                    {
                        "en": "Lobster's out of season right now.",
                        "vi": "Lobster hiện đã hết mùa."
                    }
                ]
            },
            {
                "define": {
                    "en": "at the times of year when few people go on holiday",
                    "vi": "vào những thời điểm trong năm khi ít người đi nghỉ"
                },
                "examples": [
                    {
                        "en": "Hotels are cheaper out of season.",
                        "vi": "Khách sạn rẻ hơn trái mùa."
                    }
                ]
            },
            {
                "define": {
                    "en": "used during the Christmas period to wish somebody a pleasant holiday",
                    "vi": "được sử dụng trong thời kỳ Giáng sinh để chúc ai đó một kỳ nghỉ vui vẻ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "fb3e86cc2d71407e9afa4f8d52902e60",
        "word": "subtitle",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈsʌbtaɪtl/",
            "us": "/ˈsʌbtaɪtl/"
        },
        "nearby": [
            {
                "word": "subterranean",
                "pos": "adjective"
            },
            {
                "word": "subtext",
                "pos": "noun"
            },
            {
                "word": "subtitle",
                "pos": "noun"
            },
            {
                "word": "subtitle",
                "pos": "verb"
            },
            {
                "word": "subtle",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "words that translate what is said in a film into a different language and appear on the screen at the bottom. Subtitles are also used, especially on television, to help deaf people (= people who cannot hear well)",
                    "vi": "các từ dịch những gì được nói trong phim sang một ngôn ngữ khác và xuất hiện trên màn hình ở dưới cùng. Phụ đề cũng được sử dụng, đặc biệt là trên truyền hình, để giúp đỡ những người khiếm thính (= những người không thể nghe rõ)"
                },
                "examples": [
                    {
                        "en": "a Polish film with English subtitles",
                        "vi": "một bộ phim Ba Lan có phụ đề tiếng Anh"
                    },
                    {
                        "en": "Is the movie dubbed or are there subtitles?",
                        "vi": "Phim được lồng tiếng hay có phụ đề?"
                    },
                    {
                        "en": "This programme will be broadcast with subtitles for the hard of hearing.",
                        "vi": "Chương trình này sẽ được phát sóng với phụ đề dành cho người khiếm thính."
                    }
                ]
            },
            {
                "define": {
                    "en": "a second title of a book that appears after the main title and gives more information",
                    "vi": "tiêu đề thứ hai của sách xuất hiện sau tiêu đề chính và cung cấp thêm thông tin"
                },
                "examples": [
                    {
                        "en": "This book’s title is ‘Oxford Learner’s Thesaurus’. Its subtitle is ‘A dictionary of synonyms’.",
                        "vi": "Tên cuốn sách này là 'Từ đồng nghĩa của Người học Oxford'. Phụ đề của nó là 'Từ điển các từ đồng nghĩa'."
                    }
                ]
            }
        ]
    },
    {
        "id": "5ca2b68b26114beebb56b8c854783365",
        "word": "Blu-ray",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈbluː reɪ/",
            "us": "/ˈbluː reɪ/"
        },
        "nearby": [
            {
                "word": "blur",
                "pos": "verb"
            },
            {
                "word": "Blur",
                "pos": ""
            },
            {
                "word": "Blu-ray",
                "pos": "noun"
            },
            {
                "word": "Blu-ray Disc",
                "pos": "noun"
            },
            {
                "word": "blurb",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "technology that uses a blue laser (= a very strong line of light) to record and play large amounts of high quality data on a type of DVD",
                    "vi": "công nghệ sử dụng tia laser xanh lam (= một dòng ánh sáng rất mạnh) để ghi và phát một lượng lớn dữ liệu chất lượng cao trên một loại DVD"
                },
                "examples": [
                    {
                        "en": "These high definition movies are all out on Blu-ray.",
                        "vi": "Những bộ phim độ nét cao này đều có trên Blu-ray."
                    }
                ]
            }
        ]
    },
    {
        "id": "01f1299c2e11479eaaa2d0f5171eeffe",
        "word": "Blu-ray Disc™",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈbluː reɪ dɪsk/",
            "us": "/ˈbluː reɪ dɪsk/"
        },
        "nearby": [
            {
                "word": "Blur",
                "pos": ""
            },
            {
                "word": "Blu-ray",
                "pos": "noun"
            },
            {
                "word": "Blu-ray Disc",
                "pos": "noun"
            },
            {
                "word": "blurb",
                "pos": "noun"
            },
            {
                "word": "blurred",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a type of DVD on which large amounts of data can be stored, used especially to play high quality video",
                    "vi": "một loại DVD có thể lưu trữ một lượng lớn dữ liệu, được sử dụng đặc biệt để phát video chất lượng cao"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "f2bdbc24af9943f4a0fbb64d5a9e8f54",
        "word": "HD",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌeɪtʃ ˈdiː/",
            "us": "/ˌeɪtʃ ˈdiː/"
        },
        "nearby": [
            {
                "word": "HCF",
                "pos": "abbreviation"
            },
            {
                "word": "HCFC",
                "pos": "noun"
            },
            {
                "word": "HD",
                "pos": "noun"
            },
            {
                "word": "HDI",
                "pos": "abbreviation"
            },
            {
                "word": "HDMI",
                "pos": "abbreviation"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a system that gives television, film or video images that are extremely high quality, with very clear, sharp outlines and details (the abbreviation for ‘high-definition’)",
                    "vi": "một hệ thống cung cấp hình ảnh truyền hình, phim hoặc video có chất lượng cực cao, với các đường nét và chi tiết rất rõ ràng, sắc nét (viết tắt của 'độ nét cao')"
                },
                "examples": [
                    {
                        "en": "in HD The film was shot in HD.",
                        "vi": "ở HD Bộ phim được quay ở chất lượng HD."
                    },
                    {
                        "en": "HD-ready television sets",
                        "vi": "TV chuẩn HD"
                    }
                ]
            }
        ]
    },
    {
        "id": "128041bf45f04e7bb94d07d8da295b42",
        "word": "multiplex",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈmʌltɪpleks/",
            "us": "/ˈmʌltɪpleks/"
        },
        "nearby": [
            {
                "word": "multiple personality disorder",
                "pos": "noun"
            },
            {
                "word": "multiple sclerosis",
                "pos": "noun"
            },
            {
                "word": "multiplex",
                "pos": "noun"
            },
            {
                "word": "multiplication",
                "pos": "noun"
            },
            {
                "word": "multiplication table",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a large cinema with several separate rooms with screens",
                    "vi": "một rạp chiếu phim lớn với một số phòng riêng biệt có màn hình"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "31016ca48f0e43bfb3a782ac46c1e7c3",
        "word": "premiere",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈpremieə(r)/",
            "us": "/prɪˈmɪr/"
        },
        "nearby": [
            {
                "word": "premier",
                "pos": "adjective"
            },
            {
                "word": "premier",
                "pos": "noun"
            },
            {
                "word": "premiere",
                "pos": "noun"
            },
            {
                "word": "premiere",
                "pos": "verb"
            },
            {
                "word": "the Premier League",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the first public performance of a film or play",
                    "vi": "buổi trình diễn đầu tiên trước công chúng của một bộ phim hoặc vở kịch"
                },
                "examples": [
                    {
                        "en": "the world premiere of his new play",
                        "vi": "buổi ra mắt thế giới vở kịch mới của anh ấy"
                    },
                    {
                        "en": "The movie will have its premiere in July.",
                        "vi": "Phim sẽ khởi chiếu vào tháng 7."
                    }
                ]
            }
        ]
    },
    {
        "id": "b8384860e9424f428286c4f22f6ef348",
        "word": "projector",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/prəˈdʒektə(r)/",
            "us": "/prəˈdʒektər/"
        },
        "nearby": [
            {
                "word": "projectionist",
                "pos": "noun"
            },
            {
                "word": "project onto",
                "pos": "phrasal verb"
            },
            {
                "word": "projector",
                "pos": "noun"
            },
            {
                "word": "prokaryote",
                "pos": "noun"
            },
            {
                "word": "prokaryotic",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a piece of equipment for projecting photographs, films or computer slides onto a screen",
                    "vi": "một phần của thiết bị để chiếu ảnh, phim hoặc trình chiếu máy tính lên màn hình"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "ed39263e49754c06a2d14af006b10484",
        "word": "showing",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈʃəʊɪŋ/",
            "us": "/ˈʃəʊɪŋ/"
        },
        "nearby": [
            {
                "word": "showily",
                "pos": "adverb"
            },
            {
                "word": "showiness",
                "pos": "noun"
            },
            {
                "word": "showing",
                "pos": "noun"
            },
            {
                "word": "showjumping",
                "pos": "noun"
            },
            {
                "word": "showman",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an act of showing a film",
                    "vi": "một hành động chiếu phim"
                },
                "examples": [
                    {
                        "en": "There are three showings a day.",
                        "vi": "Có ba suất chiếu một ngày."
                    }
                ]
            },
            {
                "define": {
                    "en": "evidence of how well or how badly somebody/something is performing",
                    "vi": "bằng chứng về việc ai đó / điều gì đó đang hoạt động tốt hay tệ như thế nào"
                },
                "examples": [
                    {
                        "en": "the strong/poor showing of the Green Party in the election",
                        "vi": "sự thể hiện mạnh mẽ / kém cỏi của Đảng Xanh trong cuộc bầu cử"
                    },
                    {
                        "en": "On (= judging by) last week's showing, the team is unlikely to win today.",
                        "vi": "Theo (= đánh giá theo) màn trình diễn của tuần trước, đội không có khả năng giành chiến thắng trong ngày hôm nay."
                    }
                ]
            }
        ]
    },
    {
        "id": "e6e4aaf42808461f8ef0d14aa1fe4b48",
        "word": "the big screen",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ðə ˌbɪɡ ˈskriːn/",
            "us": "/ðə ˌbɪɡ ˈskriːn/"
        },
        "nearby": [
            {
                "word": "Big Pharma",
                "pos": "noun"
            },
            {
                "word": "bigs",
                "pos": "noun"
            },
            {
                "word": "the big screen",
                "pos": "noun"
            },
            {
                "word": "the big smoke",
                "pos": "noun"
            },
            {
                "word": "Big Sur",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the cinema (when contrasted with television)",
                    "vi": "rạp chiếu phim (khi đối chiếu với tivi)"
                },
                "examples": [
                    {
                        "en": "The movie hits the big screen in July.",
                        "vi": "Phim lên sóng màn ảnh rộng vào tháng 7."
                    },
                    {
                        "en": "her first big-screen success",
                        "vi": "thành công trên màn ảnh rộng đầu tiên của cô ấy"
                    }
                ]
            }
        ]
    },
    {
        "id": "e498b63c3b8d4cbe8fef8e4e5081b0a3",
        "word": "drive-in",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈdraɪv ɪn/",
            "us": "/ˈdraɪv ɪn/"
        },
        "nearby": [
            {
                "word": "drive down",
                "pos": "phrasal verb"
            },
            {
                "word": "drive-in",
                "pos": "adjective"
            },
            {
                "word": "drive-in",
                "pos": "noun"
            },
            {
                "word": "drivel",
                "pos": "noun"
            },
            {
                "word": "drivel",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a place where you can watch films, eat, etc. without leaving your car",
                    "vi": "nơi bạn có thể xem phim, ăn uống, v.v. mà không cần rời khỏi xe"
                },
                "examples": [
                    {
                        "en": "We stopped at a drive-in for a hamburger.",
                        "vi": "Chúng tôi dừng lại ở một ổ đĩa để ăn một chiếc bánh hamburger."
                    }
                ]
            }
        ]
    },
    {
        "id": "c5d3da14f95e41abb9cf5bbf1e3e5cf5",
        "word": "matinee",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmætɪneɪ/",
            "us": "/ˌmætnˈeɪ/"
        },
        "nearby": [
            {
                "word": "maths",
                "pos": "noun"
            },
            {
                "word": "Matilda",
                "pos": "noun"
            },
            {
                "word": "matinee",
                "pos": "noun"
            },
            {
                "word": "matinee idol",
                "pos": "noun"
            },
            {
                "word": "mating",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an afternoon performance of a play, etc.; an afternoon showing of a film",
                    "vi": "buổi chiều biểu diễn một vở kịch, v.v ...; một buổi chiều chiếu phim"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "f42615ed2030404abcea86436296a815",
        "word": "running time",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈrʌnɪŋ taɪm/",
            "us": "/ˈrʌnɪŋ taɪm/"
        },
        "nearby": [
            {
                "word": "running sore",
                "pos": "noun"
            },
            {
                "word": "running start",
                "pos": "noun"
            },
            {
                "word": "running time",
                "pos": "noun"
            },
            {
                "word": "running total",
                "pos": "noun"
            },
            {
                "word": "runny",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the amount of time that a film, a journey, etc. lasts",
                    "vi": "lượng thời gian mà một bộ phim, một cuộc hành trình, v.v. kéo dài"
                },
                "examples": [
                    {
                        "en": "The programme’s running time is 94 minutes.",
                        "vi": "Thời gian chạy của chương trình là 94 phút."
                    },
                    {
                        "en": "The new service will cut 14 minutes off the running time of the journey.",
                        "vi": "Tuyến mới sẽ cắt giảm 14 phút thời gian chạy của hành trình."
                    }
                ]
            }
        ]
    },
    {
        "id": "e49cb3ed31fa4ddf96cd8598f52c25a9",
        "word": "the silver screen",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ðə ˌsɪlvə ˈskriːn/",
            "us": "/ðə ˌsɪlvər ˈskriːn/"
        },
        "nearby": [
            {
                "word": "silver-plated",
                "pos": "adjective"
            },
            {
                "word": "Phil Silvers",
                "pos": ""
            },
            {
                "word": "the silver screen",
                "pos": "noun"
            },
            {
                "word": "silver service",
                "pos": "noun"
            },
            {
                "word": "silverside",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the film industry",
                    "vi": "ngành công nghiệp điện ảnh"
                },
                "examples": [
                    {
                        "en": "stars of the silver screen",
                        "vi": "những ngôi sao của màn bạc"
                    },
                    {
                        "en": "The book is being adapted for the silver screen.",
                        "vi": "Cuốn sách đang được chuyển thể lên màn bạc."
                    }
                ]
            }
        ]
    },
    {
        "id": "581c49fcfcf144cb944c570d7be30f0f",
        "word": "still",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/stɪl/",
            "us": "/stɪl/"
        },
        "nearby": [
            {
                "word": "still",
                "pos": "adverb"
            },
            {
                "word": "still",
                "pos": "adjective"
            },
            {
                "word": "still",
                "pos": "noun"
            },
            {
                "word": "still",
                "pos": "verb"
            },
            {
                "word": "stillbirth",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a photograph of a scene from a film or video",
                    "vi": "một bức ảnh của một cảnh từ phim hoặc video"
                },
                "examples": [
                    {
                        "en": "a publicity still from his new movie",
                        "vi": "vẫn còn công khai từ bộ phim mới của anh ấy"
                    },
                    {
                        "en": "The police studied the stills from the security video.",
                        "vi": "Cảnh sát đã nghiên cứu các ảnh tĩnh từ video an ninh."
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of equipment that is used for making strong alcoholic drinks",
                    "vi": "một thiết bị được sử dụng để pha chế đồ uống có cồn mạnh"
                },
                "examples": [
                    {
                        "en": "a whisky still",
                        "vi": "rượu whisky vẫn còn"
                    }
                ]
            }
        ]
    }
]