[
    {
        "id": "481df39676ee453789abbdaf6b5cf84e",
        "word": "style",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/staɪl/",
            "us": "/staɪl/"
        },
        "nearby": [
            {
                "word": "sty",
                "pos": "noun"
            },
            {
                "word": "Stygian",
                "pos": "adjective"
            },
            {
                "word": "style",
                "pos": "noun"
            },
            {
                "word": "style",
                "pos": "verb"
            },
            {
                "word": "style on",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the particular way in which something is done",
                    "vi": "cách cụ thể trong đó một cái gì đó được thực hiện"
                },
                "examples": [
                    {
                        "en": "a wide range of musical styles",
                        "vi": "một loạt các phong cách âm nhạc"
                    },
                    {
                        "en": "They want a wide range of learning resources to suit different learning styles.",
                        "vi": "Họ muốn có nhiều nguồn tài liệu học tập để phù hợp với các phong cách học tập khác nhau."
                    },
                    {
                        "en": "a management style",
                        "vi": "một phong cách quản lý"
                    },
                    {
                        "en": "style of something a style of management",
                        "vi": "phong cách của một cái gì đó một phong cách quản lý"
                    },
                    {
                        "en": "furniture to suit your style of living",
                        "vi": "đồ nội thất phù hợp với phong cách sống của bạn"
                    },
                    {
                        "en": "His aggressive style of play sometimes gets him in trouble.",
                        "vi": "Phong cách thi đấu hung hãn của anh ấy đôi khi khiến anh ấy gặp rắc rối."
                    },
                    {
                        "en": "I really enjoy playing this style of music.",
                        "vi": "Tôi thực sự thích chơi phong cách âm nhạc này."
                    },
                    {
                        "en": "I like your style (= I like the way you do things).",
                        "vi": "I like your style (= Tôi thích cách bạn làm mọi việc)."
                    },
                    {
                        "en": "Caution was not her style (= not the way she usually behaved).",
                        "vi": "Thận trọng không phải là phong cách của cô ấy (= không phải cách cô ấy thường cư xử)."
                    },
                    {
                        "en": "I'm surprised he rides a motorbike—I'd have thought big cars were more his style (= what suited him).",
                        "vi": "Tôi ngạc nhiên khi anh ấy đi xe máy - Tôi đã nghĩ rằng những chiếc xe lớn phù hợp với phong cách của anh ấy hơn (= những gì phù hợp với anh ấy)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a particular design of something, especially clothes",
                    "vi": "một thiết kế cụ thể của một cái gì đó, đặc biệt là quần áo"
                },
                "examples": [
                    {
                        "en": "We stock a wide variety of styles and sizes.",
                        "vi": "Chúng tôi có rất nhiều kiểu dáng và kích cỡ khác nhau."
                    },
                    {
                        "en": "Have you thought about having your hair in a shorter style?",
                        "vi": "Bạn đã nghĩ đến việc để tóc theo kiểu ngắn hơn chưa?"
                    },
                    {
                        "en": "a style that was popular in the 1950s",
                        "vi": "một phong cách phổ biến vào những năm 1950"
                    }
                ]
            },
            {
                "define": {
                    "en": "the quality of being fashionable in the clothes that you wear",
                    "vi": "chất lượng thời trang của quần áo bạn mặc"
                },
                "examples": [
                    {
                        "en": "style-conscious teenagers",
                        "vi": "thanh thiếu niên có ý thức về phong cách"
                    },
                    {
                        "en": "Some people have no sense of style.",
                        "vi": "Một số người không có ý thức về phong cách."
                    },
                    {
                        "en": "in style Short skirts are back in style (= fashionable).",
                        "vi": "theo phong cách Váy ngắn đã trở lại trong phong cách (= thời trang)."
                    },
                    {
                        "en": "They still refer to her as a style guru and a trend-setter.",
                        "vi": "Họ vẫn coi cô ấy là một phong cách sành điệu và một người bắt kịp xu hướng."
                    }
                ]
            },
            {
                "define": {
                    "en": "the quality of being attractive and made or done to a high standard",
                    "vi": "chất lượng hấp dẫn và được thực hiện hoặc thực hiện với tiêu chuẩn cao"
                },
                "examples": [
                    {
                        "en": "The hotel has been redecorated but it's lost a lot of its style.",
                        "vi": "Khách sạn đã được trang trí lại nhưng nó đã mất đi rất nhiều phong cách."
                    },
                    {
                        "en": "This movie is all surface style and no substance.",
                        "vi": "Phim này toàn là phong cách bề nổi và không có thực chất."
                    },
                    {
                        "en": "She does everything with style and grace.",
                        "vi": "Cô ấy làm mọi thứ với phong cách và sự duyên dáng."
                    }
                ]
            },
            {
                "define": {
                    "en": "the features of a book, painting, building, etc. that make it typical of a particular author, artist, historical period, etc.",
                    "vi": "các tính năng của một cuốn sách, bức tranh, tòa nhà, v.v. làm cho cuốn sách đó trở thành tiêu biểu của một tác giả, nghệ sĩ cụ thể, giai đoạn lịch sử, v.v."
                },
                "examples": [
                    {
                        "en": "style (of something) a style of architecture",
                        "vi": "phong cách (của cái gì đó) một phong cách kiến trúc"
                    },
                    {
                        "en": "a fine example of Gothic style",
                        "vi": "một ví dụ điển hình về phong cách Gothic"
                    },
                    {
                        "en": "The film has a unique visual style.",
                        "vi": "Bộ phim có một phong cách hình ảnh độc đáo."
                    },
                    {
                        "en": "He developed a distinctive style of painting.",
                        "vi": "Ông đã phát triển một phong cách hội họa đặc biệt."
                    },
                    {
                        "en": "in the style of somebody/something a parody written in the style of Molière",
                        "vi": "theo phong cách của ai đó / một thứ gì đó nhại được viết theo phong cách của Molière"
                    },
                    {
                        "en": "The palace was rebuilt in the same style.",
                        "vi": "Cung điện được xây dựng lại theo cùng một phong cách."
                    }
                ]
            },
            {
                "define": {
                    "en": "the correct use of language",
                    "vi": "sử dụng đúng ngôn ngữ"
                },
                "examples": [
                    {
                        "en": "It's not considered good style to start a sentence with ‘but’.",
                        "vi": "Nó không được coi là phong cách tốt để bắt đầu một câu bằng 'nhưng'."
                    },
                    {
                        "en": "Please follow house style (= the rules of spelling, etc. used by a particular publishing company).",
                        "vi": "Vui lòng tuân theo kiểu nội dung (= quy tắc chính tả, v.v. được sử dụng bởi một công ty xuất bản cụ thể)."
                    }
                ]
            },
            {
                "define": {
                    "en": "having the type of style mentioned",
                    "vi": "có loại phong cách được đề cập"
                },
                "examples": [
                    {
                        "en": "Italian-style gardens",
                        "vi": "Khu vườn kiểu Ý"
                    },
                    {
                        "en": "a buffet-style breakfast",
                        "vi": "bữa sáng kiểu tự chọn"
                    }
                ]
            },
            {
                "define": {
                    "en": "the long, thin part of a flower that carries the stigma",
                    "vi": "phần dài, mỏng của hoa mang đầu nhụy."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to stop somebody from behaving in the way they want to",
                    "vi": "để ngăn ai đó cư xử theo cách họ muốn"
                },
                "examples": [
                    {
                        "en": "She didn’t want me to go with her to the party in case I cramped her style.",
                        "vi": "Cô ấy không muốn tôi đi cùng cô ấy đến bữa tiệc trong trường hợp tôi hạn chế phong cách của cô ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "in an impressive way",
                    "vi": "theo một cách ấn tượng"
                },
                "examples": [
                    {
                        "en": "She always celebrates her birthday in style.",
                        "vi": "Cô ấy luôn tổ chức sinh nhật theo phong cách riêng."
                    },
                    {
                        "en": "He won the championship in great style.",
                        "vi": "Anh ấy đã giành chức vô địch bằng phong cách tuyệt vời."
                    }
                ]
            }
        ]
    },
    {
        "id": "1e9528bd756842fba918d723c9873c84",
        "word": "historical",
        "pos": "adjective",
        "level": "b1",
        "phonetic": {
            "uk": "/hɪˈstɒrɪkl/",
            "us": "/hɪˈstɔːrɪkl/"
        },
        "nearby": [
            {
                "word": "historiated",
                "pos": "adjective"
            },
            {
                "word": "historic",
                "pos": "adjective"
            },
            {
                "word": "historical",
                "pos": "adjective"
            },
            {
                "word": "historical linguistics",
                "pos": "noun"
            },
            {
                "word": "historically",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "connected with the past",
                    "vi": "kết nối với quá khứ"
                },
                "examples": [
                    {
                        "en": "You must place these events in their historical context.",
                        "vi": "Bạn phải đặt những sự kiện này trong bối cảnh lịch sử của chúng."
                    },
                    {
                        "en": "stories based on historical fact",
                        "vi": "những câu chuyện dựa trên thực tế lịch sử"
                    },
                    {
                        "en": "This book provides a historical perspective.",
                        "vi": "Cuốn sách này cung cấp một quan điểm lịch sử."
                    },
                    {
                        "en": "one of the greatest historical figures of all time, Alexander the Great",
                        "vi": "một trong những nhân vật lịch sử vĩ đại nhất mọi thời đại, Alexander Đại đế"
                    }
                ]
            },
            {
                "define": {
                    "en": "connected with the study of history",
                    "vi": "kết nối với nghiên cứu lịch sử"
                },
                "examples": [
                    {
                        "en": "historical documents/records/research",
                        "vi": "tài liệu lịch sử / hồ sơ / nghiên cứu"
                    },
                    {
                        "en": "historical evidence provided by scholars",
                        "vi": "bằng chứng lịch sử được cung cấp bởi các học giả"
                    },
                    {
                        "en": "The building is of historical importance.",
                        "vi": "Tòa nhà có tầm quan trọng lịch sử."
                    }
                ]
            },
            {
                "define": {
                    "en": "about people and events in the past",
                    "vi": "về những người và sự kiện trong quá khứ"
                },
                "examples": [
                    {
                        "en": "a historical novel/setting",
                        "vi": "một cuốn tiểu thuyết lịch sử / bối cảnh"
                    },
                    {
                        "en": "Good historical fiction sheds light on the past.",
                        "vi": "Tiểu thuyết lịch sử hay làm sáng tỏ quá khứ."
                    }
                ]
            }
        ]
    },
    {
        "id": "0736e27a24a54e6f9d2ad2493f7977cc",
        "word": "original",
        "pos": "adjective",
        "level": "b1",
        "phonetic": {
            "uk": "/əˈrɪdʒənl/",
            "us": "/əˈrɪdʒənl/"
        },
        "nearby": [
            {
                "word": "origami",
                "pos": "noun"
            },
            {
                "word": "origin",
                "pos": "noun"
            },
            {
                "word": "original",
                "pos": "adjective"
            },
            {
                "word": "original",
                "pos": "noun"
            },
            {
                "word": "originality",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "existing at the beginning of a particular period, process or activity",
                    "vi": "tồn tại ở đầu một giai đoạn, quy trình hoặc hoạt động cụ thể"
                },
                "examples": [
                    {
                        "en": "The room still has many of its original features.",
                        "vi": "Căn phòng vẫn còn nhiều đặc điểm ban đầu."
                    },
                    {
                        "en": "I think you should go back to your original plan.",
                        "vi": "Tôi nghĩ bạn nên quay lại kế hoạch ban đầu của mình."
                    },
                    {
                        "en": "At the end of the lease, the land will be returned to the original owner.",
                        "vi": "Khi kết thúc hợp đồng thuê, đất sẽ được trả lại cho chủ sở hữu ban đầu."
                    },
                    {
                        "en": "the original stage version of ‘A Streetcar Named Desire’",
                        "vi": "phiên bản sân khấu ban đầu của 'A Streetcar Named Desire'"
                    },
                    {
                        "en": "The original intention was to record about 80 speakers, divided equally between males and females.",
                        "vi": "Dự định ban đầu là thu âm khoảng 80 người nói, chia đều cho nam và nữ."
                    }
                ]
            },
            {
                "define": {
                    "en": "new and interesting in a way that is different from anything that has existed before; able to produce new and interesting ideas",
                    "vi": "mới và thú vị theo một cách khác với bất cứ điều gì đã có trước đây; có thể đưa ra những ý tưởng mới và thú vị"
                },
                "examples": [
                    {
                        "en": "an original idea",
                        "vi": "một ý tưởng ban đầu"
                    },
                    {
                        "en": "That's not a very original suggestion.",
                        "vi": "Đó không phải là một gợi ý ban đầu."
                    },
                    {
                        "en": "an original thinker",
                        "vi": "một nhà tư tưởng ban đầu"
                    },
                    {
                        "en": "the product of a highly original mind",
                        "vi": "sản phẩm của một trí óc nguyên bản cao độ"
                    },
                    {
                        "en": "It's a taut, fast-moving detective story with strikingly original characters.",
                        "vi": "Đó là một câu chuyện trinh thám căng thẳng, diễn biến nhanh với các nhân vật gốc nổi bật."
                    },
                    {
                        "en": "I don't think this is a truly original idea.",
                        "vi": "Tôi không nghĩ rằng đây là một ý tưởng thực sự ban đầu."
                    },
                    {
                        "en": "He believes that he is creating something wholly original.",
                        "vi": "Anh ấy tin rằng anh ấy đang tạo ra thứ gì đó hoàn toàn nguyên bản."
                    }
                ]
            },
            {
                "define": {
                    "en": "painted, written, etc. by the artist rather than copied",
                    "vi": "do nghệ sĩ vẽ, viết, v.v. thay vì sao chép"
                },
                "examples": [
                    {
                        "en": "an original painting by local artist Graham Tovey",
                        "vi": "một bức tranh gốc của nghệ sĩ địa phương Graham Tovey"
                    },
                    {
                        "en": "The original manuscript has been lost.",
                        "vi": "Bản thảo gốc đã bị mất."
                    },
                    {
                        "en": "Only original documents (= not photocopies) will be accepted as proof of status.",
                        "vi": "Chỉ các tài liệu gốc (= không phải bản sao) mới được chấp nhận làm bằng chứng về tình trạng."
                    }
                ]
            }
        ]
    },
    {
        "id": "c6abb417d46c40f8ad1224c14be93b88",
        "word": "believable",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/bɪˈliːvəbl/",
            "us": "/bɪˈliːvəbl/"
        },
        "nearby": [
            {
                "word": "belie",
                "pos": "verb"
            },
            {
                "word": "belief",
                "pos": "noun"
            },
            {
                "word": "believable",
                "pos": "adjective"
            },
            {
                "word": "believe",
                "pos": "verb"
            },
            {
                "word": "believe in",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "that can be believed",
                    "vi": "điều đó có thể được tin tưởng"
                },
                "examples": [
                    {
                        "en": "Her explanation certainly sounded believable.",
                        "vi": "Lời giải thích của cô ấy chắc chắn có vẻ đáng tin."
                    },
                    {
                        "en": "a play with believable characters",
                        "vi": "một vở kịch với những nhân vật đáng tin cậy"
                    }
                ]
            }
        ]
    },
    {
        "id": "532c4990487c4ca5b1b212846d2f807c",
        "word": "comic",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈkɒmɪk/",
            "us": "/ˈkɑːmɪk/"
        },
        "nearby": [
            {
                "word": "comfrey",
                "pos": "noun"
            },
            {
                "word": "comfy",
                "pos": "adjective"
            },
            {
                "word": "comic",
                "pos": "adjective"
            },
            {
                "word": "comic",
                "pos": "noun"
            },
            {
                "word": "comical",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "humorous and making you laugh",
                    "vi": "hài hước và khiến bạn cười"
                },
                "examples": [
                    {
                        "en": "a comic monologue/story",
                        "vi": "một câu chuyện / độc thoại truyện tranh"
                    },
                    {
                        "en": "The play is both comic and tragic.",
                        "vi": "Vở kịch vừa hài hước vừa bi kịch."
                    },
                    {
                        "en": "She can always be relied on to provide comic relief (= something to make you laugh) at a boring party.",
                        "vi": "Cô ấy luôn có thể được dựa vào để giải tỏa truyện tranh (= thứ gì đó để khiến bạn cười) trong một bữa tiệc buồn tẻ."
                    },
                    {
                        "en": "He wore a red nose and novelty glasses for comic effect.",
                        "vi": "Anh ta đeo một chiếc mũi đỏ và đeo kính mới để tạo hiệu ứng truyện tranh."
                    },
                    {
                        "en": "a blackly comic futuristic fantasy",
                        "vi": "một truyện tranh viễn tưởng tương lai màu đen"
                    }
                ]
            },
            {
                "define": {
                    "en": "connected with comedy (= entertainment that is funny and that makes people laugh)",
                    "vi": "kết nối với hài kịch (= giải trí hài hước và khiến mọi người cười)"
                },
                "examples": [
                    {
                        "en": "a comic opera",
                        "vi": "một vở opera truyện tranh"
                    },
                    {
                        "en": "a very fine comic actor",
                        "vi": "một diễn viên truyện tranh rất giỏi"
                    },
                    {
                        "en": "Charlie Chaplin was a comic genius.",
                        "vi": "Charlie Chaplin là một thiên tài truyện tranh."
                    }
                ]
            }
        ]
    },
    {
        "id": "c334aba309bc4006b06ce98508cff00f",
        "word": "image",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈɪmɪdʒ/",
            "us": "/ˈɪmɪdʒ/"
        },
        "nearby": [
            {
                "word": "I'm",
                "pos": "short form"
            },
            {
                "word": "I'm A Celebrity … Get Me Out Of Here!",
                "pos": ""
            },
            {
                "word": "image",
                "pos": "noun"
            },
            {
                "word": "imagery",
                "pos": "noun"
            },
            {
                "word": "imagesetter",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a picture, photograph or statue that represents somebody/something",
                    "vi": "một bức tranh, ảnh chụp hoặc bức tượng đại diện cho ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "Most simple leaflets will include text and images.",
                        "vi": "Hầu hết các tờ rơi đơn giản sẽ bao gồm văn bản và hình ảnh."
                    },
                    {
                        "en": "We already have more than 22  000 digital images on file.",
                        "vi": "Chúng tôi đã có hơn 22 000 hình ảnh kỹ thuật số trong hồ sơ."
                    },
                    {
                        "en": "The visual image is steadily replacing the written word.",
                        "vi": "Hình ảnh trực quan đang dần thay thế chữ viết."
                    },
                    {
                        "en": "image of somebody/something Images of deer and hunters decorate the cave walls.",
                        "vi": "hình ảnh của ai đó / cái gì đó Hình ảnh của những con nai và những người thợ săn được trang trí trên các bức tường hang động."
                    },
                    {
                        "en": "Consider the images of war that fill the pages of our newspapers.",
                        "vi": "Hãy xem những hình ảnh chiến tranh tràn ngập các trang báo của chúng ta."
                    },
                    {
                        "en": "a wooden image of the Hindu god Ganesh",
                        "vi": "hình ảnh bằng gỗ của thần Ganesh trong đạo Hindu"
                    },
                    {
                        "en": "An exhibition of images of St Nicholas is on display in the cathedral.",
                        "vi": "Một cuộc triển lãm hình ảnh của St Nicholas được trưng bày trong nhà thờ."
                    },
                    {
                        "en": "in the image of somebody/something In the Bible it states that humans were created in the image of God.",
                        "vi": "trong hình ảnh của ai đó / cái gì đó Trong Kinh thánh nói rằng con người được tạo ra theo hình ảnh của Đức Chúa Trời."
                    }
                ]
            },
            {
                "define": {
                    "en": "a picture of somebody/something seen in a mirror, through a camera, or on a television, computer, phone, etc.",
                    "vi": "hình ảnh của ai đó / thứ gì đó được nhìn thấy trong gương, qua máy ảnh hoặc trên tivi, máy tính, điện thoại, v.v."
                },
                "examples": [
                    {
                        "en": "He stared at his own image reflected in the water.",
                        "vi": "Anh nhìn chằm chằm vào hình ảnh của chính mình phản chiếu trong nước."
                    },
                    {
                        "en": "Slowly, an image began to appear on the screen.",
                        "vi": "Từ từ, một hình ảnh bắt đầu xuất hiện trên màn hình."
                    },
                    {
                        "en": "Click on the image for a larger version.",
                        "vi": "Bấm vào hình ảnh cho một phiên bản lớn hơn."
                    },
                    {
                        "en": "image from something Police will study the images from CCTV cameras.",
                        "vi": "hình ảnh từ thứ gì đó Cảnh sát sẽ nghiên cứu hình ảnh từ camera CCTV."
                    },
                    {
                        "en": "image of something The camera captured an image of the suspect and his car.",
                        "vi": "hình ảnh của thứ gì đó Máy ảnh đã chụp được hình ảnh của nghi phạm và chiếc xe của anh ta."
                    },
                    {
                        "en": "The satellite provides high-resolution images of the Earth's surface.",
                        "vi": "Vệ tinh cung cấp hình ảnh có độ phân giải cao về bề mặt Trái đất."
                    },
                    {
                        "en": "The image quality is too low.",
                        "vi": "Chất lượng hình ảnh quá thấp."
                    }
                ]
            },
            {
                "define": {
                    "en": "the impression that a person, an organization, a product, etc. gives to the public",
                    "vi": "ấn tượng mà một người, một tổ chức, một sản phẩm, v.v. mang lại cho công chúng"
                },
                "examples": [
                    {
                        "en": "His public image is very different from the real person.",
                        "vi": "Hình ảnh công khai của anh rất khác so với con người thật."
                    },
                    {
                        "en": "The advertisements are intended to improve the company's image.",
                        "vi": "Các quảng cáo nhằm cải thiện hình ảnh của công ty."
                    },
                    {
                        "en": "Image is very important in the music world.",
                        "vi": "Hình ảnh rất quan trọng trong thế giới âm nhạc."
                    },
                    {
                        "en": "It was years before the country was able to project an image of stability again.",
                        "vi": "Phải mất nhiều năm trước khi đất nước này có thể chiếu lại hình ảnh ổn định."
                    },
                    {
                        "en": "The campaign aims to create a new image for the city.",
                        "vi": "Chiến dịch nhằm tạo ra một hình ảnh mới cho thành phố."
                    },
                    {
                        "en": "stereotyped images of women in children’s books",
                        "vi": "hình ảnh rập khuôn của phụ nữ trong sách thiếu nhi"
                    },
                    {
                        "en": "to have a positive/negative image",
                        "vi": "để có một hình ảnh tích cực / tiêu cực"
                    },
                    {
                        "en": "The company changed its name on the advice of an image consultant.",
                        "vi": "Công ty đổi tên theo lời khuyên của một nhà tư vấn hình ảnh."
                    }
                ]
            },
            {
                "define": {
                    "en": "a mental picture that you have of what somebody/something is like or looks like",
                    "vi": "một bức tranh tinh thần mà bạn có về ai đó / cái gì đó giống hoặc trông như thế nào"
                },
                "examples": [
                    {
                        "en": "images of the past",
                        "vi": "hình ảnh của quá khứ"
                    },
                    {
                        "en": "I had a mental image of what she would look like.",
                        "vi": "Tôi đã có một hình ảnh tâm trí về cô ấy sẽ trông như thế nào."
                    },
                    {
                        "en": "Dieting always seems to conjure up images of endless cottage cheese salads.",
                        "vi": "Ăn kiêng dường như luôn gợi lên hình ảnh của những món salad phô mai tươi vô tận."
                    }
                ]
            },
            {
                "define": {
                    "en": "a word or phrase used with a different meaning from its normal one, in order to describe something in a way that produces a strong picture in the mind",
                    "vi": "một từ hoặc cụm từ được sử dụng với một ý nghĩa khác với ý nghĩa bình thường của nó, để mô tả điều gì đó theo cách tạo ra một hình ảnh mạnh mẽ trong tâm trí"
                },
                "examples": [
                    {
                        "en": "Her writings are full of poetic images of the countryside.",
                        "vi": "Những bài văn của chị tràn ngập hình ảnh thơ mộng của miền quê."
                    }
                ]
            },
            {
                "define": {
                    "en": "to look very like somebody/something else",
                    "vi": "trông rất giống ai đó / thứ gì đó khác"
                },
                "examples": [
                    {
                        "en": "He's the image of his father.",
                        "vi": "Anh ấy là hình ảnh của cha mình."
                    }
                ]
            }
        ]
    },
    {
        "id": "a9ec22ddeb4343b4b57d6e142f562117",
        "word": "light",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/laɪt/",
            "us": "/laɪt/"
        },
        "nearby": [
            {
                "word": "ligger",
                "pos": "noun"
            },
            {
                "word": "light",
                "pos": "noun"
            },
            {
                "word": "light",
                "pos": "adjective"
            },
            {
                "word": "light",
                "pos": "verb"
            },
            {
                "word": "light",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "pale in colour",
                    "vi": "màu nhạt"
                },
                "examples": [
                    {
                        "en": "He's got light blue eyes.",
                        "vi": "Anh ấy có đôi mắt xanh nhạt."
                    },
                    {
                        "en": "Lighter shades suit you best.",
                        "vi": "Các sắc thái nhẹ hơn phù hợp với bạn nhất."
                    },
                    {
                        "en": "People with pale complexions should avoid wearing light colours.",
                        "vi": "Những người có nước da nhợt nhạt nên tránh mặc đồ màu sáng."
                    },
                    {
                        "en": "a box of light and dark chocolates",
                        "vi": "một hộp sôcôla sáng và tối"
                    }
                ]
            },
            {
                "define": {
                    "en": "full of light; having the natural light of day",
                    "vi": "đầy đủ ánh sáng; có ánh sáng tự nhiên trong ngày"
                },
                "examples": [
                    {
                        "en": "We'll leave in the morning as soon as it's light.",
                        "vi": "Chúng ta sẽ đi ngay khi trời vừa sáng."
                    },
                    {
                        "en": "It gets light at about 5 o'clock.",
                        "vi": "Nó sáng vào khoảng 5 giờ."
                    },
                    {
                        "en": "Let's go now while it's still light.",
                        "vi": "Bây giờ hãy đi khi trời còn sáng."
                    },
                    {
                        "en": "It was a light spacious apartment at the top of the building.",
                        "vi": "Đó là một căn hộ rộng rãi nhẹ nhàng ở trên cùng của tòa nhà."
                    }
                ]
            },
            {
                "define": {
                    "en": "easy to lift or move; not weighing very much",
                    "vi": "dễ dàng nâng hoặc di chuyển; không nặng lắm"
                },
                "examples": [
                    {
                        "en": "The device is light and portable.",
                        "vi": "Thiết bị nhẹ và di động."
                    },
                    {
                        "en": "Carry this bag—it's the lightest.",
                        "vi": "Mang theo chiếc túi này - nó nhẹ nhất."
                    },
                    {
                        "en": "Hydrogen gas is lighter than air.",
                        "vi": "Khí hiđro nhẹ hơn không khí."
                    },
                    {
                        "en": "The little girl was as light as a feather.",
                        "vi": "Cô gái nhỏ nhẹ tựa lông hồng."
                    },
                    {
                        "en": "The tent is light enough for backpacking and touring.",
                        "vi": "Lều đủ nhẹ để du lịch bụi và du lịch."
                    }
                ]
            },
            {
                "define": {
                    "en": "of less than average or usual weight",
                    "vi": "có trọng lượng ít hơn trung bình hoặc bình thường"
                },
                "examples": [
                    {
                        "en": "light summer clothes",
                        "vi": "quần áo mùa hè nhẹ"
                    },
                    {
                        "en": "Only light vehicles are allowed over the old bridge.",
                        "vi": "Chỉ các phương tiện nhẹ mới được phép qua cầu cũ."
                    }
                ]
            },
            {
                "define": {
                    "en": "used with a unit of weight to say that something weighs less than it should do",
                    "vi": "được sử dụng với một đơn vị trọng lượng để nói rằng một cái gì đó nặng hơn nó nên làm"
                },
                "examples": [
                    {
                        "en": "The delivery of potatoes was several kilos light.",
                        "vi": "Việc giao khoai tây nhẹ vài ký."
                    }
                ]
            },
            {
                "define": {
                    "en": "gentle and without weight; not using much force",
                    "vi": "nhẹ nhàng và không có trọng lượng; không sử dụng nhiều lực"
                },
                "examples": [
                    {
                        "en": "She felt a light tap on her shoulder.",
                        "vi": "Cô cảm thấy một cái gõ nhẹ vào vai mình."
                    },
                    {
                        "en": "the sound of quick light footsteps",
                        "vi": "tiếng bước chân nhẹ nhàng nhanh chóng"
                    },
                    {
                        "en": "You only need to apply light pressure.",
                        "vi": "Bạn chỉ cần ấn nhẹ."
                    },
                    {
                        "en": "As a boxer, he was always light on his feet (= quick and elegant in the way he moved).",
                        "vi": "Là một võ sĩ quyền anh, anh ấy luôn nhẹ nhàng trên đôi chân của mình (= nhanh chóng và thanh lịch trong cách anh ấy di chuyển)."
                    }
                ]
            },
            {
                "define": {
                    "en": "easy to do; not making you tired",
                    "vi": "dễ làm; không làm bạn mệt mỏi"
                },
                "examples": [
                    {
                        "en": "After his accident he was moved to lighter work.",
                        "vi": "Sau khi bị tai nạn, anh ấy đã chuyển sang làm công việc nhẹ nhàng hơn."
                    },
                    {
                        "en": "some light housework",
                        "vi": "một số việc nhà nhẹ"
                    },
                    {
                        "en": "Her duties are relatively light.",
                        "vi": "Nhiệm vụ của cô ấy tương đối nhẹ nhàng."
                    },
                    {
                        "en": "You are probably well enough to take a little light exercise.",
                        "vi": "Bạn có thể đủ khỏe để tập thể dục nhẹ nhàng."
                    }
                ]
            },
            {
                "define": {
                    "en": "not great in amount, degree, etc.",
                    "vi": "không lớn về số lượng, mức độ, v.v."
                },
                "examples": [
                    {
                        "en": "Traffic was light.",
                        "vi": "Giao thông nhẹ."
                    },
                    {
                        "en": "Light rain is forecast.",
                        "vi": "Dự báo có mưa nhẹ."
                    },
                    {
                        "en": "Civilian casualties were comparatively light.",
                        "vi": "Thương vong dân sự tương đối nhẹ."
                    },
                    {
                        "en": "Trading on the stock exchange was light today.",
                        "vi": "Giao dịch trên sàn giao dịch nhẹ hôm nay."
                    },
                    {
                        "en": "Apply a light coating of cooking oil.",
                        "vi": "Phủ một lớp dầu ăn lên trên."
                    }
                ]
            },
            {
                "define": {
                    "en": "fun rather than serious and not needing much mental effort",
                    "vi": "vui vẻ hơn là nghiêm túc và không cần nhiều nỗ lực tinh thần"
                },
                "examples": [
                    {
                        "en": "light reading for the beach",
                        "vi": "đọc sách nhẹ trên bãi biển"
                    },
                    {
                        "en": "This is not something you'd watch for light entertainment.",
                        "vi": "Đây không phải là thứ bạn xem để giải trí nhẹ nhàng."
                    },
                    {
                        "en": "light music/opera",
                        "vi": "nhạc nhẹ / opera"
                    },
                    {
                        "en": "We were just making light conversation.",
                        "vi": "Chúng tôi chỉ nói chuyện nhẹ nhàng."
                    },
                    {
                        "en": "Her novels are light, but very well written.",
                        "vi": "Tiểu thuyết của cô ấy nhẹ nhàng, nhưng viết rất hay."
                    },
                    {
                        "en": "We all needed a little light relief at the end of a long day (= something funny or fun that comes after something serious or boring).",
                        "vi": "Tất cả chúng ta đều cần một chút nhẹ nhõm vào cuối một ngày dài (= một điều gì đó vui nhộn hoặc thú vị đến sau một điều gì đó nghiêm trọng hoặc nhàm chán)."
                    }
                ]
            },
            {
                "define": {
                    "en": "not serious",
                    "vi": "không nghiêm trọng"
                },
                "examples": [
                    {
                        "en": "She kept her tone light.",
                        "vi": "Cô ấy giữ giọng nói nhẹ nhàng."
                    },
                    {
                        "en": "This programme looks at the lighter side of politics.",
                        "vi": "Chương trình này nhìn vào khía cạnh nhẹ hơn của chính trị."
                    },
                    {
                        "en": "The job does have its lighter moments.",
                        "vi": "Công việc có những khoảnh khắc nhẹ nhàng hơn."
                    },
                    {
                        "en": "Let’s talk about lighter things, shall we?",
                        "vi": "Chúng ta hãy nói về những thứ nhẹ nhàng hơn, phải không?"
                    },
                    {
                        "en": "On a lighter note, we end the news today with a story about a duck called Quackers.",
                        "vi": "Xin lưu ý rằng chúng ta sẽ kết thúc bản tin hôm nay bằng câu chuyện về một con vịt tên là Quackers."
                    }
                ]
            },
            {
                "define": {
                    "en": "not severe",
                    "vi": "không nghiêm trọng"
                },
                "examples": [
                    {
                        "en": "He was convicted of assaulting a police officer but he got off with a light sentence.",
                        "vi": "Anh ta bị kết tội hành hung một sĩ quan cảnh sát nhưng anh ta được giảm nhẹ với mức án nhẹ."
                    },
                    {
                        "en": "The punishment can be remarkably light.",
                        "vi": "Hình phạt có thể rất nhẹ."
                    }
                ]
            },
            {
                "define": {
                    "en": "small in quantity",
                    "vi": "số lượng nhỏ"
                },
                "examples": [
                    {
                        "en": "a light meal/supper/snack/breakfast",
                        "vi": "một bữa ăn nhẹ / bữa tối / bữa ăn nhẹ / bữa sáng"
                    },
                    {
                        "en": "Light refreshments will be provided.",
                        "vi": "Các món ăn nhẹ sẽ được cung cấp."
                    },
                    {
                        "en": "I just want something light for lunch.",
                        "vi": "Tôi chỉ muốn một cái gì đó nhẹ cho bữa trưa."
                    }
                ]
            },
            {
                "define": {
                    "en": "not containing much fat, sugar or other rich ingredients and therefore easy to digest",
                    "vi": "không chứa nhiều chất béo, đường hoặc các thành phần phong phú khác nên dễ tiêu hóa"
                },
                "examples": [
                    {
                        "en": "Stick to a light diet.",
                        "vi": "Thực hiện chế độ ăn nhẹ."
                    },
                    {
                        "en": "a deliciously light alternative to cake",
                        "vi": "một sự thay thế thơm ngon nhẹ nhàng cho bánh"
                    }
                ]
            },
            {
                "define": {
                    "en": "containing a lot of air",
                    "vi": "chứa nhiều không khí"
                },
                "examples": [
                    {
                        "en": "This pastry is so light.",
                        "vi": "Bánh ngọt này rất nhẹ."
                    }
                ]
            },
            {
                "define": {
                    "en": "low in alcohol",
                    "vi": "ít cồn"
                },
                "examples": [
                    {
                        "en": "a light beer",
                        "vi": "một cốc bia nhẹ"
                    }
                ]
            },
            {
                "define": {
                    "en": "containing a lot of water",
                    "vi": "chứa nhiều nước"
                },
                "examples": [
                    {
                        "en": "I don't like my coffee too light.",
                        "vi": "Tôi không thích cà phê của tôi quá nhạt."
                    },
                    {
                        "en": "I think I’ll have a light tea.",
                        "vi": "Tôi nghĩ tôi sẽ uống trà nhẹ."
                    }
                ]
            },
            {
                "define": {
                    "en": "carrying only light weapons",
                    "vi": "chỉ mang vũ khí hạng nhẹ"
                },
                "examples": [
                    {
                        "en": "the light infantry/cavalry",
                        "vi": "bộ binh nhẹ / kỵ binh"
                    }
                ]
            },
            {
                "define": {
                    "en": "a person in a light sleep is easy to wake",
                    "vi": "một người trong giấc ngủ nhẹ rất dễ thức dậy"
                },
                "examples": [
                    {
                        "en": "She drifted into a light sleep.",
                        "vi": "Cô chìm vào giấc ngủ nhẹ."
                    },
                    {
                        "en": "I've always been a light sleeper.",
                        "vi": "Tôi luôn luôn là một người ngủ nhẹ."
                    }
                ]
            },
            {
                "define": {
                    "en": "free from worry; cheerful",
                    "vi": "khỏi lo lắng; vui lòng"
                },
                "examples": [
                    {
                        "en": "I left the island with a light heart.",
                        "vi": "Tôi rời đảo với trái tim nhẹ tênh."
                    }
                ]
            },
            {
                "define": {
                    "en": "to not have enough of something",
                    "vi": "không có đủ thứ gì đó"
                },
                "examples": [
                    {
                        "en": "We seem to be light on fuel.",
                        "vi": "Chúng ta dường như nhẹ về nhiên liệu."
                    }
                ]
            },
            {
                "define": {
                    "en": "the ability to deal with something in a sensitive and relaxed way",
                    "vi": "khả năng đối phó với một cái gì đó một cách nhạy cảm và thoải mái"
                },
                "examples": [
                    {
                        "en": "She handles this difficult subject with a light touch.",
                        "vi": "Cô ấy xử lý chủ đề khó này bằng một cái chạm nhẹ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to treat something as not being important and not serious",
                    "vi": "coi điều gì đó không quan trọng và không nghiêm trọng"
                },
                "examples": [
                    {
                        "en": "I didn’t mean to make light of your injuries.",
                        "vi": "Tôi không cố ý làm nhẹ vết thương của bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to do something quickly and with little effort",
                    "vi": "để làm điều gì đó nhanh chóng và ít nỗ lực"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to say that a job is made easier if a lot of people help",
                    "vi": "thường nói rằng một công việc sẽ dễ dàng hơn nếu có nhiều người giúp đỡ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "4ae4bf9665f64cc49fc4cae51860486e",
        "word": "literary",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈlɪtərəri/",
            "us": "/ˈlɪtəreri/"
        },
        "nearby": [
            {
                "word": "literally",
                "pos": "adverb"
            },
            {
                "word": "literalness",
                "pos": "noun"
            },
            {
                "word": "literary",
                "pos": "adjective"
            },
            {
                "word": "literary agent",
                "pos": "noun"
            },
            {
                "word": "literate",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "connected with literature",
                    "vi": "kết nối với văn học"
                },
                "examples": [
                    {
                        "en": "literary criticism/theory",
                        "vi": "phê bình / lý thuyết văn học"
                    }
                ]
            },
            {
                "define": {
                    "en": "suitable for or typical of a work of literature",
                    "vi": "phù hợp hoặc tiêu biểu cho một tác phẩm văn học"
                },
                "examples": [
                    {
                        "en": "It was Chaucer who really turned English into a literary language.",
                        "vi": "Chính Chaucer đã thực sự biến tiếng Anh thành một ngôn ngữ văn học."
                    },
                    {
                        "en": "She was one of the great literary figures of her age.",
                        "vi": "Bà là một trong những nhân vật văn học lớn trong thời đại của bà."
                    }
                ]
            },
            {
                "define": {
                    "en": "liking literature very much; studying or writing literature",
                    "vi": "rất thích văn chương; nghiên cứu hoặc viết văn học"
                },
                "examples": [
                    {
                        "en": "a literary man",
                        "vi": "một người đàn ông văn học"
                    }
                ]
            }
        ]
    },
    {
        "id": "08e8da76e20a4647aa8f7f9bee8f9fd2",
        "word": "metaphor",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈmetəfə(r)/",
            "us": "/ˈmetəfər/"
        },
        "nearby": [
            {
                "word": "metamorphosis",
                "pos": "noun"
            },
            {
                "word": "metanarrative",
                "pos": "noun"
            },
            {
                "word": "metaphor",
                "pos": "noun"
            },
            {
                "word": "metaphorical",
                "pos": "adjective"
            },
            {
                "word": "metaphorically",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a word or phrase used to describe somebody/something else, in a way that is different from its normal use, in order to show that the two things have the same qualities and to make the description more powerful, for example She has a heart of stone; the use of such words and phrases",
                    "vi": "một từ hoặc cụm từ được sử dụng để mô tả ai đó / điều gì khác, theo cách khác với cách sử dụng thông thường, để cho thấy rằng hai sự vật có cùng phẩm chất và làm cho mô tả mạnh mẽ hơn, ví dụ: Cô ấy có trái tim của cục đá; việc sử dụng những từ và cụm từ như vậy"
                },
                "examples": [
                    {
                        "en": "a game of football used as a metaphor for the competitive struggle of life",
                        "vi": "một trò chơi bóng đá được sử dụng như một phép ẩn dụ cho cuộc đấu tranh cạnh tranh của cuộc sống"
                    },
                    {
                        "en": "the writer’s striking use of metaphor",
                        "vi": "cách sử dụng ẩn dụ nổi bật của nhà văn"
                    }
                ]
            }
        ]
    },
    {
        "id": "d1da9a3fabe14712be264b3dcf30b7b5",
        "word": "moving",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈmuːvɪŋ/",
            "us": "/ˈmuːvɪŋ/"
        },
        "nearby": [
            {
                "word": "movie star",
                "pos": "noun"
            },
            {
                "word": "movie theater",
                "pos": "noun"
            },
            {
                "word": "moving",
                "pos": "adjective"
            },
            {
                "word": "movingly",
                "pos": "adverb"
            },
            {
                "word": "moving van",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "causing strong, often sad, feelings about somebody/something",
                    "vi": "gây ra cảm xúc mạnh mẽ, thường buồn, về ai đó / điều gì đó"
                },
                "examples": [
                    {
                        "en": "a deeply moving experience",
                        "vi": "một trải nghiệm sâu sắc cảm động"
                    },
                    {
                        "en": "a moving story/speech",
                        "vi": "một câu chuyện / bài phát biểu cảm động"
                    }
                ]
            },
            {
                "define": {
                    "en": "changing from one place or position to another",
                    "vi": "thay đổi từ vị trí hoặc vị trí này sang vị trí khác"
                },
                "examples": [
                    {
                        "en": "the moving parts of a machine",
                        "vi": "các bộ phận chuyển động của máy móc"
                    },
                    {
                        "en": "fast-moving water",
                        "vi": "nước chảy nhanh"
                    },
                    {
                        "en": "a moving target",
                        "vi": "một mục tiêu di chuyển"
                    }
                ]
            }
        ]
    },
    {
        "id": "064355f286294389b08d4fbf0996574d",
        "word": "realistic",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/ˌriːəˈlɪstɪk/",
            "us": "/ˌriːəˈlɪstɪk/"
        },
        "nearby": [
            {
                "word": "realism",
                "pos": "noun"
            },
            {
                "word": "realist",
                "pos": "noun"
            },
            {
                "word": "realistic",
                "pos": "adjective"
            },
            {
                "word": "realistically",
                "pos": "adverb"
            },
            {
                "word": "reality",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "accepting in a sensible way what it is actually possible to do or achieve in a particular situation",
                    "vi": "chấp nhận một cách hợp lý những gì nó thực sự có thể làm hoặc đạt được trong một tình huống cụ thể"
                },
                "examples": [
                    {
                        "en": "a realistic assessment/approach/view",
                        "vi": "một đánh giá / cách tiếp cận / quan điểm thực tế"
                    },
                    {
                        "en": "realistic about something We have to be realistic about our chances of winning.",
                        "vi": "thực tế về điều gì đó Chúng ta phải thực tế về cơ hội chiến thắng của mình."
                    },
                    {
                        "en": "it is realistic (for somebody) to do something It is not realistic to expect people to spend so much money.",
                        "vi": "nó là thực tế (đối với ai đó) để làm điều gì đó Không thực tế khi mong đợi mọi người chi nhiều tiền như vậy."
                    },
                    {
                        "en": "It would not be realistic for the Government to demand a pay freeze in the sector at this point.",
                        "vi": "Sẽ không thực tế nếu Chính phủ yêu cầu đóng băng lương trong lĩnh vực này vào thời điểm này."
                    }
                ]
            },
            {
                "define": {
                    "en": "sensible and appropriate; possible to achieve",
                    "vi": "hợp lý và thích hợp; có thể đạt được"
                },
                "examples": [
                    {
                        "en": "a realistic prospect/chance/possibility",
                        "vi": "một triển vọng / cơ hội / khả năng thực tế"
                    },
                    {
                        "en": "a realistic alternative/option",
                        "vi": "một lựa chọn / thay thế thực tế"
                    },
                    {
                        "en": "The important thing is to have realistic expectations about what you can and can't accomplish.",
                        "vi": "Điều quan trọng là có những kỳ vọng thực tế về những gì bạn có thể và không thể hoàn thành."
                    },
                    {
                        "en": "We must set realistic goals.",
                        "vi": "Chúng ta phải đặt ra những mục tiêu thực tế."
                    },
                    {
                        "en": "a realistic target",
                        "vi": "một mục tiêu thực tế"
                    },
                    {
                        "en": "If you want to retain good employees, you have to pay a realistic salary.",
                        "vi": "Nếu bạn muốn giữ chân những nhân viên giỏi, bạn phải trả một mức lương thực tế."
                    }
                ]
            },
            {
                "define": {
                    "en": "representing things as they are in real life",
                    "vi": "đại diện cho mọi thứ như trong cuộc sống thực"
                },
                "examples": [
                    {
                        "en": "a realistic portrayal/depiction/picture",
                        "vi": "một bức chân dung / mô tả / bức tranh thực tế"
                    },
                    {
                        "en": "She made a very realistic drawing of a horse.",
                        "vi": "Cô ấy đã vẽ một con ngựa rất giống thật."
                    },
                    {
                        "en": "We try to make these training courses as realistic as possible.",
                        "vi": "Chúng tôi cố gắng làm cho các khóa đào tạo này trở nên thực tế nhất có thể."
                    },
                    {
                        "en": "The realistic graphics really bring the game to life.",
                        "vi": "Đồ họa chân thực thực sự làm cho trò chơi trở nên sống động."
                    }
                ]
            }
        ]
    },
    {
        "id": "9e383a3d5dcf478380fccd2d62258189",
        "word": "storytelling",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈstɔːritelɪŋ/",
            "us": "/ˈstɔːritelɪŋ/"
        },
        "nearby": [
            {
                "word": "storyline",
                "pos": "noun"
            },
            {
                "word": "storyteller",
                "pos": "noun"
            },
            {
                "word": "storytelling",
                "pos": "noun"
            },
            {
                "word": "stoup",
                "pos": "noun"
            },
            {
                "word": "Stourhead",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the activity of telling or writing stories",
                    "vi": "hoạt động kể hoặc viết câu chuyện"
                },
                "examples": [
                    {
                        "en": "She has a gift for storytelling.",
                        "vi": "Cô ấy có năng khiếu kể chuyện."
                    },
                    {
                        "en": "storytelling sessions",
                        "vi": "buổi kể chuyện"
                    }
                ]
            }
        ]
    },
    {
        "id": "b0c3bb0e46dd402fbf2c1d8c052ee6ca",
        "word": "subject matter",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈsʌbdʒɪkt mætə(r)/",
            "us": "/ˈsʌbdʒɪkt mætər/"
        },
        "nearby": [
            {
                "word": "subjectivity",
                "pos": "noun"
            },
            {
                "word": "subject line",
                "pos": "noun"
            },
            {
                "word": "subject matter",
                "pos": "noun"
            },
            {
                "word": "subject to",
                "pos": "phrasal verb"
            },
            {
                "word": "sub judice",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the ideas or information contained in a book, speech, painting, etc.",
                    "vi": "những ý tưởng hoặc thông tin có trong một cuốn sách, bài phát biểu, bức tranh, v.v."
                },
                "examples": [
                    {
                        "en": "The artist was revolutionary in both subject matter and technique.",
                        "vi": "Người nghệ sĩ đã cách mạng cả về chủ đề và kỹ thuật."
                    },
                    {
                        "en": "She's searching for subject matter for her new book.",
                        "vi": "Cô ấy đang tìm kiếm chủ đề cho cuốn sách mới của mình."
                    }
                ]
            }
        ]
    },
    {
        "id": "d72c529bc2ef42bd9c8fe16524243d27",
        "word": "tension",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈtenʃn/",
            "us": "/ˈtenʃn/"
        },
        "nearby": [
            {
                "word": "tenseness",
                "pos": "noun"
            },
            {
                "word": "tensile",
                "pos": "adjective"
            },
            {
                "word": "tension",
                "pos": "noun"
            },
            {
                "word": "tension",
                "pos": "verb"
            },
            {
                "word": "1066",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a situation in which people do not trust each other, or feel unfriendly towards each other, and that may cause them to attack each other",
                    "vi": "một tình huống mà mọi người không tin tưởng lẫn nhau hoặc cảm thấy không thân thiện với nhau và điều đó có thể khiến họ tấn công lẫn nhau"
                },
                "examples": [
                    {
                        "en": "There is mounting tension along the border.",
                        "vi": "Có lực căng dọc theo biên giới."
                    },
                    {
                        "en": "international/racial/political tensions",
                        "vi": "căng thẳng quốc tế / chủng tộc / chính trị"
                    },
                    {
                        "en": "Family tensions and conflicts may lead to violence.",
                        "vi": "Những căng thẳng và xung đột trong gia đình có thể dẫn đến bạo lực."
                    },
                    {
                        "en": "tension between A and B The incident has further increased tension between the two countries.",
                        "vi": "căng thẳng giữa A và B Vụ việc càng làm gia tăng căng thẳng giữa hai nước."
                    }
                ]
            },
            {
                "define": {
                    "en": "a situation in which the fact that there are different needs or interests causes difficulties",
                    "vi": "một tình huống mà thực tế là có những nhu cầu hoặc sở thích khác nhau gây ra khó khăn"
                },
                "examples": [
                    {
                        "en": "There is often a tension between the aims of the company and the wishes of the employees.",
                        "vi": "Thường có sự căng thẳng giữa mục tiêu của công ty và mong muốn của nhân viên."
                    }
                ]
            },
            {
                "define": {
                    "en": "a feeling of worry and stress that makes it impossible to relax",
                    "vi": "cảm giác lo lắng và căng thẳng khiến bạn không thể thư giãn"
                },
                "examples": [
                    {
                        "en": "nervous tension",
                        "vi": "căng thẳng thần kinh"
                    },
                    {
                        "en": "We laughed and that helped ease the tension.",
                        "vi": "Chúng tôi đã cười và điều đó giúp giảm bớt căng thẳng."
                    },
                    {
                        "en": "Walking and swimming are excellent for releasing tension.",
                        "vi": "Đi bộ và bơi lội là cách tuyệt vời để giải tỏa căng thẳng."
                    },
                    {
                        "en": "a tension headache",
                        "vi": "đau đầu căng thẳng"
                    }
                ]
            },
            {
                "define": {
                    "en": "the feeling of fear and excitement that is created by a writer or a film director",
                    "vi": "cảm giác sợ hãi và phấn khích được tạo ra bởi một nhà văn hoặc một đạo diễn phim"
                },
                "examples": [
                    {
                        "en": "dramatic tension",
                        "vi": "căng thẳng kịch tính"
                    },
                    {
                        "en": "As the movie progresses the tension builds.",
                        "vi": "Khi bộ phim tiến triển, căng thẳng tăng lên."
                    }
                ]
            },
            {
                "define": {
                    "en": "the state of being stretched tight; the extent to which something is stretched tight",
                    "vi": "tình trạng bị kéo căng; mức độ mà một cái gì đó bị kéo căng"
                },
                "examples": [
                    {
                        "en": "muscular tension",
                        "vi": "căng cơ"
                    },
                    {
                        "en": "Adjust the string tension of your tennis racket to suit your style of playing.",
                        "vi": "Điều chỉnh độ căng dây của vợt tennis phù hợp với phong cách chơi của bạn."
                    },
                    {
                        "en": "When knitting, try to keep the same tension throughout.",
                        "vi": "Khi đan, cố gắng giữ nguyên độ căng trong suốt."
                    },
                    {
                        "en": "Massage can relieve tension in your shoulders and back.",
                        "vi": "Mát xa có thể làm giảm căng thẳng ở vai và lưng của bạn."
                    }
                ]
            }
        ]
    },
    {
        "id": "b843c95b89044e9fac3f2a7e3efc7ec6",
        "word": "vivid",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈvɪvɪd/",
            "us": "/ˈvɪvɪd/"
        },
        "nearby": [
            {
                "word": "vive la difference",
                "pos": "exclamation"
            },
            {
                "word": "Vivian",
                "pos": ""
            },
            {
                "word": "vivid",
                "pos": "adjective"
            },
            {
                "word": "vividly",
                "pos": "adverb"
            },
            {
                "word": "vividness",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "producing very clear pictures in your mind",
                    "vi": "tạo ra những hình ảnh rất rõ ràng trong tâm trí bạn"
                },
                "examples": [
                    {
                        "en": "vivid memories",
                        "vi": "ký ức sống động"
                    },
                    {
                        "en": "He gave a vivid account of his life as a fighter pilot.",
                        "vi": "Ông đã kể lại một cách sống động về cuộc đời của mình với tư cách là một phi công chiến đấu."
                    }
                ]
            },
            {
                "define": {
                    "en": "very bright",
                    "vi": "rất sáng"
                },
                "examples": [
                    {
                        "en": "vivid blue eyes",
                        "vi": "đôi mắt xanh sống động"
                    },
                    {
                        "en": "The colours are vivid, which helps bring the game to life.",
                        "vi": "Màu sắc sống động, giúp làm cho trò chơi trở nên sống động."
                    },
                    {
                        "en": "His eyes were a vivid green.",
                        "vi": "Đôi mắt anh ta có một màu xanh lá cây sống động."
                    }
                ]
            },
            {
                "define": {
                    "en": "able to form pictures of ideas, situations, etc. easily in the mind",
                    "vi": "có thể hình thành các hình ảnh về ý tưởng, tình huống, v.v. một cách dễ dàng trong tâm trí"
                },
                "examples": [
                    {
                        "en": "a wonderfully vivid imagination",
                        "vi": "một trí tưởng tượng sống động tuyệt vời"
                    }
                ]
            }
        ]
    },
    {
        "id": "4939ed35b98e45958c5e5b46aea6825c",
        "word": "autobiographical",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌɔːtəˌbaɪəˈɡræfɪkl/",
            "us": "/ˌɔːtəˌbaɪəˈɡræfɪkl/"
        },
        "nearby": [
            {
                "word": "auto",
                "pos": "noun"
            },
            {
                "word": "auto-",
                "pos": "combining form"
            },
            {
                "word": "autobiographical",
                "pos": "adjective"
            },
            {
                "word": "autobiography",
                "pos": "noun"
            },
            {
                "word": "autochanger",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "based on the writer's or artist's own experiences",
                    "vi": "dựa trên kinh nghiệm của chính nhà văn hoặc nghệ sĩ"
                },
                "examples": [
                    {
                        "en": "an autobiographical novel",
                        "vi": "một cuốn tiểu thuyết tự truyện"
                    },
                    {
                        "en": "The movie is largely autobiographical.",
                        "vi": "Bộ phim phần lớn là tự truyện."
                    }
                ]
            },
            {
                "define": {
                    "en": "being or connected with the story of a person's life, written by that person",
                    "vi": "được hoặc kết nối với câu chuyện về cuộc đời của một người, được viết bởi người đó"
                },
                "examples": [
                    {
                        "en": "autobiographical writing",
                        "vi": "viết tự truyện"
                    }
                ]
            }
        ]
    },
    {
        "id": "480ea173eb214cacb084d6b05c74ca49",
        "word": "concise",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/kənˈsaɪs/",
            "us": "/kənˈsaɪs/"
        },
        "nearby": [
            {
                "word": "conciliator",
                "pos": "noun"
            },
            {
                "word": "conciliatory",
                "pos": "adjective"
            },
            {
                "word": "concise",
                "pos": "adjective"
            },
            {
                "word": "concisely",
                "pos": "adverb"
            },
            {
                "word": "conciseness",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "giving only the information that is necessary and important, using few words",
                    "vi": "chỉ cung cấp thông tin cần thiết và quan trọng, sử dụng ít từ"
                },
                "examples": [
                    {
                        "en": "a concise summary",
                        "vi": "một bản tóm tắt ngắn gọn"
                    },
                    {
                        "en": "She gave us clear and concise instructions.",
                        "vi": "Cô ấy đã hướng dẫn rõ ràng và ngắn gọn cho chúng tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "shorter than the original book, on which it was based",
                    "vi": "ngắn hơn cuốn sách gốc mà nó dựa trên"
                },
                "examples": [
                    {
                        "en": "This is just a concise dictionary—you should get yourself something bigger.",
                        "vi": "Đây chỉ là một cuốn từ điển ngắn gọn — bạn nên kiếm cho mình một cái gì đó lớn hơn."
                    }
                ]
            }
        ]
    },
    {
        "id": "31362539cc9a425c9ec60425227f8d6c",
        "word": "depict",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/dɪˈpɪkt/",
            "us": "/dɪˈpɪkt/"
        },
        "nearby": [
            {
                "word": "depersonalization",
                "pos": "noun"
            },
            {
                "word": "depersonalize",
                "pos": "verb"
            },
            {
                "word": "depict",
                "pos": "verb"
            },
            {
                "word": "depiction",
                "pos": "noun"
            },
            {
                "word": "depilator",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to show an image of somebody/something in a picture",
                    "vi": "để hiển thị hình ảnh của ai đó / cái gì đó trong một bức tranh"
                },
                "examples": [
                    {
                        "en": "depict somebody/something (as somebody/something) a painting depicting the Virgin and Child",
                        "vi": "mô tả ai đó / cái gì đó (như ai đó / cái gì đó) một bức tranh mô tả Đức mẹ Đồng trinh và Đứa trẻ"
                    },
                    {
                        "en": "depict somebody/something doing something The artist had depicted her lying on a bed.",
                        "vi": "mô tả ai đó / điều gì đó đang làm điều gì đó Người nghệ sĩ đã mô tả cô ấy đang nằm trên giường."
                    }
                ]
            },
            {
                "define": {
                    "en": "to describe something in words, or give an impression of something in words or with a picture",
                    "vi": "để mô tả điều gì đó bằng lời hoặc tạo ấn tượng về điều gì đó bằng lời hoặc bằng hình ảnh"
                },
                "examples": [
                    {
                        "en": "depict somebody/something The novel depicts French society in the 1930s.",
                        "vi": "mô tả ai đó / cái gì đó Cuốn tiểu thuyết mô tả xã hội Pháp những năm 1930."
                    },
                    {
                        "en": "depict somebody/something as somebody/something The advertisements depicted smoking as glamorous and attractive.",
                        "vi": "mô tả ai đó / cái gì đó là ai đó / cái gì đó Các quảng cáo mô tả việc hút thuốc là quyến rũ và hấp dẫn."
                    }
                ]
            }
        ]
    },
    {
        "id": "89b989cd88994ae0ba6ed23d8d9421bc",
        "word": "gripping",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈɡrɪpɪŋ/",
            "us": "/ˈɡrɪpɪŋ/"
        },
        "nearby": [
            {
                "word": "Gripe Water",
                "pos": "noun"
            },
            {
                "word": "griping",
                "pos": "adjective"
            },
            {
                "word": "gripping",
                "pos": "adjective"
            },
            {
                "word": "grippy",
                "pos": "adjective"
            },
            {
                "word": "grisly",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "exciting or interesting in a way that keeps your attention",
                    "vi": "thú vị hoặc thú vị theo cách thu hút sự chú ý của bạn"
                },
                "examples": [
                    {
                        "en": "a gripping story",
                        "vi": "một câu chuyện hấp dẫn"
                    },
                    {
                        "en": "His books are always so gripping.",
                        "vi": "Sách của anh ấy luôn hấp dẫn."
                    },
                    {
                        "en": "The film was absolutely gripping.",
                        "vi": "Bộ phim hoàn toàn hấp dẫn."
                    },
                    {
                        "en": "The film is a gripping account of the early days of the revolution.",
                        "vi": "Bộ phim là một tường thuật hấp dẫn về những ngày đầu của cuộc cách mạng."
                    }
                ]
            }
        ]
    },
    {
        "id": "d894b806ef544f4db90444c67d6cd845",
        "word": "heavy",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈhevi/",
            "us": "/ˈhevi/"
        },
        "nearby": [
            {
                "word": "heaviness",
                "pos": "noun"
            },
            {
                "word": "heaving",
                "pos": "adjective"
            },
            {
                "word": "heavy",
                "pos": "adjective"
            },
            {
                "word": "heavy",
                "pos": "noun"
            },
            {
                "word": "heavy",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "weighing a lot; difficult to lift or move",
                    "vi": "cân nhiều; khó nâng hoặc di chuyển"
                },
                "examples": [
                    {
                        "en": "a heavy weight/load",
                        "vi": "một trọng lượng nặng / tải trọng"
                    },
                    {
                        "en": "She was struggling with a heavy suitcase.",
                        "vi": "Cô đang loay hoay với một chiếc vali nặng."
                    },
                    {
                        "en": "My brother is much heavier than me.",
                        "vi": "Anh trai tôi nặng hơn tôi rất nhiều."
                    },
                    {
                        "en": "He tried to push the heavy door open.",
                        "vi": "Anh cố gắng đẩy cánh cửa nặng nề ra."
                    },
                    {
                        "en": "How heavy is it (= how much does it weigh)?",
                        "vi": "Nó nặng bao nhiêu (= nó nặng bao nhiêu)?"
                    },
                    {
                        "en": "(especially North American English) Many young people today are too heavy (= fat).",
                        "vi": "(đặc biệt là tiếng Anh Bắc Mỹ) Nhiều người trẻ ngày nay quá nặng (= béo)."
                    },
                    {
                        "en": "(figurative) Her father carried a heavy burden of responsibility.",
                        "vi": "(nghĩa bóng) Cha cô mang nặng trách nhiệm."
                    }
                ]
            },
            {
                "define": {
                    "en": "more or worse than usual in amount, degree, etc.",
                    "vi": "nhiều hơn hoặc tệ hơn bình thường về số lượng, mức độ, v.v."
                },
                "examples": [
                    {
                        "en": "the noise of heavy traffic",
                        "vi": "tiếng ồn của xe cộ đông đúc"
                    },
                    {
                        "en": "heavy rain/rainfall/snow",
                        "vi": "mưa lớn / lượng mưa / tuyết"
                    },
                    {
                        "en": "the effects of heavy drinking",
                        "vi": "ảnh hưởng của việc uống nhiều rượu"
                    },
                    {
                        "en": "There was heavy fighting in the capital last night.",
                        "vi": "Đêm qua đã xảy ra giao tranh ác liệt ở thủ đô."
                    },
                    {
                        "en": "The British suffered heavy losses in the battle.",
                        "vi": "Người Anh bị tổn thất nặng nề trong trận chiến."
                    },
                    {
                        "en": "His unit came under heavy fire from insurgents.",
                        "vi": "Đơn vị của anh ta phải hứng chịu hỏa lực dày đặc của quân nổi dậy."
                    },
                    {
                        "en": "The penalty for speeding can be a heavy fine.",
                        "vi": "Hình phạt cho việc chạy quá tốc độ có thể là một khoản phạt nặng."
                    },
                    {
                        "en": "She spoke with heavy irony.",
                        "vi": "Cô ấy nói với vẻ mỉa mai nặng nề."
                    }
                ]
            },
            {
                "define": {
                    "en": "doing the thing mentioned more, or more deeply, than usual",
                    "vi": "làm những việc được đề cập nhiều hơn hoặc sâu hơn bình thường"
                },
                "examples": [
                    {
                        "en": "a heavy drinker/smoker",
                        "vi": "một người nghiện rượu nặng / hút thuốc"
                    },
                    {
                        "en": "a heavy sleeper",
                        "vi": "một người ngủ nặng"
                    }
                ]
            },
            {
                "define": {
                    "en": "large and solid",
                    "vi": "lớn và rắn"
                },
                "examples": [
                    {
                        "en": "big, dark rooms full of heavy furniture",
                        "vi": "những căn phòng lớn, tối om đầy đồ đạc nặng"
                    },
                    {
                        "en": "He was tall and strong, with heavy features.",
                        "vi": "Anh ta cao và mạnh mẽ, với những đường nét nặng nề."
                    }
                ]
            },
            {
                "define": {
                    "en": "thick",
                    "vi": "đặc"
                },
                "examples": [
                    {
                        "en": "heavy curtains",
                        "vi": "rèm cửa nặng"
                    },
                    {
                        "en": "a heavy coat",
                        "vi": "một chiếc áo khoác nặng"
                    }
                ]
            },
            {
                "define": {
                    "en": "full of or loaded with something",
                    "vi": "đầy hoặc chất đầy thứ gì đó"
                },
                "examples": [
                    {
                        "en": "trees heavy with apples",
                        "vi": "cây nặng trĩu quả"
                    },
                    {
                        "en": "The air was heavy with the scent of flowers.",
                        "vi": "Không khí nặng mùi hương hoa."
                    },
                    {
                        "en": "His voice was heavy with sarcasm.",
                        "vi": "Giọng anh nặng trĩu với vẻ mỉa mai."
                    },
                    {
                        "en": "She was heavy with child (= pregnant).",
                        "vi": "She was heavy with child (= mang thai)."
                    }
                ]
            },
            {
                "define": {
                    "en": "large and powerful",
                    "vi": "lớn và mạnh mẽ"
                },
                "examples": [
                    {
                        "en": "a wide range of engines and heavy machinery/equipment",
                        "vi": "nhiều loại động cơ và máy móc / thiết bị hạng nặng"
                    },
                    {
                        "en": "heavy lorries/trucks",
                        "vi": "xe tải / xe tải hạng nặng"
                    }
                ]
            },
            {
                "define": {
                    "en": "involving a lot of work or activity; very busy",
                    "vi": "liên quan đến nhiều công việc hoặc hoạt động; rất bận"
                },
                "examples": [
                    {
                        "en": "a heavy schedule",
                        "vi": "một lịch trình dày đặc"
                    },
                    {
                        "en": "She'd had a heavy day.",
                        "vi": "Cô ấy đã có một ngày nặng nề."
                    }
                ]
            },
            {
                "define": {
                    "en": "hard, especially because it requires a lot of physical strength",
                    "vi": "khó, đặc biệt vì nó đòi hỏi rất nhiều thể lực"
                },
                "examples": [
                    {
                        "en": "heavy lifting",
                        "vi": "nâng nặng"
                    },
                    {
                        "en": "A gardener comes in to do the heavy work for me.",
                        "vi": "Một người làm vườn đến làm công việc nặng nhọc cho tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "falling or hitting something with a lot of force",
                    "vi": "rơi hoặc va vào một cái gì đó với rất nhiều lực"
                },
                "examples": [
                    {
                        "en": "a heavy fall/blow",
                        "vi": "một cú ngã / đòn nặng"
                    }
                ]
            },
            {
                "define": {
                    "en": "large in amount or very solid",
                    "vi": "số lượng lớn hoặc rất rắn"
                },
                "examples": [
                    {
                        "en": "a heavy lunch/dinner/meal",
                        "vi": "một bữa trưa / bữa tối / bữa ăn nặng"
                    },
                    {
                        "en": "Avoid heavy foods that are difficult to digest.",
                        "vi": "Tránh thức ăn nặng khó tiêu hóa."
                    }
                ]
            },
            {
                "define": {
                    "en": "carrying heavy weapons",
                    "vi": "mang vũ khí hạng nặng"
                },
                "examples": [
                    {
                        "en": "the heavy infantry/cavalry",
                        "vi": "bộ binh / kỵ binh hạng nặng"
                    }
                ]
            },
            {
                "define": {
                    "en": "loud and deep",
                    "vi": "to và sâu"
                },
                "examples": [
                    {
                        "en": "heavy breathing",
                        "vi": "thở nặng nhọc"
                    },
                    {
                        "en": "a heavy groan/sigh",
                        "vi": "một tiếng rên rỉ nặng nề / thở dài"
                    }
                ]
            },
            {
                "define": {
                    "en": "using a lot of something",
                    "vi": "sử dụng rất nhiều thứ"
                },
                "examples": [
                    {
                        "en": "Older cars are heavy on gas.",
                        "vi": "Xe cũ thì xăng nhiều."
                    },
                    {
                        "en": "Don't go so heavy on the garlic.",
                        "vi": "Đừng nặng lời với củ tỏi."
                    }
                ]
            },
            {
                "define": {
                    "en": "serious; difficult to understand or enjoy",
                    "vi": "nghiêm túc; khó hiểu hoặc thích thú"
                },
                "examples": [
                    {
                        "en": "We found the play very heavy.",
                        "vi": "Chúng tôi thấy vở kịch rất nặng nề."
                    },
                    {
                        "en": "The discussion got a little heavy.",
                        "vi": "Cuộc thảo luận trở nên hơi nặng nề."
                    }
                ]
            },
            {
                "define": {
                    "en": "dangerous because of big waves, etc.",
                    "vi": "nguy hiểm vì sóng lớn, v.v."
                },
                "examples": [
                    {
                        "en": "strong winds and heavy seas",
                        "vi": "gió mạnh và biển lớn"
                    },
                    {
                        "en": "The heavy Atlantic swells pounded the beach.",
                        "vi": "Biển Đại Tây Dương nặng nề đập mạnh vào bãi biển."
                    }
                ]
            },
            {
                "define": {
                    "en": "hot and without enough fresh air, in a way that feels unpleasant",
                    "vi": "nóng và không có đủ không khí trong lành, theo cách cảm thấy khó chịu"
                },
                "examples": [
                    {
                        "en": "It's very heavy—I think there'll be a storm.",
                        "vi": "Trời rất nặng - tôi nghĩ sẽ có bão."
                    }
                ]
            },
            {
                "define": {
                    "en": "wet, sticky and difficult to dig or to move over",
                    "vi": "ẩm ướt, dính và khó đào hoặc khó di chuyển"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "very strict and severe",
                    "vi": "rất nghiêm ngặt và nghiêm trọng"
                },
                "examples": [
                    {
                        "en": "Don't be so heavy on her—it wasn't her fault.",
                        "vi": "Đừng nặng lời với cô ấy - đó không phải là lỗi của cô ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to become very serious, because strong feelings are involved",
                    "vi": "trở nên rất nghiêm trọng, bởi vì cảm giác mạnh có liên quan"
                },
                "examples": [
                    {
                        "en": "They started shouting at me. It got very heavy.",
                        "vi": "Họ bắt đầu hét vào mặt tôi. Nó rất nặng."
                    },
                    {
                        "en": "Then he got heavy and tried to kiss me.",
                        "vi": "Sau đó, anh ấy nặng nề và cố gắng hôn tôi."
                    },
                    {
                        "en": "Things were starting to get a bit heavy so I decided to leave.",
                        "vi": "Mọi thứ bắt đầu trở nên hơi nặng nề nên tôi quyết định rời đi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have a difficult problem that makes you worried or unhappy but that you have to deal with",
                    "vi": "gặp một vấn đề khó khăn khiến bạn lo lắng hoặc không vui nhưng bạn phải giải quyết"
                },
                "examples": [
                    {
                        "en": "We all have our crosses to bear.",
                        "vi": "Tất cả chúng ta đều có những thập giá của mình phải chịu."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to describe somebody/something that is difficult to deal with or understand",
                    "vi": "được sử dụng để mô tả ai đó / điều gì đó khó đối phó hoặc khó hiểu"
                },
                "examples": [
                    {
                        "en": "She's a bit heavy going.",
                        "vi": "Cô ấy đi hơi nặng."
                    },
                    {
                        "en": "I found the course rather heavy going.",
                        "vi": "Tôi thấy khóa học đi khá nặng nề."
                    }
                ]
            },
            {
                "define": {
                    "en": "a way of doing something or of treating people that is much stronger and less sensitive than it needs to be",
                    "vi": "một cách làm điều gì đó hoặc đối xử với những người mạnh mẽ hơn và ít nhạy cảm hơn mức cần thiết"
                },
                "examples": [
                    {
                        "en": "the heavy hand of management",
                        "vi": "bàn tay nặng nề của quản lý"
                    }
                ]
            },
            {
                "define": {
                    "en": "a very sad feeling",
                    "vi": "một cảm giác rất buồn"
                },
                "examples": [
                    {
                        "en": "She left her children behind with a heavy heart.",
                        "vi": "Mẹ đã bỏ lại những đứa con của mình mà lòng nặng trĩu."
                    }
                ]
            },
            {
                "define": {
                    "en": "a group of strong, often violent people employed to do something such as protect somebody",
                    "vi": "một nhóm những người mạnh mẽ, thường bạo lực được tuyển dụng để làm điều gì đó chẳng hạn như bảo vệ ai đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a situation when people do not say anything, but feel embarrassed or uncomfortable",
                    "vi": "một tình huống khi mọi người không nói bất cứ điều gì, nhưng cảm thấy xấu hổ hoặc khó chịu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to seem to find something more difficult or complicated than it needs to be",
                    "vi": "dường như tìm thấy một cái gì đó khó hơn hoặc phức tạp hơn nó cần"
                },
                "examples": [
                    {
                        "en": "People in this country make such heavy weather of learning languages.",
                        "vi": "Người dân ở đất nước này khiến thời tiết học ngôn ngữ trở nên khắc nghiệt như vậy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have a bad effect on somebody/something; to cause a lot of damage, deaths, pain, etc.",
                    "vi": "có ảnh hưởng xấu đến ai đó / cái gì đó; để gây ra rất nhiều thiệt hại, chết chóc, đau đớn, v.v."
                },
                "examples": [
                    {
                        "en": "Illness had taken a heavy toll on her.",
                        "vi": "Bệnh tật đã khiến cô ấy bị ảnh hưởng nặng nề."
                    },
                    {
                        "en": "The recession is taking its toll on the housing markets.",
                        "vi": "Suy thoái đang ảnh hưởng đến thị trường nhà ở."
                    },
                    {
                        "en": "The pressure of fame can take a terrible toll.",
                        "vi": "Áp lực của sự nổi tiếng có thể phải trả một cái giá khủng khiếp."
                    }
                ]
            }
        ]
    },
    {
        "id": "37c0b4ac10584cf09e2ae9c6d4cfa88e",
        "word": "imagery",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈɪmɪdʒəri/",
            "us": "/ˈɪmɪdʒəri/"
        },
        "nearby": [
            {
                "word": "I'm A Celebrity … Get Me Out Of Here!",
                "pos": ""
            },
            {
                "word": "image",
                "pos": "noun"
            },
            {
                "word": "imagery",
                "pos": "noun"
            },
            {
                "word": "imagesetter",
                "pos": "noun"
            },
            {
                "word": "imaginable",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "language that produces pictures in the minds of people reading or listening",
                    "vi": "ngôn ngữ tạo ra hình ảnh trong tâm trí người đọc hoặc nghe"
                },
                "examples": [
                    {
                        "en": "poetic imagery",
                        "vi": "hình ảnh thơ mộng"
                    }
                ]
            },
            {
                "define": {
                    "en": "pictures, photographs, etc.",
                    "vi": "tranh, ảnh, v.v."
                },
                "examples": [
                    {
                        "en": "satellite imagery (= for example, photographs of the earth taken from space)",
                        "vi": "hình ảnh vệ tinh (= ví dụ: ảnh trái đất được chụp từ không gian)"
                    }
                ]
            }
        ]
    },
    {
        "id": "3b043d7daa044b75915f32fa3183411b",
        "word": "readable",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈriːdəbl/",
            "us": "/ˈriːdəbl/"
        },
        "nearby": [
            {
                "word": "read",
                "pos": "adjective"
            },
            {
                "word": "readability",
                "pos": "noun"
            },
            {
                "word": "readable",
                "pos": "adjective"
            },
            {
                "word": "read back",
                "pos": "phrasal verb"
            },
            {
                "word": "readdress",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "that is easy, interesting and enjoyable to read",
                    "vi": "dễ dàng, thú vị và thú vị để đọc"
                },
                "examples": [
                    {
                        "en": "a highly readable account of life in prison",
                        "vi": "một tường thuật rất dễ đọc về cuộc sống trong tù"
                    },
                    {
                        "en": "More examples would have made the explanation more readable.",
                        "vi": "Nhiều ví dụ hơn sẽ làm cho lời giải thích dễ đọc hơn."
                    },
                    {
                        "en": "a stimulating and highly readable account",
                        "vi": "một tài khoản kích thích và rất dễ đọc"
                    }
                ]
            },
            {
                "define": {
                    "en": "clear and easy to read",
                    "vi": "rõ ràng và dễ đọc"
                },
                "examples": [
                    {
                        "en": "The lettering on the front of the building is no longer readable.",
                        "vi": "Chữ ở mặt trước của tòa nhà không còn đọc được nữa."
                    },
                    {
                        "en": "printed in large, easily readable type",
                        "vi": "in loại lớn, dễ đọc"
                    }
                ]
            }
        ]
    },
    {
        "id": "d3eccdac2ff942a6a2441e4d770d1d94",
        "word": "stylistic",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/staɪˈlɪstɪk/",
            "us": "/staɪˈlɪstɪk/"
        },
        "nearby": [
            {
                "word": "stylishness",
                "pos": "noun"
            },
            {
                "word": "stylist",
                "pos": "noun"
            },
            {
                "word": "stylistic",
                "pos": "adjective"
            },
            {
                "word": "stylistically",
                "pos": "adverb"
            },
            {
                "word": "stylistics",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "connected with the style an artist uses in a particular piece of art, writing or music",
                    "vi": "được kết nối với phong cách mà một nghệ sĩ sử dụng trong một tác phẩm nghệ thuật, văn bản hoặc âm nhạc cụ thể"
                },
                "examples": [
                    {
                        "en": "stylistic analysis",
                        "vi": "phân tích phong cách"
                    },
                    {
                        "en": "stylistic features",
                        "vi": "các tính năng phong cách"
                    }
                ]
            }
        ]
    },
    {
        "id": "d0eb0186514849b3b617328dd989b912",
        "word": "symbolic",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/sɪmˈbɒlɪk/",
            "us": "/sɪmˈbɑːlɪk/"
        },
        "nearby": [
            {
                "word": "symbiotically",
                "pos": "adverb"
            },
            {
                "word": "symbol",
                "pos": "noun"
            },
            {
                "word": "symbolic",
                "pos": "adjective"
            },
            {
                "word": "symbolically",
                "pos": "adverb"
            },
            {
                "word": "symbolism",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "containing symbols, or being used as a symbol",
                    "vi": "chứa các ký hiệu hoặc được sử dụng như một biểu tượng"
                },
                "examples": [
                    {
                        "en": "He shook his fist in a symbolic gesture of defiance.",
                        "vi": "Anh ta lắc nắm tay trong một cử chỉ biểu tượng của sự thách thức."
                    },
                    {
                        "en": "The ceremony has a deep symbolic meaning.",
                        "vi": "Buổi lễ mang ý nghĩa biểu tượng sâu sắc."
                    },
                    {
                        "en": "The new regulations are largely symbolic (= they will not have any real effect).",
                        "vi": "Các quy định mới phần lớn chỉ mang tính biểu tượng (= chúng sẽ không có bất kỳ hiệu lực thực sự nào)."
                    },
                    {
                        "en": "symbolic of something The dove is symbolic of peace.",
                        "vi": "biểu tượng của một cái gì đó Chim bồ câu là biểu tượng của hòa bình."
                    }
                ]
            }
        ]
    },
    {
        "id": "416971e2521b4daf95897e1c1ec0fa78",
        "word": "tragic",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈtrædʒɪk/",
            "us": "/ˈtrædʒɪk/"
        },
        "nearby": [
            {
                "word": "tragedienne",
                "pos": "noun"
            },
            {
                "word": "tragedy",
                "pos": "noun"
            },
            {
                "word": "tragic",
                "pos": "adjective"
            },
            {
                "word": "tragically",
                "pos": "adverb"
            },
            {
                "word": "tragic irony",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "making you feel very sad, usually because somebody has died or suffered a lot",
                    "vi": "khiến bạn cảm thấy rất buồn, thường là vì ai đó đã chết hoặc phải chịu đựng rất nhiều"
                },
                "examples": [
                    {
                        "en": "He was killed in a tragic accident at the age of 24.",
                        "vi": "Anh ấy đã thiệt mạng trong một vụ tai nạn thảm khốc ở tuổi 24."
                    },
                    {
                        "en": "Cuts in the health service could have tragic consequences for patients.",
                        "vi": "Việc cắt giảm dịch vụ y tế có thể gây ra hậu quả bi thảm cho bệnh nhân."
                    },
                    {
                        "en": "It would be tragic if her talent remained unrecognized.",
                        "vi": "Sẽ thật bi thảm nếu tài năng của cô ấy vẫn không được công nhận."
                    },
                    {
                        "en": "a rather tragic story",
                        "vi": "một câu chuyện khá bi thảm"
                    }
                ]
            },
            {
                "define": {
                    "en": "connected with tragedy (= the style of literature)",
                    "vi": "kết nối với bi kịch (= phong cách văn học)"
                },
                "examples": [
                    {
                        "en": "a tragic actor/hero",
                        "vi": "một diễn viên / anh hùng bi kịch"
                    }
                ]
            }
        ]
    },
    {
        "id": "a85d1c5ccca940fcbed22f85e264d40f",
        "word": "allegorical",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌæləˈɡɒrɪkl/",
            "us": "/ˌæləˈɡɔːrɪkl/"
        },
        "nearby": [
            {
                "word": "the Allegheny Mountains",
                "pos": ""
            },
            {
                "word": "allegiance",
                "pos": "noun"
            },
            {
                "word": "allegorical",
                "pos": "adjective"
            },
            {
                "word": "allegorically",
                "pos": "adverb"
            },
            {
                "word": "allegory",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "using characters or events as symbols to represent an idea or a quality, such as truth, evil, death, etc.",
                    "vi": "sử dụng các ký tự hoặc sự kiện làm biểu tượng để đại diện cho một ý tưởng hoặc một phẩm chất, chẳng hạn như sự thật, cái ác, cái chết, v.v."
                },
                "examples": [
                    {
                        "en": "an allegorical figure/novel",
                        "vi": "một nhân vật ngụ ngôn / tiểu thuyết"
                    }
                ]
            }
        ]
    },
    {
        "id": "753ab7cd4e4a4f8e87aeb5b05f4d098a",
        "word": "artistic/poetic licence",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈlaɪsns/",
            "us": "/ˈlaɪsns/"
        },
        "nearby": [
            {
                "word": "Libyan",
                "pos": "noun, adjective"
            },
            {
                "word": "lice",
                "pos": "noun"
            },
            {
                "word": "licence",
                "pos": "noun"
            },
            {
                "word": "license",
                "pos": "verb"
            },
            {
                "word": "license",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an official document that shows that permission has been given to do, own or use something",
                    "vi": "một tài liệu chính thức cho thấy rằng quyền đã được cấp để làm, sở hữu hoặc sử dụng một cái gì đó"
                },
                "examples": [
                    {
                        "en": "Applicants must hold a valid driving licence.",
                        "vi": "Ứng viên phải có bằng lái xe hợp lệ."
                    },
                    {
                        "en": "to get/obtain/have a licence",
                        "vi": "để có được / có được / có một giấy phép"
                    },
                    {
                        "en": "to grant/issue a licence",
                        "vi": "cấp / cấp giấy phép"
                    },
                    {
                        "en": "James lost his licence for six months (= had his licence taken away by the police as a punishment).",
                        "vi": "James đã mất bằng lái trong sáu tháng (= bị cảnh sát tước bằng lái như một hình phạt)."
                    },
                    {
                        "en": "Her licence was revoked by the court.",
                        "vi": "Giấy phép của cô đã bị thu hồi bởi tòa án."
                    },
                    {
                        "en": "licence for something a licence for the software",
                        "vi": "giấy phép cho một cái gì đó giấy phép cho phần mềm"
                    },
                    {
                        "en": "licence to do something You need a licence to fish in this river.",
                        "vi": "giấy phép để làm một cái gì đó Bạn cần có giấy phép để đánh bắt cá ở con sông này."
                    },
                    {
                        "en": "without a licence He was caught driving a car without a licence.",
                        "vi": "không có giấy phép Anh ta đã bị bắt khi đang điều khiển một chiếc xe hơi mà không có giấy phép."
                    },
                    {
                        "en": "Is there a licence fee?",
                        "vi": "Có lệ phí cấp giấy phép không?"
                    },
                    {
                        "en": "a licence holder (= a person who has been given a licence)",
                        "vi": "một chủ giấy phép (= một người đã được cấp giấy phép)"
                    },
                    {
                        "en": "a licence agreement",
                        "vi": "một thỏa thuận cấp phép"
                    }
                ]
            },
            {
                "define": {
                    "en": "freedom to do or say whatever you want, often something bad or unacceptable",
                    "vi": "tự do làm hoặc nói bất cứ điều gì bạn muốn, thường là điều gì đó xấu hoặc không thể chấp nhận được"
                },
                "examples": [
                    {
                        "en": "Lack of punishment seems to give youngsters licence to break the law.",
                        "vi": "Việc thiếu hình phạt dường như cho phép những người trẻ tuổi vi phạm pháp luật."
                    }
                ]
            },
            {
                "define": {
                    "en": "freedom to behave in a way that is not considered sexually moral",
                    "vi": "tự do hành xử theo cách không bị coi là luân lý tình dục"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the freedom of artists or writers to change facts in order to make a story, painting, etc. more interesting or beautiful",
                    "vi": "quyền tự do của nghệ sĩ hoặc nhà văn trong việc thay đổi sự thật để làm cho câu chuyện, bức tranh, v.v. thú vị hơn hoặc đẹp hơn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to describe a business that makes a lot of money with little effort",
                    "vi": "được sử dụng để mô tả một doanh nghiệp kiếm được nhiều tiền với ít nỗ lực"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "made with the permission of a company or an organization",
                    "vi": "được thực hiện với sự cho phép của một công ty hoặc một tổ chức"
                },
                "examples": [
                    {
                        "en": "They are Italian trains, but they will be built in Britain under licence.",
                        "vi": "Chúng là những đoàn tàu của Ý, nhưng chúng sẽ được đóng ở Anh theo giấy phép."
                    },
                    {
                        "en": "The beer is brewed under licence in the UK.",
                        "vi": "Bia được sản xuất theo giấy phép ở Anh."
                    }
                ]
            }
        ]
    },
    {
        "id": "c7b0a23eb518478aba4f87814e7169d3",
        "word": "canonical",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/kəˈnɒnɪkl/",
            "us": "/kəˈnɑːnɪkl/"
        },
        "nearby": [
            {
                "word": "canon",
                "pos": "noun"
            },
            {
                "word": "canonic",
                "pos": "adjective"
            },
            {
                "word": "canonical",
                "pos": "adjective"
            },
            {
                "word": "canonical form",
                "pos": "noun"
            },
            {
                "word": "canonization",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "included in a list of holy books that are accepted as what they are claimed to be",
                    "vi": "được đưa vào danh sách các sách thánh được chấp nhận như những gì chúng được tuyên bố là"
                },
                "examples": [
                    {
                        "en": "the canonical Gospels of the New Testament",
                        "vi": "các sách Phúc âm kinh điển của Tân Ước"
                    }
                ]
            },
            {
                "define": {
                    "en": "according to the law of the Christian Church",
                    "vi": "theo luật của Giáo hội Thiên chúa giáo"
                },
                "examples": [
                    {
                        "en": "canonical rules",
                        "vi": "quy tắc kinh điển"
                    }
                ]
            },
            {
                "define": {
                    "en": "accepted as belonging to the group of writers or works of literature that must be highly respected",
                    "vi": "được chấp nhận là thuộc nhóm nhà văn hoặc tác phẩm văn học cần được tôn trọng"
                },
                "examples": [
                    {
                        "en": "canonical writers like Jane Austen",
                        "vi": "nhà văn kinh điển như Jane Austen"
                    }
                ]
            },
            {
                "define": {
                    "en": "accepted as being true, correct and established",
                    "vi": "được chấp nhận là đúng, đúng và được thiết lập"
                },
                "examples": [
                    {
                        "en": "the canonical methods of science as taught in the classroom",
                        "vi": "các phương pháp khoa học kinh điển được dạy trong lớp học"
                    }
                ]
            },
            {
                "define": {
                    "en": "in the simplest accepted form in mathematics",
                    "vi": "ở dạng toán học được chấp nhận đơn giản nhất"
                },
                "examples": [
                    {
                        "en": "the standard canonical form for a matrix",
                        "vi": "dạng chính tắc tiêu chuẩn cho ma trận"
                    }
                ]
            }
        ]
    },
    {
        "id": "846f9bd2a6be4a2e94e883fec145260f",
        "word": "conceit",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/kənˈsiːt/",
            "us": "/kənˈsiːt/"
        },
        "nearby": [
            {
                "word": "concealment",
                "pos": "noun"
            },
            {
                "word": "concede",
                "pos": "verb"
            },
            {
                "word": "conceit",
                "pos": "noun"
            },
            {
                "word": "conceited",
                "pos": "adjective"
            },
            {
                "word": "conceitedly",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the fact of being too proud of yourself and what you do",
                    "vi": "thực tế là quá tự hào về bản thân và những gì bạn làm"
                },
                "examples": [
                    {
                        "en": "I can say without conceit that I have talent.",
                        "vi": "Tôi có thể nói không chút tự phụ rằng tôi có tài năng."
                    }
                ]
            },
            {
                "define": {
                    "en": "an artistic effect or device, especially one that is very clever or tries to be very clever but does not succeed",
                    "vi": "một hiệu ứng nghệ thuật hoặc thiết bị, đặc biệt là một thiết bị rất thông minh hoặc cố gắng rất thông minh nhưng không thành công"
                },
                "examples": [
                    {
                        "en": "The ill-advised conceit of the guardian angel dooms the film from the start.",
                        "vi": "Sự tự phụ đầy ác ý của thiên thần hộ mệnh đã kết thúc bộ phim ngay từ đầu."
                    },
                    {
                        "en": "The director’s brilliant conceit was to film this tale in black and white.",
                        "vi": "Sự tự phụ tuyệt vời của đạo diễn là quay câu chuyện này bằng màu đen và trắng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a clever expression in writing or speech that involves a comparison between two things",
                    "vi": "một cách diễn đạt thông minh trong văn bản hoặc bài phát biểu liên quan đến sự so sánh giữa hai điều"
                },
                "examples": [
                    {
                        "en": "The idea of the wind singing is a romantic conceit.",
                        "vi": "Ý tưởng về gió hát là một lãng mạn tự phụ."
                    }
                ]
            }
        ]
    },
    {
        "id": "27f020b3f2e94a96a8eb1bf4cfcb747c",
        "word": "corny",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkɔːni/",
            "us": "/ˈkɔːrni/"
        },
        "nearby": [
            {
                "word": "the Duke of Cornwall",
                "pos": ""
            },
            {
                "word": "Lord Charles Cornwallis",
                "pos": ""
            },
            {
                "word": "corny",
                "pos": "adjective"
            },
            {
                "word": "corolla",
                "pos": "noun"
            },
            {
                "word": "corollary",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "not original; used too often to be interesting or to sound sincere",
                    "vi": "không phải bản gốc; được sử dụng quá thường xuyên để trở nên thú vị hoặc để nghe có vẻ chân thành"
                },
                "examples": [
                    {
                        "en": "a corny joke/song",
                        "vi": "một trò đùa / bài hát ngô nghê"
                    },
                    {
                        "en": "I know it sounds corny, but it really was love at first sight!",
                        "vi": "Tôi biết điều đó nghe có vẻ ngô nghê, nhưng đó thực sự là tình yêu sét đánh!"
                    },
                    {
                        "en": "Opera’s blend of corny emotion with glamour and spectacle appeals to advertisers.",
                        "vi": "Sự pha trộn giữa cảm xúc ngô nghê với vẻ hào nhoáng và cảnh tượng của Opera thu hút các nhà quảng cáo."
                    },
                    {
                        "en": "You sound like someone out of a corny film!",
                        "vi": "Bạn nghe như một người nào đó trong một bộ phim ngô nghê!"
                    }
                ]
            }
        ]
    },
    {
        "id": "0d20f784a4774f9483a9edd72eabf8a7",
        "word": "edgy",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈedʒi/",
            "us": "/ˈedʒi/"
        },
        "nearby": [
            {
                "word": "edginess",
                "pos": "noun"
            },
            {
                "word": "edging",
                "pos": "noun"
            },
            {
                "word": "edgy",
                "pos": "adjective"
            },
            {
                "word": "EDI",
                "pos": "noun"
            },
            {
                "word": "edible",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "nervous, especially about what might happen",
                    "vi": "lo lắng, đặc biệt là về những gì có thể xảy ra"
                },
                "examples": [
                    {
                        "en": "She's been very edgy lately.",
                        "vi": "Cô ấy gần đây rất khó chịu."
                    },
                    {
                        "en": "After the recent unrest there is an edgy calm in the capital.",
                        "vi": "Sau những bất ổn gần đây, có một sự bình tĩnh sắc nét ở thủ đô."
                    },
                    {
                        "en": "I’m feeling a bit edgy about the exam tomorrow.",
                        "vi": "Tôi cảm thấy một chút khó khăn về kỳ thi ngày mai."
                    }
                ]
            },
            {
                "define": {
                    "en": "having a sharp exciting quality",
                    "vi": "có một chất lượng thú vị sắc nét"
                },
                "examples": [
                    {
                        "en": "a clever, edgy film",
                        "vi": "một bộ phim thông minh, sắc sảo"
                    },
                    {
                        "en": "the Ska beat, faster than reggae and a bit edgier",
                        "vi": "nhịp điệu Ska, nhanh hơn reggae và một chút sắc bén"
                    },
                    {
                        "en": "Her ideal man would be ‘edgy’.",
                        "vi": "Người đàn ông lý tưởng của cô ấy sẽ là một người 'sắc sảo'."
                    }
                ]
            }
        ]
    },
    {
        "id": "555209a8e070495197c572ac4513c3ec",
        "word": "far-fetched",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌfɑː ˈfetʃt/",
            "us": "/ˌfɑːr ˈfetʃt/"
        },
        "nearby": [
            {
                "word": "the Farewell Address",
                "pos": ""
            },
            {
                "word": "farfalle",
                "pos": "noun"
            },
            {
                "word": "far-fetched",
                "pos": "adjective"
            },
            {
                "word": "far-flung",
                "pos": "adjective"
            },
            {
                "word": "Far from the Madding Crowd",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "very difficult to believe",
                    "vi": "rất khó tin"
                },
                "examples": [
                    {
                        "en": "The whole story sounds very far-fetched.",
                        "vi": "Toàn bộ câu chuyện nghe có vẻ rất xa vời."
                    }
                ]
            }
        ]
    },
    {
        "id": "70be1c5817274cf3a639df98b0f8a951",
        "word": "flowery",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈflaʊəri/",
            "us": "/ˈflaʊəri/"
        },
        "nearby": [
            {
                "word": "flowerpot",
                "pos": "noun"
            },
            {
                "word": "flower power",
                "pos": "noun"
            },
            {
                "word": "flowery",
                "pos": "adjective"
            },
            {
                "word": "flow from",
                "pos": "phrasal verb"
            },
            {
                "word": "flown",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "covered with flowers or decorated with pictures of flowers",
                    "vi": "phủ hoa hoặc trang trí bằng hình ảnh của hoa"
                },
                "examples": [
                    {
                        "en": "flowery meadows",
                        "vi": "đồng cỏ hoa"
                    },
                    {
                        "en": "flowery wallpaper",
                        "vi": "hình nền hoa"
                    }
                ]
            },
            {
                "define": {
                    "en": "smelling or tasting of flowers",
                    "vi": "ngửi hoặc nếm hoa"
                },
                "examples": [
                    {
                        "en": "flowery perfume",
                        "vi": "nước hoa"
                    },
                    {
                        "en": "a flowery sparkling wine",
                        "vi": "một loại rượu vang có hoa"
                    }
                ]
            },
            {
                "define": {
                    "en": "too complicated; not expressed in a clear and simple way",
                    "vi": "quá phức tạp; không được thể hiện một cách rõ ràng và đơn giản"
                },
                "examples": [
                    {
                        "en": "flowery language/prose",
                        "vi": "ngôn ngữ hoa mỹ / văn xuôi"
                    }
                ]
            }
        ]
    },
    {
        "id": "9d44da2cb69145c3958bbc4262056149",
        "word": "heart-rending",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈhɑːt rendɪŋ/",
            "us": "/ˈhɑːrt rendɪŋ/"
        },
        "nearby": [
            {
                "word": "heart of palm",
                "pos": "noun"
            },
            {
                "word": "heart rate",
                "pos": "noun"
            },
            {
                "word": "heart-rending",
                "pos": "adjective"
            },
            {
                "word": "heart-searching",
                "pos": "noun"
            },
            {
                "word": "heartsick",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "causing very sad feelings",
                    "vi": "gây ra cảm giác rất buồn"
                },
                "examples": [
                    {
                        "en": "a heart-rending story",
                        "vi": "một câu chuyện khắc cốt ghi tâm"
                    }
                ]
            }
        ]
    },
    {
        "id": "14f616feb7144d6fb6ebf419861cda3c",
        "word": "hyperbole",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/haɪˈpɜːbəli/",
            "us": "/haɪˈpɜːrbəli/"
        },
        "nearby": [
            {
                "word": "hyperbaric chamber",
                "pos": "noun"
            },
            {
                "word": "hyperbola",
                "pos": "noun"
            },
            {
                "word": "hyperbole",
                "pos": "noun"
            },
            {
                "word": "hyperbolic",
                "pos": "adjective"
            },
            {
                "word": "hypercorrection",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a way of speaking or writing that makes something sound better, more exciting, more dangerous, etc. than it really is",
                    "vi": "một cách nói hoặc viết làm cho điều gì đó nghe hay hơn, thú vị hơn, nguy hiểm hơn, v.v. so với thực tế"
                },
                "examples": [
                    {
                        "en": "The film is being promoted with all the usual hyperbole.",
                        "vi": "Bộ phim đang được quảng bá với tất cả những gì cường điệu thông thường."
                    },
                    {
                        "en": "He’s not usually given to hyperbole.",
                        "vi": "Anh ấy thường không được cho là cường điệu."
                    }
                ]
            }
        ]
    },
    {
        "id": "7ebadec894474ce183fe62c68d717022",
        "word": "labored",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈleɪbəd/",
            "us": "/ˈleɪbərd/"
        },
        "nearby": [
            {
                "word": "laboratory",
                "pos": "noun"
            },
            {
                "word": "Labor Day",
                "pos": "noun"
            },
            {
                "word": "labored",
                "pos": "adjective"
            },
            {
                "word": "laborer",
                "pos": "noun"
            },
            {
                "word": "laboring",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "slow and taking a lot of effort",
                    "vi": "chậm và tốn nhiều công sức"
                },
                "examples": [
                    {
                        "en": "Her breathing became more and more labored.",
                        "vi": "Hơi thở của cô ngày càng trở nên dồn dập hơn."
                    }
                ]
            },
            {
                "define": {
                    "en": "not natural and seeming to take a lot of effort",
                    "vi": "không tự nhiên và có vẻ tốn nhiều công sức"
                },
                "examples": [
                    {
                        "en": "The movie looks labored and slow by today's standards.",
                        "vi": "Theo tiêu chuẩn ngày nay, bộ phim trông có vẻ mệt nhọc và chậm chạp."
                    }
                ]
            }
        ]
    },
    {
        "id": "63c0920619f14a65bbd0c0b210904583",
        "word": "laboured",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈleɪbəd/",
            "us": "/ˈleɪbərd/"
        },
        "nearby": [
            {
                "word": "labour",
                "pos": "verb"
            },
            {
                "word": "labour camp",
                "pos": "noun"
            },
            {
                "word": "laboured",
                "pos": "adjective"
            },
            {
                "word": "labourer",
                "pos": "noun"
            },
            {
                "word": "labour force",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "slow and taking a lot of effort",
                    "vi": "chậm và tốn nhiều công sức"
                },
                "examples": [
                    {
                        "en": "Her breathing became more and more laboured.",
                        "vi": "Hơi thở của cô ngày càng trở nên dồn dập hơn."
                    }
                ]
            },
            {
                "define": {
                    "en": "not natural and seeming to take a lot of effort",
                    "vi": "không tự nhiên và có vẻ tốn nhiều công sức"
                },
                "examples": [
                    {
                        "en": "The movie looks laboured and slow by today’s standards.",
                        "vi": "Theo tiêu chuẩn ngày nay, bộ phim trông có vẻ mệt nhọc và chậm chạp."
                    }
                ]
            }
        ]
    },
    {
        "id": "16fd420dc60b4699a3b6488d0d1ddc1c",
        "word": "lurid",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈlʊərɪd/",
            "us": "/ˈlʊrɪd/"
        },
        "nearby": [
            {
                "word": "Lurex",
                "pos": "noun"
            },
            {
                "word": "lurgy",
                "pos": "noun"
            },
            {
                "word": "lurid",
                "pos": "adjective"
            },
            {
                "word": "luridly",
                "pos": "adverb"
            },
            {
                "word": "lurk",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "too bright in colour, in a way that is not attractive",
                    "vi": "màu quá sáng, theo cách không hấp dẫn"
                },
                "examples": [
                    {
                        "en": "She was wearing a lurid orange and green blouse.",
                        "vi": "Cô ấy mặc một chiếc áo cánh màu cam và xanh lục nhạt."
                    }
                ]
            },
            {
                "define": {
                    "en": "presented in a way that is intended to shock",
                    "vi": "được trình bày theo cách nhằm gây sốc"
                },
                "examples": [
                    {
                        "en": "lurid headlines",
                        "vi": "tiêu đề buồn tẻ"
                    },
                    {
                        "en": "The paper gave all the lurid details of the murder.",
                        "vi": "Tờ báo đã đưa ra tất cả các chi tiết ngớ ngẩn của vụ giết người."
                    }
                ]
            }
        ]
    },
    {
        "id": "ab0ecb1f76574727823bd2ecadbcc30e",
        "word": "lyricism",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈlɪrɪsɪzəm/",
            "us": "/ˈlɪrɪsɪzəm/"
        },
        "nearby": [
            {
                "word": "Lyrical Ballads",
                "pos": ""
            },
            {
                "word": "lyrically",
                "pos": "adverb"
            },
            {
                "word": "lyricism",
                "pos": "noun"
            },
            {
                "word": "lyricist",
                "pos": "noun"
            },
            {
                "word": "Humphrey Lyttleton",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the expression of strong emotion in poetry, art, music, etc.",
                    "vi": "sự thể hiện cảm xúc mạnh mẽ trong thơ ca, nghệ thuật, âm nhạc, v.v."
                },
                "examples": [
                    {
                        "en": "She played the concerto with passionate lyricism.",
                        "vi": "Cô chơi bản concerto với chất trữ tình nồng nàn."
                    },
                    {
                        "en": "the lyricism of his early poetry",
                        "vi": "chất trữ tình trong thơ đầu của ông"
                    }
                ]
            }
        ]
    },
    {
        "id": "8e880c6091cb4d399f1240cd5d05c716",
        "word": "mannered",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmænəd/",
            "us": "/ˈmænərd/"
        },
        "nearby": [
            {
                "word": "mannequin",
                "pos": "noun"
            },
            {
                "word": "manner",
                "pos": "noun"
            },
            {
                "word": "mannered",
                "pos": "adjective"
            },
            {
                "word": "mannerism",
                "pos": "noun"
            },
            {
                "word": "mannerist",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "trying to impress people by being formal and not natural",
                    "vi": "cố gắng gây ấn tượng với mọi người bằng cách trang trọng và không tự nhiên"
                },
                "examples": [
                    {
                        "en": "His prose style is far too mannered and self-conscious.",
                        "vi": "Phong cách văn xuôi của anh ấy quá chỉn chu và tự giác."
                    },
                    {
                        "en": "deliberately slow and mannered movements",
                        "vi": "chuyển động chậm và có chủ ý"
                    }
                ]
            },
            {
                "define": {
                    "en": "having the type of manners mentioned",
                    "vi": "có kiểu cư xử được đề cập"
                },
                "examples": [
                    {
                        "en": "a bad-mannered child",
                        "vi": "một đứa trẻ xấu"
                    }
                ]
            }
        ]
    },
    {
        "id": "536980eba3d64bf18328cc3ae00e341e",
        "word": "meta",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmetə/",
            "us": "/ˈmetə/"
        },
        "nearby": [
            {
                "word": "Met",
                "pos": "abbreviation"
            },
            {
                "word": "the Met",
                "pos": "noun"
            },
            {
                "word": "meta",
                "pos": "adjective"
            },
            {
                "word": "meta-",
                "pos": "combining form"
            },
            {
                "word": "meta-analysis",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "showing awareness of itself or its genre",
                    "vi": "thể hiện nhận thức về bản thân hoặc thể loại của nó"
                },
                "examples": [
                    {
                        "en": "The current season relies on running jokes and meta references to the show's history.",
                        "vi": "Phần hiện tại dựa trên các câu chuyện cười đang chạy và tham chiếu meta đến lịch sử của chương trình."
                    }
                ]
            }
        ]
    },
    {
        "id": "806def2434794beaa29df96107fc0abf",
        "word": "naturalistic",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌnætʃrəˈlɪstɪk/",
            "us": "/ˌnætʃrəˈlɪstɪk/"
        },
        "nearby": [
            {
                "word": "naturalism",
                "pos": "noun"
            },
            {
                "word": "naturalist",
                "pos": "noun"
            },
            {
                "word": "naturalistic",
                "pos": "adjective"
            },
            {
                "word": "naturalization",
                "pos": "noun"
            },
            {
                "word": "naturalize",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "showing things as they appear in the natural world",
                    "vi": "hiển thị mọi thứ như chúng xuất hiện trong thế giới tự nhiên"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "copying the way things are in the natural world",
                    "vi": "sao chép cách mọi thứ trong thế giới tự nhiên"
                },
                "examples": [
                    {
                        "en": "to study behaviour in laboratory and naturalistic settings",
                        "vi": "để nghiên cứu hành vi trong phòng thí nghiệm và môi trường tự nhiên"
                    }
                ]
            }
        ]
    },
    {
        "id": "6a814a0652914b84adb0858b3fd99b00",
        "word": "pacey",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpeɪsi/",
            "us": "/ˈpeɪsi/"
        },
        "nearby": [
            {
                "word": "pace out",
                "pos": "phrasal verb"
            },
            {
                "word": "pacesetter",
                "pos": "noun"
            },
            {
                "word": "pacey",
                "pos": "adjective"
            },
            {
                "word": "pachinko",
                "pos": "noun"
            },
            {
                "word": "pachyderm",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "having a story that develops quickly",
                    "vi": "có một câu chuyện phát triển nhanh chóng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "able to run quickly",
                    "vi": "có thể chạy nhanh"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "552da1f9f459405d8fc6276446670328",
        "word": "pacy",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpeɪsi/",
            "us": "/ˈpeɪsi/"
        },
        "nearby": [
            {
                "word": "pack up",
                "pos": "phrasal verb"
            },
            {
                "word": "pact",
                "pos": "noun"
            },
            {
                "word": "pacy",
                "pos": "adjective"
            },
            {
                "word": "pad",
                "pos": "noun"
            },
            {
                "word": "pad",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "having a story that develops quickly",
                    "vi": "có một câu chuyện phát triển nhanh chóng"
                },
                "examples": [
                    {
                        "en": "a pacy thriller",
                        "vi": "một bộ phim kinh dị pacy"
                    }
                ]
            },
            {
                "define": {
                    "en": "able to run quickly",
                    "vi": "có thể chạy nhanh"
                },
                "examples": [
                    {
                        "en": "a pacy winger who can also score goals",
                        "vi": "một cầu thủ chạy cánh pacy cũng có thể ghi bàn"
                    }
                ]
            }
        ]
    },
    {
        "id": "ca981612ac504079ae1a72c1e5b9775b",
        "word": "picaresque",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌpɪkəˈresk/",
            "us": "/ˌpɪkəˈresk/"
        },
        "nearby": [
            {
                "word": "pica",
                "pos": "noun"
            },
            {
                "word": "picante",
                "pos": "adjective"
            },
            {
                "word": "picaresque",
                "pos": "adjective"
            },
            {
                "word": "picayune",
                "pos": "adjective"
            },
            {
                "word": "Piccadilly",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "connected with literature that describes the adventures of a person who is sometimes dishonest but easy to like",
                    "vi": "kết nối với văn học mô tả cuộc phiêu lưu của một người đôi khi không trung thực nhưng dễ thích"
                },
                "examples": [
                    {
                        "en": "a picaresque novel",
                        "vi": "một tiểu thuyết dã ngoại"
                    }
                ]
            }
        ]
    },
    {
        "id": "2278215136ad4eb998c22cbf27eedc81",
        "word": "pictorial",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/pɪkˈtɔːriəl/",
            "us": "/pɪkˈtɔːriəl/"
        },
        "nearby": [
            {
                "word": "pictogram",
                "pos": "noun"
            },
            {
                "word": "pictograph",
                "pos": "noun"
            },
            {
                "word": "pictorial",
                "pos": "adjective"
            },
            {
                "word": "pictorially",
                "pos": "adverb"
            },
            {
                "word": "picture",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "using or containing pictures",
                    "vi": "sử dụng hoặc chứa hình ảnh"
                },
                "examples": [
                    {
                        "en": "Pictorial representation of statistics or data in a chart is a kind of pictogram.",
                        "vi": "Biểu diễn bằng hình ảnh của số liệu thống kê hoặc dữ liệu trong biểu đồ là một loại biểu đồ."
                    },
                    {
                        "en": "a pictorial account/record of the expedition",
                        "vi": "một tài khoản hình ảnh / hồ sơ về cuộc thám hiểm"
                    },
                    {
                        "en": "a pictorial encyclopedia",
                        "vi": "một bách khoa toàn thư bằng hình ảnh"
                    }
                ]
            },
            {
                "define": {
                    "en": "connected with pictures",
                    "vi": "kết nối với hình ảnh"
                },
                "examples": [
                    {
                        "en": "pictorial traditions",
                        "vi": "truyền thống hình ảnh"
                    }
                ]
            }
        ]
    },
    {
        "id": "2f35ec4ea7e3448992a16cddf85e1eb6",
        "word": "potted",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpɒtɪd/",
            "us": "/ˈpɑːtɪd/"
        },
        "nearby": [
            {
                "word": "potshot",
                "pos": "noun"
            },
            {
                "word": "pottage",
                "pos": "noun"
            },
            {
                "word": "potted",
                "pos": "adjective"
            },
            {
                "word": "potter",
                "pos": "verb"
            },
            {
                "word": "Dennis Potter",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "planted in a pot",
                    "vi": "trồng trong chậu"
                },
                "examples": [
                    {
                        "en": "potted plants",
                        "vi": "cây trồng trong chậu"
                    }
                ]
            },
            {
                "define": {
                    "en": "in a short simple form",
                    "vi": "trong một hình thức đơn giản ngắn gọn"
                },
                "examples": [
                    {
                        "en": "a potted history of England",
                        "vi": "một lịch sử trong chậu của nước Anh"
                    }
                ]
            },
            {
                "define": {
                    "en": "potted meat or fish has been cooked and preserved in a small container",
                    "vi": "thịt hoặc cá trong chậu đã được nấu chín và bảo quản trong một hộp nhỏ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "7731d875d7af46189c5c46a40724dbf2",
        "word": "prolix",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈprəʊlɪks/",
            "us": "/ˈprəʊlɪks/"
        },
        "nearby": [
            {
                "word": "prolific",
                "pos": "adjective"
            },
            {
                "word": "prolifically",
                "pos": "adverb"
            },
            {
                "word": "prolix",
                "pos": "adjective"
            },
            {
                "word": "prolixity",
                "pos": "noun"
            },
            {
                "word": "prologue",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "using too many words and therefore boring",
                    "vi": "sử dụng quá nhiều từ và do đó nhàm chán"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "e0b9f6620af94290b9ec3cf220a5654e",
        "word": "prolixity",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/prəʊˈlɪksəti/",
            "us": "/prəʊˈlɪksəti/"
        },
        "nearby": [
            {
                "word": "prolifically",
                "pos": "adverb"
            },
            {
                "word": "prolix",
                "pos": "adjective"
            },
            {
                "word": "prolixity",
                "pos": "noun"
            },
            {
                "word": "prologue",
                "pos": "noun"
            },
            {
                "word": "prolong",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the fact of using too many words and therefore creating a piece of writing, a speech, etc. that is boring",
                    "vi": "thực tế là sử dụng quá nhiều từ và do đó tạo ra một đoạn văn, một bài phát biểu, v.v. gây nhàm chán"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "9add135f76cd4fa4bc41c81a0b4b029b",
        "word": "racy",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈreɪsi/",
            "us": "/ˈreɪsi/"
        },
        "nearby": [
            {
                "word": "racquet abuse",
                "pos": "noun"
            },
            {
                "word": "racquetball",
                "pos": "noun"
            },
            {
                "word": "racy",
                "pos": "adjective"
            },
            {
                "word": "rad",
                "pos": "adjective"
            },
            {
                "word": "rad",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "having a style that is exciting and fun, sometimes in a way that is connected with sex",
                    "vi": "có một phong cách thú vị và vui vẻ, đôi khi theo một cách liên quan đến tình dục"
                },
                "examples": [
                    {
                        "en": "a racy novel",
                        "vi": "một cuốn tiểu thuyết kỳ lạ"
                    }
                ]
            }
        ]
    },
    {
        "id": "0f743ee2f034409d86dbaf2402367593",
        "word": "rambling",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈræmblɪŋ/",
            "us": "/ˈræmblɪŋ/"
        },
        "nearby": [
            {
                "word": "rambler",
                "pos": "noun"
            },
            {
                "word": "the Ramblers",
                "pos": ""
            },
            {
                "word": "rambling",
                "pos": "adjective"
            },
            {
                "word": "rambling",
                "pos": "noun"
            },
            {
                "word": "Rambo",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "spreading in various directions with no particular pattern",
                    "vi": "lan rộng theo nhiều hướng khác nhau mà không có mô hình cụ thể"
                },
                "examples": [
                    {
                        "en": "They live in a rambling old house in the country.",
                        "vi": "Họ sống trong một ngôi nhà cũ xiêu vẹo ở miền quê."
                    }
                ]
            },
            {
                "define": {
                    "en": "very long and confused",
                    "vi": "rất dài và bối rối"
                },
                "examples": [
                    {
                        "en": "a rambling letter",
                        "vi": "một lá thư lan man"
                    },
                    {
                        "en": "She set off on a long rambling account of something that had happened the day before.",
                        "vi": "Cô ấy bắt đầu một bài tường thuật dài dòng lan man về một điều gì đó đã xảy ra vào ngày hôm trước."
                    },
                    {
                        "en": "The letter was long and rambling.",
                        "vi": "Bức thư dài và lan man."
                    }
                ]
            },
            {
                "define": {
                    "en": "growing or climbing in all directions, for example up a wall",
                    "vi": "mọc hoặc leo theo mọi hướng, ví dụ như lên tường"
                },
                "examples": [
                    {
                        "en": "a rambling rose",
                        "vi": "một bông hồng lan man"
                    }
                ]
            }
        ]
    },
    {
        "id": "79aa5155399a478a8496648ff7a0de5b",
        "word": "raunchy",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈrɔːntʃi/",
            "us": "/ˈrɔːntʃi/"
        },
        "nearby": [
            {
                "word": "raucously",
                "pos": "adverb"
            },
            {
                "word": "raucousness",
                "pos": "noun"
            },
            {
                "word": "raunchy",
                "pos": "adjective"
            },
            {
                "word": "Robert Rauschenberg",
                "pos": ""
            },
            {
                "word": "ravage",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "intended to be sexually exciting",
                    "vi": "nhằm mục đích kích thích tình dục"
                },
                "examples": [
                    {
                        "en": "a raunchy magazine",
                        "vi": "một tạp chí độc đáo"
                    },
                    {
                        "en": "Their stage act is a little too raunchy for television.",
                        "vi": "Màn trình diễn trên sân khấu của họ hơi quá lố so với truyền hình."
                    }
                ]
            },
            {
                "define": {
                    "en": "looking dirty and untidy",
                    "vi": "trông bẩn thỉu và bừa bộn"
                },
                "examples": [
                    {
                        "en": "a raunchy old man",
                        "vi": "một ông già thô lỗ"
                    }
                ]
            }
        ]
    },
    {
        "id": "e9228805d7524c8fa48408177f16dece",
        "word": "self-referential",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌself refəˈrenʃl/",
            "us": "/ˌself refəˈrenʃl/"
        },
        "nearby": [
            {
                "word": "self-raising flour",
                "pos": "noun"
            },
            {
                "word": "self-realization",
                "pos": "noun"
            },
            {
                "word": "self-referential",
                "pos": "adjective"
            },
            {
                "word": "self-reflection",
                "pos": "noun"
            },
            {
                "word": "self-regard",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "referring to the fact of actually being a work of literature, or to the author, or to other works that the author has written",
                    "vi": "đề cập đến thực tế thực sự là một tác phẩm văn học, hoặc tác giả, hoặc các tác phẩm khác mà tác giả đã viết"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c62d5963b94f4d91b33c7654418fb02b",
        "word": "spine-chilling",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈspaɪn tʃɪlɪŋ/",
            "us": "/ˈspaɪn tʃɪlɪŋ/"
        },
        "nearby": [
            {
                "word": "spine",
                "pos": "noun"
            },
            {
                "word": "spine-chiller",
                "pos": "noun"
            },
            {
                "word": "spine-chilling",
                "pos": "adjective"
            },
            {
                "word": "spineless",
                "pos": "adjective"
            },
            {
                "word": "spinet",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "frightening in an exciting way",
                    "vi": "đáng sợ một cách thú vị"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "3c2ee4219ef5491db3ffbffc94ece14d",
        "word": "suspenseful",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/səˈspensfl/",
            "us": "/səˈspensfl/"
        },
        "nearby": [
            {
                "word": "suspender belt",
                "pos": "noun"
            },
            {
                "word": "suspense",
                "pos": "noun"
            },
            {
                "word": "suspenseful",
                "pos": "adjective"
            },
            {
                "word": "suspension",
                "pos": "noun"
            },
            {
                "word": "suspension bridge",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "creating feelings of excitement or worry about what may happen",
                    "vi": "tạo ra cảm giác phấn khích hoặc lo lắng về những gì có thể xảy ra"
                },
                "examples": [
                    {
                        "en": "Her new novel is a gripping and suspenseful thriller.",
                        "vi": "Cuốn tiểu thuyết mới của cô là một bộ phim kinh dị hấp dẫn và hồi hộp."
                    }
                ]
            }
        ]
    },
    {
        "id": "f8f90dbaee8844dbaa317bb52993a93e",
        "word": "taut",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/tɔːt/",
            "us": "/tɔːt/"
        },
        "nearby": [
            {
                "word": "taurine",
                "pos": "noun"
            },
            {
                "word": "Taurus",
                "pos": "noun"
            },
            {
                "word": "taut",
                "pos": "adjective"
            },
            {
                "word": "tauten",
                "pos": "verb"
            },
            {
                "word": "tautly",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "stretched tightly",
                    "vi": "kéo căng"
                },
                "examples": [
                    {
                        "en": "taut violin strings",
                        "vi": "căng dây đàn vĩ cầm"
                    },
                    {
                        "en": "Keep the rope taut.",
                        "vi": "Giữ cho dây căng."
                    },
                    {
                        "en": "His skin was stretched taut across his cheekbones.",
                        "vi": "Da của anh ấy căng ra trên gò má."
                    }
                ]
            },
            {
                "define": {
                    "en": "showing that you are anxious or tense",
                    "vi": "cho thấy rằng bạn đang lo lắng hoặc căng thẳng"
                },
                "examples": [
                    {
                        "en": "a voice taut with anger",
                        "vi": "một giọng nói căng thẳng với sự tức giận"
                    },
                    {
                        "en": "Her face was taut and pale.",
                        "vi": "Mặt cô ấy căng và nhợt nhạt."
                    },
                    {
                        "en": "Her body went as taut as a bowstring.",
                        "vi": "Cơ thể cô căng như dây cung."
                    }
                ]
            },
            {
                "define": {
                    "en": "with hard muscles; not fat",
                    "vi": "với các cơ cứng; không mập"
                },
                "examples": [
                    {
                        "en": "His body was solid and taut.",
                        "vi": "Cơ thể anh rắn chắc và căng."
                    }
                ]
            },
            {
                "define": {
                    "en": "carefully written with no unnecessary parts in it",
                    "vi": "được viết cẩn thận không có phần không cần thiết trong đó"
                },
                "examples": [
                    {
                        "en": "a taut thriller",
                        "vi": "một bộ phim kinh dị căng thẳng"
                    },
                    {
                        "en": "the writer’s taut prose",
                        "vi": "văn xuôi căng thẳng của nhà văn"
                    }
                ]
            }
        ]
    },
    {
        "id": "51dda5413f5b4e13abcdf0ceea9853f4",
        "word": "turgid",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈtɜːdʒɪd/",
            "us": "/ˈtɜːrdʒɪd/"
        },
        "nearby": [
            {
                "word": "turf out",
                "pos": "phrasal verb"
            },
            {
                "word": "turf war",
                "pos": "noun"
            },
            {
                "word": "turgid",
                "pos": "adjective"
            },
            {
                "word": "turista",
                "pos": "noun"
            },
            {
                "word": "Turk",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "boring, complicated and difficult to understand",
                    "vi": "nhàm chán, phức tạp và khó hiểu"
                },
                "examples": [
                    {
                        "en": "turgid prose",
                        "vi": "văn xuôi turgid"
                    }
                ]
            },
            {
                "define": {
                    "en": "swollen; containing more water than usual",
                    "vi": "sưng lên; chứa nhiều nước hơn bình thường"
                },
                "examples": [
                    {
                        "en": "the turgid waters of the Thames",
                        "vi": "nước đục ngầu của sông Thames"
                    }
                ]
            }
        ]
    },
    {
        "id": "186ae7b5a32a45778f3ef4590a1b82db",
        "word": "unputdownable",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌʌnpʊtˈdaʊnəbl/",
            "us": "/ˌʌnpʊtˈdaʊnəbl/"
        },
        "nearby": [
            {
                "word": "unpublished",
                "pos": "adjective"
            },
            {
                "word": "unpunished",
                "pos": "adjective"
            },
            {
                "word": "unputdownable",
                "pos": "adjective"
            },
            {
                "word": "unqualified",
                "pos": "adjective"
            },
            {
                "word": "unquenchable",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "so exciting or interesting that you cannot stop reading it",
                    "vi": "thú vị hoặc thú vị đến mức bạn không thể ngừng đọc nó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "317ad71b84fe40c3b869111c23a4a827",
        "word": "unreadable",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ʌnˈriːdəbl/",
            "us": "/ʌnˈriːdəbl/"
        },
        "nearby": [
            {
                "word": "unreactive",
                "pos": "adjective"
            },
            {
                "word": "unread",
                "pos": "adjective"
            },
            {
                "word": "unreadable",
                "pos": "adjective"
            },
            {
                "word": "unreal",
                "pos": "adjective"
            },
            {
                "word": "unrealistic",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "too boring or difficult to be worth reading",
                    "vi": "quá nhàm chán hoặc khó đọc"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "difficult or impossible to read",
                    "vi": "khó hoặc không thể đọc"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "if somebody’s face or expression is unreadable, you cannot tell what they are thinking or feeling",
                    "vi": "nếu khuôn mặt hoặc biểu cảm của ai đó không thể đọc được, bạn không thể biết họ đang nghĩ gì hoặc cảm thấy gì"
                },
                "examples": [
                    {
                        "en": "Ed regarded her with an unreadable expression.",
                        "vi": "Ed nhìn cô ấy với một biểu cảm khó hiểu."
                    },
                    {
                        "en": "His eyes were unreadable as he led her into the office.",
                        "vi": "Đôi mắt anh không thể đọc được khi anh dẫn cô vào văn phòng."
                    }
                ]
            },
            {
                "define": {
                    "en": "containing information that a computer is not able to read",
                    "vi": "chứa thông tin mà máy tính không thể đọc được"
                },
                "examples": []
            }
        ]
    }
]