[
    {
        "id": "636ab396d1a140ef8ee1802ef4fde5a5",
        "word": "web",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/web/",
            "us": "/web/"
        },
        "nearby": [
            {
                "word": "weaving",
                "pos": "noun"
            },
            {
                "word": "Web 2.0",
                "pos": "noun"
            },
            {
                "word": "web",
                "pos": "noun"
            },
            {
                "word": "Webb",
                "pos": ""
            },
            {
                "word": "webbed",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a system for finding information on the internet, in which documents are connected to other documents",
                    "vi": "một hệ thống tìm kiếm thông tin trên internet, trong đó các tài liệu được kết nối với các tài liệu khác"
                },
                "examples": [
                    {
                        "en": "to surf/browse/search the web",
                        "vi": "để lướt / duyệt / tìm kiếm trên web"
                    },
                    {
                        "en": "The service is available to anyone with access to the web.",
                        "vi": "Dịch vụ này có sẵn cho bất kỳ ai có quyền truy cập vào web."
                    },
                    {
                        "en": "on the Web I found the information on the Web.",
                        "vi": "trên Web Tôi đã tìm thấy thông tin trên Web."
                    },
                    {
                        "en": "I did a Web search to find the best price.",
                        "vi": "Tôi đã tìm kiếm trên Web để tìm giá tốt nhất."
                    },
                    {
                        "en": "a web browser/server",
                        "vi": "trình duyệt web / máy chủ"
                    }
                ]
            },
            {
                "define": {
                    "en": "a fine net of thread made by a spider to catch insects",
                    "vi": "một sợi lưới mịn do nhện tạo ra để bắt côn trùng"
                },
                "examples": [
                    {
                        "en": "A spider had spun a perfect web outside the window.",
                        "vi": "Một con nhện đã tạo thành một mạng lưới hoàn hảo bên ngoài cửa sổ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a complicated pattern of things that are closely connected to each other",
                    "vi": "một mô hình phức tạp của những thứ được kết nối chặt chẽ với nhau"
                },
                "examples": [
                    {
                        "en": "a web of streets",
                        "vi": "một mạng lưới đường phố"
                    },
                    {
                        "en": "We were caught in a tangled web of relationships.",
                        "vi": "Chúng tôi bị cuốn vào một mạng lưới quan hệ rối rắm."
                    },
                    {
                        "en": "She discovered a web of intrigue in the company.",
                        "vi": "Cô phát hiện ra một mạng lưới mưu mô trong công ty."
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of skin that joins the toes of some birds and animals that swim, for example ducks and frogs",
                    "vi": "một miếng da nối các ngón chân của một số loài chim và động vật bơi lội, ví dụ như vịt và ếch"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "bdf6a45a4a674011a7ef4d91b7c1b3d2",
        "word": "hive",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/haɪv/",
            "us": "/haɪv/"
        },
        "nearby": [
            {
                "word": "hit with",
                "pos": "phrasal verb"
            },
            {
                "word": "HIV",
                "pos": "noun"
            },
            {
                "word": "hive",
                "pos": "noun"
            },
            {
                "word": "hive",
                "pos": "verb"
            },
            {
                "word": "hive off",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a structure made for bees to live in",
                    "vi": "một cấu trúc được tạo ra cho ong sống"
                },
                "examples": [
                    {
                        "en": "studying the life of bees in the hive",
                        "vi": "nghiên cứu cuộc sống của ong trong tổ"
                    }
                ]
            },
            {
                "define": {
                    "en": "the bees living in a hive",
                    "vi": "những con ong sống trong một tổ ong"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a place full of people who are busy",
                    "vi": "một nơi đầy những người bận rộn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "red spots on the skin that itch (= make you want to rub your skin with your nails), caused by an allergic reaction, for example to certain foods",
                    "vi": "đốm đỏ trên da bị ngứa (= khiến bạn muốn dùng móng tay chà xát lên da), do phản ứng dị ứng, chẳng hạn như với một số loại thực phẩm"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "229289a63d46437981d98ac2781ecb1a",
        "word": "nest",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/nest/",
            "us": "/nest/"
        },
        "nearby": [
            {
                "word": "Eliot Ness",
                "pos": ""
            },
            {
                "word": "Nessie",
                "pos": ""
            },
            {
                "word": "nest",
                "pos": "noun"
            },
            {
                "word": "nest",
                "pos": "verb"
            },
            {
                "word": "nest box",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a hollow place or structure that a bird makes or chooses for laying its eggs in and sheltering its young",
                    "vi": "một nơi hoặc cấu trúc rỗng mà chim tạo ra hoặc chọn để đẻ trứng và trú ẩn cho con non"
                },
                "examples": [
                    {
                        "en": "sparrows building a nest of twigs and dry grass",
                        "vi": "chim sẻ xây tổ trên cành cây và cỏ khô"
                    }
                ]
            },
            {
                "define": {
                    "en": "a place where insects or other small creatures live and produce their young",
                    "vi": "nơi mà côn trùng hoặc các sinh vật nhỏ khác sinh sống và sản sinh ra con non của chúng"
                },
                "examples": [
                    {
                        "en": "a wasps’ nest",
                        "vi": "một tổ ong bắp cày"
                    },
                    {
                        "en": "a nest of mice",
                        "vi": "một tổ chuột"
                    },
                    {
                        "en": "The snake will attack if disturbed inside its nest.",
                        "vi": "Con rắn sẽ tấn công nếu bị quấy rầy bên trong tổ của nó."
                    }
                ]
            },
            {
                "define": {
                    "en": "a secret place which is full of bad people and their activities",
                    "vi": "một nơi bí mật đầy rẫy những người xấu và hoạt động của họ"
                },
                "examples": [
                    {
                        "en": "a nest of thieves",
                        "vi": "một ổ trộm"
                    }
                ]
            },
            {
                "define": {
                    "en": "the home, thought of as the safe place where parents bring up their children",
                    "vi": "ngôi nhà, được coi là nơi an toàn, nơi cha mẹ nuôi dưỡng con cái của họ"
                },
                "examples": [
                    {
                        "en": "to leave the nest (= leave your parents’ home)",
                        "vi": "rời khỏi tổ (= rời khỏi nhà của cha mẹ bạn)"
                    }
                ]
            },
            {
                "define": {
                    "en": "a group or set of similar things that are made to fit inside each other",
                    "vi": "một nhóm hoặc một tập hợp những thứ tương tự được tạo ra để phù hợp với nhau"
                },
                "examples": [
                    {
                        "en": "a nest of tables",
                        "vi": "một cái bàn"
                    }
                ]
            },
            {
                "define": {
                    "en": "to make yourself richer, especially at somebody else's expense, by spending money on yourself that should be spent on somebody/something else",
                    "vi": "để làm cho mình trở nên giàu có hơn, đặc biệt là với chi phí của người khác, bằng cách tiêu tiền cho bản thân mà đáng ra phải chi cho ai đó / thứ khác"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to become able to fly and leave its nest",
                    "vi": "để có thể bay và rời khỏi tổ của nó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to leave home and live somewhere else",
                    "vi": "rời khỏi nhà và sống ở một nơi khác"
                },
                "examples": [
                    {
                        "en": "Her children have flown the nest.",
                        "vi": "Các con của bà đã bay về tổ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a difficult situation in which a lot of people get very angry",
                    "vi": "một tình huống khó khăn trong đó nhiều người rất tức giận"
                },
                "examples": [
                    {
                        "en": "His letter to the papers stirred up a real hornets' nest.",
                        "vi": "Bức thư của anh ta gửi đến các tờ giấy đã khuấy động một tổ ong bắp cày thực sự."
                    }
                ]
            },
            {
                "define": {
                    "en": "a discovery that seems interesting but is found to have no value",
                    "vi": "một khám phá có vẻ thú vị nhưng không có giá trị"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a very complicated situation",
                    "vi": "một tình huống rất phức tạp"
                },
                "examples": [
                    {
                        "en": "This area of the law is a veritable mare’s nest.",
                        "vi": "Khu vực này của pháp luật là một tổ của ngựa cái thực sự."
                    }
                ]
            }
        ]
    },
    {
        "id": "2a861d40d79a4667b5aef8cc07c1ca95",
        "word": "cobweb",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkɒbweb/",
            "us": "/ˈkɑːbweb/"
        },
        "nearby": [
            {
                "word": "cobra",
                "pos": "noun"
            },
            {
                "word": "co-branding",
                "pos": "noun"
            },
            {
                "word": "cobweb",
                "pos": "noun"
            },
            {
                "word": "cobwebbed",
                "pos": "adjective"
            },
            {
                "word": "coca",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a fine net of threads made by a spider to catch insects; a single thread of this net (usually used when it is old and covered with dirt)",
                    "vi": "một sợi lưới mịn do nhện tạo ra để bắt côn trùng; một sợi duy nhất của lưới này (thường được sử dụng khi nó đã cũ và bám đầy bụi bẩn)"
                },
                "examples": [
                    {
                        "en": "Thick cobwebs hung in the dusty corners.",
                        "vi": "Mạng nhện dày bám ở các góc đầy bụi."
                    },
                    {
                        "en": "He brushed a cobweb out of his hair.",
                        "vi": "Anh chải một mạng nhện ra khỏi tóc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to help somebody have a fresh, lively state of mind again",
                    "vi": "để giúp ai đó có một trạng thái tinh thần tươi mới, sống động trở lại"
                },
                "examples": [
                    {
                        "en": "A brisk walk should blow the cobwebs away.",
                        "vi": "Đi bộ nhanh sẽ thổi bay mạng nhện."
                    }
                ]
            }
        ]
    }
]