[
    {
        "id": "16a7df16e52a48f78c75cdafaa47d5e9",
        "word": "cat",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/kæt/",
            "us": "/kæt/"
        },
        "nearby": [
            {
                "word": "casuistry",
                "pos": "noun"
            },
            {
                "word": "casus belli",
                "pos": "noun"
            },
            {
                "word": "cat",
                "pos": "noun"
            },
            {
                "word": "Cat",
                "pos": ""
            },
            {
                "word": "catabolism",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small animal with soft fur that people often keep as a pet. Cats catch and kill birds and mice.",
                    "vi": "một loài động vật nhỏ với bộ lông mềm mại mà mọi người thường nuôi làm thú cưng. Mèo bắt và giết chim, chuột."
                },
                "examples": [
                    {
                        "en": "a tin of cat food",
                        "vi": "một hộp thức ăn cho mèo"
                    },
                    {
                        "en": "I have a cat called Bo.",
                        "vi": "Tôi có một con mèo tên là Bo."
                    },
                    {
                        "en": "a pet/domestic cat",
                        "vi": "một con vật cưng / mèo nhà"
                    },
                    {
                        "en": "a stray/feral cat",
                        "vi": "một con mèo hoang / hoang dã"
                    }
                ]
            },
            {
                "define": {
                    "en": "a wild animal of the cat family",
                    "vi": "một loài động vật hoang dã thuộc họ mèo"
                },
                "examples": [
                    {
                        "en": "the big cats (= lions, tigers, etc.)",
                        "vi": "mèo lớn (= sư tử, hổ, v.v.)"
                    },
                    {
                        "en": "She went to Africa to photograph big cats.",
                        "vi": "Cô ấy đã đến châu Phi để chụp ảnh những con mèo lớn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be the best thing, person, idea, etc.",
                    "vi": "trở thành điều tốt nhất, con người, ý tưởng, v.v."
                },
                "examples": [
                    {
                        "en": "He thinks he's the cat's whiskers (= he has a high opinion of himself).",
                        "vi": "Anh ấy nghĩ mình là râu mèo (= anh ấy có quan điểm cao về bản thân)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be raining heavily",
                    "vi": "trời mưa to"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "said to somebody, especially a child, who stays silent when expected to speak, for example after being asked a question",
                    "vi": "nói với ai đó, đặc biệt là một đứa trẻ, người luôn im lặng khi được cho là sẽ nói, chẳng hạn như sau khi được hỏi một câu hỏi"
                },
                "examples": [
                    {
                        "en": "What's the matter? Cat got your tongue?",
                        "vi": "Có chuyện gì vậy? Mèo có lưỡi của bạn?"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to tell somebody not to ask questions or try to find out about things that do not involve them",
                    "vi": "được sử dụng để nói với ai đó đừng đặt câu hỏi hoặc cố gắng tìm hiểu về những thứ không liên quan đến họ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to tell a secret carelessly or by mistake",
                    "vi": "nói một bí mật một cách bất cẩn hoặc do nhầm lẫn"
                },
                "examples": [
                    {
                        "en": "I wanted it to be a surprise, but my sister let the cat out of the bag.",
                        "vi": "Tôi muốn nó là một bất ngờ, nhưng em gái tôi đã để con mèo ra khỏi túi."
                    }
                ]
            },
            {
                "define": {
                    "en": "very nervous",
                    "vi": "rất lo lắng"
                },
                "examples": [
                    {
                        "en": "She was like a cat on a hot tin roof before her driving test.",
                        "vi": "Cô ấy giống như một con mèo trên một mái nhà thiếc nóng trước khi thi lái xe."
                    }
                ]
            },
            {
                "define": {
                    "en": "very pleased with yourself",
                    "vi": "rất hài lòng với bản thân"
                },
                "examples": [
                    {
                        "en": "She looked like a cat that’s got the cream. She was almost purring with pleasure.",
                        "vi": "Cô ấy trông giống như một con mèo được bôi kem. Cô ấy gần như rên rỉ vì sung sướng."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to describe a very difficult task, especially one that involves organizing people",
                    "vi": "được sử dụng để mô tả một nhiệm vụ rất khó khăn, đặc biệt là một nhiệm vụ liên quan đến việc tổ chức con người"
                },
                "examples": [
                    {
                        "en": "Managing a political party is a lot like herding cats.",
                        "vi": "Quản lý một đảng chính trị cũng giống như việc chăn gia súc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to look dirty and untidy",
                    "vi": "trông bẩn thỉu và không gọn gàng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "when somebody says there’s no room to swing a cat, they mean that a room is very small and that there is not enough space",
                    "vi": "khi ai đó nói rằng không có chỗ để đu một con mèo, họ có nghĩa là một căn phòng rất nhỏ và không có đủ không gian"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to have no chance at all",
                    "vi": "không có cơ hội nào cả"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to play a cruel game with somebody in your power by changing your behaviour very often, so that they become nervous and do not know what to expect",
                    "vi": "chơi một trò chơi tàn ác với ai đó trong quyền lực của bạn bằng cách thay đổi hành vi của bạn rất thường xuyên, để họ trở nên lo lắng và không biết điều gì sẽ xảy ra"
                },
                "examples": [
                    {
                        "en": "He thought the police were playing some elaborate game of cat and mouse and waiting to trap him.",
                        "vi": "Anh ta nghĩ rằng cảnh sát đang chơi trò mèo vờn chuột phức tạp nào đó và chờ đợi để bẫy anh ta."
                    },
                    {
                        "en": "Young car thieves enjoy playing cat and mouse with the police.",
                        "vi": "Những tên trộm xe hơi thích thú chơi trò mèo vờn chuột với cảnh sát."
                    }
                ]
            },
            {
                "define": {
                    "en": "to say or do something that is likely to cause trouble",
                    "vi": "nói hoặc làm điều gì đó có thể gây ra rắc rối"
                },
                "examples": [
                    {
                        "en": "Then she told them she was dropping out of college. That really set the cat among the pigeons.",
                        "vi": "Sau đó, cô ấy nói với họ rằng cô ấy đã bỏ học đại học. Điều đó thực sự đặt con mèo giữa bầy chim bồ câu."
                    }
                ]
            },
            {
                "define": {
                    "en": "there are many different ways to achieve something",
                    "vi": "có nhiều cách khác nhau để đạt được điều gì đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "people enjoy themselves more and behave with greater freedom when the person in charge of them is not there",
                    "vi": "mọi người thích thú hơn với bản thân và cư xử tự do hơn khi người phụ trách họ không có ở đó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "6f21b4614e8347bb88419562832a180d",
        "word": "dog",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/dɒɡ/",
            "us": "/dɔːɡ/"
        },
        "nearby": [
            {
                "word": "doff",
                "pos": "verb"
            },
            {
                "word": "do for",
                "pos": "phrasal verb"
            },
            {
                "word": "dog",
                "pos": "noun"
            },
            {
                "word": "dog",
                "pos": "verb"
            },
            {
                "word": "dog biscuit",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an animal with four legs and a tail, often kept as a pet or trained for work, for example hunting or guarding buildings. There are many types of dog, some of which are wild.",
                    "vi": "một con vật có bốn chân và một cái đuôi, thường được nuôi làm thú cưng hoặc được huấn luyện để làm việc, ví dụ như săn bắn hoặc canh gác các tòa nhà. Có rất nhiều loại chó, một số trong số đó là hoang dã."
                },
                "examples": [
                    {
                        "en": "I took the dog for a walk.",
                        "vi": "Tôi dắt chó đi dạo."
                    },
                    {
                        "en": "I'm just going to walk the dog.",
                        "vi": "Tôi chỉ định dắt chó đi dạo."
                    },
                    {
                        "en": "I could hear a dog barking.",
                        "vi": "Tôi có thể nghe thấy tiếng chó sủa."
                    },
                    {
                        "en": "Stray dogs roamed the streets at night.",
                        "vi": "Những chú chó lạc lang thang trên đường phố vào ban đêm."
                    },
                    {
                        "en": "dog walkers/owners",
                        "vi": "người dắt chó / chủ sở hữu"
                    },
                    {
                        "en": "dog food/biscuits",
                        "vi": "thức ăn cho chó / bánh quy"
                    },
                    {
                        "en": "a dog and its puppies",
                        "vi": "một con chó và những con chó con của nó"
                    },
                    {
                        "en": "A labrador is a breed of dog.",
                        "vi": "Labrador là một giống chó."
                    }
                ]
            },
            {
                "define": {
                    "en": "a male dog, fox, wolf or otter",
                    "vi": "một con chó đực, cáo, sói hoặc rái cá"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "greyhound racing",
                    "vi": "cuộc đua chó săn thỏ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a thing of low quality; a failure",
                    "vi": "một thứ có chất lượng thấp; một thất bại"
                },
                "examples": [
                    {
                        "en": "Her last movie was an absolute dog.",
                        "vi": "Bộ phim cuối cùng của cô ấy là một con chó tuyệt đối."
                    }
                ]
            },
            {
                "define": {
                    "en": "an offensive way of describing a woman who is not considered attractive",
                    "vi": "một cách mô tả xúc phạm một người phụ nữ không được coi là hấp dẫn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used, especially after an adjective, to describe a man who has done something bad",
                    "vi": "được sử dụng, đặc biệt là sau một tính từ, để mô tả một người đàn ông đã làm điều gì đó tồi tệ"
                },
                "examples": [
                    {
                        "en": "You dirty dog!",
                        "vi": "Đồ chó bẩn!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be raining heavily",
                    "vi": "trời mưa to"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "an event that is planned only in order to impress people so that they will support or buy something",
                    "vi": "một sự kiện chỉ được lên kế hoạch nhằm gây ấn tượng với mọi người để họ ủng hộ hoặc mua thứ gì đó"
                },
                "examples": [
                    {
                        "en": "the dog and pony show of his visits to the war zone",
                        "vi": "con chó và con ngựa con trong chuyến thăm của anh ấy đến khu vực chiến tranh"
                    },
                    {
                        "en": "a dog and pony show to sell the idea to investors",
                        "vi": "một buổi biểu diễn chó và ngựa để bán ý tưởng cho các nhà đầu tư"
                    }
                ]
            },
            {
                "define": {
                    "en": "a situation in business, politics, etc. where there is a lot of competition and people are willing to harm each other in order to succeed",
                    "vi": "một tình huống trong kinh doanh, chính trị, v.v. nơi có nhiều cạnh tranh và mọi người sẵn sàng làm hại lẫn nhau để thành công"
                },
                "examples": [
                    {
                        "en": "I'm afraid in this line of work it's a case of dog eat dog.",
                        "vi": "Tôi sợ trong dòng công việc này là trường hợp chó ăn thịt chó."
                    },
                    {
                        "en": "We're operating in a dog-eat-dog world.",
                        "vi": "Chúng tôi đang hoạt động trong một thế giới chó ăn thịt."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who stops other people from enjoying something that the person cannot use or does not want themselves",
                    "vi": "một người ngăn cản người khác thưởng thức thứ gì đó mà người đó không thể sử dụng hoặc không muốn bản thân họ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a thing that has been done badly",
                    "vi": "một điều đã được thực hiện tồi tệ"
                },
                "examples": [
                    {
                        "en": "He's made a real dog's breakfast of these accounts.",
                        "vi": "Anh ấy đã làm bữa sáng cho một con chó thực sự của những tài khoản này."
                    }
                ]
            },
            {
                "define": {
                    "en": "an unhappy life, full of problems or unfair treatment",
                    "vi": "một cuộc sống bất hạnh, đầy rẫy những vấn đề hoặc bị đối xử bất công"
                },
                "examples": [
                    {
                        "en": "He led his poor partner a dog's life.",
                        "vi": "Anh ta đã dẫn người bạn đời tội nghiệp của mình một cuộc sống của một con chó."
                    }
                ]
            },
            {
                "define": {
                    "en": "everyone has good luck or success at some point in their life",
                    "vi": "mọi người đều gặp may mắn hoặc thành công vào một thời điểm nào đó trong cuộc đời của họ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "when a person already has a bad reputation, it is difficult to change it because others will continue to blame or suspect them",
                    "vi": "Khi một người đã có tiếng xấu, rất khó để thay đổi điều đó vì người khác sẽ tiếp tục đổ lỗi hoặc nghi ngờ họ."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to get into a very bad state",
                    "vi": "rơi vào trạng thái rất tồi tệ"
                },
                "examples": [
                    {
                        "en": "This firm's gone to the dogs since the new management took over.",
                        "vi": "Công ty này đã được chuyển giao cho những chú chó kể từ khi ban quản lý mới tiếp quản."
                    }
                ]
            },
            {
                "define": {
                    "en": "alcohol that you drink in order to make you feel better when you have drunk too much alcohol the night before",
                    "vi": "rượu mà bạn uống để làm cho bạn cảm thấy dễ chịu hơn khi bạn đã uống quá nhiều rượu vào đêm hôm trước"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be involved in a situation so that you will gain or lose according to the result",
                    "vi": "tham gia vào một tình huống để bạn sẽ được hoặc mất tùy theo kết quả"
                },
                "examples": [
                    {
                        "en": "I really don't have a dog in this fight, so I can just enjoy the game.",
                        "vi": "Tôi thực sự không có một con chó trong cuộc chiến này, vì vậy tôi chỉ có thể tận hưởng trò chơi."
                    },
                    {
                        "en": "The employees have a dog in the hunt, so their views should be listened to.",
                        "vi": "Các nhân viên có một con chó trong cuộc đi săn, vì vậy quan điểm của họ nên được lắng nghe."
                    }
                ]
            },
            {
                "define": {
                    "en": "to avoid mentioning a subject or something that happened in the past, in order to avoid any problems or arguments",
                    "vi": "để tránh đề cập đến một chủ đề hoặc điều gì đó đã xảy ra trong quá khứ, để tránh bất kỳ vấn đề hoặc tranh luận nào"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "extremely hard",
                    "vi": "cực kì khó khắn"
                },
                "examples": [
                    {
                        "en": "I've been working like a dog recently.",
                        "vi": "Gần đây tôi đã làm việc như một con chó."
                    }
                ]
            },
            {
                "define": {
                    "en": "in a very bad or cruel way",
                    "vi": "theo một cách rất tồi tệ hoặc tàn nhẫn"
                },
                "examples": [
                    {
                        "en": "They treated him like a dog.",
                        "vi": "Họ đối xử với anh ấy như một con chó."
                    }
                ]
            },
            {
                "define": {
                    "en": "very determined and refusing to give up",
                    "vi": "rất quyết tâm và không chịu bỏ cuộc"
                },
                "examples": [
                    {
                        "en": "When she sensed a good story she was like a dog with a bone.",
                        "vi": "Khi cảm nhận được một câu chuyện hay, cô ấy như một con chó bị hóc xương."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have no chance at all",
                    "vi": "không có cơ hội nào cả"
                },
                "examples": [
                    {
                        "en": "He hasn't a dog's chance of passing the exam.",
                        "vi": "Nó không có cơ hội vượt qua kỳ thi của một con chó."
                    }
                ]
            },
            {
                "define": {
                    "en": "feeling very sick; vomiting a lot",
                    "vi": "cảm thấy rất ốm; nôn nhiều"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to describe a situation in which the most important aspect is being influenced and controlled by somebody/something that is not as important",
                    "vi": "được sử dụng để mô tả một tình huống trong đó khía cạnh quan trọng nhất đang bị ảnh hưởng và kiểm soát bởi ai đó / điều gì đó không quan trọng bằng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "(you cannot) successfully make people change their ideas, methods of work, etc., when they have had them for a long time",
                    "vi": "(bạn không thể) thành công khiến mọi người thay đổi ý tưởng, phương pháp làm việc, v.v., khi họ đã có chúng từ lâu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to allow somebody to suffer or be punished in an unfair way, as if they have no value",
                    "vi": "để cho phép ai đó phải chịu đựng hoặc bị trừng phạt một cách bất công, như thể họ không có giá trị"
                },
                "examples": [
                    {
                        "en": "Her boss collects a big retirement cheque while she is thrown to the dogs.",
                        "vi": "Ông chủ của cô ấy thu thập một tờ séc hưu trí lớn trong khi cô ấy bị ném cho lũ chó."
                    }
                ]
            },
            {
                "define": {
                    "en": "if somebody can do a task for you, there is no point in doing it yourself",
                    "vi": "nếu ai đó có thể làm một nhiệm vụ cho bạn, thì chẳng ích gì khi tự mình làm"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "519053dc21114000aaf710b4d972a0ad",
        "word": "feed",
        "pos": "verb",
        "level": "a2",
        "phonetic": {
            "uk": "/fiːd/",
            "us": "/fiːd/"
        },
        "nearby": [
            {
                "word": "feebleness",
                "pos": "noun"
            },
            {
                "word": "feebly",
                "pos": "adverb"
            },
            {
                "word": "feed",
                "pos": "verb"
            },
            {
                "word": "feed",
                "pos": "noun"
            },
            {
                "word": "feed back",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to give food to a person or an animal",
                    "vi": "đưa thức ăn cho người hoặc động vật"
                },
                "examples": [
                    {
                        "en": "feed somebody/something/yourself Have you fed the cat yet?",
                        "vi": "cho ai đó ăn / cái gì đó / bản thân Bạn đã cho mèo ăn chưa?"
                    },
                    {
                        "en": "The baby can't feed itself yet (= can't put food into its own mouth).",
                        "vi": "Em bé chưa thể tự ăn (= không thể tự đút thức ăn vào miệng)."
                    },
                    {
                        "en": "feed somebody/something sth It's important to feed children a well-balanced diet.",
                        "vi": "cho ai đó ăn / cái gì đó sth Điều quan trọng là phải cho trẻ ăn một chế độ ăn uống cân bằng."
                    },
                    {
                        "en": "He has to be fed liquids through a tube in his stomach.",
                        "vi": "Anh ta phải được cung cấp chất lỏng thông qua một ống dẫn trong dạ dày của mình."
                    },
                    {
                        "en": "feed somebody/something (on) something The cattle are fed (on) barley.",
                        "vi": "cho ai đó ăn một cái gì đó (trên) một cái gì đó Gia súc được cho ăn (trên) lúa mạch."
                    },
                    {
                        "en": "feed something to somebody/something The barley is fed to the cattle.",
                        "vi": "cho ai đó ăn một cái gì đó / cái gì đó Lúa mạch được cho gia súc ăn."
                    },
                    {
                        "en": "feed somebody/something with something The animals are fed with hay and grass.",
                        "vi": "cho ai đó ăn / cái gì đó bằng cái gì Các con vật được cho ăn bằng cỏ khô."
                    }
                ]
            },
            {
                "define": {
                    "en": "to eat food",
                    "vi": "ăn thức ăn"
                },
                "examples": [
                    {
                        "en": "Slugs and snails feed at night.",
                        "vi": "Sên và ốc kiếm ăn vào ban đêm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to provide food for a person or group of people",
                    "vi": "cung cấp thức ăn cho một người hoặc một nhóm người"
                },
                "examples": [
                    {
                        "en": "They have a large family to feed.",
                        "vi": "Họ có một gia đình lớn để nuôi."
                    },
                    {
                        "en": "There's enough here to feed an army.",
                        "vi": "Ở đây có đủ để nuôi một đội quân."
                    },
                    {
                        "en": "Have they been feeding you well?",
                        "vi": "Họ đã cho bạn ăn tốt chưa?"
                    },
                    {
                        "en": "They struggled to feed and clothe the children.",
                        "vi": "Họ phải vật lộn để kiếm ăn và mặc cho lũ trẻ."
                    },
                    {
                        "en": "Having another mouth (= person) to feed can be a strain.",
                        "vi": "Có một miệng (= người) khác để cho ăn có thể là một căng thẳng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to give a plant a special substance to make it grow",
                    "vi": "cung cấp cho cây một chất đặc biệt để làm cho nó phát triển"
                },
                "examples": [
                    {
                        "en": "Feed the plants once a week.",
                        "vi": "Cho cây ăn mỗi tuần một lần."
                    }
                ]
            },
            {
                "define": {
                    "en": "to give advice, information, etc. to somebody/something",
                    "vi": "để đưa ra lời khuyên, thông tin, v.v. cho ai đó / điều gì đó"
                },
                "examples": [
                    {
                        "en": "be fed something We are constantly fed gossip and speculation by the media.",
                        "vi": "được cho ăn một thứ gì đó Chúng tôi liên tục bị giới truyền thông đưa tin về những lời đàm tiếu và suy đoán."
                    },
                    {
                        "en": "be fed with something The media were being fed with accusations and lies.",
                        "vi": "được nuôi dưỡng bằng một cái gì đó Các phương tiện truyền thông đã bị đưa tin bằng những lời buộc tội và dối trá."
                    },
                    {
                        "en": "be fed to somebody Gossip and speculation are constantly fed to us by the media.",
                        "vi": "được đưa cho ai đó Tin đồn và suy đoán liên tục được truyền thông cho chúng ta."
                    }
                ]
            },
            {
                "define": {
                    "en": "to supply something to somebody/something",
                    "vi": "cung cấp một cái gì đó cho ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "be fed (by something) The lake is fed by a river.",
                        "vi": "be feed (by something) The lake is feed by a river."
                    },
                    {
                        "en": "A is fed with B The electricity line is fed with power through an underground cable.",
                        "vi": "A được cấp nguồn cho B Đường dây được cấp điện qua một cáp ngầm."
                    },
                    {
                        "en": "B is fed into A Power is fed into the electricity line through an underground cable.",
                        "vi": "B được cấp vào A Nguồn điện được cấp vào đường dây điện thông qua một dây cáp ngầm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to put or push something into or through a machine",
                    "vi": "để đặt hoặc đẩy một cái gì đó vào hoặc thông qua một cái máy"
                },
                "examples": [
                    {
                        "en": "feed A (with B) He fed the meter with coins.",
                        "vi": "feed A (with B) He fed đồng hồ đo bằng đồng xu."
                    },
                    {
                        "en": "feed B into A He fed coins into the meter.",
                        "vi": "feed B vào A Anh ấy cho xu vào đồng hồ."
                    },
                    {
                        "en": "The information was fed into the data store.",
                        "vi": "Thông tin đã được đưa vào kho dữ liệu."
                    },
                    {
                        "en": "feed something into/through something The fabric is fed through the machine.",
                        "vi": "đưa một cái gì đó vào / thông qua một cái gì đó Vải được đưa qua máy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to satisfy a need, desire, etc. and keep it strong",
                    "vi": "để thỏa mãn nhu cầu, mong muốn, v.v. và giữ cho nó mạnh mẽ"
                },
                "examples": [
                    {
                        "en": "For drug addicts, the need to feed the addiction takes priority over everything else.",
                        "vi": "Đối với những người nghiện ma túy, nhu cầu nuôi dưỡng cơn nghiện được ưu tiên hơn mọi thứ khác."
                    }
                ]
            },
            {
                "define": {
                    "en": "to harm somebody who has helped you or supported you",
                    "vi": "làm hại ai đó đã giúp đỡ bạn hoặc hỗ trợ bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to eat a lot of food or too much food",
                    "vi": "ăn nhiều hoặc ăn quá nhiều"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "1cfcc2cace4445c9b1c52c4a616b0b96",
        "word": "pet",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/pet/",
            "us": "/pet/"
        },
        "nearby": [
            {
                "word": "pestle",
                "pos": "noun"
            },
            {
                "word": "pesto",
                "pos": "noun"
            },
            {
                "word": "pet",
                "pos": "noun"
            },
            {
                "word": "pet",
                "pos": "verb"
            },
            {
                "word": "pet",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an animal, a bird, etc. that you have at home for pleasure, rather than one that is kept for work or food",
                    "vi": "một con vật, một con chim, v.v. mà bạn có ở nhà để làm niềm vui, thay vì một con vật được nuôi để làm việc hoặc thực phẩm"
                },
                "examples": [
                    {
                        "en": "Do you have any pets?",
                        "vi": "Bạn có nuôi con gì không?"
                    },
                    {
                        "en": "a pet dog/hamster",
                        "vi": "một con chó cưng / hamster"
                    },
                    {
                        "en": "a family pet",
                        "vi": "một con vật cưng của gia đình"
                    },
                    {
                        "en": "exotic pets",
                        "vi": "những con thú cưng kỳ lạ"
                    },
                    {
                        "en": "pet food",
                        "vi": "thức ăn cho thú cưng"
                    },
                    {
                        "en": "Being a responsible pet owner means caring for your pet.",
                        "vi": "Là một chủ sở hữu vật nuôi có trách nhiệm có nghĩa là chăm sóc cho vật nuôi của bạn."
                    },
                    {
                        "en": "a pet shop (= where animals are sold as pets)",
                        "vi": "cửa hàng thú cưng (= nơi bán động vật làm thú cưng)"
                    },
                    {
                        "en": "Keeping pigs as pets has become extremely popular.",
                        "vi": "Việc nuôi lợn làm thú cưng đã trở nên vô cùng phổ biến."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who is given special attention by somebody, especially in a way that seems unfair to other people",
                    "vi": "một người được ai đó quan tâm đặc biệt, đặc biệt là theo cách có vẻ không công bằng với người khác"
                },
                "examples": [
                    {
                        "en": "She's the teacher's pet.",
                        "vi": "Cô ấy là thú cưng của giáo viên."
                    }
                ]
            },
            {
                "define": {
                    "en": "used when speaking to somebody to show kind feelings or to be friendly",
                    "vi": "được sử dụng khi nói chuyện với ai đó để thể hiện tình cảm tử tế hoặc để tỏ ra thân thiện"
                },
                "examples": [
                    {
                        "en": "What's wrong, pet?",
                        "vi": "Có chuyện gì vậy cưng?"
                    },
                    {
                        "en": "Be a pet (= be kind) and post this letter for me.",
                        "vi": "Hãy là một con vật cưng (= hãy tử tế) và đăng bức thư này cho tôi."
                    }
                ]
            }
        ]
    },
    {
        "id": "72b4b0cf788e4ad5b29b54ffc9bca9c3",
        "word": "rabbit",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈræbɪt/",
            "us": "/ˈræbɪt/"
        },
        "nearby": [
            {
                "word": "rabbi",
                "pos": "noun"
            },
            {
                "word": "rabbinical",
                "pos": "adjective"
            },
            {
                "word": "rabbit",
                "pos": "noun"
            },
            {
                "word": "rabbit",
                "pos": "verb"
            },
            {
                "word": "rabbit on",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small animal with soft fur, long ears and a short tail. Rabbits live in holes in the ground or are kept as pets or for food.",
                    "vi": "một con vật nhỏ với bộ lông mềm mại, tai dài và đuôi ngắn. Thỏ sống trong các lỗ trên mặt đất hoặc được nuôi làm thú cưng hoặc làm thức ăn."
                },
                "examples": [
                    {
                        "en": "a rabbit hutch",
                        "vi": "một cái chuồng thỏ"
                    }
                ]
            },
            {
                "define": {
                    "en": "meat from a rabbit",
                    "vi": "thịt thỏ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to have a lot of babies in a short space of time",
                    "vi": "sinh nhiều con trong một khoảng thời gian ngắn"
                },
                "examples": [
                    {
                        "en": "These rodents breed like rabbits.",
                        "vi": "Những loài gặm nhấm này sinh sản giống như thỏ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to suddenly produce something as a solution to a problem",
                    "vi": "đột nhiên tạo ra một cái gì đó như một giải pháp cho một vấn đề"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "dd4bd688011e4731968611bf7103f000",
        "word": "walk",
        "pos": "verb",
        "level": "a2",
        "phonetic": {
            "uk": "/wɔːk/",
            "us": "/wɔːk/"
        },
        "nearby": [
            {
                "word": "Wales Millennium Centre",
                "pos": ""
            },
            {
                "word": "the Wales Office",
                "pos": ""
            },
            {
                "word": "walk",
                "pos": "verb"
            },
            {
                "word": "walk",
                "pos": "noun"
            },
            {
                "word": "walkable",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to move or go somewhere by putting one foot in front of the other on the ground, but without running",
                    "vi": "để di chuyển hoặc đi đâu đó bằng cách đặt một chân trước chân kia trên mặt đất, nhưng không chạy"
                },
                "examples": [
                    {
                        "en": "The baby is just learning to walk.",
                        "vi": "Em bé mới tập đi."
                    },
                    {
                        "en": "He may not be able to walk again.",
                        "vi": "Anh ta có thể không đi lại được."
                    },
                    {
                        "en": "‘How did you get here?’ ‘I walked.’",
                        "vi": "Bạn đến đây bằng cách nào?' 'Tôi đã đi bộ.'"
                    },
                    {
                        "en": "walk + adv./prep. He walked slowly away from her.",
                        "vi": "đi bộ + adv./prep. Anh từ từ bước ra khỏi cô."
                    },
                    {
                        "en": "The door opened and Jo walked in.",
                        "vi": "Cửa mở và Jo bước vào."
                    },
                    {
                        "en": "She missed the bus and had to walk home.",
                        "vi": "Cô ấy bị lỡ xe buýt và phải đi bộ về nhà."
                    },
                    {
                        "en": "He turned and walked away.",
                        "vi": "Anh quay lưng bước đi."
                    },
                    {
                        "en": "He started to walk away from me, but quickly returned.",
                        "vi": "Anh ta bắt đầu rời xa tôi, nhưng nhanh chóng quay trở lại."
                    },
                    {
                        "en": "People walking past were staring at him.",
                        "vi": "Những người đi qua đang nhìn chằm chằm vào anh ta."
                    },
                    {
                        "en": "You don't mind walking back, do you?",
                        "vi": "Bạn không ngại quay trở lại, phải không?"
                    },
                    {
                        "en": "It looks like a nice place to walk around.",
                        "vi": "Nó trông giống như một nơi tốt đẹp để đi bộ xung quanh."
                    },
                    {
                        "en": "He walks over to the window and looks out.",
                        "vi": "Anh ta bước tới cửa sổ và nhìn ra ngoài."
                    },
                    {
                        "en": "I just happened to be walking by.",
                        "vi": "Tôi chỉ tình cờ đi ngang qua."
                    },
                    {
                        "en": "We walked along in silence for a while.",
                        "vi": "Chúng tôi đi cùng nhau trong im lặng một lúc."
                    },
                    {
                        "en": "I ignored him and walked on.",
                        "vi": "Tôi phớt lờ anh ta và bước tiếp."
                    },
                    {
                        "en": "I always walk to school.",
                        "vi": "Tôi luôn đi bộ đến trường."
                    },
                    {
                        "en": "Taking a deep breath, she walked into the room.",
                        "vi": "Hít một hơi thật sâu, cô bước vào phòng."
                    },
                    {
                        "en": "He immediately got up and walked out of the room.",
                        "vi": "Anh lập tức đứng dậy và bước ra khỏi phòng."
                    },
                    {
                        "en": "I walked in the door and looked around.",
                        "vi": "Tôi bước vào cửa và nhìn xung quanh."
                    },
                    {
                        "en": "He walked out the door, got in his car, and drove off.",
                        "vi": "Anh bước ra khỏi cửa, lên xe và phóng đi."
                    },
                    {
                        "en": "He greeted her as she walked through the door.",
                        "vi": "Anh chào cô khi cô bước qua cửa."
                    },
                    {
                        "en": "I was walking down the street when I suddenly felt ill.",
                        "vi": "Tôi đang đi bộ trên đường thì đột nhiên cảm thấy ốm."
                    },
                    {
                        "en": "The school is within easy walking distance of the train station.",
                        "vi": "Trường nằm trong khoảng cách đi bộ đến ga xe lửa."
                    },
                    {
                        "en": "walk something They walked the dark streets of Los Angeles.",
                        "vi": "đi bộ một cái gì đó Họ đi bộ trên những con phố tối tăm của Los Angeles."
                    },
                    {
                        "en": "Children here walk several miles to school.",
                        "vi": "Trẻ em ở đây đi bộ vài dặm đến trường."
                    },
                    {
                        "en": "She walked the short distance to her flat.",
                        "vi": "Cô đi một đoạn ngắn đến căn hộ của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to spend time walking for pleasure",
                    "vi": "dành thời gian đi bộ cho vui"
                },
                "examples": [
                    {
                        "en": "I like an active holiday, so I walk.",
                        "vi": "Tôi thích một kỳ nghỉ năng động, vì vậy tôi đi bộ."
                    },
                    {
                        "en": "She's started to go walking.",
                        "vi": "Cô ấy bắt đầu đi bộ."
                    },
                    {
                        "en": "walk+ adv./prep. We're going walking in the mountains this summer.",
                        "vi": "đi bộ + adv./prep. Chúng tôi sẽ đi bộ trên núi vào mùa hè này."
                    },
                    {
                        "en": "I walked across Scotland with a friend.",
                        "vi": "Tôi đi bộ xuyên Scotland với một người bạn."
                    },
                    {
                        "en": "walk something They love walking the moors.",
                        "vi": "đi bộ một cái gì đó Họ thích đi bộ trên đồng hoang."
                    }
                ]
            },
            {
                "define": {
                    "en": "to go somewhere with somebody on foot, especially in order to make sure they get there safely",
                    "vi": "đi đâu đó với ai đó đang đi bộ, đặc biệt là để đảm bảo rằng họ đến đó an toàn"
                },
                "examples": [
                    {
                        "en": "He always walked her home.",
                        "vi": "Anh luôn dẫn cô về nhà."
                    },
                    {
                        "en": "I walked him to the corner of the street.",
                        "vi": "Tôi dắt anh đến góc phố."
                    }
                ]
            },
            {
                "define": {
                    "en": "to take an animal for a walk; to make an animal walk somewhere",
                    "vi": "dắt một con vật đi dạo; để làm cho một con vật đi bộ ở đâu đó"
                },
                "examples": [
                    {
                        "en": "They walk their dogs every day.",
                        "vi": "Họ dắt chó đi dạo hàng ngày."
                    },
                    {
                        "en": "She walked the horse around the ring.",
                        "vi": "Cô cho ngựa đi quanh sàn đấu."
                    }
                ]
            },
            {
                "define": {
                    "en": "to disappear; to be taken away",
                    "vi": "biến mất; được đưa đi"
                },
                "examples": [
                    {
                        "en": "Lock up any valuables. Things tend to walk here (= be stolen).",
                        "vi": "Khóa mọi vật có giá trị. Mọi thứ có xu hướng đi bộ ở đây (= bị đánh cắp)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to appear",
                    "vi": "xuất hiện"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "when a batsman walks, he/she leaves the field without waiting for the umpire to say that he/she is out",
                    "vi": "Khi một người đánh bóng đi dạo, anh ấy / cô ấy rời sân mà không đợi trọng tài nói rằng anh ấy / cô ấy đã ra ngoài"
                },
                "examples": [
                    {
                        "en": "He knew he was out, so he walked.",
                        "vi": "Anh biết mình đã ra ngoài nên anh đi bộ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to reach first base without having to do anything because the pitcher failed to throw the ball correctly four times and you didn't try to hit it; to enable a batter to walk",
                    "vi": "để đến được căn cứ đầu tiên mà không cần phải làm bất cứ điều gì vì người ném bóng không ném được chính xác bốn lần và bạn đã không cố gắng đánh nó; để cho phép một người đánh bóng đi bộ"
                },
                "examples": [
                    {
                        "en": "He walked 60 times in 57 games.",
                        "vi": "Anh ấy đã đi bộ 60 lần trong 57 trận đấu."
                    },
                    {
                        "en": "walk somebody Despite walking one batter, Jackson showed solid control of the pitch.",
                        "vi": "walk somebody Mặc dù có một người đánh bóng nhưng Jackson đã cho thấy khả năng kiểm soát sân vững chắc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be taking a risk",
                    "vi": "mạo hiểm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to feel very happy",
                    "vi": "cảm thấy rất hạnh phúc"
                },
                "examples": [
                    {
                        "en": "Most couples feel they are walking on air on their wedding day.",
                        "vi": "Hầu hết các cặp đôi cảm thấy họ đang đi trên sóng trong ngày cưới của họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to get married",
                    "vi": "kết hôn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to do things that are difficult, without learning the basic skills first",
                    "vi": "làm những việc khó mà không học các kỹ năng cơ bản trước"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be in a difficult situation in which you do not have much freedom of action and need to be extremely careful about what you do",
                    "vi": "rơi vào một tình huống khó khăn mà bạn không có nhiều quyền tự do hành động và cần phải cực kỳ cẩn thận về những gì bạn làm"
                },
                "examples": [
                    {
                        "en": "The government is walking a difficult tightrope in wanting to reduce interest rates without pushing up inflation.",
                        "vi": "Chính phủ đang đi một vòng khó khăn trong việc muốn giảm lãi suất mà không đẩy lạm phát lên."
                    }
                ]
            },
            {
                "define": {
                    "en": "to walk around the area that they are responsible for",
                    "vi": "đi bộ xung quanh khu vực mà họ chịu trách nhiệm"
                },
                "examples": [
                    {
                        "en": "We have two officers walking the beat after midnight.",
                        "vi": "Chúng tôi có hai sĩ quan đi bộ sau nửa đêm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be in a difficult or dangerous situation where you could easily make a mistake",
                    "vi": "ở trong một tình huống khó khăn hoặc nguy hiểm mà bạn có thể dễ dàng mắc sai lầm"
                },
                "examples": [
                    {
                        "en": "He was walking a fine line between being funny and being rude.",
                        "vi": "Anh ấy đang đi đúng ranh giới giữa hài hước và thô lỗ."
                    },
                    {
                        "en": "She often seems to tread a thin line between success and failure.",
                        "vi": "Cô ấy dường như luôn vạch ra một ranh giới mỏng manh giữa thành công và thất bại."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be allowed to leave court, etc., without receiving any punishment",
                    "vi": "được phép rời khỏi tòa án, v.v. mà không phải nhận bất kỳ hình phạt nào"
                },
                "examples": [
                    {
                        "en": "She was acquitted and walked free from court.",
                        "vi": "Cô được tuyên bố trắng án và không phải ra tòa."
                    }
                ]
            },
            {
                "define": {
                    "en": "to go somewhere on foot instead of in a vehicle",
                    "vi": "đi bộ đến một nơi nào đó thay vì đi xe"
                },
                "examples": [
                    {
                        "en": "It’s not very far. We can easily walk it.",
                        "vi": "Nó không quá xa. Chúng tôi có thể dễ dàng đi bộ nó."
                    }
                ]
            },
            {
                "define": {
                    "en": "to easily achieve something that you want",
                    "vi": "để dễ dàng đạt được điều gì đó bạn muốn"
                },
                "examples": [
                    {
                        "en": "It's not a difficult exam. You'll walk it!",
                        "vi": "Đây không phải là một kỳ thi khó. Bạn sẽ đi bộ nó!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody walk so far or so fast that they are very tired",
                    "vi": "khiến ai đó đi bộ xa hoặc nhanh đến mức họ rất mệt"
                },
                "examples": [
                    {
                        "en": "I hope I haven’t walked you off your feet.",
                        "vi": "Tôi hy vọng tôi đã không bỏ rơi bạn khỏi đôi chân của bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to stop working in order to go on strike",
                    "vi": "ngừng làm việc để đình công"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "(in the past) to walk along a board placed over the side of a ship and fall into the sea, as a punishment",
                    "vi": "(trong quá khứ) để đi dọc theo tấm ván đặt trên mạn tàu và rơi xuống biển, như một hình phạt"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to walk around the streets of a town or city",
                    "vi": "đi bộ xung quanh các đường phố của một thị trấn hoặc thành phố"
                },
                "examples": [
                    {
                        "en": "Is it safe to walk the streets alone at night?",
                        "vi": "Đi dạo phố một mình vào ban đêm có an toàn không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to feel proud and confident",
                    "vi": "cảm thấy tự hào và tự tin"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to act in a way that shows people you are really good at what you do, and not just good at talking about it",
                    "vi": "hành động theo cách cho mọi người thấy rằng bạn thực sự giỏi về những gì bạn làm và không chỉ giỏi nói về nó"
                },
                "examples": [
                    {
                        "en": "You can talk the talk but can you walk the walk?",
                        "vi": "Bạn có thể nói chuyện nhưng bạn có thể đi bộ không?"
                    }
                ]
            }
        ]
    },
    {
        "id": "5f6247ea46cb42f08fea7c9193ee0c72",
        "word": "guinea pig",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈɡɪni pɪɡ/",
            "us": "/ˈɡɪni pɪɡ/"
        },
        "nearby": [
            {
                "word": "guinea fowl",
                "pos": "noun"
            },
            {
                "word": "Guinean",
                "pos": "noun, adjective"
            },
            {
                "word": "guinea pig",
                "pos": "noun"
            },
            {
                "word": "Guinevere",
                "pos": ""
            },
            {
                "word": "Guinness",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small animal with short ears and no tail, often kept as a pet",
                    "vi": "một con vật nhỏ có tai ngắn và không có đuôi, thường được nuôi làm thú cưng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a person used in medical or other experiments",
                    "vi": "một người được sử dụng trong y tế hoặc các thí nghiệm khác"
                },
                "examples": [
                    {
                        "en": "Students in fifty schools are to act as guinea pigs for these new teaching methods.",
                        "vi": "Học sinh của năm mươi trường học sẽ đóng vai trò như những con chuột lang cho những phương pháp giảng dạy mới này."
                    }
                ]
            }
        ]
    },
    {
        "id": "da5dc49c9abf4298b91d927d6bec742d",
        "word": "hamster",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈhæmstə(r)/",
            "us": "/ˈhæmstər/"
        },
        "nearby": [
            {
                "word": "Hampstead",
                "pos": ""
            },
            {
                "word": "Hampton Court",
                "pos": ""
            },
            {
                "word": "hamster",
                "pos": "noun"
            },
            {
                "word": "hamstring",
                "pos": "noun"
            },
            {
                "word": "hamstring",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an animal like a large mouse, with large cheeks (= sides of the face) for storing food. Hamsters are often kept as pets.",
                    "vi": "một con vật giống như một con chuột lớn, với hai má lớn (= hai bên mặt) để chứa thức ăn. Hamster thường được nuôi làm thú cưng."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "439d85e715824abc81fa11aa40caa536",
        "word": "kitten",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈkɪtn/",
            "us": "/ˈkɪtn/"
        },
        "nearby": [
            {
                "word": "kitsch",
                "pos": "noun"
            },
            {
                "word": "kitsch",
                "pos": "adjective"
            },
            {
                "word": "kitten",
                "pos": "noun"
            },
            {
                "word": "kitten heels",
                "pos": "noun"
            },
            {
                "word": "kittenish",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a young cat",
                    "vi": "một con mèo trẻ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the young of several other animals, such as rabbits and beavers",
                    "vi": "con non của một số động vật khác, chẳng hạn như thỏ và hải ly"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be very anxious, angry or upset about something",
                    "vi": "rất lo lắng, tức giận hoặc khó chịu về điều gì đó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "f2909cd833664ee18031040642d888ac",
        "word": "pet sitter",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈpet sɪtə(r)/",
            "us": "/ˈpet sɪtər/"
        },
        "nearby": [
            {
                "word": "petrology",
                "pos": "noun"
            },
            {
                "word": "petrol station",
                "pos": "noun"
            },
            {
                "word": "pet sitter",
                "pos": "noun"
            },
            {
                "word": "petticoat",
                "pos": "noun"
            },
            {
                "word": "Petticoat Lane",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who takes care of pets while their owners are away from home",
                    "vi": "một người chăm sóc thú cưng khi chủ của chúng vắng nhà"
                },
                "examples": [
                    {
                        "en": "A pet sitter will take the dog for a walk, brush the cat's fur and spend quality time with your pets.",
                        "vi": "Người chăm sóc thú cưng sẽ dắt chó đi dạo, chải lông cho mèo và dành thời gian vui vẻ với thú cưng của bạn."
                    }
                ]
            }
        ]
    },
    {
        "id": "2f915b4b24634a1a8106ead65f6587c1",
        "word": "pony",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈpəʊni/",
            "us": "/ˈpəʊni/"
        },
        "nearby": [
            {
                "word": "Pontin's",
                "pos": ""
            },
            {
                "word": "pontoon",
                "pos": "noun"
            },
            {
                "word": "pony",
                "pos": "noun"
            },
            {
                "word": "pony",
                "pos": "verb"
            },
            {
                "word": "the Pony Club",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a type of small horse",
                    "vi": "một loại ngựa nhỏ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "£25",
                    "vi": "£ 25"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "an event that is planned only in order to impress people so that they will support or buy something",
                    "vi": "một sự kiện chỉ được lên kế hoạch nhằm gây ấn tượng với mọi người để họ ủng hộ hoặc mua thứ gì đó"
                },
                "examples": [
                    {
                        "en": "the dog and pony show of his visits to the war zone",
                        "vi": "con chó và con ngựa con trong chuyến thăm của anh ấy đến khu vực chiến tranh"
                    },
                    {
                        "en": "a dog and pony show to sell the idea to investors",
                        "vi": "một buổi biểu diễn chó và ngựa để bán ý tưởng cho các nhà đầu tư"
                    }
                ]
            },
            {
                "define": {
                    "en": "walking, rather than travelling by car, bus, etc.",
                    "vi": "đi bộ, thay vì đi ô tô, xe buýt, v.v."
                },
                "examples": [
                    {
                        "en": "‘How did you get here?’ ‘Shanks’s pony!’",
                        "vi": "Bạn đến đây bằng cách nào?' 'Con ngựa của Shanks!'"
                    }
                ]
            }
        ]
    },
    {
        "id": "b931afc1e3c644f2824a88d1611baa83",
        "word": "stroke",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/strəʊk/",
            "us": "/strəʊk/"
        },
        "nearby": [
            {
                "word": "stroganoff",
                "pos": "noun"
            },
            {
                "word": "stroke",
                "pos": "noun"
            },
            {
                "word": "stroke",
                "pos": "verb"
            },
            {
                "word": "stroke play",
                "pos": "noun"
            },
            {
                "word": "The Strokes",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to move your hand gently and slowly over an animal’s fur or hair",
                    "vi": "di chuyển bàn tay của bạn nhẹ nhàng và chậm rãi trên lông hoặc lông của động vật"
                },
                "examples": [
                    {
                        "en": "He's a beautiful dog. Can I stroke him?",
                        "vi": "Nó là một con chó đẹp. Tôi có thể vuốt ve anh ấy không?"
                    },
                    {
                        "en": "She stroked the cat absently.",
                        "vi": "Cô lơ đãng vuốt ve con mèo."
                    }
                ]
            },
            {
                "define": {
                    "en": "to move your hand gently over a surface, somebody’s hair, etc.",
                    "vi": "di chuyển bàn tay của bạn nhẹ nhàng trên bề mặt, mái tóc của ai đó, v.v."
                },
                "examples": [
                    {
                        "en": "He stroked her hair affectionately.",
                        "vi": "Anh vuốt tóc cô trìu mến."
                    },
                    {
                        "en": "He stroked his beard thoughtfully.",
                        "vi": "Anh ta vuốt râu một cách ân cần."
                    },
                    {
                        "en": "He stroked back his hair.",
                        "vi": "Anh vuốt lại mái tóc của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to move something somewhere with a gentle movement",
                    "vi": "để di chuyển một cái gì đó đến một nơi nào đó bằng một chuyển động nhẹ nhàng"
                },
                "examples": [
                    {
                        "en": "She stroked away his tears.",
                        "vi": "Cô vuốt đi những giọt nước mắt của anh."
                    },
                    {
                        "en": "He stroked the ball between the posts.",
                        "vi": "Anh ta vuốt bóng giữa các trụ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be very nice to somebody, especially to get them to do what you want",
                    "vi": "đối xử tốt với ai đó, đặc biệt là để họ làm những gì bạn muốn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "e42a35e68c794fc1a645fdab0d291d65",
        "word": "angora",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/æŋˈɡɔːrə/",
            "us": "/æŋˈɡɔːrə/"
        },
        "nearby": [
            {
                "word": "Angola",
                "pos": "noun"
            },
            {
                "word": "Angolan",
                "pos": "noun, adjective"
            },
            {
                "word": "angora",
                "pos": "noun"
            },
            {
                "word": "Angostura",
                "pos": "noun"
            },
            {
                "word": "angrez",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a type of cat, goat or rabbit that has long soft hair",
                    "vi": "một loại mèo, dê hoặc thỏ có lông dài mềm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a type of soft wool or cloth made from the hair of the angora goat or rabbit",
                    "vi": "một loại len hoặc vải mềm làm từ lông của dê hoặc thỏ angora"
                },
                "examples": [
                    {
                        "en": "an angora sweater",
                        "vi": "một chiếc áo len angora"
                    }
                ]
            }
        ]
    },
    {
        "id": "9250ca216f9a40cab9b49d747286355d",
        "word": "bunny",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbʌni/",
            "us": "/ˈbʌni/"
        },
        "nearby": [
            {
                "word": "bunk off work",
                "pos": "phrasal verb"
            },
            {
                "word": "bunkum",
                "pos": "noun"
            },
            {
                "word": "bunny",
                "pos": "noun"
            },
            {
                "word": "bunny boiler",
                "pos": "noun"
            },
            {
                "word": "bunny-hop",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a child’s word for a rabbit",
                    "vi": "từ của một đứa trẻ cho một con thỏ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a person who enjoys a particular activity or who is in a particular mood",
                    "vi": "một người thích một hoạt động cụ thể hoặc một người có tâm trạng cụ thể"
                },
                "examples": [
                    {
                        "en": "gym/beach/snow bunnies",
                        "vi": "phòng tập thể dục / bãi biển / thỏ tuyết"
                    },
                    {
                        "en": "an angry bunny",
                        "vi": "một con thỏ giận dữ"
                    }
                ]
            },
            {
                "define": {
                    "en": "not pleased about a situation",
                    "vi": "không hài lòng về một tình huống"
                },
                "examples": [
                    {
                        "en": "She wasn't a happy bunny at all.",
                        "vi": "Cô ấy không phải là một con thỏ hạnh phúc chút nào."
                    }
                ]
            }
        ]
    },
    {
        "id": "f6ea95e1a9df4e3ba9b1a79f6dae6b04",
        "word": "calico cat",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkælɪkəʊ kæt/",
            "us": "/ˈkælɪkəʊ kæt/"
        },
        "nearby": [
            {
                "word": "calibre",
                "pos": "noun"
            },
            {
                "word": "calico",
                "pos": "noun"
            },
            {
                "word": "calico cat",
                "pos": "noun"
            },
            {
                "word": "California",
                "pos": ""
            },
            {
                "word": "californium",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a cat with black, brown, orange and white fur",
                    "vi": "một con mèo với bộ lông đen, nâu, cam và trắng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "b12048e9d6e2463b91dba15b94f8a9ba",
        "word": "feline",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈfiːlaɪn/",
            "us": "/ˈfiːlaɪn/"
        },
        "nearby": [
            {
                "word": "Felicity",
                "pos": ""
            },
            {
                "word": "feline",
                "pos": "adjective"
            },
            {
                "word": "feline",
                "pos": "noun"
            },
            {
                "word": "Felix",
                "pos": ""
            },
            {
                "word": "Felix the Cat",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a cat; an animal of the cat family",
                    "vi": "con mèo; một loài động vật thuộc họ mèo"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c8c991da48234454a11856278b8eaf70",
        "word": "four-legged friend",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌfɔː leɡɪd ˈfrend/",
            "us": "/ˌfɔːr leɡɪd ˈfrend/"
        },
        "nearby": [
            {
                "word": "4-H",
                "pos": "noun"
            },
            {
                "word": "the Four Hundred",
                "pos": ""
            },
            {
                "word": "four-legged friend",
                "pos": "noun"
            },
            {
                "word": "four-letter word",
                "pos": "noun"
            },
            {
                "word": "404",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a pet with four legs, especially a dog",
                    "vi": "một con vật cưng có bốn chân, đặc biệt là một con chó"
                },
                "examples": [
                    {
                        "en": "She was seen throwing a ball for her four-legged friend.",
                        "vi": "Cô được nhìn thấy đang ném một quả bóng cho người bạn bốn chân của mình."
                    }
                ]
            }
        ]
    },
    {
        "id": "4cbdd7cc294b4c7eaf3292f023134777",
        "word": "gerbil",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈdʒɜːbɪl/",
            "us": "/ˈdʒɜːrbɪl/"
        },
        "nearby": [
            {
                "word": "geranium",
                "pos": "noun"
            },
            {
                "word": "Gerard",
                "pos": ""
            },
            {
                "word": "gerbil",
                "pos": "noun"
            },
            {
                "word": "geriatric",
                "pos": "noun"
            },
            {
                "word": "geriatric",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small desert animal like a mouse, one type of which is often kept as a pet",
                    "vi": "một loài động vật sa mạc nhỏ như chuột, một loại thường được nuôi làm thú cưng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "df61ab6f2edb4032a9f6617f5e4bb866",
        "word": "house-broken",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈhaʊs brəʊkən/",
            "us": "/ˈhaʊs brəʊkən/"
        },
        "nearby": [
            {
                "word": "housebreaker",
                "pos": "noun"
            },
            {
                "word": "housebreaking",
                "pos": "noun"
            },
            {
                "word": "house-broken",
                "pos": "adjective"
            },
            {
                "word": "house call",
                "pos": "noun"
            },
            {
                "word": "housecoat",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "trained to defecate and urinate outside the house or in a special box",
                    "vi": "được huấn luyện để đại tiện và tiểu tiện bên ngoài nhà hoặc trong một hộp đặc biệt"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "8061353c29964f549c7f3f40514e6c41",
        "word": "house-trained",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈhaʊs treɪnd/",
            "us": "/ˈhaʊs treɪnd/"
        },
        "nearby": [
            {
                "word": "The House that Jack Built",
                "pos": ""
            },
            {
                "word": "house-to-house",
                "pos": "adjective"
            },
            {
                "word": "house-trained",
                "pos": "adjective"
            },
            {
                "word": "the House Un-American Activities Committee",
                "pos": ""
            },
            {
                "word": "housewares",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "trained to defecate and urinate outside the house or in a special box",
                    "vi": "được huấn luyện để đại tiện và tiểu tiện bên ngoài nhà hoặc trong một hộp đặc biệt"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "8a38f88e8c704321a71dabaf0e16943b",
        "word": "kitty",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkɪti/",
            "us": "/ˈkɪti/"
        },
        "nearby": [
            {
                "word": "Kittitian",
                "pos": "noun, adjective"
            },
            {
                "word": "kittiwake",
                "pos": "noun"
            },
            {
                "word": "kitty",
                "pos": "noun"
            },
            {
                "word": "kitty-corner(ed)",
                "pos": "adjective, adverb"
            },
            {
                "word": "kitty party",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "if money is put in a kitty, a group of people all give an amount and the money is spent on something they all agree on",
                    "vi": "nếu tiền được bỏ vào một con mèo, một nhóm người đều đưa ra một số tiền và số tiền đó được chi cho một thứ mà tất cả họ đều đồng ý"
                },
                "examples": [
                    {
                        "en": "We each put £50 in the kitty to cover the bills.",
                        "vi": "Mỗi người chúng tôi bỏ £ 50 vào mèo con để trang trải các hóa đơn."
                    }
                ]
            },
            {
                "define": {
                    "en": "the sum of money that all the players bet, which is given to the winner",
                    "vi": "tổng số tiền mà tất cả người chơi đặt cược, được trao cho người chiến thắng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a way of referring to a cat",
                    "vi": "một cách đề cập đến một con mèo"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "5ae93ce107ba4cf19ad465dbf3a27991",
        "word": "leash",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/liːʃ/",
            "us": "/liːʃ/"
        },
        "nearby": [
            {
                "word": "leasehold",
                "pos": "noun"
            },
            {
                "word": "leaseholder",
                "pos": "noun"
            },
            {
                "word": "leash",
                "pos": "noun"
            },
            {
                "word": "leash",
                "pos": "verb"
            },
            {
                "word": "leasing",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a long piece of leather, chain or rope used for holding and controlling a dog",
                    "vi": "một miếng da dài, dây xích hoặc dây thừng dùng để giữ và điều khiển một con chó"
                },
                "examples": [
                    {
                        "en": "on a leash All dogs must be kept on a leash in public places.",
                        "vi": "trên dây xích Tất cả những con chó phải được xích ở những nơi công cộng."
                    },
                    {
                        "en": "Once she was away from the road, she could let the dogs off the leash.",
                        "vi": "Một khi cô ấy đi vắng trên đường, cô ấy có thể thả những con chó ra khỏi dây xích."
                    }
                ]
            },
            {
                "define": {
                    "en": "to want to do something very much",
                    "vi": "muốn làm một cái gì đó rất nhiều"
                },
                "examples": [
                    {
                        "en": "Like all youngsters, he's straining at the leash to leave home.",
                        "vi": "Giống như tất cả những người trẻ tuổi, anh ấy đang căng thẳng trước dây buộc để rời khỏi nhà."
                    }
                ]
            }
        ]
    },
    {
        "id": "f0147daf7a8b49aba5e9fa1cb41c10a6",
        "word": "litter",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈlɪtə(r)/",
            "us": "/ˈlɪtər/"
        },
        "nearby": [
            {
                "word": "litotes",
                "pos": "noun"
            },
            {
                "word": "litre",
                "pos": "noun"
            },
            {
                "word": "litter",
                "pos": "noun"
            },
            {
                "word": "litter",
                "pos": "verb"
            },
            {
                "word": "litter bin",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "small pieces of rubbish such as paper, cans and bottles, that people have left lying in a public place",
                    "vi": "những mảnh rác nhỏ như giấy, lon và chai lọ mà người ta bỏ lại nằm ở nơi công cộng"
                },
                "examples": [
                    {
                        "en": "There will be fines for people who drop litter.",
                        "vi": "Sẽ có mức phạt đối với những người thả rác bừa bãi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a number of things that are lying in an untidy way",
                    "vi": "một số thứ đang nằm một cách khó xử lý"
                },
                "examples": [
                    {
                        "en": "The floor was covered with a litter of newspapers, clothes and empty cups.",
                        "vi": "Sàn nhà rải đầy báo, quần áo và những chiếc cốc rỗng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a dry substance that is put in a shallow open box for pets, especially cats, to use as a toilet when they are indoors",
                    "vi": "Một chất khô được cho vào hộp mở cạn để vật nuôi, đặc biệt là mèo, dùng làm chỗ vệ sinh khi chúng ở trong nhà"
                },
                "examples": [
                    {
                        "en": "cat litter",
                        "vi": "phân mèo"
                    },
                    {
                        "en": "(also especially North American English) kitty litter",
                        "vi": "(đặc biệt là tiếng Anh Bắc Mỹ) mèo con"
                    },
                    {
                        "en": "(British English) a litter tray",
                        "vi": "(Tiếng Anh Anh) một khay vệ sinh"
                    },
                    {
                        "en": "(North American English) a litter box",
                        "vi": "(Tiếng Anh Bắc Mỹ) một thùng rác"
                    }
                ]
            },
            {
                "define": {
                    "en": "a number of baby animals that one mother gives birth to at the same time",
                    "vi": "một số động vật con mà một bà mẹ sinh ra cùng một lúc"
                },
                "examples": [
                    {
                        "en": "a litter of puppies",
                        "vi": "một lứa chó con"
                    },
                    {
                        "en": "the runt (= the smallest and weakest baby) of the litter",
                        "vi": "runt (= con nhỏ nhất và yếu nhất) trong lứa"
                    },
                    {
                        "en": "‘Chief’ was born six years ago, one of a litter of 11.",
                        "vi": "Chief' được sinh ra cách đây 6 năm, một lứa 11 con."
                    }
                ]
            },
            {
                "define": {
                    "en": "the substance, especially straw, that is used for farm animals to sleep on",
                    "vi": "chất, đặc biệt là rơm, được sử dụng cho động vật trang trại để ngủ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a kind of chair or bed that was used in the past for carrying important people",
                    "vi": "một loại ghế hoặc giường được sử dụng trong quá khứ để chở những người quan trọng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "707ccb67128b4a4a988801ff2580209d",
        "word": "longhair",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈlɒŋheə(r)/",
            "us": "/ˈlɔːŋher/"
        },
        "nearby": [
            {
                "word": "longevity",
                "pos": "noun"
            },
            {
                "word": "Henry Wadsworth Longfellow",
                "pos": ""
            },
            {
                "word": "longhair",
                "pos": "noun"
            },
            {
                "word": "longhand",
                "pos": "noun"
            },
            {
                "word": "long haul",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a type of cat with long hair",
                    "vi": "một loại mèo có lông dài"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "7acd8bf99a3848b4a288f6ed40f4f69f",
        "word": "Manx cat",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌmæŋks ˈkæt/",
            "us": "/ˌmæŋks ˈkæt/"
        },
        "nearby": [
            {
                "word": "manuscript paper",
                "pos": "noun"
            },
            {
                "word": "Manx",
                "pos": "adjective"
            },
            {
                "word": "Manx cat",
                "pos": "noun"
            },
            {
                "word": "many",
                "pos": "determiner, pronoun"
            },
            {
                "word": "manyatta",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a breed of cat with no tail",
                    "vi": "một giống mèo không có đuôi"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "2414b77145cc4314980c9f62d46e71bf",
        "word": "marmalade cat",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmɑːməleɪd kæt/",
            "us": "/ˈmɑːrməleɪd kæt/"
        },
        "nearby": [
            {
                "word": "Philip Marlowe",
                "pos": ""
            },
            {
                "word": "marmalade",
                "pos": "noun"
            },
            {
                "word": "marmalade cat",
                "pos": "noun"
            },
            {
                "word": "Marmite",
                "pos": "noun"
            },
            {
                "word": "marmoreal",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a cat with orange fur with darker orange stripes (= narrow lines)",
                    "vi": "một con mèo có bộ lông màu cam với các sọc màu cam đậm hơn (= các đường hẹp)"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "470b89074c2343e6a5c6b30c68c5b951",
        "word": "microchip",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmaɪkrəʊtʃɪp/",
            "us": "/ˈmaɪkrəʊtʃɪp/"
        },
        "nearby": [
            {
                "word": "microbrewery",
                "pos": "noun"
            },
            {
                "word": "microchip",
                "pos": "noun"
            },
            {
                "word": "microchip",
                "pos": "verb"
            },
            {
                "word": "microclimate",
                "pos": "noun"
            },
            {
                "word": "microcode",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to put a microchip under the skin of an animal as a way of identifying it",
                    "vi": "đặt một vi mạch bên dưới da của một con vật như một cách để xác định nó"
                },
                "examples": [
                    {
                        "en": "Our dog has been microchipped and vaccinated against rabies.",
                        "vi": "Con chó của chúng tôi đã được cấy vi mạch và tiêm phòng bệnh dại."
                    }
                ]
            }
        ]
    },
    {
        "id": "baeaae4098624aa58b370acac9026bff",
        "word": "moggie",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmɒɡi/",
            "us": "/ˈmɑːɡi/"
        },
        "nearby": [
            {
                "word": "modus vivendi",
                "pos": "noun"
            },
            {
                "word": "Moebius strip",
                "pos": "noun"
            },
            {
                "word": "moggie",
                "pos": "noun"
            },
            {
                "word": "mogul",
                "pos": "noun"
            },
            {
                "word": "mohair",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a cat, especially an ordinary one of no particular breed",
                    "vi": "một con mèo, đặc biệt là một con bình thường không thuộc giống cụ thể"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "7d64e0ac13da4517ab38753394db8d5e",
        "word": "neuter",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈnjuːtə(r)/",
            "us": "/ˈnuːtər/"
        },
        "nearby": [
            {
                "word": "neurotypical",
                "pos": "adjective"
            },
            {
                "word": "neuter",
                "pos": "adjective"
            },
            {
                "word": "neuter",
                "pos": "verb"
            },
            {
                "word": "neutral",
                "pos": "adjective"
            },
            {
                "word": "neutral",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to remove part of the sex organs of an animal so that it cannot produce young",
                    "vi": "cắt bỏ một phần cơ quan sinh dục của động vật để nó không thể sinh non"
                },
                "examples": [
                    {
                        "en": "Has your cat been neutered?",
                        "vi": "Con mèo của bạn đã bị vô hiệu hóa chưa?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to prevent something from having the effect that it ought to have",
                    "vi": "để ngăn điều gì đó có hiệu ứng mà nó phải có"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "e47032138ddc44df902f9c527077be9c",
        "word": "pussy",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpʊsi/",
            "us": "/ˈpʊsi/"
        },
        "nearby": [
            {
                "word": "puss",
                "pos": "noun"
            },
            {
                "word": "Puss in Boots",
                "pos": ""
            },
            {
                "word": "pussy",
                "pos": "noun"
            },
            {
                "word": "Pussy Cat, Pussy Cat, Where Have You Been?",
                "pos": ""
            },
            {
                "word": "pussycat",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a child’s word for a cat",
                    "vi": "từ của một đứa trẻ cho một con mèo"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the female sexual organs, especially the vulva",
                    "vi": "các cơ quan sinh dục nữ, đặc biệt là âm hộ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "5270cf83806b4bb983cb1f7eeaf04c33",
        "word": "Shetland pony",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌʃetlənd ˈpəʊni/",
            "us": "/ˌʃetlənd ˈpəʊni/"
        },
        "nearby": [
            {
                "word": "She Stoops to Conquer",
                "pos": ""
            },
            {
                "word": "the Shetland Islands",
                "pos": ""
            },
            {
                "word": "Shetland pony",
                "pos": "noun"
            },
            {
                "word": "shh",
                "pos": "exclamation"
            },
            {
                "word": "Shia",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a very small, strong horse with a rough coat",
                    "vi": "một con ngựa rất nhỏ, mạnh mẽ với bộ lông xù xì"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "415e47f19db0440e9c53db9fb16fb403",
        "word": "shorthair",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈʃɔːtheə(r)/",
            "us": "/ˈʃɔːrther/"
        },
        "nearby": [
            {
                "word": "shortfall",
                "pos": "noun"
            },
            {
                "word": "short-fused",
                "pos": "adjective"
            },
            {
                "word": "shorthair",
                "pos": "noun"
            },
            {
                "word": "shorthand",
                "pos": "noun"
            },
            {
                "word": "short-handed",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a type of cat with short hair",
                    "vi": "một loại mèo có lông ngắn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "366950f681124abbb16ed0c47f600c37",
        "word": "Siamese cat",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌsaɪəmiːz ˈkæt/",
            "us": "/ˌsaɪəmiːz ˈkæt/"
        },
        "nearby": [
            {
                "word": "shyster",
                "pos": "noun"
            },
            {
                "word": "SI",
                "pos": "abbreviation"
            },
            {
                "word": "Siamese cat",
                "pos": "noun"
            },
            {
                "word": "Siamese twin",
                "pos": "noun"
            },
            {
                "word": "Sian",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a cat with short pale fur and a brown face, ears, tail and feet",
                    "vi": "một con mèo có bộ lông ngắn màu nhạt và mặt nâu, tai, đuôi và bàn chân"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "1252f7d72b04468f9f4de645df1b6771",
        "word": "spay",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/speɪ/",
            "us": "/speɪ/"
        },
        "nearby": [
            {
                "word": "spawn",
                "pos": "verb"
            },
            {
                "word": "spawn",
                "pos": "noun"
            },
            {
                "word": "spay",
                "pos": "verb"
            },
            {
                "word": "spaza",
                "pos": "noun"
            },
            {
                "word": "SPCA",
                "pos": "abbreviation"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to remove the ovaries of a female animal, to prevent it from producing young",
                    "vi": "cắt bỏ buồng trứng của động vật cái, để ngăn nó sinh ra con non"
                },
                "examples": [
                    {
                        "en": "Have you had your cat spayed?",
                        "vi": "Bạn đã đánh con mèo của bạn chưa?"
                    }
                ]
            }
        ]
    },
    {
        "id": "d767f024c0ea4806b15784761c2029dc",
        "word": "tabby",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈtæbi/",
            "us": "/ˈtæbi/"
        },
        "nearby": [
            {
                "word": "Tabata",
                "pos": "noun"
            },
            {
                "word": "tabbouleh",
                "pos": "noun"
            },
            {
                "word": "tabby",
                "pos": "noun"
            },
            {
                "word": "tabernacle",
                "pos": "noun"
            },
            {
                "word": "tab key",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a cat with brown or grey fur marked with dark lines or spots",
                    "vi": "một con mèo có bộ lông màu nâu hoặc xám được đánh dấu bằng những đường hoặc đốm sẫm màu"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "458ccd0287a64efc9a1de1536915efbc",
        "word": "tom",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/tɒm/",
            "us": "/tɑːm/"
        },
        "nearby": [
            {
                "word": "the Tolpuddle Martyrs",
                "pos": ""
            },
            {
                "word": "tom-tom",
                "pos": "verb"
            },
            {
                "word": "tom",
                "pos": "noun"
            },
            {
                "word": "Tom",
                "pos": "noun"
            },
            {
                "word": "tomahawk",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a male cat",
                    "vi": "một con mèo đực"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "53871793d02c4ed49eb693aa856b3265",
        "word": "tomcat",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈtɒmkæt/",
            "us": "/ˈtɑːmkæt/"
        },
        "nearby": [
            {
                "word": "Tombstone",
                "pos": ""
            },
            {
                "word": "tombstoning",
                "pos": "noun"
            },
            {
                "word": "tomcat",
                "pos": "noun"
            },
            {
                "word": "Tom Collins",
                "pos": "noun"
            },
            {
                "word": "tome",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a male cat",
                    "vi": "một con mèo đực"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "e6d484cf278d491fb719601ad0378faa",
        "word": "tortoiseshell",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈtɔːtəsʃel/",
            "us": "/ˈtɔːrtəsʃel/"
        },
        "nearby": [
            {
                "word": "tortoise",
                "pos": "noun"
            },
            {
                "word": "The Tortoise and the Hare",
                "pos": ""
            },
            {
                "word": "tortoiseshell",
                "pos": "noun"
            },
            {
                "word": "tortuous",
                "pos": "adjective"
            },
            {
                "word": "tortuously",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the hard shell of a turtle, especially the type with orange and brown marks, used for making combs, jewellery, etc.",
                    "vi": "mai cứng của rùa, đặc biệt là loại có các vết màu cam và nâu, dùng để làm lược, đồ trang sức, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a cat with black, brown, orange and white fur",
                    "vi": "một con mèo với bộ lông đen, nâu, cam và trắng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a butterfly with orange and brown marks on its wings",
                    "vi": "con bướm có vết màu cam và nâu trên cánh"
                },
                "examples": []
            }
        ]
    }
]