[
    {
        "id": "289cf624a1504380b8bd6435a05e6ccc",
        "word": "lawyer",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈlɔɪə(r)/",
            "us": "/ˈlɔɪər/"
        },
        "nearby": [
            {
                "word": "the Law Society",
                "pos": ""
            },
            {
                "word": "lawsuit",
                "pos": "noun"
            },
            {
                "word": "lawyer",
                "pos": "noun"
            },
            {
                "word": "lax",
                "pos": "adjective"
            },
            {
                "word": "laxative",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who is trained and qualified to advise people about the law and to represent them in court, and to write legal documents",
                    "vi": "một người được đào tạo và đủ điều kiện để tư vấn cho mọi người về luật pháp và đại diện cho họ trước tòa, và viết các văn bản pháp lý"
                },
                "examples": [
                    {
                        "en": "to hire a lawyer",
                        "vi": "thuê một luật sư"
                    },
                    {
                        "en": "You would be wise to consult a lawyer.",
                        "vi": "Bạn sẽ là người khôn ngoan khi tham khảo ý kiến một luật sư."
                    },
                    {
                        "en": "a defence lawyer",
                        "vi": "một luật sư bào chữa"
                    },
                    {
                        "en": "(North American English) a trial lawyer",
                        "vi": "(Tiếng Anh Bắc Mỹ) một luật sư thử việc"
                    },
                    {
                        "en": "a human rights lawyer",
                        "vi": "một luật sư nhân quyền"
                    },
                    {
                        "en": "The lawyer representing the family said he was very satisfied with the verdict.",
                        "vi": "Luật sư đại diện cho gia đình cho biết rất hài lòng với bản án."
                    },
                    {
                        "en": "lawyer for somebody Lawyers for all three defendants said their clients did not intend to kill the victim.",
                        "vi": "Luật sư cho ai đó Luật sư của cả ba bị cáo cho biết thân chủ của họ không có ý định giết nạn nhân."
                    }
                ]
            }
        ]
    },
    {
        "id": "e3e3c03e9ea14e6db3715c2de24e88be",
        "word": "judge",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/dʒʌdʒ/",
            "us": "/dʒʌdʒ/"
        },
        "nearby": [
            {
                "word": "judder",
                "pos": "verb"
            },
            {
                "word": "Jude",
                "pos": ""
            },
            {
                "word": "judge",
                "pos": "noun"
            },
            {
                "word": "judge",
                "pos": "verb"
            },
            {
                "word": "Judge Dredd",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person in a court who has the authority to decide how criminals should be punished or to make legal decisions",
                    "vi": "một người trong tòa án, người có thẩm quyền quyết định tội phạm sẽ bị trừng phạt như thế nào hoặc đưa ra các quyết định pháp lý"
                },
                "examples": [
                    {
                        "en": "a High Court judge",
                        "vi": "một thẩm phán Tòa án Tối cao"
                    },
                    {
                        "en": "a federal/district judge",
                        "vi": "thẩm phán liên bang / quận"
                    },
                    {
                        "en": "the presiding trial judge",
                        "vi": "chủ tọa phiên tòa xét xử"
                    },
                    {
                        "en": "to appoint a judge",
                        "vi": "bổ nhiệm một thẩm phán"
                    },
                    {
                        "en": "before a judge The case comes before Judge Cooper next week.",
                        "vi": "trước thẩm phán Vụ án được đưa ra trước thẩm phán Cooper vào tuần tới."
                    },
                    {
                        "en": "He will appear before a judge tomorrow.",
                        "vi": "Anh ta sẽ xuất hiện trước một thẩm phán vào ngày mai."
                    },
                    {
                        "en": "The judge sentenced him to five years in prison.",
                        "vi": "Thẩm phán đã kết án anh ta năm năm tù."
                    },
                    {
                        "en": "The judge ruled that the evidence was inadmissible.",
                        "vi": "Thẩm phán đã phán quyết rằng bằng chứng là không thể chấp nhận được."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who decides who has won a competition",
                    "vi": "một người quyết định ai đã giành chiến thắng trong một cuộc thi"
                },
                "examples": [
                    {
                        "en": "The judges' decision is final.",
                        "vi": "Quyết định của ban giám khảo là quyết định cuối cùng."
                    },
                    {
                        "en": "She has joined the panel of judges in the popular TV talent show.",
                        "vi": "Cô từng tham gia hội đồng giám khảo trong chương trình truyền hình tìm kiếm tài năng trẻ nổi tiếng."
                    },
                    {
                        "en": "She was invited to be a judge in a cookery competition.",
                        "vi": "Cô được mời làm giám khảo trong một cuộc thi nấu ăn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who has the necessary knowledge or skills to give their opinion about the value or quality of somebody/something",
                    "vi": "một người có kiến thức hoặc kỹ năng cần thiết để đưa ra ý kiến của họ về giá trị hoặc phẩm chất của ai đó / điều gì đó"
                },
                "examples": [
                    {
                        "en": "She's a good judge of character.",
                        "vi": "Cô ấy là một người đánh giá tốt về tính cách."
                    },
                    {
                        "en": "He was a shrewd judge of people.",
                        "vi": "Ông ấy là một quan tòa sắc sảo về con người."
                    },
                    {
                        "en": "The last singer was the best—not that I'm any judge (= I do not know much about the subject).",
                        "vi": "Ca sĩ cuối cùng là người giỏi nhất — không phải tôi là bất kỳ thẩm phán nào (= Tôi không biết nhiều về chủ đề này)."
                    },
                    {
                        "en": "‘I'm not sure that's a good way to do it.’ ‘Let me be the judge of that.’",
                        "vi": "Tôi không chắc đó là một cách tốt để làm điều đó.' 'Hãy để tôi là người phán xét điều đó.'"
                    }
                ]
            }
        ]
    },
    {
        "id": "be82721bd1234b5b927248deb5db3253",
        "word": "authority",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ɔːˈθɒrəti/",
            "us": "/əˈθɔːrəti/"
        },
        "nearby": [
            {
                "word": "authoritative",
                "pos": "adjective"
            },
            {
                "word": "authoritatively",
                "pos": "adverb"
            },
            {
                "word": "authority",
                "pos": "noun"
            },
            {
                "word": "authorization",
                "pos": "noun"
            },
            {
                "word": "authorize",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the power to give orders to people",
                    "vi": "sức mạnh để ra lệnh cho mọi người"
                },
                "examples": [
                    {
                        "en": "in a position of authority",
                        "vi": "ở một vị trí quyền lực"
                    },
                    {
                        "en": "to undermine/challenge somebody's authority",
                        "vi": "phá hoại / thách thức quyền lực của ai đó"
                    },
                    {
                        "en": "authority over somebody/something She now has authority over the people who used to be her bosses.",
                        "vi": "Quyền hạn đối với ai đó / điều gì đó Giờ đây cô ấy có quyền đối với những người từng là sếp của cô ấy."
                    },
                    {
                        "en": "The law states that parents exercise authority over their children.",
                        "vi": "Luật quy định rằng cha mẹ thực hiện quyền đối với con cái của họ."
                    },
                    {
                        "en": "in authority Nothing will be done because no one in authority (= who has a position of power) takes the matter seriously.",
                        "vi": "trong quyền hạn Sẽ không có gì được thực hiện bởi vì không ai trong quyền hạn (= người có chức vụ quyền lực) xem xét vấn đề một cách nghiêm túc."
                    },
                    {
                        "en": "adult authority figures such as parents and teachers",
                        "vi": "những nhân vật có thẩm quyền của người lớn như cha mẹ và giáo viên"
                    }
                ]
            },
            {
                "define": {
                    "en": "the power or right to do something",
                    "vi": "sức mạnh hoặc quyền để làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "Some experts think the agency may have exceeded its authority.",
                        "vi": "Một số chuyên gia cho rằng cơ quan này có thể đã vượt quá thẩm quyền của mình."
                    },
                    {
                        "en": "authority to do something The government has the authority to regulate the economy.",
                        "vi": "thẩm quyền làm điều gì đó Chính phủ có thẩm quyền điều tiết nền kinh tế."
                    },
                    {
                        "en": "The Constitution gives Congress the authority to decide whether to fund military action.",
                        "vi": "Hiến pháp trao cho Quốc hội thẩm quyền quyết định có tài trợ cho các hoạt động quân sự hay không."
                    },
                    {
                        "en": "We have the authority to search this building.",
                        "vi": "Chúng tôi có quyền khám xét tòa nhà này."
                    }
                ]
            },
            {
                "define": {
                    "en": "official permission to do something",
                    "vi": "sự cho phép chính thức để làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "without authority He took the car without authority.",
                        "vi": "không có thẩm quyền Anh ta lấy xe mà không có thẩm quyền."
                    },
                    {
                        "en": "without somebody's authority It was done without the principal's authority.",
                        "vi": "không có quyền hạn của ai đó Việc này được thực hiện mà không có quyền hạn của hiệu trưởng."
                    },
                    {
                        "en": "under the authority of somebody/something We acted under the authority of the UN.",
                        "vi": "dưới quyền của ai đó / cái gì đó Chúng tôi đã hành động dưới quyền của LHQ."
                    }
                ]
            },
            {
                "define": {
                    "en": "the people or an organization who have the power to make decisions or who have a particular area of responsibility in a country or region",
                    "vi": "những người hoặc một tổ chức có quyền ra quyết định hoặc những người có một lĩnh vực trách nhiệm cụ thể trong một quốc gia hoặc khu vực"
                },
                "examples": [
                    {
                        "en": "I have to report this to the authorities.",
                        "vi": "Tôi phải báo cáo việc này với cơ quan chức năng."
                    },
                    {
                        "en": "The health authorities are investigating the problem.",
                        "vi": "Các cơ quan y tế đang điều tra vấn đề."
                    },
                    {
                        "en": "planning/police/immigration authorities",
                        "vi": "lập kế hoạch / cảnh sát / cơ quan xuất nhập cảnh"
                    },
                    {
                        "en": "Aviation authorities say traffic will grow 20 per cent a year.",
                        "vi": "Các nhà chức trách hàng không cho biết lưu lượng sẽ tăng 20% mỗi năm."
                    },
                    {
                        "en": "German authorities arrested the author of the computer virus.",
                        "vi": "Nhà chức trách Đức đã bắt giữ tác giả của virus máy tính."
                    }
                ]
            },
            {
                "define": {
                    "en": "the power to influence people because they respect your knowledge or official position",
                    "vi": "sức mạnh để ảnh hưởng đến mọi người vì họ tôn trọng kiến thức hoặc vị trí chính thức của bạn"
                },
                "examples": [
                    {
                        "en": "with authority He spoke with authority on the topic.",
                        "vi": "với thẩm quyền Anh ấy đã nói với thẩm quyền về chủ đề này."
                    },
                    {
                        "en": "authority to do something the moral authority to run the country",
                        "vi": "thẩm quyền để làm điều gì đó thẩm quyền đạo đức để điều hành đất nước"
                    },
                    {
                        "en": "She bore an air of authority.",
                        "vi": "Cô ấy mang một bầu không khí uy quyền."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person with special knowledge",
                    "vi": "một người có kiến thức đặc biệt"
                },
                "examples": [
                    {
                        "en": "She's an authority on criminal law.",
                        "vi": "Cô ấy là người có thẩm quyền về luật hình sự."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be able to believe something because you trust the person who gave you the information",
                    "vi": "có thể tin vào điều gì đó bởi vì bạn tin tưởng người đã cung cấp thông tin cho bạn"
                },
                "examples": [
                    {
                        "en": "I have it on good authority that he is going to be promoted.",
                        "vi": "Tôi tin rằng anh ấy sẽ được thăng chức."
                    }
                ]
            }
        ]
    },
    {
        "id": "b57cd42582bb436eb2a4a15221bd3ff1",
        "word": "jury",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈdʒʊəri/",
            "us": "/ˈdʒʊri/"
        },
        "nearby": [
            {
                "word": "jurist",
                "pos": "noun"
            },
            {
                "word": "juror",
                "pos": "noun"
            },
            {
                "word": "jury",
                "pos": "noun"
            },
            {
                "word": "jury duty",
                "pos": "noun"
            },
            {
                "word": "juryman",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a group of members of the public who listen to the facts of a case in a court and decide whether or not somebody is guilty of a crime, or whether a claim has been proved",
                    "vi": "một nhóm công chúng lắng nghe sự thật của một vụ án tại tòa án và quyết định xem ai đó có phạm tội hay không hoặc liệu yêu cầu bồi thường đã được chứng minh hay chưa"
                },
                "examples": [
                    {
                        "en": "members of the jury",
                        "vi": "thành viên ban giám khảo"
                    },
                    {
                        "en": "The jury has/have returned a verdict of guilty.",
                        "vi": "Bồi thẩm đoàn đã / đã trả lại bản án có tội."
                    },
                    {
                        "en": "on a jury to be/sit/serve on a jury",
                        "vi": "trên bồi thẩm đoàn để trở thành / ngồi / phục vụ trong bồi thẩm đoàn"
                    },
                    {
                        "en": "by jury the right to trial by jury",
                        "vi": "của bồi thẩm đoàn quyền được xét xử bởi bồi thẩm đoàn"
                    }
                ]
            },
            {
                "define": {
                    "en": "a group of people who decide who is the winner of a competition",
                    "vi": "một nhóm người quyết định ai là người chiến thắng trong một cuộc thi"
                },
                "examples": [
                    {
                        "en": "on a jury He was on the jury for this year's Booker Prize.",
                        "vi": "trên ban giám khảo Anh ấy là thành viên ban giám khảo cho Giải thưởng Booker năm nay."
                    }
                ]
            },
            {
                "define": {
                    "en": "used when you are saying that something is still not certain",
                    "vi": "được sử dụng khi bạn đang nói rằng điều gì đó vẫn chưa chắc chắn"
                },
                "examples": [
                    {
                        "en": "The jury is still out on whether wine can be good for you.",
                        "vi": "Ban giám khảo vẫn chưa biết liệu rượu có tốt cho bạn hay không."
                    }
                ]
            }
        ]
    },
    {
        "id": "a9e06e558d1a44459fa0fdb742d9456f",
        "word": "attorney",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/əˈtɜːni/",
            "us": "/əˈtɜːrni/"
        },
        "nearby": [
            {
                "word": "attn",
                "pos": "abbreviation"
            },
            {
                "word": "atto-",
                "pos": "combining form"
            },
            {
                "word": "attorney",
                "pos": "noun"
            },
            {
                "word": "attorney general",
                "pos": "noun"
            },
            {
                "word": "attract",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a lawyer, especially one who can act for somebody in court",
                    "vi": "một luật sư, đặc biệt là một người có thể hành động cho ai đó trước tòa"
                },
                "examples": [
                    {
                        "en": "The prosecuting attorney began with a short opening statement.",
                        "vi": "Luật sư khởi tố bắt đầu với một tuyên bố mở đầu ngắn."
                    },
                    {
                        "en": "Acting on the advice of his attorney, he remained silent.",
                        "vi": "Thực hiện theo lời khuyên của luật sư, anh ta vẫn im lặng."
                    },
                    {
                        "en": "Consult an attorney whenever you make a major decision affecting your estate.",
                        "vi": "Tham khảo ý kiến luật sư bất cứ khi nào bạn đưa ra quyết định lớn ảnh hưởng đến di sản của mình."
                    },
                    {
                        "en": "Her attorney filed a motion for an injunction.",
                        "vi": "Luật sư của cô đã đệ đơn xin lệnh."
                    },
                    {
                        "en": "Attorneys argued that prosecutors never proved who sent the email.",
                        "vi": "Các luật sư lập luận rằng các công tố viên không bao giờ chứng minh được ai đã gửi email."
                    },
                    {
                        "en": "He fired his court-appointed attorney and began representing himself.",
                        "vi": "Anh ta sa thải luật sư do tòa án chỉ định và bắt đầu đại diện cho chính mình."
                    },
                    {
                        "en": "Army attorneys argued for a general discharge.",
                        "vi": "Các luật sư quân đội tranh luận về việc giải ngũ chung."
                    },
                    {
                        "en": "He hired a high-profile defense attorney to represent him.",
                        "vi": "Anh ta đã thuê một luật sư biện hộ cao cấp để đại diện cho anh ta."
                    },
                    {
                        "en": "He is a practicing family law attorney with years of experience.",
                        "vi": "Ông là một luật sư hành nghề về luật gia đình với nhiều năm kinh nghiệm."
                    },
                    {
                        "en": "Your attorney may advise you to accept a cash settlement.",
                        "vi": "Luật sư của bạn có thể khuyên bạn chấp nhận thanh toán bằng tiền mặt."
                    },
                    {
                        "en": "an attorney specializing in entertainment law",
                        "vi": "một luật sư chuyên về luật giải trí"
                    },
                    {
                        "en": "He had a meeting with a leading Washington criminal defence attorney.",
                        "vi": "Anh ta đã có một cuộc gặp với một luật sư bảo vệ tội phạm hàng đầu của Washington."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who is given the power to act for another person in business or legal matters",
                    "vi": "một người được trao quyền thay người khác trong việc kinh doanh hoặc các vấn đề pháp lý"
                },
                "examples": [
                    {
                        "en": "She was made her father's attorney when he became ill.",
                        "vi": "Cô được làm luật sư cho cha mình khi ông bị ốm."
                    }
                ]
            },
            {
                "define": {
                    "en": "a solicitor (= a lawyer who prepares legal documents and advises on legal matters)",
                    "vi": "a solicitor (= luật sư chuẩn bị các tài liệu pháp lý và tư vấn về các vấn đề pháp lý)"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "091b3db692224791b58feab8b11b5edd",
        "word": "defendant",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/dɪˈfendənt/",
            "us": "/dɪˈfendənt/"
        },
        "nearby": [
            {
                "word": "defend",
                "pos": "verb"
            },
            {
                "word": "defendable",
                "pos": "adjective"
            },
            {
                "word": "defendant",
                "pos": "noun"
            },
            {
                "word": "defender",
                "pos": "noun"
            },
            {
                "word": "Defender of the Faith",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the person in a trial who is accused of committing a crime, or who is being sued by another person",
                    "vi": "người trong phiên tòa bị buộc tội phạm tội hoặc người bị người khác kiện"
                },
                "examples": [
                    {
                        "en": "Several witnesses gave evidence for the defendant.",
                        "vi": "Một số nhân chứng đã đưa ra bằng chứng cho bị cáo."
                    },
                    {
                        "en": "The defendant was charged with disturbing the peace.",
                        "vi": "Bị cáo bị buộc tội gây rối hòa bình."
                    },
                    {
                        "en": "The jury found the defendant guilty on all counts.",
                        "vi": "Bồi thẩm đoàn tuyên bố bị cáo có tội về tất cả các tội danh."
                    },
                    {
                        "en": "The defendant was convicted of murder.",
                        "vi": "Bị cáo bị kết tội giết người."
                    },
                    {
                        "en": "The defendant was sentenced to three years in prison.",
                        "vi": "Bị cáo bị kết án ba năm tù."
                    },
                    {
                        "en": "a defendant being sued by an insurance company",
                        "vi": "một bị đơn bị kiện bởi một công ty bảo hiểm"
                    },
                    {
                        "en": "a defendant in bankruptcy proceedings",
                        "vi": "bị đơn trong thủ tục phá sản"
                    },
                    {
                        "en": "the plaintiff's claim against the defendant",
                        "vi": "yêu cầu của nguyên đơn chống lại bị đơn"
                    }
                ]
            }
        ]
    },
    {
        "id": "155841d254cf49cda5718de8c243d526",
        "word": "gown",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ɡaʊn/",
            "us": "/ɡaʊn/"
        },
        "nearby": [
            {
                "word": "go with",
                "pos": "phrasal verb"
            },
            {
                "word": "go without",
                "pos": "phrasal verb"
            },
            {
                "word": "gown",
                "pos": "noun"
            },
            {
                "word": "gowned",
                "pos": "adjective"
            },
            {
                "word": "goy",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a woman’s dress, especially a long one for special occasions",
                    "vi": "áo dài của phụ nữ, đặc biệt là áo dài cho những dịp đặc biệt"
                },
                "examples": [
                    {
                        "en": "an evening/a wedding gown",
                        "vi": "một buổi tối / áo cưới"
                    },
                    {
                        "en": "She was dressed in a long flowing gown.",
                        "vi": "Cô mặc một chiếc váy dài thướt tha."
                    },
                    {
                        "en": "She wore a white satin gown trimmed with lace.",
                        "vi": "Cô mặc một chiếc váy sa tanh trắng được trang trí bằng ren."
                    }
                ]
            },
            {
                "define": {
                    "en": "a long loose piece of clothing that is worn over other clothes by judges and (in the UK) by other lawyers, and by members of universities (at special ceremonies)",
                    "vi": "một bộ quần áo dài rộng rãi được các thẩm phán và các luật sư khác (ở Vương quốc Anh) và các thành viên của các trường đại học mặc bên ngoài quần áo khác (tại các buổi lễ đặc biệt)"
                },
                "examples": [
                    {
                        "en": "a graduation gown",
                        "vi": "một bộ lễ phục tốt nghiệp"
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of clothing worn in a hospital, either by medical staff during surgery or by a patient, especially as protection against infection",
                    "vi": "một bộ quần áo mặc trong bệnh viện của nhân viên y tế trong khi phẫu thuật hoặc của bệnh nhân, đặc biệt là để bảo vệ chống lại nhiễm trùng"
                },
                "examples": [
                    {
                        "en": "a surgeon’s gown",
                        "vi": "áo choàng của bác sĩ phẫu thuật"
                    }
                ]
            }
        ]
    },
    {
        "id": "d64a7df04341454a8724a78e7a76cbad",
        "word": "hangman",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈhæŋmən/",
            "us": "/ˈhæŋmən/"
        },
        "nearby": [
            {
                "word": "hanging basket",
                "pos": "noun"
            },
            {
                "word": "hanging valley",
                "pos": "noun"
            },
            {
                "word": "hangman",
                "pos": "noun"
            },
            {
                "word": "hangnail",
                "pos": "noun"
            },
            {
                "word": "hang on",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a man whose job is to hang criminals",
                    "vi": "một người đàn ông có công việc là treo cổ tội phạm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a game in which one player chooses a word and the other players try to guess it, letter by letter. Each time they guess wrongly, the first person draws one part of a person being hanged. The other players have to guess the word before the drawing is complete.",
                    "vi": "một trò chơi trong đó một người chơi chọn một từ và những người chơi khác cố gắng đoán từ đó, từng chữ cái. Mỗi lần đoán sai, người thứ nhất vẽ một bộ phận của người bị treo cổ. Những người chơi khác phải đoán từ trước khi hình vẽ hoàn thành."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "14bcb5acf6f04546bd771c2c2d7c78e3",
        "word": "legislature",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈledʒɪslətʃə(r)/",
            "us": "/ˈledʒɪsleɪtʃər/"
        },
        "nearby": [
            {
                "word": "the legislative branch",
                "pos": "noun"
            },
            {
                "word": "legislator",
                "pos": "noun"
            },
            {
                "word": "legislature",
                "pos": "noun"
            },
            {
                "word": "legit",
                "pos": "adjective"
            },
            {
                "word": "legitimacy",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a group of people who have the power to make and change laws",
                    "vi": "một nhóm người có quyền đưa ra và thay đổi luật"
                },
                "examples": [
                    {
                        "en": "a democratically elected legislature",
                        "vi": "một cơ quan lập pháp được bầu một cách dân chủ"
                    },
                    {
                        "en": "the national/state legislature",
                        "vi": "cơ quan lập pháp quốc gia / tiểu bang"
                    }
                ]
            }
        ]
    },
    {
        "id": "f4ca4bc97ebf4a1189cebffa575d47d6",
        "word": "magistrate",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈmædʒɪstreɪt/",
            "us": "/ˈmædʒɪstreɪt/"
        },
        "nearby": [
            {
                "word": "magisterially",
                "pos": "adverb"
            },
            {
                "word": "the magistracy",
                "pos": "noun"
            },
            {
                "word": "magistrate",
                "pos": "noun"
            },
            {
                "word": "magistrates' court",
                "pos": "noun"
            },
            {
                "word": "magma",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an official who acts as a judge in the lowest courts of law",
                    "vi": "một quan chức hoạt động như một thẩm phán trong các tòa án thấp nhất của pháp luật"
                },
                "examples": [
                    {
                        "en": "to come up before the magistrates",
                        "vi": "ra trước các thẩm phán"
                    }
                ]
            }
        ]
    },
    {
        "id": "59352c26cfbb4698a3bdacdd13a3b410",
        "word": "party",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈpɑːti/",
            "us": "/ˈpɑːrti/"
        },
        "nearby": [
            {
                "word": "part with",
                "pos": "phrasal verb"
            },
            {
                "word": "part-work",
                "pos": "noun"
            },
            {
                "word": "party",
                "pos": "noun"
            },
            {
                "word": "party",
                "pos": "verb"
            },
            {
                "word": "party animal",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a social occasion, often in a person’s home, at which people eat, drink, talk, dance and enjoy themselves",
                    "vi": "một dịp xã hội, thường là tại nhà của một người, tại đó mọi người ăn, uống, nói chuyện, khiêu vũ và tận hưởng bản thân"
                },
                "examples": [
                    {
                        "en": "a dinner/tea/cocktail party",
                        "vi": "một bữa tiệc tối / trà / cocktail"
                    },
                    {
                        "en": "at a party I was at a birthday party for my friend's five-year-old daughter.",
                        "vi": "tại một bữa tiệc, tôi đã dự tiệc sinh nhật cho đứa con gái năm tuổi của bạn tôi."
                    },
                    {
                        "en": "to have/throw/give a party",
                        "vi": "để có / ném / cho một bữa tiệc"
                    },
                    {
                        "en": "to hold/host a party",
                        "vi": "tổ chức / tổ chức một bữa tiệc"
                    },
                    {
                        "en": "Did you go to the party?",
                        "vi": "Bạn đã đi đến bữa tiệc?"
                    },
                    {
                        "en": "party games",
                        "vi": "bữa tiệc trò chơi"
                    }
                ]
            },
            {
                "define": {
                    "en": "a political organization that you can vote for in elections and whose members have the same aims and ideas",
                    "vi": "một tổ chức chính trị mà bạn có thể bỏ phiếu trong các cuộc bầu cử và có các thành viên có cùng mục đích và ý tưởng"
                },
                "examples": [
                    {
                        "en": "Do you belong to a political party?",
                        "vi": "Bạn có thuộc một đảng phái chính trị không?"
                    },
                    {
                        "en": "the ruling/opposition party",
                        "vi": "đảng cầm quyền / đối lập"
                    },
                    {
                        "en": "the Democratic/Republican/Conservative/Labour Party",
                        "vi": "Đảng Dân chủ / Cộng hòa / Bảo thủ / Lao động"
                    },
                    {
                        "en": "the party leader/conference",
                        "vi": "lãnh đạo đảng / hội nghị"
                    },
                    {
                        "en": "a party member/activist/official",
                        "vi": "một đảng viên / nhà hoạt động / quan chức"
                    }
                ]
            },
            {
                "define": {
                    "en": "a group of people who are doing something together such as travelling or visiting somewhere",
                    "vi": "một nhóm người đang làm điều gì đó cùng nhau, chẳng hạn như đi du lịch hoặc đi thăm một nơi nào đó"
                },
                "examples": [
                    {
                        "en": "The school is taking a party of 40 children to France.",
                        "vi": "Trường đang tổ chức một bữa tiệc gồm 40 trẻ em đến Pháp."
                    },
                    {
                        "en": "The theatre gives a 10 per cent discount to parties of more than ten.",
                        "vi": "Rạp giảm giá 10% cho các bữa tiệc trên mười người."
                    },
                    {
                        "en": "a rescue/wedding/hunting party",
                        "vi": "một bữa tiệc giải cứu / đám cưới / săn bắn"
                    }
                ]
            },
            {
                "define": {
                    "en": "one of the people or groups of people involved in a legal agreement or argument",
                    "vi": "một trong những người hoặc nhóm người tham gia vào một thỏa thuận hoặc tranh luận pháp lý"
                },
                "examples": [
                    {
                        "en": "the guilty/innocent party",
                        "vi": "bên có tội / bên vô tội"
                    },
                    {
                        "en": "The contract can be terminated by either party with three months' notice.",
                        "vi": "Hợp đồng có thể được chấm dứt bởi một trong hai bên với thông báo trước ba tháng."
                    },
                    {
                        "en": "The judge’s decision satisfied most of the parties concerned.",
                        "vi": "Phán quyết của thẩm phán đã làm hài lòng hầu hết các bên liên quan."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be involved in an agreement or action",
                    "vi": "tham gia vào một thỏa thuận hoặc hành động"
                },
                "examples": [
                    {
                        "en": "to be party to a decision",
                        "vi": "tham gia vào một quyết định"
                    },
                    {
                        "en": "He refused to be a party to any violence.",
                        "vi": "Anh ta từ chối tham gia vào bất kỳ bạo lực nào."
                    }
                ]
            },
            {
                "define": {
                    "en": "to contribute something useful to a discussion, project, etc.",
                    "vi": "để đóng góp một cái gì đó hữu ích cho một cuộc thảo luận, dự án, v.v."
                },
                "examples": [
                    {
                        "en": "What Hislop brought to the party was real commitment and energy.",
                        "vi": "Những gì Hislop mang lại cho bữa tiệc là sự cam kết và năng lượng thực sự."
                    }
                ]
            }
        ]
    },
    {
        "id": "05ca58bc1ae04cc6afa96ee7b7e70305",
        "word": "prosecutor",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈprɒsɪkjuːtə(r)/",
            "us": "/ˈprɑːsɪkjuːtər/"
        },
        "nearby": [
            {
                "word": "prosecute",
                "pos": "verb"
            },
            {
                "word": "prosecution",
                "pos": "noun"
            },
            {
                "word": "prosecutor",
                "pos": "noun"
            },
            {
                "word": "proselytize",
                "pos": "verb"
            },
            {
                "word": "prose poem",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a public official who charges somebody officially with a crime and prosecutes them in court",
                    "vi": "một quan chức chính thức buộc tội ai đó và truy tố họ trước tòa"
                },
                "examples": [
                    {
                        "en": "the public/state prosecutor",
                        "vi": "công tố viên nhà nước / công"
                    }
                ]
            },
            {
                "define": {
                    "en": "a lawyer who leads the case against a defendant in court",
                    "vi": "một luật sư dẫn đầu vụ kiện chống lại bị cáo trước tòa"
                },
                "examples": [
                    {
                        "en": "The prosecutor rose to give the opening address.",
                        "vi": "Công tố viên đứng lên để đưa ra bài phát biểu mở đầu."
                    }
                ]
            }
        ]
    },
    {
        "id": "63e36ebef4c44a20aee635bd7c29bfd5",
        "word": "solicitor",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/səˈlɪsɪtə(r)/",
            "us": "/səˈlɪsɪtər/"
        },
        "nearby": [
            {
                "word": "solicit",
                "pos": "verb"
            },
            {
                "word": "solicitation",
                "pos": "noun"
            },
            {
                "word": "solicitor",
                "pos": "noun"
            },
            {
                "word": "solicitor advocate",
                "pos": "noun"
            },
            {
                "word": "solicitor general",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a lawyer who prepares legal documents, for example for the sale of land or buildings, advises people on legal matters, and can speak for them in some courts of law",
                    "vi": "một luật sư chuẩn bị các tài liệu pháp lý, chẳng hạn như để bán đất hoặc tòa nhà, tư vấn cho mọi người về các vấn đề pháp lý và có thể nói thay họ tại một số tòa án luật"
                },
                "examples": [
                    {
                        "en": "Her first step was to contact a solicitor for advice.",
                        "vi": "Bước đầu tiên của cô là liên hệ với luật sư để được tư vấn."
                    },
                    {
                        "en": "I discussed the matter with my instructing solicitor.",
                        "vi": "Tôi đã thảo luận vấn đề này với luật sư hướng dẫn của tôi."
                    },
                    {
                        "en": "She is still a practising solicitor at the age of sixty-two.",
                        "vi": "Cô ấy vẫn là một luật sư hành nghề ở tuổi sáu mươi hai."
                    },
                    {
                        "en": "There will be no court duty solicitor today.",
                        "vi": "Hôm nay sẽ không có luật sư làm nhiệm vụ của tòa án."
                    },
                    {
                        "en": "Bridge joined the firm as a trainee solicitor.",
                        "vi": "Bridge gia nhập công ty với tư cách là luật sư tập sự."
                    },
                    {
                        "en": "Mr Andrew Davis, solicitor for the Jones family, read a statement.",
                        "vi": "Ông Andrew Davis, luật sư của gia đình Jones, đã đọc một tuyên bố."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person whose job is to visit or phone people and try to sell them something",
                    "vi": "một người có công việc là đến thăm hoặc gọi điện thoại cho mọi người và cố gắng bán cho họ thứ gì đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the most senior legal officer of a city, town or government department",
                    "vi": "quan chức pháp lý cao cấp nhất của thành phố, thị trấn hoặc sở chính phủ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "dfdd890cbc4b4822b74f72a8dd3fcf73",
        "word": "advocate",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈædvəkət/",
            "us": "/ˈædvəkət/"
        },
        "nearby": [
            {
                "word": "advocacy",
                "pos": "noun"
            },
            {
                "word": "advocacy group",
                "pos": "noun"
            },
            {
                "word": "advocate",
                "pos": "noun"
            },
            {
                "word": "advocate",
                "pos": "verb"
            },
            {
                "word": "Adware",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who supports or speaks in favour of somebody or of a public plan or action",
                    "vi": "một người ủng hộ hoặc nói có lợi cho ai đó hoặc cho một kế hoạch hoặc hành động công khai"
                },
                "examples": [
                    {
                        "en": "advocate for something/somebody an advocate for hospital workers",
                        "vi": "ủng hộ điều gì đó / ai đó ủng hộ cho nhân viên bệnh viện"
                    },
                    {
                        "en": "advocate of something/somebody a staunch advocate of free speech",
                        "vi": "ủng hộ điều gì đó / ai đó là người ủng hộ trung thành cho quyền tự do ngôn luận"
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who defends somebody in court",
                    "vi": "một người bảo vệ ai đó trước tòa"
                },
                "examples": [
                    {
                        "en": "Solicitors often appear as advocates in the lower courts.",
                        "vi": "Các luật sư thường xuất hiện với tư cách là người bào chữa ở các tòa án cấp dưới."
                    },
                    {
                        "en": "Those charged should be represented by trained, qualified legal advocates.",
                        "vi": "Những người bị buộc tội phải được đại diện bởi những người ủng hộ pháp lý có trình độ và được đào tạo."
                    }
                ]
            },
            {
                "define": {
                    "en": "(in Scotland and South Africa) a lawyer who has the right to argue cases in higher courts",
                    "vi": "(ở Scotland và Nam Phi) một luật sư có quyền tranh luận các vụ việc tại các tòa án cấp cao hơn"
                },
                "examples": [
                    {
                        "en": "the District Attorney",
                        "vi": "luật sư quận"
                    }
                ]
            }
        ]
    },
    {
        "id": "62cbc7d93af14dc09202e121afea1a1b",
        "word": "bar",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/bɑː(r)/",
            "us": "/bɑːr/"
        },
        "nearby": [
            {
                "word": "baptize",
                "pos": "verb"
            },
            {
                "word": "Bapu",
                "pos": "noun"
            },
            {
                "word": "bar",
                "pos": "noun"
            },
            {
                "word": "bar",
                "pos": "verb"
            },
            {
                "word": "bar",
                "pos": "preposition"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a place where you can buy and drink alcoholic and other drinks",
                    "vi": "nơi bạn có thể mua và uống đồ uống có cồn và các loại đồ uống khác"
                },
                "examples": [
                    {
                        "en": "We arranged to meet in a bar called the Flamingo.",
                        "vi": "Chúng tôi hẹn gặp nhau tại một quán bar tên là Flamingo."
                    },
                    {
                        "en": "The area is full of restaurants and bars.",
                        "vi": "Khu vực này có rất nhiều nhà hàng và quán bar."
                    },
                    {
                        "en": "The bar staff are very friendly.",
                        "vi": "Nhân viên quán rất thân thiện."
                    },
                    {
                        "en": "It's the island’s only licensed bar (= one that is allowed to sell alcoholic drinks).",
                        "vi": "Đây là quán bar được cấp phép duy nhất của hòn đảo (= một quán được phép bán đồ uống có cồn)."
                    },
                    {
                        "en": "(British English) I found David in the bar of the Red Lion (= a room in a pub where drinks are served).",
                        "vi": "(Tiếng Anh Anh) Tôi tìm thấy David trong quán bar của Red Lion (= một căn phòng trong quán rượu nơi phục vụ đồ uống)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a place in which a particular kind of food or drink is the main thing that is served",
                    "vi": "một nơi trong đó một loại thức ăn hoặc đồ uống cụ thể là thứ chính được phục vụ"
                },
                "examples": [
                    {
                        "en": "a sushi bar",
                        "vi": "một quán sushi"
                    },
                    {
                        "en": "The hotel has a cocktail bar on the top floor.",
                        "vi": "Khách sạn có quầy bar phục vụ cocktail trên tầng cao nhất."
                    }
                ]
            },
            {
                "define": {
                    "en": "a long wide wooden surface where drinks, etc. are served",
                    "vi": "một bề mặt gỗ dài rộng, nơi phục vụ đồ uống, v.v."
                },
                "examples": [
                    {
                        "en": "at the bar She was sitting at the bar.",
                        "vi": "ở quán bar Cô ấy đang ngồi ở quán bar."
                    },
                    {
                        "en": "behind the bar He spent the summer working behind the bar at the local pub.",
                        "vi": "sau quầy bar Anh ấy đã dành cả mùa hè để làm việc sau quầy bar tại quán rượu địa phương."
                    },
                    {
                        "en": "It was so crowded I couldn't get to the bar.",
                        "vi": "Nó quá đông nên tôi không thể đến được quán bar."
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of something with straight sides",
                    "vi": "một cái gì đó có các cạnh thẳng"
                },
                "examples": [
                    {
                        "en": "a bar of chocolate/soap",
                        "vi": "một thanh sô cô la / xà phòng"
                    },
                    {
                        "en": "a chocolate bar",
                        "vi": "một thanh sô cô la"
                    },
                    {
                        "en": "(North American English) a candy bar",
                        "vi": "(Tiếng Anh Bắc Mỹ) một thanh kẹo"
                    }
                ]
            },
            {
                "define": {
                    "en": "a long straight piece of metal or wood. Bars are often used to stop somebody from getting through a space.",
                    "vi": "một miếng kim loại hoặc gỗ dài thẳng. Thanh thường được sử dụng để ngăn không cho ai đó đi qua một khoảng trống."
                },
                "examples": [
                    {
                        "en": "He smashed the window with an iron bar.",
                        "vi": "Anh ta đập cửa sổ bằng một thanh sắt."
                    },
                    {
                        "en": "The room was small, with bars on the windows.",
                        "vi": "Căn phòng nhỏ, có song sắt trên cửa sổ."
                    },
                    {
                        "en": "The windows at street level were fitted with bars.",
                        "vi": "Các cửa sổ ở mức đường phố được lắp song sắt."
                    },
                    {
                        "en": "a five-bar gate (= one made with five horizontal bars of wood)",
                        "vi": "một cổng năm thanh (= một cổng được làm bằng năm thanh gỗ ngang)"
                    }
                ]
            },
            {
                "define": {
                    "en": "a long narrow area, usually at the top or side of a computer screen, that contains links or pull-down menus or displays information about the website or program that you are using",
                    "vi": "một khu vực dài hẹp, thường ở đầu hoặc bên cạnh màn hình máy tính, có chứa các liên kết hoặc menu kéo xuống hoặc hiển thị thông tin về trang web hoặc chương trình mà bạn đang sử dụng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the crossbar of a goal",
                    "vi": "xà ngang của mục tiêu"
                },
                "examples": [
                    {
                        "en": "His shot hit the bar.",
                        "vi": "Cú sút của anh ấy đi vọt xà."
                    }
                ]
            },
            {
                "define": {
                    "en": "a band of colour or light",
                    "vi": "dải màu hoặc ánh sáng"
                },
                "examples": [
                    {
                        "en": "Bars of sunlight slanted down from the tall narrow windows.",
                        "vi": "Những tia nắng chiếu xuống từ những ô cửa sổ hẹp cao."
                    }
                ]
            },
            {
                "define": {
                    "en": "a thing that stops somebody from doing something",
                    "vi": "một thứ ngăn cản ai đó làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "At that time being a woman was a bar to promotion in most professions.",
                        "vi": "Vào thời điểm đó, phụ nữ là một thanh để thăng tiến trong hầu hết các ngành nghề."
                    }
                ]
            },
            {
                "define": {
                    "en": "one of the short sections of equal length that a piece of music is divided into, and the notes that are in it",
                    "vi": "một trong những đoạn ngắn có độ dài bằng nhau mà một bản nhạc được chia thành và các nốt trong đó"
                },
                "examples": [
                    {
                        "en": "four beats to the bar",
                        "vi": "bốn nhịp cho thanh"
                    },
                    {
                        "en": "the opening bars of a piece of music",
                        "vi": "thanh mở đầu của một bản nhạc"
                    },
                    {
                        "en": "She played a few bars on the piano.",
                        "vi": "Cô ấy đã chơi một vài thanh trên piano."
                    }
                ]
            },
            {
                "define": {
                    "en": "the profession of barrister (= a lawyer in a higher court)",
                    "vi": "nghề luật sư (= luật sư ở tòa án cấp cao hơn)"
                },
                "examples": [
                    {
                        "en": "to be called to the Bar (= allowed to work as a qualified barrister)",
                        "vi": "được gọi đến Bar (= được phép làm việc như một luật sư đủ điều kiện)"
                    }
                ]
            },
            {
                "define": {
                    "en": "the profession of any kind of lawyer",
                    "vi": "nghề của bất kỳ loại luật sư nào"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a unit for measuring the pressure of the atmosphere, equal to a hundred thousand newtons per square metre",
                    "vi": "một đơn vị đo áp suất của khí quyển, bằng một trăm nghìn niutơn trên mét vuông"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a piece of metal with wire wrapped around it that becomes red and hot when electricity is passed through it",
                    "vi": "một miếng kim loại có dây quấn quanh nó trở nên nóng đỏ khi có dòng điện chạy qua."
                },
                "examples": [
                    {
                        "en": "Switch another bar on if you’re cold.",
                        "vi": "Bật một thanh khác nếu bạn lạnh."
                    }
                ]
            },
            {
                "define": {
                    "en": "in prison",
                    "vi": "trong nhà tù"
                },
                "examples": [
                    {
                        "en": "The murderer is now safely behind bars.",
                        "vi": "Kẻ sát nhân hiện đã an toàn sau song sắt."
                    }
                ]
            },
            {
                "define": {
                    "en": "to set a new, lower standard of quality or performance",
                    "vi": "để thiết lập một tiêu chuẩn mới, thấp hơn về chất lượng hoặc hiệu suất"
                },
                "examples": [
                    {
                        "en": "In the current economic climate we may need to lower the bar on quotas.",
                        "vi": "Trong bối cảnh kinh tế hiện tại, chúng ta có thể cần phải hạ thấp hạn ngạch."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have nothing to do with something",
                    "vi": "không có gì để làm với một cái gì đó"
                },
                "examples": [
                    {
                        "en": "If he tries to sell you his car, don't have a bar of it.",
                        "vi": "Nếu anh ta cố gắng bán cho bạn chiếc xe của anh ta, đừng có quan tâm đến nó."
                    }
                ]
            },
            {
                "define": {
                    "en": "to set a new, higher standard of quality or performance",
                    "vi": "để thiết lập một tiêu chuẩn mới, cao hơn về chất lượng hoặc hiệu suất"
                },
                "examples": [
                    {
                        "en": "The factory has raised the bar on productivity, food safety and quality.",
                        "vi": "Nhà máy đã nâng cao năng suất, chất lượng vệ sinh an toàn thực phẩm."
                    },
                    {
                        "en": "This latest computer game raises the bar for interface design.",
                        "vi": "Trò chơi máy tính mới nhất này nâng cao tiêu chuẩn cho thiết kế giao diện."
                    },
                    {
                        "en": "The awards go to people who have truly raised the bar.",
                        "vi": "Giải thưởng sẽ được trao cho những người đã thực sự nâng tầm."
                    },
                    {
                        "en": "Perhaps the new admission requirements raised the bar too high.",
                        "vi": "Có lẽ các yêu cầu nhập học mới đã nâng mức quá cao."
                    }
                ]
            },
            {
                "define": {
                    "en": "to set a standard of quality or performance",
                    "vi": "để thiết lập một tiêu chuẩn về chất lượng hoặc hiệu suất"
                },
                "examples": [
                    {
                        "en": "The show really sets the bar for artistic invention.",
                        "vi": "Buổi biểu diễn thực sự đặt ra tiêu chuẩn cho sự phát minh nghệ thuật."
                    },
                    {
                        "en": "Sofia sets the bar very high for what she expects of herself.",
                        "vi": "Sofia đặt tiêu chuẩn rất cao cho những gì cô ấy mong đợi ở bản thân."
                    }
                ]
            }
        ]
    },
    {
        "id": "258c114f95be4ccca53c7060c61f3ce4",
        "word": "barrister",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbærɪstə(r)/",
            "us": "/ˈbærɪstər/"
        },
        "nearby": [
            {
                "word": "barring",
                "pos": "preposition"
            },
            {
                "word": "barrio",
                "pos": "noun"
            },
            {
                "word": "barrister",
                "pos": "noun"
            },
            {
                "word": "barroom",
                "pos": "noun"
            },
            {
                "word": "barrow",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a lawyer in the UK who has the right to argue cases in the higher courts of law",
                    "vi": "một luật sư ở Vương quốc Anh, người có quyền tranh luận các vụ việc tại các tòa án luật cấp cao hơn"
                },
                "examples": [
                    {
                        "en": "the barrister for the ferry company",
                        "vi": "luật sư cho công ty phà"
                    },
                    {
                        "en": "Mortimer is still a practising barrister.",
                        "vi": "Mortimer vẫn là một luật sư hành nghề."
                    },
                    {
                        "en": "The barrister for the defendant picked up on this inconsistency.",
                        "vi": "Luật sư cho bị đơn đã nhận ra sự mâu thuẫn này."
                    },
                    {
                        "en": "The solicitor must instruct a barrister to appear before the court.",
                        "vi": "Luật sư phải hướng dẫn một luật sư trình diện trước tòa."
                    }
                ]
            }
        ]
    },
    {
        "id": "266cd6b6fdf54a3bb37bc4f8b64adaa6",
        "word": "complainant",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/kəmˈpleɪnənt/",
            "us": "/kəmˈpleɪnənt/"
        },
        "nearby": [
            {
                "word": "complacently",
                "pos": "adverb"
            },
            {
                "word": "complain",
                "pos": "verb"
            },
            {
                "word": "complainant",
                "pos": "noun"
            },
            {
                "word": "complain of",
                "pos": "phrasal verb"
            },
            {
                "word": "complaint",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who makes a formal complaint against somebody in court",
                    "vi": "một người khiếu nại chính thức chống lại ai đó tại tòa án"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "4d392f4eaa1148668ea8ef03949bc49e",
        "word": "conveyancer",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/kənˈveɪənsə(r)/",
            "us": "/kənˈveɪənsər/"
        },
        "nearby": [
            {
                "word": "convey",
                "pos": "verb"
            },
            {
                "word": "conveyance",
                "pos": "noun"
            },
            {
                "word": "conveyancer",
                "pos": "noun"
            },
            {
                "word": "conveyancing",
                "pos": "noun"
            },
            {
                "word": "conveyor",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a lawyer who is an expert in conveyancing",
                    "vi": "một luật sư là một chuyên gia trong việc chuyển tải"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "b596203c9c3a415eae802c9e0233c4bf",
        "word": "counsel",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkaʊnsl/",
            "us": "/ˈkaʊnsl/"
        },
        "nearby": [
            {
                "word": "council tax",
                "pos": "noun"
            },
            {
                "word": "councilwoman",
                "pos": "noun"
            },
            {
                "word": "counsel",
                "pos": "noun"
            },
            {
                "word": "counsel",
                "pos": "verb"
            },
            {
                "word": "counselling",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "advice, especially given by older people or experts; a piece of advice",
                    "vi": "lời khuyên, đặc biệt được đưa ra bởi những người lớn tuổi hoặc các chuyên gia; một lời khuyên"
                },
                "examples": [
                    {
                        "en": "Listen to the counsel of your elders.",
                        "vi": "Hãy lắng nghe lời khuyên của các trưởng lão."
                    },
                    {
                        "en": "In the end, wiser counsels prevailed.",
                        "vi": "Cuối cùng, những lời khuyên khôn ngoan hơn đã thắng thế."
                    },
                    {
                        "en": "He is there to give you counsel on all matters.",
                        "vi": "Anh ấy ở đó để đưa ra lời khuyên cho bạn về mọi vấn đề."
                    }
                ]
            },
            {
                "define": {
                    "en": "a lawyer or group of lawyers representing somebody in court",
                    "vi": "một luật sư hoặc một nhóm luật sư đại diện cho ai đó trước tòa"
                },
                "examples": [
                    {
                        "en": "to be represented by counsel",
                        "vi": "được đại diện bởi luật sư"
                    },
                    {
                        "en": "the counsel for the defence/prosecution",
                        "vi": "luật sư bào chữa / truy tố"
                    },
                    {
                        "en": "defence/prosecuting counsel",
                        "vi": "luật sư bào chữa / công tố"
                    },
                    {
                        "en": "The court then heard counsel for the dead woman's father.",
                        "vi": "Tòa án sau đó đã nghe luật sư tư vấn cho cha của người phụ nữ đã chết."
                    }
                ]
            },
            {
                "define": {
                    "en": "advice not to try to do something because it is too difficult",
                    "vi": "lời khuyên đừng cố gắng làm điều gì đó vì nó quá khó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "advice that is good but that is difficult or impossible to follow",
                    "vi": "lời khuyên đó là tốt nhưng khó hoặc không thể làm theo"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to keep your opinions, plans, etc. secret",
                    "vi": "để giữ bí mật ý kiến, kế hoạch, v.v. của bạn"
                },
                "examples": [
                    {
                        "en": "Emily doubted what he told her but kept her own counsel.",
                        "vi": "Emily nghi ngờ những gì anh ta nói với cô nhưng vẫn giữ lời khuyên của riêng mình."
                    }
                ]
            }
        ]
    },
    {
        "id": "b63231947c5f4bbf8707920556a02ef7",
        "word": "executioner",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌeksɪˈkjuːʃənə(r)/",
            "us": "/ˌeksɪˈkjuːʃənər/"
        },
        "nearby": [
            {
                "word": "execute",
                "pos": "verb"
            },
            {
                "word": "execution",
                "pos": "noun"
            },
            {
                "word": "executioner",
                "pos": "noun"
            },
            {
                "word": "executive",
                "pos": "noun"
            },
            {
                "word": "executive",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person whose job or role is to kill people as a punishment, especially a public official who executes criminals",
                    "vi": "một người có công việc hoặc vai trò là giết người như một hình phạt, đặc biệt là một công chức thực thi tội phạm"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "084aef962ace4dafbc07990004784403",
        "word": "general counsel",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌdʒenrəl ˈkaʊnsl/",
            "us": "/ˌdʒenrəl ˈkaʊnsl/"
        },
        "nearby": [
            {
                "word": "General Certificate of Education",
                "pos": "noun"
            },
            {
                "word": "General Certificate of Secondary Education",
                "pos": "noun"
            },
            {
                "word": "general counsel",
                "pos": "noun"
            },
            {
                "word": "general delivery",
                "pos": "noun"
            },
            {
                "word": "general election",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "(in the US) the main lawyer who gives legal advice to a company",
                    "vi": "(ở Mỹ) luật sư chính tư vấn pháp lý cho một công ty"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "3e8d1358431b48b38af9641867c0bc31",
        "word": "JP",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌdʒeɪ ˈpiː/",
            "us": "/ˌdʒeɪ ˈpiː/"
        },
        "nearby": [
            {
                "word": "joyriding",
                "pos": "noun"
            },
            {
                "word": "joystick",
                "pos": "noun"
            },
            {
                "word": "JP",
                "pos": "noun"
            },
            {
                "word": "JPEG",
                "pos": "noun"
            },
            {
                "word": "Jr",
                "pos": "abbreviation"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "Justice of the Peace",
                    "vi": "Công lý của hòa bình"
                },
                "examples": [
                    {
                        "en": "Helen Alvey JP",
                        "vi": "Helen Alvey JP"
                    },
                    {
                        "en": "She became a JP in 1939.",
                        "vi": "Cô trở thành JP vào năm 1939."
                    }
                ]
            }
        ]
    },
    {
        "id": "c4de900bf6f84b51ad6aa00278f85831",
        "word": "judiciary",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/dʒuˈdɪʃəri/",
            "us": "/dʒuˈdɪʃieri/"
        },
        "nearby": [
            {
                "word": "judicial restraint",
                "pos": "noun"
            },
            {
                "word": "judicial review",
                "pos": "noun"
            },
            {
                "word": "judiciary",
                "pos": "noun"
            },
            {
                "word": "judicious",
                "pos": "adjective"
            },
            {
                "word": "judiciously",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the judges of a country or a state, when they are considered as a group",
                    "vi": "các thẩm phán của một quốc gia hoặc một tiểu bang, khi họ được coi là một nhóm"
                },
                "examples": [
                    {
                        "en": "an independent judiciary",
                        "vi": "một cơ quan tư pháp độc lập"
                    }
                ]
            }
        ]
    },
    {
        "id": "e33781bcc52b40c09b8e4de41fb5da29",
        "word": "jurist",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈdʒʊərɪst/",
            "us": "/ˈdʒʊrɪst/"
        },
        "nearby": [
            {
                "word": "jurisdictional",
                "pos": "adjective"
            },
            {
                "word": "jurisprudence",
                "pos": "noun"
            },
            {
                "word": "jurist",
                "pos": "noun"
            },
            {
                "word": "juror",
                "pos": "noun"
            },
            {
                "word": "jury",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who is an expert in law",
                    "vi": "một người là một chuyên gia về luật"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c36f28741b7948f0acc72ed4bc0ec8b6",
        "word": "Justice of the Peace",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌdʒʌstɪs əv ðə ˈpiːs/",
            "us": "/ˌdʒʌstɪs əv ðə ˈpiːs/"
        },
        "nearby": [
            {
                "word": "just",
                "pos": "adjective"
            },
            {
                "word": "justice",
                "pos": "noun"
            },
            {
                "word": "Justice of the Peace",
                "pos": "noun"
            },
            {
                "word": "justiciary",
                "pos": "noun"
            },
            {
                "word": "justifiable",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an official who acts as a judge in the lowest courts of law",
                    "vi": "một quan chức hoạt động như một thẩm phán trong các tòa án thấp nhất của pháp luật"
                },
                "examples": [
                    {
                        "en": "In 1579 he was appointed Justice of the Peace for Kent.",
                        "vi": "Năm 1579, ông được bổ nhiệm làm Công lý của Hòa bình cho Kent."
                    }
                ]
            }
        ]
    },
    {
        "id": "8f976a5a898b44589d3d428af5099023",
        "word": "litigator",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈlɪtɪɡeɪtə(r)/",
            "us": "/ˈlɪtɪɡeɪtər/"
        },
        "nearby": [
            {
                "word": "litigate",
                "pos": "verb"
            },
            {
                "word": "litigation",
                "pos": "noun"
            },
            {
                "word": "litigator",
                "pos": "noun"
            },
            {
                "word": "litigious",
                "pos": "adjective"
            },
            {
                "word": "litigiousness",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who takes a claim or disagreement to court",
                    "vi": "một người yêu cầu bồi thường hoặc không đồng ý với tòa án"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "dc491e1c22d948d08a97a933edf82926",
        "word": "the magistracy",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ðə ˈmædʒɪstrəsi/",
            "us": "/ðə ˈmædʒɪstrəsi/"
        },
        "nearby": [
            {
                "word": "magisterial",
                "pos": "adjective"
            },
            {
                "word": "magisterially",
                "pos": "adverb"
            },
            {
                "word": "the magistracy",
                "pos": "noun"
            },
            {
                "word": "magistrate",
                "pos": "noun"
            },
            {
                "word": "magistrates' court",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "magistrates as a group",
                    "vi": "thẩm phán như một nhóm"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "674b2a90a837438d83d48cc57a3a5380",
        "word": "McKenzie friend",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/məˈkenzi frend/",
            "us": "/məˈkenzi frend/"
        },
        "nearby": [
            {
                "word": "William McGonagall",
                "pos": ""
            },
            {
                "word": "McGuffey's Readers",
                "pos": ""
            },
            {
                "word": "McKenzie friend",
                "pos": "noun"
            },
            {
                "word": "Mount McKinley",
                "pos": ""
            },
            {
                "word": "William McKinley",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who attends a trial to assist somebody who does not have an official legal representative",
                    "vi": "một người tham dự phiên tòa để hỗ trợ ai đó không có đại diện pháp lý chính thức"
                },
                "examples": [
                    {
                        "en": "I acted as a McKenzie friend for a friend's husband in a tribunal.",
                        "vi": "Tôi đã đóng vai một người bạn của McKenzie cho chồng của một người bạn trong một phiên tòa xét xử."
                    },
                    {
                        "en": "As a McKenzie friend, he can pass notes, suggest questions and provide general support to Mrs Ashley.",
                        "vi": "Là một người bạn của McKenzie, anh ấy có thể chuyển ghi chú, gợi ý câu hỏi và hỗ trợ chung cho bà Ashley."
                    }
                ]
            }
        ]
    },
    {
        "id": "4abc48efa77140628d53434e62886383",
        "word": "notary",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈnəʊtəri/",
            "us": "/ˈnəʊtəri/"
        },
        "nearby": [
            {
                "word": "not agree with",
                "pos": "phrasal verb"
            },
            {
                "word": "notarize",
                "pos": "verb"
            },
            {
                "word": "notary",
                "pos": "noun"
            },
            {
                "word": "notation",
                "pos": "noun"
            },
            {
                "word": "not care for",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person, especially a lawyer, with official authority to be a witness when somebody signs a document and to make this document legally acceptable",
                    "vi": "một người, đặc biệt là luật sư, có thẩm quyền chính thức để làm nhân chứng khi ai đó ký vào tài liệu và để tài liệu này được chấp nhận về mặt pháp lý"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "b0efa4e03a2e4974b49bf73236cfed10",
        "word": "plaintiff",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpleɪntɪf/",
            "us": "/ˈpleɪntɪf/"
        },
        "nearby": [
            {
                "word": "plaint",
                "pos": "noun"
            },
            {
                "word": "plain text",
                "pos": "noun"
            },
            {
                "word": "plaintiff",
                "pos": "noun"
            },
            {
                "word": "plaintive",
                "pos": "adjective"
            },
            {
                "word": "plaintively",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who makes a formal complaint against somebody in court",
                    "vi": "một người khiếu nại chính thức chống lại ai đó tại tòa án"
                },
                "examples": [
                    {
                        "en": "The court upheld the plaintiff’s claim for damages.",
                        "vi": "Tòa giữ nguyên yêu cầu bồi thường thiệt hại của nguyên đơn."
                    },
                    {
                        "en": "The plaintiff must prove that the defendant was negligent.",
                        "vi": "Nguyên đơn phải chứng minh rằng bị đơn đã cẩu thả."
                    }
                ]
            }
        ]
    },
    {
        "id": "94b116f2b73a45eeae48feeae585c27d",
        "word": "public defender",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌpʌblɪk dɪˈfendə(r)/",
            "us": "/ˌpʌblɪk dɪˈfendər/"
        },
        "nearby": [
            {
                "word": "public convenience",
                "pos": "noun"
            },
            {
                "word": "public corporation",
                "pos": "noun"
            },
            {
                "word": "public defender",
                "pos": "noun"
            },
            {
                "word": "public domain",
                "pos": "noun"
            },
            {
                "word": "public education",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "(in the US) a lawyer who is paid by the government to defend people in court if they cannot pay for a lawyer themselves",
                    "vi": "(ở Mỹ) một luật sư được chính phủ trả tiền để bào chữa cho những người trước tòa nếu họ không thể tự trả tiền cho một luật sư"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "07caa0c66ee54f1c8ecd0f1751ef7972",
        "word": "public prosecutor",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌpʌblɪk ˈprɒsɪkjuːtə(r)/",
            "us": "/ˌpʌblɪk ˈprɑːsɪkjuːtər/"
        },
        "nearby": [
            {
                "word": "the Public Order Act",
                "pos": ""
            },
            {
                "word": "public property",
                "pos": "noun"
            },
            {
                "word": "public prosecutor",
                "pos": "noun"
            },
            {
                "word": "public radio",
                "pos": "noun"
            },
            {
                "word": "the Public Record Office",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a lawyer who works for the government and tries to prove people guilty in court",
                    "vi": "một luật sư làm việc cho chính phủ và cố gắng chứng minh mọi người có tội trước tòa"
                },
                "examples": []
            }
        ]
    }
]