[
    {
        "id": "154c8dd7e88049cc9b7ab786d96efa8f",
        "word": "style",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/staɪl/",
            "us": "/staɪl/"
        },
        "nearby": [
            {
                "word": "sty",
                "pos": "noun"
            },
            {
                "word": "Stygian",
                "pos": "adjective"
            },
            {
                "word": "style",
                "pos": "noun"
            },
            {
                "word": "style",
                "pos": "verb"
            },
            {
                "word": "style on",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the particular way in which something is done",
                    "vi": "cách cụ thể trong đó một cái gì đó được thực hiện"
                },
                "examples": [
                    {
                        "en": "a wide range of musical styles",
                        "vi": "một loạt các phong cách âm nhạc"
                    },
                    {
                        "en": "They want a wide range of learning resources to suit different learning styles.",
                        "vi": "Họ muốn có nhiều nguồn tài liệu học tập để phù hợp với các phong cách học tập khác nhau."
                    },
                    {
                        "en": "a management style",
                        "vi": "một phong cách quản lý"
                    },
                    {
                        "en": "style of something a style of management",
                        "vi": "phong cách của một cái gì đó một phong cách quản lý"
                    },
                    {
                        "en": "furniture to suit your style of living",
                        "vi": "đồ nội thất phù hợp với phong cách sống của bạn"
                    },
                    {
                        "en": "His aggressive style of play sometimes gets him in trouble.",
                        "vi": "Phong cách thi đấu hung hãn của anh ấy đôi khi khiến anh ấy gặp rắc rối."
                    },
                    {
                        "en": "I really enjoy playing this style of music.",
                        "vi": "Tôi thực sự thích chơi phong cách âm nhạc này."
                    },
                    {
                        "en": "I like your style (= I like the way you do things).",
                        "vi": "I like your style (= Tôi thích cách bạn làm mọi việc)."
                    },
                    {
                        "en": "Caution was not her style (= not the way she usually behaved).",
                        "vi": "Thận trọng không phải là phong cách của cô ấy (= không phải cách cô ấy thường cư xử)."
                    },
                    {
                        "en": "I'm surprised he rides a motorbike—I'd have thought big cars were more his style (= what suited him).",
                        "vi": "Tôi ngạc nhiên khi anh ấy đi xe máy - Tôi đã nghĩ rằng những chiếc xe lớn phù hợp với phong cách của anh ấy hơn (= những gì phù hợp với anh ấy)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a particular design of something, especially clothes",
                    "vi": "một thiết kế cụ thể của một cái gì đó, đặc biệt là quần áo"
                },
                "examples": [
                    {
                        "en": "We stock a wide variety of styles and sizes.",
                        "vi": "Chúng tôi có rất nhiều kiểu dáng và kích cỡ khác nhau."
                    },
                    {
                        "en": "Have you thought about having your hair in a shorter style?",
                        "vi": "Bạn đã nghĩ đến việc để tóc theo kiểu ngắn hơn chưa?"
                    },
                    {
                        "en": "a style that was popular in the 1950s",
                        "vi": "một phong cách phổ biến vào những năm 1950"
                    }
                ]
            },
            {
                "define": {
                    "en": "the quality of being fashionable in the clothes that you wear",
                    "vi": "chất lượng thời trang của quần áo bạn mặc"
                },
                "examples": [
                    {
                        "en": "style-conscious teenagers",
                        "vi": "thanh thiếu niên có ý thức về phong cách"
                    },
                    {
                        "en": "Some people have no sense of style.",
                        "vi": "Một số người không có ý thức về phong cách."
                    },
                    {
                        "en": "in style Short skirts are back in style (= fashionable).",
                        "vi": "theo phong cách Váy ngắn đã trở lại trong phong cách (= thời trang)."
                    },
                    {
                        "en": "They still refer to her as a style guru and a trend-setter.",
                        "vi": "Họ vẫn coi cô ấy là một phong cách sành điệu và một người bắt kịp xu hướng."
                    }
                ]
            },
            {
                "define": {
                    "en": "the quality of being attractive and made or done to a high standard",
                    "vi": "chất lượng hấp dẫn và được thực hiện hoặc thực hiện với tiêu chuẩn cao"
                },
                "examples": [
                    {
                        "en": "The hotel has been redecorated but it's lost a lot of its style.",
                        "vi": "Khách sạn đã được trang trí lại nhưng nó đã mất đi rất nhiều phong cách."
                    },
                    {
                        "en": "This movie is all surface style and no substance.",
                        "vi": "Phim này toàn là phong cách bề nổi và không có thực chất."
                    },
                    {
                        "en": "She does everything with style and grace.",
                        "vi": "Cô ấy làm mọi thứ với phong cách và sự duyên dáng."
                    }
                ]
            },
            {
                "define": {
                    "en": "the features of a book, painting, building, etc. that make it typical of a particular author, artist, historical period, etc.",
                    "vi": "các tính năng của một cuốn sách, bức tranh, tòa nhà, v.v. làm cho cuốn sách đó trở thành tiêu biểu của một tác giả, nghệ sĩ cụ thể, giai đoạn lịch sử, v.v."
                },
                "examples": [
                    {
                        "en": "style (of something) a style of architecture",
                        "vi": "phong cách (của cái gì đó) một phong cách kiến trúc"
                    },
                    {
                        "en": "a fine example of Gothic style",
                        "vi": "một ví dụ điển hình về phong cách Gothic"
                    },
                    {
                        "en": "The film has a unique visual style.",
                        "vi": "Bộ phim có một phong cách hình ảnh độc đáo."
                    },
                    {
                        "en": "He developed a distinctive style of painting.",
                        "vi": "Ông đã phát triển một phong cách hội họa đặc biệt."
                    },
                    {
                        "en": "in the style of somebody/something a parody written in the style of Molière",
                        "vi": "theo phong cách của ai đó / một thứ gì đó nhại được viết theo phong cách của Molière"
                    },
                    {
                        "en": "The palace was rebuilt in the same style.",
                        "vi": "Cung điện được xây dựng lại theo cùng một phong cách."
                    }
                ]
            },
            {
                "define": {
                    "en": "the correct use of language",
                    "vi": "sử dụng đúng ngôn ngữ"
                },
                "examples": [
                    {
                        "en": "It's not considered good style to start a sentence with ‘but’.",
                        "vi": "Nó không được coi là phong cách tốt để bắt đầu một câu bằng 'nhưng'."
                    },
                    {
                        "en": "Please follow house style (= the rules of spelling, etc. used by a particular publishing company).",
                        "vi": "Vui lòng tuân theo kiểu nội dung (= quy tắc chính tả, v.v. được sử dụng bởi một công ty xuất bản cụ thể)."
                    }
                ]
            },
            {
                "define": {
                    "en": "having the type of style mentioned",
                    "vi": "có loại phong cách được đề cập"
                },
                "examples": [
                    {
                        "en": "Italian-style gardens",
                        "vi": "Khu vườn kiểu Ý"
                    },
                    {
                        "en": "a buffet-style breakfast",
                        "vi": "bữa sáng kiểu tự chọn"
                    }
                ]
            },
            {
                "define": {
                    "en": "the long, thin part of a flower that carries the stigma",
                    "vi": "phần dài, mỏng của hoa mang đầu nhụy."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to stop somebody from behaving in the way they want to",
                    "vi": "để ngăn ai đó cư xử theo cách họ muốn"
                },
                "examples": [
                    {
                        "en": "She didn’t want me to go with her to the party in case I cramped her style.",
                        "vi": "Cô ấy không muốn tôi đi cùng cô ấy đến bữa tiệc trong trường hợp tôi hạn chế phong cách của cô ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "in an impressive way",
                    "vi": "theo một cách ấn tượng"
                },
                "examples": [
                    {
                        "en": "She always celebrates her birthday in style.",
                        "vi": "Cô ấy luôn tổ chức sinh nhật theo phong cách riêng."
                    },
                    {
                        "en": "He won the championship in great style.",
                        "vi": "Anh ấy đã giành chức vô địch bằng phong cách tuyệt vời."
                    }
                ]
            }
        ]
    },
    {
        "id": "b24b5d11e8e64c60834d9b965ef8e308",
        "word": "designer",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/dɪˈzaɪnə(r)/",
            "us": "/dɪˈzaɪnər/"
        },
        "nearby": [
            {
                "word": "designation",
                "pos": "noun"
            },
            {
                "word": "the Design Council",
                "pos": ""
            },
            {
                "word": "designer",
                "pos": "noun"
            },
            {
                "word": "designer",
                "pos": "adjective"
            },
            {
                "word": "designer baby",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person whose job is to decide how things such as clothes, furniture, tools, etc. will look or work by making drawings, plans or patterns",
                    "vi": "một người có công việc là quyết định những thứ như quần áo, đồ đạc, công cụ, v.v. sẽ trông như thế nào hoặc hoạt động như thế nào bằng cách lập các bản vẽ, kế hoạch hoặc mẫu"
                },
                "examples": [
                    {
                        "en": "one of the country's top fashion designers",
                        "vi": "một trong những nhà thiết kế thời trang hàng đầu của đất nước"
                    },
                    {
                        "en": "a graphic/web/game designer",
                        "vi": "một nhà thiết kế đồ họa / web / trò chơi"
                    }
                ]
            }
        ]
    },
    {
        "id": "6c57135cd7724e6d9d41d735dbd9b7fc",
        "word": "fashion",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈfæʃn/",
            "us": "/ˈfæʃn/"
        },
        "nearby": [
            {
                "word": "fascist",
                "pos": "adjective"
            },
            {
                "word": "fascist",
                "pos": "noun"
            },
            {
                "word": "fashion",
                "pos": "noun"
            },
            {
                "word": "fashion",
                "pos": "verb"
            },
            {
                "word": "fashionable",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a popular style of clothes, hair, etc. at a particular time or place; the state of being popular",
                    "vi": "kiểu quần áo, đầu tóc, v.v. phổ biến tại một thời điểm hoặc địa điểm cụ thể; tình trạng phổ biến"
                },
                "examples": [
                    {
                        "en": "the latest fashion trends",
                        "vi": "xu hướng thời trang mới nhất"
                    },
                    {
                        "en": "the new season’s fashions",
                        "vi": "thời trang của mùa mới"
                    },
                    {
                        "en": "in fashion Jeans are always in fashion.",
                        "vi": "trong thời trang Quần jean luôn luôn trong thời trang."
                    },
                    {
                        "en": "Long skirts have come into fashion again.",
                        "vi": "Váy dài đã trở lại thành mốt."
                    },
                    {
                        "en": "Some styles never go out of fashion.",
                        "vi": "Một số phong cách không bao giờ lỗi mốt."
                    }
                ]
            },
            {
                "define": {
                    "en": "the business of making or selling clothes in new and different styles",
                    "vi": "kinh doanh may hoặc bán quần áo theo phong cách mới và khác nhau"
                },
                "examples": [
                    {
                        "en": "They all want to work in fashion.",
                        "vi": "Tất cả họ đều muốn làm việc trong lĩnh vực thời trang."
                    },
                    {
                        "en": "household names in the world of fashion and design",
                        "vi": "những cái tên gia dụng trong thế giới thời trang và thiết kế"
                    },
                    {
                        "en": "a fashion magazine",
                        "vi": "tạp chí thời trang"
                    },
                    {
                        "en": "the fashion industry",
                        "vi": "ngành công nghiệp thời trang"
                    }
                ]
            },
            {
                "define": {
                    "en": "a popular way of behaving, doing an activity, etc.",
                    "vi": "một cách phổ biến để cư xử, thực hiện một hoạt động, v.v."
                },
                "examples": [
                    {
                        "en": "This theory, though recent, is more than a passing fashion.",
                        "vi": "Lý thuyết này, mặc dù gần đây, không phải là một thời trang đang trôi qua."
                    },
                    {
                        "en": "fashion in something Fashions in art and literature come and go.",
                        "vi": "thời trang trong một cái gì đó Thời trang trong nghệ thuật và văn học đến và đi."
                    },
                    {
                        "en": "fashion for something He seemed to endorse the current fashion for neoliberal economics.",
                        "vi": "thời trang cho một cái gì đó Ông dường như tán thành thời trang hiện tại cho kinh tế học tân tự do."
                    },
                    {
                        "en": "fashion for doing something The fashion at the time was for teaching mainly the written language.",
                        "vi": "thời trang để làm một cái gì đó Thời trang vào thời điểm đó là để dạy chủ yếu là ngôn ngữ viết."
                    }
                ]
            },
            {
                "define": {
                    "en": "to some extent, but not very well",
                    "vi": "ở một mức độ nào đó, nhưng không tốt lắm"
                },
                "examples": [
                    {
                        "en": "I can play the piano, after a fashion.",
                        "vi": "Tôi có thể chơi piano, sau một thời trang."
                    },
                    {
                        "en": "‘Do you speak French?’ ‘After a fashion.’",
                        "vi": "Bạn có nói tiếng Pháp không?' 'Sau một thời trang.'"
                    },
                    {
                        "en": "So they became friends, after a fashion.",
                        "vi": "Vì vậy, họ đã trở thành bạn bè, sau một thời trang."
                    }
                ]
            },
            {
                "define": {
                    "en": "in the style of somebody/something",
                    "vi": "theo phong cách của ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "The new library is very much after the fashion of Nash.",
                        "vi": "Thư viện mới rất nhiều sau thời trang của Nash."
                    },
                    {
                        "en": "She spoke in French after the fashion of the court.",
                        "vi": "Cô ấy nói bằng tiếng Pháp sau thời trang của tòa án."
                    }
                ]
            },
            {
                "define": {
                    "en": "in a particular way",
                    "vi": "theo một cách cụ thể"
                },
                "examples": [
                    {
                        "en": "How could they behave in such a fashion?",
                        "vi": "Làm sao họ có thể cư xử theo kiểu như vậy?"
                    },
                    {
                        "en": "I strive to get my work done in a timely fashion.",
                        "vi": "Tôi cố gắng hoàn thành công việc của mình một cách kịp thời."
                    },
                    {
                        "en": "The troops embarked in an orderly fashion.",
                        "vi": "Các đoàn quân ra quân có trật tự."
                    },
                    {
                        "en": "Each chapter is structured in a similar fashion.",
                        "vi": "Mỗi chương được cấu trúc theo một kiểu tương tự."
                    },
                    {
                        "en": "She was proved right, in dramatic fashion, when the whole department resigned.",
                        "vi": "Cô ấy đã được chứng minh là đúng, một cách đầy kịch tính, khi toàn bộ bộ phận từ chức."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to emphasize that somebody is doing something or using something a lot",
                    "vi": "được sử dụng để nhấn mạnh rằng ai đó đang làm một cái gì đó hoặc sử dụng một cái gì đó rất nhiều"
                },
                "examples": [
                    {
                        "en": "She's been spending money like it's going out of fashion.",
                        "vi": "Cô ấy đã tiêu tiền như thể nó không còn hợp thời."
                    }
                ]
            }
        ]
    },
    {
        "id": "04aed1bc28d14c84bb46d0898c76a952",
        "word": "fashion designer",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈfæʃn dɪzaɪnə(r)/",
            "us": "/ˈfæʃn dɪzaɪnər/"
        },
        "nearby": [
            {
                "word": "fashionably",
                "pos": "adverb"
            },
            {
                "word": "fashion-conscious",
                "pos": "adjective"
            },
            {
                "word": "fashion designer",
                "pos": "noun"
            },
            {
                "word": "fashion-forward",
                "pos": "adjective"
            },
            {
                "word": "fashionista",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who designs fashionable clothes",
                    "vi": "một người thiết kế quần áo thời trang"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "eb158ad2bd89453aac6445d8f710051e",
        "word": "model",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈmɒdl/",
            "us": "/ˈmɑːdl/"
        },
        "nearby": [
            {
                "word": "modding",
                "pos": "noun"
            },
            {
                "word": "mode",
                "pos": "noun"
            },
            {
                "word": "model",
                "pos": "noun"
            },
            {
                "word": "model",
                "pos": "verb"
            },
            {
                "word": "model after",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a copy of something, usually smaller than the original object",
                    "vi": "bản sao của một thứ gì đó, thường nhỏ hơn đối tượng gốc"
                },
                "examples": [
                    {
                        "en": "a working model (= one in which the parts move) of a fire engine",
                        "vi": "một mô hình hoạt động (= một mô hình trong đó các bộ phận chuyển động) của xe chữa cháy"
                    },
                    {
                        "en": "I used to build model aeroplanes.",
                        "vi": "Tôi đã từng chế tạo máy bay mô hình."
                    },
                    {
                        "en": "The architect had produced a scale model of the proposed shopping complex.",
                        "vi": "Kiến trúc sư đã đưa ra một mô hình quy mô của khu phức hợp mua sắm được đề xuất."
                    }
                ]
            },
            {
                "define": {
                    "en": "something such as a text or a system that can be used as an example for other people to copy",
                    "vi": "một cái gì đó chẳng hạn như một văn bản hoặc một hệ thống có thể được sử dụng làm ví dụ để người khác sao chép"
                },
                "examples": [
                    {
                        "en": "Look at the writing model on page 58.",
                        "vi": "Nhìn vào mô hình viết ở trang 58."
                    },
                    {
                        "en": "a model text/essay",
                        "vi": "một văn bản / bài luận mẫu"
                    },
                    {
                        "en": "The nation's constitution provided a model that other countries followed.",
                        "vi": "Hiến pháp của quốc gia đã đưa ra một mô hình mà các quốc gia khác noi theo."
                    },
                    {
                        "en": "Different funding models are used in schools.",
                        "vi": "Các mô hình tài trợ khác nhau được sử dụng trong các trường học."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person or thing that is considered an excellent example of something",
                    "vi": "một người hoặc sự vật được coi là một ví dụ xuất sắc về điều gì đó"
                },
                "examples": [
                    {
                        "en": "It was a model of clarity.",
                        "vi": "Đó là một mô hình rõ ràng."
                    },
                    {
                        "en": "He's a model student.",
                        "vi": "Anh ấy là một học sinh gương mẫu."
                    },
                    {
                        "en": "a model farm (= one that has been specially designed to work well)",
                        "vi": "một trang trại kiểu mẫu (= một trang trại được thiết kế đặc biệt để hoạt động tốt)"
                    }
                ]
            },
            {
                "define": {
                    "en": "a person whose job is to wear and show new styles of clothes and be photographed wearing them",
                    "vi": "một người có công việc là mặc và trình diễn những kiểu quần áo mới và được chụp ảnh khi mặc chúng"
                },
                "examples": [
                    {
                        "en": "She had a successful career as a fashion model.",
                        "vi": "Cô đã có một sự nghiệp thành công với tư cách là một người mẫu thời trang."
                    },
                    {
                        "en": "He was a former male model who became a movie star.",
                        "vi": "Anh ấy là một cựu người mẫu nam, sau đó đã trở thành một ngôi sao điện ảnh."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who is employed to be painted, drawn, photographed, etc. by an artist or photographer",
                    "vi": "một người được thuê để vẽ, vẽ, chụp ảnh, v.v. bởi một nghệ sĩ hoặc nhiếp ảnh gia"
                },
                "examples": [
                    {
                        "en": "The model sits for me for three hours every day.",
                        "vi": "Người mẫu ngồi cho tôi ba giờ mỗi ngày."
                    }
                ]
            },
            {
                "define": {
                    "en": "a particular design or type of product",
                    "vi": "một thiết kế hoặc loại sản phẩm cụ thể"
                },
                "examples": [
                    {
                        "en": "The latest models will be on display at the motor show.",
                        "vi": "Những mẫu xe mới nhất sẽ được trưng bày tại triển lãm xe máy."
                    }
                ]
            },
            {
                "define": {
                    "en": "a way of running a business, based on a particular way of getting the money you need and identifying and reaching your customers; a type of business model",
                    "vi": "một cách điều hành một doanh nghiệp, dựa trên một cách cụ thể để nhận được số tiền bạn cần và xác định và tiếp cận khách hàng của bạn; một loại mô hình kinh doanh"
                },
                "examples": [
                    {
                        "en": "They may abandon the traditional cooperative model.",
                        "vi": "Họ có thể từ bỏ mô hình hợp tác xã truyền thống."
                    },
                    {
                        "en": "under a… model Under a subscription model, consumers will typically pay a monthly fee to access the online library.",
                        "vi": "theo mô hình… Theo mô hình đăng ký, người tiêu dùng thường sẽ trả một khoản phí hàng tháng để truy cập thư viện trực tuyến."
                    }
                ]
            },
            {
                "define": {
                    "en": "a simple description of a system, used for explaining how something works or calculating what might happen, etc.",
                    "vi": "một mô tả đơn giản về hệ thống, được sử dụng để giải thích cách hoạt động của một thứ gì đó hoặc tính toán những gì có thể xảy ra, v.v."
                },
                "examples": [
                    {
                        "en": "the standard economic model of supply and demand",
                        "vi": "mô hình kinh tế tiêu chuẩn của cung và cầu"
                    },
                    {
                        "en": "to propose/construct/test a model",
                        "vi": "đề xuất / xây dựng / thử nghiệm một mô hình"
                    },
                    {
                        "en": "She developed a computer model to help farmers with pest control.",
                        "vi": "Cô đã phát triển một mô hình máy tính để giúp nông dân kiểm soát sâu bệnh."
                    },
                    {
                        "en": "a mathematical model for determining the safe level of pesticides in food",
                        "vi": "một mô hình toán học để xác định mức độ an toàn của thuốc trừ sâu trong thực phẩm"
                    },
                    {
                        "en": "according to a model According to this model, by the middle of the century temperatures will rise by 1–3℃.",
                        "vi": "theo một mô hình Theo mô hình này, vào giữa thế kỷ này, nhiệt độ sẽ tăng 1–3 ℃."
                    }
                ]
            }
        ]
    },
    {
        "id": "b94bee2843584550b87cb3ffe77c9bc1",
        "word": "designer",
        "pos": "adjective",
        "level": "b1",
        "phonetic": {
            "uk": "/dɪˈzaɪnə(r)/",
            "us": "/dɪˈzaɪnər/"
        },
        "nearby": [
            {
                "word": "the Design Council",
                "pos": ""
            },
            {
                "word": "designer",
                "pos": "noun"
            },
            {
                "word": "designer",
                "pos": "adjective"
            },
            {
                "word": "designer baby",
                "pos": "noun"
            },
            {
                "word": "designer drug",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "made by a famous designer; expensive and having a famous brand name",
                    "vi": "được thực hiện bởi một nhà thiết kế nổi tiếng; đắt tiền và có thương hiệu nổi tiếng"
                },
                "examples": [
                    {
                        "en": "designer clothes",
                        "vi": "quần áo hàng hiệu"
                    },
                    {
                        "en": "designer jeans",
                        "vi": "quần jean thiết kế"
                    },
                    {
                        "en": "designer water",
                        "vi": "nước thiết kế"
                    },
                    {
                        "en": "He had a trendy haircut, an earring and designer stubble (= a short beard, grown for two or three days and thought to look fashionable).",
                        "vi": "Anh ta cắt tóc hợp thời trang, đeo bông tai và râu ria hàng hiệu (= bộ râu ngắn, mọc trong hai hoặc ba ngày và được cho là trông thời trang)."
                    }
                ]
            }
        ]
    },
    {
        "id": "3fdfc1972ba345c3a1bfcb6e765cfe33",
        "word": "fashionable",
        "pos": "adjective",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈfæʃnəbl/",
            "us": "/ˈfæʃnəbl/"
        },
        "nearby": [
            {
                "word": "fashion",
                "pos": "noun"
            },
            {
                "word": "fashion",
                "pos": "verb"
            },
            {
                "word": "fashionable",
                "pos": "adjective"
            },
            {
                "word": "fashionably",
                "pos": "adverb"
            },
            {
                "word": "fashion-conscious",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "following a style that is popular at a particular time",
                    "vi": "theo một phong cách phổ biến tại một thời điểm cụ thể"
                },
                "examples": [
                    {
                        "en": "fashionable clothes/ideas/styles",
                        "vi": "quần áo / ý tưởng / phong cách thời trang"
                    },
                    {
                        "en": "He was laughed at by his more fashionable friends.",
                        "vi": "Anh bị những người bạn thời trang hơn của mình cười nhạo."
                    },
                    {
                        "en": "it is fashionable to do something It's becoming fashionable to have long hair again.",
                        "vi": "nó là thời trang để làm một cái gì đó Nó trở thành thời trang để có một mái tóc dài trở lại."
                    },
                    {
                        "en": "fashionable among somebody Such thinking is currently fashionable among right-wing politicians.",
                        "vi": "thời thượng của ai đó Tư duy như vậy hiện đang là mốt trong các chính trị gia cánh hữu."
                    }
                ]
            },
            {
                "define": {
                    "en": "used or visited by people following a current fashion, especially by rich people",
                    "vi": "được sử dụng hoặc truy cập bởi những người theo mốt hiện tại, đặc biệt là bởi những người giàu có"
                },
                "examples": [
                    {
                        "en": "a fashionable address/resort/restaurant",
                        "vi": "một địa chỉ / khu nghỉ dưỡng / nhà hàng thời thượng"
                    },
                    {
                        "en": "She lives in a very fashionable part of London.",
                        "vi": "Cô ấy sống ở một khu rất thời trang của London."
                    },
                    {
                        "en": "The shop moved to a more fashionable address.",
                        "vi": "Tiệm chuyển sang địa chỉ thời trang hơn."
                    },
                    {
                        "en": "The play is a satire on fashionable society in Victorian times.",
                        "vi": "Vở kịch là một sự châm biếm về xã hội thời thượng trong thời Victoria."
                    }
                ]
            }
        ]
    },
    {
        "id": "7d988088c92443c9b92c03bf603e5eb2",
        "word": "label",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈleɪbl/",
            "us": "/ˈleɪbl/"
        },
        "nearby": [
            {
                "word": "Lab.",
                "pos": "abbreviation"
            },
            {
                "word": "the Laban Centre",
                "pos": ""
            },
            {
                "word": "label",
                "pos": "noun"
            },
            {
                "word": "label",
                "pos": "verb"
            },
            {
                "word": "labia",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a piece of paper, etc. that is attached to something and that gives information about it",
                    "vi": "một mảnh giấy, v.v. được gắn với một thứ gì đó và cung cấp thông tin về nó"
                },
                "examples": [
                    {
                        "en": "Always read the label carefully.",
                        "vi": "Luôn đọc nhãn cẩn thận."
                    },
                    {
                        "en": "price/address labels",
                        "vi": "nhãn giá / địa chỉ"
                    },
                    {
                        "en": "on a label The washing instructions are on the label.",
                        "vi": "trên nhãn Hướng dẫn giặt có trên nhãn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a word or phrase that is used to describe somebody/something in a way that seems too general, unfair or not correct",
                    "vi": "một từ hoặc cụm từ được sử dụng để mô tả ai đó / điều gì đó theo cách có vẻ quá chung chung, không công bằng hoặc không đúng"
                },
                "examples": [
                    {
                        "en": "I hated the label ‘housewife’.",
                        "vi": "Tôi ghét cái mác 'bà nội trợ'."
                    }
                ]
            },
            {
                "define": {
                    "en": "the name or trademark of a fashion company",
                    "vi": "tên hoặc nhãn hiệu của một công ty thời trang"
                },
                "examples": [
                    {
                        "en": "today's major fashion labels",
                        "vi": "các nhãn thời trang lớn hiện nay"
                    },
                    {
                        "en": "She plans to launch her own designer clothes label.",
                        "vi": "Cô dự định ra mắt nhãn hiệu quần áo thiết kế của riêng mình."
                    },
                    {
                        "en": "He's really fashion-conscious and will only wear labels (= clothes with a designer label).",
                        "vi": "Anh ấy thực sự có ý thức về thời trang và sẽ chỉ mặc nhãn (= quần áo có nhãn hiệu của nhà thiết kế)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a company that produces and sells music, CDs, etc.",
                    "vi": "một công ty sản xuất và bán nhạc, đĩa CD, v.v."
                },
                "examples": [
                    {
                        "en": "the Virgin record label",
                        "vi": "hãng thu âm Virgin"
                    },
                    {
                        "en": "It's his first release for a major label.",
                        "vi": "Đây là bản phát hành đầu tiên của anh ấy cho một hãng lớn."
                    }
                ]
            }
        ]
    },
    {
        "id": "a3da2e61e37541038b95be7c4d9a474d",
        "word": "model",
        "pos": "verb",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈmɒdl/",
            "us": "/ˈmɑːdl/"
        },
        "nearby": [
            {
                "word": "mode",
                "pos": "noun"
            },
            {
                "word": "model",
                "pos": "noun"
            },
            {
                "word": "model",
                "pos": "verb"
            },
            {
                "word": "model after",
                "pos": "phrasal verb"
            },
            {
                "word": "model home",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to create a copy or description of an activity, a situation, etc. so that you can study it before dealing with the real thing",
                    "vi": "để tạo một bản sao hoặc mô tả về một hoạt động, một tình huống, v.v. để bạn có thể nghiên cứu nó trước khi xử lý thực tế"
                },
                "examples": [
                    {
                        "en": "The program can model a typical home page for you.",
                        "vi": "Chương trình có thể lập mô hình trang chủ điển hình cho bạn."
                    },
                    {
                        "en": "We can accurately model the development process.",
                        "vi": "Chúng tôi có thể mô hình hóa chính xác quá trình phát triển."
                    },
                    {
                        "en": "Air quality planners can model the effects of tree on air pollution.",
                        "vi": "Các nhà hoạch định chất lượng không khí có thể mô hình hóa tác động của cây đối với ô nhiễm không khí."
                    }
                ]
            },
            {
                "define": {
                    "en": "to represent something, especially in a diagram",
                    "vi": "đại diện cho một cái gì đó, đặc biệt là trong một sơ đồ"
                },
                "examples": [
                    {
                        "en": "This finite set of data can be modelled by a growth curve.",
                        "vi": "Tập hợp dữ liệu hữu hạn này có thể được mô hình hóa bằng một đường cong tăng trưởng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to shape clay, etc. in order to make something",
                    "vi": "để tạo hình đất sét, v.v. để làm ra thứ gì đó"
                },
                "examples": [
                    {
                        "en": "a statue modelled in bronze",
                        "vi": "một bức tượng bằng đồng"
                    },
                    {
                        "en": "a simple souvenir, modelled in the shape of a horse",
                        "vi": "một món quà lưu niệm đơn giản được mô phỏng theo hình con ngựa"
                    }
                ]
            },
            {
                "define": {
                    "en": "to wear clothes in order to show them to people who might want to buy them",
                    "vi": "mặc quần áo để hiển thị chúng cho những người có thể muốn mua chúng"
                },
                "examples": [
                    {
                        "en": "The wedding gown is being modelled for us by the designer's daughter.",
                        "vi": "Chiếc váy cưới đang được con gái của nhà thiết kế làm mẫu cho chúng tôi."
                    },
                    {
                        "en": "Brad and Cindy are modelling chunky knitwear on the beach.",
                        "vi": "Brad và Cindy đang tạo mẫu quần áo dệt kim chunky trên bãi biển."
                    }
                ]
            },
            {
                "define": {
                    "en": "to work as a model for an artist or in the fashion industry",
                    "vi": "làm người mẫu cho một nghệ sĩ hoặc trong ngành thời trang"
                },
                "examples": [
                    {
                        "en": "Ralph's been modelling since he was 16.",
                        "vi": "Ralph làm người mẫu từ năm 16 tuổi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to set an example of behaviour that you want other people to copy",
                    "vi": "để làm ví dụ về hành vi mà bạn muốn người khác sao chép"
                },
                "examples": [
                    {
                        "en": "Managers must model behaviour that is open and vulnerable.",
                        "vi": "Các nhà quản lý phải mô hình hóa hành vi cởi mở và dễ bị tổn thương."
                    },
                    {
                        "en": "Teachers may need to model appropriate discussion behaviours.",
                        "vi": "Giáo viên có thể cần phải mô hình hóa các hành vi thảo luận thích hợp."
                    }
                ]
            }
        ]
    },
    {
        "id": "a2bc606c0ec640908756fd9ba583d6e1",
        "word": "photographer",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/fəˈtɒɡrəfə(r)/",
            "us": "/fəˈtɑːɡrəfər/"
        },
        "nearby": [
            {
                "word": "photograph",
                "pos": "noun"
            },
            {
                "word": "photograph",
                "pos": "verb"
            },
            {
                "word": "photographer",
                "pos": "noun"
            },
            {
                "word": "photographic",
                "pos": "adjective"
            },
            {
                "word": "photographically",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who takes photographs, especially as a job",
                    "vi": "một người chụp ảnh, đặc biệt là trong công việc"
                },
                "examples": [
                    {
                        "en": "a wedding/wildlife/fashion photographer",
                        "vi": "một nhiếp ảnh gia đám cưới / động vật hoang dã / thời trang"
                    },
                    {
                        "en": "an amateur/a professional photographer",
                        "vi": "một nhiếp ảnh gia nghiệp dư / chuyên nghiệp"
                    },
                    {
                        "en": "The couple posed for photographers before going back inside.",
                        "vi": "Cặp đôi tạo dáng trước các nhiếp ảnh gia trước khi quay vào trong."
                    },
                    {
                        "en": "Photographer Darren Kidd captured the unique atmosphere of the event.",
                        "vi": "Nhiếp ảnh gia Darren Kidd đã ghi lại bầu không khí độc đáo của sự kiện."
                    }
                ]
            }
        ]
    },
    {
        "id": "85df1a2c3a734a45b28e6bf7f3bb2709",
        "word": "supermodel",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈsuːpəmɒdl/",
            "us": "/ˈsuːpərmɑːdl/"
        },
        "nearby": [
            {
                "word": "supermarket",
                "pos": "noun"
            },
            {
                "word": "supermax",
                "pos": "noun"
            },
            {
                "word": "supermodel",
                "pos": "noun"
            },
            {
                "word": "supermoon",
                "pos": "noun"
            },
            {
                "word": "supernatural",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a very famous and highly paid fashion model",
                    "vi": "một người mẫu thời trang rất nổi tiếng và được trả lương cao"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "1eb543449e5041ffb9bbcb2878d83f03",
        "word": "trendy",
        "pos": "adjective",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈtrendi/",
            "us": "/ˈtrendi/"
        },
        "nearby": [
            {
                "word": "trendsetter",
                "pos": "noun"
            },
            {
                "word": "trendsetting",
                "pos": "adjective"
            },
            {
                "word": "trendy",
                "pos": "adjective"
            },
            {
                "word": "trendy",
                "pos": "noun"
            },
            {
                "word": "Trent Bridge",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "very fashionable",
                    "vi": "rất thời trang"
                },
                "examples": [
                    {
                        "en": "trendy clothes",
                        "vi": "quần áo hợp thời trang"
                    }
                ]
            }
        ]
    },
    {
        "id": "2bcef6a3f5cc4fea8bf76f45b500cb79",
        "word": "unfashionable",
        "pos": "adjective",
        "level": "b1",
        "phonetic": {
            "uk": "/ʌnˈfæʃnəbl/",
            "us": "/ʌnˈfæʃnəbl/"
        },
        "nearby": [
            {
                "word": "unfamiliar",
                "pos": "adjective"
            },
            {
                "word": "unfamiliarity",
                "pos": "noun"
            },
            {
                "word": "unfashionable",
                "pos": "adjective"
            },
            {
                "word": "unfashionably",
                "pos": "adverb"
            },
            {
                "word": "unfasten",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "not popular or fashionable at a particular time",
                    "vi": "không phổ biến hoặc thời trang tại một thời điểm cụ thể"
                },
                "examples": [
                    {
                        "en": "an unfashionable part of London",
                        "vi": "một phần không hợp thời trang của London"
                    },
                    {
                        "en": "unfashionable ideas",
                        "vi": "ý tưởng không hợp thời trang"
                    }
                ]
            }
        ]
    },
    {
        "id": "aadca611201a480e9e728c5b73579503",
        "word": "collection",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/kəˈlekʃn/",
            "us": "/kəˈlekʃn/"
        },
        "nearby": [
            {
                "word": "collectable",
                "pos": "adjective"
            },
            {
                "word": "collected",
                "pos": "adjective"
            },
            {
                "word": "collection",
                "pos": "noun"
            },
            {
                "word": "collective",
                "pos": "adjective"
            },
            {
                "word": "collective",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a group of objects, often of the same sort, that have been collected",
                    "vi": "một nhóm các đối tượng, thường cùng loại, đã được thu thập"
                },
                "examples": [
                    {
                        "en": "He wanted to share his vast art collection with the world.",
                        "vi": "Anh muốn chia sẻ bộ sưu tập nghệ thuật khổng lồ của mình với thế giới."
                    },
                    {
                        "en": "a stamp/coin/record collection",
                        "vi": "một bộ sưu tập tem / xu / kỷ lục"
                    },
                    {
                        "en": "collection of something an extensive collection of war photographs",
                        "vi": "bộ sưu tập của một cái gì đó một bộ sưu tập phong phú các bức ảnh chiến tranh"
                    },
                    {
                        "en": "The painting comes from his private collection.",
                        "vi": "Bức tranh đến từ bộ sưu tập tư nhân của anh ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "a group of objects or people",
                    "vi": "một nhóm đồ vật hoặc người"
                },
                "examples": [
                    {
                        "en": "There was a collection of books and shoes on the floor.",
                        "vi": "Có một bộ sưu tập sách và giày dép trên sàn nhà."
                    },
                    {
                        "en": "There is always a strange collection of runners in the London Marathon.",
                        "vi": "Luôn luôn có một bộ sưu tập kỳ lạ của các vận động viên trong cuộc thi Marathon London."
                    }
                ]
            },
            {
                "define": {
                    "en": "an act of taking something away from a place; an act of bringing things together into one place",
                    "vi": "một hành động lấy một cái gì đó khỏi một nơi; một hành động mang mọi thứ lại với nhau vào một nơi"
                },
                "examples": [
                    {
                        "en": "The first stage in research is data collection.",
                        "vi": "Giai đoạn đầu tiên trong nghiên cứu là thu thập dữ liệu."
                    },
                    {
                        "en": "waste/rubbish/garbage/refuse collection",
                        "vi": "thu gom rác thải / rác thải / rác thải / rác thải"
                    },
                    {
                        "en": "The last collection from this postbox is at 5.15.",
                        "vi": "Bộ sưu tập cuối cùng từ hộp thư này là lúc 5 giờ 15."
                    },
                    {
                        "en": "Your suit will be ready for collection on Tuesday.",
                        "vi": "Bộ đồ của bạn sẽ sẵn sàng để thu vào thứ Ba."
                    }
                ]
            },
            {
                "define": {
                    "en": "a group of poems, stories or pieces of music published together as one book, etc.",
                    "vi": "một nhóm các bài thơ, câu chuyện hoặc bản nhạc được xuất bản cùng nhau thành một cuốn sách, v.v."
                },
                "examples": [
                    {
                        "en": "a collection of stories by women writers",
                        "vi": "một bộ sưu tập các câu chuyện của các nhà văn nữ"
                    },
                    {
                        "en": "a collection of favourite Christmas music",
                        "vi": "bộ sưu tập nhạc giáng sinh yêu thích"
                    }
                ]
            },
            {
                "define": {
                    "en": "an act of collecting money to help a charity or during a church service; the money collected",
                    "vi": "hành động quyên góp tiền để giúp đỡ một tổ chức từ thiện hoặc trong một buổi lễ nhà thờ; số tiền thu được"
                },
                "examples": [
                    {
                        "en": "a house-to-house collection for Cancer Research",
                        "vi": "một bộ sưu tập từng nhà cho Nghiên cứu Ung thư"
                    },
                    {
                        "en": "The total collection last week amounted to £250.",
                        "vi": "Tổng bộ sưu tập tuần trước lên tới 250 bảng Anh."
                    },
                    {
                        "en": "a collection box/bucket (= for people to put money in)",
                        "vi": "hộp / thùng thu gom (= để mọi người bỏ tiền vào)"
                    },
                    {
                        "en": "the church collection plate",
                        "vi": "đĩa sưu tập nhà thờ"
                    }
                ]
            },
            {
                "define": {
                    "en": "a range of new clothes or items for the home that are designed, made and offered for sale, often for a particular season",
                    "vi": "một loạt quần áo hoặc đồ dùng mới cho ngôi nhà được thiết kế, sản xuất và chào bán, thường cho một mùa cụ thể"
                },
                "examples": [
                    {
                        "en": "Armani’s stunning new autumn collection",
                        "vi": "Bộ sưu tập mùa thu mới tuyệt đẹp của Armani"
                    }
                ]
            }
        ]
    },
    {
        "id": "0f3a6d3cbd58427b9ebcb0771bb9650b",
        "word": "fashion-conscious",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈfæʃn kɒnʃəs/",
            "us": "/ˈfæʃn kɑːnʃəs/"
        },
        "nearby": [
            {
                "word": "fashionable",
                "pos": "adjective"
            },
            {
                "word": "fashionably",
                "pos": "adverb"
            },
            {
                "word": "fashion-conscious",
                "pos": "adjective"
            },
            {
                "word": "fashion designer",
                "pos": "noun"
            },
            {
                "word": "fashion-forward",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "aware of the latest fashions and wanting to follow them",
                    "vi": "nhận thức được các thời trang mới nhất và muốn làm theo chúng"
                },
                "examples": [
                    {
                        "en": "fashion-conscious teenagers",
                        "vi": "thanh thiếu niên có ý thức về thời trang"
                    }
                ]
            }
        ]
    },
    {
        "id": "7cc53a1022684727bb84148c1a9283e3",
        "word": "season",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈsiːzn/",
            "us": "/ˈsiːzn/"
        },
        "nearby": [
            {
                "word": "seaside",
                "pos": "adjective"
            },
            {
                "word": "seaside postcard",
                "pos": "noun"
            },
            {
                "word": "season",
                "pos": "noun"
            },
            {
                "word": "season",
                "pos": "verb"
            },
            {
                "word": "the Season",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "any of the four main periods of the year: spring, summer, autumn and winter",
                    "vi": "bất kỳ trong bốn thời kỳ chính của năm: xuân, hạ, thu, đông"
                },
                "examples": [
                    {
                        "en": "the changing seasons",
                        "vi": "những mùa thay đổi"
                    },
                    {
                        "en": "Autumn is my favourite season.",
                        "vi": "Mùa thu là mùa yêu thích của tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a period of the year in tropical countries when it is either very dry or it rains a lot",
                    "vi": "một khoảng thời gian trong năm ở các nước nhiệt đới khi trời rất khô hoặc mưa nhiều"
                },
                "examples": [
                    {
                        "en": "In this climate there are no real changes of temperature, just a wet and a dry season.",
                        "vi": "Trong khí hậu này không có sự thay đổi thực sự của nhiệt độ, chỉ có mùa ẩm và mùa khô."
                    },
                    {
                        "en": "Next month is the start of the rainy season.",
                        "vi": "Tháng sau là mùa mưa bắt đầu."
                    }
                ]
            },
            {
                "define": {
                    "en": "a period of time during a year when a particular activity happens or is done",
                    "vi": "một khoảng thời gian trong năm khi một hoạt động cụ thể xảy ra hoặc được thực hiện"
                },
                "examples": [
                    {
                        "en": "the cricket/football/hunting/shooting season",
                        "vi": "mùa cricket / bóng đá / săn bắn / bắn súng"
                    },
                    {
                        "en": "He scored his first goal of the season on Saturday.",
                        "vi": "Anh ấy đã ghi bàn thắng đầu tiên của mùa giải vào thứ Bảy."
                    },
                    {
                        "en": "They achieved their first win of the season.",
                        "vi": "Họ đã giành được chiến thắng đầu tiên trong mùa giải."
                    },
                    {
                        "en": "He will not be offered a new contract at the end of the season.",
                        "vi": "Anh ấy sẽ không được đề nghị hợp đồng mới vào cuối mùa giải."
                    },
                    {
                        "en": "The team have had a dream start to the season.",
                        "vi": "Đội đã có một khởi đầu mùa giải như mơ."
                    },
                    {
                        "en": "The female changes colour during the breeding season.",
                        "vi": "Con cái thay đổi màu sắc trong mùa sinh sản."
                    },
                    {
                        "en": "The growing season for these trees varies depending on species.",
                        "vi": "Mùa sinh trưởng của những cây này thay đổi tùy theo loài."
                    },
                    {
                        "en": "We're in the middle of the roughest hurricane season we've seen in quite some time.",
                        "vi": "Chúng ta đang ở giữa mùa bão khắc nghiệt nhất mà chúng ta từng thấy trong một thời gian khá dài."
                    },
                    {
                        "en": "The hotels are always full during the peak season (= when most people are on holiday).",
                        "vi": "Các khách sạn luôn kín phòng trong mùa cao điểm (= khi hầu hết mọi người đi nghỉ)."
                    },
                    {
                        "en": "(British English) the holiday season",
                        "vi": "(Tiếng Anh Anh) kỳ nghỉ lễ"
                    },
                    {
                        "en": "(especially North American English) the tourist season",
                        "vi": "(đặc biệt là tiếng Anh Bắc Mỹ) mùa du lịch"
                    },
                    {
                        "en": "(North American English) the holiday season (= the time of Thanksgiving, Hanukkah, Christmas and New Year)",
                        "vi": "(Tiếng Anh Bắc Mỹ) mùa lễ (= thời gian của Lễ tạ ơn, lễ Hanukkah, lễ Giáng sinh và năm mới)"
                    },
                    {
                        "en": "(British English) the festive season (= Christmas and New Year)",
                        "vi": "(Tiếng Anh Anh) mùa lễ hội (= Giáng sinh và Năm mới)"
                    },
                    {
                        "en": "the summer blockbuster season",
                        "vi": "mùa phim bom tấn mùa hè"
                    }
                ]
            },
            {
                "define": {
                    "en": "a period of time in which a play is shown in one place; a series of plays, films or television programmes",
                    "vi": "khoảng thời gian mà vở kịch được chiếu ở một nơi; một loạt vở kịch, phim hoặc chương trình truyền hình"
                },
                "examples": [
                    {
                        "en": "The play opens for a second season in London next week.",
                        "vi": "Vở kịch sẽ mở màn cho mùa thứ hai tại London vào tuần tới."
                    },
                    {
                        "en": "a season of films by Alfred Hitchcock",
                        "vi": "một mùa phim của Alfred Hitchcock"
                    }
                ]
            },
            {
                "define": {
                    "en": "a period of time during one year when a particular style of clothes, hair, etc. is popular and fashionable",
                    "vi": "một khoảng thời gian trong suốt một năm khi một kiểu quần áo, kiểu tóc cụ thể, v.v. được ưa chuộng và thời trang"
                },
                "examples": [
                    {
                        "en": "This season's look is soft and romantic.",
                        "vi": "Cái nhìn mùa này thật nhẹ nhàng và lãng mạn."
                    },
                    {
                        "en": "The fashion magazines are full of the new look for the spring season.",
                        "vi": "Các tạp chí thời trang tràn ngập diện mạo mới cho mùa xuân."
                    }
                ]
            },
            {
                "define": {
                    "en": "a set of television or radio programmes that have the same characters or deal with the same subject",
                    "vi": "một tập hợp các chương trình truyền hình hoặc đài phát thanh có các nhân vật giống nhau hoặc đề cập đến cùng một chủ đề"
                },
                "examples": [
                    {
                        "en": "The show begins its second season next week.",
                        "vi": "Chương trình sẽ bắt đầu mùa thứ hai vào tuần sau."
                    },
                    {
                        "en": "I binge-watched an entire season of ‘Mad Men’ (= watched all of the episodes on one occasion) on Sunday.",
                        "vi": "Tôi đã xem toàn bộ một phần của 'Mad Men' (= xem tất cả các tập cùng một lúc) vào Chủ nhật."
                    },
                    {
                        "en": "I can't wait to see the season finale (= last episode in the season).",
                        "vi": "Tôi nóng lòng muốn xem phần cuối cùng (= tập cuối cùng trong phần)."
                    },
                    {
                        "en": "the season opener (= the first episode in the season)",
                        "vi": "phần mở đầu (= tập đầu tiên trong phần)"
                    }
                ]
            },
            {
                "define": {
                    "en": "be/become easily available and ready to eat because it is the right time of year for them",
                    "vi": "trở nên dễ dàng sẵn có và sẵn sàng để ăn vì đây là thời điểm thích hợp trong năm đối với họ"
                },
                "examples": [
                    {
                        "en": "Strawberries are now in season.",
                        "vi": "Dâu tây hiện đã vào mùa."
                    },
                    {
                        "en": "Melons are just coming into season.",
                        "vi": "Các loại dưa vừa vào mùa."
                    }
                ]
            },
            {
                "define": {
                    "en": "be/become ready to have sex and produce young",
                    "vi": "sẵn sàng để quan hệ tình dục và sinh ra trẻ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "not easily available because it is not the right time of year for them",
                    "vi": "không dễ dàng có sẵn vì đây không phải là thời điểm thích hợp trong năm cho họ"
                },
                "examples": [
                    {
                        "en": "Lobster's out of season right now.",
                        "vi": "Lobster hiện đã hết mùa."
                    }
                ]
            },
            {
                "define": {
                    "en": "at the times of year when few people go on holiday",
                    "vi": "vào những thời điểm trong năm khi ít người đi nghỉ"
                },
                "examples": [
                    {
                        "en": "Hotels are cheaper out of season.",
                        "vi": "Khách sạn rẻ hơn trái mùa."
                    }
                ]
            },
            {
                "define": {
                    "en": "used during the Christmas period to wish somebody a pleasant holiday",
                    "vi": "được sử dụng trong thời kỳ Giáng sinh để chúc ai đó một kỳ nghỉ vui vẻ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "100d992e04c144fa89be36eaf2a427c5",
        "word": "tailor",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈteɪlə(r)/",
            "us": "/ˈteɪlər/"
        },
        "nearby": [
            {
                "word": "tail light",
                "pos": "noun"
            },
            {
                "word": "tail off",
                "pos": "phrasal verb"
            },
            {
                "word": "tailor",
                "pos": "noun"
            },
            {
                "word": "tailor",
                "pos": "verb"
            },
            {
                "word": "tailored",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person whose job is to make men’s clothes, especially somebody who makes suits, etc. for individual customers",
                    "vi": "một người có công việc là may quần áo nam, đặc biệt là ai đó may vest, v.v. cho khách hàng cá nhân"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "b06a55d817c44f1c8316640a65d877bf",
        "word": "wardrobe",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈwɔːdrəʊb/",
            "us": "/ˈwɔːrdrəʊb/"
        },
        "nearby": [
            {
                "word": "ward off",
                "pos": "phrasal verb"
            },
            {
                "word": "Wardour Street",
                "pos": ""
            },
            {
                "word": "wardrobe",
                "pos": "noun"
            },
            {
                "word": "wardrobe master",
                "pos": "noun"
            },
            {
                "word": "wardrobe mistress",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a large cupboard for hanging clothes in, which is either a piece of furniture or (in British English) built into the wall",
                    "vi": "một cái tủ lớn để treo quần áo, là một món đồ nội thất hoặc (bằng tiếng Anh Anh) được xây vào tường"
                },
                "examples": [
                    {
                        "en": "a fitted wardrobe",
                        "vi": "một tủ quần áo vừa vặn"
                    }
                ]
            },
            {
                "define": {
                    "en": "the clothes that a person has",
                    "vi": "quần áo mà một người có"
                },
                "examples": [
                    {
                        "en": "We have everything you need for your summer wardrobe.",
                        "vi": "Chúng tôi có mọi thứ bạn cần cho tủ quần áo mùa hè của bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "the department in a theatre or television company that takes care of the clothes that actors wear",
                    "vi": "bộ phận trong nhà hát hoặc công ty truyền hình chăm sóc trang phục mà các diễn viên mặc"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "b206ffa3a5dc46709480f9229f2eaefc",
        "word": "wear",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/weə(r)/",
            "us": "/wer/"
        },
        "nearby": [
            {
                "word": "weaponry",
                "pos": "noun"
            },
            {
                "word": "wear",
                "pos": "verb"
            },
            {
                "word": "wear",
                "pos": "noun"
            },
            {
                "word": "wearable",
                "pos": "adjective"
            },
            {
                "word": "wearable",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "used especially in shops to describe clothes for a particular purpose or occasion",
                    "vi": "được sử dụng đặc biệt trong các cửa hàng để mô tả quần áo cho một mục đích hoặc dịp cụ thể"
                },
                "examples": [
                    {
                        "en": "casual/evening wear",
                        "vi": "trang phục bình thường / buổi tối"
                    },
                    {
                        "en": "children’s/ladies’ wear",
                        "vi": "quần áo trẻ em / phụ nữ"
                    }
                ]
            },
            {
                "define": {
                    "en": "the fact of wearing something",
                    "vi": "thực tế là mặc một cái gì đó"
                },
                "examples": [
                    {
                        "en": "casual clothes for everyday wear",
                        "vi": "quần áo bình thường để mặc hàng ngày"
                    },
                    {
                        "en": "These woollen suits are not designed for wear in hot climates.",
                        "vi": "Những bộ quần áo len này không được thiết kế để mặc trong điều kiện khí hậu nóng."
                    }
                ]
            },
            {
                "define": {
                    "en": "the amount or type of use that something has over a period of time",
                    "vi": "số lượng hoặc kiểu sử dụng mà thứ gì đó có trong một khoảng thời gian"
                },
                "examples": [
                    {
                        "en": "You should get years of wear out of that carpet.",
                        "vi": "Bạn sẽ nhận được nhiều năm hao mòn từ tấm thảm đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "the damage or loss of quality that is caused when something has been used a lot",
                    "vi": "thiệt hại hoặc giảm chất lượng gây ra khi một cái gì đó đã được sử dụng nhiều"
                },
                "examples": [
                    {
                        "en": "His shoes were beginning to show signs of wear.",
                        "vi": "Giày của anh ấy đã bắt đầu có dấu hiệu mòn."
                    },
                    {
                        "en": "The machines have to be checked regularly for wear.",
                        "vi": "Máy móc phải được kiểm tra độ mòn thường xuyên."
                    }
                ]
            },
            {
                "define": {
                    "en": "the damage to objects, furniture, property, etc. that is the result of normal use",
                    "vi": "thiệt hại đối với đồ vật, đồ đạc, tài sản, v.v. là kết quả của việc sử dụng bình thường"
                },
                "examples": [
                    {
                        "en": "The insurance policy does not cover damage caused by normal wear and tear.",
                        "vi": "Hợp đồng bảo hiểm không bao gồm các thiệt hại do hao mòn thông thường."
                    },
                    {
                        "en": "The living-room carpet has to stand up to the combined wear and tear of two dogs and three children.",
                        "vi": "Thảm phòng khách phải chịu đựng sự hao mòn của hai con chó và ba đứa trẻ."
                    }
                ]
            },
            {
                "define": {
                    "en": "in a poor condition because of being used a lot",
                    "vi": "trong tình trạng kém vì được sử dụng nhiều"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "drunk",
                    "vi": "say"
                },
                "examples": [
                    {
                        "en": "He arrived home at two in the morning, much the worse for wear.",
                        "vi": "Anh về đến nhà lúc hai giờ sáng, mặc càng tệ hơn."
                    }
                ]
            }
        ]
    },
    {
        "id": "c3a448dd0aa141b78d11c3fb5692a72f",
        "word": "catwalk",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈkætwɔːk/",
            "us": "/ˈkætwɔːk/"
        },
        "nearby": [
            {
                "word": "catty-corner(ed)",
                "pos": "adjective, adverb"
            },
            {
                "word": "CATV",
                "pos": ""
            },
            {
                "word": "catwalk",
                "pos": "noun"
            },
            {
                "word": "Caucasian",
                "pos": "noun"
            },
            {
                "word": "Caucasian",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the long stage that models walk on during a fashion show",
                    "vi": "sân khấu dài mà người mẫu bước trong một buổi trình diễn thời trang"
                },
                "examples": [
                    {
                        "en": "a catwalk model/show",
                        "vi": "một người mẫu / chương trình catwalk"
                    },
                    {
                        "en": "He presented his latest collection at a catwalk show during Paris fashion week.",
                        "vi": "Anh đã trình làng bộ sưu tập mới nhất của mình tại một buổi trình diễn catwalk trong tuần lễ thời trang Paris."
                    },
                    {
                        "en": "The lights were mounted on a catwalk above the stage.",
                        "vi": "Đèn được gắn trên một sàn catwalk phía trên sân khấu."
                    }
                ]
            },
            {
                "define": {
                    "en": "a narrow platform for people to walk on, for example along the outside of a building or a bridge",
                    "vi": "một sân ga hẹp để mọi người bước lên, ví dụ như dọc theo bên ngoài của một tòa nhà hoặc một cây cầu"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "e2ee33d5414148e5a8be929d3235d75e",
        "word": "cut",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/kʌt/",
            "us": "/kʌt/"
        },
        "nearby": [
            {
                "word": "cut-off",
                "pos": "adjective"
            },
            {
                "word": "cut",
                "pos": "verb"
            },
            {
                "word": "cut",
                "pos": "noun"
            },
            {
                "word": "cut across",
                "pos": "phrasal verb"
            },
            {
                "word": "cut and dried",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a wound caused by something sharp",
                    "vi": "vết thương do vật gì sắc nhọn gây ra"
                },
                "examples": [
                    {
                        "en": "cuts and bruises on the face",
                        "vi": "vết cắt và vết bầm tím trên mặt"
                    },
                    {
                        "en": "Blood poured from the deep cut on his arm.",
                        "vi": "Máu đổ ra từ vết cắt sâu trên cánh tay."
                    }
                ]
            },
            {
                "define": {
                    "en": "a hole or an opening in something, made with something sharp",
                    "vi": "một lỗ hoặc một lỗ hổng trên một thứ gì đó, được làm bằng thứ gì đó sắc nhọn"
                },
                "examples": [
                    {
                        "en": "Using sharp scissors, make a small cut in the material.",
                        "vi": "Dùng kéo sắc cắt một đường nhỏ trên vật liệu."
                    },
                    {
                        "en": "a high-quality blade that gives a clean cut",
                        "vi": "một lưỡi dao chất lượng cao giúp cắt sạch"
                    }
                ]
            },
            {
                "define": {
                    "en": "a reduction in amount, size, supply, etc.",
                    "vi": "giảm số lượng, kích thước, nguồn cung cấp, v.v."
                },
                "examples": [
                    {
                        "en": "tax/budget/price/funding cuts",
                        "vi": "cắt giảm thuế / ngân sách / giá / tài trợ"
                    },
                    {
                        "en": "The company has made another round of job cuts this year.",
                        "vi": "Công ty đã thực hiện một đợt cắt giảm việc làm khác trong năm nay."
                    },
                    {
                        "en": "cut in something They announced cuts in public spending.",
                        "vi": "cắt giảm thứ gì đó Họ đã công bố cắt giảm chi tiêu công."
                    },
                    {
                        "en": "They had to take a 20% cut in pay.",
                        "vi": "Họ đã phải giảm 20% lương."
                    }
                ]
            },
            {
                "define": {
                    "en": "an act of cutting somebody’s hair; the style in which it is cut",
                    "vi": "hành động cắt tóc của ai đó; phong cách mà nó được cắt"
                },
                "examples": [
                    {
                        "en": "Your hair could do with a cut (= it is too long).",
                        "vi": "Tóc của bạn có thể bị cắt (= quá dài)."
                    },
                    {
                        "en": "a cut and blow-dry",
                        "vi": "cắt và sấy khô"
                    },
                    {
                        "en": "The stylish cut of her hair is distinctively modern and urban.",
                        "vi": "Phong cách cắt tóc của cô ấy rất hiện đại và thành thị."
                    }
                ]
            },
            {
                "define": {
                    "en": "the shape and style that a piece of clothing has because of the way the cloth is cut",
                    "vi": "hình dạng và kiểu dáng của một bộ quần áo do cách cắt vải"
                },
                "examples": [
                    {
                        "en": "the elegant cut of her dress",
                        "vi": "đường cắt trang nhã của chiếc váy của cô ấy"
                    },
                    {
                        "en": "trousers with a loose cut designed for comfortable wear",
                        "vi": "quần tây với một đường cắt rộng rãi được thiết kế để mặc thoải mái"
                    }
                ]
            },
            {
                "define": {
                    "en": "a share in something, especially money",
                    "vi": "một phần nào đó, đặc biệt là tiền"
                },
                "examples": [
                    {
                        "en": "They were rewarded with a cut of 5% from the profits.",
                        "vi": "Họ đã được thưởng với khoản cắt giảm 5% từ lợi nhuận."
                    }
                ]
            },
            {
                "define": {
                    "en": "an act of removing part of a film, play, piece of writing, etc.",
                    "vi": "một hành động loại bỏ một phần của phim, vở kịch, tác phẩm viết, v.v."
                },
                "examples": [
                    {
                        "en": "The director objected to the cuts ordered by the censor.",
                        "vi": "Đạo diễn phản đối việc cắt giảm theo lệnh của nhà kiểm duyệt."
                    },
                    {
                        "en": "She made some cuts before handing over the finished novel.",
                        "vi": "Cô ấy đã cắt một số đoạn trước khi giao cuốn tiểu thuyết đã hoàn thành."
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of meat cut from an animal",
                    "vi": "một miếng thịt cắt từ động vật"
                },
                "examples": [
                    {
                        "en": "a lean cut of pork",
                        "vi": "thịt lợn nạc"
                    },
                    {
                        "en": "cheap cuts of stewing lamb",
                        "vi": "thịt cừu hầm giá rẻ"
                    },
                    {
                        "en": "The recipe calls for a good lean cut of beef.",
                        "vi": "Công thức này yêu cầu một phần thịt bò nạc ngon."
                    }
                ]
            },
            {
                "define": {
                    "en": "better than somebody/something",
                    "vi": "tốt hơn ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "His latest novel is a cut above the rest.",
                        "vi": "Cuốn tiểu thuyết mới nhất của anh ấy là một sự cắt giảm so với phần còn lại."
                    }
                ]
            },
            {
                "define": {
                    "en": "the lively or aggressive way that something is done",
                    "vi": "cách sống động hoặc tích cực mà một cái gì đó được thực hiện"
                },
                "examples": [
                    {
                        "en": "the cut and thrust of political debate",
                        "vi": "sự cắt giảm và lực đẩy của cuộc tranh luận chính trị"
                    },
                    {
                        "en": "his cut-and-thrust management style",
                        "vi": "phong cách quản lý cắt và đẩy của anh ấy"
                    }
                ]
            },
            {
                "define": {
                    "en": "to reach or maintain the required standard",
                    "vi": "để đạt được hoặc duy trì tiêu chuẩn cần thiết"
                },
                "examples": [
                    {
                        "en": "I had to explain to the applicants why they didn't make the cut.",
                        "vi": "Tôi đã phải giải thích cho những người nộp đơn tại sao họ không cắt giảm."
                    }
                ]
            },
            {
                "define": {
                    "en": "(in golf) to achieve a good enough score to be able to take part in the next stage of a competition",
                    "vi": "(trong môn đánh gôn) đạt được điểm đủ tốt để có thể tham gia vào giai đoạn tiếp theo của cuộc thi"
                },
                "examples": [
                    {
                        "en": "Woods needed a 69 to make the cut.",
                        "vi": "Woods cần số 69 để thực hiện cú cắt."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be included after parts have been removed",
                    "vi": "được đưa vào sau khi các bộ phận đã được loại bỏ"
                },
                "examples": [
                    {
                        "en": "When a book is made into a movie not every scene will make the cut.",
                        "vi": "Khi một cuốn sách được dựng thành phim, không phải cảnh nào cũng cắt được."
                    }
                ]
            }
        ]
    },
    {
        "id": "9fd7f764be6c4b139f5259e7291f7d8b",
        "word": "fashion statement",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈfæʃn steɪtmənt/",
            "us": "/ˈfæʃn steɪtmənt/"
        },
        "nearby": [
            {
                "word": "fashionista",
                "pos": "noun"
            },
            {
                "word": "fashion show",
                "pos": "noun"
            },
            {
                "word": "fashion statement",
                "pos": "noun"
            },
            {
                "word": "fashion victim",
                "pos": "noun"
            },
            {
                "word": "fast",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "something that you wear or own that is new or unusual and is meant to draw attention to you",
                    "vi": "thứ gì đó bạn mặc hoặc sở hữu mới hoặc khác thường và nhằm thu hút sự chú ý đến bạn"
                },
                "examples": [
                    {
                        "en": "This shirt is great for anyone who wants to make a fashion statement.",
                        "vi": "Chiếc áo sơ mi này là tuyệt vời cho bất kỳ ai muốn tạo ra một tuyên bố thời trang."
                    },
                    {
                        "en": "Flared trousers were a fashion statement of the seventies.",
                        "vi": "Quần ống loe là một tuyên ngôn thời trang của những năm bảy mươi."
                    }
                ]
            }
        ]
    },
    {
        "id": "02739880e58e4267b0eaf664b122ed3e",
        "word": "fashion victim",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈfæʃn vɪktɪm/",
            "us": "/ˈfæʃn vɪktɪm/"
        },
        "nearby": [
            {
                "word": "fashion show",
                "pos": "noun"
            },
            {
                "word": "fashion statement",
                "pos": "noun"
            },
            {
                "word": "fashion victim",
                "pos": "noun"
            },
            {
                "word": "fast",
                "pos": "adjective"
            },
            {
                "word": "fast",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who always wears the newest fashions even if they do not suit him or her",
                    "vi": "một người luôn mặc những bộ thời trang mới nhất ngay cả khi chúng không hợp với anh ta hoặc cô ta"
                },
                "examples": [
                    {
                        "en": "this season's must-have accessories that no fashion victim will be seen without",
                        "vi": "Những phụ kiện phải có của mùa này mà không một nạn nhân thời trang nào được nhìn thấy nếu không có"
                    }
                ]
            }
        ]
    },
    {
        "id": "485823a63be840b3b852d2a147b9baca",
        "word": "in",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ɪn/",
            "us": "/ɪn/"
        },
        "nearby": [
            {
                "word": "in",
                "pos": "preposition"
            },
            {
                "word": "in",
                "pos": "adverb"
            },
            {
                "word": "in",
                "pos": "adjective"
            },
            {
                "word": "in",
                "pos": "noun"
            },
            {
                "word": "in.",
                "pos": "abbreviation"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "popular and fashionable",
                    "vi": "phổ biến và thời trang"
                },
                "examples": [
                    {
                        "en": "Purple is the in colour this spring.",
                        "vi": "Màu tím là màu trong mùa xuân này."
                    },
                    {
                        "en": "Exotic pets are the in thing right now.",
                        "vi": "Những con vật cưng kỳ lạ đang được ưa chuộng ngay bây giờ."
                    },
                    {
                        "en": "Short skirts are in again.",
                        "vi": "Váy ngắn cũn cỡn."
                    }
                ]
            }
        ]
    },
    {
        "id": "5c49c242d361472581bce56963c96647",
        "word": "made to measure",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌmeɪd tə ˈmeʒə(r)/",
            "us": "/ˌmeɪd tə ˈmeʒər/"
        },
        "nearby": [
            {
                "word": "madeleine",
                "pos": "noun"
            },
            {
                "word": "Madeleine",
                "pos": ""
            },
            {
                "word": "made to measure",
                "pos": "adjective"
            },
            {
                "word": "made to order",
                "pos": "adjective"
            },
            {
                "word": "made-up",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "made specially to fit a particular person, window, etc.",
                    "vi": "được làm đặc biệt để phù hợp với một người cụ thể, cửa sổ, v.v."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c62bfe4d56224361adcd85c2619dc120",
        "word": "made to measure",
        "pos": "idiom",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈmeʒə(r)/",
            "us": "/ˈmeʒər/"
        },
        "nearby": [
            {
                "word": "measurably",
                "pos": "adverb"
            },
            {
                "word": "measure",
                "pos": "verb"
            },
            {
                "word": "measure",
                "pos": "noun"
            },
            {
                "word": "measure against",
                "pos": "phrasal verb"
            },
            {
                "word": "measured",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an official action that is done in order to achieve a particular aim",
                    "vi": "một hành động chính thức được thực hiện để đạt được một mục tiêu cụ thể"
                },
                "examples": [
                    {
                        "en": "safety/austerity measures",
                        "vi": "các biện pháp an toàn / thắt lưng buộc bụng"
                    },
                    {
                        "en": "a temporary/an emergency measure",
                        "vi": "một biện pháp tạm thời / khẩn cấp"
                    },
                    {
                        "en": "a series/number/range of measures",
                        "vi": "một loạt / số / phạm vi các biện pháp"
                    },
                    {
                        "en": "a package of measures aimed at cutting pollution",
                        "vi": "một gói các biện pháp nhằm cắt giảm ô nhiễm"
                    },
                    {
                        "en": "New security measures were implemented to prevent further violence.",
                        "vi": "Các biện pháp an ninh mới đã được thực hiện để ngăn chặn bạo lực tiếp tục."
                    },
                    {
                        "en": "as a… measure Police in riot gear were in attendance as a precautionary measure.",
                        "vi": "như một… biện pháp Cảnh sát trong trang phục chống bạo động đã có mặt như một biện pháp phòng ngừa."
                    },
                    {
                        "en": "measure to do something We must take preventive measures to reduce crime in the area.",
                        "vi": "biện pháp để làm một cái gì đó Chúng ta phải thực hiện các biện pháp phòng ngừa để giảm tội phạm trong khu vực."
                    },
                    {
                        "en": "The government is introducing tougher measures to combat crime.",
                        "vi": "Chính phủ đang đưa ra các biện pháp cứng rắn hơn để chống tội phạm."
                    },
                    {
                        "en": "measure against something They are demanding harsher measures against racism.",
                        "vi": "biện pháp chống lại một cái gì đó Họ đang đòi hỏi những biện pháp khắc nghiệt hơn để chống lại sự phân biệt chủng tộc."
                    }
                ]
            },
            {
                "define": {
                    "en": "a unit used for stating the size, quantity or degree of something; a system or a scale of these units",
                    "vi": "một đơn vị được sử dụng để nêu kích thước, số lượng hoặc mức độ của một cái gì đó; một hệ thống hoặc một quy mô của các đơn vị này"
                },
                "examples": [
                    {
                        "en": "weights and measures",
                        "vi": "đơn vị cân nặng và đơn vị đo lường"
                    },
                    {
                        "en": "The Richter Scale is a measure of ground motion.",
                        "vi": "Thang đo độ Richter là thước đo chuyển động trên mặt đất."
                    },
                    {
                        "en": "Which measure of weight do pharmacists use?",
                        "vi": "Dược sĩ sử dụng thước đo cân nặng nào?"
                    },
                    {
                        "en": "liquid/dry measure",
                        "vi": "thước đo chất lỏng / khô"
                    }
                ]
            },
            {
                "define": {
                    "en": "a standard quantity",
                    "vi": "một số lượng tiêu chuẩn"
                },
                "examples": [
                    {
                        "en": "a generous measure of whisky",
                        "vi": "một lượng rượu whisky hào phóng"
                    }
                ]
            },
            {
                "define": {
                    "en": "a way of judging or measuring something",
                    "vi": "một cách đánh giá hoặc đo lường một cái gì đó"
                },
                "examples": [
                    {
                        "en": "measure of something an accurate measure of ability",
                        "vi": "đo lường một cái gì đó một thước đo chính xác về khả năng"
                    },
                    {
                        "en": "Is this test a good measure of reading comprehension?",
                        "vi": "Bài kiểm tra này có phải là một biện pháp tốt để đọc hiểu không?"
                    },
                    {
                        "en": "Exam results are only one measure of a school's success.",
                        "vi": "Kết quả thi chỉ là một thước đo thành công của trường."
                    },
                    {
                        "en": "as a… measure Companies can use their stock price as a performance measure.",
                        "vi": "như một… thước đo Các công ty có thể sử dụng giá cổ phiếu của họ như một thước đo hiệu suất."
                    }
                ]
            },
            {
                "define": {
                    "en": "a sign of the size or the strength of something",
                    "vi": "một dấu hiệu về kích thước hoặc sức mạnh của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "Sending flowers is a measure of how much you care.",
                        "vi": "Gửi hoa là thước đo mức độ quan tâm của bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a particular amount of something, especially a fairly large amount",
                    "vi": "một số lượng cụ thể của một cái gì đó, đặc biệt là một số lượng khá lớn"
                },
                "examples": [
                    {
                        "en": "A measure of technical knowledge is desirable in this job.",
                        "vi": "Một thước đo về kiến thức kỹ thuật là mong muốn trong công việc này."
                    },
                    {
                        "en": "She achieved some measure of success with her first book.",
                        "vi": "Cô đã đạt được một số thành công với cuốn sách đầu tiên của mình."
                    },
                    {
                        "en": "It was a success, containing equal measures of unbridled anarchy and infantile fun.",
                        "vi": "Đó là một thành công, chứa đựng những thước đo bình đẳng về tình trạng vô chính phủ và niềm vui trẻ nhỏ không thể kiềm chế."
                    }
                ]
            },
            {
                "define": {
                    "en": "an instrument such as a stick, a long tape or a container that is marked with standard units and is used for measuring",
                    "vi": "một dụng cụ chẳng hạn như một cái que, một cuộn băng dài hoặc một vật chứa được đánh dấu bằng các đơn vị tiêu chuẩn và được sử dụng để đo"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a written suggestion, especially one for a new law made by the lawmakers of a state",
                    "vi": "một đề xuất bằng văn bản, đặc biệt là một đề xuất cho luật mới do các nhà làm luật của một tiểu bang đưa ra"
                },
                "examples": [
                    {
                        "en": "a motion to refer the measure to another committee",
                        "vi": "một chuyển động để chuyển biện pháp cho một ủy ban khác"
                    },
                    {
                        "en": "a ballot measure (= a change in the law that voters decide on)",
                        "vi": "một biện pháp bỏ phiếu (= một sự thay đổi trong luật mà cử tri quyết định)"
                    }
                ]
            },
            {
                "define": {
                    "en": "one of the short sections of equal length that a piece of music is divided into, and the notes that are in it",
                    "vi": "một trong những đoạn ngắn có độ dài bằng nhau mà một bản nhạc được chia thành và các nốt trong đó"
                },
                "examples": [
                    {
                        "en": "The band began playing the opening measures.",
                        "vi": "Ban nhạc bắt đầu chơi các bài mở đầu."
                    },
                    {
                        "en": "He placed his fingers on the keys and played a few measures.",
                        "vi": "Anh đặt các ngón tay của mình lên phím đàn và chơi một vài bản nhạc."
                    },
                    {
                        "en": "a steady rhythm of four beats to a measure",
                        "vi": "một nhịp điệu ổn định của bốn nhịp cho một số đo"
                    },
                    {
                        "en": "the first few measures of Mozart's third violin concerto",
                        "vi": "vài thước đo đầu tiên của bản hòa tấu vĩ cầm thứ ba của Mozart"
                    }
                ]
            },
            {
                "define": {
                    "en": "very much",
                    "vi": "rất nhiều"
                },
                "examples": [
                    {
                        "en": "He irritated me beyond measure.",
                        "vi": "Anh ấy đã chọc tức tôi quá mức."
                    }
                ]
            },
            {
                "define": {
                    "en": "as an extra amount of something in addition to what has already been done or given",
                    "vi": "như một số lượng bổ sung của một cái gì đó ngoài những gì đã được thực hiện hoặc cho"
                },
                "examples": [
                    {
                        "en": "Use 50g of rice per person and an extra spoonful for good measure.",
                        "vi": "Dùng 50g gạo cho mỗi người và thêm một thìa để có hiệu quả tốt."
                    },
                    {
                        "en": "‘I’m no good at puzzles. I can’t even do crosswords,’ she added for good measure.",
                        "vi": "Tôi không giỏi câu đố. Tôi thậm chí không thể làm trò chơi ô chữ, 'cô ấy nói thêm."
                    }
                ]
            },
            {
                "define": {
                    "en": "the whole of something or less of something than you expect or should have",
                    "vi": "toàn bộ của một cái gì đó hoặc ít hơn một cái gì đó hơn bạn mong đợi hoặc nên có"
                },
                "examples": [
                    {
                        "en": "We experienced the full measure of their hospitality.",
                        "vi": "Chúng tôi đã trải nghiệm toàn bộ sự hiếu khách của họ."
                    },
                    {
                        "en": "The concert only lasted an hour, so we felt we were getting short measure.",
                        "vi": "Buổi biểu diễn chỉ kéo dài một giờ, vì vậy chúng tôi cảm thấy mình đang bị hụt hẫng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to form an opinion about something, especially somebody’s character or abilities, so that you can deal with them",
                    "vi": "để hình thành ý kiến về điều gì đó, đặc biệt là tính cách hoặc khả năng của ai đó, để bạn có thể đối phó với họ"
                },
                "examples": [
                    {
                        "en": "After only one game, the chess champion had the measure of his young opponent.",
                        "vi": "Chỉ sau một ván đấu, nhà vô địch cờ vua đã hạ đo ván đối thủ trẻ tuổi của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to the greatest possible degree",
                    "vi": "ở mức độ lớn nhất có thể"
                },
                "examples": [
                    {
                        "en": "My expectations had been met in full measure.",
                        "vi": "Kỳ vọng của tôi đã được đáp ứng đầy đủ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to a great extent",
                    "vi": "đến một giới hạn rất lớn"
                },
                "examples": [
                    {
                        "en": "Their success is due in large measure to their determination.",
                        "vi": "Thành công của họ phần lớn là nhờ vào sự quyết tâm của họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to a great extent",
                    "vi": "đến một giới hạn rất lớn"
                },
                "examples": [
                    {
                        "en": "Their success is due in large part to their determination.",
                        "vi": "Thành công của họ một phần lớn nhờ vào sự quyết tâm của họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to a large extent or degree; to some, etc. extent or degree",
                    "vi": "ở một mức độ hoặc mức độ lớn; ở một mức độ nào đó, v.v. mức độ hoặc mức độ"
                },
                "examples": [
                    {
                        "en": "The introduction of a new tax accounted in no small measure for the downfall of the government.",
                        "vi": "Việc áp dụng một loại thuế mới có ý nghĩa không nhỏ đối với sự sụp đổ của chính phủ."
                    },
                    {
                        "en": "Our thanks are due in equal measure to every member of the team.",
                        "vi": "Lời cảm ơn của chúng tôi được gửi đến mọi thành viên trong nhóm một cách bình đẳng."
                    }
                ]
            },
            {
                "define": {
                    "en": "made especially for one person according to particular measurements",
                    "vi": "được làm đặc biệt cho một người theo các phép đo cụ thể"
                },
                "examples": [
                    {
                        "en": "You'll need to get a suit made to measure.",
                        "vi": "Bạn sẽ cần phải có một bộ đồ để đo."
                    },
                    {
                        "en": "I’m having the curtains made to measure.",
                        "vi": "Tôi đang đo rèm cửa."
                    },
                    {
                        "en": "a made-to-measure suit",
                        "vi": "một bộ đồ được may đo"
                    }
                ]
            }
        ]
    },
    {
        "id": "884971f5b2fc4099a9215302b8f7899d",
        "word": "menswear",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈmenzweə(r)/",
            "us": "/ˈmenzwer/"
        },
        "nearby": [
            {
                "word": "menstruate",
                "pos": "verb"
            },
            {
                "word": "menstruation",
                "pos": "noun"
            },
            {
                "word": "menswear",
                "pos": "noun"
            },
            {
                "word": "-ment",
                "pos": "suffix"
            },
            {
                "word": "mental",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "clothes for men",
                    "vi": "quần áo cho nam giới"
                },
                "examples": [
                    {
                        "en": "the menswear department",
                        "vi": "bộ quần áo nam"
                    }
                ]
            }
        ]
    },
    {
        "id": "be89198712a44679986d6bcf6445f1c1",
        "word": "nightwear",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈnaɪtweə(r)/",
            "us": "/ˈnaɪtwer/"
        },
        "nearby": [
            {
                "word": "night-time",
                "pos": "noun"
            },
            {
                "word": "nightwatchman",
                "pos": "noun"
            },
            {
                "word": "nightwear",
                "pos": "noun"
            },
            {
                "word": "nihilism",
                "pos": "noun"
            },
            {
                "word": "nihilist",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "clothes that are worn in bed",
                    "vi": "quần áo mặc trên giường"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "58a36d9ea55349809d901bd885c155b2",
        "word": "ready-to-wear",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌredi tə ˈweə(r)/",
            "us": "/ˌredi tə ˈwer/"
        },
        "nearby": [
            {
                "word": "ready money",
                "pos": "noun"
            },
            {
                "word": "ready reckoner",
                "pos": "noun"
            },
            {
                "word": "ready-to-wear",
                "pos": "adjective"
            },
            {
                "word": "reaffirm",
                "pos": "verb"
            },
            {
                "word": "reaffirmation",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "made in standard sizes, not to the measurements of a particular customer",
                    "vi": "được làm theo kích thước tiêu chuẩn, không phải theo số đo của một khách hàng cụ thể"
                },
                "examples": [
                    {
                        "en": "this winter’s ready-to-wear collections from top designers",
                        "vi": "bộ sưu tập quần áo may sẵn của mùa đông năm nay từ các nhà thiết kế hàng đầu"
                    }
                ]
            }
        ]
    },
    {
        "id": "471d32c629004335a7f01d5fe7562139",
        "word": "sportswear",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈspɔːtsweə(r)/",
            "us": "/ˈspɔːrtswer/"
        },
        "nearby": [
            {
                "word": "sportsperson",
                "pos": "noun"
            },
            {
                "word": "sports shirt",
                "pos": "noun"
            },
            {
                "word": "sportswear",
                "pos": "noun"
            },
            {
                "word": "sportswoman",
                "pos": "noun"
            },
            {
                "word": "sport utility vehicle",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "clothes that are worn for playing sports, or in informal situations",
                    "vi": "quần áo mặc để chơi thể thao hoặc trong các tình huống không chính thức"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "clothes that are worn in informal situations",
                    "vi": "quần áo mặc trong những trường hợp không chính thức"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "78788747337d4708834b51bb09e6dbb6",
        "word": "womenswear",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈwɪmɪnzweə(r)/",
            "us": "/ˈwɪmɪnzwer/"
        },
        "nearby": [
            {
                "word": "the Women's Royal Voluntary Service",
                "pos": ""
            },
            {
                "word": "women's studies",
                "pos": "noun"
            },
            {
                "word": "womenswear",
                "pos": "noun"
            },
            {
                "word": "won",
                "pos": ""
            },
            {
                "word": "wonder",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "(used especially in shops) clothes for women",
                    "vi": "(đặc biệt được sử dụng trong các cửa hàng) quần áo cho phụ nữ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a300386e1e2d4a9fa49f084dfd974f4d",
        "word": "attire",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/əˈtaɪə(r)/",
            "us": "/əˈtaɪər/"
        },
        "nearby": [
            {
                "word": "attest",
                "pos": "verb"
            },
            {
                "word": "attic",
                "pos": "noun"
            },
            {
                "word": "attire",
                "pos": "noun"
            },
            {
                "word": "attired",
                "pos": "adjective"
            },
            {
                "word": "attitude",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "clothes, especially fine or formal ones",
                    "vi": "quần áo, đặc biệt là quần áo đẹp hoặc trang trọng"
                },
                "examples": [
                    {
                        "en": "dressed in formal evening attire",
                        "vi": "mặc trang phục buổi tối trang trọng"
                    }
                ]
            }
        ]
    },
    {
        "id": "c7c4998de85c41ab9fc7d3a5f8bafee7",
        "word": "bridal",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbraɪdl/",
            "us": "/ˈbraɪdl/"
        },
        "nearby": [
            {
                "word": "bricolage",
                "pos": "noun"
            },
            {
                "word": "BRICS",
                "pos": "abbreviation"
            },
            {
                "word": "bridal",
                "pos": "adjective"
            },
            {
                "word": "bride",
                "pos": "noun"
            },
            {
                "word": "bridegroom",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "connected with a bride or a wedding",
                    "vi": "kết nối với một cô dâu hoặc một đám cưới"
                },
                "examples": [
                    {
                        "en": "a bridal gown",
                        "vi": "áo dài cô dâu"
                    },
                    {
                        "en": "the bridal party (= the bride and the bridegroom and the people helping them at their wedding, sometimes used to refer only to the bride and those helping her)",
                        "vi": "tiệc cưới (= cô dâu và chú rể và những người giúp đỡ họ trong đám cưới của họ, đôi khi được dùng để chỉ cô dâu và những người giúp đỡ cô ấy)"
                    },
                    {
                        "en": "a bridal suite (= a set of rooms in a hotel for a couple who have just got married)",
                        "vi": "phòng tân hôn (= một tập hợp các phòng trong khách sạn dành cho một cặp vợ chồng mới kết hôn)"
                    },
                    {
                        "en": "(North American English) a bridal shower (= a party for a woman who will get married soon)",
                        "vi": "(Tiếng Anh Bắc Mỹ) buổi tiệc cô dâu (= bữa tiệc dành cho một người phụ nữ sắp kết hôn)"
                    }
                ]
            }
        ]
    },
    {
        "id": "1c617304a3cd4d9883602c15ecc2703f",
        "word": "chic",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ʃiːk/",
            "us": "/ʃiːk/"
        },
        "nearby": [
            {
                "word": "chiaroscuro",
                "pos": "noun"
            },
            {
                "word": "chiasmus",
                "pos": "noun"
            },
            {
                "word": "chic",
                "pos": "noun"
            },
            {
                "word": "chic",
                "pos": "adjective"
            },
            {
                "word": "chica",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the quality of being fashionable and attractive",
                    "vi": "chất lượng của thời trang và hấp dẫn"
                },
                "examples": [
                    {
                        "en": "a perfectly dressed woman with an air of chic that was unmistakably French",
                        "vi": "một người phụ nữ ăn mặc hoàn hảo với khí chất sang trọng không lẫn vào đâu được của người Pháp"
                    }
                ]
            }
        ]
    },
    {
        "id": "fae89a0b04b9493b9af99ff539644daf",
        "word": "chic",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ʃiːk/",
            "us": "/ʃiːk/"
        },
        "nearby": [
            {
                "word": "chiasmus",
                "pos": "noun"
            },
            {
                "word": "chic",
                "pos": "noun"
            },
            {
                "word": "chic",
                "pos": "adjective"
            },
            {
                "word": "chica",
                "pos": "noun"
            },
            {
                "word": "Chicago",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "very fashionable and attractive",
                    "vi": "rất thời trang và hấp dẫn"
                },
                "examples": [
                    {
                        "en": "She is always so chic, so elegant.",
                        "vi": "Cô ấy luôn rất sang trọng, rất thanh lịch."
                    },
                    {
                        "en": "a chic new restaurant",
                        "vi": "một nhà hàng mới sang trọng"
                    },
                    {
                        "en": "She was dazzling, witty and terrifyingly chic.",
                        "vi": "Cô ấy rực rỡ, hóm hỉnh và sang trọng một cách đáng sợ."
                    },
                    {
                        "en": "They found a chic little bar.",
                        "vi": "Họ tìm thấy một quán bar nhỏ sang trọng."
                    }
                ]
            }
        ]
    },
    {
        "id": "5d21ae13c4634d7baf5c9538bda3f259",
        "word": "coordinate",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/kəʊˈɔːdɪneɪt/",
            "us": "/kəʊˈɔːrdɪneɪt/"
        },
        "nearby": [
            {
                "word": "co-opt",
                "pos": "verb"
            },
            {
                "word": "coop up",
                "pos": "phrasal verb"
            },
            {
                "word": "coordinate",
                "pos": "verb"
            },
            {
                "word": "coordinate",
                "pos": "noun"
            },
            {
                "word": "coordinate clause",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to organize the different parts of an activity and the people involved in it so that it works well",
                    "vi": "tổ chức các phần khác nhau của một hoạt động và những người tham gia vào nó để nó hoạt động tốt"
                },
                "examples": [
                    {
                        "en": "coordinate something They appointed a new manager to coordinate the work of the team.",
                        "vi": "điều phối một cái gì đó Họ đã bổ nhiệm một người quản lý mới để điều phối công việc của nhóm."
                    },
                    {
                        "en": "We need to develop a coordinated approach to the problem.",
                        "vi": "Chúng ta cần phát triển một cách tiếp cận phối hợp để giải quyết vấn đề."
                    },
                    {
                        "en": "a carefully coordinated policy",
                        "vi": "một chính sách được phối hợp cẩn thận"
                    },
                    {
                        "en": "coordinate something with something We try to coordinate our activities with those of other groups.",
                        "vi": "phối hợp một cái gì đó với cái gì đó Chúng tôi cố gắng phối hợp các hoạt động của chúng tôi với các hoạt động của các nhóm khác."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make the different parts of your body work well together",
                    "vi": "để làm cho các bộ phận khác nhau của cơ thể bạn hoạt động tốt cùng nhau"
                },
                "examples": [
                    {
                        "en": "the part of the brain that coordinates body movements",
                        "vi": "phần não điều phối các chuyển động của cơ thể"
                    }
                ]
            },
            {
                "define": {
                    "en": "if you coordinate clothes, furniture, etc. or if they coordinate, they look nice together",
                    "vi": "nếu bạn phối quần áo, đồ đạc, v.v. hoặc nếu chúng phối hợp, chúng trông rất đẹp với nhau"
                },
                "examples": [
                    {
                        "en": "This shade coordinates with a wide range of other colours.",
                        "vi": "Bóng râm này phối hợp với một loạt các màu khác."
                    },
                    {
                        "en": "The company has extended its coordinated clothing range.",
                        "vi": "Công ty đã mở rộng phạm vi quần áo phối hợp của mình."
                    }
                ]
            }
        ]
    },
    {
        "id": "adfc6b6d83e14122a95b03ddf38009ce",
        "word": "coordinate",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/kəʊˈɔːdɪnət/",
            "us": "/kəʊˈɔːrdɪnət/"
        },
        "nearby": [
            {
                "word": "coop up",
                "pos": "phrasal verb"
            },
            {
                "word": "coordinate",
                "pos": "verb"
            },
            {
                "word": "coordinate",
                "pos": "noun"
            },
            {
                "word": "coordinate clause",
                "pos": "noun"
            },
            {
                "word": "Coordinated Universal Time",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "either of two numbers or letters used to fix the position of a point on a map or graph",
                    "vi": "một trong hai số hoặc chữ cái được sử dụng để cố định vị trí của một điểm trên bản đồ hoặc biểu đồ"
                },
                "examples": [
                    {
                        "en": "the x, y coordinates of any point on a line",
                        "vi": "tọa độ x, y của bất kỳ điểm nào trên một đường thẳng"
                    }
                ]
            },
            {
                "define": {
                    "en": "pieces of clothing that can be worn together because, for example, the colours look good together",
                    "vi": "những bộ quần áo có thể được mặc cùng nhau bởi vì, ví dụ, màu sắc trông đẹp với nhau"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "445d5d61b9c640b6b13c458c0369f9ba",
        "word": "couture",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/kuˈtjʊə(r)/",
            "us": "/kuˈtʊr/"
        },
        "nearby": [
            {
                "word": "cousin sister",
                "pos": "noun"
            },
            {
                "word": "Coutts",
                "pos": ""
            },
            {
                "word": "couture",
                "pos": "noun"
            },
            {
                "word": "couturier",
                "pos": "noun"
            },
            {
                "word": "covalent",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the design and production of expensive and fashionable clothes; these clothes",
                    "vi": "thiết kế và sản xuất quần áo đắt tiền và thời trang; những bộ quần áo này"
                },
                "examples": [
                    {
                        "en": "a couture evening dress",
                        "vi": "một chiếc váy dạ hội cao cấp"
                    },
                    {
                        "en": "The House of Mattli is expanding from couture into ready-to-wear.",
                        "vi": "Nhà của Mattli đang mở rộng từ thời trang cao cấp sang quần áo may sẵn."
                    }
                ]
            }
        ]
    },
    {
        "id": "4e1527f3c3a14fd98587b94f24a4106e",
        "word": "dress down",
        "pos": "phrasal verb",
        "level": "c2",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "dress circle",
                "pos": "noun"
            },
            {
                "word": "dress code",
                "pos": "noun"
            },
            {
                "word": "dress down",
                "pos": "phrasal verb"
            },
            {
                "word": "dressed",
                "pos": "adjective"
            },
            {
                "word": "dresser",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to wear clothes that are more informal than those you usually wear, for example in an office",
                    "vi": "mặc quần áo trang trọng hơn những bộ quần áo bạn thường mặc, ví dụ như trong văn phòng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to criticize or be angry with somebody because they have done something wrong",
                    "vi": "chỉ trích hoặc tức giận với ai đó bởi vì họ đã làm điều gì đó sai trái"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "d5f0d711b3a64b3e9e24f41e10e13086",
        "word": "dummy",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈdʌmi/",
            "us": "/ˈdʌmi/"
        },
        "nearby": [
            {
                "word": "dumdum",
                "pos": "noun"
            },
            {
                "word": "Dumfries",
                "pos": ""
            },
            {
                "word": "dummy",
                "pos": "noun"
            },
            {
                "word": "dummy",
                "pos": "adjective"
            },
            {
                "word": "dummy",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a model of a person, used especially when making clothes or for showing them in a shop window",
                    "vi": "mô hình của một người, được sử dụng đặc biệt khi may quần áo hoặc để hiển thị họ trong cửa sổ cửa hàng"
                },
                "examples": [
                    {
                        "en": "a tailor’s dummy",
                        "vi": "hình nộm thợ may"
                    },
                    {
                        "en": "a ventriloquist’s dummy",
                        "vi": "hình nộm của một người nói tiếng bụng"
                    }
                ]
            },
            {
                "define": {
                    "en": "a thing that seems to be real but is only a copy of the real thing",
                    "vi": "một thứ có vẻ là thật nhưng chỉ là một bản sao của điều thật"
                },
                "examples": [
                    {
                        "en": "The bottles of whisky on display are all dummies.",
                        "vi": "Các chai rượu whisky được trưng bày đều là hình nộm."
                    }
                ]
            },
            {
                "define": {
                    "en": "a stupid person",
                    "vi": "một người ngu ngốc"
                },
                "examples": [
                    {
                        "en": "Don't just stand there, you dummy.",
                        "vi": "Đừng chỉ đứng đó, đồ ngu."
                    }
                ]
            },
            {
                "define": {
                    "en": "an occasion when you pretend to make a particular move and then do not do so",
                    "vi": "một dịp khi bạn giả vờ thực hiện một hành động cụ thể và sau đó không làm như vậy"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a rubber or plastic object with a special shape that a baby sucks on with its lips and tongue",
                    "vi": "một vật bằng cao su hoặc nhựa có hình dạng đặc biệt mà trẻ có thể mút bằng môi và lưỡi"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the cards that are placed facing upwards on the table and which can be seen by all the players",
                    "vi": "các thẻ được đặt hướng lên trên trên bàn và tất cả người chơi có thể nhìn thấy"
                },
                "examples": [
                    {
                        "en": "She played a jack from dummy.",
                        "vi": "Cô ấy đã chơi một trò lừa đảo từ hình nộm."
                    }
                ]
            }
        ]
    },
    {
        "id": "6b886a67c7684b21b0e1d1580921af3d",
        "word": "glam",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ɡlæm/",
            "us": "/ɡlæm/"
        },
        "nearby": [
            {
                "word": "William Gladstone",
                "pos": ""
            },
            {
                "word": "Gladys",
                "pos": ""
            },
            {
                "word": "glam",
                "pos": "adjective"
            },
            {
                "word": "glam",
                "pos": "noun"
            },
            {
                "word": "glam",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "glamorous (= especially attractive and exciting)",
                    "vi": "quyến rũ (= đặc biệt hấp dẫn và thú vị)"
                },
                "examples": [
                    {
                        "en": "She looks so glam in that red dress.",
                        "vi": "Cô ấy trông thật quyến rũ trong chiếc váy đỏ đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "relating to glam rock (= a style of music popular in the 1970s)",
                    "vi": "liên quan đến glam rock (= một phong cách âm nhạc phổ biến trong những năm 1970)"
                },
                "examples": [
                    {
                        "en": "My dad is a big fan of glam metal music.",
                        "vi": "Bố tôi là một người hâm mộ lớn của dòng nhạc glam metal."
                    }
                ]
            }
        ]
    },
    {
        "id": "d79086f4545d410bbedcf3d72a7ea9fc",
        "word": "glam",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ɡlæm/",
            "us": "/ɡlæm/"
        },
        "nearby": [
            {
                "word": "Gladys",
                "pos": ""
            },
            {
                "word": "glam",
                "pos": "adjective"
            },
            {
                "word": "glam",
                "pos": "noun"
            },
            {
                "word": "glam",
                "pos": "verb"
            },
            {
                "word": "Glamis Castle",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "glamour (= an attractive and exciting quality that makes somebody/something seem special)",
                    "vi": "sự quyến rũ (= một phẩm chất hấp dẫn và thú vị khiến ai đó / điều gì đó có vẻ đặc biệt)"
                },
                "examples": [
                    {
                        "en": "For extra glam, accessorize your outfit with gold jewellery.",
                        "vi": "Để thêm phần quyến rũ, hãy trang điểm cho trang phục của bạn bằng đồ trang sức bằng vàng."
                    }
                ]
            },
            {
                "define": {
                    "en": "glam rock (= a style of music popular in the 1970s)",
                    "vi": "glam rock (= một phong cách âm nhạc phổ biến trong những năm 1970)"
                },
                "examples": [
                    {
                        "en": "Their new album is an unusual mix of goth, glam and pop.",
                        "vi": "Album mới của họ là một sự pha trộn bất thường giữa goth, glam và pop."
                    }
                ]
            }
        ]
    },
    {
        "id": "a3f4d2cb537940cda786e1c185873ea0",
        "word": "glam up",
        "pos": "phrasal verb",
        "level": "c2",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "glamping",
                "pos": "noun"
            },
            {
                "word": "glam rock",
                "pos": "noun"
            },
            {
                "word": "glam up",
                "pos": "phrasal verb"
            },
            {
                "word": "glance",
                "pos": "verb"
            },
            {
                "word": "glance",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to make yourself look especially attractive",
                    "vi": "để làm cho mình trông đặc biệt hấp dẫn"
                },
                "examples": [
                    {
                        "en": "I like to glam up for a night out with my friends.",
                        "vi": "Tôi thích đi chơi đêm với bạn bè."
                    },
                    {
                        "en": "It takes us a long time to get glammed up before we go on stage.",
                        "vi": "Chúng tôi phải mất một thời gian dài để trở nên hào nhoáng trước khi lên sân khấu."
                    }
                ]
            }
        ]
    },
    {
        "id": "23aa62fec7a04602abb08605991dc683",
        "word": "haute couture",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌəʊt kuˈtjʊə(r)/",
            "us": "/ˌəʊt kuˈtʊr/"
        },
        "nearby": [
            {
                "word": "hauntingly",
                "pos": "adverb"
            },
            {
                "word": "Hausa",
                "pos": "noun"
            },
            {
                "word": "haute couture",
                "pos": "noun"
            },
            {
                "word": "haute cuisine",
                "pos": "noun"
            },
            {
                "word": "hauteur",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the business of making fashionable and expensive clothes; the clothes made in this business",
                    "vi": "kinh doanh quần áo thời trang và đắt tiền; quần áo làm trong doanh nghiệp này"
                },
                "examples": [
                    {
                        "en": "the world of haute couture",
                        "vi": "thế giới thời trang cao cấp"
                    }
                ]
            }
        ]
    },
    {
        "id": "1fd412b0f03d431eaedf9003c3a520af",
        "word": "hosiery",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈhəʊziəri/",
            "us": "/ˈhəʊʒəri/"
        },
        "nearby": [
            {
                "word": "hosepipe",
                "pos": "noun"
            },
            {
                "word": "hoser",
                "pos": "noun"
            },
            {
                "word": "hosiery",
                "pos": "noun"
            },
            {
                "word": "hospice",
                "pos": "noun"
            },
            {
                "word": "the hospice movement",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "used especially in shops as a word for tights, stockings and socks",
                    "vi": "được sử dụng đặc biệt trong các cửa hàng như một từ để chỉ quần tất, tất và tất"
                },
                "examples": [
                    {
                        "en": "the hosiery department",
                        "vi": "bộ phận dệt may"
                    }
                ]
            }
        ]
    },
    {
        "id": "ef9cbce04bf04de98b1aec5ad8929543",
        "word": "leisurewear",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈleʒəweə(r)/",
            "us": "/ˈliːʒərwer/"
        },
        "nearby": [
            {
                "word": "leisurely",
                "pos": "adverb"
            },
            {
                "word": "leisure suit",
                "pos": "noun"
            },
            {
                "word": "leisurewear",
                "pos": "noun"
            },
            {
                "word": "leitmotif",
                "pos": "noun"
            },
            {
                "word": "lekgotla",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "informal clothes worn for relaxing or playing sports in",
                    "vi": "quần áo bình thường mặc để thư giãn hoặc chơi thể thao trong"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "310504e7b7e74f9ba6aecc42d1e054a9",
        "word": "loungewear",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈlaʊndʒweə(r)/",
            "us": "/ˈlaʊndʒwer/"
        },
        "nearby": [
            {
                "word": "lounger",
                "pos": "noun"
            },
            {
                "word": "lounge suit",
                "pos": "noun"
            },
            {
                "word": "loungewear",
                "pos": "noun"
            },
            {
                "word": "lour",
                "pos": "verb"
            },
            {
                "word": "louse",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "informal, comfortable clothing that you wear when relaxing at home",
                    "vi": "trang phục thân thiện, thoải mái mà bạn mặc khi thư giãn ở nhà"
                },
                "examples": [
                    {
                        "en": "The loungewear collection just gets better in the coming season.",
                        "vi": "Bộ sưu tập kính râm sẽ trở nên tốt hơn trong mùa tới."
                    }
                ]
            }
        ]
    },
    {
        "id": "949d57eabafb49efb41e99b843b08a10",
        "word": "off the peg",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/peɡ/",
            "us": "/peɡ/"
        },
        "nearby": [
            {
                "word": "peewee",
                "pos": "adjective"
            },
            {
                "word": "peewit",
                "pos": "noun"
            },
            {
                "word": "peg",
                "pos": "noun"
            },
            {
                "word": "peg",
                "pos": "verb"
            },
            {
                "word": "peg away",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a short piece of wood, metal or plastic used for holding things together, hanging things on, marking a position, etc.",
                    "vi": "một mảnh gỗ, kim loại hoặc nhựa ngắn dùng để giữ các vật lại với nhau, treo các vật, đánh dấu vị trí, v.v."
                },
                "examples": [
                    {
                        "en": "There's a peg near the door to hang your coat on.",
                        "vi": "Có một cái chốt gần cửa để bạn treo áo khoác vào."
                    },
                    {
                        "en": "Mark the boundary with pegs.",
                        "vi": "Đánh dấu ranh giới bằng chốt."
                    },
                    {
                        "en": "The score is kept by inserting pegs into a board.",
                        "vi": "Điểm số được giữ bằng cách chèn các chốt vào bảng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a small pointed piece of wood or metal that you attach to the ropes of a tent and push into the ground in order to hold the tent in place",
                    "vi": "một miếng gỗ hoặc kim loại nhỏ có đầu nhọn mà bạn gắn vào dây của lều và đẩy xuống đất để giữ lều ở đúng vị trí"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a piece of wood or plastic used for attaching wet clothes to a clothes line",
                    "vi": "một miếng gỗ hoặc nhựa dùng để gắn quần áo ướt vào dây phơi quần áo"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a short piece of wood, metal or plastic that you turn to make the strings of a musical instrument tighter or looser",
                    "vi": "một mảnh gỗ, kim loại hoặc nhựa ngắn mà bạn xoay để làm cho dây của một nhạc cụ chặt hơn hoặc lỏng hơn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a small amount of a drink, especially a strong alcoholic one",
                    "vi": "một lượng nhỏ đồ uống, đặc biệt là đồ uống có cồn mạnh"
                },
                "examples": [
                    {
                        "en": "a peg of whisky",
                        "vi": "một chai rượu whisky"
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody realize that they are not as good, important, etc. as they think they are",
                    "vi": "để làm cho ai đó nhận ra rằng họ không tốt, không quan trọng, v.v. như họ nghĩ"
                },
                "examples": [
                    {
                        "en": "He needed to be taken down a peg or two.",
                        "vi": "Anh ta cần bị hạ một hoặc hai chốt."
                    }
                ]
            },
            {
                "define": {
                    "en": "made to a standard average size and not made especially to fit you",
                    "vi": "được làm theo kích thước trung bình tiêu chuẩn và không được làm đặc biệt để vừa với bạn"
                },
                "examples": [
                    {
                        "en": "He buys his clothes off the peg.",
                        "vi": "Anh ta mua quần áo của mình theo phương thức chốt giá."
                    },
                    {
                        "en": "off-the-peg fashions",
                        "vi": "thời trang off-the-peg"
                    }
                ]
            },
            {
                "define": {
                    "en": "something that gives you an excuse or opportunity to discuss or explain something",
                    "vi": "điều gì đó cho bạn cái cớ hoặc cơ hội để thảo luận hoặc giải thích điều gì đó"
                },
                "examples": [
                    {
                        "en": "The character provides a peg to hang the writer’s political ideas on.",
                        "vi": "Nhân vật cung cấp một chốt để treo các ý tưởng chính trị của nhà văn vào."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who does not feel happy or comfortable in a particular situation, or who is not suitable for it",
                    "vi": "một người không cảm thấy hạnh phúc hoặc thoải mái trong một tình huống cụ thể, hoặc người không phù hợp với nó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "58d2264c39ee4ed7be315cd26f0ad997",
        "word": "off the rack",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/ræk/",
            "us": "/ræk/"
        },
        "nearby": [
            {
                "word": "racist",
                "pos": "adjective"
            },
            {
                "word": "racist",
                "pos": "noun"
            },
            {
                "word": "rack",
                "pos": "noun"
            },
            {
                "word": "rack",
                "pos": "verb"
            },
            {
                "word": "rack-and-pinion",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a piece of equipment, usually made of metal or wooden bars, that is used for holding things or for hanging things on",
                    "vi": "một phần của thiết bị, thường được làm bằng kim loại hoặc thanh gỗ, được sử dụng để giữ đồ vật hoặc để treo đồ vật"
                },
                "examples": [
                    {
                        "en": "a vegetable/wine/plate/toast rack",
                        "vi": "giá rau / rượu / đĩa / bánh mì nướng"
                    },
                    {
                        "en": "I looked through a rack of clothes at the back of the shop.",
                        "vi": "Tôi nhìn qua một giá quần áo ở phía sau cửa hàng."
                    },
                    {
                        "en": "Remove the cakes from the oven and cool on a wire rack.",
                        "vi": "Lấy bánh ra khỏi lò và để nguội trên giá dây."
                    }
                ]
            },
            {
                "define": {
                    "en": "an instrument of torture, used in the past for punishing and hurting people. Their arms and legs were tied to the wooden frame and then pulled in opposite directions, stretching the body.",
                    "vi": "một công cụ tra tấn, được sử dụng trong quá khứ để trừng phạt và làm tổn thương con người. Tay và chân của họ bị trói vào khung gỗ rồi kéo ngược chiều nhau, kéo căng cơ thể."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a particular piece of meat that includes the front ribs and is cooked in the oven",
                    "vi": "một miếng thịt cụ thể bao gồm cả xương sườn phía trước và được làm chín trong lò"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a part of a machine that consists of a bar with parts that a wheel or gear can fit into",
                    "vi": "một bộ phận của máy bao gồm một thanh có các bộ phận mà bánh xe hoặc bánh răng có thể lắp vào"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to get into a bad condition",
                    "vi": "rơi vào tình trạng tồi tệ"
                },
                "examples": [
                    {
                        "en": "They let the house go to rack and ruin.",
                        "vi": "Họ để cho ngôi nhà lên giá và đổ nát."
                    }
                ]
            },
            {
                "define": {
                    "en": "made to a standard average size and not made specially to fit you",
                    "vi": "được làm theo kích thước trung bình tiêu chuẩn và không được làm đặc biệt để vừa với bạn"
                },
                "examples": [
                    {
                        "en": "He buys his clothes off the rack",
                        "vi": "Anh ấy mua quần áo của mình từ giá"
                    },
                    {
                        "en": "off-the-rack fashions",
                        "vi": "thời trang off-the-rack"
                    }
                ]
            },
            {
                "define": {
                    "en": "feeling extreme pressure, worry or pain",
                    "vi": "cảm thấy cực kỳ áp lực, lo lắng hoặc đau đớn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "f4dd90b683b94f26aa65eb25e37dbc6d",
        "word": "outerwear",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈaʊtəweə(r)/",
            "us": "/ˈaʊtərwer/"
        },
        "nearby": [
            {
                "word": "outermost",
                "pos": "adjective"
            },
            {
                "word": "outer space",
                "pos": "noun"
            },
            {
                "word": "outerwear",
                "pos": "noun"
            },
            {
                "word": "outface",
                "pos": "verb"
            },
            {
                "word": "outfall",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "clothes such as coats that you wear over other clothing, especially outside",
                    "vi": "quần áo chẳng hạn như áo khoác mà bạn mặc trên quần áo khác, đặc biệt là bên ngoài"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "1c14ff9557544d55b60551c71e988e24",
        "word": "retro",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈretrəʊ/",
            "us": "/ˈretrəʊ/"
        },
        "nearby": [
            {
                "word": "retrieve",
                "pos": "verb"
            },
            {
                "word": "retriever",
                "pos": "noun"
            },
            {
                "word": "retro",
                "pos": "adjective"
            },
            {
                "word": "retro-",
                "pos": "prefix"
            },
            {
                "word": "retroactive",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "using styles or fashions from the recent past",
                    "vi": "sử dụng phong cách hoặc mốt trong quá khứ gần đây"
                },
                "examples": [
                    {
                        "en": "the current Seventies retro trend",
                        "vi": "xu hướng retro của những năm bảy mươi hiện tại"
                    }
                ]
            }
        ]
    },
    {
        "id": "b4775fbef730487899fcf16cfba490d6",
        "word": "sweatshop",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈswetʃɒp/",
            "us": "/ˈswetʃɑːp/"
        },
        "nearby": [
            {
                "word": "sweatpants",
                "pos": "noun"
            },
            {
                "word": "sweatshirt",
                "pos": "noun"
            },
            {
                "word": "sweatshop",
                "pos": "noun"
            },
            {
                "word": "sweatsuit",
                "pos": "noun"
            },
            {
                "word": "sweaty",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a place where people work for low wages in poor conditions",
                    "vi": "một nơi mà mọi người làm việc với mức lương thấp trong điều kiện tồi tệ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "3d41d6dc93ef4fb99834e0f4e85fe905",
        "word": "textile",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈtekstaɪl/",
            "us": "/ˈtekstaɪl/"
        },
        "nearby": [
            {
                "word": "text editor",
                "pos": "noun"
            },
            {
                "word": "texter",
                "pos": "noun"
            },
            {
                "word": "textile",
                "pos": "noun"
            },
            {
                "word": "texting",
                "pos": "noun"
            },
            {
                "word": "text message",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "any type of cloth made by weaving or knitting",
                    "vi": "bất kỳ loại vải nào được làm bằng dệt hoặc đan"
                },
                "examples": [
                    {
                        "en": "a factory producing a range of textiles",
                        "vi": "một nhà máy sản xuất nhiều loại hàng dệt may"
                    },
                    {
                        "en": "the textile industry",
                        "vi": "ngành công nghiệp dệt may"
                    },
                    {
                        "en": "a textile designer",
                        "vi": "một nhà thiết kế dệt may"
                    },
                    {
                        "en": "a producer of fine cotton textiles",
                        "vi": "nhà sản xuất hàng dệt bông mịn"
                    }
                ]
            },
            {
                "define": {
                    "en": "the industry that makes cloth",
                    "vi": "ngành công nghiệp sản xuất vải"
                },
                "examples": [
                    {
                        "en": "He got a job in textiles.",
                        "vi": "Anh ấy kiếm được một công việc trong lĩnh vực dệt may."
                    }
                ]
            }
        ]
    },
    {
        "id": "2d6e6ac4b46649eb8da10f44c333bef8",
        "word": "vogue",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/vəʊɡ/",
            "us": "/vəʊɡ/"
        },
        "nearby": [
            {
                "word": "vodka",
                "pos": "noun"
            },
            {
                "word": "voetstoots",
                "pos": "adjective, adverb"
            },
            {
                "word": "vogue",
                "pos": "noun"
            },
            {
                "word": "Vogue",
                "pos": ""
            },
            {
                "word": "voice",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a fashion for something",
                    "vi": "thời trang cho một cái gì đó"
                },
                "examples": [
                    {
                        "en": "vogue for something the vogue for child-centred education",
                        "vi": "thịnh hành cho một cái gì đó thịnh hành cho giáo dục lấy trẻ em làm trung tâm"
                    },
                    {
                        "en": "in vogue Black is in vogue again.",
                        "vi": "đang thịnh hành Màu đen lại thịnh hành."
                    },
                    {
                        "en": "Sixties music has come back into vogue.",
                        "vi": "Âm nhạc thập niên 60 đã trở lại thịnh hành."
                    },
                    {
                        "en": "This novel had a great vogue ten years ago.",
                        "vi": "Cuốn tiểu thuyết này đã thịnh hành cách đây mười năm."
                    }
                ]
            }
        ]
    }
]