[
    {
        "id": "96c4684023da4723886b1ceee78f2ba1",
        "word": "hero",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈhɪərəʊ/",
            "us": "/ˈhɪrəʊ/"
        },
        "nearby": [
            {
                "word": "hernia",
                "pos": "noun"
            },
            {
                "word": "herniated disc",
                "pos": "noun"
            },
            {
                "word": "hero",
                "pos": "noun"
            },
            {
                "word": "heroic",
                "pos": "adjective"
            },
            {
                "word": "heroically",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who is admired by many people for doing something brave or good",
                    "vi": "một người được nhiều người ngưỡng mộ vì đã làm điều gì đó dũng cảm hoặc tốt"
                },
                "examples": [
                    {
                        "en": "a war hero (= somebody who was very brave during a war)",
                        "vi": "một anh hùng chiến tranh (= ai đó rất dũng cảm trong chiến tranh)"
                    },
                    {
                        "en": "a hero of the First World War",
                        "vi": "một anh hùng trong chiến tranh thế giới thứ nhất"
                    },
                    {
                        "en": "one of the country’s national heroes",
                        "vi": "một trong những anh hùng dân tộc của đất nước"
                    },
                    {
                        "en": "His charity work has made him something of a local hero.",
                        "vi": "Công việc từ thiện của anh ấy đã khiến anh ấy trở thành một anh hùng của địa phương."
                    },
                    {
                        "en": "The Olympic team were given a hero's welcome on their return home.",
                        "vi": "Đội tuyển Olympic đã được chào đón một người hùng trong chuyến trở về nhà."
                    },
                    {
                        "en": "Scientists like her are typically unsung heroes (= people who are not praised or famous but deserve to be).",
                        "vi": "Các nhà khoa học như cô ấy thường là những anh hùng thầm lặng (= những người không được ca ngợi hay nổi tiếng nhưng xứng đáng được trở thành)."
                    },
                    {
                        "en": "He was hailed as a hero after the rescue.",
                        "vi": "Anh được ca ngợi như một anh hùng sau cuộc giải cứu."
                    }
                ]
            },
            {
                "define": {
                    "en": "the main male character in a story, novel, film, etc.",
                    "vi": "nhân vật nam chính trong truyện, tiểu thuyết, phim, v.v."
                },
                "examples": [
                    {
                        "en": "The hero of the novel is a ten-year old boy.",
                        "vi": "Anh hùng của cuốn tiểu thuyết là một cậu bé mười tuổi."
                    },
                    {
                        "en": "action heroes like Bruce Willis",
                        "vi": "những anh hùng hành động như Bruce Willis"
                    }
                ]
            },
            {
                "define": {
                    "en": "a person that you admire because of a particular quality or skill that they have",
                    "vi": "một người mà bạn ngưỡng mộ vì phẩm chất hoặc kỹ năng cụ thể mà họ có"
                },
                "examples": [
                    {
                        "en": "my childhood hero",
                        "vi": "anh hùng thời thơ ấu của tôi"
                    },
                    {
                        "en": "hero to somebody He became a hero to millions for his decision to oppose the government's reforms.",
                        "vi": "anh hùng đối với ai đó Anh trở thành anh hùng đối với hàng triệu người vì quyết định chống lại những cải cách của chính phủ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a long bread roll split open along its length and filled with various types of food",
                    "vi": "một cuộn bánh mì dài được tách ra dọc theo chiều dài của nó và chứa đầy các loại thức ăn khác nhau"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "608839231c4e41ff8848e6b5dc80c9b6",
        "word": "heroine",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈherəʊɪn/",
            "us": "/ˈherəʊɪn/"
        },
        "nearby": [
            {
                "word": "heroics",
                "pos": "noun"
            },
            {
                "word": "heroin",
                "pos": "noun"
            },
            {
                "word": "heroine",
                "pos": "noun"
            },
            {
                "word": "heroism",
                "pos": "noun"
            },
            {
                "word": "heron",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a girl or woman who is admired by many for doing something brave or good",
                    "vi": "một cô gái hoặc phụ nữ được nhiều người ngưỡng mộ vì đã làm điều gì đó dũng cảm hoặc tốt"
                },
                "examples": [
                    {
                        "en": "the heroines of the revolution",
                        "vi": "các nữ anh hùng của cuộc cách mạng"
                    },
                    {
                        "en": "She remains one of the unsung heroines of the Second World War.",
                        "vi": "Cô vẫn là một trong những nữ anh hùng vô danh của Chiến tranh thế giới thứ hai."
                    }
                ]
            },
            {
                "define": {
                    "en": "the main female character in a story, novel, film, etc.",
                    "vi": "nhân vật nữ chính trong truyện, tiểu thuyết, phim, v.v."
                },
                "examples": [
                    {
                        "en": "The heroine is played by Demi Moore.",
                        "vi": "Nhân vật nữ chính do Demi Moore thủ vai."
                    },
                    {
                        "en": "She has played several of Shakespeare's heroines—Portia and Juliet among them.",
                        "vi": "Cô ấy đã đóng một số nữ anh hùng của Shakespeare — trong số đó có Portia và Juliet."
                    }
                ]
            },
            {
                "define": {
                    "en": "a woman that you admire because of a particular quality or skill that she has",
                    "vi": "một người phụ nữ mà bạn ngưỡng mộ vì phẩm chất hoặc kỹ năng cụ thể mà cô ấy có"
                },
                "examples": [
                    {
                        "en": "Madonna was her teenage heroine.",
                        "vi": "Madonna là nữ anh hùng tuổi teen của cô ấy."
                    },
                    {
                        "en": "She was thrilled to be interviewing her childhood heroine.",
                        "vi": "Cô ấy rất xúc động khi được phỏng vấn nữ anh hùng thời thơ ấu của mình."
                    }
                ]
            }
        ]
    },
    {
        "id": "49439c5bcc874d629815b3324b5931db",
        "word": "brave",
        "pos": "adjective",
        "level": "b1",
        "phonetic": {
            "uk": "/breɪv/",
            "us": "/breɪv/"
        },
        "nearby": [
            {
                "word": "bratty",
                "pos": "adjective"
            },
            {
                "word": "bravado",
                "pos": "noun"
            },
            {
                "word": "brave",
                "pos": "adjective"
            },
            {
                "word": "brave",
                "pos": "verb"
            },
            {
                "word": "brave",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "willing to do things that are difficult, dangerous or painful; not afraid",
                    "vi": "sẵn sàng làm những việc khó khăn, nguy hiểm hoặc đau đớn; không sợ"
                },
                "examples": [
                    {
                        "en": "brave men and women",
                        "vi": "những người đàn ông và phụ nữ dũng cảm"
                    },
                    {
                        "en": "Be brave!",
                        "vi": "Hãy can đảm lên!"
                    },
                    {
                        "en": "I wasn't brave enough to tell her what I thought of her.",
                        "vi": "Tôi không đủ can đảm để nói với cô ấy những gì tôi nghĩ về cô ấy."
                    },
                    {
                        "en": "Desperation had made me brave.",
                        "vi": "Sự tuyệt vọng đã khiến tôi trở nên dũng cảm."
                    },
                    {
                        "en": "She has been incredibly brave.",
                        "vi": "Cô ấy đã vô cùng dũng cảm."
                    }
                ]
            },
            {
                "define": {
                    "en": "requiring or showing courage",
                    "vi": "đòi hỏi hoặc thể hiện sự can đảm"
                },
                "examples": [
                    {
                        "en": "She took the brave decision to start her own business.",
                        "vi": "Cô đã quyết định dũng cảm để bắt đầu kinh doanh của riêng mình."
                    },
                    {
                        "en": "She died after a brave fight against cancer.",
                        "vi": "Cô qua đời sau một thời gian dũng cảm chiến đấu chống lại căn bệnh ung thư."
                    },
                    {
                        "en": "He felt homesick, but made a brave attempt to appear cheerful.",
                        "vi": "Anh cảm thấy nhớ nhà, nhưng đã cố gắng dũng cảm để tỏ ra vui vẻ."
                    }
                ]
            },
            {
                "define": {
                    "en": "new in an impressive way",
                    "vi": "mới một cách ấn tượng"
                },
                "examples": [
                    {
                        "en": "a vision of a brave new Britain",
                        "vi": "tầm nhìn về một nước Anh mới dũng cảm"
                    }
                ]
            },
            {
                "define": {
                    "en": "a situation or society that changes in a way that is meant to improve people’s lives but is often a source of extra problems",
                    "vi": "một tình huống hoặc xã hội thay đổi theo hướng nhằm cải thiện cuộc sống của con người nhưng thường là nguồn gốc của các vấn đề phụ"
                },
                "examples": [
                    {
                        "en": "the brave new world of technology",
                        "vi": "thế giới công nghệ mới dũng cảm"
                    },
                    {
                        "en": "the architects' vision of a brave new world of pristine concrete",
                        "vi": "tầm nhìn của các kiến trúc sư về một thế giới mới đầy dũng cảm của bê tông nguyên sơ"
                    }
                ]
            },
            {
                "define": {
                    "en": "to pretend that you feel confident and happy when you do not",
                    "vi": "giả vờ rằng bạn cảm thấy tự tin và hạnh phúc khi bạn không"
                },
                "examples": [
                    {
                        "en": "I had to put on a brave face and try to show him that I wasn’t worried.",
                        "vi": "Tôi phải tỏ ra dũng cảm và cố gắng cho anh ấy thấy rằng tôi không lo lắng."
                    },
                    {
                        "en": "She put a brave face on her illness.",
                        "vi": "Cô ấy dũng cảm đối mặt với bệnh tật của mình."
                    }
                ]
            }
        ]
    },
    {
        "id": "2fc58e579e3740eab9a3ddd7dd90f576",
        "word": "character",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈkærəktə(r)/",
            "us": "/ˈkærəktər/"
        },
        "nearby": [
            {
                "word": "char",
                "pos": "verb"
            },
            {
                "word": "charabanc",
                "pos": "noun"
            },
            {
                "word": "character",
                "pos": "noun"
            },
            {
                "word": "character actor",
                "pos": "noun"
            },
            {
                "word": "character code",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person or an animal in a book, play or film",
                    "vi": "một người hoặc một con vật trong một cuốn sách, vở kịch hoặc bộ phim"
                },
                "examples": [
                    {
                        "en": "the main character in the film",
                        "vi": "nhân vật chính trong phim"
                    },
                    {
                        "en": "a major/minor character in the book",
                        "vi": "một nhân vật chính / phụ trong cuốn sách"
                    },
                    {
                        "en": "Who plays the main character?",
                        "vi": "Ai đóng vai nhân vật chính?"
                    },
                    {
                        "en": "He loves to draw and create his own cartoon characters.",
                        "vi": "Anh ấy thích vẽ và tạo ra các nhân vật hoạt hình của riêng mình."
                    },
                    {
                        "en": "Clint Eastwood's character is the most sympathetic in the movie.",
                        "vi": "Nhân vật của Clint Eastwood gây được thiện cảm nhất phim."
                    }
                ]
            },
            {
                "define": {
                    "en": "a particular type of person in a play, film or TV show",
                    "vi": "một kiểu người cụ thể trong vở kịch, phim hoặc chương trình truyền hình"
                },
                "examples": [
                    {
                        "en": "He has developed a skill set from his character work in film,TV and stage.",
                        "vi": "Anh ấy đã phát triển một bộ kỹ năng từ công việc nhân vật của mình trong phim, truyền hình và sân khấu."
                    }
                ]
            },
            {
                "define": {
                    "en": "all the qualities and features that make a person different from others",
                    "vi": "tất cả những phẩm chất và đặc điểm khiến một người khác biệt với những người khác"
                },
                "examples": [
                    {
                        "en": "to have a strong/weak character",
                        "vi": "có một nhân vật mạnh / yếu"
                    },
                    {
                        "en": "character traits",
                        "vi": "đặc điểm tính cách"
                    },
                    {
                        "en": "character defects",
                        "vi": "khuyết tật nhân vật"
                    },
                    {
                        "en": "The book gives a fascinating insight into Mrs Obama's character.",
                        "vi": "Cuốn sách mang đến một cái nhìn sâu sắc hấp dẫn về tính cách của bà Obama."
                    },
                    {
                        "en": "Generosity is part of the American character.",
                        "vi": "Sự hào phóng là một phần trong tính cách của người Mỹ."
                    }
                ]
            },
            {
                "define": {
                    "en": "strong personal qualities such as the ability to deal with difficult or dangerous situations",
                    "vi": "phẩm chất cá nhân mạnh mẽ như khả năng đối phó với các tình huống khó khăn hoặc nguy hiểm"
                },
                "examples": [
                    {
                        "en": "Everyone admires her strength of character and determination.",
                        "vi": "Mọi người đều khâm phục nghị lực và lòng quyết tâm của cô ấy."
                    },
                    {
                        "en": "He showed great character returning to the sport after his accident.",
                        "vi": "Anh ấy đã thể hiện bản lĩnh tuyệt vời khi trở lại với môn thể thao này sau tai nạn của mình."
                    },
                    {
                        "en": "Adventure camps are considered to be character-building (= meant to improve somebody's strong qualities).",
                        "vi": "Trại phiêu lưu được coi là hoạt động xây dựng nhân vật (= nhằm nâng cao phẩm chất mạnh mẽ của ai đó)."
                    }
                ]
            },
            {
                "define": {
                    "en": "the way that something is; a particular quality or feature that a thing, an event or a place has",
                    "vi": "cách mà một cái gì đó là; chất lượng hoặc tính năng cụ thể mà một sự vật, một sự kiện hoặc một địa điểm có"
                },
                "examples": [
                    {
                        "en": "The character of the neighbourhood hasn't changed at all.",
                        "vi": "Tính cách của khu phố không hề thay đổi."
                    },
                    {
                        "en": "I love the delicate character of the light in the evening.",
                        "vi": "Tôi yêu đặc tính mong manh của ánh sáng vào buổi tối."
                    },
                    {
                        "en": "The police pointed out the illegal character of the protest action.",
                        "vi": "Cảnh sát đã chỉ ra đặc điểm bất hợp pháp của hành động biểu tình."
                    },
                    {
                        "en": "in character buildings that are very simple in character",
                        "vi": "trong các tòa nhà nhân vật rất đơn giản về tính cách"
                    }
                ]
            },
            {
                "define": {
                    "en": "the interesting or unusual quality that a place or a person has",
                    "vi": "chất lượng thú vị hoặc bất thường mà một nơi hoặc một người có"
                },
                "examples": [
                    {
                        "en": "The modern hotels here have no real character.",
                        "vi": "Các khách sạn hiện đại ở đây không có nhân vật thực sự."
                    },
                    {
                        "en": "a face with a lot of character",
                        "vi": "một khuôn mặt có rất nhiều tính cách"
                    }
                ]
            },
            {
                "define": {
                    "en": "a person, particularly an unpleasant or strange one",
                    "vi": "một người, đặc biệt là một người khó ưa hoặc kỳ lạ"
                },
                "examples": [
                    {
                        "en": "There were some really strange characters hanging around the bar.",
                        "vi": "Có một số nhân vật thực sự kỳ lạ quanh quán bar."
                    }
                ]
            },
            {
                "define": {
                    "en": "an interesting or unusual person",
                    "vi": "một người thú vị hoặc bất thường"
                },
                "examples": [
                    {
                        "en": "She's a character!",
                        "vi": "Cô ấy là một nhân vật!"
                    }
                ]
            },
            {
                "define": {
                    "en": "the opinion that people have of you, particularly of whether you can be trusted or relied on",
                    "vi": "ý kiến mà mọi người có về bạn, đặc biệt là về việc bạn có thể được tin cậy hay dựa vào"
                },
                "examples": [
                    {
                        "en": "She was a victim of character assassination (= an unfair attack on the good opinion people had of her).",
                        "vi": "Cô là nạn nhân của vụ ám sát nhân vật (= một cuộc tấn công không công bằng vào quan điểm tốt mà mọi người dành cho cô)."
                    },
                    {
                        "en": "a slur/attack on his character",
                        "vi": "một cuộc tấn công vào nhân vật của anh ta"
                    },
                    {
                        "en": "My teacher agreed to be a character witness for me in court.",
                        "vi": "Giáo viên của tôi đã đồng ý làm nhân chứng cho tôi trước tòa."
                    },
                    {
                        "en": "a character reference (= a letter that a person who knows you well writes to an employer to tell them about your good qualities)",
                        "vi": "một tham chiếu về nhân vật (= một lá thư mà một người biết rõ về bạn viết cho nhà tuyển dụng để nói với họ về những phẩm chất tốt của bạn)"
                    }
                ]
            },
            {
                "define": {
                    "en": "a letter, sign, mark or symbol used in writing, in printing or on computers",
                    "vi": "một chữ cái, ký hiệu, dấu hoặc ký hiệu được sử dụng trong văn bản, in ấn hoặc trên máy tính"
                },
                "examples": [
                    {
                        "en": "These are the Chinese characters meaning ‘wind’ and ‘water’.",
                        "vi": "Đây là những ký tự Trung Quốc có nghĩa là \"gió\" và \"nước\"."
                    },
                    {
                        "en": "This size of type produces a line 30 characters long.",
                        "vi": "Loại kích thước này tạo ra một dòng dài 30 ký tự."
                    },
                    {
                        "en": "optical character recognition",
                        "vi": "nhận dạng ký tự quang học"
                    },
                    {
                        "en": "The URL contained non-standard characters like question marks.",
                        "vi": "URL chứa các ký tự không chuẩn như dấu chấm hỏi."
                    }
                ]
            },
            {
                "define": {
                    "en": "typical/not typical of a person’s character",
                    "vi": "điển hình / không điển hình về tính cách của một người"
                },
                "examples": [
                    {
                        "en": "Her behaviour last night was completely out of character.",
                        "vi": "Hành vi của cô đêm qua hoàn toàn không có tính cách."
                    },
                    {
                        "en": "The lawyer argued that his client's violent behaviour was out of character.",
                        "vi": "Luật sư lập luận rằng hành vi bạo lực của thân chủ của mình là ngoài tính cách."
                    }
                ]
            },
            {
                "define": {
                    "en": "in the same style as something",
                    "vi": "theo cùng một phong cách với một cái gì đó"
                },
                "examples": [
                    {
                        "en": "The new wing of the museum was not really in character with the rest of the building.",
                        "vi": "Cánh mới của bảo tàng không thực sự đặc trưng với phần còn lại của tòa nhà."
                    }
                ]
            }
        ]
    },
    {
        "id": "f3355e2b417a450eb6d1476bd95c6130",
        "word": "strong",
        "pos": "adjective",
        "level": "b1",
        "phonetic": {
            "uk": "/strɒŋ/",
            "us": "/strɔːŋ/"
        },
        "nearby": [
            {
                "word": "stroller",
                "pos": "noun"
            },
            {
                "word": "strolling players",
                "pos": "noun"
            },
            {
                "word": "strong",
                "pos": "adjective"
            },
            {
                "word": "strong-arm",
                "pos": "adjective"
            },
            {
                "word": "strongbox",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "having a lot of physical power so that you can lift heavy weights, do hard physical work, etc.",
                    "vi": "có nhiều thể lực để bạn có thể nâng tạ nặng, tập thể dục nặng nhọc, v.v."
                },
                "examples": [
                    {
                        "en": "He's strong enough to lift a car!",
                        "vi": "Anh ấy đủ khỏe để nâng một chiếc ô tô!"
                    },
                    {
                        "en": "strong muscles",
                        "vi": "cơ bắp khỏe mạnh"
                    },
                    {
                        "en": "She wasn't a strong swimmer (= she could not swim well).",
                        "vi": "Cô ấy không phải là một vận động viên bơi lội mạnh mẽ (= cô ấy không thể bơi giỏi)."
                    }
                ]
            },
            {
                "define": {
                    "en": "having great power",
                    "vi": "có sức mạnh to lớn"
                },
                "examples": [
                    {
                        "en": "Stay indoors in the middle of the day, when the sun is strongest.",
                        "vi": "Ở trong nhà vào giữa ngày, khi mặt trời mạnh nhất."
                    },
                    {
                        "en": "a strong wind",
                        "vi": "Một cơn gió mạnh"
                    },
                    {
                        "en": "a strong magnet/current",
                        "vi": "một nam châm mạnh / dòng điện"
                    }
                ]
            },
            {
                "define": {
                    "en": "having a powerful effect on the body or mind",
                    "vi": "có tác động mạnh mẽ đến cơ thể hoặc tâm trí"
                },
                "examples": [
                    {
                        "en": "a strong drug",
                        "vi": "một loại thuốc mạnh"
                    },
                    {
                        "en": "His imagery made a strong impression on the critics.",
                        "vi": "Hình ảnh của ông đã gây ấn tượng mạnh đối với các nhà phê bình."
                    }
                ]
            },
            {
                "define": {
                    "en": "having a lot of power or influence",
                    "vi": "có nhiều quyền lực hoặc ảnh hưởng"
                },
                "examples": [
                    {
                        "en": "a strong leader",
                        "vi": "một nhà lãnh đạo mạnh mẽ"
                    },
                    {
                        "en": "What the country needs right now is a strong government.",
                        "vi": "Điều đất nước cần ngay bây giờ là một chính phủ mạnh."
                    }
                ]
            },
            {
                "define": {
                    "en": "people who are rich or powerful",
                    "vi": "những người giàu có hoặc quyền lực"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "difficult to attack or criticize",
                    "vi": "khó tấn công hoặc chỉ trích"
                },
                "examples": [
                    {
                        "en": "There is strong evidence of a link between exercise and a healthy heart.",
                        "vi": "Có bằng chứng rõ ràng về mối liên hệ giữa tập thể dục và một trái tim khỏe mạnh."
                    },
                    {
                        "en": "You have a strong case for getting your job back.",
                        "vi": "Bạn có một trường hợp mạnh mẽ để lấy lại công việc của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "very powerful and difficult for people to fight against or defeat",
                    "vi": "rất mạnh mẽ và rất khó để mọi người chống lại hoặc đánh bại"
                },
                "examples": [
                    {
                        "en": "a strong team",
                        "vi": "một đội mạnh"
                    },
                    {
                        "en": "The proposal aroused strong opposition.",
                        "vi": "Đề xuất đã làm dấy lên sự phản đối mạnh mẽ."
                    },
                    {
                        "en": "The temptation to tell her everything was very strong.",
                        "vi": "Sự cám dỗ để nói với cô ấy mọi thứ rất mạnh mẽ."
                    },
                    {
                        "en": "He exerts an extremely strong influence on his classmates.",
                        "vi": "Anh ấy có ảnh hưởng cực kỳ mạnh mẽ đến các bạn cùng lớp của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "very powerful",
                    "vi": "rất mạnh"
                },
                "examples": [
                    {
                        "en": "strong support for the government",
                        "vi": "hỗ trợ mạnh mẽ cho chính phủ"
                    },
                    {
                        "en": "People have strong feelings about this issue.",
                        "vi": "Mọi người có cảm xúc mạnh mẽ về vấn đề này."
                    }
                ]
            },
            {
                "define": {
                    "en": "holding an opinion or a belief very seriously",
                    "vi": "giữ một ý kiến hoặc một niềm tin rất nghiêm túc"
                },
                "examples": [
                    {
                        "en": "a strong supporter of the government",
                        "vi": "một người ủng hộ mạnh mẽ của chính phủ"
                    },
                    {
                        "en": "a strong opponent",
                        "vi": "một đối thủ mạnh"
                    },
                    {
                        "en": "She has long been one of the strongest advocates of sanctions.",
                        "vi": "Cô từ lâu đã là một trong những người ủng hộ mạnh mẽ nhất các biện pháp trừng phạt."
                    }
                ]
            },
            {
                "define": {
                    "en": "easy to see, hear, feel or smell; very great or intense",
                    "vi": "dễ nhìn, nghe, cảm nhận hoặc ngửi thấy; rất tuyệt vời hoặc dữ dội"
                },
                "examples": [
                    {
                        "en": "a strong smell",
                        "vi": "một mùi mạnh"
                    },
                    {
                        "en": "a strong feeling of nausea",
                        "vi": "một cảm giác buồn nôn mạnh mẽ"
                    },
                    {
                        "en": "a strong voice (= loud)",
                        "vi": "một giọng nói mạnh mẽ (= lớn)"
                    },
                    {
                        "en": "strong colours",
                        "vi": "màu sắc mạnh mẽ"
                    },
                    {
                        "en": "a face with strong features (= large and easy to notice)",
                        "vi": "một khuôn mặt với các đặc điểm mạnh mẽ (= lớn và dễ nhận thấy)"
                    },
                    {
                        "en": "She spoke with a strong Australian accent.",
                        "vi": "Cô ấy nói với một giọng Úc mạnh mẽ."
                    },
                    {
                        "en": "He was under strong pressure to resign.",
                        "vi": "Ông đã bị áp lực mạnh mẽ để từ chức."
                    }
                ]
            },
            {
                "define": {
                    "en": "having a lot of taste",
                    "vi": "có rất nhiều hương vị"
                },
                "examples": [
                    {
                        "en": "strong cheese",
                        "vi": "pho mát mạnh"
                    },
                    {
                        "en": "You'll need to use plenty of strong French mustard.",
                        "vi": "Bạn sẽ cần sử dụng nhiều mù tạt Pháp mạnh."
                    }
                ]
            },
            {
                "define": {
                    "en": "containing a lot of a substance",
                    "vi": "chứa nhiều chất"
                },
                "examples": [
                    {
                        "en": "strong black coffee",
                        "vi": "cà phê đen mạnh"
                    }
                ]
            },
            {
                "define": {
                    "en": "not easily broken or damaged; made well",
                    "vi": "không dễ bị vỡ hoặc hư hỏng; làm tốt"
                },
                "examples": [
                    {
                        "en": "The box looks strong enough.",
                        "vi": "Hộp trông đủ mạnh."
                    }
                ]
            },
            {
                "define": {
                    "en": "not easily upset or frightened; not easily influenced by other people",
                    "vi": "không dễ dàng khó chịu hoặc sợ hãi; không dễ bị ảnh hưởng bởi người khác"
                },
                "examples": [
                    {
                        "en": "You need strong nerves to ride a bike in London.",
                        "vi": "Bạn cần có thần kinh mạnh để đi xe đạp ở London."
                    },
                    {
                        "en": "Every child needs to develop a strong sense of identity.",
                        "vi": "Mỗi đứa trẻ cần phát triển một ý thức mạnh mẽ về bản sắc."
                    },
                    {
                        "en": "It's difficult, I know. But be strong!",
                        "vi": "Nó khó, tôi biết. Nhưng hãy mạnh mẽ lên!"
                    },
                    {
                        "en": "a strong personality",
                        "vi": "một cá tính mạnh mẽ"
                    },
                    {
                        "en": "She’s had a strong will since she was a baby.",
                        "vi": "Cô ấy đã có một ý chí mạnh mẽ từ khi còn là một đứa trẻ."
                    },
                    {
                        "en": "We must stand strong in the face of adversity.",
                        "vi": "Chúng ta phải mạnh mẽ đứng lên khi đối mặt với nghịch cảnh."
                    }
                ]
            },
            {
                "define": {
                    "en": "likely to succeed or happen",
                    "vi": "có khả năng thành công hoặc xảy ra"
                },
                "examples": [
                    {
                        "en": "a strong candidate for the job",
                        "vi": "một ứng cử viên sáng giá cho công việc"
                    },
                    {
                        "en": "You're in a strong position to negotiate a deal.",
                        "vi": "Bạn đang ở một vị trí vững chắc để thương lượng một thỏa thuận."
                    },
                    {
                        "en": "There's a strong possibility that we'll lose the game.",
                        "vi": "Có khả năng cao là chúng tôi sẽ thua trận."
                    }
                ]
            },
            {
                "define": {
                    "en": "having existed for a long time and functioning well; difficult to destroy",
                    "vi": "tồn tại lâu đời và hoạt động tốt; khó tiêu diệt"
                },
                "examples": [
                    {
                        "en": "a strong marriage",
                        "vi": "một cuộc hôn nhân bền chặt"
                    },
                    {
                        "en": "The college has strong links with local industry.",
                        "vi": "Trường có liên kết chặt chẽ với các ngành công nghiệp địa phương."
                    },
                    {
                        "en": "I know that their relationship is growing stronger every day.",
                        "vi": "Tôi biết rằng mối quan hệ của họ đang phát triển mạnh mẽ hơn mỗi ngày."
                    }
                ]
            },
            {
                "define": {
                    "en": "having a value that is high or increasing",
                    "vi": "có giá trị cao hoặc ngày càng tăng"
                },
                "examples": [
                    {
                        "en": "strong share prices",
                        "vi": "giá cổ phiếu mạnh"
                    },
                    {
                        "en": "The country is currently experiencing particularly strong economic growth.",
                        "vi": "Đất nước này hiện đang có tốc độ tăng trưởng kinh tế đặc biệt mạnh mẽ."
                    },
                    {
                        "en": "The euro is getting stronger against the dollar.",
                        "vi": "Đồng euro đang trở nên mạnh hơn so với đồng đô la."
                    },
                    {
                        "en": "This news helped keep the dollar relatively strong today.",
                        "vi": "Tin tức này đã giúp giữ cho đồng đô la tương đối mạnh trong ngày hôm nay."
                    }
                ]
            },
            {
                "define": {
                    "en": "in a safe financial position",
                    "vi": "ở một vị trí tài chính an toàn"
                },
                "examples": [
                    {
                        "en": "Their catering business remained strong despite the recession.",
                        "vi": "Hoạt động kinh doanh ăn uống của họ vẫn phát triển mạnh mẽ bất chấp suy thoái kinh tế."
                    }
                ]
            },
            {
                "define": {
                    "en": "good at something; done well",
                    "vi": "giỏi một cái gì đó; thực hiện tốt"
                },
                "examples": [
                    {
                        "en": "The play has a very strong cast.",
                        "vi": "Vở kịch có một dàn diễn viên rất hùng hậu."
                    },
                    {
                        "en": "The actors give extremely strong performances.",
                        "vi": "Các diễn viên cống hiến vô cùng mạnh mẽ."
                    },
                    {
                        "en": "Mathematics was never my strong point (= I was never very good at it).",
                        "vi": "Toán học chưa bao giờ là điểm mạnh của tôi (= Tôi chưa bao giờ giỏi nó)."
                    }
                ]
            },
            {
                "define": {
                    "en": "great in number",
                    "vi": "số lượng lớn"
                },
                "examples": [
                    {
                        "en": "There was a strong police presence at the demonstration.",
                        "vi": "Có một sự hiện diện mạnh mẽ của cảnh sát tại cuộc biểu tình."
                    },
                    {
                        "en": "Sales were surprisingly strong in the second half of the year.",
                        "vi": "Doanh số bán hàng tăng mạnh một cách đáng ngạc nhiên trong nửa cuối năm."
                    }
                ]
            },
            {
                "define": {
                    "en": "used after numbers to show the size of a group",
                    "vi": "được sử dụng sau các số để hiển thị quy mô của một nhóm"
                },
                "examples": [
                    {
                        "en": "a 5 000-strong crowd",
                        "vi": "một đám đông 5000 người"
                    },
                    {
                        "en": "The crowd was 5 000 strong.",
                        "vi": "Đám đông rất mạnh mẽ."
                    }
                ]
            },
            {
                "define": {
                    "en": "not easily affected by disease; healthy",
                    "vi": "không dễ bị ảnh hưởng bởi bệnh tật; mạnh khỏe"
                },
                "examples": [
                    {
                        "en": "These vitamins are meant to keep you healthy and strong.",
                        "vi": "Những loại vitamin này có tác dụng giữ cho bạn khỏe mạnh và cường tráng."
                    }
                ]
            },
            {
                "define": {
                    "en": "having a lot of force, often causing offence to people",
                    "vi": "có nhiều vũ lực, thường xuyên gây phản cảm cho mọi người"
                },
                "examples": [
                    {
                        "en": "The movie has been criticized for strong language (= swearing).",
                        "vi": "Phim bị chỉ trích vì ngôn từ mạnh mẽ (= chửi thề)."
                    }
                ]
            },
            {
                "define": {
                    "en": "forming the past tense and past participle by changing a vowel, not by adding a regular ending, for example sing, sang, sung",
                    "vi": "hình thành thì quá khứ và phân từ quá khứ bằng cách thay đổi một nguyên âm, không phải bằng cách thêm một kết thúc thông thường, ví dụ sing, sing, sing"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to describe the way some words are pronounced when they have stress. For example, the strong form of and is /ænd/.",
                    "vi": "được sử dụng để mô tả cách một số từ được phát âm khi chúng có trọng âm. Ví dụ, dạng mạnh của and is / ænd /."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to say that you think what somebody has said is unfair or too critical",
                    "vi": "từng nói rằng bạn nghĩ những gì ai đó đã nói là không công bằng hoặc quá chỉ trích"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "something that gives somebody an advantage over other people in a particular situation",
                    "vi": "thứ gì đó mang lại cho ai đó lợi thế hơn những người khác trong một tình huống cụ thể"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be good at something",
                    "vi": "trở nên giỏi hơn về cái gì đó"
                },
                "examples": [
                    {
                        "en": "I'm not very strong on dates (= I can't remember the dates of important events).",
                        "vi": "I’m not very strong on date (= Tôi không thể nhớ ngày của những sự kiện quan trọng)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have a lot of something",
                    "vi": "có rất nhiều thứ"
                },
                "examples": [
                    {
                        "en": "The report was strong on criticism, but short on practical suggestions.",
                        "vi": "Báo cáo mạnh về phản biện, nhưng ngắn về đề xuất thực tế."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be a subject that somebody knows a lot about",
                    "vi": "trở thành một chủ đề mà ai đó biết rất nhiều về"
                },
                "examples": [
                    {
                        "en": "I'm afraid geography is not my strong suit.",
                        "vi": "Tôi e rằng địa lý không phải là điểm mạnh của tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make your feelings clear in an aggressive way, especially your sexual feelings towards somebody",
                    "vi": "để làm rõ cảm xúc của bạn một cách hung hăng, đặc biệt là cảm xúc tình dục của bạn đối với ai đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to continue to be healthy, active or successful",
                    "vi": "để tiếp tục khỏe mạnh, năng động hoặc thành công"
                },
                "examples": [
                    {
                        "en": "My grandmother is 90 and still going strong.",
                        "vi": "Bà tôi đã 90 và vẫn còn khỏe."
                    },
                    {
                        "en": "The business is still going strong.",
                        "vi": "Công việc kinh doanh vẫn đang diễn ra mạnh mẽ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be able to see or do unpleasant things without feeling sick or upset",
                    "vi": "để có thể nhìn thấy hoặc làm những điều khó chịu mà không cảm thấy buồn nôn hoặc khó chịu"
                },
                "examples": [
                    {
                        "en": "You need a strong stomach to go on the giant roller coaster.",
                        "vi": "Bạn cần có một cái bụng khỏe để đi trên tàu lượn khổng lồ."
                    }
                ]
            }
        ]
    },
    {
        "id": "9088ca65fdf74e9788f48aaabd4bcf82",
        "word": "bold",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/bəʊld/",
            "us": "/bəʊld/"
        },
        "nearby": [
            {
                "word": "boisterously",
                "pos": "adverb"
            },
            {
                "word": "bok choy",
                "pos": "noun"
            },
            {
                "word": "bold",
                "pos": "adjective"
            },
            {
                "word": "bold",
                "pos": "noun"
            },
            {
                "word": "The Bold and the Beautiful",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "brave and confident; not afraid to say what you feel or to take risks",
                    "vi": "dũng cảm và tự tin; không ngại nói ra những gì bạn cảm thấy hoặc chấp nhận rủi ro"
                },
                "examples": [
                    {
                        "en": "It was a bold move on their part to open a business in France.",
                        "vi": "Đó là một bước đi táo bạo của họ khi mở một doanh nghiệp ở Pháp."
                    },
                    {
                        "en": "The wine made him bold enough to approach her.",
                        "vi": "Rượu khiến anh đủ táo bạo để tiếp cận cô."
                    },
                    {
                        "en": "a bold and fearless warrior",
                        "vi": "một chiến binh dũng cảm và không sợ hãi"
                    }
                ]
            },
            {
                "define": {
                    "en": "in a thick, dark type",
                    "vi": "trong một loại dày, tối"
                },
                "examples": [
                    {
                        "en": "Highlight the important words in bold type.",
                        "vi": "Đánh dấu những từ quan trọng trong kiểu in đậm."
                    },
                    {
                        "en": "bold lettering",
                        "vi": "chữ in đậm"
                    }
                ]
            },
            {
                "define": {
                    "en": "that can be easily seen; having a strong clear appearance",
                    "vi": "điều đó có thể dễ dàng nhận thấy; có một ngoại hình rõ ràng mạnh mẽ"
                },
                "examples": [
                    {
                        "en": "the bold outline of a mountain against the sky",
                        "vi": "đường viền táo bạo của một ngọn núi trên bầu trời"
                    },
                    {
                        "en": "She paints with bold strokes of the brush.",
                        "vi": "Cô ấy vẽ bằng những nét vẽ đậm của cọ."
                    }
                ]
            },
            {
                "define": {
                    "en": "used especially when politely asking a question or making a suggestion which you hope will not offend anyone (although it may criticize them slightly)",
                    "vi": "được sử dụng đặc biệt khi lịch sự đặt một câu hỏi hoặc đưa ra một đề xuất mà bạn hy vọng sẽ không xúc phạm bất kỳ ai (mặc dù nó có thể chỉ trích họ một chút)"
                },
                "examples": [
                    {
                        "en": "If I may be so bold as to suggest that he made a mistake in his calculations…",
                        "vi": "Nếu tôi có thể mạnh dạn đến mức cho rằng anh ấy đã mắc sai lầm trong tính toán của mình…"
                    }
                ]
            },
            {
                "define": {
                    "en": "without showing any respect, shame or fear",
                    "vi": "mà không thể hiện bất kỳ sự tôn trọng, xấu hổ hoặc sợ hãi"
                },
                "examples": [
                    {
                        "en": "She marched in here, bold as brass, and demanded a pay rise.",
                        "vi": "Cô ta tiến vào đây, dạn dĩ như đồng thau, và đòi tăng lương."
                    }
                ]
            }
        ]
    },
    {
        "id": "5289ba84699a4852bc96f6661833ddba",
        "word": "courage",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈkʌrɪdʒ/",
            "us": "/ˈkɜːrɪdʒ/"
        },
        "nearby": [
            {
                "word": "coupon",
                "pos": "noun"
            },
            {
                "word": "couponing",
                "pos": "noun"
            },
            {
                "word": "courage",
                "pos": "noun"
            },
            {
                "word": "courageous",
                "pos": "adjective"
            },
            {
                "word": "courageously",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the ability to do something dangerous, or to face pain or opposition, without showing fear",
                    "vi": "khả năng làm điều gì đó nguy hiểm hoặc đối mặt với đau đớn hoặc chống đối mà không hề tỏ ra sợ hãi"
                },
                "examples": [
                    {
                        "en": "He showed great courage and determination.",
                        "vi": "Anh ấy đã thể hiện sự dũng cảm và quyết tâm cao độ."
                    },
                    {
                        "en": "moral/physical courage",
                        "vi": "lòng can đảm về đạo đức / thể chất"
                    },
                    {
                        "en": "courage to do something They had the courage to stand up and fight for what they believed in.",
                        "vi": "can đảm để làm điều gì đó Họ có can đảm để đứng lên và chiến đấu cho những gì họ tin tưởng."
                    },
                    {
                        "en": "He couldn't find the courage to tell his daughters what had happened.",
                        "vi": "Ông không thể tìm thấy can đảm để nói với các con gái của mình những gì đã xảy ra."
                    },
                    {
                        "en": "Many said that the women's stories gave them the courage to pursue their goals",
                        "vi": "Nhiều người nói rằng câu chuyện của những người phụ nữ đã giúp họ can đảm để theo đuổi mục tiêu của mình"
                    },
                    {
                        "en": "I haven't yet plucked up the courage to ask her.",
                        "vi": "Tôi vẫn chưa lấy hết can đảm để hỏi cô ấy."
                    },
                    {
                        "en": "It takes courage to sing in public.",
                        "vi": "Cần có can đảm để hát trước đám đông."
                    },
                    {
                        "en": "His courage in battle won him a promotion.",
                        "vi": "Sự can đảm của anh ấy trong trận chiến đã giúp anh ấy được thăng chức."
                    },
                    {
                        "en": "She displayed remarkable courage in the face of danger.",
                        "vi": "Cô ấy đã thể hiện sự dũng cảm đáng nể khi đối mặt với nguy hiểm."
                    },
                    {
                        "en": "courage in doing something I admire your courage in saying what you think.",
                        "vi": "can đảm làm điều gì đó Tôi ngưỡng mộ sự can đảm của bạn khi nói những gì bạn nghĩ."
                    },
                    {
                        "en": "with courage They fought with courage, but were no match for the enemy.",
                        "vi": "với lòng dũng cảm Họ đã chiến đấu với lòng dũng cảm, nhưng không thể địch nổi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be/not be brave enough to do what you feel to be right",
                    "vi": "trở thành / không đủ can đảm để làm những gì bạn cảm thấy là đúng"
                },
                "examples": [
                    {
                        "en": "You need to have the courage of your convictions.",
                        "vi": "Bạn cần phải có can đảm về niềm tin của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to force yourself to be brave enough to do something",
                    "vi": "buộc bản thân phải đủ can đảm để làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "I finally screwed up my courage and went to the dentist.",
                        "vi": "Cuối cùng tôi cũng lấy hết can đảm và đến gặp nha sĩ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to begin to feel happier and more confident because of something",
                    "vi": "để bắt đầu cảm thấy hạnh phúc và tự tin hơn vì điều gì đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to make yourself do something that you are afraid of",
                    "vi": "để khiến bản thân làm điều gì đó mà bạn sợ hãi"
                },
                "examples": [
                    {
                        "en": "Taking her courage in both hands, she opened the door and walked in.",
                        "vi": "Lấy hết can đảm trên cả hai tay, cô mở cửa bước vào."
                    }
                ]
            }
        ]
    },
    {
        "id": "b287a2c7a5aa412d949ceb3c93b52c25",
        "word": "dare",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/deə(r)/",
            "us": "/der/"
        },
        "nearby": [
            {
                "word": "Darcey",
                "pos": ""
            },
            {
                "word": "the Dardanelles",
                "pos": ""
            },
            {
                "word": "dare",
                "pos": "verb"
            },
            {
                "word": "dare",
                "pos": "noun"
            },
            {
                "word": "daredevil",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to be brave enough to do something",
                    "vi": "đủ can đảm để làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "She said it as loudly as she dared.",
                        "vi": "Cô ấy nói to như cô ấy dám."
                    },
                    {
                        "en": "dare (to) do something He didn’t dare (to) say what he thought.",
                        "vi": "dám (để) làm điều gì đó Anh ấy không dám (để) nói những gì anh ấy nghĩ."
                    },
                    {
                        "en": "They daren't ask for any more money.",
                        "vi": "Họ không dám đòi tiền nữa."
                    },
                    {
                        "en": "(literary) She dared not breathe a word of it to anybody.",
                        "vi": "(văn học) Cô ấy không dám thở một lời về nó với bất kỳ ai."
                    },
                    {
                        "en": "Dare to be different!",
                        "vi": "Dám khác biệt!"
                    },
                    {
                        "en": "There was something, dare I say it, a little unusual about him.",
                        "vi": "Có điều gì đó, tôi dám nói ra, một chút khác thường về anh ta."
                    }
                ]
            },
            {
                "define": {
                    "en": "to persuade somebody to do something dangerous, difficult or embarrassing so that they can show that they are not afraid",
                    "vi": "thuyết phục ai đó làm điều gì đó nguy hiểm, khó khăn hoặc xấu hổ để họ thể hiện rằng họ không sợ hãi"
                },
                "examples": [
                    {
                        "en": "dare somebody Go on! Take it! I dare you.",
                        "vi": "ai đó dám đi tiếp! Lấy nó! Tao thách mày."
                    },
                    {
                        "en": "dare somebody to do something Some of the older boys had dared him to do it.",
                        "vi": "dám ai đó làm điều gì đó Một số cậu bé lớn hơn đã dám anh ta làm điều đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to tell somebody strongly not to do something",
                    "vi": "được sử dụng để nói với ai đó mạnh mẽ rằng đừng làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "‘I'll tell her about it.’ ‘Don't you dare!’",
                        "vi": "Tôi sẽ nói với cô ấy về điều đó.' 'Bạn không dám!'"
                    },
                    {
                        "en": "Don't you dare say anything to anybody.",
                        "vi": "Bạn không dám nói bất cứ điều gì với bất kỳ ai."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to show that you are angry about something that somebody has done",
                    "vi": "được sử dụng để cho thấy rằng bạn đang tức giận về điều gì đó mà ai đó đã làm"
                },
                "examples": [
                    {
                        "en": "How dare you talk to me like that?",
                        "vi": "Sao anh dám nói chuyện với tôi như vậy?"
                    },
                    {
                        "en": "How dare she imply that I was lying?",
                        "vi": "Sao cô ấy dám ám chỉ rằng tôi đang nói dối?"
                    }
                ]
            },
            {
                "define": {
                    "en": "used when you are saying that something is likely",
                    "vi": "được sử dụng khi bạn nói rằng điều gì đó có khả năng xảy ra"
                },
                "examples": [
                    {
                        "en": "I dare say you know about it already.",
                        "vi": "Tôi dám chắc rằng bạn đã biết về nó rồi."
                    }
                ]
            }
        ]
    },
    {
        "id": "6847ec8114984142808b3ec7abf43d76",
        "word": "daring",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈdeərɪŋ/",
            "us": "/ˈderɪŋ/"
        },
        "nearby": [
            {
                "word": "daredevil",
                "pos": "noun"
            },
            {
                "word": "daredevil",
                "pos": "adjective"
            },
            {
                "word": "daring",
                "pos": "adjective"
            },
            {
                "word": "daring",
                "pos": "noun"
            },
            {
                "word": "daringly",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "brave; willing to do dangerous or unusual things; involving danger or taking risks",
                    "vi": "can đảm; sẵn sàng làm những việc nguy hiểm hoặc bất thường; liên quan đến nguy hiểm hoặc chấp nhận rủi ro"
                },
                "examples": [
                    {
                        "en": "a daring walk in space",
                        "vi": "một cuộc đi bộ táo bạo trong không gian"
                    },
                    {
                        "en": "There are plenty of activities at the resort for the less daring.",
                        "vi": "Có rất nhiều hoạt động tại khu nghỉ mát cho những người ít táo bạo hơn."
                    },
                    {
                        "en": "The gallery was known for putting on daring exhibitions.",
                        "vi": "Phòng trưng bày được biết đến với việc tổ chức các cuộc triển lãm táo bạo."
                    },
                    {
                        "en": "a daring strapless dress in black silk",
                        "vi": "một chiếc váy quây táo bạo bằng lụa đen"
                    }
                ]
            }
        ]
    },
    {
        "id": "ac2abb1ee5d54e85a2dabbec9969e622",
        "word": "spirit",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈspɪrɪt/",
            "us": "/ˈspɪrɪt/"
        },
        "nearby": [
            {
                "word": "spirant",
                "pos": "adjective"
            },
            {
                "word": "spire",
                "pos": "noun"
            },
            {
                "word": "spirit",
                "pos": "noun"
            },
            {
                "word": "spirit",
                "pos": "verb"
            },
            {
                "word": "Spirit",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the part of a person that includes their mind, feelings and character rather than their body",
                    "vi": "phần của một người bao gồm tâm trí, cảm xúc và tính cách của họ hơn là cơ thể của họ"
                },
                "examples": [
                    {
                        "en": "You are underestimating the power of the human spirit to overcome difficulties.",
                        "vi": "Bạn đang đánh giá thấp sức mạnh của tinh thần vượt khó của con người."
                    },
                    {
                        "en": "Yoga is meant to unite the body, mind and spirit.",
                        "vi": "Yoga có nghĩa là để hợp nhất cơ thể, tâm trí và tinh thần."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person’s feelings or state of mind",
                    "vi": "cảm xúc hoặc trạng thái tâm trí của một người"
                },
                "examples": [
                    {
                        "en": "to be in high/low spirits",
                        "vi": "có tinh thần cao / thấp"
                    },
                    {
                        "en": "They were all in good spirits as they set out.",
                        "vi": "Họ đều có tinh thần tốt khi lên đường."
                    },
                    {
                        "en": "You must try and keep your spirits up (= stay cheerful).",
                        "vi": "Bạn phải cố gắng và giữ tinh thần phấn chấn (= luôn vui vẻ)."
                    },
                    {
                        "en": "a song that never fails to lift my spirits",
                        "vi": "một bài hát không bao giờ lỗi thời để vực dậy tinh thần của tôi"
                    },
                    {
                        "en": "My spirits sank at the prospect of starting all over again.",
                        "vi": "Tinh thần của tôi chìm nghỉm trước viễn cảnh bắt đầu lại từ đầu."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person of the type mentioned",
                    "vi": "một người thuộc loại được đề cập"
                },
                "examples": [
                    {
                        "en": "a brave spirit",
                        "vi": "một tinh thần dũng cảm"
                    },
                    {
                        "en": "kindred spirits (= people who like the same things as you)",
                        "vi": "tinh thần tốt bụng (= những người thích những thứ giống bạn)"
                    }
                ]
            },
            {
                "define": {
                    "en": "courage, energy or determination",
                    "vi": "lòng dũng cảm, nghị lực hoặc quyết tâm"
                },
                "examples": [
                    {
                        "en": "Peter had a good game and showed his true spirit.",
                        "vi": "Peter đã có một trận đấu hay và thể hiện đúng bản lĩnh của mình."
                    },
                    {
                        "en": "They took away his freedom and broke his spirit.",
                        "vi": "Họ đã lấy đi tự do của anh ấy và làm suy sụp tinh thần của anh ấy."
                    },
                    {
                        "en": "with spirit Although the team lost, they played with tremendous spirit.",
                        "vi": "với tinh thần Dù đội thua nhưng họ đã thi đấu với tinh thần vô cùng tuyệt vời."
                    }
                ]
            },
            {
                "define": {
                    "en": "feelings of support towards a group, team or society",
                    "vi": "cảm giác hỗ trợ đối với một nhóm, đội hoặc xã hội"
                },
                "examples": [
                    {
                        "en": "There's not much community spirit around here.",
                        "vi": "Không có nhiều tinh thần cộng đồng xung quanh đây."
                    },
                    {
                        "en": "spirit of something Officials have praised the cooperative spirit of the joint task force.",
                        "vi": "tinh thần của điều gì đó Các quan chức đã ca ngợi tinh thần hợp tác của lực lượng đặc nhiệm chung."
                    }
                ]
            },
            {
                "define": {
                    "en": "the typical or most important quality or mood of something",
                    "vi": "phẩm chất hoặc tâm trạng điển hình hoặc quan trọng nhất của một thứ gì đó"
                },
                "examples": [
                    {
                        "en": "spirit of something The exhibition captures the spirit of the age/times.",
                        "vi": "tinh thần của cái gì đó Triển lãm nắm bắt được tinh thần của thời đại / thời đại."
                    }
                ]
            },
            {
                "define": {
                    "en": "a state of mind or mood; an attitude",
                    "vi": "một trạng thái của tâm trí hoặc tâm trạng; một thái độ"
                },
                "examples": [
                    {
                        "en": "We approached the situation in the wrong spirit.",
                        "vi": "Chúng tôi đã tiếp cận tình huống với tinh thần sai lầm."
                    },
                    {
                        "en": "‘OK, I'll try’. ‘That's the spirit (= the right attitude).’",
                        "vi": "Được rồi, tôi sẽ thử'. 'Đó là tinh thần (= thái độ đúng đắn).'"
                    },
                    {
                        "en": "The party went well because everyone entered into the spirit of things.",
                        "vi": "Buổi tiệc diễn ra tốt đẹp vì mọi người đều nhập tâm làm việc."
                    },
                    {
                        "en": "I'm trying to get into the spirit of the holiday season.",
                        "vi": "Tôi đang cố gắng lên tinh thần cho kỳ nghỉ lễ."
                    }
                ]
            },
            {
                "define": {
                    "en": "the real or intended meaning or purpose of something",
                    "vi": "ý nghĩa hoặc mục đích thực sự hoặc dự định của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "Obey the spirit, not the letter (= the narrow meaning of the words) of the law.",
                        "vi": "Tuân theo tinh thần, không tuân theo chữ (= nghĩa hẹp của từ ngữ) của luật pháp."
                    }
                ]
            },
            {
                "define": {
                    "en": "the soul thought of as separate from the body and believed to live on after death; a ghost",
                    "vi": "linh hồn được cho là tách biệt khỏi thể xác và được cho là sẽ sống tiếp sau khi chết; một con ma"
                },
                "examples": [
                    {
                        "en": "He is dead, but his spirit lives on.",
                        "vi": "Anh ấy đã chết, nhưng linh hồn của anh ấy vẫn sống."
                    },
                    {
                        "en": "It was believed that people could be possessed by evil spirits.",
                        "vi": "Người ta tin rằng con người có thể bị quỷ ám."
                    },
                    {
                        "en": "a message from the spirit world",
                        "vi": "một thông điệp từ thế giới linh hồn"
                    }
                ]
            },
            {
                "define": {
                    "en": "an imaginary creature with magic powers, for example, a fairy or an elf",
                    "vi": "một sinh vật tưởng tượng có sức mạnh ma thuật, ví dụ, một nàng tiên hoặc một yêu tinh"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a strong alcoholic drink",
                    "vi": "đồ uống có cồn mạnh"
                },
                "examples": [
                    {
                        "en": "I don't drink whisky or brandy or any other spirits.",
                        "vi": "Tôi không uống rượu whisky, rượu mạnh hay bất kỳ loại rượu mạnh nào khác."
                    }
                ]
            },
            {
                "define": {
                    "en": "a special type of alcohol used in industry or medicine",
                    "vi": "một loại rượu đặc biệt được sử dụng trong công nghiệp hoặc y học"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "as/when/if you feel like it",
                    "vi": "như / khi nào / nếu bạn cảm thấy thích nó"
                },
                "examples": [
                    {
                        "en": "I'll go for a run this evening, if the spirit moves me.",
                        "vi": "Tôi sẽ chạy bộ vào tối nay, nếu tinh thần làm tôi cảm động."
                    },
                    {
                        "en": "Make a donation to the charity if the spirit moves you.",
                        "vi": "Hãy quyên góp cho tổ chức từ thiện nếu tinh thần đó khiến bạn cảm động."
                    }
                ]
            },
            {
                "define": {
                    "en": "a feeling that you are ready to fight very hard for something or to try something difficult",
                    "vi": "cảm giác rằng bạn đã sẵn sàng chiến đấu hết mình cho một điều gì đó hoặc thử một điều gì đó khó khăn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "in your thoughts",
                    "vi": "trong suy nghĩ của bạn"
                },
                "examples": [
                    {
                        "en": "I shall be with you in spirit (= thinking about you though not with you physically).",
                        "vi": "Tôi sẽ ở bên bạn bằng tinh thần (= nghĩ về bạn mặc dù không ở bên bạn về mặt thể xác)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody feel more cheerful or brave",
                    "vi": "để làm cho ai đó cảm thấy vui vẻ hoặc dũng cảm hơn"
                },
                "examples": [
                    {
                        "en": "The sunny weather raised my spirits a little.",
                        "vi": "Thời tiết nắng đẹp làm tinh thần tôi phấn chấn hơn một chút."
                    }
                ]
            },
            {
                "define": {
                    "en": "you intend to do good things but you are too lazy, weak or busy to actually do them",
                    "vi": "bạn có ý định làm những điều tốt nhưng bạn quá lười biếng, yếu đuối hoặc bận rộn để thực sự làm chúng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "06eb68d34d614463b99a1149f897990c",
        "word": "strength",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/streŋkθ/",
            "us": "/streŋkθ/"
        },
        "nearby": [
            {
                "word": "streetwear",
                "pos": "noun"
            },
            {
                "word": "streetwise",
                "pos": "adjective"
            },
            {
                "word": "strength",
                "pos": "noun"
            },
            {
                "word": "strengthen",
                "pos": "verb"
            },
            {
                "word": "strenuous",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the quality of being physically strong",
                    "vi": "phẩm chất của thể chất mạnh mẽ"
                },
                "examples": [
                    {
                        "en": "He pushed against the rock with all his strength.",
                        "vi": "Anh dùng hết sức chống lại tảng đá."
                    },
                    {
                        "en": "It may take a few weeks for you to build up your strength again.",
                        "vi": "Có thể mất một vài tuần để bạn xây dựng lại sức mạnh của mình."
                    },
                    {
                        "en": "She gradually regained strength in her legs.",
                        "vi": "Cô dần lấy lại sức ở chân."
                    },
                    {
                        "en": "He had a physical strength that matched his outward appearance.",
                        "vi": "Anh ta có một sức mạnh thể chất phù hợp với hình dáng bên ngoài của anh ta."
                    },
                    {
                        "en": "strength to do something She didn't have the strength to walk any further.",
                        "vi": "sức mạnh để làm điều gì đó Cô không còn sức để bước đi nữa."
                    }
                ]
            },
            {
                "define": {
                    "en": "the ability that something has to resist force or hold heavy weights without breaking or being damaged",
                    "vi": "khả năng mà một cái gì đó có khả năng chống lại lực hoặc giữ vật nặng mà không bị vỡ hoặc bị hư hỏng"
                },
                "examples": [
                    {
                        "en": "the strength of a rope",
                        "vi": "sức mạnh của một sợi dây"
                    },
                    {
                        "en": "The panels are reinforced with steel for extra strength.",
                        "vi": "Các tấm được gia cố bằng thép để tăng thêm độ bền."
                    }
                ]
            },
            {
                "define": {
                    "en": "the quality of being brave and determined in a difficult situation",
                    "vi": "phẩm chất dũng cảm và kiên định trong hoàn cảnh khó khăn"
                },
                "examples": [
                    {
                        "en": "During this ordeal he was able to draw strength from his faith.",
                        "vi": "Trong thử thách này, anh đã có thể rút ra sức mạnh từ đức tin của mình."
                    },
                    {
                        "en": "She has a remarkable inner strength.",
                        "vi": "Cô ấy có một sức mạnh nội tâm đáng nể."
                    },
                    {
                        "en": "You have shown great strength of character.",
                        "vi": "Bạn đã thể hiện sức mạnh tuyệt vời của nhân vật."
                    }
                ]
            },
            {
                "define": {
                    "en": "the power and influence that somebody/something has",
                    "vi": "sức mạnh và ảnh hưởng mà ai đó / cái gì đó có"
                },
                "examples": [
                    {
                        "en": "Political power depends upon economic strength.",
                        "vi": "Quyền lực chính trị phụ thuộc vào sức mạnh kinh tế."
                    },
                    {
                        "en": "Their superior military strength gives them a huge advantage.",
                        "vi": "Sức mạnh quân sự vượt trội của họ mang lại cho họ một lợi thế rất lớn."
                    },
                    {
                        "en": "to negotiate from a position of strength",
                        "vi": "đàm phán từ một vị thế mạnh"
                    },
                    {
                        "en": "The rally was intended to be a show of strength by the socialists.",
                        "vi": "Cuộc biểu tình nhằm thể hiện sức mạnh của những người theo chủ nghĩa xã hội."
                    }
                ]
            },
            {
                "define": {
                    "en": "how strong or deeply felt an opinion or a feeling is",
                    "vi": "một ý kiến hoặc một cảm giác mạnh mẽ hoặc sâu sắc như thế nào"
                },
                "examples": [
                    {
                        "en": "the strength of public opinion",
                        "vi": "sức mạnh của dư luận"
                    },
                    {
                        "en": "This view has recently gathered strength (= become stronger or more widely held).",
                        "vi": "Quan điểm này gần đây đã tập hợp sức mạnh (= trở nên mạnh mẽ hơn hoặc được tổ chức rộng rãi hơn)."
                    },
                    {
                        "en": "I was surprised by the strength of her feelings.",
                        "vi": "Tôi đã rất ngạc nhiên trước sức mạnh của tình cảm của cô ấy."
                    },
                    {
                        "en": "I have been overwhelmed by the strength of feeling that people have about this issue.",
                        "vi": "Tôi đã bị choáng ngợp bởi sức mạnh của cảm giác mà mọi người có về vấn đề này."
                    }
                ]
            },
            {
                "define": {
                    "en": "a quality or an ability that a person or thing has that gives them an advantage",
                    "vi": "phẩm chất hoặc khả năng mà một người hoặc một vật có mang lại lợi thế cho họ"
                },
                "examples": [
                    {
                        "en": "The ability to keep calm is one of her many strengths.",
                        "vi": "Khả năng giữ bình tĩnh là một trong những điểm mạnh của cô."
                    },
                    {
                        "en": "the strengths and weaknesses of an argument",
                        "vi": "điểm mạnh và điểm yếu của một lập luận"
                    },
                    {
                        "en": "The new weapon's strength lies in its accuracy.",
                        "vi": "Điểm mạnh của vũ khí mới nằm ở độ chính xác của nó."
                    }
                ]
            },
            {
                "define": {
                    "en": "how strong a natural force or a signal is",
                    "vi": "một lực tự nhiên hoặc một tín hiệu mạnh như thế nào"
                },
                "examples": [
                    {
                        "en": "the strength of the sun",
                        "vi": "sức mạnh của mặt trời"
                    },
                    {
                        "en": "wind strength",
                        "vi": "sức gió"
                    },
                    {
                        "en": "the strength and direction of the tide",
                        "vi": "sức mạnh và hướng của thủy triều"
                    },
                    {
                        "en": "The phone company aims to improve signal strength within buildings.",
                        "vi": "Công ty điện thoại đặt mục tiêu cải thiện cường độ tín hiệu trong các tòa nhà."
                    }
                ]
            },
            {
                "define": {
                    "en": "how strong a particular taste or substance is",
                    "vi": "hương vị hoặc chất cụ thể mạnh như thế nào"
                },
                "examples": [
                    {
                        "en": "Add more curry powder depending on the strength required.",
                        "vi": "Cho thêm bột cà ri tùy theo độ đậm đà yêu cầu."
                    },
                    {
                        "en": "a range of beers with different strengths (= with different amounts of alcohol in them)",
                        "vi": "một loạt các loại bia với các độ mạnh khác nhau (= với lượng cồn khác nhau trong đó)"
                    },
                    {
                        "en": "a packet of double-strength mints",
                        "vi": "một gói bạc hà cường độ gấp đôi"
                    },
                    {
                        "en": "These wines vary in strength between 11° and 15°.",
                        "vi": "Các loại rượu này có độ mạnh khác nhau trong khoảng từ 11 ° đến 15 °."
                    }
                ]
            },
            {
                "define": {
                    "en": "how strong a country’s currency is in relation to other countries’ currencies",
                    "vi": "tiền tệ của một quốc gia mạnh như thế nào so với tiền tệ của các quốc gia khác"
                },
                "examples": [
                    {
                        "en": "the relative strength of the euro against the dollar",
                        "vi": "sức mạnh tương đối của đồng euro so với đồng đô la"
                    },
                    {
                        "en": "The euro has continued to gain strength.",
                        "vi": "Đồng euro tiếp tục tăng giá."
                    },
                    {
                        "en": "the continuing strength of the pound",
                        "vi": "sức mạnh tiếp tục của đồng bảng Anh"
                    }
                ]
            },
            {
                "define": {
                    "en": "the number of people in a group, a team or an organization",
                    "vi": "số lượng người trong một nhóm, một đội hoặc một tổ chức"
                },
                "examples": [
                    {
                        "en": "The strength of the workforce is about to be doubled from 3 000 to 6 000.",
                        "vi": "Sức mạnh của lực lượng lao động sắp được tăng gấp đôi từ 3 000 lên 6 000."
                    },
                    {
                        "en": "The team will be back at full strength (= with all the best players) for the next match.",
                        "vi": "Đội sẽ trở lại đầy đủ sức mạnh (= với tất cả các cầu thủ tốt nhất) cho trận đấu tiếp theo."
                    },
                    {
                        "en": "up to strength The Korean team was not up to strength for the final.",
                        "vi": "sức mạnh Đội tuyển Hàn Quốc không có đủ sức mạnh cho trận chung kết."
                    },
                    {
                        "en": "in strength The protesters turned out in strength (= in large numbers).",
                        "vi": "sức mạnh Những người biểu tình đã trở nên mạnh mẽ (= với số lượng lớn)."
                    },
                    {
                        "en": "under/below strength These cuts have left the local police force under strength (= with fewer members than it needs).",
                        "vi": "dưới / dưới sức mạnh Những cắt giảm này đã khiến lực lượng cảnh sát địa phương trở nên thiếu sức mạnh (= với số lượng thành viên ít hơn mức cần thiết)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to become more and more successful",
                    "vi": "để ngày càng thành công hơn"
                },
                "examples": [
                    {
                        "en": "Since her appointment the department has gone from strength to strength.",
                        "vi": "Kể từ khi cô ấy được bổ nhiệm, bộ phận đã đi từ sức mạnh này sang sức mạnh khác."
                    }
                ]
            },
            {
                "define": {
                    "en": "because somebody has been influenced or persuaded by something",
                    "vi": "bởi vì ai đó đã bị ảnh hưởng hoặc bị thuyết phục bởi một cái gì đó"
                },
                "examples": [
                    {
                        "en": "I got the job on the strength of your recommendation.",
                        "vi": "Tôi đã nhận được công việc dựa trên lời giới thiệu của bạn."
                    },
                    {
                        "en": "She hopes to secure a recording contract on the strength of these songs.",
                        "vi": "Cô hy vọng sẽ đạt được hợp đồng thu âm dựa trên sức mạnh của những bài hát này."
                    }
                ]
            },
            {
                "define": {
                    "en": "the quality of being strong because you have a great variety of good people, ideas, etc. that can contribute to the success of something",
                    "vi": "phẩm chất của sự mạnh mẽ bởi vì bạn có rất nhiều người tốt, ý tưởng, v.v. có thể đóng góp vào sự thành công của điều gì đó"
                },
                "examples": [
                    {
                        "en": "The French team does not have the strength in depth that the Australians have.",
                        "vi": "Đội tuyển Pháp không có thế mạnh về chiều sâu như đội tuyển Úc."
                    }
                ]
            },
            {
                "define": {
                    "en": "being in a group gives you more power",
                    "vi": "ở trong một nhóm mang lại cho bạn nhiều quyền lực hơn"
                },
                "examples": [
                    {
                        "en": "There's strength in numbers, so encourage your friends and family to join us.",
                        "vi": "Có sức mạnh về số lượng, vì vậy hãy khuyến khích bạn bè và gia đình của bạn tham gia cùng chúng tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person that you can rely on to help, protect and comfort you when you are in trouble",
                    "vi": "một người mà bạn có thể dựa vào để giúp đỡ, bảo vệ và an ủi bạn khi bạn gặp khó khăn"
                },
                "examples": [
                    {
                        "en": "He was a tower of strength to his sisters when their father died.",
                        "vi": "Anh ấy là ngọn tháp sức mạnh cho các chị gái của mình khi cha của họ qua đời."
                    }
                ]
            }
        ]
    },
    {
        "id": "45e523164f3242c0a6b25455b0c77f21",
        "word": "courageous",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/kəˈreɪdʒəs/",
            "us": "/kəˈreɪdʒəs/"
        },
        "nearby": [
            {
                "word": "couponing",
                "pos": "noun"
            },
            {
                "word": "courage",
                "pos": "noun"
            },
            {
                "word": "courageous",
                "pos": "adjective"
            },
            {
                "word": "courageously",
                "pos": "adverb"
            },
            {
                "word": "courgette",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "showing courage",
                    "vi": "thể hiện sự can đảm"
                },
                "examples": [
                    {
                        "en": "a very courageous decision",
                        "vi": "một quyết định rất can đảm"
                    },
                    {
                        "en": "I hope people will be courageous enough to speak out against this injustice.",
                        "vi": "Tôi hy vọng mọi người sẽ đủ can đảm để lên tiếng chống lại sự bất công này."
                    }
                ]
            }
        ]
    },
    {
        "id": "a16a936f67944d558a596b6feaccd6c2",
        "word": "daring",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈdeərɪŋ/",
            "us": "/ˈderɪŋ/"
        },
        "nearby": [
            {
                "word": "daredevil",
                "pos": "adjective"
            },
            {
                "word": "daring",
                "pos": "adjective"
            },
            {
                "word": "daring",
                "pos": "noun"
            },
            {
                "word": "daringly",
                "pos": "adverb"
            },
            {
                "word": "dark",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "courage and the quality of being willing to take risks if necessary",
                    "vi": "lòng dũng cảm và phẩm chất sẵn sàng chấp nhận rủi ro nếu cần thiết"
                },
                "examples": [
                    {
                        "en": "the skill and daring of the mountain climbers",
                        "vi": "kỹ năng và sự táo bạo của những người leo núi"
                    }
                ]
            }
        ]
    },
    {
        "id": "afdb725fb7f64e09914ed25649927ed3",
        "word": "gut",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ɡʌt/",
            "us": "/ɡʌt/"
        },
        "nearby": [
            {
                "word": "gusto",
                "pos": "noun"
            },
            {
                "word": "gusty",
                "pos": "adjective"
            },
            {
                "word": "gut",
                "pos": "noun"
            },
            {
                "word": "gut",
                "pos": "verb"
            },
            {
                "word": "gut",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the tube in the body through which food passes when it leaves the stomach",
                    "vi": "ống trong cơ thể mà thức ăn đi qua khi nó rời khỏi dạ dày"
                },
                "examples": [
                    {
                        "en": "It can take up to 72 hours for food to pass through the gut.",
                        "vi": "Có thể mất đến 72 giờ để thức ăn đi qua ruột."
                    },
                    {
                        "en": "I had a terrible pain in my guts after eating too many plums.",
                        "vi": "Tôi đã bị đau bụng kinh khủng sau khi ăn quá nhiều mận."
                    }
                ]
            },
            {
                "define": {
                    "en": "the organs in and around the stomach, especially in an animal",
                    "vi": "các cơ quan trong và xung quanh dạ dày, đặc biệt là ở động vật"
                },
                "examples": [
                    {
                        "en": "I'll only cook fish if the guts have been removed.",
                        "vi": "Tôi sẽ chỉ nấu cá nếu ruột đã được loại bỏ."
                    },
                    {
                        "en": "I don't like movies that are full of blood and guts (= that show a lot of blood and violence).",
                        "vi": "Tôi không thích những bộ phim đầy máu me (= thể hiện nhiều máu me và bạo lực)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person’s stomach, especially when it is large",
                    "vi": "dạ dày của một người, đặc biệt là khi nó lớn"
                },
                "examples": [
                    {
                        "en": "Have you seen the gut on him!",
                        "vi": "Bạn đã thấy ruột trên anh ta chưa!"
                    },
                    {
                        "en": "a beer gut (= caused by drinking a lot of beer regularly)",
                        "vi": "ruột bia (= do uống nhiều bia thường xuyên)"
                    }
                ]
            },
            {
                "define": {
                    "en": "the courage and strength of mind that it takes to do something difficult or unpleasant",
                    "vi": "can đảm và sức mạnh của tâm trí mà nó cần để làm một cái gì đó khó khăn hoặc khó chịu"
                },
                "examples": [
                    {
                        "en": "He doesn't have the guts to walk away from a well-paid job.",
                        "vi": "Anh ấy không đủ can đảm để rời bỏ một công việc được trả lương cao."
                    }
                ]
            },
            {
                "define": {
                    "en": "the place where your natural feelings that make you react in a particular way are thought to be",
                    "vi": "nơi mà những cảm xúc tự nhiên của bạn khiến bạn phản ứng theo một cách cụ thể được cho là"
                },
                "examples": [
                    {
                        "en": "in your guts I had a feeling in my guts that something was wrong.",
                        "vi": "trong ruột của bạn, tôi có cảm giác trong ruột của mình rằng có điều gì đó không ổn."
                    }
                ]
            },
            {
                "define": {
                    "en": "the most important part of something",
                    "vi": "phần quan trọng nhất của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "the guts of the problem",
                        "vi": "gan ruột của vấn đề"
                    }
                ]
            },
            {
                "define": {
                    "en": "thin strong string made from animals' intestines and used in making musical instruments, tennis rackets and medical equipment",
                    "vi": "dây mảnh mỏng làm từ ruột động vật và được sử dụng để làm nhạc cụ, vợt tennis và thiết bị y tế"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to make a great effort to do something",
                    "vi": "nỗ lực rất nhiều để làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "It’s a problem which nobody is going to bust a gut trying to solve.",
                        "vi": "Đó là một vấn đề mà không ai muốn giải quyết."
                    },
                    {
                        "en": "I busted my chops to get into law school.",
                        "vi": "Tôi đã cố gắng để được vào trường luật."
                    },
                    {
                        "en": "These guys were busting their butts on the field, trying to excel at athletics.",
                        "vi": "Những chàng trai này đang ngồi trên sân, cố gắng trở nên xuất sắc trong môn điền kinh."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make a decision based on something that you are certain about, even though you do not have any direct proof and cannot explain why you are certain",
                    "vi": "đưa ra quyết định dựa trên điều gì đó mà bạn chắc chắn, mặc dù bạn không có bất kỳ bằng chứng trực tiếp nào và không thể giải thích tại sao bạn chắc chắn"
                },
                "examples": [
                    {
                        "en": "I went with my gut and turned down the job.",
                        "vi": "Tôi đã rút ruột và từ chối công việc."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to refer to somebody who eats too much",
                    "vi": "dùng để chỉ ai đó ăn quá nhiều"
                },
                "examples": [
                    {
                        "en": "Make sure greedy guts doesn’t eat all the cake.",
                        "vi": "Đảm bảo lòng tham ăn không hết bánh."
                    }
                ]
            },
            {
                "define": {
                    "en": "to dislike somebody very much",
                    "vi": "không thích ai đó rất nhiều"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be very angry with somebody and punish them severely for something they have done",
                    "vi": "rất tức giận với ai đó và trừng phạt họ thật nặng vì điều họ đã làm"
                },
                "examples": [
                    {
                        "en": "She’ll have your guts for garters if she ever finds out.",
                        "vi": "Cô ấy sẽ rất quan tâm đến bạn nếu cô ấy phát hiện ra."
                    }
                ]
            },
            {
                "define": {
                    "en": "to work very hard to achieve something",
                    "vi": "làm việc rất chăm chỉ để đạt được điều gì đó"
                },
                "examples": [
                    {
                        "en": "I slogged my guts out for the exam.",
                        "vi": "Tôi vắt kiệt sức lực của mình cho kỳ thi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to tell somebody everything you know or feel about something, because you are upset",
                    "vi": "để nói với ai đó tất cả những gì bạn biết hoặc cảm thấy về điều gì đó, bởi vì bạn đang buồn"
                },
                "examples": [
                    {
                        "en": "He has spilled his guts in his new autobiography.",
                        "vi": "Anh ấy đã hết mình trong cuốn tự truyện mới của mình."
                    }
                ]
            }
        ]
    },
    {
        "id": "cffbb3d137504e1fabb5fb4e1f3962b3",
        "word": "heroic",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/həˈrəʊɪk/",
            "us": "/həˈrəʊɪk/"
        },
        "nearby": [
            {
                "word": "herniated disc",
                "pos": "noun"
            },
            {
                "word": "hero",
                "pos": "noun"
            },
            {
                "word": "heroic",
                "pos": "adjective"
            },
            {
                "word": "heroically",
                "pos": "adverb"
            },
            {
                "word": "heroic couplet",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "showing extreme courage and admired by many people",
                    "vi": "thể hiện sự dũng cảm tột độ và được nhiều người ngưỡng mộ"
                },
                "examples": [
                    {
                        "en": "She is a heroic figure we can all look up to.",
                        "vi": "Cô ấy là một nhân vật anh hùng mà tất cả chúng ta có thể ngưỡng mộ."
                    },
                    {
                        "en": "Rescuers made heroic efforts to save the crew.",
                        "vi": "Lực lượng cứu hộ đã nỗ lực anh dũng để cứu phi hành đoàn."
                    }
                ]
            },
            {
                "define": {
                    "en": "showing a determined effort to succeed or to achieve something, especially something difficult",
                    "vi": "thể hiện một nỗ lực quyết tâm để thành công hoặc đạt được điều gì đó, đặc biệt là điều gì đó khó khăn"
                },
                "examples": [
                    {
                        "en": "We watched our team's heroic struggle to win back the cup.",
                        "vi": "Chúng tôi đã theo dõi cuộc đấu tranh anh dũng của đội mình để giành lại chiếc cúp."
                    },
                    {
                        "en": "a truly heroic battle",
                        "vi": "một trận chiến thực sự anh hùng"
                    }
                ]
            },
            {
                "define": {
                    "en": "that is about or involves a hero",
                    "vi": "đó là về hoặc liên quan đến một anh hùng"
                },
                "examples": [
                    {
                        "en": "a heroic story/poem",
                        "vi": "một câu chuyện / bài thơ anh hùng"
                    },
                    {
                        "en": "heroic deeds/myths",
                        "vi": "hành động anh hùng / huyền thoại"
                    }
                ]
            },
            {
                "define": {
                    "en": "very large or great",
                    "vi": "rất lớn hoặc tuyệt vời"
                },
                "examples": [
                    {
                        "en": "This was foolishness on a heroic scale.",
                        "vi": "Đây là sự ngu ngốc trên quy mô anh hùng."
                    }
                ]
            }
        ]
    },
    {
        "id": "f9c80ed05d654057891ca138fb3f6e35",
        "word": "heroism",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈherəʊɪzəm/",
            "us": "/ˈherəʊɪzəm/"
        },
        "nearby": [
            {
                "word": "heroin",
                "pos": "noun"
            },
            {
                "word": "heroine",
                "pos": "noun"
            },
            {
                "word": "heroism",
                "pos": "noun"
            },
            {
                "word": "heron",
                "pos": "noun"
            },
            {
                "word": "hero worship",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "very great courage",
                    "vi": "rất can đảm"
                },
                "examples": [
                    {
                        "en": "The firefighters displayed both heroism and staunchness.",
                        "vi": "Những người lính cứu hỏa thể hiện cả sự anh dũng và kiên trung."
                    },
                    {
                        "en": "He showed great heroism in going back into the burning building.",
                        "vi": "Anh ấy đã thể hiện chủ nghĩa anh hùng tuyệt vời khi quay trở lại tòa nhà đang cháy."
                    }
                ]
            }
        ]
    },
    {
        "id": "db2a287a0ed54c0896cc07f1f720b391",
        "word": "man",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/mæn/",
            "us": "/mæn/"
        },
        "nearby": [
            {
                "word": "mammy-wagon",
                "pos": "noun"
            },
            {
                "word": "mampara",
                "pos": "noun"
            },
            {
                "word": "man",
                "pos": "noun"
            },
            {
                "word": "man",
                "pos": "verb"
            },
            {
                "word": "man",
                "pos": "exclamation"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an adult male human",
                    "vi": "một người đàn ông trưởng thành"
                },
                "examples": [
                    {
                        "en": "a good-looking young man",
                        "vi": "một thanh niên đẹp trai"
                    },
                    {
                        "en": "the relationships between men and women",
                        "vi": "mối quan hệ giữa nam và nữ"
                    },
                    {
                        "en": "the men's team/game/race/doubles/singles/event",
                        "vi": "đội nam / trò chơi / cuộc đua / đôi / đơn / sự kiện"
                    },
                    {
                        "en": "The board of directors is dominated by middle-aged white men.",
                        "vi": "Ban giám đốc chủ yếu là những người đàn ông da trắng trung niên."
                    },
                    {
                        "en": "He was one of the great men of history.",
                        "vi": "Ông là một trong những vĩ nhân của lịch sử."
                    },
                    {
                        "en": "Four armed men burst into the room.",
                        "vi": "Bốn người đàn ông có vũ trang xông vào phòng."
                    },
                    {
                        "en": "An elderly Indian man sat down beside me and recounted his story.",
                        "vi": "Một người đàn ông Ấn Độ lớn tuổi ngồi xuống bên cạnh tôi và kể lại câu chuyện của mình."
                    },
                    {
                        "en": "He is an average working man trying to make ends meet.",
                        "vi": "Anh ấy là một người đàn ông lao động bình thường đang cố gắng kiếm sống qua ngày."
                    }
                ]
            },
            {
                "define": {
                    "en": "humans as a group, both male and female",
                    "vi": "con người như một nhóm, cả nam và nữ"
                },
                "examples": [
                    {
                        "en": "the damage caused by man to the environment",
                        "vi": "những thiệt hại do con người gây ra cho môi trường"
                    },
                    {
                        "en": "The common man (= ordinary people) is losing faith in democratic institutions.",
                        "vi": "Con người bình thường (= những người bình thường) đang mất niềm tin vào các thể chế dân chủ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person, either male or female",
                    "vi": "một người, nam hay nữ"
                },
                "examples": [
                    {
                        "en": "All men must die.",
                        "vi": "Tất cả đàn ông đều phải chết."
                    },
                    {
                        "en": "How could a human torture his fellow man?",
                        "vi": "Làm thế nào một con người có thể hành hạ đồng loại của mình?"
                    },
                    {
                        "en": "While no man is an island, we do function independently for the most part.",
                        "vi": "Trong khi không có con người là một hòn đảo, chúng tôi hoạt động độc lập trong hầu hết các phần."
                    }
                ]
            },
            {
                "define": {
                    "en": "humans from a particular period of history",
                    "vi": "con người từ một giai đoạn lịch sử cụ thể"
                },
                "examples": [
                    {
                        "en": "early/modern/Prehistoric man",
                        "vi": "thời kỳ đầu / hiện đại / người tiền sử"
                    }
                ]
            },
            {
                "define": {
                    "en": "a man who comes from the place mentioned or whose job or interest is connected with the thing mentioned",
                    "vi": "một người đàn ông đến từ nơi được đề cập hoặc có công việc hoặc mối quan tâm có liên quan đến điều được đề cập"
                },
                "examples": [
                    {
                        "en": "a Frenchman",
                        "vi": "một người Pháp"
                    },
                    {
                        "en": "a sportsman",
                        "vi": "một vận động viên"
                    },
                    {
                        "en": "a businessman",
                        "vi": "một doanh nhân"
                    },
                    {
                        "en": "a medical man",
                        "vi": "một người đàn ông y tế"
                    }
                ]
            },
            {
                "define": {
                    "en": "a man who likes or who does the thing mentioned",
                    "vi": "một người đàn ông thích hoặc người làm điều được đề cập"
                },
                "examples": [
                    {
                        "en": "a betting/fighting/drinking man",
                        "vi": "một người đàn ông cá cược / đánh nhau / uống rượu"
                    },
                    {
                        "en": "I think he’s a beer man (= he drinks beer).",
                        "vi": "Tôi nghĩ anh ấy là một người thích uống bia (= anh ấy uống bia)."
                    },
                    {
                        "en": "I've never been a gambling man.",
                        "vi": "Tôi chưa bao giờ là một người chơi cờ bạc."
                    }
                ]
            },
            {
                "define": {
                    "en": "a man who works for or supports a particular organization, comes from a particular town, etc.",
                    "vi": "một người đàn ông làm việc cho hoặc hỗ trợ một tổ chức cụ thể, đến từ một thị trấn cụ thể, v.v."
                },
                "examples": [
                    {
                        "en": "the BBC’s man in Moscow (= the man who reports on news from Moscow)",
                        "vi": "người đàn ông của BBC ở Mátxcơva (= người đàn ông đưa tin về tin tức từ Mátxcơva)"
                    },
                    {
                        "en": "a loyal Republican Party man",
                        "vi": "một người đàn ông trung thành của Đảng Cộng hòa"
                    }
                ]
            },
            {
                "define": {
                    "en": "a soldier or a male worker who obeys the instructions of a person of higher rank",
                    "vi": "quân nhân hoặc nam công nhân tuân theo chỉ dẫn của cấp trên"
                },
                "examples": [
                    {
                        "en": "The officer refused to let his men take part in the operation.",
                        "vi": "Viên sĩ quan từ chối cho người của mình tham gia vào cuộc hành quân."
                    },
                    {
                        "en": "The conditions in which the men were working were terrible.",
                        "vi": "Điều kiện làm việc của những người đàn ông đó thật khủng khiếp."
                    }
                ]
            },
            {
                "define": {
                    "en": "a man who comes to your house to do a job",
                    "vi": "một người đàn ông đến nhà bạn để làm một công việc"
                },
                "examples": [
                    {
                        "en": "the gas man",
                        "vi": "người đàn ông khí"
                    },
                    {
                        "en": "The man's coming to repair the TV today.",
                        "vi": "Người đàn ông đến sửa TV hôm nay."
                    }
                ]
            },
            {
                "define": {
                    "en": "used for addressing a male person",
                    "vi": "dùng để xưng hô với nam giới"
                },
                "examples": [
                    {
                        "en": "Nice shirt, man!",
                        "vi": "Áo đẹp quá anh ơi!"
                    },
                    {
                        "en": "Hey man. Back off!",
                        "vi": "Chào bạn. Rút lui!"
                    }
                ]
            },
            {
                "define": {
                    "en": "used for addressing a male person in an angry or impatient way",
                    "vi": "được sử dụng để xưng hô với một người nam một cách tức giận hoặc thiếu kiên nhẫn"
                },
                "examples": [
                    {
                        "en": "Don't just stand there, man—get a doctor!",
                        "vi": "Đừng chỉ đứng đó, anh bạn - hãy tìm bác sĩ!"
                    }
                ]
            },
            {
                "define": {
                    "en": "a person's husband, boyfriend or male partner",
                    "vi": "chồng, bạn trai hoặc bạn tình nam của một người"
                },
                "examples": [
                    {
                        "en": "What's her new man like?",
                        "vi": "Người đàn ông mới của cô ấy như thế nào?"
                    },
                    {
                        "en": "I now pronounce you man and wife (= you are now officially married).",
                        "vi": "Bây giờ tôi tuyên bố bạn là vợ chồng (= bạn hiện đã chính thức kết hôn)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who is strong and brave or has other qualities that some people think are typically male",
                    "vi": "một người mạnh mẽ và dũng cảm hoặc có những phẩm chất khác mà một số người thường nghĩ là nam giới"
                },
                "examples": [
                    {
                        "en": "Come on, now—be a man.",
                        "vi": "Nào, bây giờ - hãy là một người đàn ông."
                    },
                    {
                        "en": "She's more of a man than he is.",
                        "vi": "Cô ấy giống một người đàn ông hơn anh ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "a group or person that is thought to be in authority or control, especially the police or white people in government",
                    "vi": "một nhóm hoặc người được cho là nắm quyền hoặc kiểm soát, đặc biệt là cảnh sát hoặc người da trắng trong chính phủ"
                },
                "examples": [
                    {
                        "en": "Activists marched to the police station to voice their displeasure with the Man.",
                        "vi": "Các nhà hoạt động đã đến đồn cảnh sát để bày tỏ sự bất bình của họ với Người đàn ông."
                    }
                ]
            },
            {
                "define": {
                    "en": "a male servant",
                    "vi": "một người hầu nam"
                },
                "examples": [
                    {
                        "en": "My man will drive you home.",
                        "vi": "Người của tôi sẽ chở bạn về nhà."
                    }
                ]
            },
            {
                "define": {
                    "en": "one of the figures or objects that you play with in a game such as chess",
                    "vi": "một trong những hình hoặc đồ vật mà bạn chơi cùng trong một trò chơi như cờ vua"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "with everyone doing or thinking the same thing at the same time; in agreement",
                    "vi": "với tất cả mọi người làm hoặc nghĩ cùng một điều cùng một lúc; trong thỏa thuận"
                },
                "examples": [
                    {
                        "en": "The crowd rose to their feet as one man.",
                        "vi": "Đám đông đứng dậy như một người đàn ông."
                    },
                    {
                        "en": "The staff speak as one man on this issue.",
                        "vi": "Các nhân viên nói chuyện với tư cách một người về vấn đề này."
                    }
                ]
            },
            {
                "define": {
                    "en": "to please everyone by changing your attitudes or opinions to suit different people",
                    "vi": "để làm hài lòng tất cả mọi người bằng cách thay đổi thái độ hoặc quan điểm của bạn để phù hợp với những người khác nhau"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be understood or used in different ways by different people",
                    "vi": "được những người khác nhau hiểu hoặc sử dụng theo những cách khác nhau"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be the best or most suitable person to do a particular job, etc.",
                    "vi": "trở thành người tốt nhất hoặc phù hợp nhất để làm một công việc cụ thể, v.v."
                },
                "examples": [
                    {
                        "en": "For a superb haircut, David's your man.",
                        "vi": "Để có một mái tóc tuyệt vời, David là người đàn ông của bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be strong or brave enough",
                    "vi": "đủ mạnh mẽ hoặc dũng cảm"
                },
                "examples": [
                    {
                        "en": "He was not man enough to face up to his responsibility.",
                        "vi": "Anh không đủ đàn ông để đối mặt với trách nhiệm của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to act or think independently, not following others or being ordered",
                    "vi": "hành động hoặc suy nghĩ độc lập, không tuân theo người khác hoặc bị ra lệnh"
                },
                "examples": [
                    {
                        "en": "Working for himself meant that he could be his own man.",
                        "vi": "Làm việc cho bản thân có nghĩa là anh ấy có thể là người đàn ông của chính mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "people must take care of themselves and not give or expect any help",
                    "vi": "mọi người phải tự chăm sóc bản thân và không được cho hoặc mong đợi bất kỳ sự giúp đỡ nào"
                },
                "examples": [
                    {
                        "en": "In business, it's every man for himself.",
                        "vi": "Trong kinh doanh, mỗi người đàn ông hãy vì chính mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "a man who is respected in a particular profession that he has been involved in for a long time",
                    "vi": "một người đàn ông được kính trọng trong một nghề cụ thể mà anh ta đã tham gia trong một thời gian dài"
                },
                "examples": [
                    {
                        "en": "James Lovelock, the grand old man of environmental science",
                        "vi": "James Lovelock, ông lớn của khoa học môi trường"
                    }
                ]
            },
            {
                "define": {
                    "en": "(not) in exactly the same words as somebody says were used",
                    "vi": "(không phải) theo đúng những từ như ai đó nói đã được sử dụng"
                },
                "examples": [
                    {
                        "en": "‘Did she say she was sorry?’ ‘Not in so many words.’",
                        "vi": "Cô ấy có nói là cô ấy xin lỗi không?' 'Không có nhiều lời như vậy.'"
                    },
                    {
                        "en": "He didn't approve of the plan and said so in as many words.",
                        "vi": "Anh ta không tán thành kế hoạch và nói nhiều lời như vậy."
                    },
                    {
                        "en": "They told me in so many words that I was no longer needed.",
                        "vi": "Họ nói với tôi bằng rất nhiều từ mà tôi không còn cần thiết nữa."
                    }
                ]
            },
            {
                "define": {
                    "en": "with a lot of force or energy",
                    "vi": "với rất nhiều lực hoặc năng lượng"
                },
                "examples": [
                    {
                        "en": "He flew out of the room like a man possessed.",
                        "vi": "Anh ta bay ra khỏi phòng như một kẻ bị ma nhập."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make a young man develop and become more adult",
                    "vi": "để làm cho một người đàn ông trẻ tuổi phát triển và trở nên trưởng thành hơn"
                },
                "examples": [
                    {
                        "en": "They thought the army would make a man of him.",
                        "vi": "Họ nghĩ rằng quân đội sẽ tạo ra một người đàn ông như anh ta."
                    }
                ]
            },
            {
                "define": {
                    "en": "a man who frequently goes to fashionable parties, clubs, theatres, etc.",
                    "vi": "một người đàn ông thường xuyên đến các bữa tiệc thời trang, câu lạc bộ, nhà hát, v.v."
                },
                "examples": [
                    {
                        "en": "In his new suit, he looked quite the man about town.",
                        "vi": "Trong bộ đồ mới, anh ấy trông khá giống một người đàn ông của thị trấn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a man/woman who likes the same things or has the same opinions as you",
                    "vi": "một người đàn ông / phụ nữ thích những thứ giống nhau hoặc có cùng quan điểm với bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "from when somebody was young to when they were old or older",
                    "vi": "từ khi ai đó còn trẻ đến khi họ già hoặc lớn hơn"
                },
                "examples": [
                    {
                        "en": "He's been doing the same job for 50 years—man and boy.",
                        "vi": "Anh ấy đã làm công việc tương tự trong 50 năm - một người đàn ông và một cậu bé."
                    }
                ]
            },
            {
                "define": {
                    "en": "an average or ordinary person, either male or female",
                    "vi": "một người bình thường hoặc bình thường, nam hoặc nữ"
                },
                "examples": [
                    {
                        "en": "Politicians often don't understand the views of the man in the street.",
                        "vi": "Các chính trị gia thường không hiểu quan điểm của người đàn ông trên đường phố."
                    },
                    {
                        "en": "What really matters to the man and woman in the street?",
                        "vi": "Điều gì thực sự quan trọng đối với người đàn ông và phụ nữ trên đường phố?"
                    }
                ]
            },
            {
                "define": {
                    "en": "a religious man, especially a priest or a clergyman",
                    "vi": "một người tôn giáo, đặc biệt là một linh mục hoặc một giáo sĩ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a man who is chosen as having given the best performance in a game of football (soccer), cricket, etc.",
                    "vi": "một người đàn ông được chọn là người có màn trình diễn tốt nhất trong một trò chơi bóng đá (bóng đá), cricket, v.v."
                },
                "examples": [
                    {
                        "en": "Pogba was named man of the match.",
                        "vi": "Pogba được mệnh danh là người đàn ông của trận đấu."
                    }
                ]
            },
            {
                "define": {
                    "en": "the man who is the best at a particular point in time",
                    "vi": "người đàn ông giỏi nhất tại một thời điểm cụ thể"
                },
                "examples": [
                    {
                        "en": "Man of the moment Tom Ford greets the crowd at the end of his show.",
                        "vi": "Người đàn ông của khoảnh khắc Tom Ford chào đón đám đông vào cuối buổi trình diễn của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person with many skills",
                    "vi": "một người có nhiều kỹ năng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a man/woman who understands and supports ordinary people",
                    "vi": "một người đàn ông / phụ nữ hiểu và ủng hộ những người bình thường"
                },
                "examples": [
                    {
                        "en": "He is not only a statesman, but also a man of the people.",
                        "vi": "Ông không chỉ là một chính khách, mà còn là một người của nhân dân."
                    }
                ]
            },
            {
                "define": {
                    "en": "a rich and powerful man or woman",
                    "vi": "một người đàn ông hoặc phụ nữ giàu có và quyền lực"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a person with a lot of experience of life, who is not easily surprised or shocked",
                    "vi": "một người có nhiều kinh nghiệm sống, không dễ bị bất ngờ hay bị sốc"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a way of describing a dog",
                    "vi": "một cách mô tả một con chó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a person’s home is a place where they can be private and safe and do as they like",
                    "vi": "nhà của một người là nơi mà họ có thể riêng tư và an toàn và làm theo ý thích của họ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a man who is more popular with men than with women",
                    "vi": "một người đàn ông nổi tiếng với đàn ông hơn phụ nữ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "between two men who are treating each other honestly and equally",
                    "vi": "giữa hai người đàn ông đối xử chân thành và bình đẳng với nhau"
                },
                "examples": [
                    {
                        "en": "I'm telling you all this man to man.",
                        "vi": "Tôi đang kể cho bạn nghe tất cả người đàn ông này với người đàn ông khác."
                    },
                    {
                        "en": "a man-to-man talk",
                        "vi": "một cuộc nói chuyện giữa con người với con người"
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who is in danger because their enemies want to harm them",
                    "vi": "một người đang gặp nguy hiểm vì kẻ thù của họ muốn làm hại họ"
                },
                "examples": [
                    {
                        "en": "He has been a marked man since he decided to cooperate with the police.",
                        "vi": "Anh ta đã là một người đàn ông thành công kể từ khi anh ta quyết định hợp tác với cảnh sát."
                    }
                ]
            },
            {
                "define": {
                    "en": "the average person",
                    "vi": "người bình thường"
                },
                "examples": [
                    {
                        "en": "I can enjoy a joke as well as the next man, but this is going too far.",
                        "vi": "Tôi có thể thích một trò đùa cũng như người đàn ông tiếp theo, nhưng điều này đã đi quá xa."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person or thing that is different from others or does not fit easily into a group or set",
                    "vi": "một người hoặc vật khác với những người khác hoặc không dễ dàng phù hợp với một nhóm hoặc một tập hợp"
                },
                "examples": [
                    {
                        "en": "At school he was always the odd man out.",
                        "vi": "Ở trường, anh ấy luôn là một người đàn ông kỳ quặc."
                    },
                    {
                        "en": "Dog, cat, horse, shoe—which is the odd one out?",
                        "vi": "Con chó, con mèo, con ngựa, chiếc giày — cái nào là kỳ lạ?"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that different people like different things; what one person likes very much, another person does not like at all",
                    "vi": "được sử dụng để nói rằng những người khác nhau thích những thứ khác nhau; những gì một người rất thích, một người khác không thích chút nào"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a person or thing that is similar to but of a lower quality than a particular famous person or thing",
                    "vi": "người hoặc vật tương tự nhưng chất lượng thấp hơn người hoặc vật nổi tiếng cụ thể"
                },
                "examples": [
                    {
                        "en": "Sparkling white wine is the poor man's champagne.",
                        "vi": "Rượu vang trắng sủi bọt là sâm panh của người nghèo."
                    }
                ]
            },
            {
                "define": {
                    "en": "to show or prove who is brave, skilful, etc. and who is not",
                    "vi": "để thể hiện hoặc chứng minh ai là người dũng cảm, khéo léo, v.v. và ai không"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to emphasize that something is true of all the people being described",
                    "vi": "được sử dụng để nhấn mạnh rằng điều gì đó đúng với tất cả những người được mô tả"
                },
                "examples": [
                    {
                        "en": "They answered ‘Yes,’ to a man.",
                        "vi": "Họ trả lời 'Có' với một người đàn ông."
                    },
                    {
                        "en": "They were all destroyed, to the last man.",
                        "vi": "Tất cả họ đã bị tiêu diệt, cho đến người đàn ông cuối cùng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who is determined or wants something very much will succeed",
                    "vi": "một người quyết tâm hoặc mong muốn điều gì đó rất nhiều sẽ thành công"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "68267c6cbe8044c1916d431f9bb1bb05",
        "word": "balls",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/bɔːlz/",
            "us": "/bɔːlz/"
        },
        "nearby": [
            {
                "word": "ballroom",
                "pos": "noun"
            },
            {
                "word": "ballroom dancing",
                "pos": "noun"
            },
            {
                "word": "balls",
                "pos": "noun"
            },
            {
                "word": "balls",
                "pos": "verb"
            },
            {
                "word": "balls-out",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "ideas, statements or beliefs that you think are silly or not true",
                    "vi": "ý tưởng, tuyên bố hoặc niềm tin mà bạn cho là ngớ ngẩn hoặc không đúng sự thật"
                },
                "examples": [
                    {
                        "en": "That's a load of balls!",
                        "vi": "Đó là một tải trọng của quả bóng!"
                    }
                ]
            },
            {
                "define": {
                    "en": "courage",
                    "vi": "lòng can đảm"
                },
                "examples": [
                    {
                        "en": "She's got balls, I'll say that for her.",
                        "vi": "Cô ấy có bi, tôi sẽ nói điều đó cho cô ấy."
                    },
                    {
                        "en": "It took a lot of balls to do that.",
                        "vi": "Phải mất rất nhiều quả bóng để làm điều đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "used as a swear word when you are disagreeing with something, or when you are angry about something",
                    "vi": "được sử dụng như một từ chửi thề khi bạn không đồng ý với điều gì đó hoặc khi bạn tức giận về điều gì đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "testicles",
                    "vi": "tinh hoàn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to do something in a very determined or extreme way, especially when it means taking risks",
                    "vi": "để làm điều gì đó một cách rất kiên quyết hoặc cực đoan, đặc biệt là khi điều đó có nghĩa là chấp nhận rủi ro"
                },
                "examples": [
                    {
                        "en": "The team went balls out in the final.",
                        "vi": "Đội đã chơi bóng trong trận chung kết."
                    }
                ]
            }
        ]
    },
    {
        "id": "afa0e81f477c43839ed490c989071910",
        "word": "ballsy",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbɔːlzi/",
            "us": "/ˈbɔːlzi/"
        },
        "nearby": [
            {
                "word": "balls up",
                "pos": "phrasal verb"
            },
            {
                "word": "balls-up",
                "pos": "noun"
            },
            {
                "word": "ballsy",
                "pos": "adjective"
            },
            {
                "word": "ballyhoo",
                "pos": "noun"
            },
            {
                "word": "balm",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "very determined and showing a lot of courage",
                    "vi": "rất quyết tâm và thể hiện rất nhiều can đảm"
                },
                "examples": [
                    {
                        "en": "She is one ballsy lady!",
                        "vi": "Cô ấy là một trong những quý cô bóng bẩy!"
                    }
                ]
            }
        ]
    },
    {
        "id": "0118b443c18747cba01f15dadc403aea",
        "word": "bottle",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbɒtl/",
            "us": "/ˈbɑːtl/"
        },
        "nearby": [
            {
                "word": "Botswana",
                "pos": ""
            },
            {
                "word": "Botswanan",
                "pos": "noun, adjective"
            },
            {
                "word": "bottle",
                "pos": "noun"
            },
            {
                "word": "bottle",
                "pos": "verb"
            },
            {
                "word": "bottle bank",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a glass or plastic container, usually round with straight sides and a narrow neck, used especially for storing liquids",
                    "vi": "một hộp thủy tinh hoặc nhựa, thường tròn với các cạnh thẳng và cổ hẹp, được sử dụng đặc biệt để lưu trữ chất lỏng"
                },
                "examples": [
                    {
                        "en": "a wine/beer/milk/water bottle",
                        "vi": "một chai rượu / bia / sữa / nước"
                    },
                    {
                        "en": "Put the top back on the bottle.",
                        "vi": "Đặt mặt trên trở lại chai."
                    },
                    {
                        "en": "a plastic/glass bottle",
                        "vi": "một chai nhựa / thủy tinh"
                    },
                    {
                        "en": "To open the bottle, you twist and pull out the stopper.",
                        "vi": "Để mở nắp chai, bạn vặn và kéo nút ra."
                    },
                    {
                        "en": "He threw his message in a bottle into the North Sea.",
                        "vi": "Anh ta ném thông điệp của mình trong một cái chai xuống Biển Bắc."
                    }
                ]
            },
            {
                "define": {
                    "en": "the amount contained in a bottle",
                    "vi": "số lượng chứa trong một chai"
                },
                "examples": [
                    {
                        "en": "He drank a whole bottle of wine.",
                        "vi": "Anh ta uống hết một chai rượu."
                    },
                    {
                        "en": "He handed me a bottle of beer.",
                        "vi": "Anh ta đưa cho tôi một chai bia."
                    }
                ]
            },
            {
                "define": {
                    "en": "alcoholic drink",
                    "vi": "thức uống có cồn"
                },
                "examples": [
                    {
                        "en": "After his wife died, he really hit the bottle (= started drinking heavily).",
                        "vi": "Sau khi vợ chết, anh ta thực sự đập chai (= bắt đầu uống rượu nặng)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a bottle used to give milk to a baby; the milk from such a bottle (used instead of mother’s milk)",
                    "vi": "bình sữa dùng để pha sữa cho trẻ nhỏ; sữa từ bình như vậy (được sử dụng thay vì sữa mẹ)"
                },
                "examples": [
                    {
                        "en": "It's time for her bottle.",
                        "vi": "Đã đến lúc cho chai của cô ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "courage or confidence, for example to do something that is dangerous or unpleasant",
                    "vi": "lòng dũng cảm hoặc sự tự tin, chẳng hạn để làm điều gì đó nguy hiểm hoặc khó chịu"
                },
                "examples": [
                    {
                        "en": "It took a lot of bottle to do that.",
                        "vi": "Phải mất rất nhiều chai để làm điều đó."
                    },
                    {
                        "en": "I didn’t think she’d have the bottle to ask him.",
                        "vi": "Tôi không nghĩ rằng cô ấy sẽ có cái chai để hỏi anh ta."
                    }
                ]
            },
            {
                "define": {
                    "en": "to do something that has a big effect and after which it is very difficult or impossible to go back to how things were before",
                    "vi": "để làm điều gì đó có ảnh hưởng lớn và sau đó rất khó hoặc không thể quay lại mọi thứ như trước đây"
                },
                "examples": [
                    {
                        "en": "When guns were invented, the genie was let out of the bottle.",
                        "vi": "Khi súng được phát minh, thần đèn đã được thả ra khỏi chai."
                    }
                ]
            }
        ]
    },
    {
        "id": "974170531d3042fea81a77cba51d195f",
        "word": "derring-do",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌderɪŋ ˈduː/",
            "us": "/ˌderɪŋ ˈduː/"
        },
        "nearby": [
            {
                "word": "derogatory",
                "pos": "adjective"
            },
            {
                "word": "derrick",
                "pos": "noun"
            },
            {
                "word": "derring-do",
                "pos": "noun"
            },
            {
                "word": "derringer",
                "pos": "noun"
            },
            {
                "word": "Derry",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "brave actions, like those in adventure stories",
                    "vi": "những hành động dũng cảm, giống như trong những câu chuyện phiêu lưu"
                },
                "examples": [
                    {
                        "en": "tales of derring-do",
                        "vi": "câu chuyện về derring-do"
                    }
                ]
            }
        ]
    },
    {
        "id": "5cf90add3fcd49f6802015c6f87e798f",
        "word": "doughty",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈdaʊti/",
            "us": "/ˈdaʊti/"
        },
        "nearby": [
            {
                "word": "dough",
                "pos": "noun"
            },
            {
                "word": "doughnut",
                "pos": "noun"
            },
            {
                "word": "doughty",
                "pos": "adjective"
            },
            {
                "word": "Douglas",
                "pos": ""
            },
            {
                "word": "Lord Alfred Douglas",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "brave and strong",
                    "vi": "dũng cảm và mạnh mẽ"
                },
                "examples": [
                    {
                        "en": "a doughty defender of women’s rights",
                        "vi": "một người bảo vệ quyền phụ nữ hùng mạnh"
                    }
                ]
            }
        ]
    },
    {
        "id": "41d73004823a46979d0e1b31221a13bb",
        "word": "fortitude",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈfɔːtɪtjuːd/",
            "us": "/ˈfɔːrtɪtuːd/"
        },
        "nearby": [
            {
                "word": "fortissimo",
                "pos": "adverb"
            },
            {
                "word": "fortissimo",
                "pos": "adjective"
            },
            {
                "word": "fortitude",
                "pos": "noun"
            },
            {
                "word": "Fort Knox",
                "pos": "noun"
            },
            {
                "word": "Fort Lauderdale",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "courage shown by somebody who is suffering great pain or facing great difficulties",
                    "vi": "lòng dũng cảm được thể hiện bởi ai đó đang chịu đựng nỗi đau lớn hoặc đối mặt với khó khăn lớn"
                },
                "examples": [
                    {
                        "en": "She endured her illness with great fortitude.",
                        "vi": "Cô ấy đã chịu đựng bệnh tật của mình một cách kiên cường."
                    }
                ]
            }
        ]
    },
    {
        "id": "d7b9ecc405c348ecbc809f86b0714825",
        "word": "gallant",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɡælənt/",
            "us": "/ˈɡælənt/"
        },
        "nearby": [
            {
                "word": "gall",
                "pos": "noun"
            },
            {
                "word": "gall",
                "pos": "verb"
            },
            {
                "word": "gallant",
                "pos": "adjective"
            },
            {
                "word": "gallant",
                "pos": "noun"
            },
            {
                "word": "gallantly",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "brave, especially in a very difficult situation",
                    "vi": "dũng cảm, đặc biệt là trong một tình huống rất khó khăn"
                },
                "examples": [
                    {
                        "en": "gallant soldiers",
                        "vi": "những người lính dũng cảm"
                    },
                    {
                        "en": "She made a gallant attempt to hide her tears.",
                        "vi": "Cô đã cố gắng che giấu những giọt nước mắt của mình một cách dũng cảm."
                    }
                ]
            },
            {
                "define": {
                    "en": "giving polite attention to women",
                    "vi": "dành sự quan tâm lịch sự cho phụ nữ"
                },
                "examples": [
                    {
                        "en": "‘I left her standing in the rain.’ ‘That wasn’t very gallant of you.’",
                        "vi": "Tôi bỏ mặc cô ấy đứng dưới mưa.' \"Điều đó không phải là rất hào hiệp của bạn.\""
                    }
                ]
            }
        ]
    },
    {
        "id": "734de683a81043ce8aca4c07555a75f2",
        "word": "gallantry",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɡæləntri/",
            "us": "/ˈɡæləntri/"
        },
        "nearby": [
            {
                "word": "gallant",
                "pos": "noun"
            },
            {
                "word": "gallantly",
                "pos": "adverb"
            },
            {
                "word": "gallantry",
                "pos": "noun"
            },
            {
                "word": "gall bladder",
                "pos": "noun"
            },
            {
                "word": "galleon",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "courage, especially in a battle",
                    "vi": "lòng can đảm, đặc biệt là trong một trận chiến"
                },
                "examples": [
                    {
                        "en": "a medal for gallantry",
                        "vi": "một huy chương cho sự dũng cảm"
                    },
                    {
                        "en": "She praised the gallantry of the servicemen and women who had given their lives for their country.",
                        "vi": "Cô ca ngợi lòng dũng cảm của những người lính và phụ nữ đã hy sinh mạng sống của họ cho đất nước của họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "polite attention given by men to women",
                    "vi": "sự quan tâm lịch sự của đàn ông đối với phụ nữ"
                },
                "examples": [
                    {
                        "en": "‘I like to think that gallantry isn’t dead,’ he said, kissing her hand.",
                        "vi": "Tôi thích nghĩ rằng sự dũng cảm chưa chết, anh nói, hôn tay cô."
                    }
                ]
            }
        ]
    },
    {
        "id": "d253eb7d930847a88e73c04d04395042",
        "word": "gamely",
        "pos": "adverb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɡeɪmli/",
            "us": "/ˈɡeɪmli/"
        },
        "nearby": [
            {
                "word": "gamekeeper",
                "pos": "noun"
            },
            {
                "word": "gamelan",
                "pos": "noun"
            },
            {
                "word": "gamely",
                "pos": "adverb"
            },
            {
                "word": "game misconduct",
                "pos": "noun"
            },
            {
                "word": "gamepad",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "in a way that is brave, usually when a lot of effort is involved",
                    "vi": "theo cách dũng cảm, thường là khi có nhiều nỗ lực"
                },
                "examples": [
                    {
                        "en": "She tried gamely to finish the race.",
                        "vi": "Cô ấy đã cố gắng hoàn thành cuộc đua."
                    }
                ]
            }
        ]
    },
    {
        "id": "67a0ba666c8b48dbb555125727acd35f",
        "word": "grit",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ɡrɪt/",
            "us": "/ɡrɪt/"
        },
        "nearby": [
            {
                "word": "grist",
                "pos": "noun"
            },
            {
                "word": "gristle",
                "pos": "noun"
            },
            {
                "word": "grit",
                "pos": "noun"
            },
            {
                "word": "grit",
                "pos": "verb"
            },
            {
                "word": "grits",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "very small pieces of stone or sand",
                    "vi": "những mảnh đá hoặc cát rất nhỏ"
                },
                "examples": [
                    {
                        "en": "I had a piece of grit in my eye.",
                        "vi": "Tôi có một mảnh sạn trong mắt của tôi."
                    },
                    {
                        "en": "They were spreading grit and salt on the icy roads.",
                        "vi": "Họ rải sạn và muối trên những con đường băng giá."
                    },
                    {
                        "en": "A bit of grit had got into my eye.",
                        "vi": "Một chút ác cảm đã lọt vào mắt tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "the courage and strength of mind that makes it possible for somebody to continue doing something difficult or unpleasant",
                    "vi": "lòng can đảm và sức mạnh của tâm trí giúp ai đó có thể tiếp tục làm điều gì đó khó khăn hoặc khó chịu"
                },
                "examples": [
                    {
                        "en": "It takes sheer grit to stand up to a bully like that.",
                        "vi": "Cần phải có bản lĩnh tuyệt đối để chống chọi với một kẻ bắt nạt như vậy."
                    },
                    {
                        "en": "At times he got discouraged, but his grit and determination kept him going.",
                        "vi": "Có lúc anh nản lòng, nhưng sự gan dạ và quyết tâm đã giúp anh tiếp tục."
                    }
                ]
            }
        ]
    },
    {
        "id": "034f55fd48cd49af8f6cb2461d1c315e",
        "word": "gritty",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɡrɪti/",
            "us": "/ˈɡrɪti/"
        },
        "nearby": [
            {
                "word": "grittily",
                "pos": "adverb"
            },
            {
                "word": "grittiness",
                "pos": "noun"
            },
            {
                "word": "gritty",
                "pos": "adjective"
            },
            {
                "word": "grizzle",
                "pos": "verb"
            },
            {
                "word": "grizzled",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "containing or like grit",
                    "vi": "chứa hoặc giống như sạn"
                },
                "examples": [
                    {
                        "en": "a layer of gritty dust",
                        "vi": "một lớp bụi sạn"
                    }
                ]
            },
            {
                "define": {
                    "en": "showing the courage and strength of mind to continue doing something difficult or unpleasant",
                    "vi": "cho thấy lòng can đảm và sức mạnh của tâm trí để tiếp tục làm điều gì đó khó khăn hoặc khó chịu"
                },
                "examples": [
                    {
                        "en": "gritty determination",
                        "vi": "quyết tâm gan góc"
                    },
                    {
                        "en": "a gritty performance from the British player",
                        "vi": "một màn trình diễn dũng cảm từ cầu thủ người Anh"
                    },
                    {
                        "en": "Tottenham’s gritty fightback was rewarded by a goal in the closing minutes.",
                        "vi": "Sự chống trả dũng cảm của Tottenham đã được đền đáp bằng bàn thắng ở những phút cuối trận."
                    }
                ]
            },
            {
                "define": {
                    "en": "showing something unpleasant as it really is; having a lot of unpleasant features",
                    "vi": "hiển thị một cái gì đó khó chịu như nó thực sự là; có rất nhiều tính năng khó chịu"
                },
                "examples": [
                    {
                        "en": "a gritty description of urban violence",
                        "vi": "một mô tả thô bạo về bạo lực đô thị"
                    },
                    {
                        "en": "gritty realism",
                        "vi": "chủ nghĩa hiện thực gan góc"
                    },
                    {
                        "en": "(especially North American English) a gritty neighborhood of flophouses and bars",
                        "vi": "(đặc biệt là tiếng Anh ở Bắc Mỹ) một khu phố kinh dị của những căn hộ và quán bar"
                    }
                ]
            }
        ]
    },
    {
        "id": "d095681f07154fa6b98cfd3eb027a871",
        "word": "gumption",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɡʌmpʃn/",
            "us": "/ˈɡʌmpʃn/"
        },
        "nearby": [
            {
                "word": "gummed",
                "pos": "adjective"
            },
            {
                "word": "gummy",
                "pos": "adjective"
            },
            {
                "word": "gumption",
                "pos": "noun"
            },
            {
                "word": "gumshield",
                "pos": "noun"
            },
            {
                "word": "gumshoe",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the intelligence needed to know what to do in a particular situation",
                    "vi": "trí thông minh cần thiết để biết phải làm gì trong một tình huống cụ thể"
                },
                "examples": [
                    {
                        "en": "He didn’t have the gumption to keep his mouth shut.",
                        "vi": "Anh ta không có tư cách để giữ miệng của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "courage and strength of mind",
                    "vi": "lòng dũng cảm và sức mạnh của tâm trí"
                },
                "examples": [
                    {
                        "en": "She won’t tell him because she hasn’t got the gumption.",
                        "vi": "Cô ấy sẽ không nói với anh ấy bởi vì cô ấy không có óc quan sát."
                    }
                ]
            }
        ]
    },
    {
        "id": "a39f28ec898e4a438a032ed2671dac65",
        "word": "gutsy",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɡʌtsi/",
            "us": "/ˈɡʌtsi/"
        },
        "nearby": [
            {
                "word": "gutless",
                "pos": "adjective"
            },
            {
                "word": "gutser",
                "pos": "noun"
            },
            {
                "word": "gutsy",
                "pos": "adjective"
            },
            {
                "word": "gutta-percha",
                "pos": "noun"
            },
            {
                "word": "gutted",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "showing courage and the desire to succeed",
                    "vi": "thể hiện lòng dũng cảm và mong muốn thành công"
                },
                "examples": [
                    {
                        "en": "a gutsy fighter/win",
                        "vi": "một chiến binh gan dạ / chiến thắng"
                    },
                    {
                        "en": "Her gutsy performance in the game impressed everyone, even her teammates.",
                        "vi": "Màn trình diễn gan dạ của cô ấy trong game đã gây ấn tượng với tất cả mọi người, thậm chí cả đồng đội của cô ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "having strong and unusual qualities",
                    "vi": "có phẩm chất mạnh mẽ và bất thường"
                },
                "examples": [
                    {
                        "en": "a gutsy red wine",
                        "vi": "một loại rượu vang đỏ mạnh mẽ"
                    },
                    {
                        "en": "a gutsy song",
                        "vi": "một bài hát ruột"
                    }
                ]
            }
        ]
    },
    {
        "id": "07aa01dd02874c04ad6bc5a19cf0bd2b",
        "word": "have/lack the courage of your convictions",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkʌrɪdʒ/",
            "us": "/ˈkɜːrɪdʒ/"
        },
        "nearby": [
            {
                "word": "coupon",
                "pos": "noun"
            },
            {
                "word": "couponing",
                "pos": "noun"
            },
            {
                "word": "courage",
                "pos": "noun"
            },
            {
                "word": "courageous",
                "pos": "adjective"
            },
            {
                "word": "courageously",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the ability to do something dangerous, or to face pain or opposition, without showing fear",
                    "vi": "khả năng làm điều gì đó nguy hiểm hoặc đối mặt với đau đớn hoặc chống đối mà không hề tỏ ra sợ hãi"
                },
                "examples": [
                    {
                        "en": "He showed great courage and determination.",
                        "vi": "Anh ấy đã thể hiện sự dũng cảm và quyết tâm cao độ."
                    },
                    {
                        "en": "moral/physical courage",
                        "vi": "lòng can đảm về đạo đức / thể chất"
                    },
                    {
                        "en": "courage to do something They had the courage to stand up and fight for what they believed in.",
                        "vi": "can đảm để làm điều gì đó Họ có can đảm để đứng lên và chiến đấu cho những gì họ tin tưởng."
                    },
                    {
                        "en": "He couldn't find the courage to tell his daughters what had happened.",
                        "vi": "Ông không thể tìm thấy can đảm để nói với các con gái của mình những gì đã xảy ra."
                    },
                    {
                        "en": "Many said that the women's stories gave them the courage to pursue their goals",
                        "vi": "Nhiều người nói rằng câu chuyện của những người phụ nữ đã giúp họ can đảm để theo đuổi mục tiêu của mình"
                    },
                    {
                        "en": "I haven't yet plucked up the courage to ask her.",
                        "vi": "Tôi vẫn chưa lấy hết can đảm để hỏi cô ấy."
                    },
                    {
                        "en": "It takes courage to sing in public.",
                        "vi": "Cần có can đảm để hát trước đám đông."
                    },
                    {
                        "en": "His courage in battle won him a promotion.",
                        "vi": "Sự can đảm của anh ấy trong trận chiến đã giúp anh ấy được thăng chức."
                    },
                    {
                        "en": "She displayed remarkable courage in the face of danger.",
                        "vi": "Cô ấy đã thể hiện sự dũng cảm đáng nể khi đối mặt với nguy hiểm."
                    },
                    {
                        "en": "courage in doing something I admire your courage in saying what you think.",
                        "vi": "can đảm làm điều gì đó Tôi ngưỡng mộ sự can đảm của bạn khi nói những gì bạn nghĩ."
                    },
                    {
                        "en": "with courage They fought with courage, but were no match for the enemy.",
                        "vi": "với lòng dũng cảm Họ đã chiến đấu với lòng dũng cảm, nhưng không thể địch nổi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be/not be brave enough to do what you feel to be right",
                    "vi": "trở thành / không đủ can đảm để làm những gì bạn cảm thấy là đúng"
                },
                "examples": [
                    {
                        "en": "You need to have the courage of your convictions.",
                        "vi": "Bạn cần phải có can đảm về niềm tin của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to force yourself to be brave enough to do something",
                    "vi": "buộc bản thân phải đủ can đảm để làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "I finally screwed up my courage and went to the dentist.",
                        "vi": "Cuối cùng tôi cũng lấy hết can đảm và đến gặp nha sĩ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to begin to feel happier and more confident because of something",
                    "vi": "để bắt đầu cảm thấy hạnh phúc và tự tin hơn vì điều gì đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to make yourself do something that you are afraid of",
                    "vi": "để khiến bản thân làm điều gì đó mà bạn sợ hãi"
                },
                "examples": [
                    {
                        "en": "Taking her courage in both hands, she opened the door and walked in.",
                        "vi": "Lấy hết can đảm trên cả hai tay, cô mở cửa bước vào."
                    }
                ]
            }
        ]
    },
    {
        "id": "cbef4757acfc4211bc45e239257868ba",
        "word": "heroics",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/həˈrəʊɪks/",
            "us": "/həˈrəʊɪks/"
        },
        "nearby": [
            {
                "word": "heroically",
                "pos": "adverb"
            },
            {
                "word": "heroic couplet",
                "pos": "noun"
            },
            {
                "word": "heroics",
                "pos": "noun"
            },
            {
                "word": "heroin",
                "pos": "noun"
            },
            {
                "word": "heroine",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "talk or behaviour that is too brave or dramatic for a particular situation",
                    "vi": "nói chuyện hoặc hành vi quá dũng cảm hoặc kịch tính đối với một tình huống cụ thể"
                },
                "examples": [
                    {
                        "en": "Remember, no heroics, we just go in there and do our job.",
                        "vi": "Hãy nhớ rằng, không có anh hùng, chúng tôi chỉ vào đó và làm công việc của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "actions that are brave and determined",
                    "vi": "hành động dũng cảm và quyết tâm"
                },
                "examples": [
                    {
                        "en": "Thanks to Bateman's heroics in the second half, the team won 2–0.",
                        "vi": "Nhờ sự anh hùng của Bateman trong hiệp hai, đội đã giành chiến thắng với tỷ số 2–0."
                    }
                ]
            }
        ]
    },
    {
        "id": "3764e8c7525046e4b8e4b47fec769493",
        "word": "indomitable",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ɪnˈdɒmɪtəbl/",
            "us": "/ɪnˈdɑːmɪtəbl/"
        },
        "nearby": [
            {
                "word": "indolence",
                "pos": "noun"
            },
            {
                "word": "indolent",
                "pos": "adjective"
            },
            {
                "word": "indomitable",
                "pos": "adjective"
            },
            {
                "word": "Indonesia",
                "pos": "noun"
            },
            {
                "word": "Indonesian",
                "pos": "noun, adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "not willing to accept defeat, even in a difficult situation; very brave and determined",
                    "vi": "không sẵn sàng chấp nhận thất bại, ngay cả trong một tình huống khó khăn; rất dũng cảm và quyết tâm"
                },
                "examples": [
                    {
                        "en": "an indomitable spirit",
                        "vi": "tinh thần bất khuất"
                    },
                    {
                        "en": "an indomitable campaigner for human rights",
                        "vi": "một nhà vận động bất khuất cho nhân quyền"
                    }
                ]
            }
        ]
    },
    {
        "id": "5ee1bd5dcf904b2f88a6b20e7125d0ba",
        "word": "intrepid",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ɪnˈtrepɪd/",
            "us": "/ɪnˈtrepɪd/"
        },
        "nearby": [
            {
                "word": "intravenously",
                "pos": "adverb"
            },
            {
                "word": "in tray",
                "pos": "noun"
            },
            {
                "word": "intrepid",
                "pos": "adjective"
            },
            {
                "word": "intricacy",
                "pos": "noun"
            },
            {
                "word": "intricate",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "very brave; not afraid of danger or difficulties",
                    "vi": "rat dung cam; không ngại nguy hiểm, khó khăn"
                },
                "examples": [
                    {
                        "en": "Traders and missionaries often proved themselves to be intrepid explorers.",
                        "vi": "Các thương nhân và nhà truyền giáo thường chứng tỏ mình là những nhà thám hiểm gan dạ."
                    }
                ]
            }
        ]
    },
    {
        "id": "e268a4cf685b4c03abf5c013a798724a",
        "word": "manful",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmænfl/",
            "us": "/ˈmænfl/"
        },
        "nearby": [
            {
                "word": "man flu",
                "pos": "noun"
            },
            {
                "word": "man Friday",
                "pos": "noun"
            },
            {
                "word": "manful",
                "pos": "adjective"
            },
            {
                "word": "manfully",
                "pos": "adverb"
            },
            {
                "word": "manga",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "done in a brave and determined way",
                    "vi": "thực hiện một cách dũng cảm và kiên quyết"
                },
                "examples": [
                    {
                        "en": "a manful attempt/effort",
                        "vi": "một nỗ lực / nỗ lực nam tính"
                    }
                ]
            }
        ]
    },
    {
        "id": "7ad19d1d11a047d695a3e374ef326416",
        "word": "muster",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmʌstə(r)/",
            "us": "/ˈmʌstər/"
        },
        "nearby": [
            {
                "word": "mustard gas",
                "pos": "noun"
            },
            {
                "word": "mustard greens",
                "pos": "noun"
            },
            {
                "word": "muster",
                "pos": "verb"
            },
            {
                "word": "muster",
                "pos": "noun"
            },
            {
                "word": "muster station",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to find as much support, courage, etc. as you can",
                    "vi": "để tìm sự hỗ trợ, can đảm, v.v. nhiều nhất có thể"
                },
                "examples": [
                    {
                        "en": "We mustered what support we could for the plan.",
                        "vi": "Chúng tôi đã tập hợp những hỗ trợ nào có thể cho kế hoạch."
                    },
                    {
                        "en": "She left the room with all the dignity she could muster.",
                        "vi": "Cô rời khỏi phòng với tất cả phẩm giá mà cô có thể tập hợp được."
                    },
                    {
                        "en": "He could muster only 154 votes at the election.",
                        "vi": "Anh ta chỉ có thể thu thập được 154 phiếu bầu tại cuộc bầu cử."
                    }
                ]
            },
            {
                "define": {
                    "en": "to come together or to bring people, especially soldiers, together, for example for military action",
                    "vi": "đến với nhau hoặc để đưa mọi người, đặc biệt là những người lính, lại với nhau, chẳng hạn như hành động quân sự"
                },
                "examples": [
                    {
                        "en": "The troops mustered.",
                        "vi": "Quân đội tập hợp lại."
                    },
                    {
                        "en": "The force mustered 1 000 strong.",
                        "vi": "Lực lượng tập hợp 1 000 mạnh mẽ."
                    },
                    {
                        "en": "muster somebody/something to muster an army",
                        "vi": "tập hợp ai đó / cái gì đó để tập hợp một đội quân"
                    },
                    {
                        "en": "The navy could muster 44 warships.",
                        "vi": "Hải quân có thể tập hợp 44 tàu chiến."
                    }
                ]
            },
            {
                "define": {
                    "en": "to gather together sheep or cows",
                    "vi": "tập hợp cừu hoặc bò cùng nhau"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "3bf47bc7648541168499a18d1ae6f46a",
        "word": "nerve",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/nɜːv/",
            "us": "/nɜːrv/"
        },
        "nearby": [
            {
                "word": "nerd",
                "pos": "noun"
            },
            {
                "word": "nerdy",
                "pos": "adjective"
            },
            {
                "word": "nerve",
                "pos": "noun"
            },
            {
                "word": "nerve",
                "pos": "verb"
            },
            {
                "word": "nerve agent",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "any of the long fibres that carry messages between the brain and parts of the body, enabling you to move, feel pain, etc.",
                    "vi": "bất kỳ sợi dài nào mang thông điệp giữa não và các bộ phận của cơ thể, cho phép bạn cử động, cảm thấy đau, v.v."
                },
                "examples": [
                    {
                        "en": "the optic nerve",
                        "vi": "dây thần kinh thị giác"
                    },
                    {
                        "en": "He's off work with a trapped nerve in his neck.",
                        "vi": "Anh ấy đang nghỉ việc với một dây thần kinh bị kẹt ở cổ."
                    },
                    {
                        "en": "Every nerve in her body was tense.",
                        "vi": "Mọi dây thần kinh trong cơ thể cô đều căng thẳng."
                    },
                    {
                        "en": "The illness kills nerve cells and causes chronic fatigue.",
                        "vi": "Căn bệnh này giết chết các tế bào thần kinh và gây ra tình trạng mệt mỏi mãn tính."
                    },
                    {
                        "en": "Pain occurs when the nerve fibres are damaged.",
                        "vi": "Đau xảy ra khi các sợi thần kinh bị tổn thương."
                    },
                    {
                        "en": "Signals are transmitted from the nerve endings to the brain.",
                        "vi": "Tín hiệu được truyền từ đầu dây thần kinh đến não."
                    },
                    {
                        "en": "The disease can also cause nerve damage.",
                        "vi": "Bệnh cũng có thể gây tổn thương dây thần kinh."
                    }
                ]
            },
            {
                "define": {
                    "en": "feelings of worry or stress",
                    "vi": "cảm giác lo lắng hoặc căng thẳng"
                },
                "examples": [
                    {
                        "en": "Even after years as a singer, he still suffers from nerves before a performance.",
                        "vi": "Ngay cả sau nhiều năm làm ca sĩ, anh ấy vẫn bị căng thẳng trước một buổi biểu diễn."
                    },
                    {
                        "en": "I need something to calm my nerves.",
                        "vi": "Tôi cần thứ gì đó để xoa dịu thần kinh của mình."
                    },
                    {
                        "en": "to settle/soothe/steady your nerves",
                        "vi": "để giải quyết / làm dịu / ổn định thần kinh của bạn"
                    },
                    {
                        "en": "Everyone's nerves were on edge (= everyone felt tense).",
                        "vi": "Mọi người đều căng thẳng (= mọi người đều cảm thấy căng thẳng)."
                    },
                    {
                        "en": "He lives on his nerves (= is always worried).",
                        "vi": "Anh ấy sống dựa vào thần kinh của mình (= luôn lo lắng)."
                    },
                    {
                        "en": "By the end of the meal her nerves were completely frayed.",
                        "vi": "Đến cuối bữa ăn, thần kinh của cô hoàn toàn không còn sức lực."
                    }
                ]
            },
            {
                "define": {
                    "en": "the courage to do something difficult or dangerous",
                    "vi": "can đảm để làm điều gì đó khó khăn hoặc nguy hiểm"
                },
                "examples": [
                    {
                        "en": "It took a lot of nerve to take the company to court.",
                        "vi": "Phải rất căng thẳng để đưa công ty ra tòa."
                    },
                    {
                        "en": "I was going to have a go at parachuting but lost my nerve at the last minute.",
                        "vi": "Tôi đã định nhảy dù nhưng bị mất thần kinh vào phút cuối."
                    },
                    {
                        "en": "He held his nerve to win the final set 6–4.",
                        "vi": "Anh ấy đã cố gắng để giành chiến thắng trong set 6–4 cuối cùng."
                    },
                    {
                        "en": "Investors largely kept their nerve and stayed with the company.",
                        "vi": "Các nhà đầu tư chủ yếu giữ vững tâm lý và ở lại với công ty."
                    },
                    {
                        "en": "It was an amazing journey which tested her nerves to the full.",
                        "vi": "Đó là một cuộc hành trình tuyệt vời đã kiểm tra thần kinh của cô ấy một cách đầy đủ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a way of behaving that other people think is rude or not appropriate",
                    "vi": "một cách cư xử mà người khác cho là thô lỗ hoặc không phù hợp"
                },
                "examples": [
                    {
                        "en": "I don't know how you have the nerve to show your face after what you said!",
                        "vi": "Tôi không biết làm thế nào bạn có đủ can đảm để lộ ra khuôn mặt của bạn sau những gì bạn nói!"
                    },
                    {
                        "en": "He's got a nerve asking us for money!",
                        "vi": "Anh ta có gan đòi tiền chúng tôi!"
                    },
                    {
                        "en": "‘Then she demanded to see the manager!’ ‘What a nerve!’",
                        "vi": "Sau đó cô ấy yêu cầu gặp người quản lý!' 'Thật là một thần kinh!'"
                    },
                    {
                        "en": "He had some nerve to insult Mina's cooking.",
                        "vi": "Anh ta có chút gan dạ để xúc phạm công việc nấu nướng của Mina."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be very nervous",
                    "vi": "rất lo lắng"
                },
                "examples": [
                    {
                        "en": "By the time of the interview, I was a bundle of nerves.",
                        "vi": "Vào thời điểm phỏng vấn, tôi đã bó tay."
                    }
                ]
            },
            {
                "define": {
                    "en": "to annoy somebody",
                    "vi": "làm phiền ai đó"
                },
                "examples": [
                    {
                        "en": "That music is starting to get on my nerves.",
                        "vi": "Âm nhạc đó đang bắt đầu làm tôi lo lắng."
                    },
                    {
                        "en": "It really gets on my nerves when people talk loudly on the phone in public.",
                        "vi": "Tôi thực sự lo lắng khi mọi người nói chuyện điện thoại ồn ào ở nơi công cộng."
                    },
                    {
                        "en": "His endless whining really gets on my nerves.",
                        "vi": "Tiếng rên rỉ bất tận của anh ấy thực sự làm tôi lo lắng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be able to remain calm in a difficult or dangerous situation",
                    "vi": "để có thể giữ bình tĩnh trong một tình huống khó khăn hoặc nguy hiểm"
                },
                "examples": [
                    {
                        "en": "You need nerves of steel to be a good poker player.",
                        "vi": "Bạn cần có thần kinh thép để trở thành một người chơi poker giỏi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to mention a subject that makes somebody feel angry, upset, embarrassed, etc.",
                    "vi": "đề cập đến một chủ đề khiến ai đó cảm thấy tức giận, khó chịu, xấu hổ, v.v."
                },
                "examples": [
                    {
                        "en": "You touched a raw nerve when you mentioned his first wife.",
                        "vi": "Bạn đã xúc động mạnh khi nhắc đến người vợ đầu tiên của anh ấy."
                    },
                    {
                        "en": "My remarks about divorce had unwittingly touched a raw nerve.",
                        "vi": "Những nhận xét của tôi về việc ly hôn đã vô tình chạm vào một dây thần kinh thô."
                    },
                    {
                        "en": "The article struck a raw nerve as it revived unpleasant memories.",
                        "vi": "Bài báo đánh vào một dây thần kinh thô khi nó làm sống lại những ký ức khó chịu."
                    }
                ]
            },
            {
                "define": {
                    "en": "to try as hard as you can to do something",
                    "vi": "cố gắng hết sức có thể để làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "He strained every nerve to snatch victory from defeat.",
                        "vi": "Anh ta căng mọi dây thần kinh để giành lấy chiến thắng từ thất bại."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have a strong effect",
                    "vi": "để có một hiệu ứng mạnh mẽ"
                },
                "examples": [
                    {
                        "en": "His work strikes a nerve with people who are attracted to nostalgia.",
                        "vi": "Tác phẩm của anh gây ấn tượng mạnh với những người bị thu hút bởi sự hoài cổ."
                    },
                    {
                        "en": "It seems I struck a nerve with my last post about cell phones.",
                        "vi": "Có vẻ như tôi đã giật mình với bài viết cuối cùng của tôi về điện thoại di động."
                    },
                    {
                        "en": "Nissan may well strike a popular nerve here.",
                        "vi": "Nissan cũng có thể tấn công một thần kinh phổ biến ở đây."
                    }
                ]
            },
            {
                "define": {
                    "en": "an attempt to defeat your opponents by putting pressure on them so that they lose courage or confidence",
                    "vi": "nỗ lực đánh bại đối thủ của bạn bằng cách gây áp lực lên họ để họ mất can đảm hoặc tự tin"
                },
                "examples": [
                    {
                        "en": "The union has been fighting a war of nerves with the management over pay.",
                        "vi": "Công đoàn đã phải đối mặt với một cuộc chiến căng thẳng với việc quản lý quá mức lương."
                    }
                ]
            }
        ]
    },
    {
        "id": "20775e5abf8548e29ddeaa1c8ab63a97",
        "word": "outface",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌaʊtˈfeɪs/",
            "us": "/ˌaʊtˈfeɪs/"
        },
        "nearby": [
            {
                "word": "outer space",
                "pos": "noun"
            },
            {
                "word": "outerwear",
                "pos": "noun"
            },
            {
                "word": "outface",
                "pos": "verb"
            },
            {
                "word": "outfall",
                "pos": "noun"
            },
            {
                "word": "outfield",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to defeat an enemy or opponent by being brave and remaining confident",
                    "vi": "để đánh bại kẻ thù hoặc đối thủ bằng cách dũng cảm và luôn tự tin"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "26f03f392d174e49b4f12721171b5390",
        "word": "pluck",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/plʌk/",
            "us": "/plʌk/"
        },
        "nearby": [
            {
                "word": "ploy",
                "pos": "noun"
            },
            {
                "word": "pluck",
                "pos": "verb"
            },
            {
                "word": "pluck",
                "pos": "noun"
            },
            {
                "word": "pluck at",
                "pos": "phrasal verb"
            },
            {
                "word": "pluckily",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the quality of being brave and determined",
                    "vi": "phẩm chất của dũng cảm và quyết tâm"
                },
                "examples": [
                    {
                        "en": "It takes a lot of pluck to do what she did.",
                        "vi": "Phải rất vất vả mới có thể làm được những gì cô ấy đã làm."
                    },
                    {
                        "en": "It takes some pluck to stand up to bullies like that.",
                        "vi": "Phải mất một chút kinh nghiệm để chống chọi với những kẻ bắt nạt như thế."
                    }
                ]
            }
        ]
    },
    {
        "id": "add19be93a0f482891db1b167578ae6e",
        "word": "plucky",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈplʌki/",
            "us": "/ˈplʌki/"
        },
        "nearby": [
            {
                "word": "pluck at",
                "pos": "phrasal verb"
            },
            {
                "word": "pluckily",
                "pos": "adverb"
            },
            {
                "word": "plucky",
                "pos": "adjective"
            },
            {
                "word": "plug-in",
                "pos": "noun"
            },
            {
                "word": "plug",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "having a lot of courage; being very determined",
                    "vi": "có rất nhiều dũng khí; rất quyết tâm"
                },
                "examples": [
                    {
                        "en": "The plucky youngster had four operations during her long battle against the illness.",
                        "vi": "Cô gái trẻ may mắn đã trải qua 4 cuộc phẫu thuật trong suốt thời gian dài chống chọi với căn bệnh quái ác."
                    }
                ]
            }
        ]
    },
    {
        "id": "792b474256624b5d9207116df15b6db0",
        "word": "spirited",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈspɪrɪtɪd/",
            "us": "/ˈspɪrɪtɪd/"
        },
        "nearby": [
            {
                "word": "spirit",
                "pos": "verb"
            },
            {
                "word": "Spirit",
                "pos": ""
            },
            {
                "word": "spirited",
                "pos": "adjective"
            },
            {
                "word": "spiritedly",
                "pos": "adverb"
            },
            {
                "word": "spirit gum",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "full of energy, courage or determination",
                    "vi": "đầy năng lượng, can đảm hoặc quyết tâm"
                },
                "examples": [
                    {
                        "en": "a spirited young woman",
                        "vi": "một phụ nữ trẻ đầy tinh thần"
                    },
                    {
                        "en": "a spirited discussion",
                        "vi": "một cuộc thảo luận đầy tinh thần"
                    },
                    {
                        "en": "She put up a spirited defence in the final game.",
                        "vi": "Cô ấy đã đưa ra một sự bảo vệ tinh thần trong trò chơi cuối cùng."
                    },
                    {
                        "en": "The team produced a spirited performance.",
                        "vi": "Nhóm đã tạo ra một màn trình diễn đầy tinh thần."
                    }
                ]
            }
        ]
    },
    {
        "id": "bf531674aae34484aa5530d9185767af",
        "word": "spunk",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/spʌŋk/",
            "us": "/spʌŋk/"
        },
        "nearby": [
            {
                "word": "spume",
                "pos": "noun"
            },
            {
                "word": "spun",
                "pos": "verb"
            },
            {
                "word": "spunk",
                "pos": "noun"
            },
            {
                "word": "spunky",
                "pos": "adjective"
            },
            {
                "word": "spun sugar",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "courage; determination",
                    "vi": "lòng can đảm; sự quyết tâm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "semen (= the white liquid containing sperm that is produced by the sex organs of men and male animals)",
                    "vi": "tinh dịch (= chất lỏng màu trắng có chứa tinh trùng được tạo ra bởi các cơ quan sinh dục của nam giới và động vật đực)"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a sexually attractive person",
                    "vi": "một người hấp dẫn tình dục"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "7864ecbc544c4e5281e1761b753be23f",
        "word": "staunch",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/stɔːntʃ/",
            "us": "/stɔːntʃ/"
        },
        "nearby": [
            {
                "word": "statutory rape",
                "pos": "noun"
            },
            {
                "word": "statutory sick pay",
                "pos": "noun"
            },
            {
                "word": "staunch",
                "pos": "adjective"
            },
            {
                "word": "staunch",
                "pos": "verb"
            },
            {
                "word": "staunchly",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "always showing strong support in your opinions and attitude",
                    "vi": "luôn thể hiện sự ủng hộ mạnh mẽ đối với ý kiến và thái độ của bạn"
                },
                "examples": [
                    {
                        "en": "a staunch supporter of the monarchy",
                        "vi": "một người ủng hộ trung thành của chế độ quân chủ"
                    },
                    {
                        "en": "one of the president’s staunchest allies",
                        "vi": "một trong những đồng minh trung thành nhất của tổng thống"
                    },
                    {
                        "en": "a staunch Catholic",
                        "vi": "một người Công giáo trung thành"
                    }
                ]
            }
        ]
    },
    {
        "id": "3b340f339bb14473827c173213a1aa0e",
        "word": "stout",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/staʊt/",
            "us": "/staʊt/"
        },
        "nearby": [
            {
                "word": "stoup",
                "pos": "noun"
            },
            {
                "word": "Stourhead",
                "pos": ""
            },
            {
                "word": "stout",
                "pos": "adjective"
            },
            {
                "word": "Rex Stout",
                "pos": ""
            },
            {
                "word": "stout",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "rather fat",
                    "vi": "khá béo"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "strong and thick",
                    "vi": "mạnh và dày"
                },
                "examples": [
                    {
                        "en": "a stout pair of shoes",
                        "vi": "một đôi giày mập mạp"
                    },
                    {
                        "en": "a stout stick",
                        "vi": "một cây gậy mập mạp"
                    }
                ]
            },
            {
                "define": {
                    "en": "brave and determined",
                    "vi": "dũng cảm và quyết tâm"
                },
                "examples": [
                    {
                        "en": "He put up a stout defence in court.",
                        "vi": "Anh ta đưa ra một biện pháp bảo vệ cứng rắn trước tòa."
                    },
                    {
                        "en": "This requires a stout heart.",
                        "vi": "Điều này đòi hỏi một trái tim kiên cường."
                    }
                ]
            }
        ]
    },
    {
        "id": "6d640ace63654b039493f7ea601243d1",
        "word": "stout-hearted",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌstaʊt ˈhɑːtɪd/",
            "us": "/ˌstaʊt ˈhɑːrtɪd/"
        },
        "nearby": [
            {
                "word": "Rex Stout",
                "pos": ""
            },
            {
                "word": "stout",
                "pos": "noun"
            },
            {
                "word": "stout-hearted",
                "pos": "adjective"
            },
            {
                "word": "stoutly",
                "pos": "adverb"
            },
            {
                "word": "stoutness",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "brave and determined",
                    "vi": "dũng cảm và quyết tâm"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "282bd5f7a3f94ed489a60f25e7617e53",
        "word": "unflinching",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ʌnˈflɪntʃɪŋ/",
            "us": "/ʌnˈflɪntʃɪŋ/"
        },
        "nearby": [
            {
                "word": "unflappable",
                "pos": "adjective"
            },
            {
                "word": "unflattering",
                "pos": "adjective"
            },
            {
                "word": "unflinching",
                "pos": "adjective"
            },
            {
                "word": "unflinchingly",
                "pos": "adverb"
            },
            {
                "word": "unfocused",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "remaining strong and determined, even in a difficult or dangerous situation",
                    "vi": "vẫn mạnh mẽ và quyết tâm, ngay cả trong tình huống khó khăn hoặc nguy hiểm"
                },
                "examples": [
                    {
                        "en": "unflinching loyalty",
                        "vi": "lòng trung thành không lay chuyển"
                    },
                    {
                        "en": "an unflinching stare",
                        "vi": "một cái nhìn chằm chằm không nao núng"
                    }
                ]
            }
        ]
    },
    {
        "id": "38a0f1a1a1cd442a9a04dd85a3f6c536",
        "word": "valiant",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈvæliənt/",
            "us": "/ˈvæliənt/"
        },
        "nearby": [
            {
                "word": "valet parking",
                "pos": "noun"
            },
            {
                "word": "Valhalla",
                "pos": "noun"
            },
            {
                "word": "valiant",
                "pos": "adjective"
            },
            {
                "word": "valiantly",
                "pos": "adverb"
            },
            {
                "word": "valid",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "very brave or determined",
                    "vi": "rất dũng cảm hoặc quyết tâm"
                },
                "examples": [
                    {
                        "en": "valiant warriors",
                        "vi": "những chiến binh dũng cảm"
                    },
                    {
                        "en": "She made a valiant attempt not to laugh.",
                        "vi": "Cô ấy đã thực hiện một nỗ lực dũng cảm để không cười."
                    },
                    {
                        "en": "The firefighters made valiant efforts to save them, but were beaten back by the flames.",
                        "vi": "Các nhân viên cứu hỏa đã nỗ lực dũng cảm để cứu họ, nhưng bị ngọn lửa đánh trả."
                    }
                ]
            }
        ]
    },
    {
        "id": "0e5a7239587749a9bd82b7bc56caa9ea",
        "word": "valour",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈvælə(r)/",
            "us": "/ˈvælər/"
        },
        "nearby": [
            {
                "word": "Valley Girl",
                "pos": "noun"
            },
            {
                "word": "valorous",
                "pos": "adjective"
            },
            {
                "word": "valour",
                "pos": "noun"
            },
            {
                "word": "valuable",
                "pos": "adjective"
            },
            {
                "word": "valuables",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "great courage, especially in war",
                    "vi": "lòng dũng cảm tuyệt vời, đặc biệt là trong chiến tranh"
                },
                "examples": [
                    {
                        "en": "He showed valour and skill on the battlefield.",
                        "vi": "Anh ấy đã thể hiện dũng cảm và kỹ năng trên chiến trường."
                    },
                    {
                        "en": "a soldier famed for his great valour",
                        "vi": "một người lính nổi tiếng với lòng dũng cảm vĩ đại của anh ấy"
                    },
                    {
                        "en": "The purpose of the award is to recognize acts of valour by members of the armed services.",
                        "vi": "Mục đích của giải thưởng là để công nhận các hành vi dũng cảm của các thành viên của các dịch vụ vũ trang."
                    }
                ]
            }
        ]
    }
]