[
    {
        "id": "fd53d8ec27024555a5e3e297ab8fa978",
        "word": "air",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/eə(r)/",
            "us": "/er/"
        },
        "nearby": [
            {
                "word": "Aintree",
                "pos": ""
            },
            {
                "word": "aioli",
                "pos": "noun"
            },
            {
                "word": "air",
                "pos": "noun"
            },
            {
                "word": "air",
                "pos": "verb"
            },
            {
                "word": "air ambulance",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the mixture of gases that surrounds the earth and that we breathe",
                    "vi": "hỗn hợp khí bao quanh trái đất và chúng ta hít thở"
                },
                "examples": [
                    {
                        "en": "Let's go out for some fresh air.",
                        "vi": "Hãy ra ngoài để có không khí trong lành."
                    },
                    {
                        "en": "a blast of hot air",
                        "vi": "một luồng khí nóng"
                    },
                    {
                        "en": "currents of warm air",
                        "vi": "dòng khí ấm"
                    },
                    {
                        "en": "He stood outside, breathing the cold night air.",
                        "vi": "Anh đứng bên ngoài, hít thở bầu không khí lạnh lẽo về đêm."
                    },
                    {
                        "en": "She was gasping for air as she ran out of the burning house.",
                        "vi": "Cô ấy đang thở hổn hển khi chạy ra khỏi ngôi nhà đang cháy."
                    },
                    {
                        "en": "whales coming up for air (= in order to breathe)",
                        "vi": "cá voi đến lấy không khí (= để thở)"
                    },
                    {
                        "en": "I need to put some air in my tyres.",
                        "vi": "Tôi cần phải cho một ít không khí vào lốp xe của tôi."
                    },
                    {
                        "en": "The agreement requires reductions in air pollution.",
                        "vi": "Thỏa thuận yêu cầu giảm ô nhiễm không khí."
                    },
                    {
                        "en": "The Act lays down a minimum standard for air quality.",
                        "vi": "Đạo luật đưa ra một tiêu chuẩn tối thiểu về chất lượng không khí."
                    }
                ]
            },
            {
                "define": {
                    "en": "the space above the ground or that is around things",
                    "vi": "không gian trên mặt đất hoặc xung quanh mọi thứ"
                },
                "examples": [
                    {
                        "en": "Music filled the night air.",
                        "vi": "Âm nhạc tràn ngập không khí đêm."
                    },
                    {
                        "en": "in/into the air Wave your hands in the air!",
                        "vi": "trong / vào không khí Vẫy tay trong không khí!"
                    },
                    {
                        "en": "I kicked the ball high into the air.",
                        "vi": "Tôi đá quả bóng lên cao."
                    },
                    {
                        "en": "through the air Spicy smells wafted through the air.",
                        "vi": "qua không khí Mùi cay thoảng qua không khí."
                    },
                    {
                        "en": "He punched the air in triumph.",
                        "vi": "Anh ta đấm vào không khí trong chiến thắng."
                    },
                    {
                        "en": "The air was thick with cigarette smoke.",
                        "vi": "Không khí đặc quánh khói thuốc lá."
                    }
                ]
            },
            {
                "define": {
                    "en": "the space above the earth where planes fly",
                    "vi": "không gian trên trái đất nơi máy bay bay"
                },
                "examples": [
                    {
                        "en": "The temple was clearly visible from the air.",
                        "vi": "Ngôi đền có thể nhìn thấy rõ ràng từ trên không."
                    },
                    {
                        "en": "We watched as the helicopter took to the air.",
                        "vi": "Chúng tôi quan sát khi máy bay trực thăng cất cánh."
                    },
                    {
                        "en": "by air It only takes three hours by air (= in a plane).",
                        "vi": "bằng đường hàng không Chỉ mất ba giờ bằng đường hàng không (= trên máy bay)."
                    },
                    {
                        "en": "air travel/traffic",
                        "vi": "du lịch hàng không / giao thông"
                    },
                    {
                        "en": "air defence systems (= weapons that defend against attacks from the air)",
                        "vi": "hệ thống phòng không (= vũ khí bảo vệ chống lại các cuộc tấn công từ trên không)"
                    },
                    {
                        "en": "A surprise air attack (= from aircraft) was launched at night.",
                        "vi": "Một cuộc không kích bất ngờ (= từ máy bay) đã được phát động vào ban đêm."
                    }
                ]
            },
            {
                "define": {
                    "en": "the particular feeling or impression that is given by somebody/something; the way somebody does something",
                    "vi": "cảm giác hoặc ấn tượng cụ thể do ai đó / cái gì đó mang lại; cách ai đó làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "She looked at him with a defiant air.",
                        "vi": "Cô ấy nhìn anh ta với một không khí thách thức."
                    },
                    {
                        "en": "air of something The room had an air of luxury.",
                        "vi": "không khí của một cái gì đó Căn phòng có một không khí sang trọng."
                    },
                    {
                        "en": "There was an air of complete confidence about her.",
                        "vi": "Có một bầu không khí hoàn toàn tự tin về cô ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "a tune",
                    "vi": "một giai điệu"
                },
                "examples": [
                    {
                        "en": "Bach’s Air on a G string",
                        "vi": "Bach's Air trên dây G"
                    }
                ]
            },
            {
                "define": {
                    "en": "a way of behaving that shows that somebody thinks that they are more important, etc. than they really are",
                    "vi": "một cách cư xử cho thấy ai đó nghĩ rằng họ quan trọng hơn, v.v. so với thực tế"
                },
                "examples": [
                    {
                        "en": "I hate the way she puts on airs.",
                        "vi": "Tôi ghét cách cô ấy lên sóng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a way of behaving that shows that somebody thinks that they are more important, etc. than they really are",
                    "vi": "một cách cư xử cho thấy ai đó nghĩ rằng họ quan trọng hơn, v.v. so với thực tế"
                },
                "examples": [
                    {
                        "en": "Even when he became a star he didn’t have any airs and graces.",
                        "vi": "Ngay cả khi đã trở thành một ngôi sao, anh ấy cũng không có bất kỳ sự quan tâm và ân sủng nào."
                    }
                ]
            },
            {
                "define": {
                    "en": "clean air breathed in after being indoors or in a dirty atmosphere",
                    "vi": "không khí sạch được hít vào sau khi ở trong nhà hoặc trong bầu không khí bẩn"
                },
                "examples": [
                    {
                        "en": "We'll get a breath of fresh air at lunchtime.",
                        "vi": "Chúng ta sẽ được hít thở không khí trong lành vào giờ ăn trưa."
                    },
                    {
                        "en": "I'm going outside for a breath of fresh air.",
                        "vi": "Tôi ra ngoài hít thở không khí trong lành."
                    }
                ]
            },
            {
                "define": {
                    "en": "(to have) plans or dreams that are not likely to happen or come true",
                    "vi": "(có) kế hoạch hoặc ước mơ không có khả năng xảy ra hoặc trở thành hiện thực"
                },
                "examples": [
                    {
                        "en": "As a child he would wander round the boatyards, building castles in the air about owning a boat one day.",
                        "vi": "Khi còn là một đứa trẻ, ông thường đi lang thang quanh các xưởng đóng thuyền, xây dựng các lâu đài trên không trung và sở hữu một chiếc thuyền vào một ngày nào đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "to improve a difficult or tense situation by talking about worries, doubts, etc.",
                    "vi": "để cải thiện một tình huống khó khăn hoặc căng thẳng bằng cách nói về những lo lắng, nghi ngờ, v.v."
                },
                "examples": [
                    {
                        "en": "This meeting will be an opportunity to clear the air and start the healing process.",
                        "vi": "Cuộc gặp gỡ này sẽ là cơ hội để giải tỏa không khí và bắt đầu quá trình chữa bệnh."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make the air less dirty or less humid (= warm and wet)",
                    "vi": "để làm cho không khí bớt bẩn hơn hoặc bớt ẩm hơn (= ấm và ướt)"
                },
                "examples": [
                    {
                        "en": "Storms were supposed to clear the air.",
                        "vi": "Bão đã được cho là để làm sạch không khí."
                    }
                ]
            },
            {
                "define": {
                    "en": "to disappear suddenly in a mysterious way",
                    "vi": "biến mất đột ngột một cách bí ẩn"
                },
                "examples": [
                    {
                        "en": "She can’t just have vanished into thin air.",
                        "vi": "Cô ấy không thể biến mất trong không khí mỏng manh."
                    },
                    {
                        "en": "At a stroke she could make things vanish into thin air.",
                        "vi": "Chỉ cần một cú đột quỵ, cô ấy có thể khiến mọi thứ tan biến thành không khí loãng."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to refer to an estimate or method of doing something that is not very accurate or scientific and partly based on guessing",
                    "vi": "được sử dụng để chỉ một ước tính hoặc phương pháp thực hiện một điều gì đó không chính xác hoặc khoa học và một phần dựa trên sự phỏng đoán"
                },
                "examples": [
                    {
                        "en": "It isn’t an exact science—it’s a kind of finger in the air thing.",
                        "vi": "Nó không phải là một ngành khoa học chính xác - nó là một loại ngón tay trong không khí."
                    },
                    {
                        "en": "‘It’s all a bit finger in the air,’ admitted a spokesman.",
                        "vi": "Một phát ngôn viên thừa nhận: “Tất cả chỉ là một ngón tay nhỏ trong không khí."
                    }
                ]
            },
            {
                "define": {
                    "en": "to feel very happy",
                    "vi": "cảm thấy rất hạnh phúc"
                },
                "examples": [
                    {
                        "en": "Most couples feel they are walking on air on their wedding day.",
                        "vi": "Hầu hết các cặp đôi cảm thấy họ đang đi trên sóng trong ngày cưới của họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "felt by a number of people to exist or to be happening",
                    "vi": "được một số người cảm thấy là tồn tại hoặc đang xảy ra"
                },
                "examples": [
                    {
                        "en": "There's romance in the air.",
                        "vi": "Có sự lãng mạn trong không khí."
                    }
                ]
            },
            {
                "define": {
                    "en": "broadcasting or not broadcasting on television or radio",
                    "vi": "phát sóng hoặc không phát sóng trên truyền hình hoặc đài phát thanh"
                },
                "examples": [
                    {
                        "en": "We will be back on air tomorrow morning at 7.",
                        "vi": "Chúng tôi sẽ phát sóng trở lại vào sáng mai lúc 7 giờ."
                    },
                    {
                        "en": "The programme was taken off the air over the summer.",
                        "vi": "Chương trình đã được phát sóng trong suốt mùa hè."
                    }
                ]
            },
            {
                "define": {
                    "en": "from nowhere or nothing, as if by magic",
                    "vi": "từ hư không hoặc không có gì, như thể bằng phép thuật"
                },
                "examples": [
                    {
                        "en": "Unfortunately, I can’t just conjure up the money out of thin air!",
                        "vi": "Thật không may, tôi không thể chỉ kiếm tiền một cách dễ dàng!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to say a name, number, etc. without thinking about it, especially in answer to a question",
                    "vi": "để nói tên, số, v.v. mà không cần suy nghĩ về nó, đặc biệt là khi trả lời một câu hỏi"
                },
                "examples": [
                    {
                        "en": "I just plucked a figure out of the air and said : ‘Would £1 000 seem reasonable to you?’",
                        "vi": "Tôi chỉ lấy một con số trong không khí và nói: '1.000 bảng Anh có vẻ hợp lý với bạn không?'"
                    }
                ]
            },
            {
                "define": {
                    "en": "not yet decided",
                    "vi": "chưa quyết định"
                },
                "examples": [
                    {
                        "en": "Our travel plans are still up in the air.",
                        "vi": "Kế hoạch du lịch của chúng tôi vẫn đang được thực hiện."
                    }
                ]
            },
            {
                "define": {
                    "en": "in a way that is not friendly and suggests that you think that you are better than other people",
                    "vi": "theo cách không thân thiện và gợi ý rằng bạn nghĩ rằng bạn giỏi hơn những người khác"
                },
                "examples": [
                    {
                        "en": "She walked in with her nose in the air, ignoring everyone.",
                        "vi": "Cô ấy bước vào với mũi trong không khí, không để ý đến mọi người."
                    }
                ]
            }
        ]
    },
    {
        "id": "16225d2ac4204d319aedf7005a2847b0",
        "word": "clean",
        "pos": "adjective",
        "level": "a1",
        "phonetic": {
            "uk": "/kliːn/",
            "us": "/kliːn/"
        },
        "nearby": [
            {
                "word": "clay pigeon",
                "pos": "noun"
            },
            {
                "word": "clay pigeon shooting",
                "pos": "noun"
            },
            {
                "word": "clean",
                "pos": "adjective"
            },
            {
                "word": "clean",
                "pos": "verb"
            },
            {
                "word": "clean",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "not dirty",
                    "vi": "không bẩn"
                },
                "examples": [
                    {
                        "en": "Are your hands clean?",
                        "vi": "Tay bạn có sạch không?"
                    },
                    {
                        "en": "She wiped all the surfaces clean.",
                        "vi": "Cô lau sạch tất cả các bề mặt."
                    },
                    {
                        "en": "(British English) It is your responsibility to keep the room clean and tidy.",
                        "vi": "(Tiếng Anh Anh) Bạn có trách nhiệm giữ cho căn phòng sạch sẽ và gọn gàng."
                    },
                    {
                        "en": "(North American English) Keep your room neat and clean.",
                        "vi": "(Tiếng Anh Bắc Mỹ) Giữ phòng của bạn gọn gàng và sạch sẽ."
                    },
                    {
                        "en": "I can't find a clean shirt (= one I haven't worn since it was washed).",
                        "vi": "Tôi không thể tìm thấy một chiếc áo sơ mi sạch nào (= chiếc áo tôi chưa mặc kể từ khi nó được giặt)."
                    },
                    {
                        "en": "The hotel was spotlessly (= extremely) clean.",
                        "vi": "Khách sạn sạch sẽ (= cực kỳ) sạch sẽ."
                    },
                    {
                        "en": "The council does a good job keeping the streets clean.",
                        "vi": "Hội đồng làm tốt công việc giữ gìn vệ sinh đường phố."
                    }
                ]
            },
            {
                "define": {
                    "en": "having a clean appearance and living in clean conditions",
                    "vi": "có ngoại hình sạch sẽ và sống trong điều kiện sạch sẽ"
                },
                "examples": [
                    {
                        "en": "Cats are very clean animals.",
                        "vi": "Mèo là loài động vật rất sạch sẽ."
                    }
                ]
            },
            {
                "define": {
                    "en": "free from harmful or unpleasant substances",
                    "vi": "không có chất độc hại hoặc khó chịu"
                },
                "examples": [
                    {
                        "en": "clean water/air",
                        "vi": "nước sạch / không khí"
                    },
                    {
                        "en": "Thousands were left without food or clean drinking water.",
                        "vi": "Hàng ngàn người bị bỏ lại không có thức ăn hoặc nước uống sạch."
                    },
                    {
                        "en": "clean energy",
                        "vi": "năng lượng sạch"
                    },
                    {
                        "en": "We all want a cleaner environment but who is going to pay for it?",
                        "vi": "Tất cả chúng ta đều muốn có một môi trường sạch hơn nhưng ai sẽ trả tiền cho nó?"
                    },
                    {
                        "en": "cleaner cars (= not producing so many harmful substances)",
                        "vi": "ô tô sạch hơn (= không tạo ra nhiều chất độc hại)"
                    },
                    {
                        "en": "Electric buses are a clean, environmentally friendly way to travel.",
                        "vi": "Xe buýt điện là một phương tiện đi lại sạch sẽ, thân thiện với môi trường."
                    }
                ]
            },
            {
                "define": {
                    "en": "with nothing written on it",
                    "vi": "không có gì được viết trên đó"
                },
                "examples": [
                    {
                        "en": "a clean sheet of paper",
                        "vi": "một tờ giấy sạch"
                    }
                ]
            },
            {
                "define": {
                    "en": "not offensive or referring to sex; not doing anything that is considered bad or wrong",
                    "vi": "không xúc phạm hoặc đề cập đến tình dục; không làm bất cứ điều gì bị coi là xấu hoặc sai trái"
                },
                "examples": [
                    {
                        "en": "The entertainment was good clean fun for the whole family.",
                        "vi": "Buổi giải trí rất vui vẻ sạch sẽ cho cả gia đình."
                    },
                    {
                        "en": "Keep the jokes clean please!",
                        "vi": "Hãy giữ những câu chuyện cười trong sạch!"
                    },
                    {
                        "en": "The sport has a very clean image.",
                        "vi": "Môn thể thao này có một hình ảnh rất sạch sẽ."
                    }
                ]
            },
            {
                "define": {
                    "en": "not showing or having any record of doing something that is against the law",
                    "vi": "không hiển thị hoặc có bất kỳ hồ sơ nào về việc làm điều gì đó trái pháp luật"
                },
                "examples": [
                    {
                        "en": "a clean driving licence/driver’s license",
                        "vi": "giấy phép lái xe / giấy phép lái xe sạch"
                    },
                    {
                        "en": "a clean police record",
                        "vi": "một lý lịch cảnh sát sạch sẽ"
                    }
                ]
            },
            {
                "define": {
                    "en": "not owning or carrying anything illegal such as drugs or weapons",
                    "vi": "không sở hữu hoặc mang theo bất cứ thứ gì bất hợp pháp như ma túy hoặc vũ khí"
                },
                "examples": [
                    {
                        "en": "The police searched her but she was clean.",
                        "vi": "Cảnh sát đã khám xét cô nhưng cô vẫn trong sạch."
                    }
                ]
            },
            {
                "define": {
                    "en": "not having taken drugs or alcohol",
                    "vi": "không uống ma túy hoặc rượu"
                },
                "examples": [
                    {
                        "en": "He's been clean for three weeks.",
                        "vi": "Anh ấy đã sạch sẽ trong ba tuần."
                    }
                ]
            },
            {
                "define": {
                    "en": "played or done in a fair way and within the rules",
                    "vi": "đã chơi hoặc thực hiện một cách công bằng và tuân theo các quy tắc"
                },
                "examples": [
                    {
                        "en": "It was a tough but clean game.",
                        "vi": "Đó là một trò chơi khó khăn nhưng sạch sẽ."
                    }
                ]
            },
            {
                "define": {
                    "en": "having a smooth edge, surface or shape; simple and regular",
                    "vi": "có cạnh, bề mặt hoặc hình dạng nhẵn; đơn giản và thường xuyên"
                },
                "examples": [
                    {
                        "en": "A sharp knife makes a clean cut.",
                        "vi": "Một con dao sắc bén tạo nên một vết cắt sạch."
                    },
                    {
                        "en": "a modern design with clean lines and a bright appearance",
                        "vi": "một thiết kế hiện đại với các đường nét sạch sẽ và vẻ ngoài tươi sáng"
                    }
                ]
            },
            {
                "define": {
                    "en": "done with skill and in an accurate way",
                    "vi": "được thực hiện với kỹ năng và một cách chính xác"
                },
                "examples": [
                    {
                        "en": "The plane made a clean take-off.",
                        "vi": "Máy bay đã cất cánh sạch sẽ."
                    }
                ]
            },
            {
                "define": {
                    "en": "with no changes or mistakes in it",
                    "vi": "không có thay đổi hoặc sai lầm trong đó"
                },
                "examples": [
                    {
                        "en": "I do my utmost to produce clean copy, but occasionally a mistake slips in.",
                        "vi": "Tôi cố gắng hết sức để tạo ra bản sao rõ ràng, nhưng đôi khi có lỗi xảy ra."
                    },
                    {
                        "en": "It backs up data frequently, keeping a clean copy of your work.",
                        "vi": "Nó sao lưu dữ liệu thường xuyên, giữ một bản sao sạch sẽ của công việc của bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "tasting, smelling or looking pleasant and fresh",
                    "vi": "nếm, ngửi hoặc trông dễ chịu và tươi mát"
                },
                "examples": [
                    {
                        "en": "The wine has a clean taste and a lovely golden colour.",
                        "vi": "Rượu có một hương vị sạch sẽ và một màu vàng đáng yêu."
                    }
                ]
            },
            {
                "define": {
                    "en": "very clean",
                    "vi": "rất sạch sẽ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a report that says somebody is healthy or that something is in good condition",
                    "vi": "một báo cáo nói rằng ai đó khỏe mạnh hoặc một cái gì đó đang ở trong tình trạng tốt"
                },
                "examples": [
                    {
                        "en": "Doctors gave him a clean bill of health after a series of tests and examinations.",
                        "vi": "Các bác sĩ đã cho anh ta một sức khỏe sạch sẽ sau một loạt các xét nghiệm và kiểm tra."
                    },
                    {
                        "en": "The building was given a clean bill of health by the surveyor.",
                        "vi": "Tòa nhà đã được một nhà khảo sát đưa ra một hóa đơn sạch về sức khỏe."
                    }
                ]
            },
            {
                "define": {
                    "en": "a complete end to any connection with a person, an organization, a way of life, etc.",
                    "vi": "một kết thúc hoàn toàn cho bất kỳ mối liên hệ nào với một người, một tổ chức, một lối sống, v.v."
                },
                "examples": [
                    {
                        "en": "She wanted to make a clean break with the past.",
                        "vi": "Cô muốn đoạn tuyệt với quá khứ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a break in a bone in one place",
                    "vi": "gãy xương ở một chỗ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a record of your work or behaviour that does not show any mistakes or bad things that you have done",
                    "vi": "một hồ sơ về công việc hoặc hành vi của bạn không cho thấy bất kỳ sai lầm hoặc điều xấu mà bạn đã làm"
                },
                "examples": [
                    {
                        "en": "No government operates with a completely clean sheet.",
                        "vi": "Không có chính phủ nào hoạt động với một bảng hoàn toàn trong sạch."
                    },
                    {
                        "en": "They kept a clean sheet in the match (= no goals were scored against them).",
                        "vi": "Họ đã giữ sạch lưới trong trận đấu (= không có bàn thắng nào được ghi vào lưới của họ)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to remove all the people or things from an organization that are thought to be unnecessary or need changing",
                    "vi": "để xóa tất cả những người hoặc những thứ khỏi một tổ chức được cho là không cần thiết hoặc cần thay đổi"
                },
                "examples": [
                    {
                        "en": "The new manager made a clean sweep of the department.",
                        "vi": "Người quản lý mới đã quét sạch bộ phận."
                    }
                ]
            },
            {
                "define": {
                    "en": "to win all the prizes or parts of a game or competition; to win an election completely",
                    "vi": "để giành được tất cả các giải thưởng hoặc các phần của trò chơi hoặc cuộc thi; để giành chiến thắng trong một cuộc bầu cử hoàn toàn"
                },
                "examples": [
                    {
                        "en": "China made a clean sweep of the medals in the gymnastics events.",
                        "vi": "Trung Quốc đã quét sạch các huy chương trong các sự kiện thể dục dụng cụ."
                    },
                    {
                        "en": "The opinion poll suggests a clean sweep for the Democrats.",
                        "vi": "Cuộc thăm dò ý kiến cho thấy một cuộc truy quét sạch sẽ đối với Đảng Dân chủ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to admit and explain something that you have kept as a secret",
                    "vi": "thừa nhận và giải thích điều gì đó mà bạn đã giữ bí mật"
                },
                "examples": [
                    {
                        "en": "Isn't it time the government came clean about their plans for education?",
                        "vi": "Không phải đã đến lúc chính phủ làm rõ về kế hoạch giáo dục của họ sao?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to avoid doing anything wrong or illegal",
                    "vi": "để tránh làm bất cứ điều gì sai trái hoặc bất hợp pháp"
                },
                "examples": [
                    {
                        "en": "Since leaving prison, he's managed to keep his nose clean.",
                        "vi": "Kể từ khi ra tù, anh ấy đã cố gắng giữ cho mũi của mình sạch sẽ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to tell the truth about something so that you no longer feel guilty",
                    "vi": "nói sự thật về điều gì đó để bạn không còn cảm thấy tội lỗi"
                },
                "examples": [
                    {
                        "en": "He made a clean breast of everything and admitted taking the money.",
                        "vi": "Anh ta làm sạch mọi thứ và thừa nhận đã lấy tiền."
                    }
                ]
            },
            {
                "define": {
                    "en": "to agree to forget about past mistakes or arguments and start again with a relationship",
                    "vi": "đồng ý quên đi những sai lầm hoặc tranh cãi trong quá khứ và bắt đầu lại với một mối quan hệ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "9af7a8a0bb7445e59b1f46ee4a7a2355",
        "word": "air quality",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈeə kwɒləti/",
            "us": "/ˈer kwɑːləti/"
        },
        "nearby": [
            {
                "word": "air power",
                "pos": "noun"
            },
            {
                "word": "air pump",
                "pos": "noun"
            },
            {
                "word": "air quality",
                "pos": "noun"
            },
            {
                "word": "air quotes",
                "pos": "noun"
            },
            {
                "word": "air rage",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the degree to which the air is clean and free from pollution",
                    "vi": "mức độ không khí trong sạch và không bị ô nhiễm"
                },
                "examples": [
                    {
                        "en": "Planting more trees will improve air quality.",
                        "vi": "Trồng nhiều cây xanh sẽ cải thiện chất lượng không khí."
                    }
                ]
            }
        ]
    },
    {
        "id": "dfce64fcce7543449a7fe810e30794c9",
        "word": "garbage",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈɡɑːbɪdʒ/",
            "us": "/ˈɡɑːrbɪdʒ/"
        },
        "nearby": [
            {
                "word": "garb",
                "pos": "noun"
            },
            {
                "word": "garba",
                "pos": "noun"
            },
            {
                "word": "garbage",
                "pos": "noun"
            },
            {
                "word": "garbage can",
                "pos": "noun"
            },
            {
                "word": "garbage disposal",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "waste food, paper, etc. that you throw away",
                    "vi": "lãng phí thức ăn, giấy, v.v. mà bạn vứt đi"
                },
                "examples": [
                    {
                        "en": "garbage collection",
                        "vi": "thu gom rác thải"
                    },
                    {
                        "en": "Don't forget to take out the garbage.",
                        "vi": "Đừng quên đổ rác."
                    }
                ]
            },
            {
                "define": {
                    "en": "a place or container where waste food, paper, etc. can be placed",
                    "vi": "một nơi hoặc hộp đựng thức ăn thừa, giấy, v.v. có thể được đặt"
                },
                "examples": [
                    {
                        "en": "Throw it in the garbage.",
                        "vi": "Vứt nó vào thùng rác."
                    }
                ]
            },
            {
                "define": {
                    "en": "something stupid or not true",
                    "vi": "điều gì đó ngu ngốc hoặc không đúng sự thật"
                },
                "examples": [
                    {
                        "en": "‘You mean you believe all that garbage?’ he said.",
                        "vi": "Ý bạn là bạn tin tất cả những thứ rác rưởi đó?' anh ấy nói."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to express the idea that if wrong or poor quality data, material or effort is put into something, wrong or poor quality results will come out of it",
                    "vi": "được sử dụng để thể hiện ý tưởng rằng nếu dữ liệu, vật liệu hoặc công sức sai hoặc kém chất lượng được đưa vào một thứ gì đó, thì kết quả sai hoặc kém chất lượng sẽ được tạo ra từ nó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "20608c9c9e6c4a2cac83c7eb95f9c724",
        "word": "plastic",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈplæstɪk/",
            "us": "/ˈplæstɪk/"
        },
        "nearby": [
            {
                "word": "plaster saint",
                "pos": "noun"
            },
            {
                "word": "plasterwork",
                "pos": "noun"
            },
            {
                "word": "plastic",
                "pos": "noun"
            },
            {
                "word": "plastic",
                "pos": "adjective"
            },
            {
                "word": "plastic arts",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a light strong material that is produced by chemical processes and can be formed into shapes when heated. There are many different types of plastic, used to make different objects and fabrics.",
                    "vi": "Một vật liệu bền nhẹ được tạo ra bởi các quá trình hóa học và có thể được tạo thành hình dạng khi nung nóng. Có nhiều loại nhựa khác nhau, được sử dụng để làm các đồ vật và các loại vải khác nhau."
                },
                "examples": [
                    {
                        "en": "The pipes should be made of plastic.",
                        "vi": "Các đường ống phải được làm bằng nhựa."
                    },
                    {
                        "en": "a sheet of clear plastic",
                        "vi": "một tấm nhựa trong suốt"
                    },
                    {
                        "en": "the plastic industry",
                        "vi": "ngành công nghiệp nhựa"
                    },
                    {
                        "en": "recycled plastic",
                        "vi": "nhựa tái chế"
                    },
                    {
                        "en": "chairs made from plastic",
                        "vi": "ghế làm từ nhựa"
                    },
                    {
                        "en": "dashboards moulded in plastic",
                        "vi": "bảng điều khiển đúc bằng nhựa"
                    }
                ]
            },
            {
                "define": {
                    "en": "the science of making plastics",
                    "vi": "khoa học sản xuất chất dẻo"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a way of talking about credit cards",
                    "vi": "một cách nói về thẻ tín dụng"
                },
                "examples": [
                    {
                        "en": "Do they take plastic?",
                        "vi": "Họ có lấy nhựa không?"
                    }
                ]
            }
        ]
    },
    {
        "id": "2effca3797f54e0daeae11a54c4889f9",
        "word": "pollution",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/pəˈluːʃn/",
            "us": "/pəˈluːʃn/"
        },
        "nearby": [
            {
                "word": "pollute",
                "pos": "verb"
            },
            {
                "word": "polluter",
                "pos": "noun"
            },
            {
                "word": "pollution",
                "pos": "noun"
            },
            {
                "word": "Polly",
                "pos": ""
            },
            {
                "word": "Pollyanna",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the process of making air, water, soil, etc. dirty; the state of being dirty",
                    "vi": "quá trình làm bẩn không khí, nước, đất,…; tình trạng bẩn thỉu"
                },
                "examples": [
                    {
                        "en": "air/water pollution",
                        "vi": "ô nhiễm không khí / nước"
                    },
                    {
                        "en": "to reduce pollution levels",
                        "vi": "để giảm mức độ ô nhiễm"
                    },
                    {
                        "en": "new pollution control technologies",
                        "vi": "công nghệ kiểm soát ô nhiễm mới"
                    }
                ]
            },
            {
                "define": {
                    "en": "substances that make air, water, soil, etc. dirty",
                    "vi": "các chất làm bẩn không khí, nước, đất, v.v."
                },
                "examples": [
                    {
                        "en": "beaches covered with pollution",
                        "vi": "những bãi biển bị ô nhiễm"
                    },
                    {
                        "en": "The new buses emit no more pollution than the average car.",
                        "vi": "Những chiếc xe buýt mới không thải ra nhiều ô nhiễm hơn những chiếc xe thông thường."
                    }
                ]
            },
            {
                "define": {
                    "en": "harmful or annoying levels of noise, or of artificial light at night",
                    "vi": "mức độ tiếng ồn có hại hoặc khó chịu, hoặc của ánh sáng nhân tạo vào ban đêm"
                },
                "examples": [
                    {
                        "en": "Heavy traffic flow is a major source of noise pollution in urban areas.",
                        "vi": "Lưu lượng giao thông đông đúc là một nguồn ô nhiễm tiếng ồn chính ở các khu vực đô thị."
                    },
                    {
                        "en": "The government has announced plans to tackle light pollution.",
                        "vi": "Chính phủ đã công bố kế hoạch giải quyết ô nhiễm ánh sáng."
                    }
                ]
            }
        ]
    },
    {
        "id": "12fb83ff4d5447fa9b5d8c2f96626070",
        "word": "recycle",
        "pos": "verb",
        "level": "a2",
        "phonetic": {
            "uk": "/ˌriːˈsaɪkl/",
            "us": "/ˌriːˈsaɪkl/"
        },
        "nearby": [
            {
                "word": "recuse",
                "pos": "verb"
            },
            {
                "word": "recyclable",
                "pos": "adjective"
            },
            {
                "word": "recycle",
                "pos": "verb"
            },
            {
                "word": "recycling",
                "pos": "noun"
            },
            {
                "word": "red",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to treat things that have already been used so that they can be used again",
                    "vi": "để xử lý những thứ đã được sử dụng để chúng có thể được sử dụng lại"
                },
                "examples": [
                    {
                        "en": "to recycle waste/rubbish",
                        "vi": "tái chế chất thải / rác"
                    },
                    {
                        "en": "Denmark recycles nearly 85% of its paper.",
                        "vi": "Đan Mạch tái chế gần 85% lượng giấy của mình."
                    },
                    {
                        "en": "recycled materials",
                        "vi": "vật liệu tái chế"
                    },
                    {
                        "en": "recycled plastic/glass/paper",
                        "vi": "nhựa tái chế / thủy tinh / giấy"
                    },
                    {
                        "en": "Salt water is recycled using a special filter.",
                        "vi": "Nước muối được tái chế bằng cách sử dụng một bộ lọc đặc biệt."
                    },
                    {
                        "en": "recycle something into something The bottles were being recycled into a lower-quality product.",
                        "vi": "tái chế một cái gì đó thành một cái gì đó Những cái chai đã được tái chế thành một sản phẩm chất lượng thấp hơn."
                    },
                    {
                        "en": "recycle something from something He makes his own fuel from used grease recycled from local restaurants.",
                        "vi": "tái chế thứ gì đó từ thứ gì đó Anh ấy tự làm nhiên liệu từ dầu mỡ đã qua sử dụng được tái chế từ các nhà hàng địa phương."
                    }
                ]
            },
            {
                "define": {
                    "en": "to use the same ideas, methods, jokes, etc. again",
                    "vi": "sử dụng lại các ý tưởng, phương pháp, câu chuyện cười, v.v."
                },
                "examples": [
                    {
                        "en": "He recycled all his old jokes.",
                        "vi": "Anh ấy đã tái chế lại tất cả những câu chuyện cười cũ của mình."
                    },
                    {
                        "en": "They endlessly recycle the same worn-out arguments.",
                        "vi": "Họ không ngừng tái chế các lý lẽ đã cũ."
                    }
                ]
            }
        ]
    },
    {
        "id": "11381bdb372e4feca14f2add22249f9d",
        "word": "recycling",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˌriːˈsaɪklɪŋ/",
            "us": "/ˌriːˈsaɪklɪŋ/"
        },
        "nearby": [
            {
                "word": "recyclable",
                "pos": "adjective"
            },
            {
                "word": "recycle",
                "pos": "verb"
            },
            {
                "word": "recycling",
                "pos": "noun"
            },
            {
                "word": "red",
                "pos": "adjective"
            },
            {
                "word": "red",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the process of treating things that have already been used so that they can be used again",
                    "vi": "quy trình xử lý những thứ đã được sử dụng để chúng có thể được sử dụng lại"
                },
                "examples": [
                    {
                        "en": "the recycling of glass",
                        "vi": "tái chế thủy tinh"
                    },
                    {
                        "en": "a recycling plant",
                        "vi": "một nhà máy tái chế"
                    }
                ]
            }
        ]
    },
    {
        "id": "a8d7a3c0cf894c4496d160498c0fadfe",
        "word": "rubbish",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈrʌbɪʃ/",
            "us": "/ˈrʌbɪʃ/"
        },
        "nearby": [
            {
                "word": "rubbing",
                "pos": "noun"
            },
            {
                "word": "rubbing alcohol",
                "pos": "noun"
            },
            {
                "word": "rubbish",
                "pos": "noun"
            },
            {
                "word": "rubbish",
                "pos": "verb"
            },
            {
                "word": "rubbish tip",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "things that you throw away because you no longer want or need them",
                    "vi": "những thứ bạn vứt bỏ vì bạn không còn muốn hoặc không cần chúng nữa"
                },
                "examples": [
                    {
                        "en": "a rubbish bag/bin",
                        "vi": "một túi / thùng rác"
                    },
                    {
                        "en": "a rubbish dump/heap/tip",
                        "vi": "một bãi rác / đống / tiền boa"
                    },
                    {
                        "en": "The streets were littered with rubbish.",
                        "vi": "Đường phố ngập rác."
                    },
                    {
                        "en": "garden/household rubbish",
                        "vi": "rác vườn / hộ gia đình"
                    },
                    {
                        "en": "The rubbish is collected on Tuesdays.",
                        "vi": "Rác được thu gom vào các ngày thứ Ba."
                    },
                    {
                        "en": "Weeks have gone by without a rubbish collection, and the stench is terrible.",
                        "vi": "Nhiều tuần trôi qua mà không có người thu gom rác, và mùi hôi thối rất kinh khủng."
                    },
                    {
                        "en": "He is supporting a campaign to encourage people to recycle their rubbish.",
                        "vi": "Anh ấy đang ủng hộ một chiến dịch khuyến khích mọi người tái chế rác của họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "something that you think is of poor quality",
                    "vi": "một cái gì đó mà bạn nghĩ là chất lượng kém"
                },
                "examples": [
                    {
                        "en": "I thought the play was rubbish!",
                        "vi": "Tôi nghĩ vở kịch là rác rưởi!"
                    },
                    {
                        "en": "The film was absolute/complete rubbish.",
                        "vi": "Bộ phim là một thứ rác rưởi tuyệt đối / hoàn toàn."
                    },
                    {
                        "en": "Do we have to listen to this rubbish music?",
                        "vi": "Chúng ta có phải nghe thứ nhạc rác rưởi này không?"
                    },
                    {
                        "en": "They said I was a rubbish boss.",
                        "vi": "Họ nói tôi là một ông chủ rác rưởi."
                    }
                ]
            },
            {
                "define": {
                    "en": "comments, ideas, etc. that you think are stupid or wrong",
                    "vi": "nhận xét, ý tưởng, v.v. mà bạn cho là ngu ngốc hoặc sai"
                },
                "examples": [
                    {
                        "en": "Rubbish! You're not fat.",
                        "vi": "Rác! Bạn không béo."
                    },
                    {
                        "en": "You're talking a load of rubbish.",
                        "vi": "Bạn đang nói một đống rác rưởi."
                    },
                    {
                        "en": "It's not rubbish—it's true!",
                        "vi": "Đó không phải là rác rưởi - đó là sự thật!"
                    },
                    {
                        "en": "He described the claims as utter rubbish and nonsense.",
                        "vi": "Ông mô tả những tuyên bố này là hoàn toàn rác rưởi và vô nghĩa."
                    }
                ]
            }
        ]
    },
    {
        "id": "edf6f8f2d1aa4315ba306f92f2b9c125",
        "word": "smoke",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/sməʊk/",
            "us": "/sməʊk/"
        },
        "nearby": [
            {
                "word": "smog",
                "pos": "noun"
            },
            {
                "word": "smoggy",
                "pos": "adjective"
            },
            {
                "word": "smoke",
                "pos": "noun"
            },
            {
                "word": "smoke",
                "pos": "verb"
            },
            {
                "word": "smoke alarm",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the grey, white or black gas that is produced by something burning",
                    "vi": "khí màu xám, trắng hoặc đen được tạo ra bởi một thứ gì đó đang cháy"
                },
                "examples": [
                    {
                        "en": "cigarette/tobacco smoke",
                        "vi": "khói thuốc lá / thuốc lá"
                    },
                    {
                        "en": "Plumes of black smoke could be seen rising from the area.",
                        "vi": "Có thể nhìn thấy những đám khói đen bốc lên từ khu vực này."
                    },
                    {
                        "en": "The explosion sent a huge cloud of smoke into the sky.",
                        "vi": "Vụ nổ tung một đám khói lớn lên bầu trời."
                    },
                    {
                        "en": "Clouds of thick black smoke billowed from the car's exhaust.",
                        "vi": "Những đám khói đen đặc bốc lên từ ống xả của ô tô."
                    },
                    {
                        "en": "smoke from something His eyes were smarting from the smoke from the fire.",
                        "vi": "khói từ một cái gì đó Đôi mắt của anh ấy đang mờ vì khói từ lửa."
                    },
                    {
                        "en": "The smoke from their cigarettes curled upwards.",
                        "vi": "Khói từ điếu thuốc của họ cuộn lên."
                    },
                    {
                        "en": "The majority of people who die in fires die of smoke inhalation.",
                        "vi": "Đa số những người chết trong đám cháy chết vì ngạt khói."
                    },
                    {
                        "en": "Check your smoke detectors for dead batteries.",
                        "vi": "Kiểm tra máy dò khói xem có pin chết không."
                    },
                    {
                        "en": "The witch disappeared in a puff of smoke.",
                        "vi": "Ma nữ biến mất trong một làn khói."
                    },
                    {
                        "en": "I can definitely smell smoke.",
                        "vi": "Tôi chắc chắn có thể ngửi thấy mùi khói."
                    }
                ]
            },
            {
                "define": {
                    "en": "an act of smoking a cigarette",
                    "vi": "một hành động hút một điếu thuốc"
                },
                "examples": [
                    {
                        "en": "Are you coming outside for a smoke?",
                        "vi": "Bạn đang ra ngoài để hút thuốc?"
                    },
                    {
                        "en": "He's in the back garden having a smoke.",
                        "vi": "Anh ấy đang ở vườn sau có khói."
                    }
                ]
            },
            {
                "define": {
                    "en": "London, or another large city",
                    "vi": "London, hoặc một thành phố lớn khác"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to try to trick somebody or lie to somebody, particularly by saying something is better than it really is",
                    "vi": "cố gắng lừa ai đó hoặc nói dối ai đó, đặc biệt bằng cách nói điều gì đó tốt hơn thực tế"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be completely burnt",
                    "vi": "bị cháy hoàn toàn"
                },
                "examples": [
                    {
                        "en": "The whole house went up in smoke.",
                        "vi": "Cả ngôi nhà bốc khói nghi ngút."
                    }
                ]
            },
            {
                "define": {
                    "en": "if your plans, hopes, etc. go up in smoke, they fail completely",
                    "vi": "nếu kế hoạch, hy vọng, v.v. của bạn tan thành mây khói, chúng hoàn toàn thất bại"
                },
                "examples": [
                    {
                        "en": "Hopes of an early end to the dispute have gone up in smoke.",
                        "vi": "Những hy vọng về một cuộc tranh chấp sớm kết thúc đã tan thành mây khói."
                    }
                ]
            },
            {
                "define": {
                    "en": "if something bad is being said about somebody/something, it usually has some truth in it",
                    "vi": "nếu điều gì đó tồi tệ đang được nói về ai đó / điều gì đó, nó thường có một số sự thật trong đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the fact of hiding the truth with information that is not important or relevant",
                    "vi": "việc che giấu sự thật bằng những thông tin không quan trọng hoặc không liên quan"
                },
                "examples": [
                    {
                        "en": "There's a lot of smoke and mirrors in the financing of this film.",
                        "vi": "Có rất nhiều khói và tấm gương trong kinh phí của bộ phim này."
                    }
                ]
            },
            {
                "define": {
                    "en": "a decision that people describe as being made in a smoke-filled room is made by a small group of people at a private meeting, rather than in an open and democratic way",
                    "vi": "một quyết định mà mọi người mô tả là được đưa ra trong một căn phòng đầy khói thuốc được đưa ra bởi một nhóm nhỏ người tại một cuộc họp riêng, thay vì theo cách cởi mở và dân chủ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "5e5055a72d154dac8ba642eadbdf699c",
        "word": "trash",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/træʃ/",
            "us": "/træʃ/"
        },
        "nearby": [
            {
                "word": "Trappist",
                "pos": "noun"
            },
            {
                "word": "Trappist",
                "pos": "adjective"
            },
            {
                "word": "trash",
                "pos": "noun"
            },
            {
                "word": "trash",
                "pos": "verb"
            },
            {
                "word": "trash can",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "things that you throw away because you no longer want or need them",
                    "vi": "những thứ bạn vứt bỏ vì bạn không còn muốn hoặc không cần chúng nữa"
                },
                "examples": [
                    {
                        "en": "Don't forget to take out the trash.",
                        "vi": "Đừng quên đổ rác vào thùng rác."
                    },
                    {
                        "en": "The subway entrance was blocked with trash.",
                        "vi": "Lối vào tàu điện ngầm bị chặn bởi thùng rác."
                    },
                    {
                        "en": "What are these letters doing in the trash?",
                        "vi": "Những lá thư này đang làm gì trong thùng rác?"
                    },
                    {
                        "en": "(figurative) His theories were relegated to the trash heap of history.",
                        "vi": "(nghĩa bóng) Các lý thuyết của ông đã bị xếp vào một đống rác rưởi của lịch sử."
                    }
                ]
            },
            {
                "define": {
                    "en": "objects, writing, ideas, etc. that you think are of poor quality",
                    "vi": "đồ vật, chữ viết, ý tưởng, v.v. mà bạn cho là kém chất lượng"
                },
                "examples": [
                    {
                        "en": "What's this trash you're watching?",
                        "vi": "Bạn đang xem cái rác gì thế này?"
                    },
                    {
                        "en": "(especially British English) He's talking trash (= nonsense).",
                        "vi": "(đặc biệt là tiếng Anh Anh) Anh ấy đang nói chuyện rác rưởi (= vô nghĩa)."
                    }
                ]
            },
            {
                "define": {
                    "en": "an offensive word used to describe people that you do not respect",
                    "vi": "một từ xúc phạm được sử dụng để mô tả những người mà bạn không tôn trọng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "9ef53ac6912f4fcdb4d0d745ee55ea7d",
        "word": "clean up",
        "pos": "phrasal verb",
        "level": "b1",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "cleanser",
                "pos": "noun"
            },
            {
                "word": "clean-shaven",
                "pos": "adjective"
            },
            {
                "word": "clean up",
                "pos": "phrasal verb"
            },
            {
                "word": "clean-up",
                "pos": "noun"
            },
            {
                "word": "clear",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to win or make a lot of money",
                    "vi": "để giành chiến thắng hoặc kiếm được nhiều tiền"
                },
                "examples": [
                    {
                        "en": "This film should clean up at the box offices.",
                        "vi": "Bộ phim này sẽ thu hút sự chú ý tại các phòng vé."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make yourself clean, usually by washing",
                    "vi": "để làm cho mình sạch sẽ, thường bằng cách rửa"
                },
                "examples": [
                    {
                        "en": "I need to change and clean up.",
                        "vi": "Tôi cần phải thay đổi và dọn dẹp."
                    },
                    {
                        "en": "Go and clean yourself up.",
                        "vi": "Đi và dọn dẹp bản thân."
                    },
                    {
                        "en": "You'd better get cleaned up.",
                        "vi": "Tốt hơn hết bạn nên dọn dẹp."
                    }
                ]
            },
            {
                "define": {
                    "en": "to remove dirt, etc. from somewhere",
                    "vi": "để loại bỏ bụi bẩn, v.v. từ đâu đó"
                },
                "examples": [
                    {
                        "en": "He always expected other people to clean up after him (= when he had made the place dirty or untidy).",
                        "vi": "Anh ấy luôn mong đợi người khác dọn dẹp sau anh ấy (= khi anh ấy đã làm cho nơi đó trở nên bẩn thỉu hoặc bừa bộn)."
                    },
                    {
                        "en": "Who's going to clean up this mess?",
                        "vi": "Ai sẽ dọn dẹp đống lộn xộn này?"
                    },
                    {
                        "en": "to clean up beaches after an oil spillage",
                        "vi": "dọn dẹp các bãi biển sau sự cố tràn dầu"
                    },
                    {
                        "en": "a commitment to clean up the environment",
                        "vi": "cam kết làm sạch môi trường"
                    },
                    {
                        "en": "It took me the rest of the day to clean (the place) up.",
                        "vi": "Tôi đã mất phần còn lại của ngày để dọn dẹp (địa điểm)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to remove crime and immoral behaviour from a place or an activity",
                    "vi": "để loại bỏ tội phạm và hành vi vô đạo đức khỏi một địa điểm hoặc một hoạt động"
                },
                "examples": [
                    {
                        "en": "The new mayor is determined to clean up the city.",
                        "vi": "Thị trưởng mới quyết tâm làm sạch thành phố."
                    },
                    {
                        "en": "Soccer needs to clean up its image.",
                        "vi": "Bóng đá cần phải làm sạch hình ảnh của mình."
                    }
                ]
            }
        ]
    },
    {
        "id": "5278e69739b04772b3abf747d16ff203",
        "word": "poisonous",
        "pos": "adjective",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈpɔɪzənəs/",
            "us": "/ˈpɔɪzənəs/"
        },
        "nearby": [
            {
                "word": "poison ivy",
                "pos": "noun"
            },
            {
                "word": "poison oak",
                "pos": "noun"
            },
            {
                "word": "poisonous",
                "pos": "adjective"
            },
            {
                "word": "poison pen letter",
                "pos": "noun"
            },
            {
                "word": "poison pill",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "causing death or illness if swallowed or taken into the body",
                    "vi": "gây tử vong hoặc bệnh tật nếu nuốt phải hoặc đưa vào cơ thể"
                },
                "examples": [
                    {
                        "en": "poisonous chemicals/fumes/plants",
                        "vi": "hóa chất / khói / thực vật độc hại"
                    },
                    {
                        "en": "a poisonous substance",
                        "vi": "một chất độc"
                    },
                    {
                        "en": "This gas is highly poisonous.",
                        "vi": "Khí này rất độc."
                    },
                    {
                        "en": "poisonous to somebody/something The leaves of certain trees are poisonous to cattle.",
                        "vi": "độc với ai đó / cái gì đó Lá của một số cây có độc đối với gia súc."
                    }
                ]
            },
            {
                "define": {
                    "en": "producing a poison that can cause death or illness if the animal or insect bites you",
                    "vi": "tạo ra chất độc có thể gây chết người hoặc bệnh tật nếu động vật hoặc côn trùng cắn bạn"
                },
                "examples": [
                    {
                        "en": "poisonous snakes",
                        "vi": "rắn độc"
                    },
                    {
                        "en": "a tiny spider with a poisonous bite",
                        "vi": "một con nhện nhỏ có vết cắn độc"
                    }
                ]
            },
            {
                "define": {
                    "en": "extremely unpleasant or unfriendly",
                    "vi": "cực kỳ khó chịu hoặc không thân thiện"
                },
                "examples": [
                    {
                        "en": "a poisonous person",
                        "vi": "một người độc hại"
                    },
                    {
                        "en": "the poisonous atmosphere in the office",
                        "vi": "bầu không khí độc hại trong văn phòng"
                    }
                ]
            }
        ]
    },
    {
        "id": "f6ad7d9d6cde477582ba62739ddb0f5c",
        "word": "pollute",
        "pos": "verb",
        "level": "b1",
        "phonetic": {
            "uk": "/pəˈluːt/",
            "us": "/pəˈluːt/"
        },
        "nearby": [
            {
                "word": "poll tax",
                "pos": "noun"
            },
            {
                "word": "pollutant",
                "pos": "noun"
            },
            {
                "word": "pollute",
                "pos": "verb"
            },
            {
                "word": "polluter",
                "pos": "noun"
            },
            {
                "word": "pollution",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to add dirty or harmful substances to land, air, water, etc. so that it is no longer pleasant or safe to use",
                    "vi": "thêm các chất bẩn hoặc độc hại vào đất, không khí, nước, v.v. để không còn dễ chịu hoặc an toàn khi sử dụng"
                },
                "examples": [
                    {
                        "en": "pollute something the exhaust fumes that are polluting our cities",
                        "vi": "gây ô nhiễm thứ gì đó khói thải đang làm ô nhiễm các thành phố của chúng ta"
                    },
                    {
                        "en": "pollute something by/with something The river has been polluted with toxic waste from local factories.",
                        "vi": "gây ô nhiễm cái gì đó bằng / bằng cái gì đó Con sông đã bị ô nhiễm với chất thải độc hại từ các nhà máy địa phương."
                    },
                    {
                        "en": "(figurative) a society polluted by racism",
                        "vi": "(nghĩa bóng) một xã hội bị ô nhiễm bởi nạn phân biệt chủng tộc"
                    }
                ]
            }
        ]
    },
    {
        "id": "4c68cf49642a4c5d953eaeddb562c6a9",
        "word": "waste",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/weɪst/",
            "us": "/weɪst/"
        },
        "nearby": [
            {
                "word": "wassup",
                "pos": "exclamation"
            },
            {
                "word": "wastage",
                "pos": "noun"
            },
            {
                "word": "waste",
                "pos": "noun"
            },
            {
                "word": "waste",
                "pos": "verb"
            },
            {
                "word": "waste",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act of using something in a careless or unnecessary way, causing it to be lost or destroyed",
                    "vi": "hành động sử dụng một cái gì đó một cách bất cẩn hoặc không cần thiết, làm cho nó bị mất hoặc bị phá hủy"
                },
                "examples": [
                    {
                        "en": "I hate unnecessary waste.",
                        "vi": "Tôi ghét sự lãng phí không cần thiết."
                    },
                    {
                        "en": "It seems such a waste to throw good food away.",
                        "vi": "Có vẻ như thật lãng phí khi vứt bỏ thức ăn ngon."
                    },
                    {
                        "en": "I hate to see good food go to waste (= be thrown away).",
                        "vi": "Tôi ghét thấy thức ăn ngon bị bỏ đi (= bị vứt bỏ)."
                    },
                    {
                        "en": "waste of something The report is critical of the department's waste of resources.",
                        "vi": "sự lãng phí của một cái gì đó Báo cáo là chỉ trích về sự lãng phí tài nguyên của bộ phận."
                    },
                    {
                        "en": "What a waste of paper!",
                        "vi": "Thật là lãng phí giấy!"
                    }
                ]
            },
            {
                "define": {
                    "en": "a situation in which it is not worth spending time, money, etc. on something",
                    "vi": "một tình huống không đáng để dành thời gian, tiền bạc, v.v. cho việc gì đó"
                },
                "examples": [
                    {
                        "en": "These meetings are a complete waste of time.",
                        "vi": "Những cuộc họp này hoàn toàn lãng phí thời gian."
                    },
                    {
                        "en": "They believe the statue is a waste of taxpayers' money.",
                        "vi": "Họ tin rằng bức tượng là một sự lãng phí tiền thuế của người dân."
                    },
                    {
                        "en": "The whole exercise is just a waste of effort.",
                        "vi": "Toàn bộ bài tập chỉ là một sự lãng phí công sức."
                    }
                ]
            },
            {
                "define": {
                    "en": "materials that are no longer needed and are thrown away",
                    "vi": "vật liệu không còn cần thiết và bị vứt bỏ"
                },
                "examples": [
                    {
                        "en": "household/garden/industrial waste",
                        "vi": "rác thải gia đình / vườn / công nghiệp"
                    },
                    {
                        "en": "hazardous/toxic/radioactive waste",
                        "vi": "chất thải nguy hại / độc hại / phóng xạ"
                    },
                    {
                        "en": "Landfills for solid wastes have started reaching their capacity.",
                        "vi": "Các bãi chôn lấp chất thải rắn đã bắt đầu đạt công suất."
                    },
                    {
                        "en": "waste disposal (= the process of getting rid of waste)",
                        "vi": "xử lý chất thải (= quá trình loại bỏ chất thải)"
                    },
                    {
                        "en": "The private sector plays a significant role in waste management.",
                        "vi": "Khu vực tư nhân đóng một vai trò quan trọng trong việc quản lý chất thải."
                    },
                    {
                        "en": "Waste water going out into the rivers was reduced by 92 per cent.",
                        "vi": "Nước thải ra sông giảm 92%."
                    }
                ]
            },
            {
                "define": {
                    "en": "material that the body gets rid of as solid or liquid material",
                    "vi": "vật liệu mà cơ thể loại bỏ dưới dạng vật chất rắn hoặc lỏng"
                },
                "examples": [
                    {
                        "en": "The farmers use both animal and human waste as fertilizer.",
                        "vi": "Những người nông dân sử dụng cả chất thải động vật và con người làm phân bón."
                    }
                ]
            },
            {
                "define": {
                    "en": "a large area of land where there are very few people, animals or plants",
                    "vi": "một vùng đất rộng lớn, nơi có rất ít người, động vật hoặc thực vật"
                },
                "examples": [
                    {
                        "en": "the frozen wastes of Siberia",
                        "vi": "chất thải đông lạnh của Siberia"
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who is not useful or good at anything",
                    "vi": "một người không hữu ích hoặc không giỏi bất cứ điều gì"
                },
                "examples": [
                    {
                        "en": "You are a pathetic waste of space!",
                        "vi": "Bạn là một sự lãng phí không gian thảm hại!"
                    }
                ]
            }
        ]
    },
    {
        "id": "cac5f990adfc4a14b0af2a4823dabd03",
        "word": "bottle bank",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈbɒtl bæŋk/",
            "us": "/ˈbɑːtl bæŋk/"
        },
        "nearby": [
            {
                "word": "bottle",
                "pos": "noun"
            },
            {
                "word": "bottle",
                "pos": "verb"
            },
            {
                "word": "bottle bank",
                "pos": "noun"
            },
            {
                "word": "bottle blonde",
                "pos": "adjective"
            },
            {
                "word": "bottle blonde",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a large container in a public place where people can leave their empty bottles so that the glass can be used again (= recycled); a public place with several of these containers",
                    "vi": "một thùng lớn ở nơi công cộng, nơi mọi người có thể để chai rỗng của họ để thủy tinh có thể được sử dụng lại (= tái chế); một nơi công cộng với một số vùng chứa này"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "23079c6cbd34433abf5ef84af512216d",
        "word": "clean-up",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈkliːn ʌp/",
            "us": "/ˈkliːn ʌp/"
        },
        "nearby": [
            {
                "word": "clean-shaven",
                "pos": "adjective"
            },
            {
                "word": "clean up",
                "pos": "phrasal verb"
            },
            {
                "word": "clean-up",
                "pos": "noun"
            },
            {
                "word": "clear",
                "pos": "adjective"
            },
            {
                "word": "clear",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the process of removing dirt, pollution, or things that are considered bad or offensive from a place",
                    "vi": "quá trình loại bỏ bụi bẩn, ô nhiễm hoặc những thứ bị coi là xấu hoặc gây khó chịu khỏi một nơi"
                },
                "examples": [
                    {
                        "en": "the clean-up of the river",
                        "vi": "làm sạch sông"
                    },
                    {
                        "en": "a clean-up campaign",
                        "vi": "một chiến dịch làm sạch"
                    },
                    {
                        "en": "a massive clean-up operation",
                        "vi": "một hoạt động dọn dẹp lớn"
                    }
                ]
            }
        ]
    },
    {
        "id": "89bb0cc6c8dd4012b4f256fb0b9abeda",
        "word": "dump",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/dʌmp/",
            "us": "/dʌmp/"
        },
        "nearby": [
            {
                "word": "dummy",
                "pos": "verb"
            },
            {
                "word": "dummy run",
                "pos": "noun"
            },
            {
                "word": "dump",
                "pos": "verb"
            },
            {
                "word": "dump",
                "pos": "noun"
            },
            {
                "word": "dump bin",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to get rid of something you do not want, especially in a place that is not suitable",
                    "vi": "để loại bỏ những gì bạn không muốn, đặc biệt là ở một nơi không phù hợp"
                },
                "examples": [
                    {
                        "en": "Too much toxic waste is being dumped at sea.",
                        "vi": "Quá nhiều chất thải độc hại đang được đổ ra biển."
                    },
                    {
                        "en": "The dead body was just dumped by the roadside.",
                        "vi": "Xác chết vừa vứt bên vệ đường."
                    },
                    {
                        "en": "Any vessel dumping at sea without a licence will be prosecuted.",
                        "vi": "Mọi tàu đổ bộ trên biển mà không có giấy phép sẽ bị truy tố."
                    }
                ]
            },
            {
                "define": {
                    "en": "to get rid of somebody/something or leave them for somebody else to deal with",
                    "vi": "để loại bỏ ai đó / cái gì đó hoặc để lại chúng cho người khác giải quyết"
                },
                "examples": [
                    {
                        "en": "He's got no right to keep dumping his problems on me.",
                        "vi": "Anh ấy không có quyền tiếp tục đổ lỗi cho tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to get rid of goods by selling them at a very low price, often in another country",
                    "vi": "để loại bỏ hàng hóa bằng cách bán chúng với giá rất thấp, thường ở một quốc gia khác"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to put something/somebody down in a careless or untidy way",
                    "vi": "đặt một cái gì đó / ai đó xuống một cách bất cẩn hoặc không gọn gàng"
                },
                "examples": [
                    {
                        "en": "Just dump your stuff over there—we'll sort it out later.",
                        "vi": "Chỉ cần đổ những thứ của bạn ở đó — chúng tôi sẽ phân loại nó sau."
                    }
                ]
            },
            {
                "define": {
                    "en": "to end a romantic relationship with somebody",
                    "vi": "kết thúc mối quan hệ lãng mạn với ai đó"
                },
                "examples": [
                    {
                        "en": "Did you hear he's dumped his girlfriend?",
                        "vi": "Bạn có nghe nói rằng anh ta đã bỏ rơi bạn gái của mình?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to copy information and move it somewhere to store it",
                    "vi": "để sao chép thông tin và di chuyển nó đến một nơi nào đó để lưu trữ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to make something the responsibility of another person",
                    "vi": "để biến điều gì đó trở thành trách nhiệm của người khác"
                },
                "examples": [
                    {
                        "en": "They dropped the problem firmly back in my lap.",
                        "vi": "Họ đã đặt vấn đề trở lại trong lòng tôi một cách chắc chắn."
                    }
                ]
            }
        ]
    },
    {
        "id": "04d5bccf414643839620168a50f914b9",
        "word": "landfill",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈlændfɪl/",
            "us": "/ˈlændfɪl/"
        },
        "nearby": [
            {
                "word": "landed immigrant",
                "pos": "noun"
            },
            {
                "word": "landfall",
                "pos": "noun"
            },
            {
                "word": "landfill",
                "pos": "noun"
            },
            {
                "word": "landform",
                "pos": "noun"
            },
            {
                "word": "land grab",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an area of land where large amounts of waste material are buried under the earth",
                    "vi": "một khu vực đất nơi có một lượng lớn chất thải được chôn vùi dưới lòng đất"
                },
                "examples": [
                    {
                        "en": "The map shows the position of the new landfills.",
                        "vi": "Bản đồ cho thấy vị trí của các bãi chôn lấp mới."
                    },
                    {
                        "en": "a landfill site",
                        "vi": "một bãi rác"
                    }
                ]
            },
            {
                "define": {
                    "en": "the process of burying large amounts of waste material",
                    "vi": "quá trình chôn lấp một lượng lớn chất thải"
                },
                "examples": [
                    {
                        "en": "the choice of landfill or incineration",
                        "vi": "sự lựa chọn của bãi chôn lấp hoặc thiêu hủy"
                    }
                ]
            },
            {
                "define": {
                    "en": "waste material that will be buried",
                    "vi": "chất thải sẽ được chôn lấp"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "f57c7cafd09045e78c07808048972be2",
        "word": "polluter",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/pəˈluːtə(r)/",
            "us": "/pəˈluːtər/"
        },
        "nearby": [
            {
                "word": "pollutant",
                "pos": "noun"
            },
            {
                "word": "pollute",
                "pos": "verb"
            },
            {
                "word": "polluter",
                "pos": "noun"
            },
            {
                "word": "pollution",
                "pos": "noun"
            },
            {
                "word": "Polly",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person, company, country, etc. that causes pollution",
                    "vi": "một người, công ty, quốc gia, v.v. gây ô nhiễm"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "96f9c0056bda481a9d9666bbd157d17d",
        "word": "acid rain",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌæsɪd ˈreɪn/",
            "us": "/ˌæsɪd ˈreɪn/"
        },
        "nearby": [
            {
                "word": "acid jazz",
                "pos": "noun"
            },
            {
                "word": "acidly",
                "pos": "adverb"
            },
            {
                "word": "acid rain",
                "pos": "noun"
            },
            {
                "word": "acid rock",
                "pos": "noun"
            },
            {
                "word": "acid salt",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "rain that contains harmful chemicals from factory gases and that damages trees, crops and buildings",
                    "vi": "mưa có chứa các hóa chất độc hại từ khí nhà máy và gây hại cho cây cối, hoa màu và các tòa nhà"
                },
                "examples": [
                    {
                        "en": "Sulphur, falling as acid rain, is killing fish in the Great Lakes.",
                        "vi": "Lưu huỳnh, rơi xuống dưới dạng mưa axit, đang giết chết cá ở Hồ Lớn."
                    }
                ]
            }
        ]
    },
    {
        "id": "e91fe0cc98e343f9b0b416876bcba3cc",
        "word": "biodegradable",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌbaɪəʊdɪˈɡreɪdəbl/",
            "us": "/ˌbaɪəʊdɪˈɡreɪdəbl/"
        },
        "nearby": [
            {
                "word": "biodata",
                "pos": "noun"
            },
            {
                "word": "biodefence",
                "pos": "noun"
            },
            {
                "word": "biodegradable",
                "pos": "adjective"
            },
            {
                "word": "biodegrade",
                "pos": "verb"
            },
            {
                "word": "biodiesel",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a substance or chemical that is biodegradable can be changed by the action of bacteria to a natural state that will not harm the environment",
                    "vi": "một chất hoặc hóa chất có thể phân hủy sinh học có thể được thay đổi do tác động của vi khuẩn sang trạng thái tự nhiên sẽ không gây hại cho môi trường"
                },
                "examples": [
                    {
                        "en": "All active ingredients of this soap powder are 98% biodegradable within three days.",
                        "vi": "Tất cả các thành phần hoạt tính của bột xà phòng này có thể phân hủy sinh học 98% trong vòng ba ngày."
                    },
                    {
                        "en": "Most plastics are not readily biodegradable.",
                        "vi": "Hầu hết các loại nhựa không dễ phân hủy sinh học."
                    }
                ]
            }
        ]
    },
    {
        "id": "aff1700aac1949ef95996aff25444b0b",
        "word": "carbon monoxide",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌkɑːbən məˈnɒksaɪd/",
            "us": "/ˌkɑːrbən məˈnɑːksaɪd/"
        },
        "nearby": [
            {
                "word": "carbonization",
                "pos": "noun"
            },
            {
                "word": "carbonize",
                "pos": "verb"
            },
            {
                "word": "carbon monoxide",
                "pos": "noun"
            },
            {
                "word": "carbon-neutral",
                "pos": "adjective"
            },
            {
                "word": "carbon offset",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a poisonous gas formed when carbon burns partly but not completely. It is produced when petrol is burned in car engines.",
                    "vi": "một loại khí độc được hình thành khi cacbon cháy một phần nhưng không hoàn toàn. Nó được tạo ra khi xăng được đốt cháy trong động cơ ô tô."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "cc4d4f1c669d4bedb9b9067943f1b9fe",
        "word": "contaminate",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/kənˈtæmɪneɪt/",
            "us": "/kənˈtæmɪneɪt/"
        },
        "nearby": [
            {
                "word": "containment",
                "pos": "noun"
            },
            {
                "word": "contaminant",
                "pos": "noun"
            },
            {
                "word": "contaminate",
                "pos": "verb"
            },
            {
                "word": "contamination",
                "pos": "noun"
            },
            {
                "word": "contd",
                "pos": "abbreviation"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to make a substance or place dirty or no longer pure by adding a substance that is dangerous or carries disease",
                    "vi": "để làm cho một chất hoặc một nơi bẩn thỉu hoặc không còn tinh khiết bằng cách thêm một chất gây nguy hiểm hoặc mang mầm bệnh"
                },
                "examples": [
                    {
                        "en": "The drinking water has become contaminated with lead.",
                        "vi": "Nước uống bị nhiễm chì."
                    },
                    {
                        "en": "contaminated blood/food/soil",
                        "vi": "máu / thực phẩm / đất bị ô nhiễm"
                    },
                    {
                        "en": "a river contaminated by pollution",
                        "vi": "một dòng sông bị ô nhiễm"
                    },
                    {
                        "en": "These substances can contaminate groundwater.",
                        "vi": "Những chất này có thể làm ô nhiễm nguồn nước ngầm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to influence people’s ideas or attitudes in a bad way",
                    "vi": "ảnh hưởng đến ý tưởng hoặc thái độ của mọi người theo cách xấu"
                },
                "examples": [
                    {
                        "en": "They were accused of contaminating the minds of our young people.",
                        "vi": "Họ đã bị buộc tội làm ô nhiễm tâm trí của những người trẻ tuổi của chúng tôi."
                    }
                ]
            }
        ]
    },
    {
        "id": "7a629f6af2da4a4cb436efd8848fcdc4",
        "word": "contamination",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/kənˌtæmɪˈneɪʃn/",
            "us": "/kənˌtæmɪˈneɪʃn/"
        },
        "nearby": [
            {
                "word": "contaminant",
                "pos": "noun"
            },
            {
                "word": "contaminate",
                "pos": "verb"
            },
            {
                "word": "contamination",
                "pos": "noun"
            },
            {
                "word": "contd",
                "pos": "abbreviation"
            },
            {
                "word": "contemplate",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the process or fact of making a substance or place dirty or no longer pure by adding a substance that is dangerous or carries disease",
                    "vi": "quá trình hoặc thực tế của việc tạo ra một chất hoặc nơi bẩn thỉu hoặc không còn tinh khiết bằng cách thêm một chất gây nguy hiểm hoặc mang bệnh"
                },
                "examples": [
                    {
                        "en": "radioactive contamination",
                        "vi": "nhiễm phóng xạ"
                    },
                    {
                        "en": "bacterial/chemical contamination",
                        "vi": "nhiễm vi khuẩn / hóa chất"
                    },
                    {
                        "en": "Environmental contamination resulting from human activities is a major health concern.",
                        "vi": "Ô nhiễm môi trường do các hoạt động của con người là một mối quan tâm lớn về sức khỏe."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of influencing people's ideas or attitudes in a bad way",
                    "vi": "hành động ảnh hưởng đến ý tưởng hoặc thái độ của mọi người theo cách xấu"
                },
                "examples": [
                    {
                        "en": "They feared cultural contamination from the influx of tourists.",
                        "vi": "Họ lo sợ sự ô nhiễm văn hóa từ dòng khách du lịch."
                    }
                ]
            }
        ]
    },
    {
        "id": "6356add545ae4804854aca7916979383",
        "word": "disposal",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/dɪˈspəʊzl/",
            "us": "/dɪˈspəʊzl/"
        },
        "nearby": [
            {
                "word": "disposable",
                "pos": "adjective"
            },
            {
                "word": "disposables",
                "pos": "noun"
            },
            {
                "word": "disposal",
                "pos": "noun"
            },
            {
                "word": "dispose",
                "pos": "verb"
            },
            {
                "word": "disposed",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act of getting rid of something",
                    "vi": "hành động loại bỏ một cái gì đó"
                },
                "examples": [
                    {
                        "en": "The council is responsible for waste disposal and street cleaning.",
                        "vi": "Hội đồng chịu trách nhiệm xử lý rác thải và vệ sinh đường phố."
                    },
                    {
                        "en": "sewage disposal systems",
                        "vi": "hệ thống xử lý nước thải"
                    },
                    {
                        "en": "the problems of the ultimate disposal of nuclear waste",
                        "vi": "các vấn đề của việc xử lý cuối cùng chất thải hạt nhân"
                    }
                ]
            },
            {
                "define": {
                    "en": "the sale of part of a business, property, etc.",
                    "vi": "bán một phần doanh nghiệp, tài sản, v.v."
                },
                "examples": [
                    {
                        "en": "The next step is to think about disposal of your assets.",
                        "vi": "Bước tiếp theo là suy nghĩ về việc xử lý tài sản của bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a machine connected to the waste pipe of a kitchen sink, for cutting food waste into small pieces",
                    "vi": "một máy kết nối với đường ống thải của bồn rửa nhà bếp, để cắt rác thải thực phẩm thành các mảnh nhỏ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "available for use as you prefer/somebody prefers",
                    "vi": "có sẵn để sử dụng như bạn thích / ai đó thích"
                },
                "examples": [
                    {
                        "en": "He will have a car at his disposal for the whole month.",
                        "vi": "Anh ấy sẽ có một chiếc xe hơi theo ý của mình trong cả tháng."
                    },
                    {
                        "en": "Well, I'm at your disposal (= I am ready to help you in any way I can).",
                        "vi": "Vâng, tôi tùy ý bạn (= Tôi sẵn sàng giúp đỡ bạn bằng mọi cách có thể)."
                    }
                ]
            }
        ]
    },
    {
        "id": "2667a12de70d42519ee18573b4c3f151",
        "word": "dumper",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈdʌmpə(r)/",
            "us": "/ˈdʌmpər/"
        },
        "nearby": [
            {
                "word": "dump bin",
                "pos": "noun"
            },
            {
                "word": "dumpee",
                "pos": "noun"
            },
            {
                "word": "dumper",
                "pos": "noun"
            },
            {
                "word": "dumper truck",
                "pos": "noun"
            },
            {
                "word": "dumping",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who throws away dangerous or harmful things, especially in the wrong place",
                    "vi": "một người ném những thứ nguy hiểm hoặc có hại, đặc biệt là ở nơi sai"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "916b7f4ff3e846989fb01b4c4b6af638",
        "word": "dumping",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈdʌmpɪŋ/",
            "us": "/ˈdʌmpɪŋ/"
        },
        "nearby": [
            {
                "word": "dumper",
                "pos": "noun"
            },
            {
                "word": "dumper truck",
                "pos": "noun"
            },
            {
                "word": "dumping",
                "pos": "noun"
            },
            {
                "word": "dumping ground",
                "pos": "noun"
            },
            {
                "word": "dumpling",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act or practice of dumping something (= leaving something that you do not want in a place that is not suitable), especially dangerous substances",
                    "vi": "hành động hoặc hành vi vứt bỏ thứ gì đó (= để thứ gì đó mà bạn không muốn ở một nơi không phù hợp), đặc biệt là các chất nguy hiểm"
                },
                "examples": [
                    {
                        "en": "a ban on the dumping of radioactive waste at sea",
                        "vi": "lệnh cấm đổ chất thải phóng xạ trên biển"
                    }
                ]
            }
        ]
    },
    {
        "id": "74193ce960bf47d1854b6f643b01e94c",
        "word": "exhaust",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ɪɡˈzɔːst/",
            "us": "/ɪɡˈzɔːst/"
        },
        "nearby": [
            {
                "word": "exhalation",
                "pos": "noun"
            },
            {
                "word": "exhale",
                "pos": "verb"
            },
            {
                "word": "exhaust",
                "pos": "noun"
            },
            {
                "word": "exhaust",
                "pos": "verb"
            },
            {
                "word": "exhausted",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "waste gases that come out of a vehicle, an engine or a machine",
                    "vi": "khí thải từ xe cộ, động cơ hoặc máy móc"
                },
                "examples": [
                    {
                        "en": "car exhaust fumes/emissions",
                        "vi": "khói / khí thải ô tô"
                    }
                ]
            },
            {
                "define": {
                    "en": "the system in a vehicle through which exhaust gases come out",
                    "vi": "hệ thống trong một chiếc xe mà qua đó khí thải thoát ra"
                },
                "examples": [
                    {
                        "en": "My car needs a new exhaust.",
                        "vi": "Xe của tôi cần một ống xả mới."
                    },
                    {
                        "en": "pollution from car exhausts",
                        "vi": "ô nhiễm từ khói xe"
                    }
                ]
            }
        ]
    },
    {
        "id": "6ba6c004741f4b6b8254adf685e382d0",
        "word": "food mile",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈfuːd maɪl/",
            "us": "/ˈfuːd maɪl/"
        },
        "nearby": [
            {
                "word": "foodie",
                "pos": "adjective"
            },
            {
                "word": "food insecurity",
                "pos": "noun"
            },
            {
                "word": "food mile",
                "pos": "noun"
            },
            {
                "word": "food pantry",
                "pos": "noun"
            },
            {
                "word": "food poisoning",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a measurement of the distance food has to be transported from the producer to the consumer and the fuel that this uses",
                    "vi": "phép đo khoảng cách thực phẩm phải được vận chuyển từ nhà sản xuất đến người tiêu dùng và nhiên liệu mà thực phẩm này sử dụng"
                },
                "examples": [
                    {
                        "en": "We keep food miles to a minimum by sourcing products locally.",
                        "vi": "Chúng tôi giữ mức ăn dặm ở mức tối thiểu bằng cách tìm nguồn cung ứng sản phẩm tại địa phương."
                    },
                    {
                        "en": "the campaign to reduce food miles",
                        "vi": "chiến dịch giảm lượng thức ăn dặm"
                    }
                ]
            }
        ]
    },
    {
        "id": "d42bf172ba904dbba7c28a1f79879a4d",
        "word": "fumes",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/fjuːmz/",
            "us": "/fjuːmz/"
        },
        "nearby": [
            {
                "word": "fumbling",
                "pos": "adjective"
            },
            {
                "word": "fume",
                "pos": "verb"
            },
            {
                "word": "fumes",
                "pos": "noun"
            },
            {
                "word": "fumigate",
                "pos": "verb"
            },
            {
                "word": "fumigation",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "smoke, gas, or something similar that smells strongly or is dangerous to breathe in",
                    "vi": "khói, khí hoặc thứ gì đó tương tự có mùi nồng nặc hoặc nguy hiểm khi hít phải"
                },
                "examples": [
                    {
                        "en": "diesel/petrol/exhaust fumes",
                        "vi": "khói dầu diesel / xăng / khí thải"
                    }
                ]
            }
        ]
    },
    {
        "id": "6db81feb58b5469284a7f3fdd4707706",
        "word": "microplastic",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈmaɪkrəʊplæstɪk/",
            "us": "/ˈmaɪkrəʊplæstɪk/"
        },
        "nearby": [
            {
                "word": "micropayment",
                "pos": "noun"
            },
            {
                "word": "microphone",
                "pos": "noun"
            },
            {
                "word": "microplastic",
                "pos": "noun"
            },
            {
                "word": "microprocessor",
                "pos": "noun"
            },
            {
                "word": "microscope",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "extremely small pieces of plastic in the environment that come from consumer products and industrial waste",
                    "vi": "những mảnh nhựa cực nhỏ trong môi trường đến từ các sản phẩm tiêu dùng và chất thải công nghiệp"
                },
                "examples": [
                    {
                        "en": "Scientists found microplastics in the waters near inshore coral reefs in the World Heritage-listed site.",
                        "vi": "Các nhà khoa học đã tìm thấy vi nhựa trong vùng nước gần các rạn san hô ven bờ ở khu vực được xếp hạng Di sản Thế giới."
                    },
                    {
                        "en": "microplastic particles/pollution",
                        "vi": "hạt vi nhựa / ô nhiễm"
                    }
                ]
            }
        ]
    },
    {
        "id": "5545dbb071b34450b42442bfc1915305",
        "word": "ozone layer",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈəʊzəʊn leɪə(r)/",
            "us": "/ˈəʊzəʊn ler/"
        },
        "nearby": [
            {
                "word": "ozone-friendly",
                "pos": "adjective"
            },
            {
                "word": "ozone hole",
                "pos": "noun"
            },
            {
                "word": "ozone layer",
                "pos": "noun"
            },
            {
                "word": "Ozymandias",
                "pos": ""
            },
            {
                "word": "Ozzie",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a layer of ozone high above the earth’s surface that helps to protect the earth from harmful radiation from the sun",
                    "vi": "một tầng ôzôn cao trên bề mặt trái đất giúp bảo vệ trái đất khỏi bức xạ có hại từ mặt trời"
                },
                "examples": [
                    {
                        "en": "A hole in the ozone layer was discovered over Antarctica.",
                        "vi": "Một lỗ thủng trên tầng ôzôn đã được phát hiện ở Nam Cực."
                    },
                    {
                        "en": "The ozone layer protects life on earth by absorbing harmful ultraviolet radiation.",
                        "vi": "Tầng ôzôn bảo vệ sự sống trên trái đất bằng cách hấp thụ bức xạ tia cực tím có hại."
                    }
                ]
            }
        ]
    },
    {
        "id": "7fb003febd3743f9a175804c95bbee50",
        "word": "reuse",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌriːˈjuːz/",
            "us": "/ˌriːˈjuːz/"
        },
        "nearby": [
            {
                "word": "reunite",
                "pos": "verb"
            },
            {
                "word": "reusable",
                "pos": "adjective"
            },
            {
                "word": "reuse",
                "pos": "verb"
            },
            {
                "word": "reuse",
                "pos": "noun"
            },
            {
                "word": "Reuters",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to use something again",
                    "vi": "để sử dụng một cái gì đó một lần nữa"
                },
                "examples": [
                    {
                        "en": "Please reuse your envelopes.",
                        "vi": "Vui lòng sử dụng lại phong bì của bạn."
                    }
                ]
            }
        ]
    },
    {
        "id": "48b23a8c484846aaa1ffec4fa80b22d4",
        "word": "reuse",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌriːˈjuːs/",
            "us": "/ˌriːˈjuːs/"
        },
        "nearby": [
            {
                "word": "reusable",
                "pos": "adjective"
            },
            {
                "word": "reuse",
                "pos": "verb"
            },
            {
                "word": "reuse",
                "pos": "noun"
            },
            {
                "word": "Reuters",
                "pos": ""
            },
            {
                "word": "rev",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act of using something again",
                    "vi": "hành động sử dụng lại thứ gì đó"
                },
                "examples": [
                    {
                        "en": "The water is conserved and reheated for reuse.",
                        "vi": "Nước được bảo quản và hâm nóng để tái sử dụng."
                    },
                    {
                        "en": "a plan for the reduction, reuse and recycling of all waste",
                        "vi": "một kế hoạch giảm thiểu, tái sử dụng và tái chế tất cả các chất thải"
                    }
                ]
            }
        ]
    },
    {
        "id": "98ebf05707ec44b9ba9e6940a21b11b7",
        "word": "smog",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/smɒɡ/",
            "us": "/smɑːɡ/"
        },
        "nearby": [
            {
                "word": "smock",
                "pos": "noun"
            },
            {
                "word": "smocking",
                "pos": "noun"
            },
            {
                "word": "smog",
                "pos": "noun"
            },
            {
                "word": "smoggy",
                "pos": "adjective"
            },
            {
                "word": "smoke",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a form of air pollution that is or looks like a mixture of smoke and fog, especially in cities",
                    "vi": "một dạng ô nhiễm không khí giống như hỗn hợp khói và sương mù, đặc biệt là ở các thành phố"
                },
                "examples": [
                    {
                        "en": "attempts to reduce smog caused by traffic fumes",
                        "vi": "nỗ lực giảm thiểu khói do khói xe cộ gây ra"
                    }
                ]
            }
        ]
    },
    {
        "id": "44d1fca020d748b597e2c9a95f347d97",
        "word": "toxic",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈtɒksɪk/",
            "us": "/ˈtɑːksɪk/"
        },
        "nearby": [
            {
                "word": "tow truck",
                "pos": "noun"
            },
            {
                "word": "toxaemia",
                "pos": "noun"
            },
            {
                "word": "toxic",
                "pos": "adjective"
            },
            {
                "word": "toxicity",
                "pos": "noun"
            },
            {
                "word": "toxic masculinity",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "containing poison; poisonous",
                    "vi": "chứa chất độc; độc"
                },
                "examples": [
                    {
                        "en": "toxic chemicals/fumes/gases/substances",
                        "vi": "hóa chất / khói / khí / chất độc hại"
                    },
                    {
                        "en": "to dispose of toxic waste",
                        "vi": "xử lý chất thải độc hại"
                    },
                    {
                        "en": "Many pesticides are highly toxic.",
                        "vi": "Nhiều loại thuốc trừ sâu có độc tính cao."
                    },
                    {
                        "en": "toxic to somebody/something This chemical is toxic to many forms of life.",
                        "vi": "độc hại đối với ai đó / cái gì đó Hóa chất này độc hại đối với nhiều dạng sống."
                    }
                ]
            },
            {
                "define": {
                    "en": "a level of debt or high-risk investment that causes very serious problems for a bank or other financial institution",
                    "vi": "mức nợ hoặc khoản đầu tư có rủi ro cao gây ra các vấn đề rất nghiêm trọng cho ngân hàng hoặc tổ chức tài chính khác"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "very unpleasant, especially in the way somebody likes to control and influence other people in a dishonest way",
                    "vi": "rất khó chịu, đặc biệt là theo cách ai đó thích kiểm soát và ảnh hưởng đến người khác theo cách không trung thực"
                },
                "examples": [
                    {
                        "en": "I felt trapped in this toxic relationship.",
                        "vi": "Tôi cảm thấy bị mắc kẹt trong mối quan hệ độc hại này."
                    },
                    {
                        "en": "The political situation is highly toxic.",
                        "vi": "Tình hình chính trị có tính độc hại cao."
                    },
                    {
                        "en": "the toxic atmosphere that now exists in political life",
                        "vi": "bầu không khí độc hại hiện đang tồn tại trong đời sống chính trị"
                    }
                ]
            }
        ]
    },
    {
        "id": "d82c00262a10462da227cf236b18d556",
        "word": "zero-emission",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌzɪərəʊ ɪˈmɪʃn/",
            "us": "/ˌzɪrəʊ ɪˈmɪʃn/"
        },
        "nearby": [
            {
                "word": "zero",
                "pos": "verb"
            },
            {
                "word": "zero-carbon",
                "pos": "adjective"
            },
            {
                "word": "zero-emission",
                "pos": "adjective"
            },
            {
                "word": "zero gravity",
                "pos": "noun"
            },
            {
                "word": "zero grazing",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "used to describe a vehicle that does not produce gases that cause pollution",
                    "vi": "được sử dụng để mô tả một phương tiện không tạo ra khí gây ô nhiễm"
                },
                "examples": [
                    {
                        "en": "Zero-emission cars—including all electric cars—are exempt from car tax.",
                        "vi": "Ô tô không phát thải — bao gồm tất cả ô tô điện — được miễn thuế ô tô."
                    }
                ]
            }
        ]
    },
    {
        "id": "5963660623644942a3750b2f2c171d99",
        "word": "aerosol",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈeərəsɒl/",
            "us": "/ˈerəsɑːl/"
        },
        "nearby": [
            {
                "word": "aeroplane",
                "pos": "noun"
            },
            {
                "word": "aeroponics",
                "pos": "noun"
            },
            {
                "word": "aerosol",
                "pos": "noun"
            },
            {
                "word": "aerospace",
                "pos": "noun"
            },
            {
                "word": "aerostat",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a liquid such as paint or hairspray that is kept under pressure in a metal container and released as a spray",
                    "vi": "một chất lỏng như sơn hoặc keo xịt tóc được giữ dưới áp suất trong hộp kim loại và được giải phóng dưới dạng phun"
                },
                "examples": [
                    {
                        "en": "ozone-friendly aerosols",
                        "vi": "bình xịt thân thiện với ozone"
                    },
                    {
                        "en": "an aerosol can/spray",
                        "vi": "một bình xịt / bình xịt"
                    }
                ]
            }
        ]
    },
    {
        "id": "4cc888c78922413f82b774df66122f68",
        "word": "asbestos",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/æsˈbestɒs/",
            "us": "/æzˈbestəs/"
        },
        "nearby": [
            {
                "word": "asana",
                "pos": "noun"
            },
            {
                "word": "asap",
                "pos": "abbreviation"
            },
            {
                "word": "asbestos",
                "pos": "noun"
            },
            {
                "word": "asbestosis",
                "pos": "noun"
            },
            {
                "word": "ASBO",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a soft grey mineral that does not burn and can be woven into material, used especially in the past in building as a protection against fire or to prevent heat loss. Asbestos is dangerous if you breathe it in.",
                    "vi": "một khoáng chất màu xám mềm, không cháy và có thể được dệt thành vật liệu, được sử dụng đặc biệt trong quá khứ trong xây dựng như một chất bảo vệ chống cháy hoặc ngăn thất thoát nhiệt. Amiăng rất nguy hiểm nếu bạn hít phải nó."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "d37769a68dd34d70a95364fe09752106",
        "word": "biohazard",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbaɪəʊhæzəd/",
            "us": "/ˈbaɪəʊhæzərd/"
        },
        "nearby": [
            {
                "word": "biographical",
                "pos": "adjective"
            },
            {
                "word": "biography",
                "pos": "noun"
            },
            {
                "word": "biohazard",
                "pos": "noun"
            },
            {
                "word": "biological",
                "pos": "adjective"
            },
            {
                "word": "biological clock",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a risk to human health or to the environment from a biological source",
                    "vi": "nguy cơ đối với sức khỏe con người hoặc đối với môi trường từ một nguồn sinh học"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "e3f7512c768f43cdbc1e153abe16e5d2",
        "word": "catalytic converter",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌkætəˌlɪtɪk kənˈvɜːtə(r)/",
            "us": "/ˌkætəˌlɪtɪk kənˈvɜːrtər/"
        },
        "nearby": [
            {
                "word": "catalyst",
                "pos": "noun"
            },
            {
                "word": "catalytic",
                "pos": "adjective"
            },
            {
                "word": "catalytic converter",
                "pos": "noun"
            },
            {
                "word": "catamaran",
                "pos": "noun"
            },
            {
                "word": "catamite",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a device used in the exhaust system of vehicles to reduce the damage caused to the environment",
                    "vi": "một thiết bị được sử dụng trong hệ thống xả của phương tiện giao thông để giảm thiệt hại gây ra cho môi trường"
                },
                "examples": [
                    {
                        "en": "a car fitted with a catalytic converter",
                        "vi": "một chiếc ô tô được trang bị một bộ chuyển đổi xúc tác"
                    }
                ]
            }
        ]
    },
    {
        "id": "7e12f068fef04d2eac790b5f6af5e304",
        "word": "CFC",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌsiː ef ˈsiː/",
            "us": "/ˌsiː ef ˈsiː/"
        },
        "nearby": [
            {
                "word": "ceviche",
                "pos": "noun"
            },
            {
                "word": "cf.",
                "pos": "abbreviation"
            },
            {
                "word": "CFC",
                "pos": "noun"
            },
            {
                "word": "CFL",
                "pos": "abbreviation"
            },
            {
                "word": "CFO",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a type of gas previously used especially in aerosols (= types of container that release liquid in very small drops). CFCs are harmful to the earth’s ozone layer and are generally no longer used in these products. (the abbreviation for ‘chlorofluorocarbon’)",
                    "vi": "một loại khí trước đây được sử dụng đặc biệt trong các bình xịt (= loại bình chứa giải phóng chất lỏng theo từng giọt rất nhỏ). CFC có hại cho tầng ôzôn của trái đất và nói chung không còn được sử dụng trong các sản phẩm này. (chữ viết tắt của 'chlorofluorocarbon')"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "40c2e7ea62f5466cb770966ac83b6584",
        "word": "compost",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkɒmpɒst/",
            "us": "/ˈkɑːmpəʊst/"
        },
        "nearby": [
            {
                "word": "compos mentis",
                "pos": "adjective"
            },
            {
                "word": "compost",
                "pos": "noun"
            },
            {
                "word": "compost",
                "pos": "verb"
            },
            {
                "word": "compostable",
                "pos": "adjective"
            },
            {
                "word": "compost bin",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to make something into compost",
                    "vi": "để làm một cái gì đó thành phân trộn"
                },
                "examples": [
                    {
                        "en": "Cover the area with composted bark or peat.",
                        "vi": "Che khu vực bằng vỏ cây đã ủ hoặc than bùn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to put compost on or in something",
                    "vi": "để phân trộn trên hoặc trong một cái gì đó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "37377e837cb144cba7573bdc42d30d5f",
        "word": "effluent",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈefluənt/",
            "us": "/ˈefluənt/"
        },
        "nearby": [
            {
                "word": "effing",
                "pos": "adjective"
            },
            {
                "word": "efflorescence",
                "pos": "noun"
            },
            {
                "word": "effluent",
                "pos": "noun"
            },
            {
                "word": "eff off",
                "pos": "phrasal verb"
            },
            {
                "word": "effort",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "liquid waste, especially chemicals produced by factories, or sewage",
                    "vi": "chất thải lỏng, đặc biệt là hóa chất do các nhà máy sản xuất, hoặc nước thải"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "76b906fcd3374c5b8a3d0743abb8e10b",
        "word": "fallout",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈfɔːlaʊt/",
            "us": "/ˈfɔːlaʊt/"
        },
        "nearby": [
            {
                "word": "fallopian tube",
                "pos": "noun"
            },
            {
                "word": "fall out",
                "pos": "phrasal verb"
            },
            {
                "word": "fallout",
                "pos": "noun"
            },
            {
                "word": "fall over",
                "pos": "phrasal verb"
            },
            {
                "word": "fall over yourself to do",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "dangerous radioactive dust that is in the air after a nuclear explosion",
                    "vi": "bụi phóng xạ nguy hiểm trong không khí sau một vụ nổ hạt nhân"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the bad results of a situation or an action",
                    "vi": "kết quả xấu của một tình huống hoặc một hành động"
                },
                "examples": [
                    {
                        "en": "the political fallout of the current crisis",
                        "vi": "hậu quả chính trị của cuộc khủng hoảng hiện tại"
                    }
                ]
            }
        ]
    },
    {
        "id": "187c19eec6a44491a7da57c94e6a0e3d",
        "word": "hazmat suit",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈhæzmæt suːt/",
            "us": "/ˈhæzmæt suːt/"
        },
        "nearby": [
            {
                "word": "hazing",
                "pos": "noun"
            },
            {
                "word": "William Hazlitt",
                "pos": ""
            },
            {
                "word": "hazmat suit",
                "pos": "noun"
            },
            {
                "word": "hazy",
                "pos": "adjective"
            },
            {
                "word": "H-block",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a special suit that protects a person's body when they are dealing with dangerous substances",
                    "vi": "một bộ quần áo đặc biệt bảo vệ cơ thể của một người khi họ tiếp xúc với các chất nguy hiểm"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "40a147f8004d435dae38ddc11bef197a",
        "word": "leach",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/liːtʃ/",
            "us": "/liːtʃ/"
        },
        "nearby": [
            {
                "word": "LEA",
                "pos": ""
            },
            {
                "word": "Lea and Perrins",
                "pos": ""
            },
            {
                "word": "leach",
                "pos": "verb"
            },
            {
                "word": "lead1",
                "pos": "verb"
            },
            {
                "word": "lead1",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to be removed from soil, etc. by water passing through it",
                    "vi": "được loại bỏ khỏi đất, v.v. bằng cách nước đi qua nó"
                },
                "examples": [
                    {
                        "en": "Nitrates leach from the soil into rivers.",
                        "vi": "Nitrat trôi từ đất vào sông."
                    }
                ]
            },
            {
                "define": {
                    "en": "to remove chemicals, minerals, etc. from soil",
                    "vi": "để loại bỏ hóa chất, khoáng chất, v.v. khỏi đất"
                },
                "examples": [
                    {
                        "en": "The nutrient is quickly leached away.",
                        "vi": "Chất dinh dưỡng nhanh chóng bị rửa trôi."
                    }
                ]
            }
        ]
    },
    {
        "id": "bd3ab20f73a84718a807c7bf8e5c4e39",
        "word": "leaded",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈledɪd/",
            "us": "/ˈledɪd/"
        },
        "nearby": [
            {
                "word": "lead2",
                "pos": "noun"
            },
            {
                "word": "'Leadbelly'",
                "pos": ""
            },
            {
                "word": "leaded",
                "pos": "adjective"
            },
            {
                "word": "leaded light",
                "pos": "noun"
            },
            {
                "word": "leaden",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "with lead added to it",
                    "vi": "với chì được thêm vào nó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "with a cover or a frame of lead",
                    "vi": "bằng bìa hoặc khung bằng chì"
                },
                "examples": [
                    {
                        "en": "a leaded roof",
                        "vi": "một mái nhà bằng chì"
                    }
                ]
            }
        ]
    },
    {
        "id": "962ae5e4a84a4cea99af11c16d7e46d2",
        "word": "nanoplastic",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈnænəʊplæstɪk/",
            "us": "/ˈnænəʊplæstɪk/"
        },
        "nearby": [
            {
                "word": "nanometre",
                "pos": "noun"
            },
            {
                "word": "nanoparticle",
                "pos": "noun"
            },
            {
                "word": "nanoplastic",
                "pos": "noun"
            },
            {
                "word": "nanoscale",
                "pos": "adjective"
            },
            {
                "word": "nanoscience",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "tiny pieces of plastic in the environment that are less than 100 nanometres long",
                    "vi": "những mảnh nhựa nhỏ trong môi trường dài dưới 100 nanomet"
                },
                "examples": [
                    {
                        "en": "Very small particles such as nanoplastics could penetrate gut tissues.",
                        "vi": "Các hạt rất nhỏ như nhựa nano có thể xâm nhập vào các mô ruột."
                    },
                    {
                        "en": "nanoplastic particles",
                        "vi": "hạt nhựa nano"
                    }
                ]
            }
        ]
    },
    {
        "id": "d18b2a5be9264d4b938f5fd48d1fa478",
        "word": "nitrogen cycle",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈnaɪtrədʒən saɪkl/",
            "us": "/ˈnaɪtrədʒən saɪkl/"
        },
        "nearby": [
            {
                "word": "nitrite",
                "pos": "noun"
            },
            {
                "word": "nitrogen",
                "pos": "noun"
            },
            {
                "word": "nitrogen cycle",
                "pos": "noun"
            },
            {
                "word": "nitrogen dioxide",
                "pos": "noun"
            },
            {
                "word": "nitrogen fixation",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the processes by which nitrogen is passed from one part of the environment to another, for example when plants decay (= become destroyed by natural processes)",
                    "vi": "các quá trình mà nitơ được truyền từ phần này sang phần khác của môi trường, ví dụ như khi thực vật thối rữa (= bị phá hủy bởi các quá trình tự nhiên)"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "13bf20ec10fb4a45b97dc2f0a00b6f3f",
        "word": "nitrogen fixation",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈnaɪtrədʒən fɪkseɪʃn/",
            "us": "/ˈnaɪtrədʒən fɪkseɪʃn/"
        },
        "nearby": [
            {
                "word": "nitrogen cycle",
                "pos": "noun"
            },
            {
                "word": "nitrogen dioxide",
                "pos": "noun"
            },
            {
                "word": "nitrogen fixation",
                "pos": "noun"
            },
            {
                "word": "nitrogen-fixing",
                "pos": "adjective"
            },
            {
                "word": "nitrogenous",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the chemical process by which nitrogen from the atmosphere is changed by bacteria into compounds in the soil that plants and other living things can use, especially as part of the nitrogen cycle",
                    "vi": "Quá trình hóa học trong đó nitơ từ khí quyển được vi khuẩn biến đổi thành các hợp chất trong đất mà thực vật và các sinh vật khác có thể sử dụng, đặc biệt là một phần của chu trình nitơ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "b16aa49735b24d9e9362e35897194de7",
        "word": "nitrogen-fixing",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈnaɪtrədʒən fɪksɪŋ/",
            "us": "/ˈnaɪtrədʒən fɪksɪŋ/"
        },
        "nearby": [
            {
                "word": "nitrogen dioxide",
                "pos": "noun"
            },
            {
                "word": "nitrogen fixation",
                "pos": "noun"
            },
            {
                "word": "nitrogen-fixing",
                "pos": "adjective"
            },
            {
                "word": "nitrogenous",
                "pos": "adjective"
            },
            {
                "word": "nitroglycerine",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "causing or relating to nitrogen fixation",
                    "vi": "gây ra hoặc liên quan đến sự cố định nitơ"
                },
                "examples": [
                    {
                        "en": "nitrogen-fixing bacteria",
                        "vi": "vi khuẩn cố định nitơ"
                    }
                ]
            }
        ]
    },
    {
        "id": "277e5c71136b4f839cb9c279142325a6",
        "word": "non-biodegradable",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌnɒn ˌbaɪəʊdɪˈɡreɪdəbl/",
            "us": "/ˌnɑːn ˌbaɪəʊdɪˈɡreɪdəbl/"
        },
        "nearby": [
            {
                "word": "non-binary",
                "pos": "adjective"
            },
            {
                "word": "non-binding",
                "pos": "adjective"
            },
            {
                "word": "non-biodegradable",
                "pos": "adjective"
            },
            {
                "word": "nonce",
                "pos": "adjective"
            },
            {
                "word": "nonchalance",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a substance or chemical that is non-biodegradable cannot be changed by the action of bacteria to a natural state that does not harm the environment",
                    "vi": "một chất hoặc hóa chất không thể phân hủy sinh học không thể thay đổi do tác động của vi khuẩn sang trạng thái tự nhiên không gây hại cho môi trường"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "2cb22e58354448168d51d6b162cf1248",
        "word": "oil slick",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɔɪl slɪk/",
            "us": "/ˈɔɪl slɪk/"
        },
        "nearby": [
            {
                "word": "oilseed rape",
                "pos": "noun"
            },
            {
                "word": "oilskin",
                "pos": "noun"
            },
            {
                "word": "oil slick",
                "pos": "noun"
            },
            {
                "word": "oil tanker",
                "pos": "noun"
            },
            {
                "word": "oil well",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an area of oil that is floating on the surface of the sea",
                    "vi": "một vùng dầu nổi trên mặt biển"
                },
                "examples": [
                    {
                        "en": "a seven-mile-long oil slick off the Alaskan coast",
                        "vi": "một vết dầu dài bảy dặm ngoài khơi bờ biển Alaska"
                    }
                ]
            }
        ]
    },
    {
        "id": "75a699a2ea4b4e7e85d563a8aca76edf",
        "word": "ozone-friendly",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌəʊzəʊn ˈfrendli/",
            "us": "/ˌəʊzəʊn ˈfrendli/"
        },
        "nearby": [
            {
                "word": "the Ozark Mountains",
                "pos": ""
            },
            {
                "word": "ozone",
                "pos": "noun"
            },
            {
                "word": "ozone-friendly",
                "pos": "adjective"
            },
            {
                "word": "ozone hole",
                "pos": "noun"
            },
            {
                "word": "ozone layer",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "not containing substances that will damage the ozone layer",
                    "vi": "không chứa các chất sẽ làm hỏng tầng ozon"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "01fed1cfac03474a81011460c2715e5d",
        "word": "ozone hole",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈəʊzəʊn həʊl/",
            "us": "/ˈəʊzəʊn həʊl/"
        },
        "nearby": [
            {
                "word": "ozone",
                "pos": "noun"
            },
            {
                "word": "ozone-friendly",
                "pos": "adjective"
            },
            {
                "word": "ozone hole",
                "pos": "noun"
            },
            {
                "word": "ozone layer",
                "pos": "noun"
            },
            {
                "word": "Ozymandias",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an area in the ozone layer where the amount of ozone has been very much reduced so that harmful radiation from the sun can pass through it",
                    "vi": "một khu vực trong tầng ôzôn nơi lượng ôzôn đã bị giảm đi rất nhiều để bức xạ có hại từ mặt trời có thể đi qua nó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "6e446c4244e74e5999307f895cffab05",
        "word": "particulate",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/pɑːˈtɪkjələt/",
            "us": "/pɑːrˈtɪkjələt/"
        },
        "nearby": [
            {
                "word": "particularize",
                "pos": "verb"
            },
            {
                "word": "particularly",
                "pos": "adverb"
            },
            {
                "word": "particulate",
                "pos": "adjective"
            },
            {
                "word": "particulate",
                "pos": "noun"
            },
            {
                "word": "parting",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "relating to, or in the form of, particles",
                    "vi": "liên quan đến, hoặc ở dạng các hạt"
                },
                "examples": [
                    {
                        "en": "particulate pollution",
                        "vi": "ô nhiễm dạng hạt"
                    }
                ]
            }
        ]
    },
    {
        "id": "cc82aa3be4764940892be852221018cb",
        "word": "particulate",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/pɑːˈtɪkjələt/",
            "us": "/pɑːrˈtɪkjələt/"
        },
        "nearby": [
            {
                "word": "particularly",
                "pos": "adverb"
            },
            {
                "word": "particulate",
                "pos": "adjective"
            },
            {
                "word": "particulate",
                "pos": "noun"
            },
            {
                "word": "parting",
                "pos": "noun"
            },
            {
                "word": "parting",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "matter in the form of particles",
                    "vi": "vật chất ở dạng hạt"
                },
                "examples": [
                    {
                        "en": "the effects of diesel particulates on human health",
                        "vi": "ảnh hưởng của các hạt diesel đối với sức khỏe con người"
                    }
                ]
            }
        ]
    },
    {
        "id": "1e8cb82861b449279f477529443a123c",
        "word": "PET",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌpiː iː ˈtiː/",
            "us": "/ˌpiː iː ˈtiː/"
        },
        "nearby": [
            {
                "word": "pet",
                "pos": "verb"
            },
            {
                "word": "pet",
                "pos": "adjective"
            },
            {
                "word": "PET",
                "pos": "noun"
            },
            {
                "word": "PETA",
                "pos": ""
            },
            {
                "word": "peta-",
                "pos": "combining form"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an artificial substance used to make materials for packaging food, including plastic drinks bottles (the abbreviation for ‘polyethylene terephthalate’)",
                    "vi": "một chất nhân tạo được sử dụng để làm vật liệu đóng gói thực phẩm, bao gồm cả chai nhựa đựng đồ uống (tên viết tắt của 'polyethylene terephthalate')"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a process that produces an image of your brain or of another part inside your body (the abbreviation for ‘positron emission tomography’)",
                    "vi": "một quá trình tạo ra hình ảnh của não bạn hoặc bộ phận khác bên trong cơ thể bạn (viết tắt của 'chụp cắt lớp phát xạ positron')"
                },
                "examples": [
                    {
                        "en": "a PET scan",
                        "vi": "quét PET"
                    }
                ]
            },
            {
                "define": {
                    "en": "a British test, now called ‘B1 Preliminary’, that measures a person’s ability to speak and write English as a foreign language at an intermediate level (the abbreviation for ‘Preliminary English Test’)",
                    "vi": "một bài kiểm tra của Anh, hiện được gọi là 'B1 Sơ bộ', đo lường khả năng nói và viết tiếng Anh như một ngoại ngữ của một người ở trình độ trung cấp (viết tắt của 'Bài kiểm tra tiếng Anh sơ bộ')"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "47587d95b2b049f4993c682a1ea0f9f4",
        "word": "plume",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/pluːm/",
            "us": "/pluːm/"
        },
        "nearby": [
            {
                "word": "plumbing",
                "pos": "noun"
            },
            {
                "word": "plumb line",
                "pos": "noun"
            },
            {
                "word": "plume",
                "pos": "noun"
            },
            {
                "word": "plumed",
                "pos": "adjective"
            },
            {
                "word": "plummet",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a cloud of something that rises and curves upwards in the air",
                    "vi": "một đám mây của cái gì đó bay lên và cong lên trong không khí"
                },
                "examples": [
                    {
                        "en": "a plume of smoke",
                        "vi": "một đám khói"
                    },
                    {
                        "en": "A radioactive plume could reach the city within hours.",
                        "vi": "Một chùm phóng xạ có thể đến thành phố trong vòng vài giờ."
                    },
                    {
                        "en": "A great plume of dust and ash rose from the volcano.",
                        "vi": "Một đám bụi lớn và tro bụi bốc lên từ núi lửa."
                    },
                    {
                        "en": "The waves pounded the rocks, throwing up white plumes of spray.",
                        "vi": "Sóng vỗ vào đá, tung lên những tia nước trắng xóa."
                    }
                ]
            },
            {
                "define": {
                    "en": "a large feather",
                    "vi": "một chiếc lông lớn"
                },
                "examples": [
                    {
                        "en": "a black hat with an ostrich plume",
                        "vi": "một chiếc mũ đen có chùm lông đà điểu"
                    }
                ]
            },
            {
                "define": {
                    "en": "a group of feathers or long thin pieces of material tied together and often used as a decoration",
                    "vi": "một nhóm lông vũ hoặc các mảnh vật liệu dài mỏng được buộc lại với nhau và thường được sử dụng như một vật trang trí"
                },
                "examples": [
                    {
                        "en": "The red plume on the horse’s head was nodding to the rhythm of its steps.",
                        "vi": "Chiếc chùm lông đỏ trên đầu con ngựa đang gật gù theo nhịp bước của nó."
                    }
                ]
            }
        ]
    },
    {
        "id": "532f7f8877a94c84ad1d33f0e0efe94d",
        "word": "slick",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/slɪk/",
            "us": "/slɪk/"
        },
        "nearby": [
            {
                "word": "slice off",
                "pos": "phrasal verb"
            },
            {
                "word": "slick",
                "pos": "adjective"
            },
            {
                "word": "slick",
                "pos": "noun"
            },
            {
                "word": "slick",
                "pos": "verb"
            },
            {
                "word": "slicker",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an area of oil that is floating on the surface of the sea",
                    "vi": "một vùng dầu nổi trên mặt biển"
                },
                "examples": [
                    {
                        "en": "a 50 km slick from the damaged tanker",
                        "vi": "vết loang 50 km từ chiếc tàu chở dầu bị hư hỏng"
                    }
                ]
            },
            {
                "define": {
                    "en": "a small area of something wet and shiny",
                    "vi": "một khu vực nhỏ của một cái gì đó ẩm ướt và sáng bóng"
                },
                "examples": [
                    {
                        "en": "a slick of sweat",
                        "vi": "một giọt mồ hôi"
                    }
                ]
            }
        ]
    },
    {
        "id": "0f4bd66ff7a74a56ba2c525cac84379d",
        "word": "soot",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/sʊt/",
            "us": "/sʊt/"
        },
        "nearby": [
            {
                "word": "sook",
                "pos": "noun"
            },
            {
                "word": "soon",
                "pos": "adverb"
            },
            {
                "word": "soot",
                "pos": "noun"
            },
            {
                "word": "soothe",
                "pos": "verb"
            },
            {
                "word": "soothe away",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "black powder that is produced when wood, coal, etc. is burnt",
                    "vi": "bột màu đen được tạo ra khi gỗ, than đá, v.v. bị cháy"
                },
                "examples": [
                    {
                        "en": "The fireplace was blackened with soot.",
                        "vi": "Lò sưởi bị muội than đen."
                    },
                    {
                        "en": "a cloud of smoke and soot",
                        "vi": "một đám khói và bồ hóng"
                    },
                    {
                        "en": "Her face was streaked with soot.",
                        "vi": "Khuôn mặt cô ấy loang lổ vết muội than."
                    }
                ]
            }
        ]
    },
    {
        "id": "33a6e82eabd644d8bf1b63bf7c2f432b",
        "word": "toxicity",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/tɒkˈsɪsəti/",
            "us": "/tɑːkˈsɪsəti/"
        },
        "nearby": [
            {
                "word": "toxaemia",
                "pos": "noun"
            },
            {
                "word": "toxic",
                "pos": "adjective"
            },
            {
                "word": "toxicity",
                "pos": "noun"
            },
            {
                "word": "toxic masculinity",
                "pos": "noun"
            },
            {
                "word": "toxicological",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the fact of being poisonous; the extent to which something is poisonous",
                    "vi": "thực tế là độc hại; mức độ độc hại của một thứ gì đó"
                },
                "examples": [
                    {
                        "en": "substances with high levels of toxicity",
                        "vi": "chất có mức độ độc hại cao"
                    }
                ]
            },
            {
                "define": {
                    "en": "the effect that a poisonous substance has",
                    "vi": "tác động của một chất độc"
                },
                "examples": [
                    {
                        "en": "Minor toxicities of this drug include nausea and vomiting.",
                        "vi": "Độc tính nhỏ của thuốc này bao gồm buồn nôn và nôn."
                    }
                ]
            },
            {
                "define": {
                    "en": "the quality of being very harmful or unpleasant",
                    "vi": "chất lượng rất có hại hoặc khó chịu"
                },
                "examples": [
                    {
                        "en": "Staff members spoke about a culture of toxicity and abuse in the workplace.",
                        "vi": "Các nhân viên đã nói về văn hóa độc hại và lạm dụng ở nơi làm việc."
                    }
                ]
            }
        ]
    },
    {
        "id": "915594dae45d4273874ab1e9e152a87d",
        "word": "unleaded",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌʌnˈledɪd/",
            "us": "/ˌʌnˈledɪd/"
        },
        "nearby": [
            {
                "word": "unlawful killing",
                "pos": "noun"
            },
            {
                "word": "unlawfully",
                "pos": "adverb"
            },
            {
                "word": "unleaded",
                "pos": "noun"
            },
            {
                "word": "unleaded",
                "pos": "adjective"
            },
            {
                "word": "unlearn",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "petrol that does not contain lead and is therefore less harmful to the environment",
                    "vi": "xăng không chứa chì và do đó ít gây hại cho môi trường"
                },
                "examples": [
                    {
                        "en": "Unleaded is cheaper than diesel.",
                        "vi": "Không chì rẻ hơn dầu diesel."
                    }
                ]
            }
        ]
    },
    {
        "id": "faef9bfe60f646ecb1d098e5604dfad7",
        "word": "unleaded",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌʌnˈledɪd/",
            "us": "/ˌʌnˈledɪd/"
        },
        "nearby": [
            {
                "word": "unlawfully",
                "pos": "adverb"
            },
            {
                "word": "unleaded",
                "pos": "noun"
            },
            {
                "word": "unleaded",
                "pos": "adjective"
            },
            {
                "word": "unlearn",
                "pos": "verb"
            },
            {
                "word": "unleash",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "not containing lead and therefore less harmful to the environment",
                    "vi": "không chứa chì và do đó ít gây hại cho môi trường"
                },
                "examples": []
            }
        ]
    }
]