[
    {
        "id": "b2d9311c5fc844fda9915bd70e5e03d6",
        "word": "book",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/bʊk/",
            "us": "/bʊk/"
        },
        "nearby": [
            {
                "word": "boogie board",
                "pos": "noun"
            },
            {
                "word": "boohoo",
                "pos": "exclamation"
            },
            {
                "word": "book",
                "pos": "noun"
            },
            {
                "word": "book",
                "pos": "verb"
            },
            {
                "word": "bookable",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a set of printed pages that are fastened inside a cover so that you can turn them and read them",
                    "vi": "một tập hợp các trang in được gắn chặt bên trong bìa để bạn có thể lật chúng ra và đọc"
                },
                "examples": [
                    {
                        "en": "His desk was covered with piles of books.",
                        "vi": "Bàn làm việc của anh ta chất đầy sách."
                    },
                    {
                        "en": "hardback/paperback books",
                        "vi": "sách bìa cứng / bìa mềm"
                    },
                    {
                        "en": "a book of short stories",
                        "vi": "một cuốn sách truyện ngắn"
                    }
                ]
            },
            {
                "define": {
                    "en": "a written work published in printed or electronic form",
                    "vi": "một tác phẩm viết được xuất bản dưới dạng in hoặc điện tử"
                },
                "examples": [
                    {
                        "en": "to read/write/publish a book",
                        "vi": "để đọc / viết / xuất bản một cuốn sách"
                    },
                    {
                        "en": "reference/children's/library books",
                        "vi": "sách tham khảo / dành cho trẻ em / thư viện"
                    },
                    {
                        "en": "book by somebody a new book by J. K. Rowling",
                        "vi": "sách của ai đó một cuốn sách mới của JK Rowling"
                    },
                    {
                        "en": "book about something a book about wildlife",
                        "vi": "sách về điều gì đó sách về động vật hoang dã"
                    },
                    {
                        "en": "book on something He has written a book on local architecture.",
                        "vi": "cuốn sách về điều gì đó Anh ấy đã viết một cuốn sách về kiến trúc địa phương."
                    }
                ]
            },
            {
                "define": {
                    "en": "a set of sheets of paper that are fastened together inside a cover and used for writing in",
                    "vi": "một tập hợp các tờ giấy được gắn chặt với nhau bên trong bìa và dùng để viết"
                },
                "examples": [
                    {
                        "en": "an exercise book",
                        "vi": "một cuốn sách bài tập"
                    },
                    {
                        "en": "a notebook",
                        "vi": "quyển sổ"
                    }
                ]
            },
            {
                "define": {
                    "en": "a set of things that are fastened together like a book",
                    "vi": "một tập hợp những thứ được gắn chặt với nhau như một cuốn sách"
                },
                "examples": [
                    {
                        "en": "a book of stamps/tickets/matches",
                        "vi": "một cuốn tem / vé / trận đấu"
                    },
                    {
                        "en": "a chequebook",
                        "vi": "Sổ kiểm tra"
                    }
                ]
            },
            {
                "define": {
                    "en": "the written records of the financial affairs of a business",
                    "vi": "hồ sơ bằng văn bản về các vấn đề tài chính của một doanh nghiệp"
                },
                "examples": [
                    {
                        "en": "to do the books (= to check the accounts)",
                        "vi": "để làm sổ sách (= để kiểm tra tài khoản)"
                    },
                    {
                        "en": "You need to go over the books again; there’s a mistake somewhere.",
                        "vi": "Bạn cần phải xem lại các cuốn sách; có sự nhầm lẫn ở đâu đó."
                    },
                    {
                        "en": "She does the books for us.",
                        "vi": "Cô ấy làm những cuốn sách cho chúng tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a section of a large written work",
                    "vi": "một phần của một tác phẩm lớn bằng văn bản"
                },
                "examples": [
                    {
                        "en": "the books of the Bible",
                        "vi": "sách kinh thánh"
                    }
                ]
            },
            {
                "define": {
                    "en": "a record of bets made on whether something will happen, somebody will win a race, etc.",
                    "vi": "kỷ lục đặt cược về việc liệu điều gì đó sẽ xảy ra, ai đó sẽ thắng trong cuộc đua, v.v."
                },
                "examples": [
                    {
                        "en": "They’ve opened a book on who’ll win the Championship.",
                        "vi": "Họ đã mở một cuốn sách về ai sẽ giành chức vô địch."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that somebody is pleased/annoyed with you",
                    "vi": "từng nói rằng ai đó hài lòng / khó chịu với bạn"
                },
                "examples": [
                    {
                        "en": "I'm in her good books at the moment because I cleared up the kitchen.",
                        "vi": "Tôi đang ở trong những cuốn sách hay của cô ấy vào lúc này vì tôi đã dọn dẹp nhà bếp."
                    }
                ]
            },
            {
                "define": {
                    "en": "to punish somebody for doing something wrong and make them explain their behaviour",
                    "vi": "trừng phạt ai đó vì đã làm điều gì đó sai và bắt họ giải thích hành vi của mình"
                },
                "examples": [
                    {
                        "en": "We will ensure that people who commit fraud are brought to book through the courts.",
                        "vi": "Chúng tôi sẽ đảm bảo rằng những người có hành vi gian lận sẽ bị đưa ra tòa án."
                    }
                ]
            },
            {
                "define": {
                    "en": "following rules and instructions in a very strict way",
                    "vi": "tuân theo các quy tắc và hướng dẫn một cách rất nghiêm ngặt"
                },
                "examples": [
                    {
                        "en": "She always does everything by the book.",
                        "vi": "Cô ấy luôn làm mọi thứ theo cuốn sách."
                    }
                ]
            },
            {
                "define": {
                    "en": "to stop doing something because you no longer believe you will be successful or will find a solution",
                    "vi": "ngừng làm điều gì đó bởi vì bạn không còn tin rằng mình sẽ thành công hoặc sẽ tìm ra giải pháp"
                },
                "examples": [
                    {
                        "en": "The police have closed the book on the case (= they have stopped trying to solve it).",
                        "vi": "Cảnh sát đã đóng sổ về vụ án (= họ đã ngừng cố gắng giải quyết nó)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a subject or person that you know nothing about",
                    "vi": "một chủ đề hoặc một người mà bạn không biết gì về nó"
                },
                "examples": [
                    {
                        "en": "Nuclear physics is a closed book to most of us.",
                        "vi": "Vật lý hạt nhân là một cuốn sách gần gũi với hầu hết chúng ta."
                    }
                ]
            },
            {
                "define": {
                    "en": "to change facts or figures dishonestly or illegally",
                    "vi": "thay đổi sự kiện hoặc số liệu một cách không trung thực hoặc bất hợp pháp"
                },
                "examples": [
                    {
                        "en": "His accountant had been cooking the books for years.",
                        "vi": "Kế toán của ông đã nấu những cuốn sách trong nhiều năm."
                    },
                    {
                        "en": "Someone was cooking the books.",
                        "vi": "Ai đó đang nấu những cuốn sách."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that you should not form an opinion about somebody/something from their appearance only",
                    "vi": "được sử dụng để nói rằng bạn không nên hình thành ý kiến về ai đó / điều gì đó chỉ từ vẻ ngoài của họ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "every available method, whether it is honest or not",
                    "vi": "mọi phương pháp có sẵn, cho dù nó có trung thực hay không"
                },
                "examples": [
                    {
                        "en": "He'll try every trick in the book to stop you from winning.",
                        "vi": "Anh ấy sẽ thử mọi thủ thuật trong sách để ngăn bạn chiến thắng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be reading",
                    "vi": "được đọc"
                },
                "examples": [
                    {
                        "en": "She always has her nose in a book.",
                        "vi": "Cô ấy luôn chúi mũi vào một cuốn sách."
                    }
                ]
            },
            {
                "define": {
                    "en": "the record of great achievements in history",
                    "vi": "kỷ lục của những thành tựu vĩ đại trong lịch sử"
                },
                "examples": [
                    {
                        "en": "She has earned her place in the history books.",
                        "vi": "Cô ấy đã giành được vị trí của mình trong sử sách."
                    }
                ]
            },
            {
                "define": {
                    "en": "used when you are giving your opinion",
                    "vi": "được sử dụng khi bạn đưa ra ý kiến của mình"
                },
                "examples": [
                    {
                        "en": "That's cheating in my book.",
                        "vi": "Đó là gian lận trong cuốn sách của tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "(to be) on an organization’s list, for example of people who are available for a particular type of work",
                    "vi": "(được) trong danh sách của một tổ chức, ví dụ như những người sẵn sàng cho một loại công việc cụ thể"
                },
                "examples": [
                    {
                        "en": "We have very few nurses on our books at the moment.",
                        "vi": "Chúng tôi có rất ít y tá trên sổ sách của chúng tôi vào lúc này."
                    },
                    {
                        "en": "Most of the houses on our books are in the north of the city.",
                        "vi": "Hầu hết các ngôi nhà trên sách của chúng tôi đều ở phía bắc thành phố."
                    },
                    {
                        "en": "We have fifty people on the books.",
                        "vi": "Chúng tôi có năm mươi người trên các cuốn sách."
                    }
                ]
            },
            {
                "define": {
                    "en": "if you describe somebody or their life as an open book, you mean that you can easily understand them and know everything about them",
                    "vi": "nếu bạn mô tả ai đó hoặc cuộc sống của họ như một cuốn sách mở, bạn có nghĩa là bạn có thể dễ dàng hiểu họ và biết mọi thứ về họ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to understand easily what somebody is thinking or feeling",
                    "vi": "để hiểu một cách dễ dàng những gì ai đó đang nghĩ hoặc cảm thấy"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be convenient or useful for you/somebody",
                    "vi": "để thuận tiện hoặc hữu ích cho bạn / ai đó"
                },
                "examples": [
                    {
                        "en": "Well, if you’re honest and hard-working, that suits our book.",
                        "vi": "Chà, nếu bạn trung thực và chăm chỉ, điều đó phù hợp với cuốn sách của chúng tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to copy somebody’s behaviour and do things in the same way that they do, because they are successful",
                    "vi": "sao chép hành vi của ai đó và làm mọi việc theo cách giống như cách họ làm, bởi vì họ đã thành công"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to punish somebody who has committed an offence as severely as possible",
                    "vi": "trừng phạt ai đó đã phạm tội càng nghiêm khắc càng tốt"
                },
                "examples": [
                    {
                        "en": "‘Get this man down to the station and throw the book at him!’ yelled Curtis.",
                        "vi": "Đưa người đàn ông này xuống ga và ném cuốn sách vào anh ta!' Curtis hét lên."
                    }
                ]
            }
        ]
    },
    {
        "id": "375804628cc243e98369b6345f37245e",
        "word": "classroom",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/ˈklɑːsruːm/",
            "us": "/ˈklæsruːm/"
        },
        "nearby": [
            {
                "word": "classlessness",
                "pos": "noun"
            },
            {
                "word": "classmate",
                "pos": "noun"
            },
            {
                "word": "classroom",
                "pos": "noun"
            },
            {
                "word": "class struggle",
                "pos": "noun"
            },
            {
                "word": "class war",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a room where a class of children or students is taught",
                    "vi": "một căn phòng nơi một lớp học của trẻ em hoặc học sinh được dạy"
                },
                "examples": [
                    {
                        "en": "classroom activities",
                        "vi": "Hoạt động lớp học"
                    },
                    {
                        "en": "classroom teaching/teachers",
                        "vi": "giảng dạy trên lớp / giáo viên"
                    },
                    {
                        "en": "in the classroom the use of computers in the classroom",
                        "vi": "trong lớp học việc sử dụng máy tính trong lớp học"
                    }
                ]
            }
        ]
    },
    {
        "id": "8f00e41e5696483392bb0632ce984735",
        "word": "desk",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/desk/",
            "us": "/desk/"
        },
        "nearby": [
            {
                "word": "desirous",
                "pos": "adjective"
            },
            {
                "word": "desist",
                "pos": "verb"
            },
            {
                "word": "desk",
                "pos": "noun"
            },
            {
                "word": "desk clerk",
                "pos": "noun"
            },
            {
                "word": "deskill",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a piece of furniture like a table, often with drawers (= parts like boxes in it with handles on the front for pulling them open), that you sit at to read, write, work, etc.",
                    "vi": "một món đồ nội thất như bàn, thường có ngăn kéo (= các bộ phận như hộp trong đó có tay cầm ở mặt trước để kéo chúng ra) mà bạn ngồi để đọc, viết, làm việc, v.v."
                },
                "examples": [
                    {
                        "en": "at a desk I spend all day sitting at a desk.",
                        "vi": "tại bàn làm việc, tôi dành cả ngày để ngồi vào bàn."
                    },
                    {
                        "en": "behind a desk The mayor sat behind his desk.",
                        "vi": "sau bàn làm việc Thị trưởng ngồi sau bàn làm việc của mình."
                    },
                    {
                        "en": "a desk drawer/lamp/calendar",
                        "vi": "ngăn bàn / đèn / lịch"
                    },
                    {
                        "en": "He abandoned a career at sea for a desk job.",
                        "vi": "Anh từ bỏ sự nghiệp trên biển để làm công việc bàn giấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "a place where you can get information or be served at an airport, a hotel, etc.",
                    "vi": "nơi bạn có thể nhận thông tin hoặc được phục vụ tại sân bay, khách sạn, v.v."
                },
                "examples": [
                    {
                        "en": "at a desk There was a long queue at the check-in desk.",
                        "vi": "tại bàn làm việc Có một hàng dài xếp hàng dài ở bàn làm thủ tục."
                    },
                    {
                        "en": "behind a desk The girl behind the reception desk was always on the phone.",
                        "vi": "Cô gái ngồi sau bàn tiếp tân luôn nghe điện thoại."
                    },
                    {
                        "en": "on a desk We asked the man on the information desk for a map of the city.",
                        "vi": "trên bàn làm việc Chúng tôi hỏi người đàn ông trên bàn thông tin về bản đồ của thành phố."
                    }
                ]
            },
            {
                "define": {
                    "en": "an office at a newspaper, television company, etc. that deals with a particular subject",
                    "vi": "văn phòng tại một tờ báo, công ty truyền hình, v.v. liên quan đến một chủ đề cụ thể"
                },
                "examples": [
                    {
                        "en": "the sports desk",
                        "vi": "bàn thể thao"
                    }
                ]
            }
        ]
    },
    {
        "id": "276d60a9075649e798da870b9f3d8d86",
        "word": "dictionary",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/ˈdɪkʃənri/",
            "us": "/ˈdɪkʃəneri/"
        },
        "nearby": [
            {
                "word": "dictatorship",
                "pos": "noun"
            },
            {
                "word": "diction",
                "pos": "noun"
            },
            {
                "word": "dictionary",
                "pos": "noun"
            },
            {
                "word": "A Dictionary of Modern English Usage",
                "pos": ""
            },
            {
                "word": "The Dictionary of National Biography",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a book or electronic resource that gives a list of the words of a language in alphabetical order and explains what they mean, or gives a word for them in a foreign language",
                    "vi": "một cuốn sách hoặc tài nguyên điện tử cung cấp danh sách các từ của một ngôn ngữ theo thứ tự bảng chữ cái và giải thích ý nghĩa của chúng hoặc cung cấp một từ cho chúng bằng tiếng nước ngoài"
                },
                "examples": [
                    {
                        "en": "a Spanish-English dictionary",
                        "vi": "một từ điển Tây Ban Nha-Anh"
                    },
                    {
                        "en": "a slang dictionary",
                        "vi": "một từ điển tiếng lóng"
                    },
                    {
                        "en": "a dictionary of slang",
                        "vi": "từ điển tiếng lóng"
                    },
                    {
                        "en": "in a dictionary If you don't know the meaning of a word, look it up in the dictionary.",
                        "vi": "trong từ điển Nếu bạn không biết nghĩa của một từ, hãy tra nó trong từ điển."
                    }
                ]
            },
            {
                "define": {
                    "en": "a book that explains the words that are used in a particular subject",
                    "vi": "một cuốn sách giải thích các từ được sử dụng trong một chủ đề cụ thể"
                },
                "examples": [
                    {
                        "en": "a dictionary of mathematics",
                        "vi": "từ điển toán học"
                    },
                    {
                        "en": "I decided to consult a medical dictionary.",
                        "vi": "Tôi quyết định tham khảo một từ điển y học."
                    }
                ]
            },
            {
                "define": {
                    "en": "a list of words in electronic form, for example stored in a computer’s spellchecker",
                    "vi": "danh sách các từ ở dạng điện tử, chẳng hạn được lưu trữ trong trình kiểm tra chính tả của máy tính"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "fb399cb6b6f046ab96b246a1dbf753ba",
        "word": "gym",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/dʒɪm/",
            "us": "/dʒɪm/"
        },
        "nearby": [
            {
                "word": "gybe",
                "pos": "verb"
            },
            {
                "word": "gybe",
                "pos": "noun"
            },
            {
                "word": "gym",
                "pos": "noun"
            },
            {
                "word": "gymkhana",
                "pos": "noun"
            },
            {
                "word": "gymnasium",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a room or hall with equipment for doing physical exercise, for example in a school",
                    "vi": "một phòng hoặc hội trường có thiết bị để tập thể dục, ví dụ như trong trường học"
                },
                "examples": [
                    {
                        "en": "The school has recently built a new gym.",
                        "vi": "Trường gần đây đã xây dựng một phòng tập thể dục mới."
                    },
                    {
                        "en": "in a gym to play basketball in the gym",
                        "vi": "trong phòng tập thể dục để chơi bóng rổ trong phòng tập thể dục"
                    }
                ]
            },
            {
                "define": {
                    "en": "a private club where people go to do physical exercise in order to stay or become healthy and fit",
                    "vi": "một câu lạc bộ tư nhân, nơi mọi người đến tập thể dục để duy trì hoặc trở nên khỏe mạnh và phù hợp"
                },
                "examples": [
                    {
                        "en": "I just joined a gym.",
                        "vi": "Tôi vừa tham gia một phòng tập thể dục."
                    },
                    {
                        "en": "at a gym I work out at the gym most days.",
                        "vi": "tại một phòng tập thể dục, tôi tập thể dục ở phòng tập thể dục hầu hết các ngày."
                    }
                ]
            },
            {
                "define": {
                    "en": "physical exercises done in a gym, especially at school",
                    "vi": "các bài tập thể dục được thực hiện trong phòng tập thể dục, đặc biệt là ở trường"
                },
                "examples": [
                    {
                        "en": "I don't enjoy gym.",
                        "vi": "Tôi không thích tập gym."
                    },
                    {
                        "en": "gym shoes",
                        "vi": "giày thể dục"
                    }
                ]
            }
        ]
    },
    {
        "id": "052a3a005af740b6a627dd1041eb432e",
        "word": "library",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/ˈlaɪbrəri/",
            "us": "/ˈlaɪbreri/"
        },
        "nearby": [
            {
                "word": "librarian",
                "pos": "noun"
            },
            {
                "word": "librarianship",
                "pos": "noun"
            },
            {
                "word": "library",
                "pos": "noun"
            },
            {
                "word": "the Library of Congress",
                "pos": "noun"
            },
            {
                "word": "librettist",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a building in which collections of books, newspapers, etc. and sometimes films and recorded music are kept for people to read, study or borrow",
                    "vi": "một tòa nhà trong đó các bộ sưu tập sách, báo, v.v. và đôi khi là phim và nhạc thu âm được lưu giữ để mọi người đọc, nghiên cứu hoặc mượn"
                },
                "examples": [
                    {
                        "en": "a public/university/school library",
                        "vi": "thư viện công cộng / đại học / trường học"
                    },
                    {
                        "en": "a library book",
                        "vi": "một cuốn sách thư viện"
                    },
                    {
                        "en": "a toy library (= for borrowing toys from)",
                        "vi": "thư viện đồ chơi (= để mượn đồ chơi từ)"
                    },
                    {
                        "en": "How often do you go to the library?",
                        "vi": "Bạn đến thư viện thường xuyên như thế nào?"
                    },
                    {
                        "en": "You can borrow it from your local library.",
                        "vi": "Bạn có thể mượn nó từ thư viện địa phương của bạn."
                    },
                    {
                        "en": "I got this very interesting book out of the library.",
                        "vi": "Tôi đã nhận được cuốn sách rất thú vị này từ thư viện."
                    },
                    {
                        "en": "a plan to provide mobile library services in rural environments",
                        "vi": "kế hoạch cung cấp dịch vụ thư viện di động trong môi trường nông thôn"
                    }
                ]
            },
            {
                "define": {
                    "en": "a collection of books, newspapers, films, recorded music, etc. held in a library or stored in digital form",
                    "vi": "một bộ sưu tập sách, báo, phim, đĩa nhạc, v.v. được lưu trữ trong thư viện hoặc được lưu trữ dưới dạng kỹ thuật số"
                },
                "examples": [
                    {
                        "en": "a music/photo library",
                        "vi": "một thư viện âm nhạc / ảnh"
                    },
                    {
                        "en": "The Media Centre houses a digital library of radio and television programmes.",
                        "vi": "Trung tâm Truyền thông có một thư viện kỹ thuật số các chương trình phát thanh và truyền hình."
                    }
                ]
            },
            {
                "define": {
                    "en": "a room in a large house where most of the books are kept",
                    "vi": "một căn phòng trong một ngôi nhà lớn, nơi hầu hết các cuốn sách được lưu giữ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a personal collection of books, music recordings, etc.",
                    "vi": "một bộ sưu tập sách cá nhân, bản ghi âm nhạc, v.v."
                },
                "examples": [
                    {
                        "en": "a new edition to add to your library",
                        "vi": "một ấn bản mới để thêm vào thư viện của bạn"
                    },
                    {
                        "en": "The family possessed an extensive library.",
                        "vi": "Gia đình sở hữu một thư viện rộng lớn."
                    },
                    {
                        "en": "She had built up an impressive library of art books.",
                        "vi": "Cô đã xây dựng một thư viện sách nghệ thuật ấn tượng."
                    },
                    {
                        "en": "a personal library of over 1 000 volumes",
                        "vi": "một thư viện cá nhân với hơn 1000 đầu sách"
                    }
                ]
            },
            {
                "define": {
                    "en": "a series of books, recordings, etc. produced by the same company and similar in appearance",
                    "vi": "một loạt sách, bản ghi âm, v.v. do cùng một công ty sản xuất và có hình thức giống nhau"
                },
                "examples": [
                    {
                        "en": "a library of children’s classics",
                        "vi": "thư viện kinh điển dành cho trẻ em"
                    }
                ]
            }
        ]
    },
    {
        "id": "c500ce7d62a54701bcceb3ab97eb56a7",
        "word": "board",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/bɔːd/",
            "us": "/bɔːrd/"
        },
        "nearby": [
            {
                "word": "Boadicea",
                "pos": ""
            },
            {
                "word": "boar",
                "pos": "noun"
            },
            {
                "word": "board",
                "pos": "noun"
            },
            {
                "word": "board",
                "pos": "verb"
            },
            {
                "word": "boarder",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a long thin piece of strong hard material, especially wood, used, for example, for making floors, building walls and roofs and making boats",
                    "vi": "Ví dụ như một mảnh dài mỏng bằng vật liệu cứng chắc, đặc biệt là gỗ, được sử dụng để làm sàn, xây tường, mái nhà và làm thuyền"
                },
                "examples": [
                    {
                        "en": "He had ripped up the carpet, leaving only the bare boards.",
                        "vi": "Anh ta đã xé toạc tấm thảm, chỉ để lại những tấm ván trơ trọi."
                    },
                    {
                        "en": "She noticed a loose board in the fence.",
                        "vi": "Cô nhận thấy một tấm ván lỏng lẻo trong hàng rào."
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of wood, or other strong material, that is used for a special purpose",
                    "vi": "một mảnh gỗ, hoặc vật liệu chắc chắn khác, được sử dụng cho mục đích đặc biệt"
                },
                "examples": [
                    {
                        "en": "a whiteboard",
                        "vi": "bảng trắng"
                    },
                    {
                        "en": "I'll write it up on the board.",
                        "vi": "Tôi sẽ viết nó lên bảng."
                    },
                    {
                        "en": "(British English) a noticeboard",
                        "vi": "(Tiếng Anh Anh) một bảng thông báo"
                    },
                    {
                        "en": "(North American English) a bulletin board",
                        "vi": "(Tiếng Anh Bắc Mỹ) một bảng thông báo"
                    },
                    {
                        "en": "The exam results went up on the board.",
                        "vi": "Kết quả kỳ thi được đưa lên bảng."
                    },
                    {
                        "en": "a diving board",
                        "vi": "bảng lặn"
                    },
                    {
                        "en": "She jumped off the top board.",
                        "vi": "Cô ấy đã nhảy khỏi bảng trên cùng."
                    },
                    {
                        "en": "a chessboard",
                        "vi": "một bàn cờ"
                    },
                    {
                        "en": "He removed the figure from the board.",
                        "vi": "Anh ta xóa hình người khỏi bàn cờ."
                    }
                ]
            },
            {
                "define": {
                    "en": "the piece of equipment on which somebody stands in various water sports and in snowboarding and skateboarding",
                    "vi": "phần thiết bị mà trên đó ai đó đứng trong các môn thể thao dưới nước khác nhau và trượt tuyết và trượt ván"
                },
                "examples": [
                    {
                        "en": "You kick-turn with both feet on the board.",
                        "vi": "Bạn đá-quay bằng cả hai chân trên bàn cờ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a group of people who have power to make decisions and control a company or other organization",
                    "vi": "một nhóm người có quyền ra quyết định và kiểm soát một công ty hoặc tổ chức khác"
                },
                "examples": [
                    {
                        "en": "The board is/are unhappy about falling sales.",
                        "vi": "Hội đồng quản trị đang / không hài lòng về doanh số bán hàng giảm."
                    },
                    {
                        "en": "members of the board",
                        "vi": "thành viên của hội đồng quản trị"
                    },
                    {
                        "en": "on the board She has a seat on the board of directors.",
                        "vi": "on the board Cô ấy có một ghế trong ban giám đốc."
                    },
                    {
                        "en": "He has served on the editorial boards of several scientific journals.",
                        "vi": "Ông đã phục vụ trong ban biên tập của một số tạp chí khoa học."
                    },
                    {
                        "en": "She sits on various advisory boards.",
                        "vi": "Cô ấy ngồi trong các ban cố vấn khác nhau."
                    },
                    {
                        "en": "a board member/meeting",
                        "vi": "một thành viên hội đồng / cuộc họp"
                    },
                    {
                        "en": "discussions at board level",
                        "vi": "thảo luận ở cấp hội đồng quản trị"
                    },
                    {
                        "en": "board of somebody/something The decision was approved by the museum's board of trustees.",
                        "vi": "hội đồng quản trị của ai đó / cái gì đó Quyết định đã được thông qua bởi hội đồng quản trị của bảo tàng."
                    },
                    {
                        "en": "(North American English) the Board of Education (= a group of elected officials who are in charge of all the public schools in a particular area)",
                        "vi": "(Tiếng Anh Bắc Mỹ) Hội đồng Giáo dục (= một nhóm các quan chức được bầu cử phụ trách tất cả các trường công lập trong một khu vực cụ thể)"
                    }
                ]
            },
            {
                "define": {
                    "en": "used in the name of some organizations",
                    "vi": "được sử dụng trong tên của một số tổ chức"
                },
                "examples": [
                    {
                        "en": "the Welsh Tourist Board (= responsible for giving tourist information)",
                        "vi": "Ban du lịch xứ Wales (= chịu trách nhiệm cung cấp thông tin du lịch)"
                    }
                ]
            },
            {
                "define": {
                    "en": "the meals that are provided when you stay in a hotel, guest house, etc.; what you pay for the meals",
                    "vi": "các bữa ăn được cung cấp khi bạn ở trong khách sạn, nhà khách, v.v.; những gì bạn trả cho các bữa ăn"
                },
                "examples": [
                    {
                        "en": "He pays £90 a week board and lodging.",
                        "vi": "Anh ta trả 90 bảng một tuần cho hội đồng và chỗ ở."
                    }
                ]
            },
            {
                "define": {
                    "en": "exams that you take when you apply to go to college in the US",
                    "vi": "kỳ thi mà bạn thực hiện khi đăng ký vào đại học ở Hoa Kỳ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the stage in a theatre",
                    "vi": "sân khấu trong nhà hát"
                },
                "examples": [
                    {
                        "en": "His play is on the boards on Broadway.",
                        "vi": "Vở kịch của anh ấy nằm trên bảng ở Broadway."
                    },
                    {
                        "en": "She's treading the boards (= working as an actress).",
                        "vi": "Cô ấy đang giẫm chân lên bảng (= làm diễn viên)."
                    }
                ]
            },
            {
                "define": {
                    "en": "the low wooden wall surrounding the area where a game of ice hockey is played",
                    "vi": "bức tường gỗ thấp bao quanh khu vực chơi khúc côn cầu trên băng"
                },
                "examples": [
                    {
                        "en": "The puck went wide, hitting the boards.",
                        "vi": "Puck đi rộng, đập vào các tấm ván."
                    }
                ]
            },
            {
                "define": {
                    "en": "involving everyone or everything in a company, an industry, etc.",
                    "vi": "liên quan đến mọi người hoặc mọi thứ trong một công ty, một ngành, v.v."
                },
                "examples": [
                    {
                        "en": "The industry needs more investment across the board.",
                        "vi": "Ngành công nghiệp này cần đầu tư nhiều hơn trên diện rộng."
                    },
                    {
                        "en": "an across-the-board wage increase",
                        "vi": "tăng lương trên diện rộng"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be rejected or ignored; to be no longer possible",
                    "vi": "bị từ chối hoặc bị bỏ qua; không còn có thể"
                },
                "examples": [
                    {
                        "en": "All her efforts to be polite went by the board and she started to shout.",
                        "vi": "Tất cả những nỗ lực của cô ấy để trở nên lịch sự đã bị ban giám đốc và cô ấy bắt đầu hét lên."
                    }
                ]
            },
            {
                "define": {
                    "en": "on or in a ship, an aircraft or a train",
                    "vi": "trên hoặc trong một con tàu, một chiếc máy bay hoặc một chuyến tàu"
                },
                "examples": [
                    {
                        "en": "Have the passengers gone on board yet?",
                        "vi": "Hành khách đã lên máy bay chưa?"
                    }
                ]
            },
            {
                "define": {
                    "en": "giving your support to an idea or a project",
                    "vi": "hỗ trợ bạn cho một ý tưởng hoặc một dự án"
                },
                "examples": [
                    {
                        "en": "We must get more sponsors on board.",
                        "vi": "Chúng ta phải có thêm nhiều nhà tài trợ trên tàu."
                    },
                    {
                        "en": "You need to bring the whole staff on board.",
                        "vi": "Bạn cần đưa toàn bộ nhân viên lên máy bay."
                    },
                    {
                        "en": "It’s good to have you on board (= working with us) for this project.",
                        "vi": "Thật tốt khi bạn tham gia (= làm việc với chúng tôi) cho dự án này."
                    }
                ]
            },
            {
                "define": {
                    "en": "to win all the prizes, etc. in a competition",
                    "vi": "để giành được tất cả các giải thưởng, v.v. trong một cuộc thi"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to accept and understand an idea or a suggestion",
                    "vi": "để chấp nhận và hiểu một ý tưởng hoặc một đề xuất"
                },
                "examples": [
                    {
                        "en": "I told her what I thought, but she didn't take my advice on board.",
                        "vi": "Tôi đã nói với cô ấy những gì tôi nghĩ, nhưng cô ấy không nghe theo lời khuyên của tôi."
                    }
                ]
            }
        ]
    },
    {
        "id": "292bc5ffe18e40d28c8963d7f748672b",
        "word": "ruler",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈruːlə(r)/",
            "us": "/ˈruːlər/"
        },
        "nearby": [
            {
                "word": "rule out",
                "pos": "phrasal verb"
            },
            {
                "word": "rule out of",
                "pos": "phrasal verb"
            },
            {
                "word": "ruler",
                "pos": "noun"
            },
            {
                "word": "ruling",
                "pos": "noun"
            },
            {
                "word": "ruling",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who rules or governs",
                    "vi": "một người cai trị hoặc quản lý"
                },
                "examples": [
                    {
                        "en": "He eventually became ruler over all Egypt.",
                        "vi": "Cuối cùng, ông trở thành người cai trị toàn bộ Ai Cập."
                    },
                    {
                        "en": "At that time the East India Company was the virtual ruler of Bengal.",
                        "vi": "Vào thời điểm đó, Công ty Đông Ấn là công ty thống trị ảo của Bengal."
                    },
                    {
                        "en": "The country was finally united under one ruler.",
                        "vi": "Đất nước cuối cùng đã được thống nhất dưới một người cai trị."
                    },
                    {
                        "en": "a ruler who held power for over twenty years",
                        "vi": "một người cai trị nắm quyền hơn hai mươi năm"
                    },
                    {
                        "en": "an absolute ruler who will tolerate no opposition",
                        "vi": "một người cai trị tuyệt đối, người sẽ không khoan nhượng với sự chống đối"
                    },
                    {
                        "en": "He established himself as ruler over both tribes.",
                        "vi": "Anh ta tự lập mình là người cai trị cả hai bộ tộc."
                    },
                    {
                        "en": "There was a successful coup against the country's military rulers.",
                        "vi": "Đã có một cuộc đảo chính thành công chống lại các nhà cầm quyền quân sự của đất nước."
                    },
                    {
                        "en": "Vietnam still had strong links with France, the former colonial ruler.",
                        "vi": "Việt Nam vẫn có mối liên hệ chặt chẽ với Pháp, nước cai trị thuộc địa cũ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a straight narrow piece of wood, plastic or metal, marked in centimetres or inches, used for measuring or for drawing straight lines",
                    "vi": "một mảnh gỗ, nhựa hoặc kim loại hẹp, thẳng, được đánh dấu bằng cm hoặc inch, được sử dụng để đo hoặc để vẽ các đường thẳng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "77aa7a85efde4395886cf0323d5ef6cf",
        "word": "blackboard",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈblækbɔːd/",
            "us": "/ˈblækbɔːrd/"
        },
        "nearby": [
            {
                "word": "blackberrying",
                "pos": "noun"
            },
            {
                "word": "blackbird",
                "pos": "noun"
            },
            {
                "word": "blackboard",
                "pos": "noun"
            },
            {
                "word": "black bottom",
                "pos": "noun"
            },
            {
                "word": "black box",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a large board with a smooth black or dark green surface that teachers write on with a piece of chalk",
                    "vi": "một bảng lớn với bề mặt nhẵn màu đen hoặc xanh lá cây đậm mà giáo viên viết trên đó bằng một mảnh phấn"
                },
                "examples": [
                    {
                        "en": "to write on the blackboard",
                        "vi": "viết lên bảng"
                    },
                    {
                        "en": "Please copy the homework from the blackboard.",
                        "vi": "Vui lòng sao chép bài tập về nhà từ bảng đen."
                    }
                ]
            }
        ]
    },
    {
        "id": "13dd1ec9d22843fda8ed4f4cdb068d54",
        "word": "canteen",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/kænˈtiːn/",
            "us": "/kænˈtiːn/"
        },
        "nearby": [
            {
                "word": "cantankerous",
                "pos": "adjective"
            },
            {
                "word": "cantata",
                "pos": "noun"
            },
            {
                "word": "canteen",
                "pos": "noun"
            },
            {
                "word": "canteen culture",
                "pos": "noun"
            },
            {
                "word": "canter",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a place where food and drink are served in a factory, a school, etc.",
                    "vi": "nơi phục vụ đồ ăn thức uống trong nhà máy, trường học, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a small container used by soldiers, travellers, etc. for carrying water or other liquid",
                    "vi": "một thùng chứa nhỏ được sử dụng bởi binh lính, du khách, v.v. để đựng nước hoặc chất lỏng khác"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a box containing a set of knives, forks and spoons",
                    "vi": "một hộp chứa một bộ dao, nĩa và thìa"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "5290bb1c53424c009f420a40f818b02f",
        "word": "hall",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/hɔːl/",
            "us": "/hɔːl/"
        },
        "nearby": [
            {
                "word": "Halifax",
                "pos": ""
            },
            {
                "word": "halitosis",
                "pos": "noun"
            },
            {
                "word": "hall",
                "pos": "noun"
            },
            {
                "word": "Peter Hall",
                "pos": ""
            },
            {
                "word": "hallelujah",
                "pos": "exclamation"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a space or passage inside the entrance or front door of a building",
                    "vi": "một không gian hoặc lối đi bên trong lối vào hoặc cửa trước của một tòa nhà"
                },
                "examples": [
                    {
                        "en": "in a hall Her brother was standing in the front hall.",
                        "vi": "trong hội trường Anh trai cô ấy đang đứng ở tiền sảnh."
                    },
                    {
                        "en": "She ran into the hall and up the stairs.",
                        "vi": "Cô chạy vào sảnh và lên cầu thang."
                    }
                ]
            },
            {
                "define": {
                    "en": "a passage in a building with rooms down either side",
                    "vi": "một lối đi trong một tòa nhà có các phòng ở hai bên"
                },
                "examples": [
                    {
                        "en": "down the hall I headed for Scott's office down the hall.",
                        "vi": "xuống hành lang, tôi hướng đến văn phòng của Scott."
                    },
                    {
                        "en": "across the hall the room across the hall",
                        "vi": "qua hành lang căn phòng bên kia hành lang"
                    }
                ]
            },
            {
                "define": {
                    "en": "a building or large room for public meetings, meals, concerts, etc.",
                    "vi": "một tòa nhà hoặc phòng lớn cho các cuộc họp công cộng, bữa ăn, buổi hòa nhạc, v.v."
                },
                "examples": [
                    {
                        "en": "a concert/sports hall",
                        "vi": "một buổi hòa nhạc / phòng thể thao"
                    },
                    {
                        "en": "a banqueting/conference hall",
                        "vi": "phòng tiệc / hội nghị"
                    },
                    {
                        "en": "an exhibition hall",
                        "vi": "một phòng triển lãm"
                    },
                    {
                        "en": "There are three dining halls on campus.",
                        "vi": "Có ba phòng ăn trong khuôn viên trường."
                    },
                    {
                        "en": "the Royal Albert Hall",
                        "vi": "Hội trường Hoàng gia Albert"
                    },
                    {
                        "en": "in a hall The next meeting is in the community hall on Tuesday.",
                        "vi": "trong một hội trường Cuộc họp tiếp theo là trong hội trường cộng đồng vào Thứ Ba."
                    },
                    {
                        "en": "(British English) A jumble sale will be held in the village hall on Saturday.",
                        "vi": "(Tiếng Anh Anh) Một cuộc mua bán tạp nham sẽ được tổ chức tại hội trường làng vào thứ Bảy."
                    }
                ]
            },
            {
                "define": {
                    "en": "a building for university or college students to live in",
                    "vi": "một tòa nhà cho sinh viên đại học hoặc cao đẳng ở"
                },
                "examples": [
                    {
                        "en": "in hall(s) She's living in hall(s).",
                        "vi": "trong (các) hội trường Cô ấy đang sống trong (các) hội trường."
                    }
                ]
            },
            {
                "define": {
                    "en": "a large country house",
                    "vi": "một ngôi nhà nông thôn lớn"
                },
                "examples": [
                    {
                        "en": "Haddon Hall",
                        "vi": "Hội trường Haddon"
                    },
                    {
                        "en": "Berrington Hall was built in the late 18th century.",
                        "vi": "Berrington Hall được xây dựng vào cuối thế kỷ 18."
                    }
                ]
            }
        ]
    },
    {
        "id": "a8292818033346d09c6901a37256841a",
        "word": "laboratory",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ləˈbɒrətri/",
            "us": "/ˈlæbrətɔːri/"
        },
        "nearby": [
            {
                "word": "labor",
                "pos": "noun"
            },
            {
                "word": "labor",
                "pos": "verb"
            },
            {
                "word": "laboratory",
                "pos": "noun"
            },
            {
                "word": "Labor Day",
                "pos": "noun"
            },
            {
                "word": "labored",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a room or building used for scientific research, experiments, testing, etc.",
                    "vi": "một căn phòng hoặc tòa nhà được sử dụng để nghiên cứu khoa học, thí nghiệm, thử nghiệm, v.v."
                },
                "examples": [
                    {
                        "en": "a clinical/research laboratory",
                        "vi": "phòng thí nghiệm lâm sàng / nghiên cứu"
                    },
                    {
                        "en": "to send a specimen to the laboratory for analysis",
                        "vi": "gửi một mẫu vật đến phòng thí nghiệm để phân tích"
                    },
                    {
                        "en": "in a/the laboratory The effects of weathering can be simulated in the laboratory.",
                        "vi": "trong phòng thí nghiệm Các tác động của thời tiết có thể được mô phỏng trong phòng thí nghiệm."
                    },
                    {
                        "en": "laboratory experiments/tests",
                        "vi": "thí nghiệm / thử nghiệm trong phòng thí nghiệm"
                    },
                    {
                        "en": "The athletes' reflexes were tested under laboratory conditions.",
                        "vi": "Phản xạ của các vận động viên đã được kiểm tra trong điều kiện phòng thí nghiệm."
                    }
                ]
            }
        ]
    },
    {
        "id": "adbd46c5bfa0486797c4086032315285",
        "word": "playground",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈpleɪɡraʊnd/",
            "us": "/ˈpleɪɡraʊnd/"
        },
        "nearby": [
            {
                "word": "playfulness",
                "pos": "noun"
            },
            {
                "word": "playgoer",
                "pos": "noun"
            },
            {
                "word": "playground",
                "pos": "noun"
            },
            {
                "word": "playgroup",
                "pos": "noun"
            },
            {
                "word": "playhouse",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an outdoor area where children can play, especially at a school or in a park",
                    "vi": "một khu vực ngoài trời, nơi trẻ em có thể chơi, đặc biệt là ở trường học hoặc trong công viên"
                },
                "examples": [
                    {
                        "en": "a school playground",
                        "vi": "sân chơi ở trường"
                    },
                    {
                        "en": "an adventure playground",
                        "vi": "một sân chơi mạo hiểm"
                    },
                    {
                        "en": "teachers on playground duty",
                        "vi": "giáo viên trực sân chơi"
                    }
                ]
            },
            {
                "define": {
                    "en": "a place where a particular type of people go to enjoy themselves",
                    "vi": "một nơi mà một loại người cụ thể đến để tận hưởng bản thân"
                },
                "examples": [
                    {
                        "en": "The resort is a playground of the rich and famous.",
                        "vi": "Khu nghỉ dưỡng là sân chơi của những người giàu có và nổi tiếng."
                    }
                ]
            }
        ]
    },
    {
        "id": "4ff8c139cbc04c179749b50285feb708",
        "word": "whiteboard",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈwaɪtbɔːd/",
            "us": "/ˈwaɪtbɔːrd/"
        },
        "nearby": [
            {
                "word": "whitebait",
                "pos": "noun"
            },
            {
                "word": "white blood cell",
                "pos": "noun"
            },
            {
                "word": "whiteboard",
                "pos": "noun"
            },
            {
                "word": "white bread",
                "pos": "noun"
            },
            {
                "word": "white-bread",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a large board with a smooth white surface that teachers, etc. write on with special pens",
                    "vi": "một bảng lớn với bề mặt trắng mịn mà giáo viên, v.v. viết bằng bút đặc biệt"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a piece of classroom equipment using a computer connected to a large screen that you can write on or use to control the computer by touching it with your finger or a pen",
                    "vi": "một phần thiết bị trong lớp học sử dụng máy tính được kết nối với màn hình lớn mà bạn có thể viết hoặc sử dụng để điều khiển máy tính bằng cách chạm vào máy tính bằng ngón tay hoặc bút"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "d4f189e474474a85bc2e2af5cb7cb5f5",
        "word": "calculator",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈkælkjuleɪtə(r)/",
            "us": "/ˈkælkjuleɪtər/"
        },
        "nearby": [
            {
                "word": "calculating",
                "pos": "adjective"
            },
            {
                "word": "calculation",
                "pos": "noun"
            },
            {
                "word": "calculator",
                "pos": "noun"
            },
            {
                "word": "calculus",
                "pos": "noun"
            },
            {
                "word": "the Calcutta Cup",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small electronic device or piece of software for calculating with numbers",
                    "vi": "một thiết bị điện tử nhỏ hoặc một phần mềm để tính toán với các con số"
                },
                "examples": [
                    {
                        "en": "a pocket calculator",
                        "vi": "máy tính bỏ túi"
                    },
                    {
                        "en": "I used the calculator app on my phone.",
                        "vi": "Tôi đã sử dụng ứng dụng máy tính trên điện thoại của mình."
                    },
                    {
                        "en": "Exam candidates are not allowed to use advanced calculators with database capability.",
                        "vi": "Thí sinh dự thi không được sử dụng máy tính tiên tiến có chức năng cơ sở dữ liệu."
                    }
                ]
            }
        ]
    },
    {
        "id": "3884d8b1b23c492a898223d673786cb6",
        "word": "corridor",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈkɒrɪdɔː(r)/",
            "us": "/ˈkɔːrɪdɔːr/"
        },
        "nearby": [
            {
                "word": "corresponding angles",
                "pos": "noun"
            },
            {
                "word": "correspondingly",
                "pos": "adverb"
            },
            {
                "word": "corridor",
                "pos": "noun"
            },
            {
                "word": "corrie",
                "pos": "noun"
            },
            {
                "word": "Corrie",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a long narrow passage in a building, with doors that open into rooms on either side",
                    "vi": "một lối đi hẹp dài trong một tòa nhà, có cửa mở vào các phòng ở hai bên"
                },
                "examples": [
                    {
                        "en": "His room is along the corridor.",
                        "vi": "Phòng của anh ấy nằm dọc theo hành lang."
                    }
                ]
            },
            {
                "define": {
                    "en": "a long narrow piece of land belonging to one country that passes through the land of another country; a part of the sky over a country that planes, for example from another country, can fly through",
                    "vi": "một mảnh đất dài hẹp thuộc về một quốc gia này đi qua đất của quốc gia khác; một phần của bầu trời trên một quốc gia mà máy bay, chẳng hạn như từ một quốc gia khác, có thể bay qua"
                },
                "examples": [
                    {
                        "en": "UN troops will secure the land corridor so that food supplies can reach the trapped civilians.",
                        "vi": "Quân đội Liên Hợp Quốc sẽ đảm bảo hành lang trên đất liền để nguồn cung cấp lương thực có thể đến được với những thường dân bị mắc kẹt."
                    }
                ]
            },
            {
                "define": {
                    "en": "a long narrow piece of land that follows the course of an important road or river",
                    "vi": "một mảnh đất hẹp dài theo dòng sông hoặc con đường quan trọng"
                },
                "examples": [
                    {
                        "en": "the electronics industry in the M4 corridor",
                        "vi": "ngành công nghiệp điện tử trong hành lang M4"
                    },
                    {
                        "en": "a now-submerged land corridor between northern Africa and southern Europe",
                        "vi": "một hành lang đất liền chìm giữa Bắc Phi và Nam Âu"
                    }
                ]
            },
            {
                "define": {
                    "en": "a passage along the side of some railway trains, from which doors lead into separate compartments",
                    "vi": "một lối đi dọc theo bên của một số đoàn tàu đường sắt, từ đó các cửa dẫn vào các khoang riêng biệt"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the higher levels of government, where important decisions are made",
                    "vi": "các cấp chính quyền cao hơn, nơi đưa ra các quyết định quan trọng"
                },
                "examples": [
                    {
                        "en": "She had considerable influence in the corridors of power.",
                        "vi": "Cô có ảnh hưởng đáng kể trong hành lang quyền lực."
                    },
                    {
                        "en": "She was a minister with considerable influence in the corridors of power.",
                        "vi": "Bà là một bộ trưởng có ảnh hưởng đáng kể trong hành lang quyền lực."
                    }
                ]
            }
        ]
    },
    {
        "id": "49dcc0d20e4c4e63af543b238d1d3ea5",
        "word": "free period",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˌfriː ˈpɪəriəd/",
            "us": "/ˌfriː ˈpɪriəd/"
        },
        "nearby": [
            {
                "word": "free paper",
                "pos": "noun"
            },
            {
                "word": "free pardon",
                "pos": "noun"
            },
            {
                "word": "free period",
                "pos": "noun"
            },
            {
                "word": "Freephone",
                "pos": "noun"
            },
            {
                "word": "free port",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a period of time in a school day when a student or teacher does not have a class",
                    "vi": "một khoảng thời gian trong một ngày học khi học sinh hoặc giáo viên không có lớp học"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "43e338e9f69c4f8b912d28b55b7e288a",
        "word": "locker",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈlɒkə(r)/",
            "us": "/ˈlɑːkər/"
        },
        "nearby": [
            {
                "word": "John Locke",
                "pos": ""
            },
            {
                "word": "locked-in syndrome",
                "pos": "noun"
            },
            {
                "word": "locker",
                "pos": "noun"
            },
            {
                "word": "Lockerbie",
                "pos": ""
            },
            {
                "word": "locker room",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small cupboard that can be locked, where you can leave your clothes, bags, etc. while you play a sport or go somewhere",
                    "vi": "một chiếc tủ nhỏ có thể khóa, nơi bạn có thể để quần áo, túi xách, v.v. khi chơi thể thao hoặc đi đâu đó"
                },
                "examples": [
                    {
                        "en": "I left my things in my locker.",
                        "vi": "Tôi đã để lại những thứ của tôi trong tủ của tôi."
                    }
                ]
            }
        ]
    },
    {
        "id": "659f63df78ef418abc8a3fd111d692d6",
        "word": "notebook",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈnəʊtbʊk/",
            "us": "/ˈnəʊtbʊk/"
        },
        "nearby": [
            {
                "word": "note",
                "pos": "noun"
            },
            {
                "word": "note",
                "pos": "verb"
            },
            {
                "word": "notebook",
                "pos": "noun"
            },
            {
                "word": "notecard",
                "pos": "noun"
            },
            {
                "word": "noted",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small book of plain paper for writing notes in",
                    "vi": "một cuốn sách nhỏ bằng giấy thường để viết ghi chú"
                },
                "examples": [
                    {
                        "en": "The police officer wrote the details down in his notebook.",
                        "vi": "Viên cảnh sát đã ghi chi tiết vào sổ tay của mình."
                    },
                    {
                        "en": "She kept a notebook (= wrote notes in it) during the trip.",
                        "vi": "Cô ấy đã giữ một cuốn sổ (= đã viết các ghi chú trong đó) trong suốt chuyến đi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a small book for students to write their work in",
                    "vi": "một cuốn sách nhỏ cho học sinh viết bài của họ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a small computer that can work with a battery and be easily carried",
                    "vi": "một máy tính nhỏ có thể hoạt động bằng pin và dễ dàng mang theo"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "2f3585d192b44074a63a9d7c7214b5fc",
        "word": "playing field",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈpleɪɪŋ fiːld/",
            "us": "/ˈpleɪɪŋ fiːld/"
        },
        "nearby": [
            {
                "word": "playing",
                "pos": "noun"
            },
            {
                "word": "playing card",
                "pos": "noun"
            },
            {
                "word": "playing field",
                "pos": "noun"
            },
            {
                "word": "play itself out",
                "pos": "phrasal verb"
            },
            {
                "word": "playlet",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a large area of grass, usually with lines marked on it, where people play sports and games",
                    "vi": "một khu vực cỏ rộng lớn, thường có các đường kẻ được đánh dấu trên đó, nơi mọi người chơi thể thao và trò chơi"
                },
                "examples": [
                    {
                        "en": "the school playing fields",
                        "vi": "sân chơi trường học"
                    },
                    {
                        "en": "The school's playing fields offer facilities for tennis, football, hockey and athletics.",
                        "vi": "Các sân chơi của trường cung cấp cơ sở vật chất cho tennis, bóng đá, khúc côn cầu và điền kinh."
                    },
                    {
                        "en": "people walking their dogs on the school's playing field",
                        "vi": "mọi người dắt chó đi dạo trên sân chơi của trường"
                    }
                ]
            },
            {
                "define": {
                    "en": "a situation in which everyone has the same opportunities",
                    "vi": "một tình huống mà mọi người đều có cơ hội như nhau"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to create a situation where everyone has the same opportunities",
                    "vi": "để tạo ra một tình huống mà mọi người đều có cơ hội như nhau"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "3c899c233db74c67ab832bc22c807aba",
        "word": "rubber",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈrʌbə(r)/",
            "us": "/ˈrʌbər/"
        },
        "nearby": [
            {
                "word": "rub",
                "pos": "noun"
            },
            {
                "word": "rub along",
                "pos": "phrasal verb"
            },
            {
                "word": "rubber",
                "pos": "noun"
            },
            {
                "word": "rubber",
                "pos": "adjective"
            },
            {
                "word": "rubber band",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a strong substance that can be stretched and does not allow liquids to pass through it, used for making tyres, boots, etc. It is made from the liquid (= sap) inside a tropical plant or is produced using chemicals.",
                    "vi": "Một chất mạnh có thể kéo dài và không cho chất lỏng đi qua nó, được sử dụng để làm lốp xe, ủng, v.v ... Nó được làm từ chất lỏng (= nhựa cây) bên trong thực vật nhiệt đới hoặc được sản xuất bằng cách sử dụng hóa chất."
                },
                "examples": [
                    {
                        "en": "a ball made of rubber",
                        "vi": "một quả bóng làm bằng cao su"
                    },
                    {
                        "en": "a rubber tree",
                        "vi": "cây cao su"
                    },
                    {
                        "en": "a rubber plantation",
                        "vi": "đồn điền cao su"
                    },
                    {
                        "en": "My legs were like rubber - I could hardly walk.",
                        "vi": "Chân tôi giống như cao su - tôi khó đi bộ."
                    },
                    {
                        "en": "I don't like the smell of burning rubber.",
                        "vi": "Tôi không thích mùi cao su cháy."
                    }
                ]
            },
            {
                "define": {
                    "en": "a small piece of rubber or a similar substance, used for removing pencil marks from paper; a piece of soft material used for removing chalk marks from a blackboard or pen from a whiteboard",
                    "vi": "một miếng cao su nhỏ hoặc chất tương tự, dùng để tẩy vết bút chì trên giấy; một miếng vật liệu mềm dùng để xóa vết phấn trên bảng đen hoặc bút khỏi bảng trắng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a condom (= a thin rubber tube that a man wears over his penis during sex to stop a woman from becoming pregnant or to protect against disease)",
                    "vi": "bao cao su (= một ống cao su mỏng mà người đàn ông đeo qua dương vật của mình khi quan hệ tình dục để ngăn phụ nữ mang thai hoặc để bảo vệ chống lại bệnh tật)"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "(in some card games or sports) a competition consisting of a series of games or matches between the same teams or players",
                    "vi": "(trong một số trò chơi bài hoặc thể thao) một cuộc thi bao gồm một loạt trò chơi hoặc trận đấu giữa các đội hoặc người chơi giống nhau"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to drive very fast",
                    "vi": "lái xe rất nhanh"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the point at which something is tested and you really find out whether it is successful or true",
                    "vi": "thời điểm mà một thứ gì đó được thử nghiệm và bạn thực sự tìm ra nó thành công hay đúng sự thật"
                },
                "examples": [
                    {
                        "en": "Here's where the rubber meets the road: will consumers actually buy the product?",
                        "vi": "Đây là nơi mà cao su gặp trên đường: liệu người tiêu dùng có thực sự mua sản phẩm không?"
                    }
                ]
            }
        ]
    },
    {
        "id": "3836cf0f3e0041a3bcfdd8f5d884e9ae",
        "word": "workbook",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈwɜːkbʊk/",
            "us": "/ˈwɜːrkbʊk/"
        },
        "nearby": [
            {
                "word": "work basket",
                "pos": "noun"
            },
            {
                "word": "workbench",
                "pos": "noun"
            },
            {
                "word": "workbook",
                "pos": "noun"
            },
            {
                "word": "workbox",
                "pos": "noun"
            },
            {
                "word": "workday",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a book with exercises in it, often with spaces for students to write answers in, to help them practise what they have learnt",
                    "vi": "một cuốn sách có các bài tập trong đó, thường có khoảng trống để học sinh viết câu trả lời, nhằm giúp các em thực hành những gì đã học"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "0388d98e7d6e4b04894686e8e94d53aa",
        "word": "worksheet",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈwɜːkʃiːt/",
            "us": "/ˈwɜːrkʃiːt/"
        },
        "nearby": [
            {
                "word": "works",
                "pos": "noun"
            },
            {
                "word": "works council",
                "pos": "noun"
            },
            {
                "word": "worksheet",
                "pos": "noun"
            },
            {
                "word": "workshop",
                "pos": "noun"
            },
            {
                "word": "work-shy",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a piece of paper or an electronic document on which there is a series of questions and exercises to be done by a student",
                    "vi": "một mảnh giấy hoặc một tài liệu điện tử có một loạt các câu hỏi và bài tập mà học sinh phải làm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a piece of paper or an electronic document on which work that has been done or has to be done is recorded",
                    "vi": "một mảnh giấy hoặc một tài liệu điện tử ghi lại những công việc đã được làm hoặc phải làm"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "850d836fe2e44e5b9dc9b3fe9c87cd76",
        "word": "chalk",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/tʃɔːk/",
            "us": "/tʃɔːk/"
        },
        "nearby": [
            {
                "word": "chalet",
                "pos": "noun"
            },
            {
                "word": "chalice",
                "pos": "noun"
            },
            {
                "word": "chalk",
                "pos": "noun"
            },
            {
                "word": "chalk",
                "pos": "verb"
            },
            {
                "word": "chalkboard",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a type of soft white stone",
                    "vi": "một loại đá trắng mềm"
                },
                "examples": [
                    {
                        "en": "the chalk cliffs of southern England",
                        "vi": "những vách đá phấn ở miền nam nước Anh"
                    }
                ]
            },
            {
                "define": {
                    "en": "a substance similar to chalk made into white or coloured sticks for writing or drawing",
                    "vi": "một chất tương tự như phấn được làm thành các que màu trắng hoặc màu để viết hoặc vẽ"
                },
                "examples": [
                    {
                        "en": "a piece/stick of chalk",
                        "vi": "một mảnh / que phấn"
                    },
                    {
                        "en": "drawing diagrams with chalk on the blackboard",
                        "vi": "vẽ sơ đồ bằng phấn trên bảng đen"
                    },
                    {
                        "en": "a box of coloured chalks",
                        "vi": "một hộp phấn màu"
                    }
                ]
            },
            {
                "define": {
                    "en": "if two people or things are like chalk and cheese or as different as chalk and cheese, they are completely different from each other",
                    "vi": "nếu hai người hoặc vật giống như phấn và pho mát hoặc khác nhau như phấn và pho mát, họ hoàn toàn khác nhau"
                },
                "examples": [
                    {
                        "en": "Frank and I will never get along. We’re chalk and cheese.",
                        "vi": "Frank và tôi sẽ không bao giờ hợp nhau. Chúng tôi là phấn và pho mát."
                    },
                    {
                        "en": "My two horses are as different as chalk and cheese.",
                        "vi": "Hai con ngựa của tôi khác nhau như phấn và pho mát."
                    }
                ]
            },
            {
                "define": {
                    "en": "not nearly; not at all",
                    "vi": "gần như không; không có gì"
                },
                "examples": [
                    {
                        "en": "It's not over yet—not by a long chalk.",
                        "vi": "Nó vẫn chưa kết thúc - không phải bởi một lớp phấn dài."
                    }
                ]
            }
        ]
    },
    {
        "id": "5329c870a86a46bebb30bc962b8fb751",
        "word": "chalkboard",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈtʃɔːkbɔːd/",
            "us": "/ˈtʃɔːkbɔːrd/"
        },
        "nearby": [
            {
                "word": "chalk",
                "pos": "noun"
            },
            {
                "word": "chalk",
                "pos": "verb"
            },
            {
                "word": "chalkboard",
                "pos": "noun"
            },
            {
                "word": "the chalkface",
                "pos": "noun"
            },
            {
                "word": "chalk talk",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a large board with a smooth black or dark green surface that teachers write on with a piece of chalk",
                    "vi": "một bảng lớn với bề mặt nhẵn màu đen hoặc xanh lá cây đậm mà giáo viên viết trên đó bằng một mảnh phấn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "4312d88980bc49dfb1c3293ce92c5ccd",
        "word": "dormitory",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈdɔːmətri/",
            "us": "/ˈdɔːrmətɔːri/"
        },
        "nearby": [
            {
                "word": "dormant",
                "pos": "adjective"
            },
            {
                "word": "dormer window",
                "pos": "noun"
            },
            {
                "word": "dormitory",
                "pos": "noun"
            },
            {
                "word": "dormitory town",
                "pos": "noun"
            },
            {
                "word": "dormouse",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a room for several people to sleep in, especially in a school or other institution",
                    "vi": "một căn phòng cho nhiều người ngủ, đặc biệt là trong một trường học hoặc cơ sở khác"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a building for university or college students to live in",
                    "vi": "một tòa nhà cho sinh viên đại học hoặc cao đẳng ở"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "1ed1ec7d32e94c18bdc92b290f34b1d1",
        "word": "gymnasium",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/dʒɪmˈneɪziəm/",
            "us": "/dʒɪmˈneɪziəm/"
        },
        "nearby": [
            {
                "word": "gym",
                "pos": "noun"
            },
            {
                "word": "gymkhana",
                "pos": "noun"
            },
            {
                "word": "gymnasium",
                "pos": "noun"
            },
            {
                "word": "gymnast",
                "pos": "noun"
            },
            {
                "word": "gymnastic",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a gym",
                    "vi": "một phòng tập thể dục"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "068b29044553403fb5eea60b26c7bf57",
        "word": "interactive whiteboard",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌɪntəræktɪv ˈwaɪtbɔːd/",
            "us": "/ˌɪntəræktɪv ˈwaɪtbɔːrd/"
        },
        "nearby": [
            {
                "word": "interactive",
                "pos": "adjective"
            },
            {
                "word": "interactively",
                "pos": "adverb"
            },
            {
                "word": "interactive whiteboard",
                "pos": "noun"
            },
            {
                "word": "interactivity",
                "pos": "noun"
            },
            {
                "word": "inter alia",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a piece of classroom equipment using a computer connected to a large screen that you can write on or use to control the computer by touching it with your finger or a pen",
                    "vi": "một phần thiết bị trong lớp học sử dụng máy tính được kết nối với màn hình lớn mà bạn có thể viết hoặc sử dụng để điều khiển máy tính bằng cách chạm vào máy tính bằng ngón tay hoặc bút"
                },
                "examples": [
                    {
                        "en": "Nearly every classroom has an interactive whiteboard.",
                        "vi": "Gần như mọi lớp học đều có bảng tương tác."
                    }
                ]
            }
        ]
    },
    {
        "id": "834ec7cfb2364dfeacbd30ed7761e1d5",
        "word": "staffroom",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈstɑːfruːm/",
            "us": "/ˈstæfruːm/"
        },
        "nearby": [
            {
                "word": "Staffordshire figure",
                "pos": ""
            },
            {
                "word": "Staffordshire pottery",
                "pos": "noun"
            },
            {
                "word": "staffroom",
                "pos": "noun"
            },
            {
                "word": "staff sergeant",
                "pos": "noun"
            },
            {
                "word": "staff writer",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a room in a school where teachers can go when they are not teaching",
                    "vi": "một căn phòng trong trường học nơi giáo viên có thể đến khi họ không giảng dạy"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "f19cef563f0b46c5a2a0c693cc61de8e",
        "word": "chapel",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈtʃæpl/",
            "us": "/ˈtʃæpl/"
        },
        "nearby": [
            {
                "word": "chaparral",
                "pos": "noun"
            },
            {
                "word": "chapatti",
                "pos": "noun"
            },
            {
                "word": "chapel",
                "pos": "noun"
            },
            {
                "word": "chapel of rest",
                "pos": "noun"
            },
            {
                "word": "chaperone",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small building or room where Christians go to pray, attend religious services, etc. in a school, prison, large private house, etc.",
                    "vi": "một tòa nhà hoặc căn phòng nhỏ, nơi các Cơ đốc nhân đến cầu nguyện, tham dự các buổi lễ tôn giáo, v.v. trong trường học, nhà tù, nhà riêng lớn, v.v."
                },
                "examples": [
                    {
                        "en": "a college chapel",
                        "vi": "một nhà nguyện đại học"
                    }
                ]
            },
            {
                "define": {
                    "en": "a separate part of a church or cathedral, with its own altar, used for some services and private prayer",
                    "vi": "một phần riêng biệt của nhà thờ hoặc thánh đường, với bàn thờ riêng, được sử dụng cho một số dịch vụ và cầu nguyện riêng"
                },
                "examples": [
                    {
                        "en": "a Lady chapel (= a chapeldedicated to Mary, the mother of Jesus)",
                        "vi": "nhà nguyện Lady (= nhà thờ dành riêng cho Mary, mẹ của Chúa Giê-su)"
                    }
                ]
            },
            {
                "define": {
                    "en": "the word for a church used in some Christian denominations, for example by Nonconformists in the UK",
                    "vi": "từ để chỉ một nhà thờ được sử dụng trong một số giáo phái Cơ đốc giáo, chẳng hạn bởi những người theo chủ nghĩa Không tuân thủ ở Vương quốc Anh"
                },
                "examples": [
                    {
                        "en": "a Methodist chapel",
                        "vi": "một nhà nguyện Giám lý"
                    },
                    {
                        "en": "a Mormon chapel",
                        "vi": "một nhà nguyện Mormon"
                    },
                    {
                        "en": "She always went to chapel on Sundays.",
                        "vi": "Cô ấy luôn đến nhà nguyện vào Chủ nhật."
                    }
                ]
            },
            {
                "define": {
                    "en": "a small building or room used for funeral services, especially at a cemetery or crematorium",
                    "vi": "một tòa nhà hoặc phòng nhỏ được sử dụng cho các dịch vụ tang lễ, đặc biệt là tại nghĩa trang hoặc lò hỏa táng"
                },
                "examples": [
                    {
                        "en": "a chapel of rest",
                        "vi": "một nhà nguyện nghỉ ngơi"
                    }
                ]
            },
            {
                "define": {
                    "en": "a branch of a trade union in a newspaper office or printing house; the members of the branch",
                    "vi": "chi đoàn ở tòa soạn báo, nhà in; các thành viên của chi nhánh"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "fccafab463e54cce90c829ff4da090c9",
        "word": "common room",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkɒmən ruːm/",
            "us": "/ˈkɑːmən ruːm/"
        },
        "nearby": [
            {
                "word": "commonplace book",
                "pos": "noun"
            },
            {
                "word": "common rat",
                "pos": "noun"
            },
            {
                "word": "common room",
                "pos": "noun"
            },
            {
                "word": "the Commons",
                "pos": "noun"
            },
            {
                "word": "common sense",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a room used by the teachers or students of a school, college, etc. when they are not teaching or studying",
                    "vi": "một căn phòng được sử dụng bởi giáo viên hoặc sinh viên của một trường học, trường cao đẳng, v.v. khi họ không giảng dạy hoặc học tập"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a room shared by people who live together in a house or apartment, such as a living room",
                    "vi": "một căn phòng được chia sẻ bởi những người sống cùng nhau trong một ngôi nhà hoặc căn hộ, chẳng hạn như phòng khách"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "82160ef9bf9a4ee589523a5cf69282d2",
        "word": "infirmary",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ɪnˈfɜːməri/",
            "us": "/ɪnˈfɜːrməri/"
        },
        "nearby": [
            {
                "word": "infinity pool",
                "pos": "noun"
            },
            {
                "word": "infirm",
                "pos": "adjective"
            },
            {
                "word": "infirmary",
                "pos": "noun"
            },
            {
                "word": "infirmity",
                "pos": "noun"
            },
            {
                "word": "infix",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "(often used in names) a hospital",
                    "vi": "(thường được sử dụng trong tên) một bệnh viện"
                },
                "examples": [
                    {
                        "en": "He had his leg bandaged in the infirmary.",
                        "vi": "Anh ấy đã được băng bó chân trong bệnh xá."
                    },
                    {
                        "en": "Surgeons at the Radcliffe Infirmary successfully removed a blood clot from her brain.",
                        "vi": "Các bác sĩ phẫu thuật tại Bệnh viện Radcliffe đã loại bỏ thành công một cục máu đông trong não của cô."
                    }
                ]
            },
            {
                "define": {
                    "en": "a special room in a school, prison, etc. for people who are ill",
                    "vi": "một căn phòng đặc biệt trong trường học, nhà tù, v.v. dành cho những người bị bệnh"
                },
                "examples": [
                    {
                        "en": "He had to remain in the college infirmary for about a fortnight.",
                        "vi": "Anh ta phải ở lại bệnh xá của trường đại học trong khoảng hai tuần."
                    }
                ]
            }
        ]
    },
    {
        "id": "27d152833d7740a887236546a3e81ae3",
        "word": "language laboratory",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈlæŋɡwɪdʒ ləbɒrətri/",
            "us": "/ˈlæŋɡwɪdʒ læbrətɔːri/"
        },
        "nearby": [
            {
                "word": "language",
                "pos": "noun"
            },
            {
                "word": "language engineering",
                "pos": "noun"
            },
            {
                "word": "language laboratory",
                "pos": "noun"
            },
            {
                "word": "language transfer",
                "pos": "noun"
            },
            {
                "word": "langue",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a room in a school or college that contains special equipment to help students learn foreign languages by listening to recordings, watching videos, recording themselves, etc.",
                    "vi": "một phòng trong trường học hoặc trường cao đẳng có chứa thiết bị đặc biệt để giúp học sinh học ngoại ngữ bằng cách nghe các bản ghi âm, xem video, tự ghi âm, v.v."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "be10f22ae6954547b67459f61dce2836",
        "word": "locker room",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈlɒkə ruːm/",
            "us": "/ˈlɑːkər ruːm/"
        },
        "nearby": [
            {
                "word": "locker",
                "pos": "noun"
            },
            {
                "word": "Lockerbie",
                "pos": ""
            },
            {
                "word": "locker room",
                "pos": "noun"
            },
            {
                "word": "locket",
                "pos": "noun"
            },
            {
                "word": "Lockheed Martin",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a room with lockers in it, at a school, gym, etc., where people can change their clothes",
                    "vi": "một căn phòng có tủ khóa, ở trường học, phòng tập thể dục, v.v., nơi mọi người có thể thay quần áo của họ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "0594920eb78f4fc6be9a6e2bd80517e1",
        "word": "pigeonhole",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpɪdʒɪnhəʊl/",
            "us": "/ˈpɪdʒɪnhəʊl/"
        },
        "nearby": [
            {
                "word": "pig",
                "pos": "verb"
            },
            {
                "word": "pigeon",
                "pos": "noun"
            },
            {
                "word": "pigeonhole",
                "pos": "noun"
            },
            {
                "word": "pigeonhole",
                "pos": "verb"
            },
            {
                "word": "pigeon-toed",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "one of a set of small boxes that are fixed on a wall and open at the front, used for putting letters, messages, etc. in; one of a similar set of boxes that are part of a desk, used for keeping papers, documents, etc. in",
                    "vi": "một trong những bộ hộp nhỏ được gắn cố định trên tường và mở ra ở phía trước, được sử dụng để đặt thư, tin nhắn, v.v. vào trong; một trong những bộ hộp tương tự là một phần của bàn, được sử dụng để giữ giấy tờ, tài liệu, v.v. trong"
                },
                "examples": [
                    {
                        "en": "If you can't come, leave a note in my pigeonhole.",
                        "vi": "Nếu bạn không thể đến, hãy để lại lời nhắn trong chuồng chim bồ câu của tôi."
                    }
                ]
            }
        ]
    },
    {
        "id": "e8b59ee9128044b5a2347746237a7ad8",
        "word": "quad",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/kwɒd/",
            "us": "/kwɑːd/"
        },
        "nearby": [
            {
                "word": "quack",
                "pos": "verb"
            },
            {
                "word": "quackery",
                "pos": "noun"
            },
            {
                "word": "quad",
                "pos": "noun"
            },
            {
                "word": "quad bike",
                "pos": "noun"
            },
            {
                "word": "quadrangle",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an open square area that has buildings all around it, especially in a school or college",
                    "vi": "một khu vực hình vuông mở có các tòa nhà xung quanh nó, đặc biệt là trong một trường học hoặc trường cao đẳng"
                },
                "examples": [
                    {
                        "en": "Her office window overlooks the quad.",
                        "vi": "Cửa sổ văn phòng của cô ấy nhìn ra khu nhà."
                    }
                ]
            },
            {
                "define": {
                    "en": "one of four children born at the same time to the same mother",
                    "vi": "một trong bốn đứa trẻ được sinh ra cùng một lúc với cùng một mẹ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "359124ca6a8b4148a98901f40bb08279",
        "word": "quadrangle",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkwɒdræŋɡl/",
            "us": "/ˈkwɑːdræŋɡl/"
        },
        "nearby": [
            {
                "word": "quad",
                "pos": "noun"
            },
            {
                "word": "quad bike",
                "pos": "noun"
            },
            {
                "word": "quadrangle",
                "pos": "noun"
            },
            {
                "word": "quadrangular",
                "pos": "adjective"
            },
            {
                "word": "quadrant",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an open square area that has buildings all around it, especially in a school or college",
                    "vi": "một khu vực hình vuông mở có các tòa nhà xung quanh nó, đặc biệt là trong một trường học hoặc trường cao đẳng"
                },
                "examples": [
                    {
                        "en": "It has a large central quadrangle entered from the south side.",
                        "vi": "Nó có một tứ giác trung tâm lớn đi vào từ phía nam."
                    }
                ]
            }
        ]
    },
    {
        "id": "af3e1fc8d60b4432933c9c2a9cde5a9e",
        "word": "reception",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/rɪˈsepʃn/",
            "us": "/rɪˈsepʃn/"
        },
        "nearby": [
            {
                "word": "recently",
                "pos": "adverb"
            },
            {
                "word": "receptacle",
                "pos": "noun"
            },
            {
                "word": "reception",
                "pos": "noun"
            },
            {
                "word": "reception centre",
                "pos": "noun"
            },
            {
                "word": "reception class",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the area inside the entrance of a hotel, an office building, etc. where guests or visitors go first when they arrive",
                    "vi": "khu vực bên trong lối vào của một khách sạn, một tòa nhà văn phòng, v.v. nơi khách hoặc du khách đi đầu tiên khi họ đến"
                },
                "examples": [
                    {
                        "en": "Please report to reception on arrival.",
                        "vi": "Vui lòng báo cáo với lễ tân khi đến nơi."
                    },
                    {
                        "en": "You can leave a message with reception.",
                        "vi": "Bạn có thể để lại tin nhắn với lễ tân."
                    },
                    {
                        "en": "the reception area",
                        "vi": "khu vực tiếp tân"
                    },
                    {
                        "en": "in reception We arranged to meet in reception at 6.30.",
                        "vi": "tại quầy lễ tân Chúng tôi đã sắp xếp để gặp nhau tại quầy lễ tân lúc 6.30."
                    },
                    {
                        "en": "at reception I've left the keys at reception.",
                        "vi": "tại quầy lễ tân, tôi đã để quên chìa khóa ở quầy lễ tân."
                    },
                    {
                        "en": "on reception I've been on reception (= working there) the whole morning.",
                        "vi": "trên lễ tân Tôi đã tiếp tân (= làm việc ở đó) cả buổi sáng."
                    },
                    {
                        "en": "(North American English, British English) the reception desk",
                        "vi": "(Tiếng Anh Bắc Mỹ, tiếng Anh Anh) quầy lễ tân"
                    }
                ]
            },
            {
                "define": {
                    "en": "a formal social occasion to welcome somebody or celebrate something",
                    "vi": "một dịp xã hội chính thức để chào đón ai đó hoặc kỷ niệm điều gì đó"
                },
                "examples": [
                    {
                        "en": "a wedding reception",
                        "vi": "tiệc cưới"
                    },
                    {
                        "en": "reception for somebody They held a reception for the Japanese trade delegation at the White House.",
                        "vi": "chiêu đãi ai đó Họ tổ chức tiệc chiêu đãi phái đoàn thương mại Nhật Bản tại Nhà Trắng."
                    },
                    {
                        "en": "Are you having a big reception after the wedding?",
                        "vi": "Bạn đang có một bữa tiệc lớn sau đám cưới?"
                    },
                    {
                        "en": "A champagne reception was held at the Swallow Hotel.",
                        "vi": "Tiệc rượu sâm panh được tổ chức tại khách sạn Swallow."
                    },
                    {
                        "en": "They hosted a reception for 75 guests.",
                        "vi": "Họ tổ chức tiệc chiêu đãi cho 75 khách."
                    },
                    {
                        "en": "We met at a reception.",
                        "vi": "Chúng tôi gặp nhau tại một buổi tiếp tân."
                    }
                ]
            },
            {
                "define": {
                    "en": "the type of welcome that is given to somebody/something",
                    "vi": "kiểu chào mừng được trao cho ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "reception from somebody The reception from critics and audiences was at best lukewarm",
                        "vi": "sự đón nhận từ một người nào đó Sự đón nhận từ các nhà phê bình và khán giả ở mức ấm áp nhất"
                    },
                    {
                        "en": "The band got a rapturous reception from the crowd.",
                        "vi": "Ban nhạc đã nhận được sự đón nhận cuồng nhiệt từ đám đông."
                    },
                    {
                        "en": "Her latest album has met with a mixed reception from fans.",
                        "vi": "Album mới nhất của cô đã nhận được sự đón nhận trái chiều từ người hâm mộ."
                    },
                    {
                        "en": "reception by somebody the book's reception by reviewers",
                        "vi": "sự tiếp nhận của ai đó sự tiếp nhận của cuốn sách bởi những người đánh giá"
                    },
                    {
                        "en": "Delegates gave him a warm reception as he called for more spending on education.",
                        "vi": "Các đại biểu đã dành cho ông sự đón tiếp nồng nhiệt khi ông kêu gọi chi tiêu nhiều hơn cho giáo dục."
                    }
                ]
            },
            {
                "define": {
                    "en": "the quality of radio and television signals that are broadcast",
                    "vi": "chất lượng của tín hiệu phát thanh và truyền hình được phát sóng"
                },
                "examples": [
                    {
                        "en": "good/bad reception",
                        "vi": "tiếp nhận tốt / xấu"
                    },
                    {
                        "en": "There was very poor reception on my phone.",
                        "vi": "Có tín hiệu rất kém trên điện thoại của tôi."
                    },
                    {
                        "en": "Television reception is very good in this area.",
                        "vi": "Tiếp sóng truyền hình là rất tốt trong lĩnh vực này."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of receiving or welcoming somebody",
                    "vi": "hành động đón nhận hoặc chào đón ai đó"
                },
                "examples": [
                    {
                        "en": "The locals provided facilities for the reception of children from the war zone.",
                        "vi": "Các địa phương đã cung cấp các phương tiện để tiếp nhận trẻ em từ vùng chiến sự."
                    }
                ]
            },
            {
                "define": {
                    "en": "the first class at school for children aged 4 or 5",
                    "vi": "lớp học đầu tiên ở trường cho trẻ em 4 hoặc 5 tuổi"
                },
                "examples": [
                    {
                        "en": "My son is in reception.",
                        "vi": "Con trai tôi đang tiếp tân."
                    }
                ]
            }
        ]
    },
    {
        "id": "6d19045ac703490a8d710284e848c037",
        "word": "satchel",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsætʃəl/",
            "us": "/ˈsætʃəl/"
        },
        "nearby": [
            {
                "word": "satanist",
                "pos": "noun"
            },
            {
                "word": "satay",
                "pos": "noun"
            },
            {
                "word": "satchel",
                "pos": "noun"
            },
            {
                "word": "Satchmo",
                "pos": ""
            },
            {
                "word": "satcom",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a bag with a long strap, that you hang over your shoulder or wear on your back, used especially for carrying school books",
                    "vi": "một chiếc túi có dây đeo dài để bạn đeo qua vai hoặc đeo sau lưng, được sử dụng đặc biệt để mang sách đi học"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "cfdb59d2fbf44bcba1deab03c1adaaf8",
        "word": "schoolyard",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈskuːljɑːd/",
            "us": "/ˈskuːljɑːrd/"
        },
        "nearby": [
            {
                "word": "school uniform",
                "pos": "noun"
            },
            {
                "word": "schoolwork",
                "pos": "noun"
            },
            {
                "word": "schoolyard",
                "pos": "noun"
            },
            {
                "word": "schooner",
                "pos": "noun"
            },
            {
                "word": "schtick",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an outdoor area of a school for children to play in",
                    "vi": "khu vực ngoài trời của trường học cho trẻ em vui chơi"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "2aab9e2dd5a94778ae3443e2c4d735e0",
        "word": "sickbay",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsɪkbeɪ/",
            "us": "/ˈsɪkbeɪ/"
        },
        "nearby": [
            {
                "word": "sick",
                "pos": "verb"
            },
            {
                "word": "sick bag",
                "pos": "noun"
            },
            {
                "word": "sickbay",
                "pos": "noun"
            },
            {
                "word": "sickbed",
                "pos": "noun"
            },
            {
                "word": "sick building syndrome",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a room or rooms, for example on a ship or in a school, with beds for people who are ill",
                    "vi": "một phòng hoặc các phòng, ví dụ như trên tàu hoặc trong trường học, có giường cho những người bị bệnh"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "b6093ace6a634142970705682bd98796",
        "word": "study hall",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈstʌdi hɔːl/",
            "us": "/ˈstʌdi hɔːl/"
        },
        "nearby": [
            {
                "word": "study",
                "pos": "verb"
            },
            {
                "word": "study bedroom",
                "pos": "noun"
            },
            {
                "word": "study hall",
                "pos": "noun"
            },
            {
                "word": "stuff",
                "pos": "noun"
            },
            {
                "word": "stuff",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a period of time during the school day when students study quietly on their own, usually with a teacher present",
                    "vi": "một khoảng thời gian trong ngày học sinh yên lặng tự học, thường là có giáo viên hiện diện"
                },
                "examples": []
            }
        ]
    }
]