[
    {
        "id": "e96345b2d5df46f79a0c2a385eebeb7e",
        "word": "hard",
        "pos": "adjective",
        "level": "a1",
        "phonetic": {
            "uk": "/hɑːd/",
            "us": "/hɑːrd/"
        },
        "nearby": [
            {
                "word": "harbour master",
                "pos": "noun"
            },
            {
                "word": "hard-ass",
                "pos": "noun"
            },
            {
                "word": "hard",
                "pos": "adjective"
            },
            {
                "word": "hard",
                "pos": "adverb"
            },
            {
                "word": "hard-ass",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "difficult to do, understand or answer",
                    "vi": "khó làm, hiểu hoặc trả lời"
                },
                "examples": [
                    {
                        "en": "a hard choice/decision/question",
                        "vi": "một lựa chọn / quyết định / câu hỏi khó"
                    },
                    {
                        "en": "hard to do something It is hard to believe that she's only nine.",
                        "vi": "khó để làm điều gì đó Thật khó tin rằng cô ấy chỉ mới chín tuổi."
                    },
                    {
                        "en": "It's hard to see how they can lose.",
                        "vi": "Thật khó để thấy họ có thể thua như thế nào."
                    },
                    {
                        "en": "It's hard to imagine a more cynical political strategy.",
                        "vi": "Thật khó để tưởng tượng một chiến lược chính trị hoài nghi hơn."
                    },
                    {
                        "en": "‘When will the job be finished?’ ‘It's hard to say (= it is difficult to be certain)’ .",
                        "vi": "Khi nào công việc sẽ hoàn thành?' 'Thật khó để nói (= rất khó để chắc chắn)'."
                    },
                    {
                        "en": "It's getting harder and harder to earn enough to pay the rent.",
                        "vi": "Ngày càng khó kiếm đủ tiền trả tiền thuê nhà."
                    },
                    {
                        "en": "I find his attitude very hard to take (= difficult to accept).",
                        "vi": "Tôi thấy thái độ của anh ấy rất khó chấp nhận (= khó chấp nhận)."
                    },
                    {
                        "en": "We're finding reliable staff hard to come by (= difficult to get).",
                        "vi": "Chúng tôi khó tìm được nhân viên đáng tin cậy (= khó kiếm)."
                    },
                    {
                        "en": "Houses like this are extremely hard to find.",
                        "vi": "Những ngôi nhà như thế này cực kỳ khó kiếm."
                    },
                    {
                        "en": "You are hard to please, aren’t you?",
                        "vi": "Em thật khó vừa lòng anh nhỉ?"
                    },
                    {
                        "en": "I found it hard to believe what they told me.",
                        "vi": "Tôi cảm thấy thật khó tin những gì họ nói với tôi."
                    },
                    {
                        "en": "hard for somebody It must be hard for her, bringing up four children on her own.",
                        "vi": "Khó cho ai đó Hẳn là khó cho cô ấy, một mình nuôi nấng bốn đứa con."
                    },
                    {
                        "en": "hard for somebody to do something It's hard for old people to change their ways.",
                        "vi": "Khó ai đó làm được điều gì đó Người già khó thay đổi cách làm của họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "full of difficulty and problems, especially because of a lack of money",
                    "vi": "đầy khó khăn và vấn đề, đặc biệt là vì thiếu tiền"
                },
                "examples": [
                    {
                        "en": "Times were hard at the end of the war.",
                        "vi": "Thời kỳ khó khăn khi chiến tranh kết thúc."
                    },
                    {
                        "en": "She's had a hard life.",
                        "vi": "Cô ấy đã có một cuộc sống khó khăn."
                    }
                ]
            },
            {
                "define": {
                    "en": "needing or using a lot of physical strength or mental effort",
                    "vi": "cần hoặc sử dụng nhiều thể lực hoặc tinh thần"
                },
                "examples": [
                    {
                        "en": "It's hard work shovelling snow.",
                        "vi": "Công việc xúc tuyết thật khó."
                    },
                    {
                        "en": "This is the hardest part of my job.",
                        "vi": "Đây là phần khó nhất trong công việc của tôi."
                    },
                    {
                        "en": "It was one of the hardest things I ever did.",
                        "vi": "Đó là một trong những điều khó khăn nhất mà tôi từng làm."
                    },
                    {
                        "en": "I've had a long hard day.",
                        "vi": "Tôi đã có một ngày dài khó khăn."
                    },
                    {
                        "en": "This season has been a hard slog.",
                        "vi": "Mùa giải này là một khẩu hiệu khó."
                    },
                    {
                        "en": "They had put in hours of hard graft.",
                        "vi": "Họ đã dành hàng giờ đồng hồ để ghép xương."
                    }
                ]
            },
            {
                "define": {
                    "en": "putting a lot of effort or energy into an activity",
                    "vi": "đặt nhiều nỗ lực hoặc năng lượng vào một hoạt động"
                },
                "examples": [
                    {
                        "en": "She's a very hard worker.",
                        "vi": "Cô ấy là một người làm việc rất chăm chỉ."
                    },
                    {
                        "en": "He's hard at work on a new novel.",
                        "vi": "Anh ấy đang chăm chỉ làm một cuốn tiểu thuyết mới."
                    },
                    {
                        "en": "When I left they were all still hard at it (= working hard).",
                        "vi": "Khi tôi rời đi, tất cả họ vẫn chăm chỉ (= làm việc chăm chỉ)."
                    }
                ]
            },
            {
                "define": {
                    "en": "done with a lot of strength or force",
                    "vi": "được thực hiện với rất nhiều sức mạnh hoặc lực lượng"
                },
                "examples": [
                    {
                        "en": "He gave the door a good hard kick.",
                        "vi": "Anh ta đá mạnh vào cánh cửa."
                    },
                    {
                        "en": "a hard punch",
                        "vi": "một cú đấm mạnh"
                    }
                ]
            },
            {
                "define": {
                    "en": "solid or stiff and difficult to bend or break",
                    "vi": "rắn hoặc cứng và khó uốn cong hoặc gãy"
                },
                "examples": [
                    {
                        "en": "Wait for the concrete to go hard.",
                        "vi": "Chờ cho bê tông đông cứng."
                    },
                    {
                        "en": "a hard mattress",
                        "vi": "một tấm nệm cứng"
                    },
                    {
                        "en": "Diamonds are the hardest known mineral.",
                        "vi": "Kim cương là khoáng chất cứng nhất được biết đến."
                    }
                ]
            },
            {
                "define": {
                    "en": "showing no kind feelings or sympathy",
                    "vi": "không thể hiện cảm xúc tử tế hoặc cảm thông"
                },
                "examples": [
                    {
                        "en": "My father was a hard man.",
                        "vi": "Cha tôi là một người chăm chỉ."
                    },
                    {
                        "en": "She gave me a hard stare.",
                        "vi": "Cô ấy nhìn tôi chằm chằm."
                    },
                    {
                        "en": "His voice was hard.",
                        "vi": "Giọng anh khó nghe."
                    },
                    {
                        "en": "He said some very hard things to me.",
                        "vi": "Anh ấy đã nói một số điều rất khó với tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "showing no signs of fear or weakness; ready to fight or compete",
                    "vi": "không có dấu hiệu sợ hãi hoặc yếu đuối; sẵn sàng chiến đấu hoặc cạnh tranh"
                },
                "examples": [
                    {
                        "en": "Come and get me if you think you're hard enough.",
                        "vi": "Hãy đến và lấy tôi nếu bạn nghĩ rằng bạn đủ chăm chỉ."
                    },
                    {
                        "en": "You think you're really hard, don't you?",
                        "vi": "Bạn nghĩ rằng bạn thực sự khó khăn, phải không?"
                    },
                    {
                        "en": "He's as hard and uncompromising as any professional sportsman.",
                        "vi": "Anh ấy chăm chỉ và không khoan nhượng như bất kỳ vận động viên thể thao chuyên nghiệp nào."
                    }
                ]
            },
            {
                "define": {
                    "en": "definitely true and based on information that can be proved",
                    "vi": "chắc chắn đúng và dựa trên thông tin có thể được chứng minh"
                },
                "examples": [
                    {
                        "en": "Is there any hard evidence either way?",
                        "vi": "Có bất kỳ bằng chứng khó khăn nào không?"
                    },
                    {
                        "en": "The newspaper story is based on hard facts.",
                        "vi": "Câu chuyện trên báo dựa trên những sự kiện khó."
                    }
                ]
            },
            {
                "define": {
                    "en": "very cold and severe",
                    "vi": "rất lạnh và khắc nghiệt"
                },
                "examples": [
                    {
                        "en": "It had been a hard winter.",
                        "vi": "Đó là một mùa đông khó khăn."
                    },
                    {
                        "en": "There was a hard frost that night.",
                        "vi": "Đêm đó có sương giá dày đặc."
                    }
                ]
            },
            {
                "define": {
                    "en": "strongly alcoholic",
                    "vi": "rượu mạnh"
                },
                "examples": [
                    {
                        "en": "hard liquor",
                        "vi": "rượu mạnh"
                    },
                    {
                        "en": "(informal) a drop of the hard stuff (= a strong alcoholic drink)",
                        "vi": "(không chính thức) một giọt rượu mạnh (= đồ uống có cồn mạnh)"
                    }
                ]
            },
            {
                "define": {
                    "en": "containing calcium and other mineral salts that make mixing with soap difficult",
                    "vi": "chứa canxi và các muối khoáng khác nên khó trộn với xà phòng"
                },
                "examples": [
                    {
                        "en": "a hard water area",
                        "vi": "một vùng nước cứng"
                    },
                    {
                        "en": "Our water is very hard.",
                        "vi": "Nước của chúng tôi rất cứng."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to describe a letter c or g when pronounced as in ‘cat’ or ‘go’, rather than as in ‘city’ or ‘giant’",
                    "vi": "được sử dụng để mô tả một chữ cái c hoặc g khi được phát âm như trong \"cat\" hoặc \"go\", thay vì như trong \"city\" hoặc \"giant\""
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to treat or criticize somebody in a very severe or strict way",
                    "vi": "đối xử hoặc chỉ trích ai đó theo cách rất nghiêm khắc hoặc nghiêm khắc"
                },
                "examples": [
                    {
                        "en": "Don't be too hard on him—he's very young.",
                        "vi": "Đừng quá khắt khe với anh ấy - anh ấy còn rất trẻ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be difficult for or unfair to somebody/something",
                    "vi": "khó khăn hoặc không công bằng với ai đó / điều gì đó"
                },
                "examples": [
                    {
                        "en": "It's hard on people who don't have a car.",
                        "vi": "Thật khó cho những người không có xe hơi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be likely to hurt or damage something",
                    "vi": "có khả năng làm tổn thương hoặc làm hỏng thứ gì đó"
                },
                "examples": [
                    {
                        "en": "Looking at a computer screen all day can be very hard on the eyes.",
                        "vi": "Nhìn vào màn hình máy tính cả ngày có thể rất khó cho mắt."
                    }
                ]
            },
            {
                "define": {
                    "en": "in a situation where you have to choose between two things, both of which are unpleasant",
                    "vi": "trong một tình huống mà bạn phải lựa chọn giữa hai điều, cả hai điều này đều khó chịu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to argue in an aggressive way and force somebody to agree on the best possible price or arrangement",
                    "vi": "tranh luận một cách tích cực và buộc ai đó phải đồng ý về mức giá hoặc thỏa thuận tốt nhất có thể"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to deliberately make a situation difficult and unpleasant for somebody",
                    "vi": "cố tình tạo ra một tình huống khó khăn và khó chịu cho ai đó"
                },
                "examples": [
                    {
                        "en": "They really gave me a hard time at the interview.",
                        "vi": "Họ thực sự đã gây khó khăn cho tôi trong buổi phỏng vấn."
                    }
                ]
            },
            {
                "define": {
                    "en": "that cannot be changed in any circumstances",
                    "vi": "điều đó không thể thay đổi trong mọi trường hợp"
                },
                "examples": [
                    {
                        "en": "There are no hard and fast rules about this.",
                        "vi": "Không có quy tắc cứng và nhanh chóng về điều này."
                    },
                    {
                        "en": "This situation isn’t hard and fast.",
                        "vi": "Tình huống này không khó và nhanh chóng."
                    }
                ]
            },
            {
                "define": {
                    "en": "showing no fear, sympathy or kind behaviour",
                    "vi": "không tỏ ra sợ hãi, cảm thông hoặc cư xử tử tế"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used as a way of saying that you are sorry about something, usually ironically (= you really mean the opposite)",
                    "vi": "được sử dụng như một cách để nói rằng bạn xin lỗi về điều gì đó, thường là mỉa mai (= bạn thực sự có ý ngược lại)"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "difficult to understand or needing a lot of effort",
                    "vi": "khó hiểu hoặc cần nhiều nỗ lực"
                },
                "examples": [
                    {
                        "en": "I'm finding his latest novel very hard going.",
                        "vi": "Tôi đang tìm cuốn tiểu thuyết mới nhất của anh ấy rất khó khăn."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to tell somebody that you feel sorry for them",
                    "vi": "từng nói với ai đó rằng bạn cảm thấy tiếc cho họ"
                },
                "examples": [
                    {
                        "en": "‘Failed again, I'm afraid.’ ‘Oh, hard luck.’",
                        "vi": "Tôi lại thất bại, tôi sợ.' 'Ôi, may quá.'"
                    }
                ]
            },
            {
                "define": {
                    "en": "a difficult problem or situation to deal with",
                    "vi": "một vấn đề hoặc tình huống khó giải quyết"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a person or event that is so good or successful at something that it will be difficult for anyone/anything else coming after them to be as good or successful",
                    "vi": "một người hoặc một sự kiện quá tốt hoặc thành công ở một thứ gì đó mà sẽ khó cho bất kỳ ai / bất cứ điều gì khác sau họ trở nên tốt hoặc thành công"
                },
                "examples": [
                    {
                        "en": "She has been an excellent principal and will be a hard act to follow.",
                        "vi": "Cô ấy đã là một hiệu trưởng xuất sắc và sẽ là một hành động khó để noi theo."
                    },
                    {
                        "en": "Their contribution will prove a tough act to follow.",
                        "vi": "Sự đóng góp của họ sẽ chứng minh một hành động khó khăn để làm theo."
                    }
                ]
            },
            {
                "define": {
                    "en": "by having an unpleasant experience or by making mistakes",
                    "vi": "do có trải nghiệm khó chịu hoặc do mắc lỗi"
                },
                "examples": [
                    {
                        "en": "She won't listen to my advice so she'll just have to learn the hard way.",
                        "vi": "Cô ấy sẽ không nghe lời khuyên của tôi vì vậy cô ấy sẽ phải học một cách khó khăn."
                    },
                    {
                        "en": "He learned about the dangers of drugs the hard way.",
                        "vi": "Anh ấy đã học về sự nguy hiểm của ma túy một cách khó khăn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have difficulty doing something",
                    "vi": "gặp khó khăn khi làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "You'll have a job convincing them that you're right.",
                        "vi": "Bạn sẽ có một công việc thuyết phục họ rằng bạn đúng."
                    },
                    {
                        "en": "He had a hard job to make himself heard.",
                        "vi": "Anh ấy đã gặp khó khăn trong việc làm cho mình được lắng nghe."
                    }
                ]
            },
            {
                "define": {
                    "en": "to use more time or energy on a task than is necessary",
                    "vi": "sử dụng nhiều thời gian hoặc năng lượng cho một công việc hơn mức cần thiết"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used after you have been arguing with somebody or have beaten them in a contest but you would still like to be friendly with them",
                    "vi": "được sử dụng sau khi bạn đã tranh cãi với ai đó hoặc đã đánh bại họ trong một cuộc thi nhưng bạn vẫn muốn thân thiện với họ"
                },
                "examples": [
                    {
                        "en": "It looks like I'm the winner again. No hard feelings, Dave, eh?",
                        "vi": "Có vẻ như tôi lại là người chiến thắng. Không có cảm giác khó khăn, Dave, eh?"
                    },
                    {
                        "en": "Someone has to lose. No hard feelings, eh?",
                        "vi": "Có người phải mất. Không có cảm giác khó khăn, hả?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to make yourself seem more attractive or interesting by not immediately accepting an invitation to do something",
                    "vi": "để khiến bản thân có vẻ hấp dẫn hoặc thú vị hơn bằng cách không nhận lời mời làm việc gì đó ngay lập tức"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to consider a problem or possibility very carefully and without hurrying",
                    "vi": "xem xét một vấn đề hoặc khả năng rất cẩn thận và không vội vàng"
                },
                "examples": [
                    {
                        "en": "We need to take a long, hard look at all the options.",
                        "vi": "Chúng ta cần phải xem xét kỹ lưỡng và lâu dài về tất cả các lựa chọn."
                    }
                ]
            },
            {
                "define": {
                    "en": "needing too much effort",
                    "vi": "cần quá nhiều nỗ lực"
                },
                "examples": [
                    {
                        "en": "I can't be bothered making a hot meal—it's too much like hard work.",
                        "vi": "Tôi không thể làm phiền khi nấu một bữa ăn nóng - nó quá giống như một công việc khó khăn."
                    }
                ]
            }
        ]
    },
    {
        "id": "b9946489b8dd48649a768586990ccb57",
        "word": "hard",
        "pos": "adverb",
        "level": "a1",
        "phonetic": {
            "uk": "/hɑːd/",
            "us": "/hɑːrd/"
        },
        "nearby": [
            {
                "word": "hard-ass",
                "pos": "noun"
            },
            {
                "word": "hard",
                "pos": "adjective"
            },
            {
                "word": "hard",
                "pos": "adverb"
            },
            {
                "word": "hard-ass",
                "pos": "adjective"
            },
            {
                "word": "hardback",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "with great effort; with difficulty",
                    "vi": "với nỗ lực rất nhiều; với khó khăn"
                },
                "examples": [
                    {
                        "en": "to work hard",
                        "vi": "làm việc chăm chỉ"
                    },
                    {
                        "en": "You must try harder.",
                        "vi": "Bạn phải cố gắng nhiều hơn nữa."
                    },
                    {
                        "en": "She tried her hardest not to show how disappointed she was.",
                        "vi": "Cô ấy đã cố gắng hết sức để không cho thấy mình đã thất vọng như thế nào."
                    },
                    {
                        "en": "He was still breathing hard after his run.",
                        "vi": "Anh ấy vẫn còn thở dốc sau khi chạy."
                    },
                    {
                        "en": "You shouldn't train too hard—be careful about injuries.",
                        "vi": "Bạn không nên tập luyện quá sức — hãy cẩn thận với các chấn thương."
                    },
                    {
                        "en": "He is fighting hard to keep his job.",
                        "vi": "Anh ấy đang chiến đấu hết mình để giữ được công việc của mình."
                    },
                    {
                        "en": "She trained hard twice a day.",
                        "vi": "Cô ấy tập luyện chăm chỉ hai lần một ngày."
                    },
                    {
                        "en": "Our victory was hard won (= won with great difficulty).",
                        "vi": "Chiến thắng của chúng tôi là khó thắng (= đã thắng trong khó khăn lớn)."
                    }
                ]
            },
            {
                "define": {
                    "en": "with great force",
                    "vi": "với lực rất lớn"
                },
                "examples": [
                    {
                        "en": "Don't hit it so hard!",
                        "vi": "Đừng đánh nó quá mạnh!"
                    },
                    {
                        "en": "I pressed the accelerator hard and the car sped off.",
                        "vi": "Tôi nhấn mạnh chân ga và chiếc xe lao đi."
                    },
                    {
                        "en": "(figurative) Small businesses have been hit hard/hard hit by the recession.",
                        "vi": "(nghĩa bóng) Các doanh nghiệp nhỏ đã bị ảnh hưởng nặng nề / ảnh hưởng nặng nề bởi suy thoái kinh tế."
                    }
                ]
            },
            {
                "define": {
                    "en": "carefully and completely",
                    "vi": "cẩn thận và đầy đủ"
                },
                "examples": [
                    {
                        "en": "to think hard",
                        "vi": "suy nghĩ nhiều"
                    },
                    {
                        "en": "We thought long and hard before deciding to move house.",
                        "vi": "Chúng tôi đã suy nghĩ rất lâu trước khi quyết định chuyển nhà."
                    },
                    {
                        "en": "They need to look hard at the facts of this case.",
                        "vi": "Họ cần phải nhìn vào sự thật của trường hợp này."
                    }
                ]
            },
            {
                "define": {
                    "en": "heavily; a lot or for a long time",
                    "vi": "nặng nề; rất nhiều hoặc trong một thời gian dài"
                },
                "examples": [
                    {
                        "en": "It was raining hard when we set off.",
                        "vi": "Trời mưa to khi chúng tôi khởi hành."
                    }
                ]
            },
            {
                "define": {
                    "en": "at a sharp angle to the left/right",
                    "vi": "ở một góc nhọn sang trái / phải"
                },
                "examples": [
                    {
                        "en": "Turn hard right at the next junction.",
                        "vi": "Rẽ mạnh sang phải ở ngã ba tiếp theo."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be or feel unfairly treated",
                    "vi": "bị hoặc cảm thấy bị đối xử bất công"
                },
                "examples": [
                    {
                        "en": "She has every right to feel hard done by—her parents have given her nothing.",
                        "vi": "Cô ấy có mọi quyền để cảm thấy khó khăn khi làm - cha mẹ cô ấy không cho cô ấy điều gì."
                    }
                ]
            },
            {
                "define": {
                    "en": "to find it very difficult to do something",
                    "vi": "cảm thấy rất khó để làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "He was hard put to it to explain her disappearance.",
                        "vi": "Anh thật khó để giải thích sự biến mất của cô."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have too few or too little of something",
                    "vi": "có quá ít hoặc quá ít thứ gì đó"
                },
                "examples": [
                    {
                        "en": "We're hard up for ideas.",
                        "vi": "Chúng tôi đang cố gắng lên ý tưởng."
                    }
                ]
            },
            {
                "define": {
                    "en": "very soon after",
                    "vi": "rất nhanh sau đó"
                },
                "examples": [
                    {
                        "en": "His death followed hard on hers.",
                        "vi": "Cái chết của anh kéo theo cô rất nhiều."
                    }
                ]
            },
            {
                "define": {
                    "en": "very close behind somebody/something; very soon after something",
                    "vi": "rất gần sau ai đó / cái gì đó; rất nhanh sau một cái gì đó"
                },
                "examples": [
                    {
                        "en": "He turned and fled with Peter hot on his heels.",
                        "vi": "Anh ta quay lại và bỏ chạy với Peter nóng bỏng trên gót chân của mình."
                    },
                    {
                        "en": "They reached the border with the police hot on their heels.",
                        "vi": "Họ đến biên giới với cảnh sát nóng bỏng gót chân của họ."
                    },
                    {
                        "en": "Further successes came hot on the heels of her first best-selling novel.",
                        "vi": "Những thành công tiếp theo đến với cuốn tiểu thuyết bán chạy nhất đầu tiên của cô."
                    },
                    {
                        "en": "News of rising unemployment followed hard on the heels of falling export figures.",
                        "vi": "Tin tức về tỷ lệ thất nghiệp gia tăng kéo theo sự sụt giảm của số liệu xuất khẩu."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that things change very slowly",
                    "vi": "từng nói rằng mọi thứ thay đổi rất chậm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be very upset by something",
                    "vi": "rất khó chịu vì điều gì đó"
                },
                "examples": [
                    {
                        "en": "He took his wife's death very hard.",
                        "vi": "Anh ta lấy cái chết của vợ rất vất vả."
                    }
                ]
            }
        ]
    },
    {
        "id": "39cb5e6b9183479bbde6d29fbd0a0484",
        "word": "battle",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈbætl/",
            "us": "/ˈbætl/"
        },
        "nearby": [
            {
                "word": "Battery Park",
                "pos": ""
            },
            {
                "word": "batting average",
                "pos": "noun"
            },
            {
                "word": "battle",
                "pos": "noun"
            },
            {
                "word": "battle",
                "pos": "verb"
            },
            {
                "word": "battleaxe",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a fight between armies, ships or planes, especially during a war; a violent fight between groups of people",
                    "vi": "một cuộc chiến giữa quân đội, tàu hoặc máy bay, đặc biệt là trong chiến tranh; một cuộc chiến bạo lực giữa các nhóm người"
                },
                "examples": [
                    {
                        "en": "Napoleon was defeated at the Battle of Waterloo.",
                        "vi": "Napoléon bị đánh bại trong trận Waterloo."
                    },
                    {
                        "en": "in battle His father had been killed in battle.",
                        "vi": "trong trận chiến Cha anh đã bị giết trong trận chiến."
                    },
                    {
                        "en": "to go into battle",
                        "vi": "đi vào trận chiến"
                    },
                    {
                        "en": "battle with somebody Hundreds of protesters fought running battles with the police.",
                        "vi": "trận chiến với ai đó Hàng trăm người biểu tình đã chiến đấu với cảnh sát."
                    },
                    {
                        "en": "battle against somebody In 1817 Bolivar won a series of battles against Spanish forces.",
                        "vi": "Trận chiến chống lại ai đó Năm 1817, Bolivar đã giành chiến thắng trong một loạt trận chiến chống lại lực lượng Tây Ban Nha."
                    },
                    {
                        "en": "battle between A and B It ended in a gun battle between police and drug smugglers.",
                        "vi": "Trận chiến giữa A và B Nó kết thúc trong một cuộc đấu súng giữa cảnh sát và những kẻ buôn lậu ma túy."
                    }
                ]
            },
            {
                "define": {
                    "en": "a competition, an argument or a struggle between people or groups of people trying to win power or control",
                    "vi": "một cuộc cạnh tranh, một cuộc tranh cãi hoặc một cuộc đấu tranh giữa những người hoặc nhóm người cố gắng giành quyền lực hoặc quyền kiểm soát"
                },
                "examples": [
                    {
                        "en": "battle for something She finally won her six-year battle for compensation.",
                        "vi": "trận chiến vì một thứ gì đó Cuối cùng cô ấy đã chiến thắng trong trận chiến sáu năm của mình để được đền bù."
                    },
                    {
                        "en": "battle with somebody (for something) They are engaged in a legal battle with their competitors.",
                        "vi": "chiến đấu với ai đó (vì điều gì đó) Họ đang tham gia vào một cuộc chiến pháp lý với các đối thủ cạnh tranh của họ."
                    },
                    {
                        "en": "battle against somebody He faces an uphill battle against a hostile press.",
                        "vi": "trận chiến chống lại ai đó Anh ấy phải đối mặt với một cuộc chiến khó khăn chống lại một báo chí thù địch."
                    },
                    {
                        "en": "a battle of wits (= when each side uses their ability to think quickly to try to win)",
                        "vi": "một cuộc đấu trí (= khi mỗi bên sử dụng khả năng suy nghĩ nhanh chóng của mình để cố gắng giành chiến thắng)"
                    },
                    {
                        "en": "a battle of wills (= when each side is very determined to win)",
                        "vi": "một trận chiến của ý chí (= khi mỗi bên đều rất quyết tâm giành chiến thắng)"
                    },
                    {
                        "en": "the battle of the sexes",
                        "vi": "cuộc chiến của hai giới"
                    },
                    {
                        "en": "battle between A and B The essay discusses the endless battle between man and nature.",
                        "vi": "Trận chiến giữa A và B Bài văn bàn về cuộc chiến không hồi kết giữa con người và thiên nhiên."
                    },
                    {
                        "en": "battle over something The government now faces a new battle over tax increases.",
                        "vi": "cuộc chiến về một cái gì đó Chính phủ hiện phải đối mặt với một cuộc chiến mới về việc tăng thuế."
                    }
                ]
            },
            {
                "define": {
                    "en": "a determined effort that somebody makes to solve a difficult problem or succeed in a difficult situation",
                    "vi": "một nỗ lực quyết tâm mà ai đó thực hiện để giải quyết một vấn đề khó khăn hoặc thành công trong một tình huống khó khăn"
                },
                "examples": [
                    {
                        "en": "battle against something She finally lost her long battle against cancer.",
                        "vi": "Trận chiến chống lại thứ gì đó Cuối cùng cô ấy đã thua trận chiến dài chống lại căn bệnh ung thư."
                    },
                    {
                        "en": "He has fought an uphill battle against prejudice.",
                        "vi": "Anh ấy đã chiến đấu một trận chiến khó khăn chống lại định kiến."
                    },
                    {
                        "en": "battle for something Her life had become a battle for survival.",
                        "vi": "cuộc chiến giành lấy một thứ gì đó Cuộc sống của cô ấy đã trở thành một trận chiến để sinh tồn."
                    },
                    {
                        "en": "the battle for human rights",
                        "vi": "cuộc chiến cho quyền con người"
                    },
                    {
                        "en": "battle with something his battle with alcoholism",
                        "vi": "chiến đấu với thứ gì đó trận chiến của anh ấy với chứng nghiện rượu"
                    },
                    {
                        "en": "battle to do something They have been at the forefront of the battle to save the hospital.",
                        "vi": "trận chiến để làm điều gì đó Họ đã đi đầu trong cuộc chiến để cứu bệnh viện."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that people or groups have shown which side they intend to support in an argument or contest that is going to begin",
                    "vi": "được sử dụng để nói rằng mọi người hoặc nhóm đã chỉ ra rằng họ dự định ủng hộ phe nào trong một cuộc tranh cãi hoặc cuộc cạnh tranh sắp bắt đầu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to fight or argue with somebody",
                    "vi": "chiến đấu hoặc tranh luận với ai đó"
                },
                "examples": [
                    {
                        "en": "He was quite prepared to do battle with his boss over his promotion.",
                        "vi": "Anh ấy đã khá chuẩn bị sẵn sàng để chiến đấu với ông chủ của mình để được thăng chức."
                    },
                    {
                        "en": "Are you prepared to do battle with your insurance company over the claim?",
                        "vi": "Bạn đã chuẩn bị để đấu tranh với công ty bảo hiểm của mình về yêu cầu bồi thường chưa?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be able to win an argument or get what you want without anyone’s help",
                    "vi": "để có thể thắng trong một cuộc tranh luận hoặc đạt được những gì bạn muốn mà không cần sự trợ giúp của bất kỳ ai"
                },
                "examples": [
                    {
                        "en": "I wouldn't get involved—he's old enough to fight his own battles.",
                        "vi": "Tôi sẽ không tham gia — anh ấy đủ lớn để chiến đấu trong các trận chiến của riêng mình."
                    },
                    {
                        "en": "My parents believed in leaving me to fight my own battles.",
                        "vi": "Cha mẹ tôi đã tin tưởng khi để tôi chiến đấu trong những trận chiến của chính mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "the most important or difficult part of achieving something",
                    "vi": "phần quan trọng hoặc khó khăn nhất của việc đạt được điều gì đó"
                },
                "examples": [
                    {
                        "en": "When you’ve got a difficult day ahead, getting a good night’s sleep is often half the battle.",
                        "vi": "Khi bạn có một ngày khó khăn phía trước, thì việc ngủ một giấc ngon lành thường là một nửa của trận chiến."
                    }
                ]
            },
            {
                "define": {
                    "en": "to begin fighting somebody",
                    "vi": "bắt đầu chiến đấu với ai đó"
                },
                "examples": [
                    {
                        "en": "The two armies joined battle.",
                        "vi": "Hai đội quân tham chiến."
                    },
                    {
                        "en": "(figurative) Local residents have joined battle with the council over the lack of parking facilities.",
                        "vi": "(nghĩa bóng) Cư dân địa phương đã tham gia cuộc chiến với hội đồng về việc thiếu bãi đậu xe."
                    }
                ]
            },
            {
                "define": {
                    "en": "(to try to do) something that you will probably never succeed in doing",
                    "vi": "(cố gắng làm) điều gì đó mà bạn có thể sẽ không bao giờ thành công khi làm"
                },
                "examples": [
                    {
                        "en": "I’m fighting a losing battle against the mess in this house!",
                        "vi": "Tôi đang chiến đấu một trận thua với mớ hỗn độn trong ngôi nhà này!"
                    },
                    {
                        "en": "She wanted him to take some responsibility for his actions, but she knew it was a losing battle.",
                        "vi": "Cô muốn anh phải chịu trách nhiệm về hành động của mình, nhưng cô biết đó là một trận thua."
                    }
                ]
            }
        ]
    },
    {
        "id": "cecf7892a4a649aaa4f3edcf603abb25",
        "word": "difficulty",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈdɪfɪkəlti/",
            "us": "/ˈdɪfɪkəlti/"
        },
        "nearby": [
            {
                "word": "differently",
                "pos": "adverb"
            },
            {
                "word": "difficult",
                "pos": "adjective"
            },
            {
                "word": "difficulty",
                "pos": "noun"
            },
            {
                "word": "diffidence",
                "pos": "noun"
            },
            {
                "word": "diffident",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a problem; a thing or situation that causes problems",
                    "vi": "vấn đề; một sự vật hoặc tình huống gây ra vấn đề"
                },
                "examples": [
                    {
                        "en": "the difficulties of English syntax",
                        "vi": "những khó khăn của cú pháp tiếng Anh"
                    },
                    {
                        "en": "a patient with breathing difficulties",
                        "vi": "một bệnh nhân khó thở"
                    },
                    {
                        "en": "They encountered numerous difficulties while making the film.",
                        "vi": "Họ gặp vô số khó khăn trong khi thực hiện bộ phim."
                    },
                    {
                        "en": "She had been experiencing technical difficulties.",
                        "vi": "Cô ấy đã gặp khó khăn về kỹ thuật."
                    },
                    {
                        "en": "I think we've managed to overcome most of the practical difficulties.",
                        "vi": "Tôi nghĩ chúng tôi đã vượt qua được hầu hết những khó khăn thực tế."
                    },
                    {
                        "en": "I know the kinds of difficulties faced by parents and teachers.",
                        "vi": "Tôi biết những khó khăn mà cha mẹ và giáo viên phải đối mặt."
                    },
                    {
                        "en": "difficulties with something We've run into difficulties with the new project.",
                        "vi": "khó khăn với một cái gì đó Chúng tôi đã gặp khó khăn với dự án mới."
                    },
                    {
                        "en": "difficulty with something I'm having difficulty with the engine.",
                        "vi": "khó khăn với một cái gì đó Tôi đang gặp khó khăn với động cơ."
                    },
                    {
                        "en": "in difficulties He was often in financial difficulties.",
                        "vi": "trong khó khăn Anh ấy thường gặp khó khăn về tài chính."
                    },
                    {
                        "en": "in difficulty He got into difficulty while swimming and had to be rescued.",
                        "vi": "trong khó khăn Anh ấy gặp khó khăn trong khi bơi và phải được cứu."
                    },
                    {
                        "en": "It was a time fraught with difficulties and frustration.",
                        "vi": "Đó là khoảng thời gian đầy khó khăn và thất vọng."
                    }
                ]
            },
            {
                "define": {
                    "en": "the state or quality of being hard to do or to understand; the effort that something involves",
                    "vi": "trạng thái hoặc chất lượng khó thực hiện hoặc khó hiểu; nỗ lực mà một cái gì đó liên quan đến"
                },
                "examples": [
                    {
                        "en": "difficulty (in) doing something I had considerable difficulty (in) persuading her to leave.",
                        "vi": "khó khăn (trong) làm điều gì đó Tôi đã gặp khó khăn đáng kể (trong) thuyết phục cô ấy rời đi."
                    },
                    {
                        "en": "I had no difficulty (in) making myself understood.",
                        "vi": "Tôi đã không gặp khó khăn (trong) để làm cho mình hiểu."
                    },
                    {
                        "en": "with difficulty He spoke slowly and with great difficulty.",
                        "vi": "với sự khó khăn Anh ấy nói chậm và rất khó khăn."
                    },
                    {
                        "en": "The changes were made with surprisingly little difficulty.",
                        "vi": "Những thay đổi đã được thực hiện với một chút khó khăn đáng ngạc nhiên."
                    },
                    {
                        "en": "without difficulty We found the house without difficulty.",
                        "vi": "không có khó khăn Chúng tôi đã tìm thấy ngôi nhà mà không gặp khó khăn."
                    },
                    {
                        "en": "difficulty of doing something They discussed the difficulty of studying abroad.",
                        "vi": "Khó khăn khi làm điều gì đó Họ đã thảo luận về khó khăn của việc học tập ở nước ngoài."
                    }
                ]
            },
            {
                "define": {
                    "en": "how hard something is",
                    "vi": "một cái gì đó khó làm sao"
                },
                "examples": [
                    {
                        "en": "Both roles had a high degree of difficulty.",
                        "vi": "Cả hai vai trò đều có độ khó cao."
                    },
                    {
                        "en": "The games have varying levels of difficulty.",
                        "vi": "Các trò chơi có nhiều mức độ khó khác nhau."
                    },
                    {
                        "en": "questions of increasing difficulty",
                        "vi": "câu hỏi ngày càng khó"
                    },
                    {
                        "en": "The walks in the book vary in difficulty.",
                        "vi": "Các bước đi trong cuốn sách khác nhau về độ khó."
                    }
                ]
            }
        ]
    },
    {
        "id": "e55046bedd4b4e2d90de9227cc83af8d",
        "word": "barely",
        "pos": "adverb",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈbeəli/",
            "us": "/ˈberli/"
        },
        "nearby": [
            {
                "word": "bareheaded",
                "pos": "adjective, adverb"
            },
            {
                "word": "bare-knuckle",
                "pos": "adjective"
            },
            {
                "word": "barely",
                "pos": "adverb"
            },
            {
                "word": "bareness",
                "pos": "noun"
            },
            {
                "word": "barf",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "in a way that is just possible but only with difficulty",
                    "vi": "theo một cách vừa có thể nhưng chỉ gặp khó khăn"
                },
                "examples": [
                    {
                        "en": "He could barely read and write.",
                        "vi": "Anh ta hầu như không thể đọc và viết."
                    },
                    {
                        "en": "The music was barely audible.",
                        "vi": "Âm nhạc hầu như không nghe thấy."
                    },
                    {
                        "en": "She was barely able to stand.",
                        "vi": "Cô gần như không thể đứng vững."
                    },
                    {
                        "en": "We barely had time to catch the train.",
                        "vi": "Chúng tôi hầu như không có thời gian để bắt tàu."
                    }
                ]
            },
            {
                "define": {
                    "en": "in a way that almost does not happen or exist",
                    "vi": "theo một cách gần như không xảy ra hoặc tồn tại"
                },
                "examples": [
                    {
                        "en": "She barely acknowledged his presence.",
                        "vi": "Cô hầu như không thừa nhận sự hiện diện của anh ta."
                    },
                    {
                        "en": "There was barely any smell.",
                        "vi": "Hầu như không có bất kỳ mùi nào."
                    }
                ]
            },
            {
                "define": {
                    "en": "just; certainly not more than (a particular amount, age, time, etc.)",
                    "vi": "chỉ cần; chắc chắn không nhiều hơn (một số lượng cụ thể, độ tuổi, thời gian, v.v.)"
                },
                "examples": [
                    {
                        "en": "Barely 50% of the population voted.",
                        "vi": "Chỉ có 50% dân số bỏ phiếu."
                    },
                    {
                        "en": "He was barely 20 years old and already running his own company.",
                        "vi": "Anh ấy chỉ mới 20 tuổi và đã điều hành công ty của riêng mình."
                    },
                    {
                        "en": "They arrived barely a minute later.",
                        "vi": "Họ đã đến chỉ một phút sau đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "only a very short time before",
                    "vi": "chỉ một thời gian rất ngắn trước đó"
                },
                "examples": [
                    {
                        "en": "I had barely started speaking when he interrupted me.",
                        "vi": "Tôi chưa kịp nói thì anh ta đã cắt ngang lời tôi."
                    }
                ]
            }
        ]
    },
    {
        "id": "7b2aa820192e49028c46d7992877382b",
        "word": "battle",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈbætl/",
            "us": "/ˈbætl/"
        },
        "nearby": [
            {
                "word": "batting average",
                "pos": "noun"
            },
            {
                "word": "battle",
                "pos": "noun"
            },
            {
                "word": "battle",
                "pos": "verb"
            },
            {
                "word": "battleaxe",
                "pos": "noun"
            },
            {
                "word": "Battle Creek",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to try very hard to achieve something difficult or to deal with something unpleasant or dangerous",
                    "vi": "cố gắng rất nhiều để đạt được điều gì đó khó khăn hoặc đối phó với điều gì đó khó chịu hoặc nguy hiểm"
                },
                "examples": [
                    {
                        "en": "Both teams battled hard.",
                        "vi": "Cả hai đội đã chiến đấu khó khăn."
                    },
                    {
                        "en": "battle for something The two leaders are battling for control of the government.",
                        "vi": "trận chiến vì điều gì đó Hai nhà lãnh đạo đang chiến đấu để giành quyền kiểm soát chính phủ."
                    },
                    {
                        "en": "battle with somebody/something She's still battling with a knee injury.",
                        "vi": "chiến đấu với ai đó / cái gì đó Cô ấy vẫn đang chiến đấu với chấn thương đầu gối."
                    },
                    {
                        "en": "battle against somebody/something We had to battle against the elements to reach safety.",
                        "vi": "chiến đấu chống lại ai đó / cái gì đó Chúng tôi phải chiến đấu chống lại các yếu tố để đạt được an toàn."
                    },
                    {
                        "en": "battle over something Residents are battling over plans for a new airport runway.",
                        "vi": "tranh cãi về điều gì đó Cư dân đang đấu tranh về các kế hoạch cho một đường băng sân bay mới."
                    },
                    {
                        "en": "battle it out The two sides will battle it out in the final next week.",
                        "vi": "Trận chiến hai bên sẽ chiến đấu trong trận chung kết vào tuần tới."
                    },
                    {
                        "en": "battle + adv. It’s vital that we keep battling away at the problem.",
                        "vi": "trận chiến + adv. Điều quan trọng là chúng ta phải tiếp tục chiến đấu với vấn đề."
                    },
                    {
                        "en": "battle to do something Doctors battled to keep her alive.",
                        "vi": "trận chiến để làm điều gì đó Các bác sĩ đã chiến đấu để giữ cho cô ấy sống sót."
                    },
                    {
                        "en": "I had to battle hard just to stay afloat.",
                        "vi": "Tôi đã phải chiến đấu khó khăn chỉ để duy trì sự nổi."
                    },
                    {
                        "en": "battle something He battled cancer for four years.",
                        "vi": "chiến đấu với điều gì đó Anh ấy đã chiến đấu với căn bệnh ung thư trong bốn năm."
                    }
                ]
            }
        ]
    },
    {
        "id": "11f017585e4a49f191cca14c8698daae",
        "word": "big",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/bɪɡ/",
            "us": "/bɪɡ/"
        },
        "nearby": [
            {
                "word": "bifurcation",
                "pos": "noun"
            },
            {
                "word": "big time",
                "pos": "adverb"
            },
            {
                "word": "big",
                "pos": "adjective"
            },
            {
                "word": "big",
                "pos": "adverb"
            },
            {
                "word": "big",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "large in size, degree, amount, etc.",
                    "vi": "lớn về kích thước, mức độ, số lượng, v.v."
                },
                "examples": [
                    {
                        "en": "a big man/house/increase",
                        "vi": "một người đàn ông lớn / ngôi nhà / sự gia tăng"
                    },
                    {
                        "en": "This shirt isn't big enough.",
                        "vi": "Cái áo này không đủ lớn."
                    },
                    {
                        "en": "It's the world's biggest computer company.",
                        "vi": "Đó là công ty máy tính lớn nhất thế giới."
                    },
                    {
                        "en": "(informal) He had this great big grin on his face.",
                        "vi": "(thân mật) Anh ấy có nụ cười toe toét tuyệt vời này trên khuôn mặt của mình."
                    },
                    {
                        "en": "The lobster's claws are bigger than human hands.",
                        "vi": "Móng vuốt của tôm hùm to hơn cả bàn tay của con người."
                    },
                    {
                        "en": "The festival is getting bigger every year.",
                        "vi": "Lễ hội mỗi năm một lớn hơn."
                    },
                    {
                        "en": "Her smile grew bigger.",
                        "vi": "Nụ cười của cô ngày càng lớn."
                    },
                    {
                        "en": "They were earning big money.",
                        "vi": "Họ đã kiếm được số tiền lớn."
                    },
                    {
                        "en": "The news came as a big blow.",
                        "vi": "Tin tức đến như một cú đánh lớn."
                    }
                ]
            },
            {
                "define": {
                    "en": "older",
                    "vi": "lớn hơn"
                },
                "examples": [
                    {
                        "en": "my big brother",
                        "vi": "anh trai lớn của tôi"
                    },
                    {
                        "en": "You're a big girl now.",
                        "vi": "Bây giờ bạn là một cô gái lớn."
                    }
                ]
            },
            {
                "define": {
                    "en": "important; serious",
                    "vi": "quan trọng; nghiêm túc"
                },
                "examples": [
                    {
                        "en": "It's a big decision to have to make.",
                        "vi": "Đó là một quyết định lớn cần phải thực hiện."
                    },
                    {
                        "en": "You are making a big mistake.",
                        "vi": "Bạn đang mắc một sai lầm lớn."
                    },
                    {
                        "en": "Unemployment is a big problem in the region.",
                        "vi": "Thất nghiệp là một vấn đề lớn trong khu vực."
                    },
                    {
                        "en": "This legislation will make a big difference.",
                        "vi": "Luật này sẽ tạo ra sự khác biệt lớn."
                    },
                    {
                        "en": "The big question is: why did they do it?",
                        "vi": "Câu hỏi lớn là: tại sao họ làm điều đó?"
                    },
                    {
                        "en": "Housing is a big issue in London.",
                        "vi": "Nhà ở là một vấn đề lớn ở London."
                    },
                    {
                        "en": "a potentially big drawback",
                        "vi": "một nhược điểm tiềm ẩn lớn"
                    },
                    {
                        "en": "She took the stage for her big moment.",
                        "vi": "Cô ấy đã lên sân khấu cho khoảnh khắc trọng đại của mình."
                    },
                    {
                        "en": "It doesn't get bigger than the World Cup Final!",
                        "vi": "Nó không lớn hơn trận Chung kết World Cup!"
                    },
                    {
                        "en": "Tonight is the biggest match of his career.",
                        "vi": "Đêm nay là trận đấu lớn nhất trong sự nghiệp của anh ấy."
                    },
                    {
                        "en": "(informal) Do you really think we can take on the big boys (= compete with the most powerful people)?",
                        "vi": "(không chính thức) Bạn có thực sự nghĩ rằng chúng ta có thể đối đầu với các ông lớn (= cạnh tranh với những người quyền lực nhất) không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "needing a lot of effort, money or time to succeed",
                    "vi": "cần nhiều nỗ lực, tiền bạc hoặc thời gian để thành công"
                },
                "examples": [
                    {
                        "en": "They're full of big ideas.",
                        "vi": "Họ chứa đầy những ý tưởng lớn."
                    }
                ]
            },
            {
                "define": {
                    "en": "popular with the public; successful",
                    "vi": "phổ biến với công chúng; thành công"
                },
                "examples": [
                    {
                        "en": "Orange is the big colour this year.",
                        "vi": "Màu cam là màu lớn trong năm nay."
                    },
                    {
                        "en": "big in… The band's very big in Japan.",
                        "vi": "lớn ở… Ban nhạc rất lớn ở Nhật Bản."
                    }
                ]
            },
            {
                "define": {
                    "en": "enthusiastic about somebody/something",
                    "vi": "nhiệt tình với ai đó / điều gì đó"
                },
                "examples": [
                    {
                        "en": "I'm a big fan of hers.",
                        "vi": "Tôi là một fan hâm mộ lớn của cô ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "doing something often or to a large degree",
                    "vi": "làm điều gì đó thường xuyên hoặc ở một mức độ lớn"
                },
                "examples": [
                    {
                        "en": "a big eater/drinker/spender",
                        "vi": "một người ăn nhiều / uống rượu / tiêu xài hoang phí"
                    }
                ]
            },
            {
                "define": {
                    "en": "kind or generous",
                    "vi": "tốt bụng hoặc hào phóng"
                },
                "examples": [
                    {
                        "en": "He gave me an extra five pounds for two hours' work. I thought ‘That's big of you’.",
                        "vi": "Anh ấy đã cho tôi thêm năm bảng Anh cho hai giờ làm việc. Tôi đã nghĩ 'Con to thật đấy'."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be/become too proud of yourself; to behave as if you are more important than you really are",
                    "vi": "trở nên quá tự hào về bản thân; cư xử như thể bạn quan trọng hơn bạn thực sự"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "an important and powerful person, especially in an organization",
                    "vi": "một người quan trọng và quyền lực, đặc biệt là trong một tổ chức"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to say that you are not impressed by something",
                    "vi": "từng nói rằng bạn không bị ấn tượng bởi điều gì đó"
                },
                "examples": [
                    {
                        "en": "So he earns more than me. Big deal!",
                        "vi": "Vì vậy, anh ấy kiếm được nhiều hơn tôi. Việc lớn!"
                    }
                ]
            },
            {
                "define": {
                    "en": "the most important person or thing",
                    "vi": "người hoặc điều quan trọng nhất"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "an important person (in a small community)",
                    "vi": "một người quan trọng (trong một cộng đồng nhỏ)"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "an offensive term for a weak man, who is not brave or confident",
                    "vi": "một thuật ngữ xúc phạm cho một người đàn ông yếu đuối, không dũng cảm hoặc không tự tin"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the ability to keep moving ahead of your competitors, especially in politics",
                    "vi": "khả năng tiếp tục đi trước các đối thủ cạnh tranh của bạn, đặc biệt là trong lĩnh vực chính trị"
                },
                "examples": [
                    {
                        "en": "In politics, momentum is known as the big mo.",
                        "vi": "Trong chính trị, động lượng được gọi là động lượng lớn."
                    },
                    {
                        "en": "He's picking up a lot of support and has the big mo.",
                        "vi": "Anh ấy đang nhận được rất nhiều hỗ trợ và có mo lớn."
                    }
                ]
            },
            {
                "define": {
                    "en": "an important person",
                    "vi": "một người quan trọng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the situation as a whole",
                    "vi": "tình hình nói chung"
                },
                "examples": [
                    {
                        "en": "Right now forget the details and take a look at the big picture.",
                        "vi": "Ngay bây giờ hãy quên các chi tiết và nhìn vào bức tranh lớn."
                    }
                ]
            },
            {
                "define": {
                    "en": "the use or threat of force or power",
                    "vi": "việc sử dụng hoặc đe dọa vũ lực hoặc quyền lực"
                },
                "examples": [
                    {
                        "en": "The authorities used quiet persuasion instead of the big stick.",
                        "vi": "Các nhà chức trách đã sử dụng sự thuyết phục yên lặng thay vì cây gậy lớn."
                    }
                ]
            },
            {
                "define": {
                    "en": "the three, four, etc. most important countries, people, companies, etc.",
                    "vi": "ba, bốn, v.v. quốc gia, con người, công ty, v.v. quan trọng nhất."
                },
                "examples": [
                    {
                        "en": "She works for one of the Big Six.",
                        "vi": "Cô ấy làm việc cho một trong Big Six."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that somebody has been greedy by taking more food than they can eat",
                    "vi": "từng nói rằng ai đó đã tham lam khi lấy nhiều thức ăn hơn mức họ có thể ăn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to show your approval of somebody by clapping your hands; to be applauded in this way",
                    "vi": "để thể hiện sự tán thành của bạn đối với ai đó bằng cách vỗ tay của bạn; được tán thưởng theo cách này"
                },
                "examples": [
                    {
                        "en": "Ladies and gentlemen, let’s give a big hand to our special guests tonight.",
                        "vi": "Thưa quý vị và các bạn, hãy chung tay thật lớn cho những vị khách đặc biệt của chúng ta vào tối nay."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have more important or more interesting things to do",
                    "vi": "có nhiều việc quan trọng hơn hoặc thú vị hơn để làm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be bad at keeping secrets",
                    "vi": "kém trong việc giữ bí mật"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to talk too much, especially about your own abilities and achievements",
                    "vi": "nói quá nhiều, đặc biệt là về khả năng và thành tích của chính bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "on a large/small scale",
                    "vi": "trên quy mô lớn / nhỏ"
                },
                "examples": [
                    {
                        "en": "The new delivery service has taken off in a big way.",
                        "vi": "Dịch vụ giao hàng mới đã phát triển vượt bậc."
                    },
                    {
                        "en": "Many people are investing in a small way in the stock market.",
                        "vi": "Nhiều người đang đầu tư một cách nhỏ lẻ vào thị trường chứng khoán."
                    },
                    {
                        "en": "He then started spending money in a big way.",
                        "vi": "Sau đó anh ta bắt đầu tiêu tiền một cách lớn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make something seem more important than it really is",
                    "vi": "để làm cho một cái gì đó có vẻ quan trọng hơn nó thực sự"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used when you realize that you have said something that you should not have said",
                    "vi": "được sử dụng khi bạn nhận ra rằng bạn đã nói điều gì đó mà lẽ ra bạn không nên nói"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to say that something is not important or not a problem",
                    "vi": "được sử dụng để nói rằng một cái gì đó không quan trọng hoặc không phải là một vấn đề"
                },
                "examples": [
                    {
                        "en": "If I don't win it's no big deal.",
                        "vi": "Nếu tôi không thắng thì cũng không có gì to tát."
                    }
                ]
            },
            {
                "define": {
                    "en": "so important to the economy of a country that when it finds itself in financial trouble, the government or central bank must act to save it",
                    "vi": "rất quan trọng đối với nền kinh tế của một quốc gia đến nỗi khi quốc gia đó gặp khó khăn về tài chính, chính phủ hoặc ngân hàng trung ương phải hành động để cứu"
                },
                "examples": [
                    {
                        "en": "Shouldering the huge costs of rescuing banks that are too big to fail has been left to taxpayers.",
                        "vi": "Việc giảm bớt chi phí khổng lồ trong việc giải cứu các ngân hàng quá lớn không thể thất bại đã được phó mặc cho những người đóng thuế."
                    }
                ]
            }
        ]
    },
    {
        "id": "427d14c960634addb3518dca2b4714d5",
        "word": "crisis",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈkraɪsɪs/",
            "us": "/ˈkraɪsɪs/"
        },
        "nearby": [
            {
                "word": "Stafford Cripps",
                "pos": ""
            },
            {
                "word": "Crisco",
                "pos": ""
            },
            {
                "word": "crisis",
                "pos": "noun"
            },
            {
                "word": "Crisis",
                "pos": ""
            },
            {
                "word": "crisp",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a time of great danger, difficulty or doubt when problems must be solved or important decisions must be made",
                    "vi": "một thời điểm rất nguy hiểm, khó khăn hoặc nghi ngờ khi các vấn đề phải được giải quyết hoặc phải đưa ra các quyết định quan trọng"
                },
                "examples": [
                    {
                        "en": "an economic/a financial crisis",
                        "vi": "một cuộc khủng hoảng kinh tế / tài chính"
                    },
                    {
                        "en": "The government is attempting to solve the debt crisis through spending cuts.",
                        "vi": "Chính phủ đang nỗ lực giải quyết cuộc khủng hoảng nợ thông qua việc cắt giảm chi tiêu."
                    },
                    {
                        "en": "The government is facing a political crisis.",
                        "vi": "Chính phủ đang phải đối mặt với một cuộc khủng hoảng chính trị."
                    },
                    {
                        "en": "a humanitarian crisis created by war and drought",
                        "vi": "một cuộc khủng hoảng nhân đạo do chiến tranh và hạn hán gây ra"
                    },
                    {
                        "en": "a housing/an energy crisis",
                        "vi": "một cuộc khủng hoảng nhà ở / năng lượng"
                    },
                    {
                        "en": "to resolve/solve/address a crisis",
                        "vi": "giải quyết / giải quyết / giải quyết một cuộc khủng hoảng"
                    },
                    {
                        "en": "in crisis The business is still in crisis but it has survived the worst of the recession.",
                        "vi": "trong khủng hoảng Doanh nghiệp vẫn đang trong khủng hoảng nhưng nó đã vượt qua giai đoạn tồi tệ nhất của cuộc suy thoái."
                    },
                    {
                        "en": "The Labour Party was facing an identity crisis.",
                        "vi": "Đảng Lao động đang phải đối mặt với một cuộc khủng hoảng danh tính."
                    },
                    {
                        "en": "an expert in crisis management",
                        "vi": "một chuyên gia trong quản lý khủng hoảng"
                    },
                    {
                        "en": "We provide help to families in crisis situations.",
                        "vi": "Chúng tôi cung cấp sự giúp đỡ cho các gia đình trong tình huống khủng hoảng."
                    },
                    {
                        "en": "I know which friends I can turn to in times of crisis.",
                        "vi": "Tôi biết tôi có thể tìm đến những người bạn nào trong thời gian khủng hoảng."
                    },
                    {
                        "en": "crisis of something The party was suffering a crisis of confidence among its supporters (= they did not trust it any longer).",
                        "vi": "khủng hoảng về điều gì đó Đảng đang bị khủng hoảng niềm tin đối với những người ủng hộ (= họ không còn tin tưởng nữa)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a time when a problem, a bad situation or an illness is at its worst point",
                    "vi": "thời điểm mà một vấn đề, một tình huống xấu hoặc một căn bệnh đang ở điểm tồi tệ nhất của nó"
                },
                "examples": [
                    {
                        "en": "Their marriage has reached crisis point.",
                        "vi": "Cuộc hôn nhân của họ đã đến lúc khủng hoảng."
                    },
                    {
                        "en": "The fever has passed its crisis.",
                        "vi": "Cơn sốt đã qua cơn khủng hoảng."
                    },
                    {
                        "en": "The team's dismal season has reached crisis point.",
                        "vi": "Mùa giải ảm đạm của đội bóng đã đến thời điểm khủng hoảng."
                    }
                ]
            }
        ]
    },
    {
        "id": "44e2828c5ee049a0b116bdef49c2c250",
        "word": "struggle",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈstrʌɡl/",
            "us": "/ˈstrʌɡl/"
        },
        "nearby": [
            {
                "word": "structure",
                "pos": "verb"
            },
            {
                "word": "strudel",
                "pos": "noun"
            },
            {
                "word": "struggle",
                "pos": "verb"
            },
            {
                "word": "struggle",
                "pos": "noun"
            },
            {
                "word": "struggle along",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to try very hard to do something when it is difficult or when there are a lot of problems",
                    "vi": "cố gắng rất nhiều để làm điều gì đó khi nó khó khăn hoặc khi có nhiều vấn đề"
                },
                "examples": [
                    {
                        "en": "life as a struggling artist (= one who is very poor)",
                        "vi": "cuộc sống như một nghệ sĩ chật vật (= một người rất nghèo)"
                    },
                    {
                        "en": "struggle for something Shona struggled for breath.",
                        "vi": "đấu tranh cho một cái gì đó Shona đấu tranh cho hơi thở."
                    },
                    {
                        "en": "a country struggling for independence",
                        "vi": "một đất nước đấu tranh giành độc lập"
                    },
                    {
                        "en": "struggle to do something The firm is struggling to cope with the demand for its products.",
                        "vi": "đấu tranh để làm điều gì đó Công ty đang phải vật lộn để đối phó với nhu cầu về sản phẩm của mình."
                    },
                    {
                        "en": "Local workers were still struggling to find employment.",
                        "vi": "Người lao động địa phương vẫn chật vật tìm việc làm."
                    },
                    {
                        "en": "Most social enterprises struggle to survive.",
                        "vi": "Hầu hết các doanh nghiệp xã hội đều phải vật lộn để tồn tại."
                    },
                    {
                        "en": "We're already struggling to keep up with demand.",
                        "vi": "Chúng tôi đang phải vật lộn để theo kịp nhu cầu."
                    },
                    {
                        "en": "They struggled just to pay their bills.",
                        "vi": "Họ phải vật lộn để thanh toán các hóa đơn của mình."
                    },
                    {
                        "en": "She struggled for 10 years to achieve success as an actress.",
                        "vi": "Cô đã phải vật lộn trong 10 năm để đạt được thành công với tư cách là một diễn viên."
                    },
                    {
                        "en": "I was unemployed and struggling financially.",
                        "vi": "Tôi đã thất nghiệp và gặp khó khăn về tài chính."
                    },
                    {
                        "en": "The housing market continues to struggle.",
                        "vi": "Thị trường nhà đất tiếp tục gặp khó khăn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to move somewhere or do something with difficulty",
                    "vi": "để di chuyển đến một nơi nào đó hoặc làm điều gì đó khó khăn"
                },
                "examples": [
                    {
                        "en": "I struggled up the hill with the heavy bags.",
                        "vi": "Tôi vật lộn với những chiếc túi nặng trĩu lên đồi."
                    },
                    {
                        "en": "Paul struggled out of his wheelchair.",
                        "vi": "Paul chật vật ra khỏi xe lăn."
                    },
                    {
                        "en": "She had to struggle into the tight dress.",
                        "vi": "Cô phải chật vật trong chiếc váy bó sát."
                    }
                ]
            },
            {
                "define": {
                    "en": "to fight against somebody/something in order to prevent a bad situation or result",
                    "vi": "chiến đấu chống lại ai đó / cái gì đó để ngăn chặn một tình huống hoặc kết quả xấu"
                },
                "examples": [
                    {
                        "en": "Chloe continued to struggle, but her eyes began to close.",
                        "vi": "Chloe tiếp tục đấu tranh, nhưng mắt cô bắt đầu nhắm lại."
                    },
                    {
                        "en": "struggle against somebody/something He struggled against cancer for two years.",
                        "vi": "đấu tranh chống lại ai đó / điều gì đó Anh ấy đã đấu tranh chống lại căn bệnh ung thư trong hai năm."
                    },
                    {
                        "en": "We should all struggle against injustice.",
                        "vi": "Tất cả chúng ta nên đấu tranh chống lại sự bất công."
                    },
                    {
                        "en": "struggle with somebody/something I have been struggling with injury for a couple of years",
                        "vi": "đấu tranh với ai đó / điều gì đó mà tôi đã phải vật lộn với chấn thương trong vài năm"
                    },
                    {
                        "en": "I am struggling with the same issues that other people are.",
                        "vi": "Tôi đang đấu tranh với những vấn đề tương tự như những người khác."
                    },
                    {
                        "en": "Lisa struggled with her conscience before talking to the police.",
                        "vi": "Lisa đã đấu tranh với lương tâm của mình trước khi nói chuyện với cảnh sát."
                    }
                ]
            },
            {
                "define": {
                    "en": "to fight somebody or try to get away from them",
                    "vi": "để chống lại ai đó hoặc cố gắng tránh xa họ"
                },
                "examples": [
                    {
                        "en": "I struggled and screamed for help.",
                        "vi": "Tôi vùng vẫy và la hét để được giúp đỡ."
                    },
                    {
                        "en": "struggle with somebody James was hit in the mouth as he struggled with the raiders.",
                        "vi": "vật lộn với ai đó James đã bị đánh vào miệng khi anh ta vật lộn với những kẻ cướp."
                    },
                    {
                        "en": "+ adj. How did she manage to struggle free?",
                        "vi": "Err:509"
                    }
                ]
            },
            {
                "define": {
                    "en": "to compete or argue with somebody/something, especially in order to get something",
                    "vi": "để cạnh tranh hoặc tranh luận với ai đó / điều gì đó, đặc biệt là để đạt được thứ gì đó"
                },
                "examples": [
                    {
                        "en": "struggle for something rival leaders struggling for power",
                        "vi": "đấu tranh cho một cái gì đó mà các nhà lãnh đạo đối thủ đang tranh giành quyền lực"
                    },
                    {
                        "en": "struggle with somebody/something (for something) countries struggling with each other for economic and military advantage",
                        "vi": "đấu tranh với ai đó / điều gì đó (vì điều gì đó) các quốc gia đang đấu tranh với nhau vì lợi thế kinh tế và quân sự"
                    }
                ]
            }
        ]
    },
    {
        "id": "d35233e3bf704b60b6b3645ebb734b07",
        "word": "agonizing",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈæɡənaɪzɪŋ/",
            "us": "/ˈæɡənaɪzɪŋ/"
        },
        "nearby": [
            {
                "word": "agonize",
                "pos": "verb"
            },
            {
                "word": "agonized",
                "pos": "adjective"
            },
            {
                "word": "agonizing",
                "pos": "adjective"
            },
            {
                "word": "agonizingly",
                "pos": "adverb"
            },
            {
                "word": "agony",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "causing great pain, worry or difficulty",
                    "vi": "gây ra đau đớn, lo lắng hoặc khó khăn"
                },
                "examples": [
                    {
                        "en": "his father’s agonizing death",
                        "vi": "cái chết đau đớn của cha anh ấy"
                    },
                    {
                        "en": "It was the most agonizing decision of her life.",
                        "vi": "Đó là quyết định đau đớn nhất trong cuộc đời cô."
                    }
                ]
            }
        ]
    },
    {
        "id": "68651502b866423eb3de2da8151977e9",
        "word": "assault",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/əˈsɔːlt/",
            "us": "/əˈsɔːlt/"
        },
        "nearby": [
            {
                "word": "assassinate",
                "pos": "verb"
            },
            {
                "word": "assassination",
                "pos": "noun"
            },
            {
                "word": "assault",
                "pos": "noun"
            },
            {
                "word": "assault",
                "pos": "verb"
            },
            {
                "word": "assault and battery",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the crime of attacking somebody physically",
                    "vi": "tội tấn công ai đó về thể chất"
                },
                "examples": [
                    {
                        "en": "Both men were charged with assault.",
                        "vi": "Cả hai người đàn ông đều bị buộc tội hành hung."
                    },
                    {
                        "en": "sexual assaults",
                        "vi": "tấn công tình dục"
                    },
                    {
                        "en": "assault on/upon somebody A significant number of indecent assaults on women go unreported.",
                        "vi": "hành hung / vào ai đó Một số lượng đáng kể các vụ hành hung phụ nữ không đứng đắn đối với phụ nữ không được báo cáo."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of attacking a building, an area, etc. in order to take control of it",
                    "vi": "hành động tấn công một tòa nhà, một khu vực, v.v. để kiểm soát nó"
                },
                "examples": [
                    {
                        "en": "An assault on the capital was launched in the early hours of the morning.",
                        "vi": "Một cuộc tấn công vào thủ đô đã được phát động vào đầu giờ sáng."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of trying to achieve something that is difficult or dangerous",
                    "vi": "hành động cố gắng đạt được điều gì đó khó khăn hoặc nguy hiểm"
                },
                "examples": [
                    {
                        "en": "The government has mounted a new assault on unemployment.",
                        "vi": "Chính phủ đã tiến hành một cuộc tấn công mới đối với tình trạng thất nghiệp."
                    },
                    {
                        "en": "a two-year legal assault on alleged tax fraud",
                        "vi": "một cuộc tấn công pháp lý kéo dài hai năm về cáo buộc gian lận thuế"
                    },
                    {
                        "en": "Three people died during an assault on the mountain (= while trying to climb it).",
                        "vi": "Ba người đã chết trong một cuộc tấn công trên núi (= trong khi cố gắng leo lên nó)."
                    }
                ]
            },
            {
                "define": {
                    "en": "an act of criticizing somebody/something severely",
                    "vi": "một hành động chỉ trích ai đó / điều gì đó nghiêm trọng"
                },
                "examples": [
                    {
                        "en": "The suggested closures came under assault from all parties.",
                        "vi": "Việc đóng cửa được đề xuất đã bị tấn công từ tất cả các bên."
                    },
                    {
                        "en": "assault on/upon/against somebody/something The paper's assault on the president was totally unjustified.",
                        "vi": "cuộc tấn công vào / khi / chống lại ai đó / cái gì Cuộc tấn công của tờ báo đối với tổng thống là hoàn toàn không chính đáng."
                    }
                ]
            },
            {
                "define": {
                    "en": "an act that threatens to harm somebody physically, whether or not actual harm is done",
                    "vi": "một hành động đe dọa làm tổn hại đến thể chất ai đó, cho dù tổn hại thực sự có được thực hiện hay không"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "172bb06fe0454c15aa86769e0dac6f01",
        "word": "elusive",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ɪˈluːsɪv/",
            "us": "/ɪˈluːsɪv/"
        },
        "nearby": [
            {
                "word": "elucidation",
                "pos": "noun"
            },
            {
                "word": "elude",
                "pos": "verb"
            },
            {
                "word": "elusive",
                "pos": "adjective"
            },
            {
                "word": "elusively",
                "pos": "adverb"
            },
            {
                "word": "elusiveness",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "difficult to find, define or achieve",
                    "vi": "khó tìm, xác định hoặc đạt được"
                },
                "examples": [
                    {
                        "en": "Eric, as elusive as ever, was nowhere to be found.",
                        "vi": "Eric, luôn luôn khó nắm bắt, không tìm thấy ở đâu cả."
                    },
                    {
                        "en": "the elusive concept of ‘literature’",
                        "vi": "khái niệm khó nắm bắt về 'văn học'"
                    },
                    {
                        "en": "A solution to the problem of toxic waste is proving elusive.",
                        "vi": "Một giải pháp cho vấn đề thải độc đang tỏ ra khó nắm bắt."
                    }
                ]
            }
        ]
    },
    {
        "id": "3e1c8c2ef08b4c1090fd71943e840188",
        "word": "elusively",
        "pos": "adverb",
        "level": "c1",
        "phonetic": {
            "uk": "/ɪˈluːsɪvli/",
            "us": "/ɪˈluːsɪvli/"
        },
        "nearby": [
            {
                "word": "elude",
                "pos": "verb"
            },
            {
                "word": "elusive",
                "pos": "adjective"
            },
            {
                "word": "elusively",
                "pos": "adverb"
            },
            {
                "word": "elusiveness",
                "pos": "noun"
            },
            {
                "word": "elver",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "in a way that is difficult to find, define or achieve",
                    "vi": "theo một cách khó tìm, xác định hoặc khó đạt được"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "51c269de748744d2b0e64452ec49878e",
        "word": "in the face of something",
        "pos": "idiom",
        "level": "c1",
        "phonetic": {
            "uk": "/feɪs/",
            "us": "/feɪs/"
        },
        "nearby": [
            {
                "word": "fabulously",
                "pos": "adverb"
            },
            {
                "word": "facade",
                "pos": "noun"
            },
            {
                "word": "face",
                "pos": "noun"
            },
            {
                "word": "face",
                "pos": "verb"
            },
            {
                "word": "Facebook",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the front part of the head, where the eyes, nose and mouth are",
                    "vi": "phần trước của đầu, nơi có mắt, mũi và miệng"
                },
                "examples": [
                    {
                        "en": "a pretty/pale/round face",
                        "vi": "một khuôn mặt xinh xắn / nhợt nhạt / tròn trịa"
                    },
                    {
                        "en": "He buried his face in his hands.",
                        "vi": "Anh vùi mặt vào tay mình."
                    },
                    {
                        "en": "to hide/cover your face",
                        "vi": "để ẩn / che khuôn mặt của bạn"
                    },
                    {
                        "en": "on somebody's face You should have seen the look on her face when I told her!",
                        "vi": "trên khuôn mặt của ai đó Bạn nên nhìn thấy vẻ mặt của cô ấy khi tôi nói với cô ấy!"
                    },
                    {
                        "en": "The expression on his face never changed.",
                        "vi": "Biểu cảm trên mặt anh ta không hề thay đổi."
                    },
                    {
                        "en": "in the face She was red in the face with embarrassment.",
                        "vi": "vào mặt Cô ấy đỏ mặt vì xấu hổ."
                    },
                    {
                        "en": "At that time, her face was on the covers of all the magazines.",
                        "vi": "Vào thời điểm đó, gương mặt của cô ấy đã xuất hiện trên trang bìa của tất cả các tạp chí."
                    }
                ]
            },
            {
                "define": {
                    "en": "an expression that is shown on somebody’s face",
                    "vi": "một biểu cảm được thể hiện trên khuôn mặt của ai đó"
                },
                "examples": [
                    {
                        "en": "a smiling/happy/sad face",
                        "vi": "một khuôn mặt tươi cười / hạnh phúc / buồn bã"
                    },
                    {
                        "en": "Her face lit up (= showed happiness) when she spoke of the past.",
                        "vi": "Mặt cô ấy sáng lên (= thể hiện sự hạnh phúc) khi cô ấy nói về quá khứ."
                    },
                    {
                        "en": "His face fell (= showed disappointment, sadness, etc.) when he read the headlines.",
                        "vi": "Mặt anh ấy xịu xuống (= thể hiện sự thất vọng, buồn bã, v.v.) khi đọc các tiêu đề."
                    },
                    {
                        "en": "I could tell by his face it hadn't gone well.",
                        "vi": "Tôi có thể nhận ra bằng khuôn mặt của anh ấy rằng mọi chuyện đã không diễn ra tốt đẹp."
                    },
                    {
                        "en": "Sue's face was a picture (= she looked very surprised, angry, etc.) as she listened to her husband's speech.",
                        "vi": "Khuôn mặt của Sue như một bức tranh (= cô ấy trông rất ngạc nhiên, tức giận, v.v.) khi cô ấy lắng nghe bài phát biểu của chồng mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to refer to a person of the type mentioned",
                    "vi": "được sử dụng để chỉ một người thuộc loại được đề cập"
                },
                "examples": [
                    {
                        "en": "She looked around for a familiar face.",
                        "vi": "Cô nhìn xung quanh để tìm một khuôn mặt quen thuộc."
                    },
                    {
                        "en": "He's a fresh face (= somebody new) at the company.",
                        "vi": "Anh ấy là một gương mặt tươi tắn (= ai đó mới) ở công ty."
                    },
                    {
                        "en": "It's nice to see some new faces here this evening.",
                        "vi": "Thật vui khi thấy một số gương mặt mới ở đây vào tối nay."
                    },
                    {
                        "en": "The movie is full of famous faces.",
                        "vi": "Phim quy tụ đầy đủ các gương mặt nổi tiếng."
                    },
                    {
                        "en": "a well-known face on our television screens",
                        "vi": "một gương mặt nổi tiếng trên màn hình tivi của chúng ta"
                    },
                    {
                        "en": "I'm tired of seeing the same old faces every time we go out!",
                        "vi": "Tôi mệt mỏi khi nhìn thấy những khuôn mặt cũ giống nhau mỗi khi chúng tôi đi chơi!"
                    }
                ]
            },
            {
                "define": {
                    "en": "having the type of face or expression mentioned",
                    "vi": "có kiểu khuôn mặt hoặc biểu cảm được đề cập"
                },
                "examples": [
                    {
                        "en": "pale-faced",
                        "vi": "mặt tái mét"
                    },
                    {
                        "en": "a freckle-faced boy",
                        "vi": "một cậu bé mặt tàn nhang"
                    },
                    {
                        "en": "grim-faced",
                        "vi": "mặt dữ tợn"
                    },
                    {
                        "en": "a sad-faced woman",
                        "vi": "một người phụ nữ có khuôn mặt buồn"
                    }
                ]
            },
            {
                "define": {
                    "en": "a side or surface of something",
                    "vi": "một mặt hoặc bề mặt của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "the north face of the mountain",
                        "vi": "mặt phía bắc của ngọn núi"
                    },
                    {
                        "en": "the dark face of the moon",
                        "vi": "mặt trăng bóng tối"
                    },
                    {
                        "en": "A steep path zigzags down the cliff face.",
                        "vi": "Một con đường dốc ngoằn ngoèo xuống mặt vách đá."
                    },
                    {
                        "en": "We could see tiny figures climbing the rock face.",
                        "vi": "Chúng tôi có thể nhìn thấy những hình người nhỏ bé đang leo lên mặt đá."
                    },
                    {
                        "en": "Ivy covered the front face of the house.",
                        "vi": "Cây thường xuân che mặt trước của ngôi nhà."
                    },
                    {
                        "en": "A banner hung across the face of the building.",
                        "vi": "Một biểu ngữ được treo trên mặt của tòa nhà."
                    },
                    {
                        "en": "How many faces does a cube have?",
                        "vi": "Hình lập phương có bao nhiêu mặt?"
                    }
                ]
            },
            {
                "define": {
                    "en": "the front part of a clock or watch",
                    "vi": "phần trước của đồng hồ hoặc đồng hồ đeo tay"
                },
                "examples": [
                    {
                        "en": "a dial like the face of a clock",
                        "vi": "một mặt số giống như mặt đồng hồ"
                    }
                ]
            },
            {
                "define": {
                    "en": "the particular character of something",
                    "vi": "nhân vật cụ thể của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "face of something the changing face of Britain",
                        "vi": "đối mặt với một cái gì đó thay đổi bộ mặt của nước Anh"
                    },
                    {
                        "en": "This discovery changed the whole face of science.",
                        "vi": "Khám phá này đã thay đổi toàn bộ bộ mặt của khoa học."
                    },
                    {
                        "en": "with a… face bureaucracy with a human face",
                        "vi": "với một… bộ mặt quan liêu với một khuôn mặt của con người"
                    }
                ]
            },
            {
                "define": {
                    "en": "a particular aspect of something",
                    "vi": "một khía cạnh cụ thể của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "Social deprivation is the unacceptable face of capitalism.",
                        "vi": "Sự thiếu thốn về mặt xã hội là bộ mặt không thể chấp nhận được của chủ nghĩa tư bản."
                    },
                    {
                        "en": "He has become the public face of the company.",
                        "vi": "Anh ấy đã trở thành gương mặt đại diện cho công ty."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to describe something that you have failed to see, even though it was obvious and should have been easy to see",
                    "vi": "được sử dụng để mô tả một cái gì đó mà bạn không thể nhìn thấy, mặc dù nó rõ ràng và đáng lẽ phải dễ dàng nhìn thấy"
                },
                "examples": [
                    {
                        "en": "The answer was staring us in the face but we never saw it until it was too late.",
                        "vi": "Câu trả lời đang nhìn chằm chằm vào mặt chúng tôi nhưng chúng tôi không bao giờ nhìn thấy nó cho đến khi quá muộn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be certain to happen",
                    "vi": "chắc chắn sẽ xảy ra"
                },
                "examples": [
                    {
                        "en": "Defeat was staring them in the face.",
                        "vi": "Thất bại đang nhìn chằm chằm vào mặt họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be unable to avoid something",
                    "vi": "không thể tránh một cái gì đó"
                },
                "examples": [
                    {
                        "en": "They were staring defeat in the face.",
                        "vi": "Họ đang nhìn chằm chằm vào thất bại khi đối mặt."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be very obvious to other people from the expression on somebody’s face",
                    "vi": "rất rõ ràng đối với người khác từ biểu hiện trên khuôn mặt của ai đó"
                },
                "examples": [
                    {
                        "en": "Guilt was written all over his face.",
                        "vi": "Cảm giác tội lỗi hiện rõ trên khuôn mặt anh."
                    }
                ]
            },
            {
                "define": {
                    "en": "if a plan, etc. blows up in your face, it goes badly wrong in a way that causes you damage or makes you feel embarrassed",
                    "vi": "nếu một kế hoạch, v.v. thổi vào mặt bạn, nó sẽ trở nên sai lầm nghiêm trọng theo hướng khiến bạn thiệt hại hoặc khiến bạn cảm thấy xấu hổ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to do something when you are angry that is meant to harm somebody else but that also harms you",
                    "vi": "làm điều gì đó khi bạn tức giận có nghĩa là để làm hại người khác nhưng điều đó cũng gây hại cho bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to disappear completely",
                    "vi": "biến mất hoàn toàn"
                },
                "examples": [
                    {
                        "en": "Keep looking—they can't just have vanished off the face of the earth.",
                        "vi": "Hãy tiếp tục tìm kiếm — chúng không thể biến mất khỏi mặt đất."
                    }
                ]
            },
            {
                "define": {
                    "en": "to try to do something as hard and as long as you possibly can but without success",
                    "vi": "cố gắng làm điều gì đó khó và miễn là bạn có thể nhưng không thành công"
                },
                "examples": [
                    {
                        "en": "You can argue till you're blue in the face, but you won't change my mind.",
                        "vi": "Bạn có thể tranh luận cho đến khi bạn xanh mặt, nhưng bạn sẽ không thay đổi ý kiến của tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that somebody will/will not get a particular job or position because they have/do not have the appearance, personality, etc. that the employer wants, even when this should not be important",
                    "vi": "được sử dụng để nói rằng ai đó sẽ / sẽ không nhận được một công việc hoặc vị trí cụ thể bởi vì họ có / không có ngoại hình, tính cách, v.v. mà nhà tuyển dụng mong muốn, ngay cả khi điều này không quan trọng"
                },
                "examples": [
                    {
                        "en": "If your face fits, you'll get the job.",
                        "vi": "Nếu khuôn mặt của bạn phù hợp, bạn sẽ nhận được công việc."
                    },
                    {
                        "en": "It doesn't matter how well qualified you are; if your face doesn't fit, you don't stand a chance.",
                        "vi": "Không quan trọng là bạn có đủ điều kiện như thế nào; nếu khuôn mặt của bạn không phù hợp, bạn không có cơ hội."
                    }
                ]
            },
            {
                "define": {
                    "en": "somebody looks very angry",
                    "vi": "ai đó trông rất tức giận"
                },
                "examples": [
                    {
                        "en": "Mr Hibbs came in with a face like thunder.",
                        "vi": "Ông Hibbs bước vào với khuôn mặt như sấm sét."
                    }
                ]
            },
            {
                "define": {
                    "en": "close to and looking at somebody",
                    "vi": "gần và nhìn ai đó"
                },
                "examples": [
                    {
                        "en": "The two have never met face to face before.",
                        "vi": "Cả hai chưa bao giờ gặp mặt trực tiếp trước đây."
                    },
                    {
                        "en": "The room fell silent as she came face to face with the man who had tried to kill her.",
                        "vi": "Căn phòng im lặng khi cô đối mặt với kẻ đã cố giết cô."
                    }
                ]
            },
            {
                "define": {
                    "en": "in a situation where you have to accept that something is true and deal with it",
                    "vi": "trong một tình huống mà bạn phải chấp nhận rằng điều gì đó là đúng và đối phó với nó"
                },
                "examples": [
                    {
                        "en": "She was at an early age brought face to face with the horrors of war.",
                        "vi": "Khi còn nhỏ, cô đã phải đối mặt với sự khủng khiếp của chiến tranh."
                    }
                ]
            },
            {
                "define": {
                    "en": "with your face and stomach facing upwards/downwards",
                    "vi": "với mặt và bụng của bạn hướng lên trên / xuống dưới"
                },
                "examples": [
                    {
                        "en": "She lay face down on the bed.",
                        "vi": "Cô nằm úp mặt xuống giường."
                    }
                ]
            },
            {
                "define": {
                    "en": "with the front part or surface facing upwards/downwards",
                    "vi": "với phần trước hoặc bề mặt hướng lên trên / xuống dưới"
                },
                "examples": [
                    {
                        "en": "Place the card face up on the pile.",
                        "vi": "Đặt thẻ úp trên cọc."
                    },
                    {
                        "en": "She placed the cards face down on the table.",
                        "vi": "Cô đặt những tấm thẻ úp xuống bàn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to fall so that you are lying on your front",
                    "vi": "rơi xuống để bạn đang nằm trên mặt trước của bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to fail completely, usually in an embarrassing way",
                    "vi": "thất bại hoàn toàn, thường là một cách đáng xấu hổ"
                },
                "examples": [
                    {
                        "en": "His next television venture fell flat on its face.",
                        "vi": "Dự án truyền hình tiếp theo của anh ấy đã thất bại trên khuôn mặt của nó."
                    }
                ]
            },
            {
                "define": {
                    "en": "to eat a lot of food or too much food",
                    "vi": "ăn nhiều hoặc ăn quá nhiều"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to oppose or be the opposite of something that is usual or expected",
                    "vi": "phản đối hoặc đối lập với điều gì đó bình thường hoặc được mong đợi"
                },
                "examples": [
                    {
                        "en": "Such a proposal is flying in the face of common sense.",
                        "vi": "Một đề xuất như vậy đang bay theo lẽ thường."
                    }
                ]
            },
            {
                "define": {
                    "en": "to do something that other people think is rude or shows a lack of respect, without feeling embarrassed or ashamed",
                    "vi": "làm điều gì đó mà người khác cho là thô lỗ hoặc thể hiện sự thiếu tôn trọng mà không cảm thấy xấu hổ hoặc xấu hổ"
                },
                "examples": [
                    {
                        "en": "I don't know how you have the face to complain after everything they've done for you!",
                        "vi": "Tôi không biết bạn có khuôn mặt để phàn nàn như thế nào sau tất cả những gì họ đã làm cho bạn!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be made to look stupid",
                    "vi": "bị làm cho trông ngu ngốc"
                },
                "examples": [
                    {
                        "en": "They were left with egg on their faces when only ten people showed up.",
                        "vi": "Họ bị bỏ lại với quả trứng trên mặt khi chỉ có mười người xuất hiện."
                    }
                ]
            },
            {
                "define": {
                    "en": "annoying somebody by criticizing them or telling them what to do all the time",
                    "vi": "làm phiền ai đó bằng cách chỉ trích họ hoặc bảo họ phải làm gì mọi lúc"
                },
                "examples": [
                    {
                        "en": "Why are you always in my face?",
                        "vi": "Tại sao bạn luôn luôn đối mặt với tôi?"
                    }
                ]
            },
            {
                "define": {
                    "en": "despite problems, difficulties, etc.",
                    "vi": "bất chấp những vướng mắc, khó khăn, v.v."
                },
                "examples": [
                    {
                        "en": "She showed great courage in the face of danger.",
                        "vi": "Cô đã thể hiện sự dũng cảm khi đối mặt với nguy hiểm."
                    },
                    {
                        "en": "The campaign continued in the face of great opposition.",
                        "vi": "Chiến dịch tiếp tục vấp phải sự phản đối lớn."
                    }
                ]
            },
            {
                "define": {
                    "en": "as a result of something",
                    "vi": "kết quả của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "He was unable to deny the charges in the face of new evidence.",
                        "vi": "Anh không thể phủ nhận cáo buộc khi đối mặt với những bằng chứng mới."
                    }
                ]
            },
            {
                "define": {
                    "en": "to show in a very obvious way that you have no respect for somebody",
                    "vi": "thể hiện một cách rất rõ ràng rằng bạn không tôn trọng ai đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be forced to change from feeling pleased or satisfied to feeling disappointed or annoyed",
                    "vi": "buộc phải thay đổi từ cảm thấy hài lòng hoặc hài lòng sang cảm thấy thất vọng hoặc khó chịu"
                },
                "examples": [
                    {
                        "en": "He’ll be laughing on the other side of his face when he reads my letter.",
                        "vi": "Anh ấy sẽ cười trên khuôn mặt khác khi đọc bức thư của tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "(to have) an unhappy or disappointed expression",
                    "vi": "(có) một biểu hiện không vui hoặc thất vọng"
                },
                "examples": [
                    {
                        "en": "He took one look at her long face and said ‘What’s wrong?’",
                        "vi": "Anh nhìn vào khuôn mặt dài của cô và nói 'Có chuyện gì vậy?'"
                    },
                    {
                        "en": "The news for the company isn't good, judging from the long faces in the boardroom.",
                        "vi": "Tin tức cho công ty không tốt, xét từ những gương mặt dài trong phòng họp."
                    }
                ]
            },
            {
                "define": {
                    "en": "to look straight at somebody without feeling embarrassed or ashamed",
                    "vi": "nhìn thẳng vào ai đó mà không cảm thấy xấu hổ hay xấu hổ"
                },
                "examples": [
                    {
                        "en": "Can you look me in the eye and tell me you're not lying?",
                        "vi": "Bạn có thể nhìn vào mắt tôi và nói với tôi rằng bạn không nói dối?"
                    },
                    {
                        "en": "She looked her father straight in the eye and answered his question truthfully.",
                        "vi": "Cô nhìn thẳng vào mắt cha mình và trả lời thành thật câu hỏi của ông."
                    },
                    {
                        "en": "I'll never be able to look her in the face again!",
                        "vi": "Tôi sẽ không bao giờ có thể nhìn mặt cô ấy nữa!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be less respected or look stupid because of something you have done",
                    "vi": "ít được tôn trọng hoặc trông ngu ngốc vì điều gì đó bạn đã làm"
                },
                "examples": [
                    {
                        "en": "Many leaders don't want to lose face by admitting failures.",
                        "vi": "Nhiều nhà lãnh đạo không muốn bị mất mặt khi thừa nhận thất bại."
                    }
                ]
            },
            {
                "define": {
                    "en": "the state of being less respected by other people or looking stupid because of something you have done",
                    "vi": "trạng thái ít được người khác tôn trọng hoặc trông ngu ngốc vì điều gì đó bạn đã làm"
                },
                "examples": [
                    {
                        "en": "Failure to pass the exams means a massive loss of face for the students and their parents.",
                        "vi": "Không vượt qua được kỳ thi đồng nghĩa với việc học sinh và cha mẹ học sinh bị mất thể diện rất lớn."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to emphasize that you have particular skills or qualities",
                    "vi": "được sử dụng để nhấn mạnh rằng bạn có các kỹ năng hoặc phẩm chất cụ thể"
                },
                "examples": [
                    {
                        "en": "‘I didn't know you could play the piano.’ ‘I'm not just a pretty face, you know!’",
                        "vi": "Tôi không biết bạn có thể chơi piano.' 'Tôi không chỉ là một khuôn mặt xinh đẹp, bạn biết đấy!'"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that something seems to be good, true, etc. but that this opinion may need to be changed when you know more about it",
                    "vi": "được sử dụng để nói rằng điều gì đó có vẻ là tốt, đúng, v.v. nhưng ý kiến này có thể cần được thay đổi khi bạn biết thêm về nó"
                },
                "examples": [
                    {
                        "en": "On the face of it, it seems like a great deal.",
                        "vi": "Về mặt nó, nó có vẻ như là một việc lớn."
                    },
                    {
                        "en": "What may, on the face of it, seem obvious often turns out to be far more complicated.",
                        "vi": "Những gì có thể, trên mặt của nó, có vẻ rõ ràng thường trở nên phức tạp hơn nhiều."
                    }
                ]
            },
            {
                "define": {
                    "en": "very obvious",
                    "vi": "rất rõ ràng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to produce an expression on your face to show that you do not like somebody/something or in order to make somebody laugh",
                    "vi": "biểu hiện trên khuôn mặt của bạn để thể hiện rằng bạn không thích ai đó / điều gì đó hoặc để làm cho ai đó cười"
                },
                "examples": [
                    {
                        "en": "What are you pulling a face at now?",
                        "vi": "Bạn đang kéo một khuôn mặt vào lúc này?"
                    },
                    {
                        "en": "Do you think it’s funny to make faces behind my back?",
                        "vi": "Bạn có nghĩ thật buồn cười khi làm mặt sau lưng tôi không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to put on make-up",
                    "vi": "để trang điểm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to pretend that you feel confident and happy when you do not",
                    "vi": "giả vờ rằng bạn cảm thấy tự tin và hạnh phúc khi bạn không"
                },
                "examples": [
                    {
                        "en": "I had to put on a brave face and try to show him that I wasn’t worried.",
                        "vi": "Tôi phải tỏ ra dũng cảm và cố gắng cho anh ấy thấy rằng tôi không lo lắng."
                    },
                    {
                        "en": "She put a brave face on her illness.",
                        "vi": "Cô ấy dũng cảm đối mặt với bệnh tật của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to avoid or help somebody avoid being embarrassed",
                    "vi": "để tránh hoặc giúp ai đó khỏi xấu hổ"
                },
                "examples": [
                    {
                        "en": "She was fired, but she saved face by telling everyone she'd resigned.",
                        "vi": "Cô ấy đã bị sa thải, nhưng cô ấy đã cứu vãn thể diện bằng cách nói với mọi người rằng cô ấy sẽ từ chức."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be determined to oppose somebody/something",
                    "vi": "quyết tâm chống lại ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "Her father had set his face against the marriage.",
                        "vi": "Cha cô đã ra mặt phản đối cuộc hôn nhân."
                    }
                ]
            },
            {
                "define": {
                    "en": "to appear among your friends or in public",
                    "vi": "xuất hiện giữa bạn bè của bạn hoặc ở nơi công cộng"
                },
                "examples": [
                    {
                        "en": "She stayed at home, afraid to show her face.",
                        "vi": "Cô ở nhà sợ lộ mặt."
                    }
                ]
            },
            {
                "define": {
                    "en": "to shut a door hard when somebody is trying to come in",
                    "vi": "đóng chặt cửa khi ai đó đang cố gắng vào"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to refuse to talk to somebody or meet them, in a rude way",
                    "vi": "từ chối nói chuyện với ai đó hoặc gặp họ, một cách thô lỗ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a rude way of telling somebody to be quiet or stop talking",
                    "vi": "một cách thô lỗ để bảo ai đó im lặng hoặc ngừng nói"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "an action that seems to be intended as a deliberate way of offending and showing lack of respect for somebody",
                    "vi": "một hành động dường như là một cách cố ý xúc phạm và thể hiện sự thiếu tôn trọng đối với ai đó"
                },
                "examples": [
                    {
                        "en": "The closure of the school is a slap in the face to the local community.",
                        "vi": "Việc đóng cửa trường học là một cái tát vào mặt cộng đồng địa phương."
                    }
                ]
            },
            {
                "define": {
                    "en": "if you keep a straight face, you do not laugh or smile, although you find something funny",
                    "vi": "nếu bạn giữ một khuôn mặt thẳng thắn, bạn không cười hoặc không cười, mặc dù bạn thấy điều gì đó buồn cười"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "if you say something to somebody’s face, you say it to them directly rather than to other people",
                    "vi": "nếu bạn nói điều gì đó vào mặt ai đó, bạn nói điều đó trực tiếp với họ thay vì nói với người khác"
                },
                "examples": [
                    {
                        "en": "He’s a liar, and I’ve told him so to his face many times.",
                        "vi": "Anh ta là một kẻ nói dối, và tôi đã nói với anh ta như vậy trước mặt anh ta nhiều lần."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to refer to a person whose name you cannot remember",
                    "vi": "được sử dụng để chỉ một người mà bạn không thể nhớ tên"
                },
                "examples": [
                    {
                        "en": "Are you still working for what's her face?",
                        "vi": "Bạn vẫn đang làm việc cho khuôn mặt của cô ấy?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to destroy or remove somebody/something completely",
                    "vi": "để tiêu diệt hoặc loại bỏ ai đó / cái gì đó hoàn toàn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "8bae5da16dcd41859d3b01ea16ad9238",
        "word": "problematic",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌprɒbləˈmætɪk/",
            "us": "/ˌprɑːbləˈmætɪk/"
        },
        "nearby": [
            {
                "word": "problem",
                "pos": "noun"
            },
            {
                "word": "problem",
                "pos": "adjective"
            },
            {
                "word": "problematic",
                "pos": "adjective"
            },
            {
                "word": "problem-solving",
                "pos": "noun"
            },
            {
                "word": "pro bono",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "difficult to deal with or to understand; full of problems; not certain to be successful",
                    "vi": "khó đối phó hoặc khó hiểu; đầy rẫy các vấn đề; không nhất định thành công"
                },
                "examples": [
                    {
                        "en": "The situation is more problematic than we first thought.",
                        "vi": "Tình hình rắc rối hơn chúng ta nghĩ."
                    },
                    {
                        "en": "Which are the most problematic countries in the world for journalists?",
                        "vi": "Những quốc gia nào trên thế giới gặp nhiều vấn đề nhất đối với các nhà báo?"
                    }
                ]
            }
        ]
    },
    {
        "id": "d96b80c359264de0bc5d9c5c0fcd0984",
        "word": "up against something",
        "pos": "idiom",
        "level": "c1",
        "phonetic": {
            "uk": "/ʌp/",
            "us": "/ʌp/"
        },
        "nearby": [
            {
                "word": "unyielding",
                "pos": "adjective"
            },
            {
                "word": "unzip",
                "pos": "verb"
            },
            {
                "word": "up",
                "pos": "adverb"
            },
            {
                "word": "up",
                "pos": "preposition"
            },
            {
                "word": "up",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "towards or in a higher position",
                    "vi": "hướng tới hoặc ở một vị trí cao hơn"
                },
                "examples": [
                    {
                        "en": "He jumped up from his chair.",
                        "vi": "Anh ta bật dậy khỏi ghế."
                    },
                    {
                        "en": "Your mum said you were up here (= upstairs).",
                        "vi": "Mẹ của bạn nói rằng bạn đã lên đây (= trên lầu)."
                    },
                    {
                        "en": "The sun was already up (= had risen) when they set off.",
                        "vi": "Mặt trời đã mọc (= đã mọc) khi họ cất cánh."
                    },
                    {
                        "en": "They live up in the mountains.",
                        "vi": "Họ sống trên núi."
                    },
                    {
                        "en": "It didn't take long to put the tent up.",
                        "vi": "Không mất nhiều thời gian để dựng lều lên."
                    },
                    {
                        "en": "You look nice with your hair up (= arranged on top of or at the back of your head).",
                        "vi": "Bạn trông thật đẹp với mái tóc của mình (= được sắp xếp trên đỉnh đầu hoặc ở phía sau đầu của bạn)."
                    },
                    {
                        "en": "Lay the cards face up (= facing upwards) on the table.",
                        "vi": "Đặt các lá bài ngửa (= ngửa lên trên) trên bàn."
                    },
                    {
                        "en": "Up you come! (= said when lifting a child)",
                        "vi": "Lên đi! (= nói khi bế một đứa trẻ)"
                    },
                    {
                        "en": "The car was up on blocks.",
                        "vi": "Chiếc xe đã được lên trên các khối."
                    },
                    {
                        "en": "I was up on deck at first light.",
                        "vi": "Tôi đã lên boong từ lúc ánh sáng đầu tiên."
                    },
                    {
                        "en": "Two men were up on the roof, repairing a leak.",
                        "vi": "Hai người đàn ông đang ở trên mái nhà, sửa chữa chỗ dột."
                    },
                    {
                        "en": "I pinned the notice up on the wall.",
                        "vi": "Tôi ghim thông báo lên tường."
                    },
                    {
                        "en": "She tries to stay under water but she floats back up.",
                        "vi": "Cô ấy cố gắng ở dưới nước nhưng cô ấy lại nổi lên."
                    }
                ]
            },
            {
                "define": {
                    "en": "to or at a higher level",
                    "vi": "đến hoặc ở cấp độ cao hơn"
                },
                "examples": [
                    {
                        "en": "She turned the volume up.",
                        "vi": "Cô tăng âm lượng lên."
                    },
                    {
                        "en": "Prices are still going up (= rising).",
                        "vi": "Giá vẫn tăng (= tăng)."
                    },
                    {
                        "en": "United were 3–1 up at half-time.",
                        "vi": "United đã dẫn trước 3–1 trong hiệp một."
                    },
                    {
                        "en": "The wind is getting up (= blowing more strongly).",
                        "vi": "Gió đang dậy (= thổi mạnh hơn)."
                    },
                    {
                        "en": "Sales are well up on last year.",
                        "vi": "Doanh số bán hàng đã tăng vào năm ngoái."
                    }
                ]
            },
            {
                "define": {
                    "en": "to the place where somebody/something is",
                    "vi": "đến nơi mà ai đó / cái gì đó đang ở"
                },
                "examples": [
                    {
                        "en": "A car drove up and he got in.",
                        "vi": "Một chiếc ô tô chạy tới và anh ta vào trong."
                    },
                    {
                        "en": "She went straight up to the door and knocked loudly.",
                        "vi": "Cô ấy đi thẳng lên cửa và gõ rất to."
                    }
                ]
            },
            {
                "define": {
                    "en": "out of bed",
                    "vi": "ra khỏi giường"
                },
                "examples": [
                    {
                        "en": "I stayed up late (= did not go to bed until late) last night.",
                        "vi": "Tôi đã thức khuya (= không đi ngủ cho đến khuya) đêm qua."
                    },
                    {
                        "en": "(British English) He's up and about again after his illness.",
                        "vi": "(Tiếng Anh Anh) Anh ấy khỏe mạnh trở lại sau khi bị bệnh."
                    }
                ]
            },
            {
                "define": {
                    "en": "to or at an important place, especially a large city",
                    "vi": "đến hoặc tại một địa điểm quan trọng, đặc biệt là một thành phố lớn"
                },
                "examples": [
                    {
                        "en": "We're going up to New York for the day.",
                        "vi": "Chúng tôi sẽ đến New York trong ngày."
                    },
                    {
                        "en": "(British English, formal) His son's up at Oxford (= Oxford University).",
                        "vi": "(Tiếng Anh Anh, trang trọng) Con trai ông ấy học ở Oxford (= Đại học Oxford)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to a place in the north of a country; further north than somewhere else",
                    "vi": "đến một nơi ở phía bắc của một đất nước; xa hơn về phía bắc hơn một nơi khác"
                },
                "examples": [
                    {
                        "en": "They've moved up north.",
                        "vi": "Họ đã di chuyển lên phía bắc."
                    },
                    {
                        "en": "We drove up to Inverness to see my father.",
                        "vi": "Chúng tôi lái xe đến Inverness để gặp cha tôi."
                    },
                    {
                        "en": "I'm up there almost every other weekend",
                        "vi": "Tôi đến đó vào hầu hết các ngày cuối tuần khác"
                    },
                    {
                        "en": "Up here in Liverpool things are different.",
                        "vi": "Ở Liverpool đây mọi thứ khác hẳn."
                    }
                ]
            },
            {
                "define": {
                    "en": "completely",
                    "vi": "hoàn toàn"
                },
                "examples": [
                    {
                        "en": "We ate all the food up.",
                        "vi": "Chúng tôi đã ăn hết thức ăn."
                    },
                    {
                        "en": "The stream has dried up.",
                        "vi": "Dòng suối đã cạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "so as to be finished or closed",
                    "vi": "để được hoàn thành hoặc đóng cửa"
                },
                "examples": [
                    {
                        "en": "I have some paperwork to finish up.",
                        "vi": "Tôi có một số thủ tục giấy tờ để hoàn thành."
                    },
                    {
                        "en": "Do your coat up; it's cold.",
                        "vi": "Mặc áo khoác lên; trời lạnh."
                    }
                ]
            },
            {
                "define": {
                    "en": "into pieces or parts",
                    "vi": "thành từng mảnh hoặc bộ phận"
                },
                "examples": [
                    {
                        "en": "She tore the paper up.",
                        "vi": "Cô ấy xé tờ giấy."
                    },
                    {
                        "en": "They've had the road up (= with the surface broken or removed) to lay some pipes.",
                        "vi": "Họ đã làm đường lên (= với bề mặt bị vỡ hoặc bị loại bỏ) để đặt một số đường ống."
                    },
                    {
                        "en": "How shall we divide up the work?",
                        "vi": "Chúng ta sẽ phân chia công việc như thế nào?"
                    }
                ]
            },
            {
                "define": {
                    "en": "so as to be formed or brought together",
                    "vi": "để được hình thành hoặc kết hợp lại với nhau"
                },
                "examples": [
                    {
                        "en": "The government agreed to set up a committee of inquiry.",
                        "vi": "Chính phủ đã đồng ý thành lập một ủy ban điều tra."
                    },
                    {
                        "en": "She gathered up her belongings.",
                        "vi": "Cô thu dọn đồ đạc."
                    }
                ]
            },
            {
                "define": {
                    "en": "finished; over",
                    "vi": "đã kết thúc; kết thúc"
                },
                "examples": [
                    {
                        "en": "Time's up. Stop writing and hand in your papers.",
                        "vi": "Hết giờ rồi. Ngừng viết và nộp giấy tờ của bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that something is happening, especially something unusual or unpleasant",
                    "vi": "được sử dụng để nói rằng một cái gì đó đang xảy ra, đặc biệt là một cái gì đó bất thường hoặc khó chịu"
                },
                "examples": [
                    {
                        "en": "I could tell something was up by the looks on their faces.",
                        "vi": "Tôi có thể biết được điều gì đó đã xảy ra nhờ vẻ mặt của họ."
                    },
                    {
                        "en": "What's up? (= What is the matter?)",
                        "vi": "Có chuyện gì vậy? (= Có chuyện gì vậy?)"
                    },
                    {
                        "en": "What's up with him? He looks furious.",
                        "vi": "Có chuyện gì với anh ta? Anh ta trông rất tức giận."
                    },
                    {
                        "en": "Is anything up? You can tell me.",
                        "vi": "Có gì không? Bạn có thể nói với tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "about to happen, be discussed, etc.",
                    "vi": "sắp xảy ra, được thảo luận, v.v."
                },
                "examples": [
                    {
                        "en": "Next up in our top ten is a new release by Ariana Grande.",
                        "vi": "Tiếp theo trong top 10 của chúng tôi là một bản phát hành mới của Ariana Grande."
                    },
                    {
                        "en": "Up after the break we will be introducing our mystery guest!",
                        "vi": "Sau giờ giải lao, chúng tôi sẽ giới thiệu vị khách bí ẩn của chúng tôi!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be somebody’s duty or responsibility; to be for somebody to decide",
                    "vi": "là nghĩa vụ hoặc trách nhiệm của ai đó; để ai đó quyết định"
                },
                "examples": [
                    {
                        "en": "It's not up to you to tell me how to do my job.",
                        "vi": "Bạn không phải nói cho tôi biết cách thực hiện công việc của mình."
                    },
                    {
                        "en": "Shall we eat out or stay in? It's up to you.",
                        "vi": "Chúng ta sẽ ăn ngoài hay ở lại? Tuỳ bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be of poor quality; to not be very good",
                    "vi": "có chất lượng kém; không được tốt lắm"
                },
                "examples": [
                    {
                        "en": "His work isn't up to much.",
                        "vi": "Công việc của anh ấy không nhiều."
                    }
                ]
            },
            {
                "define": {
                    "en": "facing problems or opposition",
                    "vi": "đối mặt với các vấn đề hoặc sự chống đối"
                },
                "examples": [
                    {
                        "en": "Teachers are up against some major problems these days.",
                        "vi": "Những ngày này, các giáo viên đang phải đối mặt với một số vấn đề lớn."
                    },
                    {
                        "en": "She's really up against it (= in a difficult situation).",
                        "vi": "Cô ấy thực sự chống lại nó (= trong một tình huống khó khăn)."
                    }
                ]
            },
            {
                "define": {
                    "en": "moving upwards and downwards",
                    "vi": "di chuyển lên trên và xuống dưới"
                },
                "examples": [
                    {
                        "en": "The boat bobbed up and down on the water.",
                        "vi": "Con thuyền nhấp nhô trên mặt nước."
                    }
                ]
            },
            {
                "define": {
                    "en": "in one direction and then in the opposite direction",
                    "vi": "theo một hướng và sau đó theo hướng ngược lại"
                },
                "examples": [
                    {
                        "en": "She was pacing up and down in front of her desk.",
                        "vi": "Cô ấy đang đi đi lại lại trước bàn làm việc."
                    }
                ]
            },
            {
                "define": {
                    "en": "sometimes good and sometimes bad",
                    "vi": "đôi khi tốt và đôi khi xấu"
                },
                "examples": [
                    {
                        "en": "My relationship with him was up and down.",
                        "vi": "Mối quan hệ của tôi với anh ấy lên xuống thất thường."
                    }
                ]
            },
            {
                "define": {
                    "en": "if you swear up and down that something is true, you say that it is definitely true",
                    "vi": "nếu bạn thề thốt rằng điều gì đó là đúng, bạn nói rằng điều đó chắc chắn là đúng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "working; being used",
                    "vi": "đang làm việc; đang được sử dụng"
                },
                "examples": [
                    {
                        "en": "By that time the new system should be up and running.",
                        "vi": "Đến lúc đó hệ thống mới sẽ được khởi động và hoạt động."
                    }
                ]
            },
            {
                "define": {
                    "en": "appearing in front of somebody in authority for a judgement to be made about something that you have done",
                    "vi": "xuất hiện trước mặt ai đó có thẩm quyền để đưa ra phán quyết về việc bạn đã làm"
                },
                "examples": [
                    {
                        "en": "He came up before the local magistrate for speeding.",
                        "vi": "Anh ta đã đến trước mặt quan tòa địa phương vì đã chạy quá tốc độ."
                    }
                ]
            },
            {
                "define": {
                    "en": "on offer for something",
                    "vi": "được đề nghị cho một cái gì đó"
                },
                "examples": [
                    {
                        "en": "The house is up for sale.",
                        "vi": "Căn nhà được bán."
                    }
                ]
            },
            {
                "define": {
                    "en": "being considered for something, especially as a candidate",
                    "vi": "được xem xét cho một cái gì đó, đặc biệt là với tư cách là một ứng cử viên"
                },
                "examples": [
                    {
                        "en": "Two candidates are up for election.",
                        "vi": "Hai ứng cử viên sẽ được tranh cử."
                    }
                ]
            },
            {
                "define": {
                    "en": "willing to take part in a particular activity",
                    "vi": "sẵn sàng tham gia vào một hoạt động cụ thể"
                },
                "examples": [
                    {
                        "en": "We're going clubbing tonight. Are you up for it?",
                        "vi": "Tối nay chúng ta sẽ đi câu lạc bộ. Bạn có cho nó?"
                    }
                ]
            },
            {
                "define": {
                    "en": "among or almost the best, worst, most important, etc.",
                    "vi": "trong số hoặc gần như tốt nhất, tệ nhất, quan trọng nhất, v.v."
                },
                "examples": [
                    {
                        "en": "It may not have been the worst week of my life but it's up there.",
                        "vi": "Đó có thể không phải là tuần tồi tệ nhất trong cuộc đời tôi nhưng nó vẫn ở đó."
                    },
                    {
                        "en": "OK, it's not my absolute dream, but it's up there.",
                        "vi": "OK, đó không phải là giấc mơ tuyệt đối của tôi, nhưng nó ở đó."
                    },
                    {
                        "en": "These people can’t live without the internet—it’s up there with air and water.",
                        "vi": "Những người này không thể sống mà không có internet — nó ở trên đó với không khí và nước."
                    }
                ]
            },
            {
                "define": {
                    "en": "as far as a particular number, level, etc.",
                    "vi": "xa như một số cụ thể, cấp độ, v.v."
                },
                "examples": [
                    {
                        "en": "I can take up to four people (= but no more than four) in my car.",
                        "vi": "Tôi có thể chở tối đa bốn người (= nhưng không quá bốn người) trong xe của mình."
                    },
                    {
                        "en": "The temperature went up to 35°C.",
                        "vi": "Nhiệt độ lên đến 35 ° C."
                    }
                ]
            },
            {
                "define": {
                    "en": "not further or later than something; until something",
                    "vi": "không xa hơn hoặc muộn hơn một cái gì đó; cho đến khi một cái gì đó"
                },
                "examples": [
                    {
                        "en": "Read up to page 100.",
                        "vi": "Đọc đến trang 100."
                    },
                    {
                        "en": "Up to now he's been very quiet.",
                        "vi": "Cho đến nay anh ấy rất im lặng."
                    }
                ]
            },
            {
                "define": {
                    "en": "as high or as good as something",
                    "vi": "cao hoặc tốt như một cái gì đó"
                },
                "examples": [
                    {
                        "en": "Her latest book isn't up to her usual standard.",
                        "vi": "Cuốn sách mới nhất của cô ấy không đạt tiêu chuẩn thông thường của cô ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "physically or mentally capable of something",
                    "vi": "thể chất hoặc tinh thần có khả năng làm một cái gì đó"
                },
                "examples": [
                    {
                        "en": "He's not up to the job.",
                        "vi": "Anh ấy không hoàn thành công việc."
                    },
                    {
                        "en": "I don't feel up to going to work today.",
                        "vi": "Tôi không muốn đi làm hôm nay."
                    }
                ]
            },
            {
                "define": {
                    "en": "doing something, especially something bad",
                    "vi": "làm điều gì đó, đặc biệt là điều gì đó tồi tệ"
                },
                "examples": [
                    {
                        "en": "What's she up to?",
                        "vi": "Cô ấy định làm gì?"
                    },
                    {
                        "en": "What've you been up to?",
                        "vi": "Dạo này bạn như thế nào?"
                    },
                    {
                        "en": "I'm sure he's up to no good (= doing something bad).",
                        "vi": "Tôi chắc rằng anh ấy không tốt (= làm điều gì đó tồi tệ)."
                    }
                ]
            }
        ]
    },
    {
        "id": "c62fb9ae59754dfe9803d0c754dbd6a2",
        "word": "balk",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/bɔːk/",
            "us": "/bɔːk/"
        },
        "nearby": [
            {
                "word": "A J Balfour",
                "pos": ""
            },
            {
                "word": "the Balfour Declaration",
                "pos": ""
            },
            {
                "word": "balk",
                "pos": "verb"
            },
            {
                "word": "Balkan",
                "pos": "adjective"
            },
            {
                "word": "Balkanization",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to be unwilling to do something or become involved in something because it is difficult, dangerous, etc.",
                    "vi": "không sẵn sàng làm điều gì đó hoặc tham gia vào điều gì đó vì nó khó khăn, nguy hiểm, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to stop suddenly and refuse to jump a fence, etc.",
                    "vi": "dừng đột ngột và từ chối nhảy hàng rào, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to prevent somebody from getting something or doing something",
                    "vi": "để ngăn ai đó lấy một cái gì đó hoặc làm một cái gì đó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "66f0ee7fa8a74f619611b6ea4ae6f686",
        "word": "batten down the hatches",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbætn/",
            "us": "/ˈbætn/"
        },
        "nearby": [
            {
                "word": "battalion",
                "pos": "noun"
            },
            {
                "word": "batten",
                "pos": "noun"
            },
            {
                "word": "batten",
                "pos": "verb"
            },
            {
                "word": "Battenberg",
                "pos": "noun"
            },
            {
                "word": "batten down",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to prepare yourself for a period of difficulty or trouble",
                    "vi": "để chuẩn bị cho mình trong một giai đoạn khó khăn hoặc rắc rối"
                },
                "examples": [
                    {
                        "en": "A natural tendency in times of recession is to batten down the hatches and think about our own needs.",
                        "vi": "Một xu hướng tự nhiên trong thời kỳ suy thoái là thu mình lại và suy nghĩ về nhu cầu của chính chúng ta."
                    }
                ]
            },
            {
                "define": {
                    "en": "to shut all the entrances to the lower part, especially because a storm is expected",
                    "vi": "đóng tất cả các lối vào phần dưới, đặc biệt là vì dự kiến sẽ có bão"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "e40a348eb06e4945ad311f962f92a3a6",
        "word": "baulk",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/bɔːk/",
            "us": "/bɔːk/"
        },
        "nearby": [
            {
                "word": "baud",
                "pos": "noun"
            },
            {
                "word": "Bauhaus",
                "pos": "noun"
            },
            {
                "word": "baulk",
                "pos": "verb"
            },
            {
                "word": "bauxite",
                "pos": "noun"
            },
            {
                "word": "bawd",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to be unwilling to do something or become involved in something because it is difficult, dangerous, etc.",
                    "vi": "không sẵn sàng làm điều gì đó hoặc tham gia vào điều gì đó vì nó khó khăn, nguy hiểm, v.v."
                },
                "examples": [
                    {
                        "en": "Many parents may baulk at the idea of paying $100 for a pair of shoes.",
                        "vi": "Nhiều bậc cha mẹ có thể phản đối ý tưởng trả 100 đô la cho một đôi giày."
                    },
                    {
                        "en": "He baulked for a moment. ‘I can’t afford it,’ he finally admitted.",
                        "vi": "Anh bối rối trong giây lát. “Tôi không đủ khả năng chi trả,” cuối cùng anh ấy cũng thừa nhận."
                    }
                ]
            },
            {
                "define": {
                    "en": "to stop suddenly and refuse to jump a fence, etc.",
                    "vi": "dừng đột ngột và từ chối nhảy hàng rào, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to prevent somebody from getting something or doing something",
                    "vi": "để ngăn ai đó lấy một cái gì đó hoặc làm một cái gì đó"
                },
                "examples": [
                    {
                        "en": "(be) baulked of something She looked like a lion baulked of its prey.",
                        "vi": "(bị) vồ về cái gì đó Cô ấy trông giống như một con sư tử đang vồ mồi."
                    }
                ]
            }
        ]
    },
    {
        "id": "a6479e4b85fb4fc79d1067f53ed37a12",
        "word": "be no picnic",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpɪknɪk/",
            "us": "/ˈpɪknɪk/"
        },
        "nearby": [
            {
                "word": "pick-your-own",
                "pos": "adjective"
            },
            {
                "word": "pick yourself up",
                "pos": "phrasal verb"
            },
            {
                "word": "picnic",
                "pos": "noun"
            },
            {
                "word": "picnic",
                "pos": "verb"
            },
            {
                "word": "picnicker",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an occasion when people pack a meal and take it to eat outdoors, especially in the countryside",
                    "vi": "một dịp mà mọi người gói một bữa ăn và mang nó đi ăn ngoài trời, đặc biệt là ở nông thôn"
                },
                "examples": [
                    {
                        "en": "It's a nice day. Let's go for a picnic.",
                        "vi": "Đó là một ngày tốt đẹp. Hãy đi dã ngoại."
                    },
                    {
                        "en": "We had a picnic beside the river.",
                        "vi": "Chúng tôi đã có một buổi dã ngoại bên cạnh sông."
                    }
                ]
            },
            {
                "define": {
                    "en": "the meal, usually consisting of sandwiches, salad and fruit, etc. that you take with you when you go on a picnic",
                    "vi": "bữa ăn, thường bao gồm bánh mì sandwich, salad và trái cây, v.v. mà bạn mang theo khi đi dã ngoại"
                },
                "examples": [
                    {
                        "en": "Let's eat our picnic by the lake.",
                        "vi": "Chúng ta hãy ăn picnic bên hồ."
                    },
                    {
                        "en": "a picnic lunch",
                        "vi": "một bữa trưa dã ngoại"
                    },
                    {
                        "en": "a picnic basket",
                        "vi": "một giỏ dã ngoại"
                    },
                    {
                        "en": "We took a picnic and spent the day watching the races.",
                        "vi": "Chúng tôi đã đi dã ngoại và dành cả ngày để xem các cuộc đua."
                    },
                    {
                        "en": "Will you help me make a picnic?",
                        "vi": "Bạn sẽ giúp tôi thực hiện một chuyến dã ngoại?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be difficult and cause a lot of problems",
                    "vi": "khó khăn và gây ra rất nhiều vấn đề"
                },
                "examples": [
                    {
                        "en": "Bringing up a family when you're unemployed is no picnic.",
                        "vi": "Tổ chức một gia đình khi bạn thất nghiệp không phải là một chuyến dã ngoại."
                    }
                ]
            }
        ]
    },
    {
        "id": "22b2815458904359b3319d52ad0542b3",
        "word": "be up against a brick wall",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/brɪk/",
            "us": "/brɪk/"
        },
        "nearby": [
            {
                "word": "bribery",
                "pos": "noun"
            },
            {
                "word": "bric-a-brac",
                "pos": "noun"
            },
            {
                "word": "brick",
                "pos": "noun"
            },
            {
                "word": "brick",
                "pos": "verb"
            },
            {
                "word": "brickbat",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "baked clay used for building walls, houses and other buildings; an individual block of this",
                    "vi": "đất sét nung dùng để xây tường, nhà và các công trình khác; một khối riêng lẻ của cái này"
                },
                "examples": [
                    {
                        "en": "The school is built of brick.",
                        "vi": "Trường được xây bằng gạch."
                    },
                    {
                        "en": "a pile of bricks",
                        "vi": "một đống gạch"
                    },
                    {
                        "en": "a brick wall",
                        "vi": "một bức tường gạch"
                    }
                ]
            },
            {
                "define": {
                    "en": "a plastic or wooden block, used as a toy for young children to build things with",
                    "vi": "một khối nhựa hoặc gỗ, được sử dụng làm đồ chơi cho trẻ nhỏ để xây dựng mọi thứ với"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a friend that you can rely on when you need help",
                    "vi": "một người bạn mà bạn có thể dựa vào khi cần giúp đỡ"
                },
                "examples": [
                    {
                        "en": "Thanks for looking after the children today—you're a real brick.",
                        "vi": "Cảm ơn vì đã chăm sóc bọn trẻ hôm nay — bạn là một viên gạch thực sự."
                    }
                ]
            },
            {
                "define": {
                    "en": "to keep trying to do something that will never be successful",
                    "vi": "tiếp tục cố gắng làm điều gì đó sẽ không bao giờ thành công"
                },
                "examples": [
                    {
                        "en": "Trying to reason with them was like banging my head against a brick wall.",
                        "vi": "Cố gắng lý luận với họ giống như đập đầu tôi vào tường gạch."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be unable to make any progress because there is a difficulty that stops you",
                    "vi": "không thể đạt được bất kỳ tiến bộ nào bởi vì có một khó khăn ngăn cản bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to say something that offends or embarrasses somebody, although you did not intend to",
                    "vi": "nói điều gì đó xúc phạm hoặc xấu hổ ai đó, mặc dù bạn không có ý định"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "very nervous",
                    "vi": "rất lo lắng"
                },
                "examples": [
                    {
                        "en": "She was like a cat on hot bricks before her driving test.",
                        "vi": "Cô ấy như một con mèo trên những viên gạch nóng trước khi thi lái xe."
                    }
                ]
            },
            {
                "define": {
                    "en": "very nervous",
                    "vi": "rất lo lắng"
                },
                "examples": [
                    {
                        "en": "She was like a cat on a hot tin roof before her driving test.",
                        "vi": "Cô ấy giống như một con mèo trên một mái nhà thiếc nóng trước khi thi lái xe."
                    }
                ]
            },
            {
                "define": {
                    "en": "very heavily; very severely",
                    "vi": "rất nặng nề; rất nghiêm trọng"
                },
                "examples": [
                    {
                        "en": "Disappointment hit her like a ton of bricks.",
                        "vi": "Sự thất vọng ập đến với cô như một tấn gạch."
                    },
                    {
                        "en": "They came down on him like a ton of bricks (= criticized him very severely).",
                        "vi": "Họ giáng xuống anh ta như một tấn gạch (= đã chỉ trích anh ta rất nặng nề)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to try to work without the necessary material, money, information, etc.",
                    "vi": "cố gắng làm việc mà không có vật chất, tiền bạc, thông tin cần thiết, v.v."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "8ff2cf0f593c42f3a34a5bdb60a2c9ab",
        "word": "bother",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbɒðə(r)/",
            "us": "/ˈbɑːðər/"
        },
        "nearby": [
            {
                "word": "both",
                "pos": "determiner, pronoun"
            },
            {
                "word": "bother",
                "pos": "verb"
            },
            {
                "word": "bother",
                "pos": "noun"
            },
            {
                "word": "bother",
                "pos": "exclamation"
            },
            {
                "word": "botheration",
                "pos": "exclamation"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "trouble or difficulty",
                    "vi": "rắc rối hoặc khó khăn"
                },
                "examples": [
                    {
                        "en": "You seem to have got yourself into a spot of bother.",
                        "vi": "Bạn dường như đã đưa mình vào một chỗ bận tâm."
                    },
                    {
                        "en": "I don't want to put you to any bother (= cause you any trouble).",
                        "vi": "Tôi không muốn làm phiền bạn (= gây rắc rối cho bạn)."
                    },
                    {
                        "en": "Don't go to the bother of tidying up on my account (= don't make the effort to do it).",
                        "vi": "Đừng bận tâm đến việc thu dọn tài khoản của tôi (= đừng cố gắng làm điều đó)."
                    },
                    {
                        "en": "‘Thanks for your help!’ ‘It was no bother.’",
                        "vi": "Cảm ơn bạn đã giúp đỡ!' 'Nó không có gì bận tâm.'"
                    },
                    {
                        "en": "Call them and save yourself the bother of going round.",
                        "vi": "Hãy gọi cho họ và giúp bạn đỡ phải đi vòng vòng."
                    },
                    {
                        "en": "I don’t mind looking after the children; they aren’t any bother.",
                        "vi": "Tôi không ngại chăm sóc bọn trẻ; họ không bận tâm."
                    },
                    {
                        "en": "She’s been having a bit of bother with her car.",
                        "vi": "Cô ấy hơi bận tâm với chiếc xe của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "an annoying situation, thing or person",
                    "vi": "một tình huống, sự vật hoặc con người khó chịu"
                },
                "examples": [
                    {
                        "en": "I hope I haven't been a bother.",
                        "vi": "Tôi hy vọng tôi không phải là một phiền phức."
                    }
                ]
            }
        ]
    },
    {
        "id": "662e5db7b8c245fa98a8a7dd066e7bf6",
        "word": "chance your arm",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/tʃɑːns/",
            "us": "/tʃæns/"
        },
        "nearby": [
            {
                "word": "chana",
                "pos": "noun"
            },
            {
                "word": "chance",
                "pos": "noun"
            },
            {
                "word": "chance",
                "pos": "verb"
            },
            {
                "word": "chance",
                "pos": "adjective"
            },
            {
                "word": "chancel",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to risk something, although you know the result may not be successful",
                    "vi": "mạo hiểm một cái gì đó, mặc dù bạn biết kết quả có thể không thành công"
                },
                "examples": [
                    {
                        "en": "chance something She was chancing her luck driving without a licence.",
                        "vi": "cơ hội một cái gì đó Cô ấy đang bắt lấy may mắn của mình khi lái xe mà không có bằng lái."
                    },
                    {
                        "en": "‘Take an umbrella.’ ‘No, I'll chance it’ (= take the risk that it may rain).",
                        "vi": "Lấy một chiếc ô.' 'Không, tôi sẽ may nó' (= chấp nhận rủi ro rằng trời có thể mưa)."
                    },
                    {
                        "en": "chance doing something I stayed hidden; I couldn't chance coming out.",
                        "vi": "cơ hội làm một cái gì đó tôi đã ẩn; Tôi không thể có cơ hội ra sân."
                    }
                ]
            },
            {
                "define": {
                    "en": "to happen or to do something by chance",
                    "vi": "xảy ra hoặc làm điều gì đó tình cờ"
                },
                "examples": [
                    {
                        "en": "chance to do something If I do chance to find out where she is, I'll inform you immediately.",
                        "vi": "cơ hội để làm điều gì đó Nếu tôi có cơ hội biết được cô ấy đang ở đâu, tôi sẽ thông báo cho bạn ngay lập tức."
                    },
                    {
                        "en": "They chanced to be staying at the same hotel.",
                        "vi": "Họ tình cờ được ở cùng một khách sạn."
                    },
                    {
                        "en": "it chanced (that)… It chanced (that) they were staying at the same hotel.",
                        "vi": "it chanced (that)… It chanced (that) họ đang ở cùng một khách sạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to take a risk although you will probably fail",
                    "vi": "chấp nhận rủi ro mặc dù bạn có thể sẽ thất bại"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "2fbed5894ee846ed9713941bac7f782e",
        "word": "hassle",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈhæsl/",
            "us": "/ˈhæsl/"
        },
        "nearby": [
            {
                "word": "Hassidism",
                "pos": "noun"
            },
            {
                "word": "hassium",
                "pos": "noun"
            },
            {
                "word": "hassle",
                "pos": "noun"
            },
            {
                "word": "hassle",
                "pos": "verb"
            },
            {
                "word": "hassock",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a situation that is annoying because it involves doing something difficult or complicated that needs a lot of effort",
                    "vi": "một tình huống gây khó chịu vì nó liên quan đến việc làm điều gì đó khó khăn hoặc phức tạp cần nhiều nỗ lực"
                },
                "examples": [
                    {
                        "en": "It’s a hassle having to travel with so many bags.",
                        "vi": "Thật là rắc rối khi phải di chuyển với rất nhiều túi."
                    },
                    {
                        "en": "Send them an email—it's a lot less hassle than phoning.",
                        "vi": "Gửi email cho họ — nó ít phức tạp hơn nhiều so với gọi điện."
                    },
                    {
                        "en": "legal hassles",
                        "vi": "pháp lý phức tạp"
                    }
                ]
            },
            {
                "define": {
                    "en": "a situation in which people disagree, argue or annoy you",
                    "vi": "một tình huống mà mọi người không đồng ý, tranh luận hoặc làm phiền bạn"
                },
                "examples": [
                    {
                        "en": "Do as you're told and don't give me any hassle!",
                        "vi": "Hãy làm như bạn đã nói và đừng mang lại cho tôi bất kỳ rắc rối nào!"
                    },
                    {
                        "en": "(North American English) Try not to get into a hassle with this guy.",
                        "vi": "(Tiếng Anh Bắc Mỹ) Cố gắng đừng gặp rắc rối với anh chàng này."
                    }
                ]
            }
        ]
    },
    {
        "id": "ae4b98076fae4c40b7deae886b54dc6c",
        "word": "have a (hard/difficult) job doing/to do something",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/dʒɒb/",
            "us": "/dʒɑːb/"
        },
        "nearby": [
            {
                "word": "Joanna",
                "pos": ""
            },
            {
                "word": "Joanne",
                "pos": ""
            },
            {
                "word": "job",
                "pos": "noun"
            },
            {
                "word": "Job",
                "pos": "noun"
            },
            {
                "word": "job action",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "work for which you receive regular payment",
                    "vi": "làm việc mà bạn nhận được thanh toán thường xuyên"
                },
                "examples": [
                    {
                        "en": "I don't have a job at present.",
                        "vi": "Hiện tại tôi không có việc làm."
                    },
                    {
                        "en": "He's trying to get a job.",
                        "vi": "Anh ấy đang cố gắng kiếm một công việc."
                    },
                    {
                        "en": "I'm thinking of applying for a new job.",
                        "vi": "Tôi đang nghĩ đến việc xin một công việc mới."
                    },
                    {
                        "en": "to look for/find a job",
                        "vi": "tìm kiếm / tìm việc làm"
                    },
                    {
                        "en": "Did they offer you the job?",
                        "vi": "Họ có cung cấp cho bạn công việc không?"
                    },
                    {
                        "en": "job as something She took a job as a waitress.",
                        "vi": "job as something Cô ấy đã nhận một công việc như một nhân viên phục vụ bàn."
                    },
                    {
                        "en": "job with somebody/something She's just started a job with a travel company.",
                        "vi": "job with somebody / something Cô ấy vừa bắt đầu công việc với một công ty du lịch."
                    },
                    {
                        "en": "His brother's just lost his job.",
                        "vi": "Anh trai anh ấy vừa bị mất việc."
                    },
                    {
                        "en": "to leave/quit your job",
                        "vi": "nghỉ việc / bỏ việc của bạn"
                    },
                    {
                        "en": "Don't be late again if you want to keep your job.",
                        "vi": "Đừng đến muộn một lần nữa nếu bạn muốn tiếp tục công việc của mình."
                    },
                    {
                        "en": "a temporary/permanent job",
                        "vi": "một công việc tạm thời / lâu dài"
                    },
                    {
                        "en": "a summer/Saturday/holiday/vacation job",
                        "vi": "một công việc mùa hè / thứ bảy / ngày lễ / kỳ nghỉ"
                    },
                    {
                        "en": "Both my parents have full-time jobs.",
                        "vi": "Cả bố mẹ tôi đều có công việc toàn thời gian."
                    },
                    {
                        "en": "Many women are in part-time jobs.",
                        "vi": "Nhiều phụ nữ đang làm công việc bán thời gian."
                    },
                    {
                        "en": "She's never had a steady job (= a job that is not going to end suddenly).",
                        "vi": "Cô ấy chưa bao giờ có một công việc ổn định (= một công việc sẽ không kết thúc đột ngột)."
                    },
                    {
                        "en": "It's one of the top jobs in management.",
                        "vi": "Đó là một trong những công việc hàng đầu trong quản lý."
                    },
                    {
                        "en": "job of something one of the people under consideration for the job of managing director",
                        "vi": "công việc của một cái gì đó một trong những người đang được xem xét cho vị trí giám đốc quản lý"
                    },
                    {
                        "en": "in a job an increase in the number of people in jobs (= having jobs)",
                        "vi": "trong một công việc, số lượng người có việc làm tăng lên (= có việc làm)"
                    },
                    {
                        "en": "out of a job He's been out of a job (= unemployed) for six months now.",
                        "vi": "out of a job Anh ấy đã mất việc làm (= thất nghiệp) được sáu tháng rồi."
                    },
                    {
                        "en": "The takeover of the company is bound to mean more job losses.",
                        "vi": "Việc tiếp quản công ty chắc chắn đồng nghĩa với việc mất việc làm nhiều hơn."
                    },
                    {
                        "en": "There is so much competition in the job market currently.",
                        "vi": "Có rất nhiều cạnh tranh trong thị trường việc làm hiện nay."
                    },
                    {
                        "en": "He certainly knows his job (= is very good at his job).",
                        "vi": "Anh ấy chắc chắn biết công việc của mình (= rất giỏi trong công việc của mình)."
                    },
                    {
                        "en": "I'm only doing my job (= I'm doing what I am paid to do).",
                        "vi": "I'm only doing my job (= Tôi đang làm những gì tôi được trả tiền để làm)."
                    },
                    {
                        "en": "These projects will help create jobs in rural areas.",
                        "vi": "Các dự án này sẽ giúp tạo việc làm ở các vùng nông thôn."
                    },
                    {
                        "en": "The alternative would have been to cut jobs to contain costs.",
                        "vi": "Giải pháp thay thế là cắt giảm việc làm để giảm chi phí."
                    },
                    {
                        "en": "The closure of the factory will mean the loss of over 800 jobs.",
                        "vi": "Việc đóng cửa nhà máy sẽ đồng nghĩa với việc mất đi hơn 800 việc làm."
                    }
                ]
            },
            {
                "define": {
                    "en": "a particular task or piece of work that you have to do",
                    "vi": "một nhiệm vụ hoặc một phần công việc cụ thể mà bạn phải làm"
                },
                "examples": [
                    {
                        "en": "I've got various jobs around the house to do.",
                        "vi": "Tôi có nhiều công việc xung quanh nhà để làm."
                    },
                    {
                        "en": "Sorting these papers out is going to be a long job.",
                        "vi": "Việc sắp xếp những giấy tờ này sẽ là một công việc lâu dài."
                    },
                    {
                        "en": "The builder has a couple of jobs on at the moment.",
                        "vi": "Người xây dựng có một vài công việc vào lúc này."
                    },
                    {
                        "en": "job of doing something She's taken on the job of organizing the Christmas party.",
                        "vi": "job of doing something Cô ấy đảm nhận công việc tổ chức bữa tiệc Giáng sinh."
                    }
                ]
            },
            {
                "define": {
                    "en": "a responsibility or duty",
                    "vi": "một trách nhiệm hoặc nghĩa vụ"
                },
                "examples": [
                    {
                        "en": "He said he wouldn't do it because it wasn't his job.",
                        "vi": "Anh ấy nói rằng anh ấy sẽ không làm điều đó vì đó không phải là công việc của anh ấy."
                    },
                    {
                        "en": "somebody's job to do something It's not my job to lock up!",
                        "vi": "nhiệm vụ của ai đó để làm điều gì đó Không phải việc của tôi là nhốt!"
                    },
                    {
                        "en": "It's the job of the press to expose wrongdoing.",
                        "vi": "Đó là công việc của báo chí để vạch trần những hành vi sai trái."
                    }
                ]
            },
            {
                "define": {
                    "en": "a crime, especially stealing",
                    "vi": "một tội ác, đặc biệt là ăn cắp"
                },
                "examples": [
                    {
                        "en": "a bank job",
                        "vi": "một công việc ngân hàng"
                    },
                    {
                        "en": "He got six months for that last job he did.",
                        "vi": "Anh ấy có sáu tháng cho công việc cuối cùng mà anh ấy đã làm."
                    },
                    {
                        "en": "an inside job (= done by somebody in the organization where the crime happens)",
                        "vi": "một công việc bên trong (= được thực hiện bởi ai đó trong tổ chức nơi tội phạm xảy ra)"
                    },
                    {
                        "en": "The gang bungled the job and got caught.",
                        "vi": "Cả nhóm đã làm hỏng công việc và bị bắt."
                    }
                ]
            },
            {
                "define": {
                    "en": "a particular kind of thing",
                    "vi": "một loại điều cụ thể"
                },
                "examples": [
                    {
                        "en": "It's real wood—not one of those plastic jobs.",
                        "vi": "Đó là gỗ thật - không phải là một trong những công việc bằng nhựa."
                    }
                ]
            },
            {
                "define": {
                    "en": "an item of work that is done by a computer as a single unit",
                    "vi": "một hạng mục công việc được thực hiện bởi máy tính như một đơn vị duy nhất"
                },
                "examples": [
                    {
                        "en": "The job can be processed overnight.",
                        "vi": "Công việc có thể được xử lý trong một sớm một chiều."
                    }
                ]
            },
            {
                "define": {
                    "en": "not paying enough attention to what you need to do",
                    "vi": "không chú ý đủ đến những gì bạn cần làm"
                },
                "examples": [
                    {
                        "en": "They were asleep on the job as the financial crisis deepened.",
                        "vi": "Họ đã ngủ quên trong công việc khi cuộc khủng hoảng tài chính ngày càng sâu sắc."
                    },
                    {
                        "en": "Let's hope the regulators are not asleep at the wheel.",
                        "vi": "Hãy hy vọng các cơ quan quản lý không ngủ quên trong bánh xe."
                    },
                    {
                        "en": "Someone must have been asleep at the switch to allow this to happen.",
                        "vi": "Chắc hẳn ai đó đã ngủ quên ở công tắc để cho phép điều này xảy ra."
                    }
                ]
            },
            {
                "define": {
                    "en": "unemployed for a short time. People say ‘between jobs’ to avoid saying ‘unemployed’.",
                    "vi": "thất nghiệp trong một thời gian ngắn. Người ta nói 'giữa các công việc' để tránh nói 'thất nghiệp'."
                },
                "examples": [
                    {
                        "en": "He's between jobs at the moment so he's using the time to do some voluntary work.",
                        "vi": "Hiện tại anh ấy đang bận rộn với nhiều công việc nên anh ấy đang sử dụng thời gian để làm một số công việc tình nguyện."
                    }
                ]
            },
            {
                "define": {
                    "en": "a very difficult or unpleasant job or time",
                    "vi": "một công việc hoặc thời gian rất khó khăn hoặc khó chịu"
                },
                "examples": [
                    {
                        "en": "I've had a devil of a job finding you.",
                        "vi": "Tôi đã có một công việc quỷ dữ tìm thấy bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to do something well, badly, etc.",
                    "vi": "để làm điều gì đó tốt, xấu, v.v."
                },
                "examples": [
                    {
                        "en": "They did a very professional job.",
                        "vi": "Họ đã làm một công việc rất chuyên nghiệp."
                    },
                    {
                        "en": "You've certainly made an excellent job of the kitchen (= for example, painting it).",
                        "vi": "Bạn chắc chắn đã hoàn thành xuất sắc công việc bếp núc (= ví dụ: sơn nhà)."
                    },
                    {
                        "en": "We haven’t done a very good job on the publicity for the show.",
                        "vi": "Chúng tôi đã không làm tốt công việc quảng bá cho chương trình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be effective or successful in doing what you want",
                    "vi": "để trở nên hiệu quả hoặc thành công trong việc làm những gì bạn muốn"
                },
                "examples": [
                    {
                        "en": "This extra strong glue should do the job.",
                        "vi": "Keo cực mạnh này sẽ thực hiện công việc."
                    },
                    {
                        "en": "Try wedging it open—that should do the job.",
                        "vi": "Hãy thử mở nó ra — điều đó sẽ thực hiện được công việc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to cause somebody/yourself to lose their/your job because the role is no longer required",
                    "vi": "khiến ai đó / chính bạn mất việc của họ / của bạn vì vai trò không còn cần thiết"
                },
                "examples": [
                    {
                        "en": "Our aim as a charity is to help people so successfully that we do ourselves out of a job.",
                        "vi": "Mục đích của chúng tôi với tư cách là một tổ chức từ thiện là giúp mọi người thành công đến mức chúng tôi hoàn thành công việc của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to decide to stop trying to help somebody or to do something because there is no hope of success",
                    "vi": "quyết định ngừng cố gắng giúp đỡ ai đó hoặc làm điều gì đó bởi vì không có hy vọng thành công"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to tell somebody that they have done well at something",
                    "vi": "được sử dụng để nói với ai đó rằng họ đã làm tốt một cái gì đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to say that you are pleased about a situation or that somebody is lucky that something happened",
                    "vi": "được sử dụng để nói rằng bạn hài lòng về một tình huống hoặc ai đó may mắn vì điều gì đó đã xảy ra"
                },
                "examples": [
                    {
                        "en": "It's a good job you were there to help.",
                        "vi": "Đó là một công việc tốt bạn đã ở đó để giúp đỡ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have difficulty doing something",
                    "vi": "gặp khó khăn khi làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "You'll have a job convincing them that you're right.",
                        "vi": "Bạn sẽ có một công việc thuyết phục họ rằng bạn đúng."
                    },
                    {
                        "en": "He had a hard job to make himself heard.",
                        "vi": "Anh ấy đã gặp khó khăn trong việc làm cho mình được lắng nghe."
                    }
                ]
            },
            {
                "define": {
                    "en": "work that you are paid to do or that must be done",
                    "vi": "công việc mà bạn được trả tiền để làm hoặc phải làm"
                },
                "examples": [
                    {
                        "en": "There was a job of work waiting for him that he was not looking forward to.",
                        "vi": "Có một công việc đang chờ đợi anh mà anh không hề mong đợi."
                    }
                ]
            },
            {
                "define": {
                    "en": "people use the expression jobs for the boys when they are criticizing the fact that somebody in power has given work to friends or relatives",
                    "vi": "mọi người sử dụng các công việc biểu đạt cho các cậu bé khi họ đang chỉ trích việc ai đó nắm quyền đã giao việc cho bạn bè hoặc người thân"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "exactly what is needed in a particular situation",
                    "vi": "chính xác những gì cần thiết trong một tình huống cụ thể"
                },
                "examples": [
                    {
                        "en": "That cup of tea was just the job.",
                        "vi": "Đó là một tách trà chỉ là công việc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to accept a bad or difficult situation and do as well as you can",
                    "vi": "chấp nhận một tình huống xấu hoặc khó khăn và làm tốt nhất có thể"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "not worth doing because it is against the rules or because it might cause you to lose your job",
                    "vi": "không đáng làm vì nó trái với quy tắc hoặc vì nó có thể khiến bạn mất việc"
                },
                "examples": [
                    {
                        "en": "It's more than my job's worth to let you in without a ticket.",
                        "vi": "Công việc của tôi còn hơn cả việc để bạn vào mà không cần vé."
                    }
                ]
            },
            {
                "define": {
                    "en": "while doing a particular job",
                    "vi": "trong khi làm một công việc cụ thể"
                },
                "examples": [
                    {
                        "en": "No sleeping on the job!",
                        "vi": "Không ngủ trong công việc!"
                    },
                    {
                        "en": "on-the-job training",
                        "vi": "vào đào tạo nghề"
                    }
                ]
            },
            {
                "define": {
                    "en": "having sex",
                    "vi": "quan hệ tình dục"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to stop working in order to go on strike",
                    "vi": "ngừng làm việc để đình công"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "508d3e11214a4f99b5ed6200ed1714c7",
        "word": "have your work cut out",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/wɜːk/",
            "us": "/wɜːrk/"
        },
        "nearby": [
            {
                "word": "wore",
                "pos": ""
            },
            {
                "word": "work",
                "pos": "verb"
            },
            {
                "word": "work",
                "pos": "noun"
            },
            {
                "word": "workable",
                "pos": "adjective"
            },
            {
                "word": "workaday",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the job that a person does especially in order to earn money",
                    "vi": "công việc mà một người đặc biệt làm để kiếm tiền"
                },
                "examples": [
                    {
                        "en": "He started work as a security guard.",
                        "vi": "Anh bắt đầu công việc của một nhân viên bảo vệ."
                    },
                    {
                        "en": "I'm still looking for work.",
                        "vi": "Tôi vẫn đang tìm việc."
                    },
                    {
                        "en": "It is difficult to find work in the present economic climate.",
                        "vi": "Rất khó để tìm được việc làm trong bối cảnh kinh tế hiện nay."
                    },
                    {
                        "en": "She's planning to return to work once the children start school.",
                        "vi": "Cô ấy dự định sẽ trở lại làm việc sau khi bọn trẻ bắt đầu đi học."
                    },
                    {
                        "en": "full-time/part-time/unpaid/voluntary work",
                        "vi": "công việc toàn thời gian / bán thời gian / không lương / tình nguyện"
                    },
                    {
                        "en": "out of work She had been out of work (= without a job) for a year.",
                        "vi": "out of work Cô ấy đã nghỉ việc (= không có việc làm) trong một năm."
                    },
                    {
                        "en": "in work (British English) They are in work (= have a job).",
                        "vi": "trong công việc (tiếng Anh Anh) Họ đang làm việc (= có một công việc)."
                    },
                    {
                        "en": "What line of work are you in (= what type of work do you do)?",
                        "vi": "Bạn đang làm công việc gì (= bạn làm công việc gì)?"
                    },
                    {
                        "en": "off work She's been off work (= not going to work) with a bad back since July.",
                        "vi": "nghỉ làm Cô ấy đã nghỉ làm (= không đi làm) với tình trạng trở lại tồi tệ kể từ tháng Bảy."
                    }
                ]
            },
            {
                "define": {
                    "en": "the place where you do your job; the time that you spend there",
                    "vi": "nơi bạn làm công việc của mình; thời gian mà bạn dành ở đó"
                },
                "examples": [
                    {
                        "en": "I go to work at 8 o'clock.",
                        "vi": "Tôi đi làm lúc 8 giờ."
                    },
                    {
                        "en": "I was late for work again.",
                        "vi": "Tôi lại đi làm muộn."
                    },
                    {
                        "en": "I have to leave work early today.",
                        "vi": "Hôm nay tôi phải đi làm sớm."
                    },
                    {
                        "en": "Her friends from work came to see her in the hospital.",
                        "vi": "Bạn bè của cô ấy từ nơi làm việc đến gặp cô ấy trong bệnh viện."
                    },
                    {
                        "en": "I get on well with my work colleagues.",
                        "vi": "Tôi hòa thuận với các đồng nghiệp làm việc của mình."
                    },
                    {
                        "en": "a pleasant work environment",
                        "vi": "một môi trường làm việc dễ chịu"
                    },
                    {
                        "en": "at work The new legislation concerns health and safety at work.",
                        "vi": "tại nơi làm việc Luật mới liên quan đến sức khỏe và an toàn tại nơi làm việc."
                    },
                    {
                        "en": "before/after work I like to go for a run after work.",
                        "vi": "trước / sau giờ làm việc Tôi thích chạy bộ sau giờ làm việc."
                    }
                ]
            },
            {
                "define": {
                    "en": "the duties that you have and the activities that you do as part of your job",
                    "vi": "những nhiệm vụ mà bạn có và những hoạt động bạn làm như một phần công việc của mình"
                },
                "examples": [
                    {
                        "en": "Police work is mainly routine.",
                        "vi": "Công việc của cảnh sát là chủ yếu."
                    },
                    {
                        "en": "The accountant described his work to the sales staff.",
                        "vi": "Kế toán mô tả công việc của mình cho nhân viên kinh doanh."
                    }
                ]
            },
            {
                "define": {
                    "en": "tasks that need to be done",
                    "vi": "những công việc cần phải hoàn thành"
                },
                "examples": [
                    {
                        "en": "Taking care of a baby is hard work.",
                        "vi": "Chăm sóc một em bé là một công việc khó khăn."
                    },
                    {
                        "en": "Whenever am I going to do all this work?",
                        "vi": "Bất cứ khi nào tôi sẽ làm tất cả công việc này?"
                    },
                    {
                        "en": "There is plenty of work to be done in the garden.",
                        "vi": "Có rất nhiều việc phải làm trong vườn."
                    },
                    {
                        "en": "Stop talking and get on with your work.",
                        "vi": "Đừng nói nữa và tiếp tục công việc của bạn."
                    },
                    {
                        "en": "He completed the work shortly before his death.",
                        "vi": "Ông đã hoàn thành công việc không lâu trước khi qua đời."
                    },
                    {
                        "en": "important work being undertaken by volunteers",
                        "vi": "công việc quan trọng do tình nguyện viên đảm nhận"
                    },
                    {
                        "en": "Big football matches make a lot of work for the police.",
                        "vi": "Những trận bóng lớn khiến cảnh sát phải vất vả rất nhiều."
                    }
                ]
            },
            {
                "define": {
                    "en": "materials needed or used for doing work, especially books, papers, etc.",
                    "vi": "tài liệu cần thiết hoặc được sử dụng để thực hiện công việc, đặc biệt là sách, giấy tờ, v.v."
                },
                "examples": [
                    {
                        "en": "She often brings work (= for example, files and documents) home with her from the office.",
                        "vi": "Cô ấy thường mang công việc (= ví dụ: hồ sơ và tài liệu) về nhà từ văn phòng."
                    },
                    {
                        "en": "His work was spread all over the floor.",
                        "vi": "Công việc của anh ấy được rải khắp sàn."
                    }
                ]
            },
            {
                "define": {
                    "en": "the use of physical strength or mental power in order to do or make something",
                    "vi": "sử dụng sức mạnh thể chất hoặc sức mạnh tinh thần để làm hoặc làm một cái gì đó"
                },
                "examples": [
                    {
                        "en": "She earned her grades through sheer hard work.",
                        "vi": "Cô ấy đã giành được điểm của mình nhờ làm việc chăm chỉ tuyệt đối."
                    },
                    {
                        "en": "work on something We began work on the project last year.",
                        "vi": "làm việc trên một cái gì đó Chúng tôi đã bắt đầu làm việc với dự án năm ngoái."
                    },
                    {
                        "en": "They performed pioneering work on the treatment of cancer.",
                        "vi": "Họ đã thực hiện công việc tiên phong trong việc điều trị ung thư."
                    },
                    {
                        "en": "Work continues on renovating the hotel.",
                        "vi": "Công việc cải tạo khách sạn vẫn tiếp tục."
                    },
                    {
                        "en": "work of doing something The work of building the bridge took six months.",
                        "vi": "Công việc xây dựng cây cầu mất sáu tháng."
                    },
                    {
                        "en": "The art collection was his life's work.",
                        "vi": "Bộ sưu tập nghệ thuật là tác phẩm để đời của anh ấy."
                    },
                    {
                        "en": "She set them to work painting the fence.",
                        "vi": "Cô bắt chúng làm công việc sơn hàng rào."
                    }
                ]
            },
            {
                "define": {
                    "en": "a thing or things that are produced as a result of work",
                    "vi": "một thứ hoặc những thứ được tạo ra do kết quả của công việc"
                },
                "examples": [
                    {
                        "en": "She's an artist whose work I really admire.",
                        "vi": "Cô ấy là một nghệ sĩ mà tôi thực sự ngưỡng mộ."
                    },
                    {
                        "en": "outstanding work in this area/field",
                        "vi": "công việc xuất sắc trong lĩnh vực / lĩnh vực này"
                    },
                    {
                        "en": "Is this all your own work (= did you do it without help from others)?",
                        "vi": "Đây có phải là tất cả công việc của riêng bạn (= bạn đã làm mà không có sự giúp đỡ của người khác)?"
                    },
                    {
                        "en": "The book is a detailed and thorough piece of work covering all aspects of the subject.",
                        "vi": "Cuốn sách là một tác phẩm chi tiết và kỹ lưỡng bao gồm tất cả các khía cạnh của chủ đề này."
                    },
                    {
                        "en": "He left a substantial body of work—drawings and watercolours as well as oils.",
                        "vi": "Ông đã để lại một lượng lớn tác phẩm - bản vẽ và màu nước cũng như dầu."
                    }
                ]
            },
            {
                "define": {
                    "en": "a book, piece of music, painting, etc.",
                    "vi": "một cuốn sách, bản nhạc, bức tranh, v.v."
                },
                "examples": [
                    {
                        "en": "the collected/complete works of Tolstoy",
                        "vi": "các tác phẩm được sưu tầm / hoàn chỉnh của Tolstoy"
                    },
                    {
                        "en": "works of fiction/literature",
                        "vi": "tác phẩm hư cấu / văn học"
                    },
                    {
                        "en": "Chopin’s piano works",
                        "vi": "Tác phẩm piano của Chopin"
                    },
                    {
                        "en": "Beethoven composed his greatest works in the latter part of his life.",
                        "vi": "Beethoven đã sáng tác những tác phẩm vĩ đại nhất của mình trong phần sau của cuộc đời."
                    },
                    {
                        "en": "work by somebody He recognized the sketch as an early work by Degas.",
                        "vi": "tác phẩm của ai đó Anh ấy nhận ra bản phác thảo là tác phẩm ban đầu của Degas."
                    }
                ]
            },
            {
                "define": {
                    "en": "the result of an action; what is done by somebody",
                    "vi": "kết quả của một hành động; những gì được thực hiện bởi một người nào đó"
                },
                "examples": [
                    {
                        "en": "The damage is clearly the work of vandals.",
                        "vi": "Thiệt hại rõ ràng là tác phẩm của những kẻ phá hoại."
                    }
                ]
            },
            {
                "define": {
                    "en": "activities involving building or repairing something",
                    "vi": "các hoạt động liên quan đến xây dựng hoặc sửa chữa một cái gì đó"
                },
                "examples": [
                    {
                        "en": "roadworks",
                        "vi": "làm đường"
                    },
                    {
                        "en": "They expanded the shipyards and started engineering works.",
                        "vi": "Họ mở rộng xưởng đóng tàu và bắt đầu các công trình kỹ thuật."
                    },
                    {
                        "en": "A contract can ensure that landlords carry out the works for which they are legally responsible.",
                        "vi": "Một hợp đồng có thể đảm bảo rằng chủ nhà thực hiện các công việc mà họ chịu trách nhiệm về mặt pháp lý."
                    }
                ]
            },
            {
                "define": {
                    "en": "a place where things are made or industrial processes take place",
                    "vi": "một nơi mà mọi thứ được tạo ra hoặc các quy trình công nghiệp diễn ra"
                },
                "examples": [
                    {
                        "en": "an engineering works",
                        "vi": "một công trình kỹ thuật"
                    },
                    {
                        "en": "a brickworks",
                        "vi": "một công trình xây dựng"
                    },
                    {
                        "en": "Raw materials were carried to the works by barge.",
                        "vi": "Nguyên liệu thô được vận chuyển đến công trình bằng sà lan."
                    }
                ]
            },
            {
                "define": {
                    "en": "the moving parts of a machine, etc.",
                    "vi": "các bộ phận chuyển động của máy, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "everything",
                    "vi": "mọi điều"
                },
                "examples": [
                    {
                        "en": "We went to the chip shop and had the works: fish, chips, gherkins, mushy peas.",
                        "vi": "Chúng tôi đến cửa hàng bán khoai tây chiên và có các tác phẩm: cá, khoai tây chiên, gherkins, đậu Hà Lan."
                    }
                ]
            },
            {
                "define": {
                    "en": "the use of force to produce movement",
                    "vi": "sử dụng lực để tạo ra chuyển động"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "part of your normal working life and not unusual",
                    "vi": "một phần của cuộc sống làm việc bình thường của bạn và không phải là bất thường"
                },
                "examples": [
                    {
                        "en": "Swimming with sharks or training a tiger cub—it's all in a day's work for animal wrangler Chris Bolton.",
                        "vi": "Bơi cùng cá mập hay huấn luyện một chú hổ con — đó là tất cả công việc trong một ngày của người quấn quít động vật Chris Bolton."
                    }
                ]
            },
            {
                "define": {
                    "en": "it is not healthy to spend all your time working; you need to relax too",
                    "vi": "không có lợi cho sức khỏe nếu bạn dành toàn bộ thời gian để làm việc; bạn cũng cần thư giãn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "having an effect on something",
                    "vi": "có ảnh hưởng đến một cái gì đó"
                },
                "examples": [
                    {
                        "en": "She suspected that secret influences were at work.",
                        "vi": "Cô nghi ngờ rằng có những ảnh hưởng bí mật trong công việc."
                    }
                ]
            },
            {
                "define": {
                    "en": "busy doing something",
                    "vi": "bận làm gì đó"
                },
                "examples": [
                    {
                        "en": "He is still at work on the painting.",
                        "vi": "Anh ấy vẫn đang làm việc trên bức tranh."
                    },
                    {
                        "en": "Danger—men at work.",
                        "vi": "Nguy hiểm — những người đàn ông tại nơi làm việc."
                    }
                ]
            },
            {
                "define": {
                    "en": "people who do not have enough to do often start to do wrong",
                    "vi": "những người không có đủ năng lực để làm thường bắt đầu làm sai"
                },
                "examples": [
                    {
                        "en": "She blamed the crimes on the local jobless teenagers. ‘The devil makes work for idle hands,’ she would say.",
                        "vi": "Cô đổ lỗi cho những thanh thiếu niên thất nghiệp tại địa phương. Cô ấy sẽ nói: 'Ma quỷ kiếm việc làm cho những đôi tay nhàn rỗi."
                    }
                ]
            },
            {
                "define": {
                    "en": "(to do) the unpleasant or dishonest jobs that somebody else does not want to do",
                    "vi": "(phải làm) những công việc khó chịu hoặc không trung thực mà người khác không muốn làm"
                },
                "examples": [
                    {
                        "en": "Next time you can get somebody else to do your dirty work for you!",
                        "vi": "Lần sau, bạn có thể nhờ người khác làm công việc bẩn thỉu của bạn cho bạn!"
                    },
                    {
                        "en": "He always gets someone else to do the dirty work for him.",
                        "vi": "Anh ta luôn nhờ người khác làm công việc bẩn thỉu cho mình."
                    },
                    {
                        "en": "The drugs gang used children to do their dirty work for them.",
                        "vi": "Băng đảng ma túy đã sử dụng trẻ em để làm công việc bẩn thỉu của chúng cho chúng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to begin; to make a start",
                    "vi": "để bắt đầu; để bắt đầu"
                },
                "examples": [
                    {
                        "en": "We set to work on the outside of the house (= for example, painting it).",
                        "vi": "Chúng tôi bắt đầu làm việc bên ngoài ngôi nhà (= ví dụ: sơn nó)."
                    },
                    {
                        "en": "Let's get to work.",
                        "vi": "Cùng bắt tay vào làm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to give or tell somebody everything",
                    "vi": "để cung cấp cho hoặc nói với ai đó mọi thứ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to do/start to do your work",
                    "vi": "để làm / bắt đầu làm công việc của bạn"
                },
                "examples": [
                    {
                        "en": "She went cheerfully about her work.",
                        "vi": "Cô ấy vui vẻ đi về công việc của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "kind acts to help others",
                    "vi": "hành động tốt để giúp đỡ người khác"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be likely to have difficulty doing something",
                    "vi": "có khả năng gặp khó khăn khi làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "You'll have your work cut out to get there by nine o'clock.",
                        "vi": "Bạn sẽ phải hoàn thành công việc của mình để đến đó trước chín giờ."
                    }
                ]
            },
            {
                "define": {
                    "en": "something that is in the works is being discussed, planned or prepared and will happen or exist soon",
                    "vi": "một cái gì đó trong công việc đang được thảo luận, lên kế hoạch hoặc chuẩn bị và sẽ sớm xảy ra hoặc tồn tại"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "work that you are paid to do or that must be done",
                    "vi": "công việc mà bạn được trả tiền để làm hoặc phải làm"
                },
                "examples": [
                    {
                        "en": "There was a job of work waiting for him that he was not looking forward to.",
                        "vi": "Có một công việc đang chờ đợi anh mà anh không hề mong đợi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to use more time or energy on a task than is necessary",
                    "vi": "sử dụng nhiều thời gian hoặc năng lượng cho một công việc hơn mức cần thiết"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to do something quickly and with little effort",
                    "vi": "để làm điều gì đó nhanh chóng và ít nỗ lực"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to defeat, deal with something/somebody quickly",
                    "vi": "để đánh bại, đối phó với một cái gì đó / ai đó một cách nhanh chóng"
                },
                "examples": [
                    {
                        "en": "Liverpool made short work of the opposition (= in a football match).",
                        "vi": "Liverpool đã làm được điều đó với phe đối lập (= trong một trận đấu bóng đá)."
                    },
                    {
                        "en": "He made short work of his lunch (= ate it quickly).",
                        "vi": "Anh ấy đã làm xong bữa trưa của mình (= ăn nhanh)."
                    },
                    {
                        "en": "Mike made short work of fixing the engine.",
                        "vi": "Mike thực hiện công việc sửa chữa động cơ trong thời gian ngắn."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that a job is made easier if a lot of people help",
                    "vi": "thường nói rằng một công việc sẽ dễ dàng hơn nếu có nhiều người giúp đỡ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a person who is unpleasant, unkind or dishonest",
                    "vi": "một người khó ưa, không tử tế hoặc không trung thực"
                },
                "examples": [
                    {
                        "en": "Don’t trust him; he’s a nasty piece of work.",
                        "vi": "Đừng tin tưởng anh ta; anh ấy là một công việc khó chịu."
                    },
                    {
                        "en": "He's a thoroughly nasty piece of work.",
                        "vi": "Anh ta là một công việc hoàn toàn khó chịu."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to show you are pleased when somebody has done something well",
                    "vi": "được sử dụng để cho thấy bạn hài lòng khi ai đó đã làm tốt điều gì đó"
                },
                "examples": [
                    {
                        "en": "You did a good job today. Nice work, James!",
                        "vi": "Bạn đã làm một công việc tốt ngày hôm nay. Làm tốt lắm, James!"
                    }
                ]
            },
            {
                "define": {
                    "en": "used when you wish that you had somebody’s success or good luck and think they have achieved it with little effort",
                    "vi": "được sử dụng khi bạn ước rằng bạn có được ai đó thành công hoặc may mắn và nghĩ rằng họ đã đạt được điều đó mà không cần nỗ lực"
                },
                "examples": [
                    {
                        "en": "He was paid £200 for a ten-minute speech? Nice work if you can get it.",
                        "vi": "Anh ta được trả 200 bảng cho một bài phát biểu dài mười phút? Làm tốt lắm nếu bạn có thể nhận được nó."
                    }
                ]
            },
            {
                "define": {
                    "en": "(to cause) a delay or problem with something that somebody is planning or doing",
                    "vi": "(gây ra) sự chậm trễ hoặc vấn đề với điều gì đó mà ai đó đang lên kế hoạch hoặc làm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "needing too much effort",
                    "vi": "cần quá nhiều nỗ lực"
                },
                "examples": [
                    {
                        "en": "I can't be bothered making a hot meal—it's too much like hard work.",
                        "vi": "Tôi không thể làm phiền khi nấu một bữa ăn nóng - nó quá giống như một công việc khó khăn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a thing that takes a very short time to do",
                    "vi": "một việc cần một thời gian rất ngắn để làm"
                },
                "examples": [
                    {
                        "en": "It was the work of a few minutes to hide the damage.",
                        "vi": "Đó là công việc của một vài phút để che giấu thiệt hại."
                    }
                ]
            }
        ]
    },
    {
        "id": "508acfb122b34e4882a8d24591434f37",
        "word": "if the worst comes to the worst",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/wɜːst/",
            "us": "/wɜːrst/"
        },
        "nearby": [
            {
                "word": "worst",
                "pos": "adjective"
            },
            {
                "word": "worst",
                "pos": "adverb"
            },
            {
                "word": "worst",
                "pos": "noun"
            },
            {
                "word": "worst",
                "pos": "verb"
            },
            {
                "word": "worst-case",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the most serious or unpleasant thing that could happen; the part, situation, possibility, etc. that is worse than any other",
                    "vi": "điều nghiêm trọng hoặc khó chịu nhất có thể xảy ra; phần, tình huống, khả năng, v.v. tệ hơn bất kỳ phần nào khác"
                },
                "examples": [
                    {
                        "en": "When they did not hear from her, they feared the worst.",
                        "vi": "Khi họ không nhận được tin tức từ cô ấy, họ sợ điều tồi tệ nhất."
                    },
                    {
                        "en": "It doesn't matter what I say. My mother always expects the worst.",
                        "vi": "Tôi nói gì không quan trọng. Mẹ tôi luôn mong đợi điều tồi tệ nhất."
                    },
                    {
                        "en": "the worst of something The worst of it is that I can't even be sure if they received my letter.",
                        "vi": "điều tồi tệ nhất Điều tồi tệ nhất của nó là tôi thậm chí không thể chắc chắn liệu họ có nhận được thư của tôi hay không."
                    },
                    {
                        "en": "Although all the votes have not yet been counted, the party is preparing for the worst.",
                        "vi": "Mặc dù tất cả các phiếu bầu vẫn chưa được kiểm, nhưng đảng này đang chuẩn bị cho điều tồi tệ nhất."
                    },
                    {
                        "en": "This is politics at its worst.",
                        "vi": "Đây là chính trị tồi tệ nhất của nó."
                    },
                    {
                        "en": "If the worst happens, at least you're prepared.",
                        "vi": "Nếu điều tồi tệ nhất xảy ra, ít nhất bạn đã chuẩn bị sẵn sàng."
                    },
                    {
                        "en": "The worst of the storm was over.",
                        "vi": "Cơn bão tồi tệ nhất đã qua."
                    },
                    {
                        "en": "He was always optimistic, even when things were at their worst.",
                        "vi": "Anh luôn lạc quan, ngay cả khi mọi thứ tồi tệ nhất."
                    }
                ]
            },
            {
                "define": {
                    "en": "used for saying what is the worst thing that can happen",
                    "vi": "được sử dụng để nói điều tồi tệ nhất có thể xảy ra là gì"
                },
                "examples": [
                    {
                        "en": "At the very worst, he'll have to pay a fine.",
                        "vi": "Trong trường hợp xấu nhất, anh ta sẽ phải nộp phạt."
                    },
                    {
                        "en": "At worst this may mean the end of her playing career.",
                        "vi": "Tệ nhất, điều này có thể đồng nghĩa với việc kết thúc sự nghiệp thi đấu của cô ấy."
                    },
                    {
                        "en": "At worst, the drug can be fatal.",
                        "vi": "Tệ nhất, thuốc có thể gây tử vong."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody show their worst qualities",
                    "vi": "để khiến ai đó thể hiện những phẩm chất tồi tệ nhất của họ"
                },
                "examples": [
                    {
                        "en": "Pressure can bring out the worst in people.",
                        "vi": "Áp lực có thể mang lại điều tồi tệ nhất cho con người."
                    },
                    {
                        "en": "Christmas usually brings out the absolute worst in sentimental platitudes.",
                        "vi": "Giáng sinh thường mang lại điều tồi tệ nhất tuyệt đối trong các hoàn cảnh tình cảm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to do as much damage or be as unpleasant as possible",
                    "vi": "gây ra nhiều thiệt hại hoặc khó chịu nhất có thể"
                },
                "examples": [
                    {
                        "en": "Let them do their worst—we'll fight them every inch of the way.",
                        "vi": "Hãy để chúng làm điều tồi tệ nhất của chúng — chúng tôi sẽ chiến đấu với chúng từng li từng tí."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be defeated",
                    "vi": "bị đánh bại"
                },
                "examples": [
                    {
                        "en": "He'd been in a fight and had obviously got the worst of it.",
                        "vi": "Anh ấy đã từng tham gia một cuộc chiến và rõ ràng là anh ấy đã phải đối mặt với điều tồi tệ nhất."
                    }
                ]
            },
            {
                "define": {
                    "en": "if the situation becomes too difficult or dangerous",
                    "vi": "nếu tình hình trở nên quá khó khăn hoặc nguy hiểm"
                },
                "examples": [
                    {
                        "en": "If the worst comes to the worst, we'll just have to sell the house.",
                        "vi": "Nếu điều tồi tệ nhất đến với điều tồi tệ nhất, chúng tôi sẽ phải bán nhà."
                    }
                ]
            },
            {
                "define": {
                    "en": "a situation in which you have all the possible disadvantages at the same time",
                    "vi": "một tình huống mà bạn có tất cả những bất lợi có thể xảy ra cùng một lúc"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "8ed8d6fa7c104db58f6727ba02a1e60f",
        "word": "in deep water(s)",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/diːp/",
            "us": "/diːp/"
        },
        "nearby": [
            {
                "word": "deem",
                "pos": "verb"
            },
            {
                "word": "deemed university",
                "pos": "noun"
            },
            {
                "word": "deep",
                "pos": "adjective"
            },
            {
                "word": "deep",
                "pos": "adverb"
            },
            {
                "word": "deep",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "having a large distance from the top or surface to the bottom",
                    "vi": "có khoảng cách lớn từ đỉnh hoặc bề mặt đến đáy"
                },
                "examples": [
                    {
                        "en": "a deep hole/well/river",
                        "vi": "một hố sâu / giếng / sông"
                    },
                    {
                        "en": "deep water/snow",
                        "vi": "nước sâu / tuyết"
                    },
                    {
                        "en": "The water looks quite deep there.",
                        "vi": "Nước có vẻ khá sâu ở đó."
                    },
                    {
                        "en": "Around the world, the deep oceans are heating.",
                        "vi": "Trên khắp thế giới, các đại dương sâu đang nóng lên."
                    },
                    {
                        "en": "Sunflowers have deep roots.",
                        "vi": "Hoa hướng dương có rễ ăn sâu."
                    },
                    {
                        "en": "(figurative) The custom has deep roots in the community.",
                        "vi": "(nghĩa bóng) Tục lệ có nguồn gốc sâu xa trong cộng đồng."
                    }
                ]
            },
            {
                "define": {
                    "en": "having a large distance from the front edge to the furthest point inside",
                    "vi": "có khoảng cách lớn từ mép trước đến điểm xa nhất bên trong"
                },
                "examples": [
                    {
                        "en": "a deep cut/wound",
                        "vi": "một vết cắt / vết thương sâu"
                    },
                    {
                        "en": "deep space",
                        "vi": "không gian sâu"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to describe or ask about the depth of something",
                    "vi": "được sử dụng để mô tả hoặc hỏi về độ sâu của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "The water is only a few centimetres deep.",
                        "vi": "Nước chỉ sâu vài cm."
                    },
                    {
                        "en": "How deep is the wound?",
                        "vi": "Vết thương sâu bao nhiêu?"
                    }
                ]
            },
            {
                "define": {
                    "en": "as far up or down as the point mentioned",
                    "vi": "lên hoặc xuống như điểm đã đề cập"
                },
                "examples": [
                    {
                        "en": "The water was only waist-deep so I walked ashore.",
                        "vi": "Nước chỉ ngập ngang thắt lưng nên tôi đi bộ vào bờ."
                    },
                    {
                        "en": "She stood knee-deep in the water.",
                        "vi": "Cô ấy đứng ngập đầu gối trong nước."
                    },
                    {
                        "en": "We were walking in ankle-deep water.",
                        "vi": "Chúng tôi đang đi trong vùng nước sâu đến mắt cá chân."
                    }
                ]
            },
            {
                "define": {
                    "en": "in the number of rows mentioned, one behind the other",
                    "vi": "trong số hàng được đề cập, hàng này đứng sau hàng kia"
                },
                "examples": [
                    {
                        "en": "They were standing three-deep at the bar.",
                        "vi": "Họ đang đứng sâu ba mét ở quầy bar."
                    }
                ]
            },
            {
                "define": {
                    "en": "taking in or giving out a lot of air",
                    "vi": "hút vào hoặc thải ra nhiều không khí"
                },
                "examples": [
                    {
                        "en": "She took a deep breath.",
                        "vi": "Cô ấy hít một hơi sâu."
                    },
                    {
                        "en": "He gave a deep sigh.",
                        "vi": "Anh thở dài thườn thượt."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person in a deep sleep is difficult to wake",
                    "vi": "một người đang ngủ say rất khó đánh thức"
                },
                "examples": [
                    {
                        "en": "She fell into a deep sleep.",
                        "vi": "Cô chìm vào giấc ngủ sâu."
                    },
                    {
                        "en": "to be in a deep trance/coma",
                        "vi": "rơi vào trạng thái thôi miên / hôn mê sâu"
                    }
                ]
            },
            {
                "define": {
                    "en": "strong and dark",
                    "vi": "mạnh mẽ và tối tăm"
                },
                "examples": [
                    {
                        "en": "a rich deep red",
                        "vi": "một màu đỏ đậm"
                    }
                ]
            },
            {
                "define": {
                    "en": "low",
                    "vi": "Thấp"
                },
                "examples": [
                    {
                        "en": "I heard his deep warm voice filling the room.",
                        "vi": "Tôi nghe thấy giọng nói trầm ấm của anh ấy tràn ngập khắp căn phòng."
                    },
                    {
                        "en": "We heard a deep roar in the distance.",
                        "vi": "Chúng tôi nghe thấy một tiếng gầm sâu ở đằng xa."
                    },
                    {
                        "en": "He gave a deep groan.",
                        "vi": "Anh ta rên lên một tiếng."
                    }
                ]
            },
            {
                "define": {
                    "en": "strongly felt",
                    "vi": "cảm thấy mạnh mẽ"
                },
                "examples": [
                    {
                        "en": "a very deep feeling of love",
                        "vi": "một cảm giác rất sâu sắc của tình yêu"
                    },
                    {
                        "en": "I felt a deep sense of loss when I heard of her death.",
                        "vi": "Tôi cảm thấy mất mát sâu sắc khi nghe tin cô ấy qua đời."
                    },
                    {
                        "en": "They expressed deep concern.",
                        "vi": "Họ bày tỏ sự quan tâm sâu sắc."
                    },
                    {
                        "en": "We extend our deepest sympathies to his family.",
                        "vi": "Chúng tôi xin gửi lời cảm thông sâu sắc nhất tới gia đình anh ấy."
                    },
                    {
                        "en": "It was with deep regret that I accepted his resignation.",
                        "vi": "Chính với sự hối hận sâu sắc mà tôi đã chấp nhận sự từ chức của anh ấy."
                    },
                    {
                        "en": "They have a deep respect for tradition.",
                        "vi": "Họ có một sự tôn trọng sâu sắc đối với truyền thống."
                    }
                ]
            },
            {
                "define": {
                    "en": "extreme or serious",
                    "vi": "cực đoan hoặc nghiêm trọng"
                },
                "examples": [
                    {
                        "en": "He's in deep trouble.",
                        "vi": "Anh ấy đang gặp rắc rối sâu sắc."
                    },
                    {
                        "en": "a deep economic recession",
                        "vi": "suy thoái kinh tế sâu sắc"
                    },
                    {
                        "en": "The affair had exposed deep divisions within the party.",
                        "vi": "Vụ việc đã bộc lộ sự chia rẽ sâu sắc trong nội bộ đảng."
                    },
                    {
                        "en": "a place of great power and of deep significance",
                        "vi": "một nơi có quyền lực to lớn và có ý nghĩa sâu sắc"
                    }
                ]
            },
            {
                "define": {
                    "en": "showing great knowledge or understanding",
                    "vi": "thể hiện kiến thức hoặc hiểu biết tuyệt vời"
                },
                "examples": [
                    {
                        "en": "She had reached a deep understanding of the local culture.",
                        "vi": "Cô đã hiểu sâu về văn hóa địa phương."
                    },
                    {
                        "en": "We will need a deeper analysis of this problem.",
                        "vi": "Chúng ta sẽ cần phân tích sâu hơn về vấn đề này."
                    }
                ]
            },
            {
                "define": {
                    "en": "difficult to understand",
                    "vi": "khó để hiểu"
                },
                "examples": [
                    {
                        "en": "This discussion's getting too deep for me.",
                        "vi": "Cuộc thảo luận này đang trở nên quá sâu sắc đối với tôi."
                    },
                    {
                        "en": "He always sought for a deeper meaning in everything.",
                        "vi": "Anh ấy luôn tìm kiếm ý nghĩa sâu sắc hơn trong mọi thứ."
                    },
                    {
                        "en": "They spent hours discussing deep philosophical issues.",
                        "vi": "Họ đã dành hàng giờ đồng hồ để thảo luận về những vấn đề triết học sâu sắc."
                    }
                ]
            },
            {
                "define": {
                    "en": "fully involved in an activity or a state",
                    "vi": "tham gia đầy đủ vào một hoạt động hoặc một trạng thái"
                },
                "examples": [
                    {
                        "en": "to be deep in thought/conversation",
                        "vi": "đi sâu vào suy nghĩ / cuộc trò chuyện"
                    },
                    {
                        "en": "He is often so deep in his books that he forgets to eat.",
                        "vi": "Anh ấy thường mải mê đọc sách đến mức quên cả ăn."
                    },
                    {
                        "en": "The firm ended up deep in debt.",
                        "vi": "Công ty cuối cùng đã chìm sâu trong nợ nần."
                    }
                ]
            },
            {
                "define": {
                    "en": "if a person is deep, they hide their real feelings and opinions",
                    "vi": "nếu một người sâu sắc, họ che giấu cảm xúc và ý kiến thực sự của họ"
                },
                "examples": [
                    {
                        "en": "She's always been a deep one, trusting no one.",
                        "vi": "Cô ấy luôn là một người sâu sắc, không tin tưởng bất cứ ai."
                    }
                ]
            },
            {
                "define": {
                    "en": "to or from a position far down or across the field",
                    "vi": "đến hoặc từ một vị trí xa hoặc trên cánh đồng"
                },
                "examples": [
                    {
                        "en": "a deep ball from Brown",
                        "vi": "một quả bóng sâu từ Brown"
                    }
                ]
            },
            {
                "define": {
                    "en": "in a difficult situation where there are two equally unpleasant or unacceptable choices",
                    "vi": "trong một tình huống khó khăn mà có hai sự lựa chọn khó chịu hoặc không thể chấp nhận được như nhau"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "in trouble or difficulty",
                    "vi": "gặp rắc rối hoặc khó khăn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "in trouble",
                    "vi": "gặp rắc rối"
                },
                "examples": [
                    {
                        "en": "I'll be in the shit if I don't get this work finished today.",
                        "vi": "Tôi sẽ gặp rắc rối nếu không hoàn thành công việc hôm nay."
                    },
                    {
                        "en": "You’re in deep shit now.",
                        "vi": "Bây giờ bạn đang ở trong tình trạng tồi tệ."
                    }
                ]
            }
        ]
    },
    {
        "id": "7dcc8ff99fc04c4eb551e718436c3368",
        "word": "messed-up",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌmest ˈʌp/",
            "us": "/ˌmest ˈʌp/"
        },
        "nearby": [
            {
                "word": "mess around",
                "pos": "phrasal verb"
            },
            {
                "word": "mess around with",
                "pos": "phrasal verb"
            },
            {
                "word": "messed-up",
                "pos": "adjective"
            },
            {
                "word": "messenger",
                "pos": "noun"
            },
            {
                "word": "Messiah",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "full of problems, often because of a lack of organization or because of mistakes that somebody has made",
                    "vi": "đầy những vấn đề, thường là do thiếu tổ chức hoặc vì những sai lầm mà ai đó đã mắc phải"
                },
                "examples": [
                    {
                        "en": "Sport offers an escape from the messed-up world these kids find themselves in.",
                        "vi": "Thể thao cung cấp một lối thoát khỏi thế giới lộn xộn mà những đứa trẻ này tìm thấy chính mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "upset; very emotional",
                    "vi": "khó chịu; rất xúc động"
                },
                "examples": [
                    {
                        "en": "I wanted to write stories about the messed-up kids I grew up with who acted in messed-up ways.",
                        "vi": "Tôi muốn viết những câu chuyện về những đứa trẻ lộn xộn mà tôi lớn lên cùng những người đã hành động theo những cách lộn xộn."
                    }
                ]
            }
        ]
    },
    {
        "id": "d984ced0d19d452198faeba2dca39372",
        "word": "no pain, no gain",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/peɪn/",
            "us": "/peɪn/"
        },
        "nearby": [
            {
                "word": "Paige",
                "pos": ""
            },
            {
                "word": "pail",
                "pos": "noun"
            },
            {
                "word": "pain",
                "pos": "noun"
            },
            {
                "word": "pain",
                "pos": "verb"
            },
            {
                "word": "pain barrier",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the feelings that you have in your body when you have been hurt or when you are ill",
                    "vi": "những cảm giác mà bạn có trong cơ thể của bạn khi bạn bị tổn thương hoặc khi bạn bị ốm"
                },
                "examples": [
                    {
                        "en": "a cry of pain",
                        "vi": "một tiếng kêu đau đớn"
                    },
                    {
                        "en": "in pain She was clearly in a lot of pain.",
                        "vi": "trong đau đớn Cô ấy rõ ràng đã rất đau đớn."
                    },
                    {
                        "en": "He screamed in pain as he fell to his knees.",
                        "vi": "Anh đau đớn hét lên khi khuỵu xuống."
                    },
                    {
                        "en": "pain in something He felt a sharp pain in his knee.",
                        "vi": "đau một cái gì đó Anh cảm thấy đau nhói ở đầu gối của mình."
                    },
                    {
                        "en": "chronic/acute/severe pain",
                        "vi": "đau mãn tính / cấp tính / nghiêm trọng"
                    },
                    {
                        "en": "patients suffering from back pain",
                        "vi": "bệnh nhân bị đau lưng"
                    },
                    {
                        "en": "stomach/chest/abdominal/back pains",
                        "vi": "đau bụng / ngực / bụng / lưng"
                    },
                    {
                        "en": "You get more aches and pains as you get older.",
                        "vi": "Bạn bị đau nhức nhiều hơn khi bạn già đi."
                    },
                    {
                        "en": "The booklet contains information on pain relief during labour.",
                        "vi": "Tập sách có thông tin về giảm đau khi chuyển dạ."
                    },
                    {
                        "en": "This cream should help to relieve the pain.",
                        "vi": "Kem này sẽ giúp giảm đau."
                    },
                    {
                        "en": "These pills should ease the pain.",
                        "vi": "Những viên thuốc này sẽ làm dịu cơn đau."
                    },
                    {
                        "en": "to feel/experience/suffer pain",
                        "vi": "để cảm nhận / trải nghiệm / chịu đựng nỗi đau"
                    },
                    {
                        "en": "It's wrong to inflict pain on any animal.",
                        "vi": "Gây đau đớn cho bất kỳ con vật nào là sai."
                    },
                    {
                        "en": "I was able to learn pain management techniques.",
                        "vi": "Tôi đã có thể học các kỹ thuật kiểm soát cơn đau."
                    }
                ]
            },
            {
                "define": {
                    "en": "mental or emotional difficulty",
                    "vi": "khó khăn về tinh thần hoặc cảm xúc"
                },
                "examples": [
                    {
                        "en": "the pain of something the pain of separation",
                        "vi": "nỗi đau của một cái gì đó nỗi đau của sự chia ly"
                    },
                    {
                        "en": "the pain of doing something It took him several years to get over the pain of losing his job.",
                        "vi": "nỗi đau khi làm điều gì đó Phải mất vài năm anh ta mới có thể vượt qua nỗi đau mất việc."
                    },
                    {
                        "en": "I never meant to cause her pain.",
                        "vi": "Tôi không bao giờ có ý định gây ra nỗi đau cho cô ấy."
                    },
                    {
                        "en": "the pleasures and pains of growing old",
                        "vi": "niềm vui và nỗi đau của tuổi già"
                    },
                    {
                        "en": "a life full of pain and suffering",
                        "vi": "một cuộc sống đầy đau đớn và đau khổ"
                    }
                ]
            },
            {
                "define": {
                    "en": "a person or thing that is very annoying",
                    "vi": "một người hoặc một điều rất khó chịu"
                },
                "examples": [
                    {
                        "en": "She can be a real pain when she's in a bad mood.",
                        "vi": "Cô ấy có thể là một nỗi đau thực sự khi cô ấy có tâm trạng tồi tệ."
                    },
                    {
                        "en": "It's a pain having to go all that way for just one meeting.",
                        "vi": "Thật là khó khăn khi phải đi tất cả những con đường đó chỉ cho một cuộc họp."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that you need to suffer if you want to achieve something",
                    "vi": "từng nói rằng bạn cần phải chịu đựng nếu bạn muốn đạt được điều gì đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "with the threat of having something done to you as a punishment if you do not obey",
                    "vi": "với lời đe dọa sẽ làm gì đó với bạn như một hình phạt nếu bạn không tuân theo"
                },
                "examples": [
                    {
                        "en": "They were required to cut pollution levels, on pain of a £10 000 fine if they disobeyed.",
                        "vi": "Họ được yêu cầu cắt giảm mức độ ô nhiễm, với mức phạt 10 000 bảng Anh nếu họ không tuân theo."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person or thing that is very annoying",
                    "vi": "một người hoặc một điều rất khó chịu"
                },
                "examples": [
                    {
                        "en": "That man's a pain in the neck!",
                        "vi": "Người đàn ông đó rất đau cổ!"
                    }
                ]
            }
        ]
    },
    {
        "id": "493e8255fbc444df88eda4976505c5d5",
        "word": "pitfall",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpɪtfɔːl/",
            "us": "/ˈpɪtfɔːl/"
        },
        "nearby": [
            {
                "word": "piteous",
                "pos": "adjective"
            },
            {
                "word": "piteously",
                "pos": "adverb"
            },
            {
                "word": "pitfall",
                "pos": "noun"
            },
            {
                "word": "pith",
                "pos": "noun"
            },
            {
                "word": "pithead",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a danger or difficulty, especially one that is hidden or not obvious at first",
                    "vi": "một mối nguy hiểm hoặc khó khăn, đặc biệt là một mối nguy hiểm hoặc khó khăn lúc đầu bị che giấu hoặc không rõ ràng"
                },
                "examples": [
                    {
                        "en": "the potential pitfalls of buying a house",
                        "vi": "những cạm bẫy tiềm ẩn khi mua nhà"
                    },
                    {
                        "en": "Getting professional advice will help you avoid the most obvious pitfalls.",
                        "vi": "Nhận được sự tư vấn chuyên nghiệp sẽ giúp bạn tránh được những cạm bẫy rõ ràng nhất."
                    }
                ]
            }
        ]
    },
    {
        "id": "19510fde3b7e47438e1e52c2301f0d5f",
        "word": "pushed",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/pʊʃt/",
            "us": "/pʊʃt/"
        },
        "nearby": [
            {
                "word": "pushcart",
                "pos": "noun"
            },
            {
                "word": "pushchair",
                "pos": "noun"
            },
            {
                "word": "pushed",
                "pos": "adjective"
            },
            {
                "word": "pusher",
                "pos": "noun"
            },
            {
                "word": "push for",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "having difficulty doing something",
                    "vi": "gặp khó khăn khi làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "You'll be hard pushed to finish this today.",
                        "vi": "Bạn sẽ khó hoàn thành việc này ngày hôm nay."
                    }
                ]
            },
            {
                "define": {
                    "en": "not having enough of something",
                    "vi": "không có đủ thứ gì đó"
                },
                "examples": [
                    {
                        "en": "to be pushed for money/time",
                        "vi": "được thúc đẩy vì tiền / thời gian"
                    }
                ]
            },
            {
                "define": {
                    "en": "busy",
                    "vi": "bận"
                },
                "examples": [
                    {
                        "en": "I know you're pushed, but can you make tomorrow's meeting?",
                        "vi": "Tôi biết bạn bị thúc ép, nhưng bạn có thể hẹn ngày mai được không?"
                    }
                ]
            }
        ]
    },
    {
        "id": "eaf526a6cda7465bb372f9e70dca1438",
        "word": "quagmire",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkwæɡmaɪə(r)/",
            "us": "/ˈkwæɡmaɪər/"
        },
        "nearby": [
            {
                "word": "quaff",
                "pos": "verb"
            },
            {
                "word": "quagga",
                "pos": "noun"
            },
            {
                "word": "quagmire",
                "pos": "noun"
            },
            {
                "word": "quahog",
                "pos": "noun"
            },
            {
                "word": "quail",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an area of soft wet ground",
                    "vi": "một khu vực đất mềm ẩm ướt"
                },
                "examples": [
                    {
                        "en": "The heavy rain soon turned the field into a quagmire.",
                        "vi": "Cơn mưa lớn chẳng mấy chốc đã biến cánh đồng thành vũng lầy."
                    }
                ]
            },
            {
                "define": {
                    "en": "a difficult or dangerous situation",
                    "vi": "một tình huống khó khăn hoặc nguy hiểm"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "35e9696c3f024a9a83be73edb70d9fe6",
        "word": "run up against",
        "pos": "phrasal verb",
        "level": "c2",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "run up",
                "pos": "phrasal verb"
            },
            {
                "word": "run-up",
                "pos": "noun"
            },
            {
                "word": "run up against",
                "pos": "phrasal verb"
            },
            {
                "word": "runway",
                "pos": "noun"
            },
            {
                "word": "run with",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to experience a difficulty",
                    "vi": "trải qua một khó khăn"
                },
                "examples": [
                    {
                        "en": "The government is running up against considerable opposition to its tax reforms.",
                        "vi": "Chính phủ đang hoạt động chống lại sự phản đối đáng kể đối với các cải cách thuế của mình."
                    }
                ]
            }
        ]
    },
    {
        "id": "3a953a0f7c9c40d39b9869b05366833c",
        "word": "strife",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/straɪf/",
            "us": "/straɪf/"
        },
        "nearby": [
            {
                "word": "strident",
                "pos": "adjective"
            },
            {
                "word": "stridently",
                "pos": "adverb"
            },
            {
                "word": "strife",
                "pos": "noun"
            },
            {
                "word": "strike",
                "pos": "verb"
            },
            {
                "word": "strike",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "anger or violence between two people or groups of people who disagree",
                    "vi": "giận dữ hoặc bạo lực giữa hai người hoặc nhóm người không đồng ý với nhau"
                },
                "examples": [
                    {
                        "en": "civil strife",
                        "vi": "xung đột dân sự"
                    },
                    {
                        "en": "The country was torn apart by strife.",
                        "vi": "Đất nước bị chia cắt bởi xung đột."
                    },
                    {
                        "en": "internecine strife among the nationalities of the empire",
                        "vi": "xung đột giữa các quốc gia của đế chế"
                    }
                ]
            },
            {
                "define": {
                    "en": "trouble or difficulty of any kind",
                    "vi": "rắc rối hoặc khó khăn của bất kỳ loại nào"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "6dd082cbd7f44f62b5d02699b5b2e430",
        "word": "surmount",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/səˈmaʊnt/",
            "us": "/sərˈmaʊnt/"
        },
        "nearby": [
            {
                "word": "surmise",
                "pos": "verb"
            },
            {
                "word": "surmise",
                "pos": "noun"
            },
            {
                "word": "surmount",
                "pos": "verb"
            },
            {
                "word": "surname",
                "pos": "noun"
            },
            {
                "word": "surpass",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to deal successfully with a difficulty",
                    "vi": "để đối phó thành công với một khó khăn"
                },
                "examples": [
                    {
                        "en": "She was well aware of the difficulties that had to be surmounted.",
                        "vi": "Cô nhận thức rõ những khó khăn phải vượt qua."
                    },
                    {
                        "en": "The organizers of the concerts have first to surmount the hurdle of gaining sponsorship.",
                        "vi": "Các nhà tổ chức của buổi hòa nhạc trước tiên phải vượt qua rào cản của việc giành được tài trợ."
                    },
                    {
                        "en": "There are several obstacles to be surmounted.",
                        "vi": "Có một số trở ngại cần được vượt qua."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be placed on top of something",
                    "vi": "được đặt trên một cái gì đó"
                },
                "examples": [
                    {
                        "en": "a high column surmounted by a statue",
                        "vi": "một cột cao vượt qua một bức tượng"
                    }
                ]
            }
        ]
    },
    {
        "id": "5632b167140a427d84924321d64de9de",
        "word": "take the bull by the horns",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/bʊl/",
            "us": "/bʊl/"
        },
        "nearby": [
            {
                "word": "bulk up",
                "pos": "phrasal verb"
            },
            {
                "word": "bulky",
                "pos": "adjective"
            },
            {
                "word": "bull",
                "pos": "noun"
            },
            {
                "word": "bull bars",
                "pos": "noun"
            },
            {
                "word": "bulldog",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the male of any animal in the cow family",
                    "vi": "con đực của bất kỳ động vật nào trong gia đình bò"
                },
                "examples": [
                    {
                        "en": "a bull neck (= a short thick neck like a bull's)",
                        "vi": "cổ bò (= cổ ngắn dày như cổ bò)"
                    }
                ]
            },
            {
                "define": {
                    "en": "the male of the elephant, whale and some other large animals",
                    "vi": "con đực của voi, cá voi và một số động vật lớn khác"
                },
                "examples": [
                    {
                        "en": "a bull elephant",
                        "vi": "một con voi bò"
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who buys shares in a company, hoping to sell them soon afterwards at a higher price",
                    "vi": "một người mua cổ phiếu của một công ty, hy vọng sẽ bán chúng ngay sau đó với giá cao hơn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "an official order or statement from the Pope (= the head of the Roman Catholic Church)",
                    "vi": "một mệnh lệnh hoặc tuyên bố chính thức từ Giáo hoàng (= người đứng đầu Nhà thờ Công giáo La Mã)"
                },
                "examples": [
                    {
                        "en": "a papal bull",
                        "vi": "một con bò đực của giáo hoàng"
                    }
                ]
            },
            {
                "define": {
                    "en": "ideas, statements or beliefs that you think are silly or not true",
                    "vi": "ý tưởng, tuyên bố hoặc niềm tin mà bạn cho là ngớ ngẩn hoặc không đúng sự thật"
                },
                "examples": [
                    {
                        "en": "That's a load of bull!",
                        "vi": "Đó là một tải trọng của con bò đực!"
                    },
                    {
                        "en": "If you want to believe all that bull it’s up to you.",
                        "vi": "Nếu bạn muốn tin rằng tất cả những gì con bò tót đó là tùy thuộc vào bạn."
                    },
                    {
                        "en": "That’s just bull and you know it.",
                        "vi": "Đó chỉ là con bò đực và bạn biết điều đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "the centre of the target that you shoot or throw at in shooting, archery or darts; a shot or throw that hits this",
                    "vi": "trung tâm của mục tiêu mà bạn bắn hoặc ném vào trong bắn súng, bắn cung hoặc phi tiêu; một cú sút hoặc ném trúng cái này"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a person who is careless, or who moves or acts in a rough way, in a place or situation where skill and care are needed",
                    "vi": "một người bất cẩn, di chuyển hoặc hành động thô bạo, ở một nơi hoặc tình huống cần kỹ năng và sự cẩn thận"
                },
                "examples": [
                    {
                        "en": "You’re not going to go storming in there like a bull in a china shop, are you?",
                        "vi": "Bạn sẽ không xông vào đó như một con bò đực trong cửa hàng đồ sứ, phải không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to talk about something that is likely to make somebody very angry",
                    "vi": "được sử dụng để nói về điều gì đó có thể khiến ai đó rất tức giận"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to have a conversation in an informal way",
                    "vi": "trò chuyện một cách thân mật"
                },
                "examples": [
                    {
                        "en": "We sat around in the bar, shooting the breeze.",
                        "vi": "Chúng tôi ngồi quanh quán bar, hóng gió."
                    }
                ]
            },
            {
                "define": {
                    "en": "to face a difficult or dangerous situation directly and with courage",
                    "vi": "đối mặt với một tình huống khó khăn hoặc nguy hiểm một cách trực tiếp và can đảm"
                },
                "examples": [
                    {
                        "en": "Nora decided to take the bull by the horns and organize things for herself.",
                        "vi": "Nora quyết định lấy sừng con bò và sắp xếp mọi thứ cho chính mình."
                    }
                ]
            }
        ]
    },
    {
        "id": "dfad08ed62c14e01b468aa697640978d",
        "word": "tortured",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈtɔːtʃəd/",
            "us": "/ˈtɔːrtʃərd/"
        },
        "nearby": [
            {
                "word": "torture",
                "pos": "noun"
            },
            {
                "word": "torture",
                "pos": "verb"
            },
            {
                "word": "tortured",
                "pos": "adjective"
            },
            {
                "word": "torturer",
                "pos": "noun"
            },
            {
                "word": "Tory",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "suffering severely; involving a lot of pain and difficulty",
                    "vi": "đau khổ nghiêm trọng; liên quan đến nhiều đau đớn và khó khăn"
                },
                "examples": [
                    {
                        "en": "a tortured mind",
                        "vi": "một tâm trí bị tra tấn"
                    },
                    {
                        "en": "She fell into a tortured sleep.",
                        "vi": "Cô chìm vào một giấc ngủ bị tra tấn."
                    }
                ]
            }
        ]
    },
    {
        "id": "0a931de4b2d740858af65eeccfc7e598",
        "word": "when push comes to shove",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/pʊʃ/",
            "us": "/pʊʃ/"
        },
        "nearby": [
            {
                "word": "Edward Pusey",
                "pos": ""
            },
            {
                "word": "push",
                "pos": "verb"
            },
            {
                "word": "push",
                "pos": "noun"
            },
            {
                "word": "push about",
                "pos": "phrasal verb"
            },
            {
                "word": "push ahead",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an act of pushing something/somebody",
                    "vi": "một hành động đẩy một cái gì đó / ai đó"
                },
                "examples": [
                    {
                        "en": "She gave him a gentle push.",
                        "vi": "Cô nhẹ nhàng đẩy anh."
                    },
                    {
                        "en": "The car won't start. Can you give it a push?",
                        "vi": "Xe sẽ không nổ máy. Bạn có thể cho nó một cú hích?"
                    },
                    {
                        "en": "(figurative) At the push of a button (= very easily) he could get a whole list of names.",
                        "vi": "(nghĩa bóng) Chỉ với một nút nhấn (= rất dễ dàng) anh ta có thể có được toàn bộ danh sách tên."
                    }
                ]
            },
            {
                "define": {
                    "en": "a large and determined military attack",
                    "vi": "một cuộc tấn công quân sự lớn và kiên quyết"
                },
                "examples": [
                    {
                        "en": "a final push against the enemy",
                        "vi": "một cú hích cuối cùng chống lại kẻ thù"
                    },
                    {
                        "en": "(figurative) The firm has begun a major push into the European market.",
                        "vi": "(nghĩa bóng) Công ty đã bắt đầu một cuộc đẩy mạnh vào thị trường châu Âu."
                    }
                ]
            },
            {
                "define": {
                    "en": "a determined effort to achieve something",
                    "vi": "một nỗ lực quyết tâm để đạt được một cái gì đó"
                },
                "examples": [
                    {
                        "en": "The push for reform started in 2007.",
                        "vi": "Việc thúc đẩy cải cách bắt đầu vào năm 2007."
                    }
                ]
            },
            {
                "define": {
                    "en": "an act of encouraging somebody to do something",
                    "vi": "một hành động khuyến khích ai đó làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "He wants to open his own business, but needs a push in the right direction to get him started.",
                        "vi": "Anh ấy muốn mở doanh nghiệp của riêng mình, nhưng cần một sự thúc đẩy đúng hướng để anh ấy bắt đầu."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that something is possible, but only with difficulty",
                    "vi": "được sử dụng để nói rằng một cái gì đó có thể, nhưng chỉ với khó khăn"
                },
                "examples": [
                    {
                        "en": "We can provide accommodation for six people at a push.",
                        "vi": "Chúng tôi có thể cung cấp chỗ ở cho sáu người tại một thời điểm thúc đẩy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to dismiss somebody/to be dismissed from your job",
                    "vi": "sa thải ai đó / bị sa thải khỏi công việc của bạn"
                },
                "examples": [
                    {
                        "en": "They gave him the push after only six weeks.",
                        "vi": "Họ đã thúc đẩy anh ta chỉ sau sáu tuần."
                    }
                ]
            },
            {
                "define": {
                    "en": "to end a romantic relationship with somebody; to be told that a romantic relationship with somebody is over",
                    "vi": "để kết thúc một mối quan hệ lãng mạn với ai đó; được nói rằng một mối quan hệ lãng mạn với ai đó đã kết thúc"
                },
                "examples": [
                    {
                        "en": "He was devastated when his girlfriend gave him the push.",
                        "vi": "Anh ấy đã bị tàn phá khi bạn gái của anh ấy đẩy anh ấy ra."
                    }
                ]
            },
            {
                "define": {
                    "en": "when there is no other choice; when everything else has failed",
                    "vi": "khi không có sự lựa chọn nào khác; khi mọi thứ khác đã thất bại"
                },
                "examples": []
            }
        ]
    }
]