[
    {
        "id": "2cf201c4d8f94715b3bc8436d79d53b3",
        "word": "concert",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/ˈkɒnsət/",
            "us": "/ˈkɑːnsərt/"
        },
        "nearby": [
            {
                "word": "concerning",
                "pos": "preposition"
            },
            {
                "word": "concerning",
                "pos": "adjective"
            },
            {
                "word": "concert",
                "pos": "noun"
            },
            {
                "word": "concertante",
                "pos": "adjective"
            },
            {
                "word": "concert band",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a public performance of music",
                    "vi": "một buổi biểu diễn âm nhạc công cộng"
                },
                "examples": [
                    {
                        "en": "to attend/go to a concert",
                        "vi": "tham dự / đi xem hòa nhạc"
                    },
                    {
                        "en": "The orchestra gave a concert in Miami in January.",
                        "vi": "Dàn nhạc đã tổ chức một buổi hòa nhạc ở Miami vào tháng Giêng."
                    },
                    {
                        "en": "a series of concerts organized by the Oxford Chamber Music Society",
                        "vi": "một loạt các buổi hòa nhạc do Hiệp hội Âm nhạc Thính phòng Oxford tổ chức"
                    },
                    {
                        "en": "a classical/rock/pop concert",
                        "vi": "một buổi hòa nhạc cổ điển / rock / pop"
                    },
                    {
                        "en": "a benefit/charity concert",
                        "vi": "một buổi hòa nhạc từ thiện / phúc lợi"
                    },
                    {
                        "en": "in concert They're in concert at Wembley arena.",
                        "vi": "trong buổi hòa nhạc Họ đang trong buổi hòa nhạc tại đấu trường Wembley."
                    },
                    {
                        "en": "at a concert They also performed at a concert in Rome last month.",
                        "vi": "tại một buổi hòa nhạc Họ cũng đã biểu diễn tại một buổi hòa nhạc ở Rome vào tháng trước."
                    },
                    {
                        "en": "concert of something a concert of music by Bach",
                        "vi": "buổi hòa nhạc của một cái gì đó một buổi hòa nhạc của Bach"
                    },
                    {
                        "en": "concert by somebody/something I got dragged along to concerts by bands I hated.",
                        "vi": "buổi hòa nhạc của ai đó / cái gì đó tôi bị kéo đến buổi hòa nhạc của những ban nhạc mà tôi ghét."
                    },
                    {
                        "en": "concert for somebody/something a fundraising concert for tsunami victims",
                        "vi": "buổi hòa nhạc cho ai đó / một buổi hòa nhạc gây quỹ cho nạn nhân sóng thần"
                    },
                    {
                        "en": "a concert hall",
                        "vi": "Một phòng hòa nhạc"
                    },
                    {
                        "en": "a concert pianist/tour/series",
                        "vi": "một nghệ sĩ dương cầm hòa nhạc / chuyến lưu diễn / loạt phim"
                    }
                ]
            },
            {
                "define": {
                    "en": "working together with somebody/something",
                    "vi": "làm việc cùng với ai đó / cái gì đó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "ce78efbfe0f245ebb1520990b2a007bf",
        "word": "festival",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/ˈfestɪvl/",
            "us": "/ˈfestɪvl/"
        },
        "nearby": [
            {
                "word": "fest",
                "pos": "noun"
            },
            {
                "word": "fester",
                "pos": "verb"
            },
            {
                "word": "festival",
                "pos": "noun"
            },
            {
                "word": "the Festival Hall",
                "pos": ""
            },
            {
                "word": "the Festival of Britain",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a series of performances of music, plays, films, etc., usually organized in the same place once a year; a series of public events connected with a particular activity or idea",
                    "vi": "một loạt các buổi biểu diễn ca nhạc, kịch, phim, v.v., thường được tổ chức ở cùng một địa điểm mỗi năm một lần; một loạt các sự kiện công cộng được kết nối với một hoạt động hoặc ý tưởng cụ thể"
                },
                "examples": [
                    {
                        "en": "a film/music festival",
                        "vi": "một lễ hội phim / âm nhạc"
                    },
                    {
                        "en": "the Edinburgh Festival",
                        "vi": "Lễ hội Edinburgh"
                    },
                    {
                        "en": "the Cannes Film Festival",
                        "vi": "Liên hoan phim Cannes"
                    },
                    {
                        "en": "The pub is holding its annual beer festival later this week.",
                        "vi": "Quán rượu sẽ tổ chức lễ hội bia thường niên vào cuối tuần này."
                    },
                    {
                        "en": "a rock festival (= where bands perform, often outdoors and over a period of several days)",
                        "vi": "một lễ hội nhạc rock (= nơi các ban nhạc biểu diễn, thường ở ngoài trời và trong khoảng thời gian vài ngày)"
                    }
                ]
            },
            {
                "define": {
                    "en": "a day or period of the year when people stop working to celebrate a special event, often a religious one",
                    "vi": "một ngày hoặc khoảng thời gian trong năm khi mọi người ngừng làm việc để kỷ niệm một sự kiện đặc biệt, thường là một sự kiện tôn giáo"
                },
                "examples": [
                    {
                        "en": "The family always celebrates the Jewish festivals.",
                        "vi": "Gia đình luôn tổ chức các lễ hội của người Do Thái."
                    },
                    {
                        "en": "the pilgrims who arrived on major festivals",
                        "vi": "những người hành hương đến vào các lễ hội lớn"
                    },
                    {
                        "en": "festivals held in honour of local saints",
                        "vi": "lễ hội được tổ chức để tôn vinh các vị thánh địa phương"
                    },
                    {
                        "en": "Holi, the Hindu festival to welcome spring",
                        "vi": "Holi, lễ hội chào đón mùa xuân của người Hindu"
                    }
                ]
            }
        ]
    },
    {
        "id": "e666febd1ecc4b3ba1c4958f82aa9ad1",
        "word": "perform",
        "pos": "verb",
        "level": "a2",
        "phonetic": {
            "uk": "/pəˈfɔːm/",
            "us": "/pərˈfɔːrm/"
        },
        "nearby": [
            {
                "word": "perforation",
                "pos": "noun"
            },
            {
                "word": "perforce",
                "pos": "adverb"
            },
            {
                "word": "perform",
                "pos": "verb"
            },
            {
                "word": "performance",
                "pos": "noun"
            },
            {
                "word": "performance art",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to entertain an audience by playing a piece of music, acting in a play, etc.",
                    "vi": "để giải trí cho khán giả bằng cách chơi một bản nhạc, diễn xuất trong một vở kịch, v.v."
                },
                "examples": [
                    {
                        "en": "to perform a song/dance/play",
                        "vi": "để biểu diễn một bài hát / khiêu vũ / chơi"
                    },
                    {
                        "en": "The play was first performed in 2007.",
                        "vi": "Vở kịch được công diễn lần đầu tiên vào năm 2007."
                    },
                    {
                        "en": "Visiting artists will perform their music and poetry.",
                        "vi": "Các nghệ sĩ đến thăm sẽ biểu diễn âm nhạc và thơ ca của họ."
                    },
                    {
                        "en": "I'm looking forward to seeing you perform.",
                        "vi": "Tôi rất mong được xem bạn biểu diễn."
                    },
                    {
                        "en": "I'd love to see them perform live (= in a live show, not a recording).",
                        "vi": "Tôi muốn xem họ biểu diễn trực tiếp (= trong một chương trình trực tiếp, không phải ghi âm)."
                    },
                    {
                        "en": "What do you like about performing on stage?",
                        "vi": "Bạn thích điều gì khi biểu diễn trên sân khấu?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to do something, such as a piece of work, task or duty",
                    "vi": "để làm điều gì đó, chẳng hạn như một phần của công việc, nhiệm vụ hoặc nghĩa vụ"
                },
                "examples": [
                    {
                        "en": "She performs an important role in our organization.",
                        "vi": "Cô ấy đóng một vai trò quan trọng trong tổ chức của chúng tôi."
                    },
                    {
                        "en": "A computer can perform many tasks at once.",
                        "vi": "Một máy tính có thể thực hiện nhiều tác vụ cùng một lúc."
                    },
                    {
                        "en": "to perform a function/duty",
                        "vi": "để thực hiện một chức năng / nhiệm vụ"
                    },
                    {
                        "en": "to perform an analysis/a test/an experiment",
                        "vi": "để thực hiện một phân tích / một thử nghiệm / một thử nghiệm"
                    },
                    {
                        "en": "to perform a ceremony/ritual",
                        "vi": "để thực hiện một buổi lễ / nghi lễ"
                    },
                    {
                        "en": "(medical) to perform an operation/a procedure/surgery",
                        "vi": "(y tế) để thực hiện một ca phẫu thuật / một thủ thuật / phẫu thuật"
                    },
                    {
                        "en": "The procedure was performed safely on ten patients.",
                        "vi": "Thủ tục được thực hiện an toàn trên mười bệnh nhân."
                    }
                ]
            },
            {
                "define": {
                    "en": "to work or function well or badly",
                    "vi": "làm việc hoặc hoạt động tốt hay xấu"
                },
                "examples": [
                    {
                        "en": "The engine seems to be performing well.",
                        "vi": "Động cơ dường như đang hoạt động tốt."
                    },
                    {
                        "en": "The company has been performing poorly over the past year.",
                        "vi": "Công ty đã hoạt động kém hiệu quả trong năm qua."
                    },
                    {
                        "en": "England's players perform better for their clubs than for their country.",
                        "vi": "Các cầu thủ của Anh thể hiện tốt hơn cho câu lạc bộ của họ hơn là cho đất nước của họ."
                    },
                    {
                        "en": "to perform admirably/brilliantly/strongly",
                        "vi": "hoạt động đáng ngưỡng mộ / xuất sắc / mạnh mẽ"
                    },
                    {
                        "en": "She performed less well in the second test.",
                        "vi": "Cô ấy thể hiện kém hơn trong bài kiểm tra thứ hai."
                    },
                    {
                        "en": "They gather information on how businesses are performing.",
                        "vi": "Họ thu thập thông tin về cách các doanh nghiệp đang hoạt động."
                    },
                    {
                        "en": "If Bale performs (= performs well) then I believe Wales can win.",
                        "vi": "Nếu Bale thực hiện (= thực hiện tốt) thì tôi tin rằng Xứ Wales có thể giành chiến thắng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to achieve very good results",
                    "vi": "để đạt được kết quả rất tốt"
                },
                "examples": [
                    {
                        "en": "Her exercise programme has worked miracles for her.",
                        "vi": "Chương trình tập thể dục của cô ấy đã mang lại những điều kỳ diệu cho cô ấy."
                    },
                    {
                        "en": "You can work miracles with very little money if you follow our home decoration tips.",
                        "vi": "Bạn có thể làm nên những điều kỳ diệu với rất ít tiền nếu làm theo các mẹo trang trí nhà cửa của chúng tôi."
                    },
                    {
                        "en": "He performed miracles to get everything ready in time.",
                        "vi": "Anh ấy đã thực hiện phép màu để mọi thứ sẵn sàng kịp thời."
                    }
                ]
            }
        ]
    },
    {
        "id": "14a7cf0e7e6c4fb8ae995141df6f20e3",
        "word": "tour",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/tʊə(r)/",
            "us": "/tʊr/"
        },
        "nearby": [
            {
                "word": "tough out",
                "pos": "phrasal verb"
            },
            {
                "word": "toupee",
                "pos": "noun"
            },
            {
                "word": "tour",
                "pos": "noun"
            },
            {
                "word": "tour",
                "pos": "verb"
            },
            {
                "word": "tour de force",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a journey made for pleasure during which several different towns, countries, etc. are visited",
                    "vi": "một cuộc hành trình thực hiện cho niềm vui trong đó một số thị trấn, quốc gia khác nhau, v.v. được ghé thăm"
                },
                "examples": [
                    {
                        "en": "a walking/sightseeing/bus tour",
                        "vi": "một chuyến đi bộ / tham quan / xe buýt"
                    },
                    {
                        "en": "tour of/round/around something a coach tour of northern France",
                        "vi": "chuyến tham quan / vòng quanh / một cái gì đó một chuyến tham quan bằng xe khách ở miền bắc nước Pháp"
                    },
                    {
                        "en": "They embarked on a tour around the country.",
                        "vi": "Họ bắt tay vào một chuyến du lịch vòng quanh đất nước."
                    },
                    {
                        "en": "a tour operator (= a person or company that organizes tours)",
                        "vi": "một nhà điều hành tour du lịch (= một người hoặc công ty tổ chức các chuyến tham quan)"
                    }
                ]
            },
            {
                "define": {
                    "en": "an act of walking around a town, building, etc. in order to visit it",
                    "vi": "một hành động đi bộ xung quanh một thị trấn, tòa nhà, v.v. để tham quan nó"
                },
                "examples": [
                    {
                        "en": "We were given a guided tour (= by somebody who knows about the place) of the palace.",
                        "vi": "Chúng tôi đã được đưa cho một chuyến tham quan có hướng dẫn (= bởi một người nào đó biết về địa điểm) của cung điện."
                    },
                    {
                        "en": "a virtual tour (= shown on a computer) of the Taj Mahal",
                        "vi": "một chuyến tham quan ảo (= hiển thị trên máy tính) đến Taj Mahal"
                    },
                    {
                        "en": "a tour of inspection (= an official visit of a factory, classroom, etc. made by somebody whose job is to check that everything is working as expected)",
                        "vi": "một chuyến tham quan kiểm tra (= một chuyến thăm chính thức nhà máy, lớp học, v.v. được thực hiện bởi một người nào đó có công việc là kiểm tra xem mọi thứ có hoạt động như mong đợi hay không)"
                    },
                    {
                        "en": "a tour guide",
                        "vi": "hướng dẫn viên du lịch"
                    },
                    {
                        "en": "tour of/round/around something Our host gave us a quick tour of the house.",
                        "vi": "chuyến tham quan / vòng quanh / một cái gì đó Chủ nhà của chúng tôi đã cho chúng tôi tham quan nhanh ngôi nhà."
                    }
                ]
            },
            {
                "define": {
                    "en": "an official series of visits made to different places by a sports team, an orchestra, an important person, etc.",
                    "vi": "một loạt các chuyến thăm chính thức đến những nơi khác nhau của một đội thể thao, một dàn nhạc, một nhân vật quan trọng, v.v."
                },
                "examples": [
                    {
                        "en": "The band is currently on a nine-day tour of France.",
                        "vi": "Ban nhạc hiện đang có chuyến lưu diễn chín ngày ở Pháp."
                    },
                    {
                        "en": "on tour The band is on tour in France.",
                        "vi": "về chuyến lưu diễn Ban nhạc đang đi lưu diễn ở Pháp."
                    },
                    {
                        "en": "a concert tour",
                        "vi": "một chuyến lưu diễn"
                    },
                    {
                        "en": "a world/European/UK tour",
                        "vi": "một chuyến du lịch vòng quanh thế giới / Châu Âu / Vương quốc Anh"
                    },
                    {
                        "en": "a tour bus",
                        "vi": "một chiếc xe buýt du lịch"
                    },
                    {
                        "en": "The prince will visit Boston on the last leg (= part) of his American tour.",
                        "vi": "Hoàng tử sẽ đến thăm Boston vào chặng cuối cùng (= một phần) của chuyến công du Mỹ."
                    },
                    {
                        "en": "a book/lecture/speaking tour",
                        "vi": "một cuốn sách / bài giảng / chuyến tham quan"
                    },
                    {
                        "en": "Are you doing a tour for this new book?",
                        "vi": "Bạn đang thực hiện một chuyến tham quan cho cuốn sách mới này?"
                    },
                    {
                        "en": "The group will shortly go on a ten-city European tour.",
                        "vi": "Nhóm sẽ sớm có chuyến lưu diễn 10 thành phố ở Châu Âu."
                    },
                    {
                        "en": "We are going back to Prague as part of a small tour.",
                        "vi": "Chúng tôi sẽ trở lại Praha như một phần của chuyến tham quan nhỏ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a period of time when somebody is serving in the military or as a diplomat in a particular place",
                    "vi": "một khoảng thời gian khi ai đó đang phục vụ trong quân đội hoặc là một nhà ngoại giao ở một nơi cụ thể"
                },
                "examples": [
                    {
                        "en": "He served tours all over the world during his 35-year career.",
                        "vi": "Anh ấy đã phục vụ các chuyến lưu diễn khắp nơi trên thế giới trong suốt 35 năm sự nghiệp của mình."
                    }
                ]
            }
        ]
    },
    {
        "id": "0ea92eaa3af54f31b99a143408d34c5c",
        "word": "live",
        "pos": "adjective",
        "level": "b1",
        "phonetic": {
            "uk": "/laɪv/",
            "us": "/laɪv/"
        },
        "nearby": [
            {
                "word": "livable",
                "pos": "adjective"
            },
            {
                "word": "live1",
                "pos": "verb"
            },
            {
                "word": "live2",
                "pos": "adjective"
            },
            {
                "word": "live2",
                "pos": "adverb"
            },
            {
                "word": "liveable",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "living; not dead",
                    "vi": "cuộc sống; không chết"
                },
                "examples": [
                    {
                        "en": "live animals",
                        "vi": "động vật sống"
                    },
                    {
                        "en": "the number of live births (= babies born alive)",
                        "vi": "số trẻ sinh sống (= trẻ sinh ra còn sống)"
                    },
                    {
                        "en": "We saw a real live rattlesnake!",
                        "vi": "Chúng tôi đã nhìn thấy một con rắn đuôi chuông sống thực sự!"
                    },
                    {
                        "en": "I need to talk to a live person (= not a recording or computer).",
                        "vi": "Tôi cần nói chuyện với một người trực tiếp (= không phải ghi âm hoặc máy tính)."
                    }
                ]
            },
            {
                "define": {
                    "en": "sent out while the event is actually happening, not recorded first and broadcast later",
                    "vi": "được gửi đi trong khi sự kiện đang thực sự diễn ra, không được ghi lại trước và phát sóng sau"
                },
                "examples": [
                    {
                        "en": "a live broadcast",
                        "vi": "một chương trình phát sóng trực tiếp"
                    },
                    {
                        "en": "live coverage of the World Cup",
                        "vi": "phủ sóng trực tiếp của World Cup"
                    },
                    {
                        "en": "You're looking at live pictures from a Las Vegas courtroom.",
                        "vi": "Bạn đang xem hình ảnh trực tiếp từ phòng xử án ở Las Vegas."
                    },
                    {
                        "en": "a live report from our correspondent in Jerusalem",
                        "vi": "một tường thuật trực tiếp từ phóng viên của chúng tôi ở Jerusalem"
                    },
                    {
                        "en": "on live television/TV",
                        "vi": "trên truyền hình trực tiếp / TV"
                    },
                    {
                        "en": "a live video feed",
                        "vi": "một nguồn cấp dữ liệu video trực tiếp"
                    },
                    {
                        "en": "Is the show live or recorded?",
                        "vi": "Chương trình là trực tiếp hay được ghi lại?"
                    }
                ]
            },
            {
                "define": {
                    "en": "given or made when people are watching, not recorded",
                    "vi": "được đưa ra hoặc được thực hiện khi mọi người đang xem, không được ghi lại"
                },
                "examples": [
                    {
                        "en": "The club has live music most nights.",
                        "vi": "Câu lạc bộ có nhạc sống hầu hết các đêm."
                    },
                    {
                        "en": "the magic of a live performance",
                        "vi": "sự kỳ diệu của một buổi biểu diễn trực tiếp"
                    },
                    {
                        "en": "They're still one of the best live bands (= best at performing) around.",
                        "vi": "Họ vẫn là một trong những ban nhạc sống tốt nhất (= biểu diễn tốt nhất) xung quanh."
                    },
                    {
                        "en": "It was the first interview I'd done in front of a live audience (= with people watching).",
                        "vi": "Đó là cuộc phỏng vấn đầu tiên tôi thực hiện trước một khán giả trực tiếp (= với những người đang xem)."
                    }
                ]
            },
            {
                "define": {
                    "en": "made at a live performance, not in a recording studio",
                    "vi": "được thực hiện tại một buổi biểu diễn trực tiếp, không phải trong phòng thu âm"
                },
                "examples": [
                    {
                        "en": "a live recording made at Wembley Arena",
                        "vi": "một bản ghi âm trực tiếp được thực hiện tại Wembley Arena"
                    },
                    {
                        "en": "the band’s new live album",
                        "vi": "album trực tiếp mới của ban nhạc"
                    }
                ]
            },
            {
                "define": {
                    "en": "connected to a source of electrical power",
                    "vi": "kết nối với nguồn điện"
                },
                "examples": [
                    {
                        "en": "That terminal is live.",
                        "vi": "Thiết bị đầu cuối đó đang hoạt động."
                    }
                ]
            },
            {
                "define": {
                    "en": "still able to explode or light; ready for use",
                    "vi": "vẫn có thể nổ hoặc sáng; sẵn sàng để sử dụng"
                },
                "examples": [
                    {
                        "en": "live ammunition",
                        "vi": "đạn thật"
                    }
                ]
            },
            {
                "define": {
                    "en": "live coals are burning or are still hot and red",
                    "vi": "than sống đang cháy hoặc vẫn còn nóng và đỏ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "live yogurt still contains the bacteria needed to turn milk into yogurt",
                    "vi": "sữa chua sống vẫn chứa các vi khuẩn cần thiết để biến sữa thành sữa chua"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "of interest or importance at the present time",
                    "vi": "quan tâm hoặc quan trọng tại thời điểm hiện tại"
                },
                "examples": [
                    {
                        "en": "Pollution is still very much a live issue.",
                        "vi": "Ô nhiễm vẫn còn là một vấn đề trực tiếp."
                    }
                ]
            },
            {
                "define": {
                    "en": "functioning correctly, so that it is connected to another document or page on the internet",
                    "vi": "hoạt động bình thường, để nó được kết nối với tài liệu hoặc trang khác trên internet"
                },
                "examples": [
                    {
                        "en": "Here are some live links to other aviation-related web pages.",
                        "vi": "Dưới đây là một số liên kết trực tiếp đến các trang web khác liên quan đến hàng không."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who is lively and full of energy",
                    "vi": "một người sôi nổi và tràn đầy năng lượng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "381abc1ca21a48238bf865cfdb98b4a3",
        "word": "musical",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈmjuːzɪkl/",
            "us": "/ˈmjuːzɪkl/"
        },
        "nearby": [
            {
                "word": "music",
                "pos": "noun"
            },
            {
                "word": "musical",
                "pos": "adjective"
            },
            {
                "word": "musical",
                "pos": "noun"
            },
            {
                "word": "musical box",
                "pos": "noun"
            },
            {
                "word": "musical bumps",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a play or film in which part or all of the story is told using songs and often dancing",
                    "vi": "một vở kịch hoặc một bộ phim trong đó một phần hoặc toàn bộ câu chuyện được kể bằng các bài hát và thường nhảy múa"
                },
                "examples": [
                    {
                        "en": "a Broadway/Hollywood musical",
                        "vi": "một vở nhạc kịch Broadway / Hollywood"
                    },
                    {
                        "en": "the star of the hit West End musical",
                        "vi": "ngôi sao của vở nhạc kịch nổi tiếng West End"
                    },
                    {
                        "en": "a musical based on the biblical story of Job",
                        "vi": "một vở nhạc kịch dựa trên câu chuyện kinh thánh về Job"
                    },
                    {
                        "en": "a cycle of classic Rodgers and Hammerstein musicals",
                        "vi": "một vòng nhạc kịch cổ điển của Rodgers và Hammerstein"
                    }
                ]
            }
        ]
    },
    {
        "id": "872d601ca5e446da90196128928f0026",
        "word": "performance",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/pəˈfɔːməns/",
            "us": "/pərˈfɔːrməns/"
        },
        "nearby": [
            {
                "word": "perforce",
                "pos": "adverb"
            },
            {
                "word": "perform",
                "pos": "verb"
            },
            {
                "word": "performance",
                "pos": "noun"
            },
            {
                "word": "performance art",
                "pos": "noun"
            },
            {
                "word": "performance-enhancing",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act of performing a play, concert or some other form of entertainment",
                    "vi": "hành động biểu diễn một vở kịch, buổi hòa nhạc hoặc một số hình thức giải trí khác"
                },
                "examples": [
                    {
                        "en": "The performance starts at seven.",
                        "vi": "Buổi biểu diễn bắt đầu lúc bảy giờ."
                    },
                    {
                        "en": "an evening performance",
                        "vi": "một buổi biểu diễn buổi tối"
                    },
                    {
                        "en": "They put on performances for the tourists.",
                        "vi": "Họ biểu diễn cho khách du lịch."
                    },
                    {
                        "en": "This was one of the band's rare live performances.",
                        "vi": "Đây là một trong những buổi biểu diễn trực tiếp hiếm hoi của ban nhạc."
                    },
                    {
                        "en": "performance of something They gave a performance of Ravel’s String Quartet",
                        "vi": "biểu diễn của một cái gì đó Họ đã trình diễn Bộ tứ chuỗi của Ravel"
                    },
                    {
                        "en": "performance by somebody/something a series of performances by the Kirov Ballet",
                        "vi": "màn trình diễn của ai đó / cái gì đó một loạt các buổi biểu diễn của Kirov Ballet"
                    }
                ]
            },
            {
                "define": {
                    "en": "the way a person performs in a play, concert, etc.",
                    "vi": "cách một người biểu diễn trong một vở kịch, buổi hòa nhạc, v.v."
                },
                "examples": [
                    {
                        "en": "She gave the greatest performance of her career.",
                        "vi": "Cô ấy đã cống hiến một màn trình diễn tuyệt vời nhất trong sự nghiệp của mình."
                    },
                    {
                        "en": "Both actors deliver outstanding performances.",
                        "vi": "Cả hai diễn viên đều mang đến những màn trình diễn xuất sắc."
                    },
                    {
                        "en": "an excellent/a fine/an impressive performance",
                        "vi": "một xuất sắc / một tốt / một màn trình diễn ấn tượng"
                    }
                ]
            },
            {
                "define": {
                    "en": "how well or badly you do something; how well or badly something works",
                    "vi": "bạn làm việc gì đó tốt hay xấu; cái gì đó hoạt động tốt hay xấu như thế nào"
                },
                "examples": [
                    {
                        "en": "the country's strong economic performance over the last two years",
                        "vi": "hoạt động kinh tế mạnh mẽ của đất nước trong hai năm qua"
                    },
                    {
                        "en": "It was an impressive performance by the French team.",
                        "vi": "Đó là một màn trình diễn ấn tượng của đội tuyển Pháp."
                    },
                    {
                        "en": "He criticized the recent poor performance of the company.",
                        "vi": "Ông chỉ trích hoạt động kém hiệu quả gần đây của công ty."
                    },
                    {
                        "en": "Her academic performance has been inconsistent.",
                        "vi": "Kết quả học tập của cô ấy không ổn định."
                    },
                    {
                        "en": "Profits continue to grow, with strong performances in South America and the Far East.",
                        "vi": "Lợi nhuận tiếp tục tăng với hiệu suất mạnh mẽ ở Nam Mỹ và Viễn Đông."
                    },
                    {
                        "en": "The team has continued to improve performance.",
                        "vi": "Đội đã tiếp tục cải thiện hiệu suất."
                    },
                    {
                        "en": "This machine delivers excellent performance at a very competitive price.",
                        "vi": "Máy này mang lại hiệu suất tuyệt vời với mức giá rất cạnh tranh."
                    },
                    {
                        "en": "to measure/evaluate the performance of somebody/something",
                        "vi": "để đo lường / đánh giá hiệu suất của ai đó / cái gì đó"
                    },
                    {
                        "en": "high-performance (= very powerful) cars",
                        "vi": "xe hiệu suất cao (= rất mạnh)"
                    },
                    {
                        "en": "performance indicators (= things that show how well or badly something is working)",
                        "vi": "chỉ số hiệu suất (= những thứ cho biết một thứ gì đó đang hoạt động tốt hay không tốt như thế nào)"
                    }
                ]
            },
            {
                "define": {
                    "en": "the act or process of performing a task, an action, etc.",
                    "vi": "hành động hoặc quá trình thực hiện một nhiệm vụ, một hành động, v.v."
                },
                "examples": [
                    {
                        "en": "She has shown enthusiasm in the performance of her duties.",
                        "vi": "Cô ấy đã thể hiện sự nhiệt tình trong việc thực hiện nhiệm vụ của mình."
                    },
                    {
                        "en": "He did not want a repeat performance of the humiliating defeat he had suffered.",
                        "vi": "Anh không muốn một màn trình diễn lặp lại thất bại nhục nhã mà anh đã phải gánh chịu."
                    },
                    {
                        "en": "The party are dreading a repeat performance of their defeat in the last election.",
                        "vi": "Đảng đang sợ một màn trình diễn lặp lại thất bại của họ trong cuộc bầu cử vừa qua."
                    }
                ]
            },
            {
                "define": {
                    "en": "an act that involves a lot of effort or trouble, sometimes when it is not necessary",
                    "vi": "một hành động đòi hỏi nhiều nỗ lực hoặc rắc rối, đôi khi không cần thiết"
                },
                "examples": [
                    {
                        "en": "It's such a performance getting the children off to school in the morning.",
                        "vi": "Đó là một màn trình diễn đưa bọn trẻ đến trường vào buổi sáng."
                    },
                    {
                        "en": "He always goes through the whole performance of checking the oil and water even if we’re in a hurry.",
                        "vi": "Anh ấy luôn thực hiện toàn bộ quá trình kiểm tra dầu và nước ngay cả khi chúng tôi đang vội."
                    }
                ]
            }
        ]
    },
    {
        "id": "5a8f9dfaf1b8494c84e2e85f2369724f",
        "word": "tour",
        "pos": "verb",
        "level": "b1",
        "phonetic": {
            "uk": "/tʊə(r)/",
            "us": "/tʊr/"
        },
        "nearby": [
            {
                "word": "toupee",
                "pos": "noun"
            },
            {
                "word": "tour",
                "pos": "noun"
            },
            {
                "word": "tour",
                "pos": "verb"
            },
            {
                "word": "tour de force",
                "pos": "noun"
            },
            {
                "word": "Tourette's syndrome",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to travel around a place, for example on holiday, or to perform, to advertise something, etc.",
                    "vi": "đi du lịch xung quanh một nơi, chẳng hạn như vào kỳ nghỉ, hoặc biểu diễn, để quảng cáo một cái gì đó, v.v."
                },
                "examples": [
                    {
                        "en": "tour something He toured America with his one-man show.",
                        "vi": "tour diễn gì đó Anh ấy đã đi lưu diễn nước Mỹ với chương trình một người của mình."
                    },
                    {
                        "en": "She toured the country promoting her book.",
                        "vi": "Cô ấy đã đi lưu diễn khắp đất nước để quảng bá cho cuốn sách của mình."
                    },
                    {
                        "en": "(+ adv./prep.) We spent four weeks touring around Europe.",
                        "vi": "(+ adv./prep.) Chúng tôi đã dành bốn tuần để lưu diễn vòng quanh châu Âu."
                    },
                    {
                        "en": "He's toured across Europe, the UK and North America.",
                        "vi": "Anh ấy đã đi lưu diễn khắp Châu Âu, Vương quốc Anh và Bắc Mỹ."
                    },
                    {
                        "en": "She is currently touring with her new band.",
                        "vi": "Cô ấy hiện đang lưu diễn với ban nhạc mới của mình."
                    },
                    {
                        "en": "He no longer tours.",
                        "vi": "Anh ấy không còn đi lưu diễn nữa."
                    }
                ]
            }
        ]
    },
    {
        "id": "f73bb01128284945a8420bba049c0a2a",
        "word": "gig",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ɡɪɡ/",
            "us": "/ɡɪɡ/"
        },
        "nearby": [
            {
                "word": "gift wrap",
                "pos": "noun"
            },
            {
                "word": "gift-wrap",
                "pos": "verb"
            },
            {
                "word": "gig",
                "pos": "noun"
            },
            {
                "word": "gig",
                "pos": "verb"
            },
            {
                "word": "giga-",
                "pos": "combining form"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a performance by musicians playing popular music or jazz in front of an audience; a similar performance by a comedian",
                    "vi": "một buổi biểu diễn của các nhạc sĩ chơi nhạc nổi tiếng hoặc nhạc jazz trước khán giả; một màn trình diễn tương tự của một diễn viên hài"
                },
                "examples": [
                    {
                        "en": "They're doing a gig in Boston tonight.",
                        "vi": "Họ sẽ biểu diễn ở Boston tối nay."
                    },
                    {
                        "en": "an Arctic Monkeys gig",
                        "vi": "một buổi biểu diễn của những chú khỉ Bắc Cực"
                    }
                ]
            },
            {
                "define": {
                    "en": "a job, especially a temporary one",
                    "vi": "một công việc, đặc biệt là một công việc tạm thời"
                },
                "examples": [
                    {
                        "en": "She landed her first gig on a kids' TV show.",
                        "vi": "Cô ấy đã có buổi biểu diễn đầu tiên trên một chương trình truyền hình dành cho trẻ em."
                    },
                    {
                        "en": "gig as something a gig as a basketball coach",
                        "vi": "hợp đồng biểu diễn như một cái gì đó một hợp đồng biểu diễn với tư cách là huấn luyện viên bóng rổ"
                    }
                ]
            },
            {
                "define": {
                    "en": "a unit of computer memory or data, equal to 109, or 1 0003, (= 1000000000) bytes",
                    "vi": "một đơn vị bộ nhớ máy tính hoặc dữ liệu, bằng 109, hoặc 1 0003, (= 1000000000) byte"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a unit of computer memory or data, equal to 230, or 1 0243, (= 1073741824) bytes",
                    "vi": "một đơn vị dữ liệu hoặc bộ nhớ máy tính, bằng 230 hoặc 1 0243, (= 1073741824) byte"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a small light carriage with two wheels, pulled by one horse",
                    "vi": "một cỗ xe nhẹ nhỏ có hai bánh do một con ngựa kéo"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "aad41ba6edbd4a02971d953ef1abeb28",
        "word": "microphone",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈmaɪkrəfəʊn/",
            "us": "/ˈmaɪkrəfəʊn/"
        },
        "nearby": [
            {
                "word": "micro party",
                "pos": "noun"
            },
            {
                "word": "micropayment",
                "pos": "noun"
            },
            {
                "word": "microphone",
                "pos": "noun"
            },
            {
                "word": "microplastic",
                "pos": "noun"
            },
            {
                "word": "microprocessor",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a device that is used for recording sounds or for making your voice louder when you are speaking or singing to an audience",
                    "vi": "một thiết bị được sử dụng để ghi lại âm thanh hoặc để làm cho giọng của bạn to hơn khi bạn đang nói hoặc hát cho khán giả nghe"
                },
                "examples": [
                    {
                        "en": "to speak into the microphone",
                        "vi": "nói vào micrô"
                    },
                    {
                        "en": "Their remarks were picked up by the hidden microphones.",
                        "vi": "Nhận xét của họ đã được thu thập bằng các micrô ẩn."
                    }
                ]
            }
        ]
    },
    {
        "id": "2acc93b2b6f54adfb33d164018f0ae8e",
        "word": "opera house",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈɒprə haʊs/",
            "us": "/ˈɑːprə haʊs/"
        },
        "nearby": [
            {
                "word": "operable",
                "pos": "adjective"
            },
            {
                "word": "opera glasses",
                "pos": "noun"
            },
            {
                "word": "opera house",
                "pos": "noun"
            },
            {
                "word": "operand",
                "pos": "noun"
            },
            {
                "word": "operate",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a theatre where operas are performed",
                    "vi": "một nhà hát nơi các vở opera được biểu diễn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "82190dd7454d44bd8c2c843771777fc1",
        "word": "sound system",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈsaʊnd sɪstəm/",
            "us": "/ˈsaʊnd sɪstəm/"
        },
        "nearby": [
            {
                "word": "sound shift",
                "pos": "noun"
            },
            {
                "word": "sound stage",
                "pos": "noun"
            },
            {
                "word": "sound system",
                "pos": "noun"
            },
            {
                "word": "soundtrack",
                "pos": "noun"
            },
            {
                "word": "sound wave",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "equipment for playing recorded or live music and for making it louder",
                    "vi": "thiết bị để phát nhạc đã ghi hoặc trực tiếp và để làm cho nó to hơn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "8d6ee271b63b4af393a15f6bb4ccaba0",
        "word": "amplifier",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈæmplɪfaɪə(r)/",
            "us": "/ˈæmplɪfaɪər/"
        },
        "nearby": [
            {
                "word": "Ampleforth College",
                "pos": ""
            },
            {
                "word": "amplification",
                "pos": "noun"
            },
            {
                "word": "amplifier",
                "pos": "noun"
            },
            {
                "word": "amplify",
                "pos": "verb"
            },
            {
                "word": "amplitude",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an electrical device or piece of equipment that makes sounds or radio signals louder",
                    "vi": "thiết bị điện hoặc thiết bị phát ra âm thanh hoặc tín hiệu radio to hơn"
                },
                "examples": [
                    {
                        "en": "a 25 watt amplifier",
                        "vi": "một bộ khuếch đại 25 watt"
                    }
                ]
            }
        ]
    },
    {
        "id": "7636a2c422aa44538eb2777dddec8fff",
        "word": "amplify",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈæmplɪfaɪ/",
            "us": "/ˈæmplɪfaɪ/"
        },
        "nearby": [
            {
                "word": "amplification",
                "pos": "noun"
            },
            {
                "word": "amplifier",
                "pos": "noun"
            },
            {
                "word": "amplify",
                "pos": "verb"
            },
            {
                "word": "amplitude",
                "pos": "noun"
            },
            {
                "word": "amply",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to increase something in strength, especially sound",
                    "vi": "để tăng sức mạnh, đặc biệt là âm thanh"
                },
                "examples": [
                    {
                        "en": "to amplify a guitar/an electric current/a signal",
                        "vi": "để khuếch đại guitar / dòng điện / tín hiệu"
                    }
                ]
            },
            {
                "define": {
                    "en": "to add details to a story, statement, etc.",
                    "vi": "để thêm chi tiết vào một câu chuyện, tuyên bố, v.v."
                },
                "examples": [
                    {
                        "en": "She refused to amplify further.",
                        "vi": "Cô ấy từ chối khuếch đại thêm."
                    },
                    {
                        "en": "amplify something You may need to amplify this point.",
                        "vi": "khuếch đại điều gì đó Bạn có thể cần khuếch đại điểm này."
                    }
                ]
            }
        ]
    },
    {
        "id": "f70fb3fda344431b9c727259ebf45cab",
        "word": "carol singing",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈkærəl sɪŋɪŋ/",
            "us": "/ˈkærəl sɪŋɪŋ/"
        },
        "nearby": [
            {
                "word": "Caroline",
                "pos": ""
            },
            {
                "word": "carol singer",
                "pos": "noun"
            },
            {
                "word": "carol singing",
                "pos": "noun"
            },
            {
                "word": "Carolyn",
                "pos": ""
            },
            {
                "word": "carom",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the singing of Christmas carols especially in a church or outdoors, often to collect money for charity",
                    "vi": "hát các bài hát mừng Giáng sinh, đặc biệt là trong nhà thờ hoặc ngoài trời, thường để thu tiền từ thiện"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "41c30c061437432592967d3dc5996dce",
        "word": "improvise",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈɪmprəvaɪz/",
            "us": "/ˈɪmprəvaɪz/"
        },
        "nearby": [
            {
                "word": "improvident",
                "pos": "adjective"
            },
            {
                "word": "improvisation",
                "pos": "noun"
            },
            {
                "word": "improvise",
                "pos": "verb"
            },
            {
                "word": "imprudence",
                "pos": "noun"
            },
            {
                "word": "imprudent",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to make or do something using whatever is available, usually because you do not have what you really need",
                    "vi": "để làm hoặc làm điều gì đó bằng cách sử dụng bất cứ thứ gì có sẵn, thường là vì bạn không có thứ bạn thực sự cần"
                },
                "examples": [
                    {
                        "en": "There isn't much equipment. We're going to have to improvise.",
                        "vi": "Không có nhiều thiết bị. Chúng ta sẽ phải ứng biến."
                    },
                    {
                        "en": "improvise something We improvised some shelves out of planks of wood and bricks.",
                        "vi": "ứng biến một cái gì đó Chúng tôi đã ứng biến một số kệ từ ván gỗ và gạch."
                    },
                    {
                        "en": "We hastily improvised a screen out of an old blanket.",
                        "vi": "Chúng tôi vội vàng ứng biến một màn ra khỏi chiếc chăn cũ."
                    },
                    {
                        "en": "You can quickly improvise a shield to protect your arm.",
                        "vi": "Bạn có thể nhanh chóng ứng biến một tấm chắn để bảo vệ cánh tay của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to invent music, the words in a play, a statement, etc. while you are playing or speaking, instead of planning it in advance",
                    "vi": "để phát minh ra âm nhạc, các từ trong một vở kịch, một tuyên bố, v.v. trong khi bạn đang chơi hoặc nói, thay vì lên kế hoạch trước"
                },
                "examples": [
                    {
                        "en": "‘It'll be ready some time next week, I expect,’ she said, improvising.",
                        "vi": "Tôi mong đợi nó sẽ sẵn sàng vào tuần tới, cô nói, ứng biến."
                    },
                    {
                        "en": "improvise on something He improvised on the melody.",
                        "vi": "ngẫu hứng trên một cái gì đó Anh ấy ngẫu hứng trên giai điệu."
                    },
                    {
                        "en": "improvise something an improvised speech",
                        "vi": "ứng biến một cái gì đó một bài phát biểu ngẫu hứng"
                    }
                ]
            }
        ]
    },
    {
        "id": "d7fd2b08421b4eb9b26dd7f9037962ea",
        "word": "line-up",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈlaɪn ʌp/",
            "us": "/ˈlaɪn ʌp/"
        },
        "nearby": [
            {
                "word": "linesman",
                "pos": "noun"
            },
            {
                "word": "line up",
                "pos": "phrasal verb"
            },
            {
                "word": "line-up",
                "pos": "noun"
            },
            {
                "word": "ling",
                "pos": "noun"
            },
            {
                "word": "-ling",
                "pos": "suffix"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the people who are going to take part in a particular event",
                    "vi": "những người sẽ tham gia vào một sự kiện cụ thể"
                },
                "examples": [
                    {
                        "en": "an impressive line-up of speakers",
                        "vi": "một dòng loa ấn tượng"
                    },
                    {
                        "en": "Jones has not been included in the quarter-final line-up.",
                        "vi": "Jones đã không được đưa vào đội hình tiêu biểu trận tứ kết."
                    },
                    {
                        "en": "the starting line-up (= the players who will begin the game)",
                        "vi": "đội hình xuất phát (= những người chơi sẽ bắt đầu trò chơi)"
                    },
                    {
                        "en": "The team returns this season with a new car and a new line-up of drivers.",
                        "vi": "Đội trở lại mùa giải này với một chiếc xe mới và một đội ngũ tài xế mới."
                    }
                ]
            },
            {
                "define": {
                    "en": "a set of items, events etc. arranged to follow one another",
                    "vi": "một tập hợp các mục, sự kiện, v.v. được sắp xếp nối tiếp nhau"
                },
                "examples": [
                    {
                        "en": "A horror movie completes this evening's TV line-up.",
                        "vi": "Một bộ phim kinh dị hoàn thành danh sách truyền hình tối nay."
                    }
                ]
            },
            {
                "define": {
                    "en": "a row of people, including one person who is suspected of a crime, who are shown to a witness to see if they can recognize the suspect",
                    "vi": "một hàng người, trong đó có một người bị tình nghi phạm tội, được đưa cho một nhân chứng xem liệu họ có thể nhận ra nghi phạm hay không"
                },
                "examples": [
                    {
                        "en": "He was identified in an April 21 police line-up.",
                        "vi": "Anh ta được xác định trong danh sách cảnh sát ngày 21 tháng 4."
                    }
                ]
            }
        ]
    },
    {
        "id": "5672c27a982a4a7d8058620a31ba454f",
        "word": "mic",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/maɪk/",
            "us": "/maɪk/"
        },
        "nearby": [
            {
                "word": "MiB",
                "pos": "abbreviation"
            },
            {
                "word": "Mib",
                "pos": "abbreviation"
            },
            {
                "word": "mic",
                "pos": "noun"
            },
            {
                "word": "mica",
                "pos": "noun"
            },
            {
                "word": "Mr Micawber",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a microphone (= a device that is used for recording sounds or for making your voice louder when you are speaking or singing to an audience)",
                    "vi": "micrô (= một thiết bị được sử dụng để ghi lại âm thanh hoặc để làm cho giọng của bạn to hơn khi bạn đang nói hoặc hát với khán giả)"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "8015e236f2c34c95b3eb3231ff61bafc",
        "word": "mike",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/maɪk/",
            "us": "/maɪk/"
        },
        "nearby": [
            {
                "word": "mikado",
                "pos": "noun"
            },
            {
                "word": "The Mikado",
                "pos": ""
            },
            {
                "word": "mike",
                "pos": "noun"
            },
            {
                "word": "mike",
                "pos": "verb"
            },
            {
                "word": "Mike",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a microphone (= a device that is used for recording sounds or for making your voice louder when you are speaking or singing to an audience)",
                    "vi": "micrô (= một thiết bị được sử dụng để ghi lại âm thanh hoặc để làm cho giọng của bạn to hơn khi bạn đang nói hoặc hát với khán giả)"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "ed1cb345adbe4c9ab43f3daffa4cd6a4",
        "word": "recital",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/rɪˈsaɪtl/",
            "us": "/rɪˈsaɪtl/"
        },
        "nearby": [
            {
                "word": "reciprocation",
                "pos": "noun"
            },
            {
                "word": "reciprocity",
                "pos": "noun"
            },
            {
                "word": "recital",
                "pos": "noun"
            },
            {
                "word": "recitation",
                "pos": "noun"
            },
            {
                "word": "recitative",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a public performance of music or poetry, usually given by one person or a small group",
                    "vi": "một buổi biểu diễn âm nhạc hoặc thơ ca trước công chúng, thường do một người hoặc một nhóm nhỏ biểu diễn"
                },
                "examples": [
                    {
                        "en": "to give a piano recital",
                        "vi": "để biểu diễn piano"
                    },
                    {
                        "en": "a recital by the Grieg Trio",
                        "vi": "một buổi biểu diễn của Bộ ba Grieg"
                    },
                    {
                        "en": "They put on a song recital in honour of Mozart’s 250th birthday.",
                        "vi": "Họ đã tổ chức một buổi biểu diễn ca khúc để vinh danh sinh nhật lần thứ 250 của Mozart."
                    }
                ]
            },
            {
                "define": {
                    "en": "a spoken description of a series of events, etc. that is often long and boring",
                    "vi": "một mô tả bằng giọng nói về một loạt các sự kiện, v.v. thường dài và nhàm chán"
                },
                "examples": [
                    {
                        "en": "They both launched into a recital of their misfortunes.",
                        "vi": "Cả hai đều bắt đầu kể lại những bất hạnh của mình."
                    }
                ]
            }
        ]
    },
    {
        "id": "939ddb62ecf247b6ae6ec61de8729a0a",
        "word": "set",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/set/",
            "us": "/set/"
        },
        "nearby": [
            {
                "word": "session musician",
                "pos": "noun"
            },
            {
                "word": "set",
                "pos": "verb"
            },
            {
                "word": "set",
                "pos": "noun"
            },
            {
                "word": "set",
                "pos": "adjective"
            },
            {
                "word": "set about",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a group of similar things that belong together in some way",
                    "vi": "một nhóm những thứ giống nhau thuộc về nhau theo một cách nào đó"
                },
                "examples": [
                    {
                        "en": "a set of six chairs",
                        "vi": "một bộ sáu chiếc ghế"
                    },
                    {
                        "en": "a complete set of her novels",
                        "vi": "một bộ tiểu thuyết hoàn chỉnh của cô ấy"
                    },
                    {
                        "en": "a set of false teeth",
                        "vi": "một bộ răng giả"
                    },
                    {
                        "en": "These companies operate under a strict set of rules.",
                        "vi": "Các công ty này hoạt động theo một bộ quy tắc nghiêm ngặt."
                    },
                    {
                        "en": "This is an unusual set of circumstances.",
                        "vi": "Đây là một tập hợp các tình huống bất thường."
                    },
                    {
                        "en": "I have a different set of values to them.",
                        "vi": "Tôi có một bộ giá trị khác với chúng."
                    },
                    {
                        "en": "Now they faced a whole new set of problems.",
                        "vi": "Bây giờ họ phải đối mặt với một loạt vấn đề hoàn toàn mới."
                    },
                    {
                        "en": "You can borrow my keys—I have a spare set.",
                        "vi": "Bạn có thể mượn chìa khóa của tôi — tôi có một bộ dự phòng."
                    },
                    {
                        "en": "She won a silver medal in the long jump to complete her set.",
                        "vi": "Cô đã giành huy chương bạc môn nhảy xa để hoàn thành set của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "a group of objects used together, for example for playing a game",
                    "vi": "một nhóm các đối tượng được sử dụng cùng nhau, chẳng hạn như để chơi một trò chơi"
                },
                "examples": [
                    {
                        "en": "a chess set",
                        "vi": "một bộ cờ vua"
                    },
                    {
                        "en": "a model train set",
                        "vi": "một bộ mô hình xe lửa"
                    }
                ]
            },
            {
                "define": {
                    "en": "a group of people who have similar interests and spend a lot of time together socially",
                    "vi": "một nhóm những người có cùng sở thích và dành nhiều thời gian cho nhau trên phương diện xã hội"
                },
                "examples": [
                    {
                        "en": "the smart set (= rich, fashionable people)",
                        "vi": "bộ thông minh (= những người giàu có, thời trang)"
                    },
                    {
                        "en": "Dublin’s literary set",
                        "vi": "Bộ văn học của Dublin"
                    },
                    {
                        "en": "It's known as a playground for Scotland's rich hunting and fishing set.",
                        "vi": "Nó được biết đến như một sân chơi cho bộ môn săn bắn và câu cá phong phú của Scotland."
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of equipment for receiving television or radio signals",
                    "vi": "một phần của thiết bị để nhận tín hiệu truyền hình hoặc radio"
                },
                "examples": [
                    {
                        "en": "a television/TV set",
                        "vi": "một máy thu hình / TV"
                    }
                ]
            },
            {
                "define": {
                    "en": "the scenery used for a play, film, etc.",
                    "vi": "phong cảnh được sử dụng cho một vở kịch, bộ phim, v.v."
                },
                "examples": [
                    {
                        "en": "We need volunteers to help build and paint the set.",
                        "vi": "Chúng tôi cần các tình nguyện viên giúp xây dựng và sơn bộ này."
                    },
                    {
                        "en": "The locations and set designs were fabulous.",
                        "vi": "Các vị trí và thiết kế thiết lập là tuyệt vời."
                    }
                ]
            },
            {
                "define": {
                    "en": "a place where a play is performed or part of a film is filmed",
                    "vi": "nơi biểu diễn một vở kịch hoặc một phần của bộ phim được quay"
                },
                "examples": [
                    {
                        "en": "The cast must all be on (the) set by 7 in the morning.",
                        "vi": "Tất cả các diễn viên phải có mặt trên (bộ) trước 7 giờ sáng."
                    }
                ]
            },
            {
                "define": {
                    "en": "one section of a match in games such as tennis or volleyball",
                    "vi": "một phần của trận đấu trong các trò chơi như quần vợt hoặc bóng chuyền"
                },
                "examples": [
                    {
                        "en": "She won in straight sets (= without losing a set).",
                        "vi": "Cô ấy thắng trong các set liên tiếp (= mà không thua set nào)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a group of things regarded as a unit because they all have particular qualities in common",
                    "vi": "một nhóm những thứ được coi là một đơn vị vì chúng đều có những điểm chung đặc biệt"
                },
                "examples": [
                    {
                        "en": "the set of all square numbers less than 50",
                        "vi": "tập hợp tất cả các số bình phương nhỏ hơn 50"
                    }
                ]
            },
            {
                "define": {
                    "en": "a series of songs or pieces of music that a musician or group performs at a concert",
                    "vi": "một loạt các bài hát hoặc đoạn nhạc mà một nhạc sĩ hoặc nhóm biểu diễn tại một buổi hòa nhạc"
                },
                "examples": [
                    {
                        "en": "a stunning solo set of ten songs",
                        "vi": "một bộ mười bài hát solo tuyệt đẹp"
                    }
                ]
            },
            {
                "define": {
                    "en": "a group of school students with a similar ability in a particular subject",
                    "vi": "một nhóm học sinh có khả năng tương tự trong một môn học cụ thể"
                },
                "examples": [
                    {
                        "en": "She's in the top set for French.",
                        "vi": "Cô ấy thuộc nhóm hàng đầu về tiếng Pháp."
                    }
                ]
            },
            {
                "define": {
                    "en": "the way in which somebody’s face or body is fixed in a particular expression, especially one showing a feeling of being determined",
                    "vi": "cách mà khuôn mặt hoặc cơ thể của ai đó được cố định trong một biểu hiện cụ thể, đặc biệt là một người thể hiện cảm giác được xác định"
                },
                "examples": [
                    {
                        "en": "She admired the firm set of his jaw.",
                        "vi": "Cô ngưỡng mộ bộ hàm rắn chắc của anh ta."
                    }
                ]
            },
            {
                "define": {
                    "en": "an act of arranging hair in a particular style while it is wet",
                    "vi": "một hành động sắp xếp tóc theo một kiểu cụ thể khi tóc ướt"
                },
                "examples": [
                    {
                        "en": "A shampoo and set costs £15.",
                        "vi": "Một bộ dầu gội đầu có giá 15 bảng Anh."
                    }
                ]
            },
            {
                "define": {
                    "en": "the state of becoming solid or hard",
                    "vi": "trạng thái trở nên rắn hoặc cứng"
                },
                "examples": [
                    {
                        "en": "To be sure of a good set when making the jam, use preserving sugar with added pectin.",
                        "vi": "Để đảm bảo mứt ngon khi làm mứt, hãy sử dụng đường bảo quản có thêm pectin."
                    }
                ]
            },
            {
                "define": {
                    "en": "a hole in the ground where a badger lives",
                    "vi": "một cái lỗ trên mặt đất nơi một con lửng sống"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a young plant, shoot etc. for planting",
                    "vi": "một cây non, chồi vv để trồng"
                },
                "examples": [
                    {
                        "en": "onion sets",
                        "vi": "bộ hành"
                    }
                ]
            }
        ]
    },
    {
        "id": "2259c848d64d4ed8973dc67dc1093cf9",
        "word": "support",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/səˈpɔːt/",
            "us": "/səˈpɔːrt/"
        },
        "nearby": [
            {
                "word": "supply-side",
                "pos": "adjective"
            },
            {
                "word": "supply teacher",
                "pos": "noun"
            },
            {
                "word": "support",
                "pos": "verb"
            },
            {
                "word": "support",
                "pos": "noun"
            },
            {
                "word": "support bubble",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to help or encourage somebody/something by saying or showing that you agree with them/it",
                    "vi": "để giúp đỡ hoặc khuyến khích ai đó / điều gì đó bằng cách nói hoặc thể hiện rằng bạn đồng ý với họ / điều đó"
                },
                "examples": [
                    {
                        "en": "support somebody/something to support an idea/a view",
                        "vi": "hỗ trợ ai đó / cái gì đó để hỗ trợ một ý tưởng / một quan điểm"
                    },
                    {
                        "en": "The party fully supports new welfare reform bill.",
                        "vi": "Đảng hoàn toàn ủng hộ dự luật cải cách phúc lợi mới."
                    },
                    {
                        "en": "Efforts to reduce waste are strongly supported by environmental groups.",
                        "vi": "Các nỗ lực giảm thiểu chất thải được các nhóm môi trường ủng hộ mạnh mẽ."
                    },
                    {
                        "en": "The majority of ordinary citizens did not support the war.",
                        "vi": "Đa số công dân bình thường không ủng hộ chiến tranh."
                    },
                    {
                        "en": "If you raise it at the meeting, I'll support you.",
                        "vi": "Nếu bạn nêu ra nó trong cuộc họp, tôi sẽ ủng hộ bạn."
                    },
                    {
                        "en": "support somebody/something in something The government supported the unions in their demand for a minimum wage.",
                        "vi": "hỗ trợ ai đó / điều gì đó Chính phủ đã hỗ trợ các công đoàn trong yêu cầu của họ về mức lương tối thiểu."
                    }
                ]
            },
            {
                "define": {
                    "en": "to give or be ready to give help to somebody if they need it",
                    "vi": "để cung cấp hoặc sẵn sàng giúp đỡ ai đó nếu họ cần"
                },
                "examples": [
                    {
                        "en": "an organization that supports people with AIDS",
                        "vi": "một tổ chức hỗ trợ những người mắc bệnh AIDS"
                    },
                    {
                        "en": "She supported her husband through many difficult times.",
                        "vi": "Cô đã hỗ trợ chồng vượt qua nhiều giai đoạn khó khăn."
                    },
                    {
                        "en": "The company will support customers in Europe (= solve their problems with a product).",
                        "vi": "Công ty sẽ hỗ trợ khách hàng ở Châu Âu (= giải quyết vấn đề của họ với một sản phẩm)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to like a particular sports team, watch their games, etc.",
                    "vi": "thích một đội thể thao cụ thể, xem các trận đấu của họ, v.v."
                },
                "examples": [
                    {
                        "en": "Which team do you support?",
                        "vi": "Bạn ủng hộ đội nào?"
                    },
                    {
                        "en": "Who do you support?",
                        "vi": "Bạn ủng hộ ai?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to help or encourage something to be successful by giving it money",
                    "vi": "để giúp đỡ hoặc khuyến khích điều gì đó thành công bằng cách cho tiền"
                },
                "examples": [
                    {
                        "en": "The project was supported by grants from various charities.",
                        "vi": "Dự án được hỗ trợ bởi các khoản tài trợ từ các tổ chức từ thiện khác nhau."
                    },
                    {
                        "en": "A number of famous actors actively supported the campaign.",
                        "vi": "Một số diễn viên nổi tiếng đã tích cực ủng hộ chiến dịch."
                    },
                    {
                        "en": "Several major companies are supporting the project.",
                        "vi": "Một số công ty lớn đang hỗ trợ dự án."
                    }
                ]
            },
            {
                "define": {
                    "en": "to provide everything necessary, especially money, so that somebody/something can live or exist",
                    "vi": "cung cấp mọi thứ cần thiết, đặc biệt là tiền, để ai đó / thứ gì đó có thể sống hoặc tồn tại"
                },
                "examples": [
                    {
                        "en": "He struggles to support his family.",
                        "vi": "Anh ấy phải vật lộn để hỗ trợ gia đình của mình."
                    },
                    {
                        "en": "She supported herself through college by working as a waitress in a local bar.",
                        "vi": "Cô đã tự nuôi sống bản thân bằng cách làm nhân viên phục vụ trong một quán bar địa phương."
                    },
                    {
                        "en": "He turned to crime to support his drug habit.",
                        "vi": "Anh ta chuyển sang phạm tội để hỗ trợ thói quen ma túy của mình."
                    },
                    {
                        "en": "The atmosphere of Mars could not support life.",
                        "vi": "Bầu khí quyển của sao Hỏa không thể hỗ trợ sự sống."
                    }
                ]
            },
            {
                "define": {
                    "en": "to help to show that something is true",
                    "vi": "để giúp chứng minh rằng điều gì đó là đúng"
                },
                "examples": [
                    {
                        "en": "Current data support this hypothesis.",
                        "vi": "Dữ liệu hiện tại ủng hộ giả thuyết này."
                    },
                    {
                        "en": "There is no evidence to support his claims.",
                        "vi": "Không có bằng chứng để hỗ trợ tuyên bố của anh ta."
                    },
                    {
                        "en": "The witness's story was not supported by the evidence.",
                        "vi": "Câu chuyện của nhân chứng không được chứng minh bằng bằng chứng."
                    },
                    {
                        "en": "He said the figures were questionable and not well supported.",
                        "vi": "Ông cho biết các số liệu này là đáng nghi vấn và không được hỗ trợ tốt."
                    }
                ]
            },
            {
                "define": {
                    "en": "to hold somebody/something in position; to prevent somebody/something from falling",
                    "vi": "giữ ai đó / cái gì đó vào vị trí; để ngăn ai đó / thứ gì đó khỏi rơi"
                },
                "examples": [
                    {
                        "en": "a platform supported by concrete pillars",
                        "vi": "một nền tảng được hỗ trợ bởi các cột bê tông"
                    },
                    {
                        "en": "Support the baby's head when you hold it.",
                        "vi": "Nâng đỡ đầu em bé khi bạn bế."
                    },
                    {
                        "en": "She walked carefully down the stairs, supported by her grandson.",
                        "vi": "Bà cẩn thận bước xuống cầu thang, được cháu trai đỡ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to perform in a pop or rock concert before the main performer",
                    "vi": "biểu diễn trong một buổi hòa nhạc pop hoặc rock trước nghệ sĩ biểu diễn chính"
                },
                "examples": [
                    {
                        "en": "They were supported by a local Liverpool band.",
                        "vi": "Họ đã được hỗ trợ bởi một ban nhạc địa phương của Liverpool."
                    }
                ]
            },
            {
                "define": {
                    "en": "to allow a particular program, language or device to be used with it",
                    "vi": "để cho phép một chương trình, ngôn ngữ hoặc thiết bị cụ thể được sử dụng với nó"
                },
                "examples": [
                    {
                        "en": "This digital audio player supports multiple formats.",
                        "vi": "Trình phát âm thanh kỹ thuật số này hỗ trợ nhiều định dạng."
                    }
                ]
            }
        ]
    },
    {
        "id": "41f86cbac7264bae8d1aeb758ff57f06",
        "word": "baton",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbætɒn/",
            "us": "/bəˈtɑːn/"
        },
        "nearby": [
            {
                "word": "Batman",
                "pos": ""
            },
            {
                "word": "bat mitzvah",
                "pos": "noun"
            },
            {
                "word": "baton",
                "pos": "noun"
            },
            {
                "word": "Baton Rouge",
                "pos": ""
            },
            {
                "word": "baton round",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a short thick stick that police officers carry as a weapon",
                    "vi": "một cây gậy ngắn dày mà các sĩ quan cảnh sát mang theo như một vũ khí"
                },
                "examples": [
                    {
                        "en": "a baton charge (= one made by police carrying batons, to force a crowd back)",
                        "vi": "một đòn tấn công bằng dùi cui (= một đòn do cảnh sát mang dùi cui thực hiện, để buộc đám đông quay lại)"
                    }
                ]
            },
            {
                "define": {
                    "en": "a thin light stick used by the person (called a conductor) who is in control of an orchestra, etc.",
                    "vi": "một thanh ánh sáng mỏng được sử dụng bởi một người (được gọi là nhạc trưởng) điều khiển dàn nhạc, v.v."
                },
                "examples": [
                    {
                        "en": "The orchestra played brilliantly under Previn’s baton.",
                        "vi": "Dàn nhạc chơi xuất sắc dưới sự chỉ huy của Previn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a short light stick that one member of a team in a relay race passes to the next person to run",
                    "vi": "một cây gậy ánh sáng ngắn mà một thành viên của đội trong cuộc chạy tiếp sức chuyền cho người tiếp theo để chạy"
                },
                "examples": [
                    {
                        "en": "to pass/hand over the baton",
                        "vi": "chuyền / giao dùi cui"
                    },
                    {
                        "en": "(figurative) The President handed over the baton (= passed responsibility) to his successor.",
                        "vi": "(nghĩa bóng) Tổng thống đã trao chiếc dùi cui (= giao trách nhiệm) cho người kế nhiệm."
                    }
                ]
            },
            {
                "define": {
                    "en": "a long stick that is held and thrown in the air by a person marching in front of a band, or by a majorette",
                    "vi": "một cây gậy dài được một người diễu hành trước ban nhạc cầm và ném lên trời"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "72eca8997625474ba81112c582e695c7",
        "word": "busk",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/bʌsk/",
            "us": "/bʌsk/"
        },
        "nearby": [
            {
                "word": "businesswoman",
                "pos": "noun"
            },
            {
                "word": "busing",
                "pos": "noun"
            },
            {
                "word": "busk",
                "pos": "verb"
            },
            {
                "word": "busker",
                "pos": "noun"
            },
            {
                "word": "buskin",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to perform music in a public place and ask for money from people passing by",
                    "vi": "biểu diễn âm nhạc ở nơi công cộng và xin tiền từ những người đi qua"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a0286a429c304638902e67d25531fede",
        "word": "busking",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbʌskɪŋ/",
            "us": "/ˈbʌskɪŋ/"
        },
        "nearby": [
            {
                "word": "busker",
                "pos": "noun"
            },
            {
                "word": "buskin",
                "pos": "noun"
            },
            {
                "word": "busking",
                "pos": "noun"
            },
            {
                "word": "bus lane",
                "pos": "noun"
            },
            {
                "word": "busload",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the activity of performing music in a public place and asking for money from people passing by",
                    "vi": "hoạt động biểu diễn ca nhạc nơi công cộng và xin tiền người qua đường"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "eb382b2be58240168622355767d428e6",
        "word": "chant",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/tʃɑːnt/",
            "us": "/tʃænt/"
        },
        "nearby": [
            {
                "word": "the Channel Tunnel",
                "pos": ""
            },
            {
                "word": "chant",
                "pos": "noun"
            },
            {
                "word": "chant",
                "pos": "verb"
            },
            {
                "word": "chanter",
                "pos": "noun"
            },
            {
                "word": "chanterelle",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to sing or shout the same words or phrases many times",
                    "vi": "hát hoặc hét cùng một từ hoặc cụm từ nhiều lần"
                },
                "examples": [
                    {
                        "en": "A group of protesters, chanting and carrying placards, waited outside.",
                        "vi": "Một nhóm người biểu tình, hô vang và mang theo biểu ngữ, đã chờ sẵn bên ngoài."
                    },
                    {
                        "en": "chant something The crowd chanted their hero's name.",
                        "vi": "hô một cái gì đó Đám đông hô vang tên anh hùng của họ."
                    },
                    {
                        "en": "‘Resign! Resign!’ they chanted.",
                        "vi": "Từ chức! Từ chức!' họ hô vang."
                    }
                ]
            },
            {
                "define": {
                    "en": "to sing or say a religious song or prayer using only a few notes that are repeated many times",
                    "vi": "hát hoặc nói một bài hát tôn giáo hoặc lời cầu nguyện chỉ sử dụng một vài nốt nhạc được lặp đi lặp lại nhiều lần"
                },
                "examples": [
                    {
                        "en": "In a nearby temple, our guide chanted a prayer and lit a stick of incense.",
                        "vi": "Trong một ngôi đền gần đó, hướng dẫn viên của chúng tôi đã đọc kinh và thắp một nén hương."
                    }
                ]
            }
        ]
    },
    {
        "id": "83dbc5bdb78d40939b05f8ef2d8712ab",
        "word": "encore",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɒŋkɔː(r)/",
            "us": "/ˈɑːnkɔːr/"
        },
        "nearby": [
            {
                "word": "encomium",
                "pos": "noun"
            },
            {
                "word": "encompass",
                "pos": "verb"
            },
            {
                "word": "encore",
                "pos": "noun"
            },
            {
                "word": "encore",
                "pos": "exclamation"
            },
            {
                "word": "encounter",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an extra short performance given at the end of a concert or other performance; a request for this made by an audience calling out",
                    "vi": "một buổi biểu diễn ngắn bổ sung được đưa ra vào cuối buổi hòa nhạc hoặc buổi biểu diễn khác; một yêu cầu cho điều này được thực hiện bởi một khán giả đang kêu gọi"
                },
                "examples": [
                    {
                        "en": "She played a Chopin waltz as an encore.",
                        "vi": "Cô ấy chơi một điệu valse Chopin như một bản encore."
                    },
                    {
                        "en": "The group got three encores.",
                        "vi": "Nhóm có ba mã."
                    }
                ]
            }
        ]
    },
    {
        "id": "f78e4da5c4344e63be27ab5356054b4d",
        "word": "gig",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ɡɪɡ/",
            "us": "/ɡɪɡ/"
        },
        "nearby": [
            {
                "word": "gift-wrap",
                "pos": "verb"
            },
            {
                "word": "gig",
                "pos": "noun"
            },
            {
                "word": "gig",
                "pos": "verb"
            },
            {
                "word": "giga-",
                "pos": "combining form"
            },
            {
                "word": "gigabit",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to give musical performances in front of audiences, especially of modern music like rock, pop or jazz",
                    "vi": "để trình diễn âm nhạc trước khán giả, đặc biệt là âm nhạc hiện đại như rock, pop hoặc jazz"
                },
                "examples": [
                    {
                        "en": "We were gigging two or three nights a week.",
                        "vi": "Chúng tôi đã biểu diễn hai hoặc ba đêm một tuần."
                    },
                    {
                        "en": "+ adv./prep. Zoe started off singing as part of a reggae band, gigging around the country.",
                        "vi": "Err:509"
                    }
                ]
            }
        ]
    },
    {
        "id": "83f57fa639094a258eda96ed12ac5f78",
        "word": "headline",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈhedlaɪn/",
            "us": "/ˈhedlaɪn/"
        },
        "nearby": [
            {
                "word": "headlight",
                "pos": "noun"
            },
            {
                "word": "headline",
                "pos": "noun"
            },
            {
                "word": "headline",
                "pos": "verb"
            },
            {
                "word": "headliner",
                "pos": "noun"
            },
            {
                "word": "headlock",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to give a story or article a particular headline",
                    "vi": "để đưa một câu chuyện hoặc một bài báo vào một tiêu đề cụ thể"
                },
                "examples": [
                    {
                        "en": "be headlined… The story was headlined ‘Back to the future’.",
                        "vi": "được giật tít… Câu chuyện được đặt tiêu đề là 'Trở lại tương lai'."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be the main performer in a concert or show",
                    "vi": "trở thành người biểu diễn chính trong một buổi hòa nhạc hoặc chương trình"
                },
                "examples": [
                    {
                        "en": "The concert is to be headlined by Ed Sheeran.",
                        "vi": "Buổi hòa nhạc sẽ do Ed Sheeran làm tiêu đề."
                    }
                ]
            }
        ]
    },
    {
        "id": "9eaebfb58b764eca8427474d62421fa7",
        "word": "jam",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/dʒæm/",
            "us": "/dʒæm/"
        },
        "nearby": [
            {
                "word": "jalopy",
                "pos": "noun"
            },
            {
                "word": "jam",
                "pos": "noun"
            },
            {
                "word": "jam",
                "pos": "verb"
            },
            {
                "word": "Jamaica",
                "pos": ""
            },
            {
                "word": "Jamaican",
                "pos": "noun, adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to push something somewhere with a lot of force",
                    "vi": "để đẩy một cái gì đó ở đâu đó với rất nhiều lực"
                },
                "examples": [
                    {
                        "en": "He jammed his fingers in his ears.",
                        "vi": "Anh nhét ngón tay vào tai."
                    },
                    {
                        "en": "A stool had been jammed against the door.",
                        "vi": "Một chiếc ghế đẩu đã bị kẹt vào cửa."
                    }
                ]
            },
            {
                "define": {
                    "en": "to become unable to move or work; to make something do this",
                    "vi": "không thể di chuyển hoặc làm việc; để làm một cái gì đó làm điều này"
                },
                "examples": [
                    {
                        "en": "jam (up) The photocopier keeps jamming up.",
                        "vi": "kẹt (up) Máy photocopy vẫn bị kẹt."
                    },
                    {
                        "en": "jam something (up) There's a loose part that keeps jamming the mechanism.",
                        "vi": "kẹt cái gì đó (lên) Có một bộ phận lỏng lẻo tiếp tục làm kẹt cơ chế."
                    },
                    {
                        "en": "+ adj. The valve has jammed shut.",
                        "vi": "Err:509"
                    },
                    {
                        "en": "jam something + adj. He jammed the door open with a piece of wood.",
                        "vi": "kẹt cái gì đó + adj. Anh ta dùng một mảnh gỗ đóng chặt cửa lại."
                    },
                    {
                        "en": "The traffic was jammed solid in the city centre.",
                        "vi": "Giao thông ùn tắc ở trung tâm thành phố."
                    }
                ]
            },
            {
                "define": {
                    "en": "to put somebody/something into a small space where there is very little room to move",
                    "vi": "đặt ai đó / cái gì đó vào một không gian nhỏ, nơi có rất ít chỗ để di chuyển"
                },
                "examples": [
                    {
                        "en": "be jammed + adv./prep. Six of us were jammed into one small car.",
                        "vi": "bị kẹt + adv./prep. Sáu người chúng tôi bị kẹt vào một chiếc xe nhỏ."
                    },
                    {
                        "en": "We were jammed together like sardines in a can.",
                        "vi": "Chúng tôi đã bị kẹt với nhau như cá mòi trong một cái lon."
                    },
                    {
                        "en": "The cupboards were jammed full of old newspapers.",
                        "vi": "Các ngăn tủ đầy những tờ báo cũ."
                    },
                    {
                        "en": "+ adv./prep. Nearly 1 000 students jammed into the hall.",
                        "vi": "Err:509"
                    }
                ]
            },
            {
                "define": {
                    "en": "to fill something with a large number of people or things so that it is unable to function as it should",
                    "vi": "để lấp đầy một cái gì đó với một số lượng lớn người hoặc nhiều thứ để nó không thể hoạt động như bình thường"
                },
                "examples": [
                    {
                        "en": "Viewers jammed the switchboard with complaints.",
                        "vi": "Người xem chen chúc tổng đài khiếu nại."
                    }
                ]
            },
            {
                "define": {
                    "en": "to send out radio signals to prevent another radio broadcast from being heard",
                    "vi": "gửi tín hiệu vô tuyến để ngăn chặn việc nghe thấy một chương trình phát thanh khác"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to play music with other musicians in an informal way without preparing or practising first",
                    "vi": "để chơi nhạc với các nhạc sĩ khác một cách thân mật mà không cần chuẩn bị hoặc luyện tập trước"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to operate the brakes on a vehicle suddenly and with force",
                    "vi": "điều khiển phanh xe đột ngột và có lực"
                },
                "examples": [
                    {
                        "en": "The car skidded as he jammed on the brakes.",
                        "vi": "Chiếc xe trượt đi khi anh ta phanh gấp."
                    }
                ]
            }
        ]
    },
    {
        "id": "0c1ce60ec02d4438a29a9cbf0e674c23",
        "word": "sell-out",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsel aʊt/",
            "us": "/ˈsel aʊt/"
        },
        "nearby": [
            {
                "word": "Sellotape",
                "pos": "noun"
            },
            {
                "word": "sell out",
                "pos": "phrasal verb"
            },
            {
                "word": "sell-out",
                "pos": "noun"
            },
            {
                "word": "sell-through",
                "pos": "noun"
            },
            {
                "word": "sell up",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a play, concert, etc. for which all the tickets have been sold",
                    "vi": "một vở kịch, buổi hòa nhạc, v.v. mà tất cả vé đã được bán"
                },
                "examples": [
                    {
                        "en": "Next week's final looks like being a sell-out.",
                        "vi": "Cuối cùng của tuần tới có vẻ như là một đợt bán hết."
                    },
                    {
                        "en": "a sell-out tour",
                        "vi": "một chuyến du lịch bán hết vé"
                    }
                ]
            },
            {
                "define": {
                    "en": "a situation in which somebody behaves badly towards a person or group who trusted them, by not doing something that they promised to do, or by doing something that they promised not to do",
                    "vi": "một tình huống trong đó ai đó cư xử tệ với một người hoặc một nhóm người đã tin tưởng họ, bằng cách không làm điều gì đó họ đã hứa hoặc bằng cách làm điều gì đó mà họ đã hứa không làm"
                },
                "examples": [
                    {
                        "en": "The workers see the deal as a union sell-out to management.",
                        "vi": "Người lao động coi thỏa thuận này như một sự bán đứng của công đoàn đối với ban quản lý."
                    }
                ]
            }
        ]
    }
]