[
    {
        "id": "ced502f8bfa445eaa1caffc6dcc8ca9c",
        "word": "better",
        "pos": "adjective",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈbetə(r)/",
            "us": "/ˈbetər/"
        },
        "nearby": [
            {
                "word": "betrothed",
                "pos": "adjective"
            },
            {
                "word": "Betsy",
                "pos": ""
            },
            {
                "word": "better",
                "pos": "adjective"
            },
            {
                "word": "better",
                "pos": "adverb"
            },
            {
                "word": "better",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "of a higher standard or less poor quality; not as bad as something else",
                    "vi": "có tiêu chuẩn cao hơn hoặc chất lượng kém hơn; không tệ như những thứ khác"
                },
                "examples": [
                    {
                        "en": "We're hoping for better weather tomorrow.",
                        "vi": "Chúng tôi hy vọng thời tiết tốt hơn vào ngày mai."
                    },
                    {
                        "en": "Her work is getting better and better.",
                        "vi": "Công việc của cô ấy ngày càng tốt hơn."
                    },
                    {
                        "en": "He is in a much better mood than usual.",
                        "vi": "Anh ấy đang có tâm trạng tốt hơn bình thường rất nhiều."
                    },
                    {
                        "en": "The meal couldn't have been better.",
                        "vi": "Bữa ăn không thể tuyệt vời hơn."
                    },
                    {
                        "en": "There's nothing better than a long soak in a hot bath.",
                        "vi": "Không có gì tuyệt vời hơn là ngâm mình lâu trong bồn tắm nước nóng."
                    },
                    {
                        "en": "If you can only exercise once a week, that's better than nothing (= better than taking no exercise at all).",
                        "vi": "Nếu bạn chỉ có thể tập thể dục một lần một tuần, thì còn hơn không (= tốt hơn là không tập thể dục gì cả)."
                    }
                ]
            },
            {
                "define": {
                    "en": "more suitable or appropriate",
                    "vi": "phù hợp hơn hoặc thích hợp hơn"
                },
                "examples": [
                    {
                        "en": "Can you think of a better word than ‘nice’?",
                        "vi": "Bạn có thể nghĩ ra từ nào hay hơn là 'tốt đẹp' không?"
                    },
                    {
                        "en": "It would be better for him to talk to his parents about his problems.",
                        "vi": "Sẽ tốt hơn nếu anh ấy nói chuyện với bố mẹ về những vấn đề của mình."
                    },
                    {
                        "en": "You'd be better going by bus.",
                        "vi": "Tốt hơn bạn nên đi bằng xe buýt."
                    }
                ]
            },
            {
                "define": {
                    "en": "more able; showing more skill",
                    "vi": "có thể hơn; thể hiện nhiều kỹ năng hơn"
                },
                "examples": [
                    {
                        "en": "She's far better at science than her brother.",
                        "vi": "Cô ấy giỏi khoa học hơn nhiều so với anh trai mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "less ill or unhappy",
                    "vi": "ít bệnh tật hoặc không hạnh phúc"
                },
                "examples": [
                    {
                        "en": "She's a lot better today.",
                        "vi": "Hôm nay cô ấy tốt hơn rất nhiều."
                    },
                    {
                        "en": "His leg was getting better.",
                        "vi": "Chân của anh ấy đã trở nên tốt hơn."
                    },
                    {
                        "en": "You'll feel all the better for a good night's sleep.",
                        "vi": "Bạn sẽ cảm thấy tốt hơn cho một đêm ngon giấc."
                    }
                ]
            },
            {
                "define": {
                    "en": "fully recovered after an illness; in good health again",
                    "vi": "phục hồi hoàn toàn sau một trận ốm; sức khỏe tốt trở lại"
                },
                "examples": [
                    {
                        "en": "Don't go back to work until you are better.",
                        "vi": "Đừng quay lại làm việc cho đến khi bạn khá hơn."
                    }
                ]
            },
            {
                "define": {
                    "en": "most of something, especially a period of time; more than half of something",
                    "vi": "hầu hết mọi thứ, đặc biệt là một khoảng thời gian; hơn một nửa của cái gì đó"
                },
                "examples": [
                    {
                        "en": "He drank the best part of a bottle of Scotch waiting for her to get home.",
                        "vi": "Anh uống phần ngon nhất của chai Scotch chờ cô về nhà."
                    },
                    {
                        "en": "The journey took her the better part of an hour.",
                        "vi": "Cuộc hành trình đã khiến cô mất một giờ tốt hơn."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that something should be as big, small, etc. as possible",
                    "vi": "được sử dụng để nói rằng cái gì đó phải càng lớn, càng nhỏ, v.v. càng tốt"
                },
                "examples": [
                    {
                        "en": "I love giving parties, the bigger the better.",
                        "vi": "Tôi thích tổ chức các bữa tiệc, càng lớn càng tốt."
                    }
                ]
            },
            {
                "define": {
                    "en": "you should avoid danger and not take unnecessary risks",
                    "vi": "bạn nên tránh nguy hiểm và không gặp rủi ro không cần thiết"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "almost or just the same as; almost or just as bad as",
                    "vi": "gần như hoặc giống như; gần như hoặc chỉ tệ như"
                },
                "examples": [
                    {
                        "en": "The path was no better than a sheep track.",
                        "vi": "Con đường không tốt hơn một đường đua cừu."
                    },
                    {
                        "en": "Charles VII was a bad king and Charles VIII was no better.",
                        "vi": "Charles VII là một vị vua tồi và Charles VIII cũng không khá hơn."
                    }
                ]
            },
            {
                "define": {
                    "en": "it is better to stop something bad from happening rather than try to deal with the problems after it has happened",
                    "vi": "tốt hơn là ngăn điều gì đó tồi tệ xảy ra hơn là cố gắng giải quyết các vấn đề sau khi nó đã xảy ra"
                },
                "examples": [
                    {
                        "en": "Prevention is better than cure, so start looking after your heart now.",
                        "vi": "Phòng bệnh hơn chữa bệnh, vì vậy hãy bắt đầu chăm sóc trái tim của bạn ngay từ bây giờ."
                    },
                    {
                        "en": "Prevention is better than cure, so start taking care of yourself.",
                        "vi": "Phòng bệnh hơn chữa bệnh, vì vậy hãy bắt đầu chăm sóc bản thân."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to give support to somebody who has been upset and is trying to become calmer",
                    "vi": "đã từng ủng hộ ai đó đang buồn bã và đang cố gắng trở nên bình tĩnh hơn"
                },
                "examples": [
                    {
                        "en": "Dry your eyes now. That's better.",
                        "vi": "Lau khô mắt của bạn ngay bây giờ. Cái đó tốt hơn."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to praise somebody who has made an effort to improve",
                    "vi": "được sử dụng để khen ngợi ai đó đã nỗ lực để cải thiện"
                },
                "examples": [
                    {
                        "en": "That's much better—you played the right notes this time.",
                        "vi": "Điều đó tốt hơn nhiều — lần này bạn đã chơi đúng các nốt."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that two people can achieve more than one person working alone",
                    "vi": "từng nói rằng hai người có thể đạt được nhiều hơn một người làm việc một mình"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "624c19bb261943e4b9cb54232e9a2384",
        "word": "get over",
        "pos": "phrasal verb",
        "level": "b2",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "get-out",
                "pos": "noun"
            },
            {
                "word": "get out of",
                "pos": "phrasal verb"
            },
            {
                "word": "get over",
                "pos": "phrasal verb"
            },
            {
                "word": "get over yourself",
                "pos": "phrasal verb"
            },
            {
                "word": "get round",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to deal with or gain control of something",
                    "vi": "để đối phó hoặc giành quyền kiểm soát một cái gì đó"
                },
                "examples": [
                    {
                        "en": "She can't get over her shyness.",
                        "vi": "Cô ấy không thể vượt qua sự nhút nhát của mình."
                    },
                    {
                        "en": "I think the problem can be got over without too much difficulty.",
                        "vi": "Tôi nghĩ vấn đề có thể được giải quyết mà không gặp quá nhiều khó khăn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to return to your usual state of health, happiness, etc. after an illness, a shock, the end of a relationship, etc.",
                    "vi": "để trở lại trạng thái bình thường của sức khỏe, hạnh phúc, v.v. sau một cơn bệnh, cú sốc, kết thúc mối quan hệ, v.v."
                },
                "examples": [
                    {
                        "en": "He was disappointed at not getting the job, but he'll get over it.",
                        "vi": "Anh ấy thất vọng vì không nhận được công việc, nhưng anh ấy sẽ vượt qua nó."
                    },
                    {
                        "en": "OK, so you lost. Get over it!",
                        "vi": "OK, vậy là bạn đã thua. Vượt qua nó!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to make something clear to somebody",
                    "vi": "để làm rõ điều gì đó với ai đó"
                },
                "examples": [
                    {
                        "en": "He didn't really get his meaning over to the audience.",
                        "vi": "Anh ấy không thực sự hiểu được ý nghĩa của mình đối với khán giả."
                    }
                ]
            },
            {
                "define": {
                    "en": "to complete something unpleasant but necessary",
                    "vi": "để hoàn thành một cái gì đó khó chịu nhưng cần thiết"
                },
                "examples": [
                    {
                        "en": "I'll be glad to get the exam over and done with.",
                        "vi": "Tôi rất vui khi hoàn thành và hoàn thành bài kiểm tra."
                    }
                ]
            }
        ]
    },
    {
        "id": "347547357afb4030bcb1457b8758a2b5",
        "word": "heal",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/hiːl/",
            "us": "/hiːl/"
        },
        "nearby": [
            {
                "word": "headword",
                "pos": "noun"
            },
            {
                "word": "heady",
                "pos": "adjective"
            },
            {
                "word": "heal",
                "pos": "verb"
            },
            {
                "word": "healer",
                "pos": "noun"
            },
            {
                "word": "healing",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to become healthy again; to make something healthy again",
                    "vi": "để trở nên khỏe mạnh trở lại; để làm cho một cái gì đó lành mạnh trở lại"
                },
                "examples": [
                    {
                        "en": "It took a long time for the wounds to heal.",
                        "vi": "Phải mất một thời gian dài vết thương mới lành lại."
                    },
                    {
                        "en": "heal up The cut healed up without leaving a scar.",
                        "vi": "vết cắt lành lại mà không để lại sẹo."
                    },
                    {
                        "en": "heal something This will help to heal your cuts and scratches.",
                        "vi": "chữa lành một cái gì đó Điều này sẽ giúp chữa lành vết cắt và vết xước của bạn."
                    },
                    {
                        "en": "(figurative) It was a chance to heal the wounds in the party (= to repair the damage that had been done).",
                        "vi": "(nghĩa bóng) Đó là cơ hội để chữa lành vết thương trong nhóm (= sửa chữa những thiệt hại đã gây ra)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to cure somebody who is ill; to make somebody feel happy again",
                    "vi": "để chữa bệnh cho ai đó; để làm cho ai đó cảm thấy vui vẻ trở lại"
                },
                "examples": [
                    {
                        "en": "the story of Jesus healing ten lepers of their disease",
                        "vi": "câu chuyện về Chúa Giê-xu chữa lành bệnh cho mười người phong cùi"
                    },
                    {
                        "en": "I felt healed by his love.",
                        "vi": "Tôi cảm thấy được chữa lành bởi tình yêu của anh ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to put an end to something or make something easier to bear; to end or become easier to bear",
                    "vi": "để chấm dứt một cái gì đó hoặc làm cho một cái gì đó dễ chịu hơn; để kết thúc hoặc trở nên dễ chịu hơn"
                },
                "examples": [
                    {
                        "en": "She was never able to heal the rift between herself and her father.",
                        "vi": "Cô ấy không bao giờ có thể hàn gắn rạn nứt giữa mình và cha mình."
                    },
                    {
                        "en": "The breach between them never really healed.",
                        "vi": "Sự rạn nứt giữa họ không bao giờ thực sự được hàn gắn."
                    }
                ]
            }
        ]
    },
    {
        "id": "10b6b693b7694e61b3e45a9f86359a43",
        "word": "recover",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/rɪˈkʌvə(r)/",
            "us": "/rɪˈkʌvər/"
        },
        "nearby": [
            {
                "word": "recoup",
                "pos": "verb"
            },
            {
                "word": "recourse",
                "pos": "noun"
            },
            {
                "word": "recover",
                "pos": "verb"
            },
            {
                "word": "re-cover",
                "pos": "verb"
            },
            {
                "word": "recoverable",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to get well again after being ill, hurt, etc.",
                    "vi": "để khỏe lại sau khi bị ốm, bị thương, v.v."
                },
                "examples": [
                    {
                        "en": "recover from something He's still recovering from his operation.",
                        "vi": "hồi phục sau một cái gì đó Anh ấy vẫn đang hồi phục sau cuộc phẫu thuật của mình."
                    },
                    {
                        "en": "She spent many weeks in hospital recovering from her injuries.",
                        "vi": "Cô đã phải nằm viện nhiều tuần để hồi phục vết thương."
                    },
                    {
                        "en": "He has fully recovered from the shoulder surgery.",
                        "vi": "Anh ấy đã bình phục hoàn toàn sau ca phẫu thuật vai."
                    },
                    {
                        "en": "She remains in serious condition, but is expected to recover.",
                        "vi": "Cô ấy vẫn đang trong tình trạng nghiêm trọng, nhưng dự kiến sẽ hồi phục."
                    },
                    {
                        "en": "The victim is recovering well at home.",
                        "vi": "Nạn nhân đang hồi phục tốt tại nhà."
                    }
                ]
            },
            {
                "define": {
                    "en": "to return to a normal state after an unpleasant or unusual experience or a period of difficulty",
                    "vi": "để trở lại trạng thái bình thường sau một trải nghiệm khó chịu hoặc bất thường hoặc một giai đoạn khó khăn"
                },
                "examples": [
                    {
                        "en": "recover from something It can take many years to recover from the death of a loved one.",
                        "vi": "phục hồi sau cái chết Có thể mất nhiều năm để phục hồi sau cái chết của một người thân yêu."
                    },
                    {
                        "en": "The economy is at last beginning to recover.",
                        "vi": "Nền kinh tế cuối cùng đang bắt đầu phục hồi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to get back the same amount of money that you have spent or that is owed to you",
                    "vi": "để lấy lại đúng số tiền bạn đã tiêu hoặc nợ bạn"
                },
                "examples": [
                    {
                        "en": "He is unlikely to ever recover his legal costs.",
                        "vi": "Anh ta không có khả năng bao giờ phục hồi các chi phí pháp lý của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to get back or find something that was lost, stolen or missing",
                    "vi": "để lấy lại hoặc tìm thứ gì đó đã bị mất, bị đánh cắp hoặc bị thiếu"
                },
                "examples": [
                    {
                        "en": "recover something The police eventually recovered the stolen paintings.",
                        "vi": "khôi phục một cái gì đó Cảnh sát cuối cùng đã thu hồi được những bức tranh bị đánh cắp."
                    },
                    {
                        "en": "recover something from somebody/something Six bodies were recovered from the wreckage.",
                        "vi": "khôi phục một cái gì đó từ ai đó / cái gì đó Sáu cơ thể đã được phục hồi từ đống đổ nát."
                    }
                ]
            },
            {
                "define": {
                    "en": "to win back a position, level, status, etc. that has been lost",
                    "vi": "để giành lại vị trí, cấp độ, địa vị, v.v. đã bị mất"
                },
                "examples": [
                    {
                        "en": "The team recovered its lead in the second half.",
                        "vi": "Đội đã tìm lại được lợi thế dẫn trước trong hiệp hai."
                    }
                ]
            },
            {
                "define": {
                    "en": "to get back the use of your senses, control of your emotions, etc.",
                    "vi": "để lấy lại khả năng sử dụng các giác quan, kiểm soát cảm xúc của bạn, v.v."
                },
                "examples": [
                    {
                        "en": "recover something It took her a few minutes to recover consciousness.",
                        "vi": "phục hồi một cái gì đó Cô phải mất một vài phút để phục hồi ý thức."
                    },
                    {
                        "en": "to recover your sight",
                        "vi": "để phục hồi thị lực của bạn"
                    },
                    {
                        "en": "recover yourself She seemed upset but quickly recovered herself.",
                        "vi": "phục hồi bản thân Cô ấy có vẻ khó chịu nhưng nhanh chóng phục hồi bản thân."
                    }
                ]
            }
        ]
    },
    {
        "id": "6d973bd6e19d426aa6c9e91918532550",
        "word": "recovery",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/rɪˈkʌvəri/",
            "us": "/rɪˈkʌvəri/"
        },
        "nearby": [
            {
                "word": "recoverable",
                "pos": "adjective"
            },
            {
                "word": "recovered",
                "pos": "adjective"
            },
            {
                "word": "recovery",
                "pos": "noun"
            },
            {
                "word": "recovery position",
                "pos": "noun"
            },
            {
                "word": "recreant",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the process of becoming well again after an illness or injury",
                    "vi": "quá trình trở nên khỏe mạnh trở lại sau một trận ốm hoặc chấn thương"
                },
                "examples": [
                    {
                        "en": "My father has made a full recovery from the operation.",
                        "vi": "Cha tôi đã bình phục hoàn toàn sau ca phẫu thuật."
                    },
                    {
                        "en": "to make a remarkable/quick/speedy/slow recovery",
                        "vi": "để thực hiện một sự phục hồi đáng chú ý / nhanh chóng / nhanh chóng / chậm"
                    },
                    {
                        "en": "She is on the road to (= making progress towards) recovery.",
                        "vi": "Cô ấy đang trên con đường để (= đang tiến tới) phục hồi."
                    }
                ]
            },
            {
                "define": {
                    "en": "the process of improving or becoming stronger again",
                    "vi": "quá trình cải thiện hoặc trở nên mạnh mẽ hơn một lần nữa"
                },
                "examples": [
                    {
                        "en": "The government is forecasting an economic recovery.",
                        "vi": "Chính phủ đang dự báo một sự phục hồi kinh tế."
                    },
                    {
                        "en": "The economy is showing signs of recovery.",
                        "vi": "Nền kinh tế đang có dấu hiệu phục hồi."
                    },
                    {
                        "en": "recovery in something a recovery in consumer spending",
                        "vi": "sự phục hồi trong một cái gì đó, sự phục hồi trong chi tiêu của người tiêu dùng"
                    }
                ]
            },
            {
                "define": {
                    "en": "the action or process of getting something back that has been lost or stolen",
                    "vi": "hành động hoặc quy trình lấy lại thứ gì đó đã bị mất hoặc bị đánh cắp"
                },
                "examples": [
                    {
                        "en": "There is a reward for information leading to the recovery of the missing diamonds.",
                        "vi": "Có một phần thưởng cho thông tin dẫn đến việc thu hồi những viên kim cương bị mất."
                    }
                ]
            },
            {
                "define": {
                    "en": "the room in a hospital where patients are kept immediately after an operation",
                    "vi": "phòng trong bệnh viện nơi bệnh nhân được giữ lại ngay sau khi phẫu thuật"
                },
                "examples": [
                    {
                        "en": "Your mother is now in recovery.",
                        "vi": "Mẹ của bạn hiện đã bình phục."
                    },
                    {
                        "en": "After the operation she was taken to the recovery room.",
                        "vi": "Sau ca phẫu thuật, cô được đưa vào phòng hồi sức."
                    }
                ]
            }
        ]
    },
    {
        "id": "667d5bdfd31b4c05a380ed4c8a732a58",
        "word": "bounce back",
        "pos": "phrasal verb",
        "level": "c1",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "bounce",
                "pos": "verb"
            },
            {
                "word": "bounce",
                "pos": "noun"
            },
            {
                "word": "bounce back",
                "pos": "phrasal verb"
            },
            {
                "word": "bouncebackability",
                "pos": "noun"
            },
            {
                "word": "bounce house",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to become healthy, successful or confident again after being ill or having difficulties",
                    "vi": "để trở nên khỏe mạnh, thành công hoặc tự tin trở lại sau khi bị ốm hoặc gặp khó khăn"
                },
                "examples": [
                    {
                        "en": "He's had a lot of problems, but he always seems to bounce back pretty quickly.",
                        "vi": "Anh ấy đã gặp rất nhiều vấn đề, nhưng dường như anh ấy luôn hồi phục khá nhanh."
                    }
                ]
            },
            {
                "define": {
                    "en": "to return to their previous high level or value after a period of difficulty",
                    "vi": "để trở lại mức hoặc giá trị cao trước đây của họ sau một thời gian khó khăn"
                },
                "examples": [
                    {
                        "en": "The airline's shares have bounced back from two days of heavy losses.",
                        "vi": "Cổ phiếu của hãng hàng không này đã tăng trở lại sau hai ngày thua lỗ nặng nề."
                    }
                ]
            }
        ]
    },
    {
        "id": "823f9369ca24429e909a17f657e2b580",
        "word": "after-effect",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɑːftər ɪfekt/",
            "us": "/ˈæftər ɪfekt/"
        },
        "nearby": [
            {
                "word": "afterburner",
                "pos": "noun"
            },
            {
                "word": "aftercare",
                "pos": "noun"
            },
            {
                "word": "after-effect",
                "pos": "noun"
            },
            {
                "word": "afterglow",
                "pos": "noun"
            },
            {
                "word": "after-hours",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the after-effects of a drug, an illness or an unpleasant event are the feelings that you experience later as a result of it",
                    "vi": "hậu quả của một loại thuốc, một căn bệnh hoặc một sự kiện khó chịu là những cảm giác mà bạn trải qua sau này do hậu quả của nó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "1ca455d3a94842f8a9ace742ea51621a",
        "word": "all-clear",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ði ˌɔːl ˈklɪə(r)/",
            "us": "/ði ˌɔːl ˈklɪr/"
        },
        "nearby": [
            {
                "word": "All-Bran",
                "pos": "noun"
            },
            {
                "word": "all-Canadian",
                "pos": "adjective"
            },
            {
                "word": "all-clear",
                "pos": "noun"
            },
            {
                "word": "all-consuming",
                "pos": "adjective"
            },
            {
                "word": "all-day",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a signal (often a sound) that shows that a place or situation is no longer dangerous",
                    "vi": "một tín hiệu (thường là âm thanh) cho thấy một địa điểm hoặc tình huống không còn nguy hiểm nữa"
                },
                "examples": [
                    {
                        "en": "The children hid in the basement until the all-clear sounded.",
                        "vi": "Những đứa trẻ trốn trong tầng hầm cho đến khi tất cả âm thanh rõ ràng."
                    }
                ]
            },
            {
                "define": {
                    "en": "if a doctor gives somebody the all-clear, they tell the person that he/she does not have any health problems",
                    "vi": "nếu bác sĩ cho ai đó biết tất cả, họ sẽ nói với người đó rằng họ không có bất kỳ vấn đề sức khỏe nào"
                },
                "examples": [
                    {
                        "en": "(figurative) The building was given the all-clear following tests.",
                        "vi": "(nghĩa bóng) Tòa nhà đã được kiểm tra rõ ràng sau đây."
                    }
                ]
            },
            {
                "define": {
                    "en": "permission to do something",
                    "vi": "sự cho phép để làm một cái gì đó"
                },
                "examples": [
                    {
                        "en": "The ship was given the all-clear to sail.",
                        "vi": "Con tàu đã được thông suốt để ra khơi."
                    }
                ]
            }
        ]
    },
    {
        "id": "df26194891cd40498752d372db567837",
        "word": "convalesce",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌkɒnvəˈles/",
            "us": "/ˌkɑːnvəˈles/"
        },
        "nearby": [
            {
                "word": "conundrum",
                "pos": "noun"
            },
            {
                "word": "conurbation",
                "pos": "noun"
            },
            {
                "word": "convalesce",
                "pos": "verb"
            },
            {
                "word": "convalescence",
                "pos": "noun"
            },
            {
                "word": "convalescent",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to spend time getting your health and strength back after an illness",
                    "vi": "dành thời gian lấy lại sức khỏe và sức lực sau một trận ốm"
                },
                "examples": [
                    {
                        "en": "She is convalescing at home after her operation.",
                        "vi": "Cô đang dưỡng bệnh tại nhà sau ca phẫu thuật."
                    }
                ]
            }
        ]
    },
    {
        "id": "db0e3f6cdfdc43ccb83d0805b535bcbd",
        "word": "convalescence",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌkɒnvəˈlesns/",
            "us": "/ˌkɑːnvəˈlesns/"
        },
        "nearby": [
            {
                "word": "conurbation",
                "pos": "noun"
            },
            {
                "word": "convalesce",
                "pos": "verb"
            },
            {
                "word": "convalescence",
                "pos": "noun"
            },
            {
                "word": "convalescent",
                "pos": "noun"
            },
            {
                "word": "convalescent",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a period of time when you get well again after an illness or a medical operation; the process of getting well",
                    "vi": "khoảng thời gian khi bạn khỏe trở lại sau một trận ốm hoặc một cuộc phẫu thuật y tế; quá trình trở nên tốt"
                },
                "examples": [
                    {
                        "en": "You need four to six weeks' convalescence.",
                        "vi": "Bạn cần nghỉ dưỡng sức từ bốn đến sáu tuần."
                    }
                ]
            }
        ]
    },
    {
        "id": "a73eca954d7b488da8a50a260ee28344",
        "word": "curable",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkjʊərəbl/",
            "us": "/ˈkjʊrəbl/"
        },
        "nearby": [
            {
                "word": "cup tie",
                "pos": "noun"
            },
            {
                "word": "cur",
                "pos": "noun"
            },
            {
                "word": "curable",
                "pos": "adjective"
            },
            {
                "word": "curaçao",
                "pos": "noun"
            },
            {
                "word": "curacy",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "that can be cured",
                    "vi": "điều đó có thể được chữa khỏi"
                },
                "examples": [
                    {
                        "en": "Most skin cancers are curable if treated early.",
                        "vi": "Hầu hết các bệnh ung thư da đều có thể chữa khỏi nếu được điều trị sớm."
                    }
                ]
            }
        ]
    },
    {
        "id": "def9b30acc5e48249cc3925e6ff51b05",
        "word": "make it",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/meɪk/",
            "us": "/meɪk/"
        },
        "nearby": [
            {
                "word": "majorly",
                "pos": "adverb"
            },
            {
                "word": "major on",
                "pos": "phrasal verb"
            },
            {
                "word": "make",
                "pos": "verb"
            },
            {
                "word": "make",
                "pos": "noun"
            },
            {
                "word": "make-believe",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to create or prepare something by combining materials or putting parts together",
                    "vi": "để tạo hoặc chuẩn bị thứ gì đó bằng cách kết hợp các vật liệu hoặc ghép các bộ phận lại với nhau"
                },
                "examples": [
                    {
                        "en": "make something to make a table/dress/cake",
                        "vi": "làm một cái gì đó để làm một cái bàn / váy / bánh"
                    },
                    {
                        "en": "to make bread/cement/paper",
                        "vi": "để làm bánh mì / xi măng / giấy"
                    },
                    {
                        "en": "She makes her own clothes.",
                        "vi": "Cô ấy tự may quần áo cho mình."
                    },
                    {
                        "en": "How do you make that dish with the peppers and olives in it?",
                        "vi": "Làm thế nào để bạn làm món ăn đó với ớt và ô liu trong đó?"
                    },
                    {
                        "en": "made in France (= on a label)",
                        "vi": "sản xuất tại Pháp (= trên nhãn)"
                    },
                    {
                        "en": "be made of something What's your shirt made of?",
                        "vi": "được làm bằng cái gì Áo sơ mi của bạn làm bằng gì?"
                    },
                    {
                        "en": "Traditional Japanese houses were made of wood.",
                        "vi": "Những ngôi nhà truyền thống của Nhật Bản được làm bằng gỗ."
                    },
                    {
                        "en": "be made out of something What's your shirt made out of?",
                        "vi": "được làm từ cái gì Cái áo của bạn được làm bằng gì?"
                    },
                    {
                        "en": "be made from something Wine is made from grapes.",
                        "vi": "được làm từ thứ gì đó Rượu vang được làm từ nho."
                    },
                    {
                        "en": "make something into something The grapes are made into wine.",
                        "vi": "làm một cái gì đó thành một cái gì đó Nho được làm thành rượu."
                    },
                    {
                        "en": "make something for somebody She made coffee for us all.",
                        "vi": "làm gì đó cho ai đó Cô ấy đã pha cà phê cho tất cả chúng ta."
                    },
                    {
                        "en": "make somebody something She made us all coffee.",
                        "vi": "làm cho ai đó thứ gì đó Cô ấy đã pha cà phê cho tất cả chúng tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to write, create or prepare something",
                    "vi": "để viết, tạo hoặc chuẩn bị một cái gì đó"
                },
                "examples": [
                    {
                        "en": "These regulations were made to protect children.",
                        "vi": "Những quy định này được đưa ra để bảo vệ trẻ em."
                    },
                    {
                        "en": "My lawyer has been urging me to make a will.",
                        "vi": "Luật sư của tôi đã thúc giục tôi lập di chúc."
                    },
                    {
                        "en": "She has made (= directed or acted in) several movies.",
                        "vi": "Cô ấy đã thực hiện (= đạo diễn hoặc diễn xuất) một số bộ phim."
                    },
                    {
                        "en": "It is possible to make a hypothesis on the basis of this graph.",
                        "vi": "Có thể đưa ra giả thuyết trên cơ sở đồ thị này."
                    },
                    {
                        "en": "The Environment Secretary is to make a statement on Tuesday.",
                        "vi": "Bộ trưởng Môi trường sẽ đưa ra tuyên bố vào thứ Ba."
                    }
                ]
            },
            {
                "define": {
                    "en": "to cause something to appear as a result of breaking, tearing, hitting or removing material",
                    "vi": "gây ra một cái gì đó xuất hiện do vỡ, rách, va đập hoặc loại bỏ vật liệu"
                },
                "examples": [
                    {
                        "en": "make something + adv./prep. The stone made a dent in the roof of the car.",
                        "vi": "làm một cái gì đó + adv./prep. Đá tạo vết lõm trên nóc ô tô."
                    },
                    {
                        "en": "make something The holes in the cloth were made by moths.",
                        "vi": "tạo ra một cái gì đó Các lỗ trên tấm vải được tạo ra bởi bướm đêm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to cause something to exist, happen or be done",
                    "vi": "để làm cho một cái gì đó tồn tại, xảy ra hoặc được thực hiện"
                },
                "examples": [
                    {
                        "en": "to make a noise/mess/fuss",
                        "vi": "gây ồn ào / lộn xộn / ồn ào"
                    },
                    {
                        "en": "She tried to make a good impression on the interviewer.",
                        "vi": "Cô ấy cố gắng tạo ấn tượng tốt với người phỏng vấn."
                    },
                    {
                        "en": "I keep making the same mistakes.",
                        "vi": "Tôi tiếp tục mắc những sai lầm tương tự."
                    }
                ]
            },
            {
                "define": {
                    "en": "to cause somebody/something to feel, show or have a particular quality; to cause somebody/something to be or become something",
                    "vi": "để khiến ai đó / điều gì đó cảm thấy, thể hiện hoặc có một phẩm chất cụ thể; để khiến ai đó / cái gì đó trở thành hoặc trở thành cái gì đó"
                },
                "examples": [
                    {
                        "en": "The news made him very happy.",
                        "vi": "Tin tức làm anh ấy rất vui."
                    },
                    {
                        "en": "She made her objections clear.",
                        "vi": "Cô ấy đã nói rõ sự phản đối của mình."
                    },
                    {
                        "en": "Technology promises to make our lives easier.",
                        "vi": "Công nghệ hứa hẹn sẽ làm cho cuộc sống của chúng ta dễ dàng hơn."
                    },
                    {
                        "en": "He made it clear that he objected.",
                        "vi": "Anh ấy nói rõ rằng anh ấy phản đối."
                    },
                    {
                        "en": "The full story was never made public.",
                        "vi": "Toàn bộ câu chuyện không bao giờ được công khai."
                    },
                    {
                        "en": "Can you make yourself understood in Russian?",
                        "vi": "Bạn có thể hiểu mình bằng tiếng Nga không?"
                    },
                    {
                        "en": "She couldn't make herself heard above the noise of the traffic.",
                        "vi": "Cô không thể làm cho mình nghe thấy tiếng ồn ào của xe cộ."
                    },
                    {
                        "en": "The terrorists made it known that tourists would be targeted.",
                        "vi": "Những kẻ khủng bố đã biết rằng khách du lịch sẽ là mục tiêu."
                    },
                    {
                        "en": "The company may make targets difficult or impossible to achieve.",
                        "vi": "Công ty có thể thực hiện các mục tiêu khó hoặc không thể đạt được."
                    },
                    {
                        "en": "Technology has made it possible to move many jobs away from high-cost locations.",
                        "vi": "Công nghệ đã làm cho nó có thể di chuyển nhiều công việc khỏi các vị trí chi phí cao."
                    }
                ]
            },
            {
                "define": {
                    "en": "to cause somebody/something to do something",
                    "vi": "để khiến ai đó / điều gì đó làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "She always makes me laugh.",
                        "vi": "Cô ấy luôn làm tôi cười."
                    },
                    {
                        "en": "This dress makes me look fat.",
                        "vi": "Chiếc váy này khiến tôi trông béo hơn."
                    },
                    {
                        "en": "What makes you say that (= why do you think so)?",
                        "vi": "Điều gì khiến bạn nói như vậy (= tại sao bạn lại nghĩ như vậy)?"
                    },
                    {
                        "en": "Nothing will make me change my mind.",
                        "vi": "Sẽ không có gì khiến tôi thay đổi suy nghĩ."
                    },
                    {
                        "en": "We were made to feel extremely welcome.",
                        "vi": "Chúng tôi đã được thực hiện để cảm thấy vô cùng chào đón."
                    }
                ]
            },
            {
                "define": {
                    "en": "to cause somebody/something to be or become a particular kind of thing or person",
                    "vi": "khiến ai đó / điều gì đó trở thành hoặc trở thành một loại vật hoặc người cụ thể"
                },
                "examples": [
                    {
                        "en": "make something of somebody/something This isn't very important—I don't want to make an issue of it.",
                        "vi": "làm một cái gì đó của ai đó / cái gì đó Điều này không quan trọng lắm — tôi không muốn đặt vấn đề về nó."
                    },
                    {
                        "en": "Don't make a habit of it.",
                        "vi": "Đừng tạo thói quen cho nó."
                    },
                    {
                        "en": "You've made a terrible mess of this job.",
                        "vi": "Bạn đã thực hiện một mớ hỗn độn khủng khiếp của công việc này."
                    },
                    {
                        "en": "It's important to try and make something of (= achieve something in) your life.",
                        "vi": "Điều quan trọng là bạn phải cố gắng đạt được điều gì đó (= đạt được điều gì đó trong cuộc đời mình)."
                    },
                    {
                        "en": "We'll make a tennis player of you yet.",
                        "vi": "Chúng tôi sẽ trở thành một vận động viên quần vợt của bạn."
                    },
                    {
                        "en": "make something + noun I made painting the house my project for the summer.",
                        "vi": "make something + danh từ I made sơn the house my project for the summer."
                    },
                    {
                        "en": "She made it her business to find out who was responsible.",
                        "vi": "Cô ấy biến nó thành công việc của mình để tìm ra ai là người chịu trách nhiệm."
                    },
                    {
                        "en": "These improvements will make the city a better place to live.",
                        "vi": "Những cải tiến này sẽ làm cho thành phố trở thành một nơi tốt hơn để sống."
                    },
                    {
                        "en": "She 's made her firm a success.",
                        "vi": "Cô ấy đã làm cho công ty của cô ấy thành công."
                    }
                ]
            },
            {
                "define": {
                    "en": "to arrange a bed so that it is neat and ready for use",
                    "vi": "sắp xếp giường sao cho gọn gàng và sẵn sàng sử dụng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to decide, guess, etc. something",
                    "vi": "để quyết định, đoán, v.v."
                },
                "examples": [
                    {
                        "en": "Come on! It's time we made a start.",
                        "vi": "Cố lên! Đã đến lúc chúng ta bắt đầu."
                    },
                    {
                        "en": "The plane was forced to make an emergency landing because of bad weather.",
                        "vi": "Máy bay buộc phải hạ cánh khẩn cấp vì thời tiết xấu."
                    }
                ]
            },
            {
                "define": {
                    "en": "to force somebody to do something",
                    "vi": "buộc ai đó làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "make somebody do something They made me repeat the whole story.",
                        "vi": "khiến ai đó làm điều gì đó Họ đã bắt tôi phải lặp lại toàn bộ câu chuyện."
                    },
                    {
                        "en": "be made to do something She must be made to comply with the rules.",
                        "vi": "được thực hiện để làm điều gì đó Cô ấy phải được thực hiện để tuân thủ các quy tắc."
                    },
                    {
                        "en": "make somebody He never cleans his room and his mother never tries to make him.",
                        "vi": "làm cho ai đó Anh ấy không bao giờ dọn dẹp phòng của mình và mẹ anh ấy không bao giờ cố gắng làm cho anh ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to represent somebody/something as being or doing something",
                    "vi": "đại diện cho ai đó / cái gì đó đang tồn tại hoặc đang làm gì đó"
                },
                "examples": [
                    {
                        "en": "make somebody/something + adj. You've made my nose too big (= for example in a drawing).",
                        "vi": "làm cho ai đó / cái gì đó + adj. Bạn đã làm cho mũi của tôi quá to (= ví dụ trong một bức vẽ)."
                    },
                    {
                        "en": "make somebody/something + noun He makes King Lear a truly tragic figure.",
                        "vi": "làm cho ai đó / cái gì đó + danh từ Anh ấy khiến King Lear trở thành một nhân vật thực sự bi thảm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to elect or choose somebody as something",
                    "vi": "bầu hoặc chọn ai đó như một cái gì đó"
                },
                "examples": [
                    {
                        "en": "She made him her assistant.",
                        "vi": "Cô ấy làm trợ lý cho anh ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to become or develop into something; to be suitable for something",
                    "vi": "để trở thành hoặc phát triển thành một cái gì đó; để phù hợp với một cái gì đó"
                },
                "examples": [
                    {
                        "en": "She would have made an excellent teacher.",
                        "vi": "Cô ấy sẽ trở thành một giáo viên xuất sắc."
                    },
                    {
                        "en": "This room would make a nice office.",
                        "vi": "Căn phòng này sẽ trở thành một văn phòng đẹp."
                    }
                ]
            },
            {
                "define": {
                    "en": "to add up to or equal something",
                    "vi": "để thêm vào hoặc bằng một cái gì đó"
                },
                "examples": [
                    {
                        "en": "5 and 7 make 12.",
                        "vi": "5 và 7 tạo thành 12."
                    },
                    {
                        "en": "A hundred cents make one euro.",
                        "vi": "Một trăm xu tạo ra một euro."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be a total of something",
                    "vi": "là tổng thể của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "That makes the third time he's failed his driving test!",
                        "vi": "Đó là lần thứ ba anh ta trượt bài kiểm tra lái xe của mình!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to earn or gain money",
                    "vi": "để kiếm hoặc đạt được tiền"
                },
                "examples": [
                    {
                        "en": "She makes $100 000 a year.",
                        "vi": "Cô ấy kiếm được 100.000 đô la một năm."
                    },
                    {
                        "en": "to make a profit/loss",
                        "vi": "để tạo ra lợi nhuận / thua lỗ"
                    },
                    {
                        "en": "We need to think of ways to make money.",
                        "vi": "Chúng ta cần nghĩ cách để kiếm tiền."
                    },
                    {
                        "en": "He made a fortune on the stock market.",
                        "vi": "Anh ấy đã kiếm được nhiều tiền trên thị trường chứng khoán."
                    },
                    {
                        "en": "He makes a living as a stand-up comic.",
                        "vi": "Anh ấy kiếm sống bằng nghề bán truyện tranh."
                    }
                ]
            },
            {
                "define": {
                    "en": "to think or calculate something to be something",
                    "vi": "suy nghĩ hoặc tính toán một cái gì đó để trở thành một cái gì đó"
                },
                "examples": [
                    {
                        "en": "What time do you make it?",
                        "vi": "Mấy giờ bạn thực hiện nó?"
                    },
                    {
                        "en": "I make that exactly $50.",
                        "vi": "Tôi kiếm được chính xác $ 50."
                    }
                ]
            },
            {
                "define": {
                    "en": "to manage to reach or go to a place or position",
                    "vi": "quản lý để tiếp cận hoặc đi đến một địa điểm hoặc vị trí"
                },
                "examples": [
                    {
                        "en": "Do you think we'll make Dover by 12?",
                        "vi": "Bạn có nghĩ rằng chúng ta sẽ sản xuất Dover trước 12 tuổi không?"
                    },
                    {
                        "en": "I'm sorry I couldn't make your party last night.",
                        "vi": "Tôi xin lỗi vì tôi không thể đến dự bữa tiệc của bạn tối qua."
                    },
                    {
                        "en": "He'll never make (= get a place in) the team.",
                        "vi": "Anh ấy sẽ không bao giờ (= có được một vị trí trong) đội."
                    },
                    {
                        "en": "The story made (= appeared on) the front pages of the national newspapers.",
                        "vi": "Câu chuyện đã (= xuất hiện trên) trang nhất của các tờ báo quốc gia."
                    },
                    {
                        "en": "We just managed to make the deadline (= to finish something in time).",
                        "vi": "Chúng tôi vừa xoay sở để thực hiện đúng thời hạn (= hoàn thành việc gì đó trong thời gian)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to cause something to be a success",
                    "vi": "để gây ra một cái gì đó thành công"
                },
                "examples": [
                    {
                        "en": "Good wine can make a meal.",
                        "vi": "Rượu ngon có thể làm một bữa ăn."
                    },
                    {
                        "en": "The news really made my day.",
                        "vi": "Tin tức thực sự làm cho ngày của tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make a movement that makes it seem as if you are just going to do something",
                    "vi": "để thực hiện một chuyển động khiến bạn có vẻ như sắp làm một việc gì đó"
                },
                "examples": [
                    {
                        "en": "He made as if to speak.",
                        "vi": "Anh ấy làm như thể để nói."
                    }
                ]
            },
            {
                "define": {
                    "en": "to manage with something that is not really good enough",
                    "vi": "quản lý với một cái gì đó không thực sự đủ tốt"
                },
                "examples": [
                    {
                        "en": "We were in a hurry so we had to make do with a quick snack.",
                        "vi": "Chúng tôi rất vội nên phải làm một bữa ăn nhanh."
                    }
                ]
            },
            {
                "define": {
                    "en": "to become rich and successful",
                    "vi": "trở nên giàu có và thành công"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to pay for, replace or repair something that has been lost or damaged",
                    "vi": "để thanh toán, thay thế hoặc sửa chữa một cái gì đó đã bị mất hoặc bị hư hỏng"
                },
                "examples": [
                    {
                        "en": "She promised to make good the damage.",
                        "vi": "Cô ấy hứa sẽ khắc phục thiệt hại."
                    }
                ]
            },
            {
                "define": {
                    "en": "to do something that you have promised, threatened, etc. to do",
                    "vi": "để làm điều gì đó mà bạn đã hứa, đã đe dọa, v.v. để làm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be successful in your career",
                    "vi": "để thành công trong sự nghiệp của bạn"
                },
                "examples": [
                    {
                        "en": "He never really made it as an actor.",
                        "vi": "Anh ấy chưa bao giờ thực sự thành công với tư cách là một diễn viên."
                    }
                ]
            },
            {
                "define": {
                    "en": "to succeed in reaching a place in time, especially when this is difficult",
                    "vi": "để thành công trong việc đến một địa điểm đúng lúc, đặc biệt là khi điều này khó khăn"
                },
                "examples": [
                    {
                        "en": "The flight leaves in twenty minutes—we'll never make it.",
                        "vi": "Chuyến bay sẽ khởi hành sau hai mươi phút nữa - chúng tôi sẽ không bao giờ bay kịp."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be able to be present at a place",
                    "vi": "để có thể có mặt tại một nơi"
                },
                "examples": [
                    {
                        "en": "I'm sorry I won't be able to make it (= for example, to a party) on Saturday.",
                        "vi": "Tôi xin lỗi vì tôi sẽ không thể đến dự (= ví dụ: tham dự một bữa tiệc) vào thứ Bảy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to survive after a serious illness or accident; to deal successfully with a difficult experience",
                    "vi": "để tồn tại sau một căn bệnh nghiêm trọng hoặc tai nạn; để đối phó thành công với một trải nghiệm khó khăn"
                },
                "examples": [
                    {
                        "en": "The doctors think he's going to make it.",
                        "vi": "Các bác sĩ nghĩ rằng anh ấy sẽ làm được."
                    },
                    {
                        "en": "make it through something I don't know how I made it through the week.",
                        "vi": "vượt qua điều gì đó mà tôi không biết mình đã làm được như thế nào trong tuần."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have sex with somebody",
                    "vi": "làm tình với ai đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to pretend to be, know or have something in order to impress people",
                    "vi": "giả vờ là, biết hoặc có điều gì đó để gây ấn tượng với mọi người"
                },
                "examples": [
                    {
                        "en": "He makes like he's the greatest actor of all time.",
                        "vi": "Anh ấy làm như thể anh ấy là diễn viên vĩ đại nhất mọi thời đại."
                    }
                ]
            },
            {
                "define": {
                    "en": "to gain as much advantage, pleasure, etc. as you can from somebody/something",
                    "vi": "để đạt được nhiều lợi thế, niềm vui, v.v. bạn có thể từ ai đó / điều gì đó"
                },
                "examples": [
                    {
                        "en": "It's my first trip abroad so I'm going to make the most of it.",
                        "vi": "Đây là chuyến đi nước ngoài đầu tiên của tôi nên tôi sẽ tận dụng tối đa nó."
                    },
                    {
                        "en": "She doesn't know how to make the most of herself (= make herself appear in the best possible way).",
                        "vi": "Cô ấy không biết cách tận dụng tối đa bản thân (= khiến bản thân xuất hiện theo cách tốt nhất có thể)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to treat something/somebody as very important",
                    "vi": "coi một cái gì đó / ai đó là rất quan trọng"
                },
                "examples": [
                    {
                        "en": "He always makes much of his humble origins.",
                        "vi": "Anh ấy luôn tạo ra nhiều nguồn gốc khiêm tốn của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be the thing that makes somebody/something either a success or a failure",
                    "vi": "trở thành thứ khiến ai đó / điều gì đó thành công hay thất bại"
                },
                "examples": [
                    {
                        "en": "This movie will make or break him as a director.",
                        "vi": "Bộ phim này sẽ làm nên hoặc phá vỡ anh ấy với tư cách là một đạo diễn."
                    },
                    {
                        "en": "It's make-or-break time for the company.",
                        "vi": "Đó là thời gian nghỉ ngơi của công ty."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be successful in your life",
                    "vi": "để thành công trong cuộc sống của bạn"
                },
                "examples": [
                    {
                        "en": "I wanted to study hard and really make something of myself.",
                        "vi": "Tôi muốn học tập chăm chỉ và thực sự tạo ra một cái gì đó cho riêng mình."
                    }
                ]
            }
        ]
    },
    {
        "id": "009430c342e842ce872c64d88989760f",
        "word": "on the mend",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/mend/",
            "us": "/mend/"
        },
        "nearby": [
            {
                "word": "Mencap",
                "pos": ""
            },
            {
                "word": "mend",
                "pos": "verb"
            },
            {
                "word": "mend",
                "pos": "noun"
            },
            {
                "word": "mendacious",
                "pos": "adjective"
            },
            {
                "word": "mendacity",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "getting better after an illness or injury; improving after a difficult situation",
                    "vi": "khỏe hơn sau khi bị bệnh hoặc chấn thương; cải thiện sau một tình huống khó khăn"
                },
                "examples": [
                    {
                        "en": "My leg is definitely on the mend now.",
                        "vi": "Chân của tôi chắc chắn đã được chữa lành ngay bây giờ."
                    },
                    {
                        "en": "Does he believe the economy's really on the mend?",
                        "vi": "Anh ta có tin rằng nền kinh tế đang thực sự ổn định?"
                    },
                    {
                        "en": "They’ve been to see a counsellor and their relationship seems to be on the mend.",
                        "vi": "Họ đã đến gặp một cố vấn và mối quan hệ của họ dường như đang được hàn gắn."
                    }
                ]
            }
        ]
    },
    {
        "id": "50731d53074f4b2289cd40941dd25155",
        "word": "on your feet",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/fʊt/",
            "us": "/fʊt/"
        },
        "nearby": [
            {
                "word": "fool's paradise",
                "pos": "noun"
            },
            {
                "word": "foosball",
                "pos": "noun"
            },
            {
                "word": "foot",
                "pos": "noun"
            },
            {
                "word": "Michael Foot",
                "pos": ""
            },
            {
                "word": "foot",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the lowest part of the leg, below the ankle, on which a person or an animal stands",
                    "vi": "phần thấp nhất của chân, bên dưới mắt cá chân, nơi người hoặc động vật đứng"
                },
                "examples": [
                    {
                        "en": "My feet are aching.",
                        "vi": "Chân tôi đang đau nhức."
                    },
                    {
                        "en": "She kicked the ball with her right foot.",
                        "vi": "Cô đá bóng bằng chân phải."
                    },
                    {
                        "en": "He's broken several bones in his left foot.",
                        "vi": "Anh ấy bị gãy nhiều xương ở bàn chân trái."
                    },
                    {
                        "en": "The whole audience rose to its feet (= stood up) and cheered.",
                        "vi": "Toàn bộ khán giả đứng dậy (= đứng lên) và cổ vũ."
                    },
                    {
                        "en": "to leap/jump/spring to your feet (= to stand up quickly and easily)",
                        "vi": "nhảy / nhảy / đứng dậy (= đứng lên nhanh chóng và dễ dàng)"
                    },
                    {
                        "en": "to scramble/struggle/stagger to your feet (= to stand up slowly and with difficulty)",
                        "vi": "loạng choạng / vùng vẫy / loạng choạng đứng dậy (= đứng lên chậm chạp và khó khăn)"
                    },
                    {
                        "en": "on foot We came on foot (= we walked).",
                        "vi": "on foot We came on foot (= chúng tôi đã đi bộ)."
                    },
                    {
                        "en": "on your feet I've been on my feet (= standing or walking around) all day.",
                        "vi": "trên đôi chân của bạn Tôi đã đi trên đôi chân của mình (= đứng hoặc đi vòng quanh) cả ngày."
                    },
                    {
                        "en": "Come on lads—on your feet and do some work!",
                        "vi": "Nào các bạn - hãy đứng vững và làm một số công việc!"
                    },
                    {
                        "en": "walking around the house in bare feet (= not wearing shoes or socks)",
                        "vi": "đi lại trong nhà bằng chân trần (= không đi giày hoặc tất)"
                    },
                    {
                        "en": "We were stamping our feet (= hitting them on the ground) to keep warm.",
                        "vi": "Chúng tôi đang giậm chân (= đập xuống đất) để giữ ấm."
                    },
                    {
                        "en": "Please wipe your feet (= your shoes) on the mat.",
                        "vi": "Hãy lau chân (= giày của bạn) trên tấm thảm."
                    },
                    {
                        "en": "The hot sand burned the soles of my feet.",
                        "vi": "Cát nóng bỏng lòng bàn chân tôi."
                    },
                    {
                        "en": "He is currently resting a foot injury.",
                        "vi": "Hiện anh ấy đang phải nghỉ ngơi vì chấn thương bàn chân."
                    },
                    {
                        "en": "a foot pump (= operated using your foot, not your hand)",
                        "vi": "một máy bơm chân (= hoạt động bằng chân của bạn, không phải tay của bạn)"
                    },
                    {
                        "en": "a foot passenger (= one who travels on a ferry without a car)",
                        "vi": "một hành khách đi bộ (= một người đi trên phà mà không có ô tô)"
                    }
                ]
            },
            {
                "define": {
                    "en": "having or using the type or number of foot/feet mentioned",
                    "vi": "có hoặc sử dụng loại hoặc số lượng foot / foot được đề cập"
                },
                "examples": [
                    {
                        "en": "bare-footed",
                        "vi": "chân trần"
                    },
                    {
                        "en": "four-footed",
                        "vi": "bốn chân"
                    },
                    {
                        "en": "a left-footed shot into the corner",
                        "vi": "một cú sút chân trái vào góc"
                    }
                ]
            },
            {
                "define": {
                    "en": "the part of a sock, stocking, etc. that covers the foot",
                    "vi": "phần của một chiếc tất, tất, v.v. bao phủ bàn chân"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a unit for measuring length equal to 12 inches or 30.48 centimetres",
                    "vi": "một đơn vị để đo chiều dài bằng 12 inch hoặc 30,48 cm"
                },
                "examples": [
                    {
                        "en": "a six-foot high wall",
                        "vi": "một bức tường cao sáu foot"
                    },
                    {
                        "en": "We're flying at 35 000 feet.",
                        "vi": "Chúng tôi đang bay ở độ cao 35 000 feet."
                    },
                    {
                        "en": "‘How tall are you?’ ‘Five foot nine’ (= five feet and nine inches).",
                        "vi": "Bạn cao bao nhiêu?' 'Five foot nine' (= năm bộ chín inch)."
                    },
                    {
                        "en": "foot of something The town was under several feet of water (= the water was several feet deep).",
                        "vi": "foot of something Thị trấn đã nằm dưới vài feet nước (= nước sâu vài feet)."
                    },
                    {
                        "en": "We had over a foot of snow in a few hours (= the snow was over a foot deep).",
                        "vi": "Chúng tôi đã có tuyết rơi dày hơn một mét trong vài giờ nữa (= tuyết sâu hơn một mét)."
                    },
                    {
                        "en": "The store has 600 square feet of retail space.",
                        "vi": "Cửa hàng có diện tích bán lẻ rộng 600 mét vuông."
                    }
                ]
            },
            {
                "define": {
                    "en": "the lowest part of something; the base or bottom of something",
                    "vi": "Phần thấp nhất của cái gì đó; cơ sở hoặc đáy của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "The city now reaches to the foot of the surrounding mountains.",
                        "vi": "Thành phố bây giờ vươn tới chân những ngọn núi xung quanh."
                    },
                    {
                        "en": "At the foot of the stairs she turned to face him.",
                        "vi": "Đến chân cầu thang cô quay mặt về phía anh."
                    },
                    {
                        "en": "See the foot of this page for a partial bibliography.",
                        "vi": "Xem phần cuối của trang này để biết một phần thư mục."
                    },
                    {
                        "en": "(British English) The team remains stuck at the foot of the table (= with fewer points than all the other teams).",
                        "vi": "(Tiếng Anh Anh) Đội vẫn đứng cuối bảng (= với ít điểm hơn tất cả các đội còn lại)."
                    }
                ]
            },
            {
                "define": {
                    "en": "the further or lower end of something",
                    "vi": "kết thúc xa hơn hoặc thấp hơn của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "The nurse hung a chart at the foot of the bed (= the part of the bed where your feet normally are when you are lying in it).",
                        "vi": "Y tá treo một biểu đồ dưới chân giường (= phần giường mà chân bạn thường đặt khi bạn nằm trong đó)."
                    },
                    {
                        "en": "He sat at the foot of the table.",
                        "vi": "Anh ngồi dưới chân bàn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a unit of rhythm in a line of poetry containing one stressed syllable and one or more syllables without stress. Each of the four divisions in the following line is a foot",
                    "vi": "một đơn vị nhịp điệu trong một dòng thơ có một âm tiết được nhấn trọng âm và một hoặc nhiều âm tiết không có trọng âm. Mỗi phần trong số bốn phần ở dòng sau là một chân"
                },
                "examples": [
                    {
                        "en": "For men / may come / and men / may go.",
                        "vi": "Đối với đàn ông / có thể đến / và đàn ông / có thể đi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be extremely busy; to have too many things to do",
                    "vi": "cực kỳ bận rộn; có quá nhiều việc phải làm"
                },
                "examples": [
                    {
                        "en": "Weekdays are slow in the restaurant, but at weekends the staff are rushed off their feet.",
                        "vi": "Các ngày trong tuần nhà hàng chậm, nhưng cuối tuần thì nhân viên phục vụ vội vã."
                    }
                ]
            },
            {
                "define": {
                    "en": "to tie somebody’s hands and feet together so that they cannot move or escape",
                    "vi": "trói tay và chân của ai đó lại với nhau để họ không thể di chuyển hoặc trốn thoát"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to prevent somebody from doing what they want by creating rules, limits, etc.",
                    "vi": "để ngăn ai đó làm những gì họ muốn bằng cách tạo ra các quy tắc, giới hạn, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to say that a situation has changed so that somebody now has power or authority over the person who used to have power or authority over them",
                    "vi": "được sử dụng để nói rằng một tình huống đã thay đổi để ai đó bây giờ có quyền lực hoặc quyền hạn đối với người đã từng có quyền lực hoặc quyền hạn đối với họ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to suddenly cause somebody’s idea or plan to fail by doing something to stop them from continuing with it",
                    "vi": "đột nhiên khiến ý tưởng hoặc kế hoạch của ai đó thất bại bằng cách làm điều gì đó để ngăn họ tiếp tục với nó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be deliberately slow in doing something or in making a decision",
                    "vi": "cố tình làm chậm trong việc làm gì đó hoặc trong việc đưa ra quyết định"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be lucky in finding yourself in a good situation, or in getting out of a difficult situation",
                    "vi": "may mắn khi thấy mình trong một hoàn cảnh tốt, hoặc thoát khỏi một hoàn cảnh khó khăn"
                },
                "examples": [
                    {
                        "en": "You landed on your feet, getting such a well-paid job with so little experience.",
                        "vi": "Bạn đã hạ cánh trên đôi chân của mình, nhận được một công việc được trả lương cao như vậy với quá ít kinh nghiệm."
                    },
                    {
                        "en": "Jim’s always getting himself in trouble, but he usually seems to fall on his feet.",
                        "vi": "Jim luôn gặp rắc rối với bản thân, nhưng anh ấy thường có vẻ như muốn ngã trên đôi chân của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "with your feet touching the ground before any other part of your body",
                    "vi": "với bàn chân của bạn chạm đất trước bất kỳ bộ phận nào khác của cơ thể"
                },
                "examples": [
                    {
                        "en": "He landed feet first.",
                        "vi": "Anh ấy tiếp đất bằng chân trước."
                    }
                ]
            },
            {
                "define": {
                    "en": "if you leave a place feet first, you are carried out after you are dead",
                    "vi": "nếu bạn rời khỏi một vị trí chân trước, bạn sẽ được thực hiện sau khi bạn chết"
                },
                "examples": [
                    {
                        "en": "You'll have to carry me out feet first!",
                        "vi": "Trước tiên bạn sẽ phải bế tôi ra!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to become able to act independently and with confidence",
                    "vi": "để có thể hành động độc lập và tự tin"
                },
                "examples": [
                    {
                        "en": "I only recently joined the firm so I'm still finding my feet.",
                        "vi": "Tôi chỉ mới gia nhập công ty gần đây nên tôi vẫn đang tìm kiếm đôi chân của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "a strong way of saying that you disagree completely with what has just been said",
                    "vi": "một cách mạnh mẽ để nói rằng bạn hoàn toàn không đồng ý với những gì vừa được nói"
                },
                "examples": [
                    {
                        "en": "‘Ian can't come because he's tired.’ ‘Tired my foot! Lazy more like!’",
                        "vi": "Ian không thể đến vì anh ấy mệt.' 'Mệt mỏi chân tôi! Lười thích hơn! '"
                    }
                ]
            },
            {
                "define": {
                    "en": "covering your whole body",
                    "vi": "che toàn bộ cơ thể của bạn"
                },
                "examples": [
                    {
                        "en": "We were covered from head to foot in mud.",
                        "vi": "Chúng tôi ngập từ đầu đến chân trong bùn."
                    },
                    {
                        "en": "She was dressed from head to toe in red.",
                        "vi": "Cô ấy mặc đồ đỏ từ đầu đến chân."
                    }
                ]
            },
            {
                "define": {
                    "en": "to suddenly become nervous about doing something that you had planned to do",
                    "vi": "đột nhiên trở nên lo lắng về việc làm điều gì đó mà bạn đã dự định làm"
                },
                "examples": [
                    {
                        "en": "He was going to ask her but he got cold feet and said nothing.",
                        "vi": "Anh định hỏi cô nhưng anh lạnh chân và không nói gì."
                    }
                ]
            },
            {
                "define": {
                    "en": "to start doing something that is new for you",
                    "vi": "để bắt đầu làm điều gì đó mới mẻ đối với bạn"
                },
                "examples": [
                    {
                        "en": "At that time he was a young actor, just getting his feet wet.",
                        "vi": "Lúc đó anh còn là một diễn viên trẻ, mới chân ướt chân ráo vào nghề."
                    }
                ]
            },
            {
                "define": {
                    "en": "to manage to enter an organization, a field of business, etc. that could bring you success",
                    "vi": "quản lý để gia nhập một tổ chức, một lĩnh vực kinh doanh, v.v. có thể mang lại thành công cho bạn"
                },
                "examples": [
                    {
                        "en": "I always wanted to work in TV but it took me two years to get a foot in the door.",
                        "vi": "Tôi luôn muốn làm việc trong lĩnh vực truyền hình nhưng tôi đã mất hai năm để có được một chân vào cửa."
                    }
                ]
            },
            {
                "define": {
                    "en": "to want to travel or move to a different place; to want to do something different",
                    "vi": "muốn đi du lịch hoặc chuyển đến một nơi khác; muốn làm điều gì đó khác biệt"
                },
                "examples": [
                    {
                        "en": "After a few years in one place, I get itchy feet.",
                        "vi": "Sau vài năm nằm một chỗ, tôi bị ngứa chân."
                    }
                ]
            },
            {
                "define": {
                    "en": "to start a relationship well/badly",
                    "vi": "để bắt đầu một mối quan hệ tốt / xấu"
                },
                "examples": [
                    {
                        "en": "I seem to have got off on the wrong foot with the new boss.",
                        "vi": "Tôi dường như đã đi nhầm chân với ông chủ mới."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have a fault or weakness in your character",
                    "vi": "có lỗi hoặc điểm yếu trong tính cách của bạn"
                },
                "examples": [
                    {
                        "en": "When the actor was imprisoned for drug offences, his fans were upset to find that their hero had feet of clay.",
                        "vi": "Khi nam diễn viên bị bỏ tù vì tội ma túy, người hâm mộ của anh đã rất buồn khi phát hiện ra rằng người hùng của họ có đôi chân bằng đất sét."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have a sensible and realistic attitude to life",
                    "vi": "có thái độ sống hợp lý và thực tế"
                },
                "examples": [
                    {
                        "en": "In spite of his overnight stardom he still manages to keep his feet on the ground.",
                        "vi": "Bất chấp ngôi sao đã qua đêm, anh ấy vẫn cố gắng giữ được đôi chân của mình trên mặt đất."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be involved in or connected with two different groups, especially ones that oppose each other",
                    "vi": "tham gia hoặc kết nối với hai nhóm khác nhau, đặc biệt là những nhóm đối lập nhau"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be so old or ill that you are not likely to live much longer",
                    "vi": "già hoặc ốm đến nỗi bạn không có khả năng sống lâu hơn nữa"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be very awkward in your movements, especially when you are dancing or playing a sport",
                    "vi": "rất lúng túng trong các chuyển động của bạn, đặc biệt là khi bạn đang khiêu vũ hoặc chơi một môn thể thao"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be very successful and admired",
                    "vi": "rất thành công và được ngưỡng mộ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "wearing socks or stockings but not shoes",
                    "vi": "đi tất hoặc tất chân nhưng không đi giày"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to not delay in getting things done",
                    "vi": "để không bị trì hoãn trong việc hoàn thành công việc"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "(to put somebody) at a disadvantage or in difficulty",
                    "vi": "(đặt ai đó) vào tình thế bất lợi hoặc gặp khó khăn"
                },
                "examples": [
                    {
                        "en": "Advances in drone technology have caught lawmakers on the back foot.",
                        "vi": "Những tiến bộ trong công nghệ bay không người lái đã khiến các nhà lập pháp phải chú ý."
                    },
                    {
                        "en": "The side that’s on the back foot, struggling to defend, will usually give away more penalties.",
                        "vi": "Bên nào thuận chân sau, cố gắng phòng ngự, thường sẽ được hưởng nhiều quả phạt đền hơn."
                    },
                    {
                        "en": "We'd like to put the fossil fuel industry on the back foot.",
                        "vi": "Chúng tôi muốn đưa ngành công nghiệp nhiên liệu hóa thạch đi sau."
                    }
                ]
            },
            {
                "define": {
                    "en": "completely well or in a normal state again after an illness or a time of trouble",
                    "vi": "hoàn toàn khỏe mạnh hoặc ở trạng thái bình thường trở lại sau khi bị bệnh hoặc thời gian gặp khó khăn"
                },
                "examples": [
                    {
                        "en": "Sue's back on her feet again after her operation.",
                        "vi": "Sue đã bình phục trở lại sau ca phẫu thuật."
                    },
                    {
                        "en": "The new chairman hopes to get the company back on its feet within six months.",
                        "vi": "Vị chủ tịch mới hy vọng sẽ đưa công ty đứng vững trở lại trong vòng sáu tháng."
                    }
                ]
            },
            {
                "define": {
                    "en": "at an advantage",
                    "vi": "có lợi thế"
                },
                "examples": [
                    {
                        "en": "They allowed the home side to get on the front foot right at the start.",
                        "vi": "Họ đã để đội chủ nhà lấn lướt ngay từ đầu."
                    }
                ]
            },
            {
                "define": {
                    "en": "taking positive steps to achieve something",
                    "vi": "thực hiện các bước tích cực để đạt được điều gì đó"
                },
                "examples": [
                    {
                        "en": "He has been firmly on the front foot, calling for politicians and police to intervene.",
                        "vi": "Ông đã đứng vững trên bình diện trước, kêu gọi các chính trị gia và cảnh sát can thiệp."
                    }
                ]
            },
            {
                "define": {
                    "en": "a way of referring to children when somebody wants, or is going to have, a baby",
                    "vi": "một cách đề cập đến trẻ em khi ai đó muốn hoặc sắp có một em bé"
                },
                "examples": [
                    {
                        "en": "We can't wait to hear the patter of tiny feet.",
                        "vi": "Chúng tôi nóng lòng muốn nghe tiếng bàn chân nhỏ bé."
                    }
                ]
            },
            {
                "define": {
                    "en": "to take help or support away from somebody suddenly",
                    "vi": "bất ngờ nhận được sự giúp đỡ hoặc hỗ trợ từ một người nào đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to make a great effort to do something, especially if it is difficult or you are feeling tired",
                    "vi": "nỗ lực rất nhiều để làm một việc gì đó, đặc biệt nếu việc đó khó hoặc bạn đang cảm thấy mệt mỏi"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to sit down and relax, especially with your feet raised and supported",
                    "vi": "ngồi xuống và thư giãn, đặc biệt là với chân của bạn nâng lên và được hỗ trợ"
                },
                "examples": [
                    {
                        "en": "After a hard day's work, it's nice to get home and put your feet up.",
                        "vi": "Sau một ngày làm việc mệt mỏi, thật tuyệt khi trở về nhà và đứng dậy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be very strict in opposing what somebody wishes to do",
                    "vi": "rất nghiêm khắc trong việc phản đối những gì ai đó muốn làm"
                },
                "examples": [
                    {
                        "en": "You've got to put your foot down and make him stop seeing her.",
                        "vi": "Bạn phải đặt chân xuống và làm cho anh ta ngừng nhìn thấy cô ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to drive faster",
                    "vi": "lái xe nhanh hơn"
                },
                "examples": [
                    {
                        "en": "She put her foot down and roared past them.",
                        "vi": "Cô ấy đặt chân xuống và gầm lên qua họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to say or do something that upsets, offends or embarrasses somebody",
                    "vi": "nói hoặc làm điều gì đó khiến ai đó khó chịu, xúc phạm hoặc xấu hổ"
                },
                "examples": [
                    {
                        "en": "I really put my foot in it with Ella—I didn't know she'd split up with Tom.",
                        "vi": "Tôi thực sự đã đặt chân vào nó với Ella - Tôi không biết cô ấy sẽ chia tay với Tom."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make a mistake",
                    "vi": "phạm sai lầm"
                },
                "examples": [
                    {
                        "en": "In the last two games he has hardly put a foot wrong.",
                        "vi": "Trong hai trận gần đây, anh ấy hầu như không để sai một chân."
                    }
                ]
            },
            {
                "define": {
                    "en": "to enter or visit a place",
                    "vi": "để vào hoặc thăm một nơi"
                },
                "examples": [
                    {
                        "en": "the first man to set foot on the moon",
                        "vi": "người đầu tiên đặt chân lên mặt trăng"
                    },
                    {
                        "en": "I vowed never to set foot in the place again.",
                        "vi": "Tôi đã thề sẽ không bao giờ đặt chân đến nơi nữa."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody/something independent or successful",
                    "vi": "để làm cho ai đó / cái gì đó độc lập hoặc thành công"
                },
                "examples": [
                    {
                        "en": "His business sense helped set the club on its feet again.",
                        "vi": "Ý thức kinh doanh của anh ấy đã giúp câu lạc bộ đứng vững trở lại."
                    }
                ]
            },
            {
                "define": {
                    "en": "to do or say something that will cause you a lot of trouble or harm, especially when you are trying to get an advantage for yourself",
                    "vi": "làm hoặc nói điều gì đó sẽ gây ra cho bạn nhiều rắc rối hoặc tổn hại, đặc biệt là khi bạn đang cố gắng đạt được lợi thế cho mình"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to admire somebody very much, especially a teacher or somebody from whom you try to learn",
                    "vi": "ngưỡng mộ ai đó rất nhiều, đặc biệt là một giáo viên hoặc ai đó mà bạn cố gắng học hỏi"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be independent and able to take care of yourself",
                    "vi": "độc lập và có thể tự chăm sóc bản thân"
                },
                "examples": [
                    {
                        "en": "When his parents died he had to learn to stand on his own two feet.",
                        "vi": "Khi cha mẹ mất, anh phải học cách tự đứng bằng hai chân của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody fall suddenly and deeply in love with you",
                    "vi": "để khiến ai đó bất ngờ yêu bạn và yêu sâu sắc"
                },
                "examples": [
                    {
                        "en": "She’s waiting for some hero to come and sweep her off her feet.",
                        "vi": "Cô ấy đang đợi một anh hùng nào đó đến và quét sạch chân cô ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to sit down and rest, especially when you are tired",
                    "vi": "ngồi xuống và nghỉ ngơi, đặc biệt là khi bạn mệt mỏi"
                },
                "examples": [
                    {
                        "en": "Come and sit down and take the weight off your feet for a while.",
                        "vi": "Hãy đến và ngồi xuống và lấy tạ ra khỏi chân của bạn một lúc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be able to think and react to things very quickly and effectively without any preparation",
                    "vi": "để có thể suy nghĩ và phản ứng với mọi thứ rất nhanh chóng và hiệu quả mà không cần bất kỳ sự chuẩn bị nào"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "in the way; stopping you from working, etc.",
                    "vi": "cản đường; ngăn bạn làm việc, v.v."
                },
                "examples": [
                    {
                        "en": "I don't want you kids under my feet while I'm cooking.",
                        "vi": "Tôi không muốn các bạn ở dưới chân tôi khi tôi đang nấu ăn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to show what you think about something by going or not going somewhere",
                    "vi": "để thể hiện những gì bạn nghĩ về điều gì đó bằng cách đi hoặc không đi đâu đó"
                },
                "examples": [
                    {
                        "en": "Shoppers voted with their feet and avoided the store.",
                        "vi": "Người mua hàng đã bỏ phiếu bằng chân và tránh cửa hàng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to take care of somebody’s needs so well that they do not have to do anything for themselves",
                    "vi": "chăm sóc nhu cầu của ai đó thật tốt để họ không phải làm bất cứ điều gì cho bản thân"
                },
                "examples": [
                    {
                        "en": "He seems to expect me to wait on him hand and foot.",
                        "vi": "Anh ta dường như mong đợi tôi chờ đợi anh ta bằng tay và chân."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody walk so far or so fast that they are very tired",
                    "vi": "khiến ai đó đi bộ xa hoặc nhanh đến mức họ rất mệt"
                },
                "examples": [
                    {
                        "en": "I hope I haven’t walked you off your feet.",
                        "vi": "Tôi hy vọng tôi đã không bỏ rơi bạn khỏi đôi chân của bạn."
                    }
                ]
            }
        ]
    },
    {
        "id": "e1dca4133db541c0a388590e3c63268e",
        "word": "post-operative",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌpəʊst ˈɒpərətɪv/",
            "us": "/ˌpəʊst ˈɑːpərətɪv/"
        },
        "nearby": [
            {
                "word": "post office",
                "pos": "noun"
            },
            {
                "word": "post office box",
                "pos": "noun"
            },
            {
                "word": "post-operative",
                "pos": "adjective"
            },
            {
                "word": "post-paid",
                "pos": "adjective"
            },
            {
                "word": "post-paid",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "connected with the period after a medical operation",
                    "vi": "kết nối với khoảng thời gian sau khi phẫu thuật y tế"
                },
                "examples": [
                    {
                        "en": "post-operative complications/pain/care",
                        "vi": "biến chứng sau phẫu thuật / đau / chăm sóc"
                    },
                    {
                        "en": "patients in the post-operative period",
                        "vi": "bệnh nhân trong thời kỳ hậu phẫu"
                    }
                ]
            }
        ]
    },
    {
        "id": "b6ff7ec5621d4e5497afcad130775082",
        "word": "pull through",
        "pos": "phrasal verb",
        "level": "c2",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "pullover",
                "pos": "noun"
            },
            {
                "word": "pull tab",
                "pos": "noun"
            },
            {
                "word": "pull through",
                "pos": "phrasal verb"
            },
            {
                "word": "pull together",
                "pos": "phrasal verb"
            },
            {
                "word": "pullulate",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to get better after a serious illness, operation, etc.",
                    "vi": "để khỏe hơn sau một trận ốm nặng, phẫu thuật, v.v."
                },
                "examples": [
                    {
                        "en": "The doctors think she will pull through.",
                        "vi": "Các bác sĩ nghĩ rằng cô ấy sẽ vượt qua được."
                    }
                ]
            },
            {
                "define": {
                    "en": "to succeed in doing something very difficult",
                    "vi": "để thành công khi làm một điều gì đó rất khó"
                },
                "examples": [
                    {
                        "en": "It's going to be tough but we'll pull through it together.",
                        "vi": "Sẽ rất khó khăn nhưng chúng ta sẽ cùng nhau vượt qua."
                    }
                ]
            },
            {
                "define": {
                    "en": "to help somebody get better after a serious illness, operation, etc.",
                    "vi": "để giúp ai đó khỏe hơn sau khi bị bệnh nặng, phẫu thuật, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to help somebody succeed in doing something very difficult",
                    "vi": "để giúp ai đó thành công trong việc làm một điều gì đó rất khó khăn"
                },
                "examples": [
                    {
                        "en": "I relied on my instincts to pull me through.",
                        "vi": "Tôi dựa vào bản năng của mình để kéo tôi vượt qua."
                    }
                ]
            }
        ]
    },
    {
        "id": "d90b7e109c714d3689373004900b2e76",
        "word": "rally",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈræli/",
            "us": "/ˈræli/"
        },
        "nearby": [
            {
                "word": "rallentando",
                "pos": "adverb"
            },
            {
                "word": "rally",
                "pos": "noun"
            },
            {
                "word": "rally",
                "pos": "verb"
            },
            {
                "word": "rally around",
                "pos": "phrasal verb"
            },
            {
                "word": "rallycross",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to come together or bring people together in order to help or support somebody/something",
                    "vi": "đến với nhau hoặc tập hợp mọi người lại với nhau để giúp đỡ hoặc hỗ trợ ai đó / điều gì đó"
                },
                "examples": [
                    {
                        "en": "rally around/behind somebody/something The cabinet rallied behind the Prime Minister.",
                        "vi": "tập hợp xung quanh / phía sau ai đó / cái gì đó Nội các tập hợp lại phía sau Thủ tướng."
                    },
                    {
                        "en": "rally to somebody/something Many national newspapers rallied to his support.",
                        "vi": "cuộc biểu tình với ai đó / cái gì đó Nhiều tờ báo quốc gia đã tập hợp để ủng hộ ông."
                    },
                    {
                        "en": "rally somebody/something They have rallied a great deal of support for their campaign.",
                        "vi": "tập hợp ai đó / cái gì đó Họ đã tập hợp rất nhiều sự ủng hộ cho chiến dịch của họ."
                    },
                    {
                        "en": "The country hastily rallied its defences.",
                        "vi": "Nước này vội vàng tăng cường phòng thủ."
                    },
                    {
                        "en": "rally somebody/something around/behind/to something The president must rally the country around a clear and credible goal.",
                        "vi": "tập hợp ai đó / cái gì đó xung quanh / phía sau / tới cái gì đó Tổng thống phải tập hợp đất nước xung quanh một mục tiêu rõ ràng và đáng tin cậy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to become healthier, stronger, etc. after a period of illness, weakness, etc.",
                    "vi": "để trở nên khỏe mạnh hơn, mạnh mẽ hơn, v.v. sau một thời gian ốm đau, suy nhược, v.v."
                },
                "examples": [
                    {
                        "en": "He never really rallied after the operation.",
                        "vi": "Anh ấy không bao giờ thực sự phục hồi sau cuộc phẫu thuật."
                    },
                    {
                        "en": "The champion rallied to win the second set 6–3.",
                        "vi": "Nhà vô địch vùng lên để giành chiến thắng trong set thứ hai với tỷ số 6–3."
                    }
                ]
            },
            {
                "define": {
                    "en": "to increase in value after falling in value",
                    "vi": "để tăng giá trị sau khi giảm giá trị"
                },
                "examples": [
                    {
                        "en": "The company's shares had rallied slightly by the close of trading.",
                        "vi": "Cổ phiếu của công ty đã tăng nhẹ vào cuối phiên giao dịch."
                    },
                    {
                        "en": "The pound rallied against the dollar.",
                        "vi": "Đồng bảng Anh tăng giá so với đồng đô la."
                    }
                ]
            }
        ]
    },
    {
        "id": "8d76aabcc7b74bddb9b421711a3345cd",
        "word": "recuperate",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/rɪˈkuːpəreɪt/",
            "us": "/rɪˈkuːpəreɪt/"
        },
        "nearby": [
            {
                "word": "rectum",
                "pos": "noun"
            },
            {
                "word": "recumbent",
                "pos": "adjective"
            },
            {
                "word": "recuperate",
                "pos": "verb"
            },
            {
                "word": "recuperation",
                "pos": "noun"
            },
            {
                "word": "recuperative",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to get back your health, strength or energy after being ill, tired, injured, etc.",
                    "vi": "để lấy lại sức khỏe, sức mạnh hoặc năng lượng của bạn sau khi bị ốm, mệt mỏi, chấn thương, v.v."
                },
                "examples": [
                    {
                        "en": "He's still recuperating from his operation.",
                        "vi": "Anh ấy vẫn đang hồi phục sau ca phẫu thuật của mình."
                    },
                    {
                        "en": "After an exhausting few weeks I needed some time to recuperate.",
                        "vi": "Sau một vài tuần mệt mỏi, tôi cần một thời gian để hồi phục."
                    }
                ]
            },
            {
                "define": {
                    "en": "to get back money that you have spent or lost",
                    "vi": "để lấy lại số tiền bạn đã tiêu hoặc bị mất"
                },
                "examples": [
                    {
                        "en": "He hoped to recuperate at least some of his losses.",
                        "vi": "Anh hy vọng có thể phục hồi ít nhất một số tổn thất của mình."
                    }
                ]
            }
        ]
    },
    {
        "id": "5b39e9d55b3d4d2db4132bdfe80ec953",
        "word": "recuperative",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/rɪˈkuːpərətɪv/",
            "us": "/rɪˈkuːpərətɪv/"
        },
        "nearby": [
            {
                "word": "recuperate",
                "pos": "verb"
            },
            {
                "word": "recuperation",
                "pos": "noun"
            },
            {
                "word": "recuperative",
                "pos": "adjective"
            },
            {
                "word": "recur",
                "pos": "verb"
            },
            {
                "word": "recurrence",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "helping you to get better after you have been ill, very tired, etc.",
                    "vi": "giúp bạn khỏe hơn sau khi bạn bị ốm, rất mệt mỏi, v.v."
                },
                "examples": [
                    {
                        "en": "the recuperative powers of a good night’s sleep",
                        "vi": "sức mạnh phục hồi của một đêm ngon giấc"
                    }
                ]
            }
        ]
    },
    {
        "id": "35dacc09f278426594a560eebdab4621",
        "word": "remission",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/rɪˈmɪʃn/",
            "us": "/rɪˈmɪʃn/"
        },
        "nearby": [
            {
                "word": "reminiscent",
                "pos": "adjective"
            },
            {
                "word": "remiss",
                "pos": "adjective"
            },
            {
                "word": "remission",
                "pos": "noun"
            },
            {
                "word": "remit",
                "pos": "noun"
            },
            {
                "word": "remit",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a period during which a serious illness improves for a time and the patient seems to get better",
                    "vi": "một thời gian mà bệnh nặng cải thiện trong một thời gian và bệnh nhân có vẻ khỏe hơn"
                },
                "examples": [
                    {
                        "en": "in remission The patient has been in remission for the past six months.",
                        "vi": "thuyên giảm Bệnh nhân đã thuyên giảm trong sáu tháng qua."
                    },
                    {
                        "en": "The symptoms reappeared after only a short remission.",
                        "vi": "Các triệu chứng xuất hiện trở lại chỉ sau một thời gian ngắn thuyên giảm."
                    },
                    {
                        "en": "a period of remission",
                        "vi": "một thời gian thuyên giảm"
                    }
                ]
            },
            {
                "define": {
                    "en": "a reduction in the amount of time somebody spends in prison, especially because they have behaved well",
                    "vi": "giảm thời gian ai đó ở trong tù, đặc biệt là vì họ đã cư xử tốt"
                },
                "examples": [
                    {
                        "en": "With remission for good behaviour, he could be out by the end of the year.",
                        "vi": "Với việc thuyên giảm hạnh kiểm tốt, anh ta có thể ra ngoài vào cuối năm nay."
                    },
                    {
                        "en": "She has been granted a remission of sentence.",
                        "vi": "Cô ấy đã được ân giảm bản án."
                    },
                    {
                        "en": "He lost two months’ remission after he attacked another prisoner.",
                        "vi": "Anh ta mất hai tháng thuyên giảm sau khi anh ta tấn công một tù nhân khác."
                    }
                ]
            },
            {
                "define": {
                    "en": "an act of reducing or cancelling the amount of money that somebody has to pay",
                    "vi": "một hành động giảm hoặc hủy bỏ số tiền mà ai đó phải trả"
                },
                "examples": [
                    {
                        "en": "New businesses may qualify for tax remission.",
                        "vi": "Các doanh nghiệp mới có thể đủ điều kiện để được miễn thuế."
                    },
                    {
                        "en": "There is a partial remission of fees for overseas students.",
                        "vi": "Miễn một phần học phí cho sinh viên nước ngoài."
                    }
                ]
            }
        ]
    }
]