[
    {
        "id": "f3d4e404def4459e983904dbb36c5d19",
        "word": "probably",
        "pos": "adverb",
        "level": "a1",
        "phonetic": {
            "uk": "/ˈprɒbəbli/",
            "us": "/ˈprɑːbəbli/"
        },
        "nearby": [
            {
                "word": "probable",
                "pos": "noun"
            },
            {
                "word": "probable cause",
                "pos": "noun"
            },
            {
                "word": "probably",
                "pos": "adverb"
            },
            {
                "word": "probate",
                "pos": "noun"
            },
            {
                "word": "probate",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "used to say that something is likely to happen or to be true",
                    "vi": "được sử dụng để nói rằng một cái gì đó có khả năng xảy ra hoặc là sự thật"
                },
                "examples": [
                    {
                        "en": "You're probably right.",
                        "vi": "Có lẽ bạn đúng."
                    },
                    {
                        "en": "I think that's probably true.",
                        "vi": "Tôi nghĩ điều đó có lẽ đúng."
                    },
                    {
                        "en": "It'll probably be OK.",
                        "vi": "Nó có thể sẽ ổn."
                    },
                    {
                        "en": "It was the best known and probably the most popular of her songs.",
                        "vi": "Đó là bài hát được biết đến nhiều nhất và có lẽ là bài hát nổi tiếng nhất của cô."
                    },
                    {
                        "en": "‘Is he going to be there?’ ‘Probably.’",
                        "vi": "Anh ấy sẽ ở đó?' 'Có lẽ.'"
                    },
                    {
                        "en": "‘I bet he's responsible for this mess.’ ‘Very probably.’",
                        "vi": "Tôi cá là anh ấy phải chịu trách nhiệm cho vụ lộn xộn này.' 'Rất có thể.'"
                    },
                    {
                        "en": "‘Do we need the car?’ ‘Probably not.’",
                        "vi": "Chúng ta có cần xe không?' 'Chắc là không.'"
                    },
                    {
                        "en": "As you probably know, I'm going to be changing jobs soon.",
                        "vi": "Như bạn có thể biết, tôi sẽ sớm thay đổi công việc."
                    },
                    {
                        "en": "You probably think I'm crazy for trusting him.",
                        "vi": "Chắc bạn nghĩ tôi thật điên rồ vì đã tin tưởng anh ấy."
                    },
                    {
                        "en": "The two cases are most probably connected.",
                        "vi": "Hai trường hợp có lẽ được kết nối nhiều nhất."
                    }
                ]
            }
        ]
    },
    {
        "id": "8847d9ea53934637bf4a984d0f1fcfdd",
        "word": "likely",
        "pos": "adjective",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈlaɪkli/",
            "us": "/ˈlaɪkli/"
        },
        "nearby": [
            {
                "word": "likeable",
                "pos": "adjective"
            },
            {
                "word": "likelihood",
                "pos": "noun"
            },
            {
                "word": "likely",
                "pos": "adjective"
            },
            {
                "word": "likely",
                "pos": "adverb"
            },
            {
                "word": "like-minded",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "having a good chance of happening or being something; probable or expected",
                    "vi": "có một cơ hội tốt để xảy ra hoặc là một cái gì đó; có thể xảy ra hoặc dự kiến"
                },
                "examples": [
                    {
                        "en": "the most likely explanation/outcome/scenario",
                        "vi": "lời giải thích / kết quả / kịch bản có khả năng xảy ra nhất"
                    },
                    {
                        "en": "the likely cause/consequence",
                        "vi": "nguyên nhân / hậu quả có thể xảy ra"
                    },
                    {
                        "en": "a likely nominee/contender/winner",
                        "vi": "một người có khả năng được đề cử / ứng cử viên / người chiến thắng"
                    },
                    {
                        "en": "A threat level of ‘Severe’ means a terrorist attack is highly likely.",
                        "vi": "Mức độ đe dọa 'Nghiêm trọng' có nghĩa là có khả năng xảy ra một cuộc tấn công khủng bố."
                    },
                    {
                        "en": "They might ask for help or, more likely, just give up.",
                        "vi": "Họ có thể yêu cầu giúp đỡ hoặc nhiều khả năng hơn là bỏ cuộc."
                    },
                    {
                        "en": "likely to do something Tickets are likely to be expensive.",
                        "vi": "có khả năng làm điều gì đó Vé có thể đắt."
                    },
                    {
                        "en": "The beetles are likely to cause damage.",
                        "vi": "Bọ cánh cứng có khả năng gây hại."
                    },
                    {
                        "en": "There is likely to be heavy snowfall.",
                        "vi": "Có khả năng có tuyết rơi dày."
                    },
                    {
                        "en": "likely (that)… It's hardly likely (that) they'll refuse.",
                        "vi": "có khả năng (điều đó)… Rất ít khả năng (điều đó) họ sẽ từ chối."
                    },
                    {
                        "en": "It is quite likely the discussion may never take place.",
                        "vi": "Rất có thể cuộc thảo luận có thể không bao giờ diễn ra."
                    }
                ]
            },
            {
                "define": {
                    "en": "seeming suitable for a purpose",
                    "vi": "có vẻ phù hợp với một mục đích"
                },
                "examples": [
                    {
                        "en": "She seems the most likely candidate for the job.",
                        "vi": "Cô ấy có vẻ là ứng cử viên khả dĩ nhất cho công việc."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to show that you do not believe what somebody has said",
                    "vi": "được sử dụng để cho thấy rằng bạn không tin những gì ai đó đã nói"
                },
                "examples": [
                    {
                        "en": "You just found it lying in the street? A likely story!",
                        "vi": "Bạn vừa tìm thấy nó nằm trên đường phố? Một câu chuyện có thể xảy ra!"
                    },
                    {
                        "en": "He said he'd met Rihanna. A likely story.",
                        "vi": "Anh ấy nói rằng anh ấy đã gặp Rihanna. Một câu chuyện có thể xảy ra."
                    }
                ]
            }
        ]
    },
    {
        "id": "68547ac5e7f94812991aa347164e5841",
        "word": "as likely as not",
        "pos": "idiom",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈlaɪkli/",
            "us": "/ˈlaɪkli/"
        },
        "nearby": [
            {
                "word": "likelihood",
                "pos": "noun"
            },
            {
                "word": "likely",
                "pos": "adjective"
            },
            {
                "word": "likely",
                "pos": "adverb"
            },
            {
                "word": "like-minded",
                "pos": "adjective"
            },
            {
                "word": "liken",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "very probably",
                    "vi": "rất có thể"
                },
                "examples": [
                    {
                        "en": "As likely as not she's forgotten all about it.",
                        "vi": "Có thể là cô ấy đã quên tất cả về nó."
                    },
                    {
                        "en": "The illness was caused, most likely, by a virus.",
                        "vi": "Căn bệnh này rất có thể là do vi rút gây ra."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to disagree strongly with a statement or suggestion",
                    "vi": "được sử dụng để không đồng ý mạnh mẽ với một tuyên bố hoặc đề xuất"
                },
                "examples": [
                    {
                        "en": "Me? Join the army? Not likely!",
                        "vi": "Tôi? Nhập ngũ? Không có khả năng!"
                    }
                ]
            }
        ]
    },
    {
        "id": "e111e67180a9428f89282056e425aff9",
        "word": "expected",
        "pos": "adjective",
        "level": "b1",
        "phonetic": {
            "uk": "/ɪkˈspektɪd/",
            "us": "/ɪkˈspektɪd/"
        },
        "nearby": [
            {
                "word": "expectation",
                "pos": "noun"
            },
            {
                "word": "expectation of life",
                "pos": "noun"
            },
            {
                "word": "expected",
                "pos": "adjective"
            },
            {
                "word": "expectorant",
                "pos": "noun"
            },
            {
                "word": "expectorate",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "that you think will happen",
                    "vi": "mà bạn nghĩ sẽ xảy ra"
                },
                "examples": [
                    {
                        "en": "Double the expected number of people came to the meeting.",
                        "vi": "Nhân đôi số người đến dự buổi họp dự kiến."
                    },
                    {
                        "en": "this year’s expected earnings",
                        "vi": "thu nhập dự kiến của năm nay"
                    }
                ]
            }
        ]
    },
    {
        "id": "f416da49b5be4c55bf42f9d56b033bad",
        "word": "imagine",
        "pos": "verb",
        "level": "b1",
        "phonetic": {
            "uk": "/ɪˈmædʒɪn/",
            "us": "/ɪˈmædʒɪn/"
        },
        "nearby": [
            {
                "word": "imaginative",
                "pos": "adjective"
            },
            {
                "word": "imaginatively",
                "pos": "adverb"
            },
            {
                "word": "imagine",
                "pos": "verb"
            },
            {
                "word": "imagineer",
                "pos": "noun"
            },
            {
                "word": "imagineer",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to form a picture in your mind of what something might be like",
                    "vi": "để hình thành một hình ảnh trong tâm trí bạn về những gì có thể như thế nào"
                },
                "examples": [
                    {
                        "en": "imagine something The house was just as she had imagined it.",
                        "vi": "tưởng tượng điều gì đó Ngôi nhà giống như cô đã tưởng tượng."
                    },
                    {
                        "en": "Imagine my surprise when I opened the door to find him standing there.",
                        "vi": "Hãy tưởng tượng sự ngạc nhiên của tôi khi tôi mở cửa và thấy anh ấy đang đứng đó."
                    },
                    {
                        "en": "I can't imagine life without the children now.",
                        "vi": "Tôi không thể tưởng tượng cuộc sống mà không có những đứa trẻ bây giờ."
                    },
                    {
                        "en": "It's hard to imagine a more cynical political strategy.",
                        "vi": "Thật khó để tưởng tượng một chiến lược chính trị hoài nghi hơn."
                    },
                    {
                        "en": "imagine (that)… Close your eyes and imagine (that) you are in a forest.",
                        "vi": "tưởng tượng (điều đó)… Nhắm mắt lại và tưởng tượng (điều đó) bạn đang ở trong một khu rừng."
                    },
                    {
                        "en": "imagine what, how, etc… Can you imagine what it must be like to lose your job after 20 years?",
                        "vi": "tưởng tượng những gì, như thế nào, vv… Bạn có thể tưởng tượng bạn sẽ như thế nào khi mất việc sau 20 năm không?"
                    },
                    {
                        "en": "imagine doing something Imagine earning that much money!",
                        "vi": "tưởng tượng làm điều gì đó Hãy tưởng tượng kiếm được nhiều tiền như vậy!"
                    },
                    {
                        "en": "She imagined walking into the office and handing in her resignation.",
                        "vi": "Cô tưởng tượng sẽ bước vào văn phòng và nộp đơn từ chức."
                    },
                    {
                        "en": "imagine somebody/something doing something I can just imagine him saying that!",
                        "vi": "Hãy tưởng tượng ai đó / điều gì đó đang làm điều gì đó Tôi có thể tưởng tượng anh ấy nói như vậy!"
                    },
                    {
                        "en": "imagine somebody/something to be/do something I had imagined her to be older than that.",
                        "vi": "tưởng tượng ai đó / điều gì đó sẽ trở thành / làm điều gì đó mà tôi đã tưởng tượng cô ấy già hơn thế."
                    },
                    {
                        "en": "imagine somebody/something/yourself (as) something He loved to imagine himself as the hero.",
                        "vi": "tưởng tượng ai đó / cái gì đó / bản thân bạn (như) điều gì đó Anh ấy thích tưởng tượng mình là anh hùng."
                    },
                    {
                        "en": "I find it difficult to imagine her a grandmother.",
                        "vi": "Tôi cảm thấy khó tưởng tượng cô ấy là một bà ngoại."
                    },
                    {
                        "en": "I can imagine him really angry.",
                        "vi": "Tôi có thể tưởng tượng anh ấy thực sự tức giận."
                    },
                    {
                        "en": "(informal) ‘He was furious.’ ‘I can imagine.’",
                        "vi": "(thân mật) 'Anh ấy đã rất tức giận.' 'Tôi có thể tưởng tượng.'"
                    }
                ]
            },
            {
                "define": {
                    "en": "to believe something that is not true",
                    "vi": "tin điều gì đó không đúng sự thật"
                },
                "examples": [
                    {
                        "en": "imagine (that)… He’s always imagining (that) we’re talking about him behind his back.",
                        "vi": "tưởng tượng (điều đó)… Anh ấy luôn tưởng tượng (điều đó) chúng ta đang nói về anh ấy sau lưng anh ấy."
                    },
                    {
                        "en": "imagine something There's nobody there. You're imagining things.",
                        "vi": "tưởng tượng điều gì đó Không có ai ở đó. Bạn đang tưởng tượng mọi thứ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to think that something is probably true",
                    "vi": "nghĩ rằng điều gì đó có lẽ là sự thật"
                },
                "examples": [
                    {
                        "en": "I think it's likely that these people know each other.",
                        "vi": "Tôi nghĩ có khả năng là những người này biết nhau."
                    }
                ]
            }
        ]
    },
    {
        "id": "8481f33bc5bb4a38a41f5058882fe233",
        "word": "look",
        "pos": "verb",
        "level": "b1",
        "phonetic": {
            "uk": "/lʊk/",
            "us": "/lʊk/"
        },
        "nearby": [
            {
                "word": "loo",
                "pos": "noun"
            },
            {
                "word": "loofah",
                "pos": "noun"
            },
            {
                "word": "look",
                "pos": "verb"
            },
            {
                "word": "look",
                "pos": "noun"
            },
            {
                "word": "look",
                "pos": "exclamation"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to turn your eyes in a particular direction",
                    "vi": "để chuyển mắt của bạn theo một hướng cụ thể"
                },
                "examples": [
                    {
                        "en": "Look closely and tell me what you see.",
                        "vi": "Hãy nhìn kỹ và cho tôi biết những gì bạn nhìn thấy."
                    },
                    {
                        "en": "If you look carefully you can just see our house from here.",
                        "vi": "Nếu bạn nhìn kỹ, bạn có thể nhìn thấy ngôi nhà của chúng tôi từ đây."
                    },
                    {
                        "en": "‘Has the mail come yet?’ ‘I'll look and see.’",
                        "vi": "Thư đã đến chưa?' 'Tôi sẽ nhìn và xem.'"
                    },
                    {
                        "en": "Look! I'm sure that's Jennifer Lawrence!",
                        "vi": "Nhìn! Tôi chắc chắn đó là Jennifer Lawrence!"
                    },
                    {
                        "en": "Don't look now, but there's someone staring at you!",
                        "vi": "Đừng nhìn bây giờ mà có người đang nhìn chằm chằm vào bạn!"
                    },
                    {
                        "en": "look at somebody/something She looked at me and smiled.",
                        "vi": "nhìn ai đó / cái gì đó Cô ấy nhìn tôi và mỉm cười."
                    },
                    {
                        "en": "look + adv./prep. I got up and looked out of the window.",
                        "vi": "nhìn + adv./prep. Tôi đứng dậy và nhìn ra ngoài cửa sổ."
                    },
                    {
                        "en": "She looked across to the other side of the room.",
                        "vi": "Cô nhìn sang phía bên kia của căn phòng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to try to find somebody/something",
                    "vi": "cố gắng tìm ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "look for somebody/something Where have you been? We've been looking for you.",
                        "vi": "tìm ai đó / cái gì đó Bạn đã ở đâu? Chúng tôi đã tìm kiếm bạn."
                    },
                    {
                        "en": "Are you still looking for a job?",
                        "vi": "Bạn vẫn đang tìm kiếm một công việc?"
                    },
                    {
                        "en": "We’re looking for someone with experience for this post.",
                        "vi": "Chúng tôi đang tìm một người có kinh nghiệm cho bài đăng này."
                    },
                    {
                        "en": "They are always looking for ways to save money.",
                        "vi": "Họ luôn tìm cách tiết kiệm tiền."
                    },
                    {
                        "en": "look + adv./prep. I can't find my book—I've looked everywhere.",
                        "vi": "nhìn + adv./prep. Tôi không thể tìm thấy sách của mình — tôi đã tìm khắp mọi nơi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to pay attention to something",
                    "vi": "chú ý đến một cái gì đó"
                },
                "examples": [
                    {
                        "en": "look at something Look at the time! We're going to be late.",
                        "vi": "nhìn vào cái gì đó Nhìn vào thời gian! Chúng ta sẽ bị trễ."
                    },
                    {
                        "en": "look where, what, etc… Can't you look where you're going?",
                        "vi": "nhìn ở đâu, cái gì, vv… Bạn không thể nhìn nơi bạn đang đi?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to seem; to appear",
                    "vi": "có vẻ như; xuất hiện"
                },
                "examples": [
                    {
                        "en": "+ adj. You look great!",
                        "vi": "Err:509"
                    },
                    {
                        "en": "The garden looks nice.",
                        "vi": "Khu vườn trông đẹp."
                    },
                    {
                        "en": "Don't worry—it looks worse than it is.",
                        "vi": "Đừng lo lắng — nó có vẻ tệ hơn thực tế."
                    },
                    {
                        "en": "The film looks likely to offend many people.",
                        "vi": "Bộ phim có vẻ sẽ làm mất lòng nhiều người."
                    },
                    {
                        "en": "That book looks interesting.",
                        "vi": "Cuốn sách đó trông thú vị."
                    },
                    {
                        "en": "look like somebody/something That looks like an interesting book.",
                        "vi": "trông giống như ai đó / cái gì đó Trông giống như một cuốn sách thú vị."
                    },
                    {
                        "en": "look like somebody/something to somebody It doesn't look like fun to me.",
                        "vi": "trông giống như ai đó / cái gì đó đối với ai đó Nó không giống như thú vị với tôi."
                    },
                    {
                        "en": "+ noun You made me look a complete fool!",
                        "vi": "Err:509"
                    },
                    {
                        "en": "That looks an interesting book.",
                        "vi": "Đó trông là một cuốn sách thú vị."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have a particular appearance",
                    "vi": "để có một ngoại hình cụ thể"
                },
                "examples": [
                    {
                        "en": "look like somebody/something That photograph doesn't look like her at all.",
                        "vi": "trông giống ai đó / cái gì đó Bức ảnh đó không giống cô ấy chút nào."
                    },
                    {
                        "en": "‘What does your cousin look like?’ ‘He's tall and thin with brown hair.’",
                        "vi": "Em họ của bạn trông như thế nào?' 'Anh ấy cao và gầy với mái tóc nâu.'"
                    },
                    {
                        "en": "look as if…/as though… You look as though you slept badly.",
                        "vi": "trông như thể… / như thể… Bạn trông như thể bạn đã ngủ rất tệ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to seem likely to happen or be true",
                    "vi": "dường như có khả năng xảy ra hoặc đúng"
                },
                "examples": [
                    {
                        "en": "It looks like rain (= it looks as if it's going to rain).",
                        "vi": "Nó trông giống như mưa (= nó trông như thể trời sắp mưa)."
                    },
                    {
                        "en": "look as if…/as though… It doesn't look as if we'll be moving after all.",
                        "vi": "trông như thể… / như thể… Rốt cuộc thì không có vẻ gì là chúng ta sẽ di chuyển cả."
                    },
                    {
                        "en": "look to somebody as if…/as though… It looks to me as though the company is in real trouble.",
                        "vi": "nhìn ai đó như thể… / như thể… Với tôi như thể công ty đang gặp khó khăn thực sự."
                    },
                    {
                        "en": "look like… (informal) They don’t look like they’re trying to win.",
                        "vi": "trông giống như… (thân mật) Họ không giống như họ đang cố gắng giành chiến thắng."
                    },
                    {
                        "en": "look to somebody like… (informal) It looks to me like they have a plan.",
                        "vi": "nhìn ai đó như… (thân mật) Đối với tôi, có vẻ như họ có một kế hoạch."
                    }
                ]
            },
            {
                "define": {
                    "en": "to face a particular direction",
                    "vi": "đối mặt với một hướng cụ thể"
                },
                "examples": [
                    {
                        "en": "The house looks east.",
                        "vi": "Ngôi nhà nhìn về hướng Đông."
                    },
                    {
                        "en": "The hotel looks out over the harbour.",
                        "vi": "Khách sạn nhìn ra bến cảng."
                    },
                    {
                        "en": "The kitchen looks onto the garden.",
                        "vi": "Phòng bếp nhìn ra vườn."
                    }
                ]
            },
            {
                "define": {
                    "en": "used in a shop to say that you are not ready to buy something",
                    "vi": "được sử dụng trong một cửa hàng để nói rằng bạn chưa sẵn sàng để mua một cái gì đó"
                },
                "examples": [
                    {
                        "en": "‘Can I help you?’ ‘I'm just looking, thank you.’",
                        "vi": "Tôi có thể giúp bạn?' 'Tôi chỉ đang tìm kiếm, cảm ơn bạn.'"
                    }
                ]
            },
            {
                "define": {
                    "en": "to try to find ways of doing something",
                    "vi": "cố gắng tìm cách làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "The government is looking to reduce inflation.",
                        "vi": "Chính phủ đang tìm cách giảm lạm phát."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be considered bad behaviour or bad manners",
                    "vi": "bị coi là hành vi xấu hoặc cách cư xử tồi"
                },
                "examples": [
                    {
                        "en": "It looks bad not going to your own brother's wedding.",
                        "vi": "Có vẻ không tốt khi đi dự đám cưới của anh trai bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to show that something bad might happen",
                    "vi": "để cho thấy rằng điều gì đó tồi tệ có thể xảy ra"
                },
                "examples": [
                    {
                        "en": "He's had another heart attack; things are looking bad for him, I'm afraid.",
                        "vi": "Anh ấy bị một cơn đau tim khác; Tôi e rằng mọi thứ đang có vẻ tồi tệ với anh ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to show success or that something good might happen",
                    "vi": "để thể hiện sự thành công hoặc điều gì đó tốt đẹp có thể xảy ra"
                },
                "examples": [
                    {
                        "en": "This year's sales figures are looking good.",
                        "vi": "Số liệu bán hàng năm nay có vẻ tốt."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to protest about something",
                    "vi": "sử dụng để phản đối về một cái gì đó"
                },
                "examples": [
                    {
                        "en": "Now look here, it wasn't my fault.",
                        "vi": "Bây giờ hãy nhìn đây, đó không phải là lỗi của tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to give an example that proves what you are saying or makes it clearer",
                    "vi": "được sử dụng để đưa ra một ví dụ chứng minh những gì bạn đang nói hoặc làm cho nó rõ ràng hơn"
                },
                "examples": [
                    {
                        "en": "Look how lazy we've become.",
                        "vi": "Hãy nhìn xem chúng ta đã trở nên lười biếng như thế nào."
                    },
                    {
                        "en": "Be careful climbing that ladder. Look what happened last time.",
                        "vi": "Hãy cẩn thận khi leo lên chiếc thang đó. Nhìn những gì đã xảy ra lần trước."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that something is exactly what somebody needs and so they do not need to consider any other options",
                    "vi": "được sử dụng để nói rằng một cái gì đó là chính xác những gì ai đó cần và vì vậy họ không cần phải xem xét bất kỳ lựa chọn nào khác"
                },
                "examples": [
                    {
                        "en": "Those looking for an enjoyable evening need look no further than the hotel's nightclub.",
                        "vi": "Những người đang tìm kiếm một buổi tối thú vị không cần tìm đâu xa hơn hộp đêm của khách sạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to look at somebody in a careful or critical way",
                    "vi": "để nhìn ai đó một cách cẩn thận hoặc chỉ trích"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to (not) have your normal healthy appearance",
                    "vi": "để (không) có ngoại hình khỏe mạnh bình thường của bạn"
                },
                "examples": [
                    {
                        "en": "You're not looking yourself today (= you look tired or ill/sick).",
                        "vi": "Hôm nay bạn không nhìn thấy chính mình (= trông bạn có vẻ mệt mỏi hoặc ốm / ốm)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to become more and more successful",
                    "vi": "để ngày càng thành công hơn"
                },
                "examples": [
                    {
                        "en": "Her first novel was published in 2007 and since then she hasn't looked back.",
                        "vi": "Cuốn tiểu thuyết đầu tiên của cô được xuất bản vào năm 2007 và kể từ đó cô đã không nhìn lại."
                    }
                ]
            },
            {
                "define": {
                    "en": "not attractive",
                    "vi": "không hấp dẫn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "judging by the appearance of somebody/something",
                    "vi": "đánh giá bằng sự xuất hiện của ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "To look at him you'd never think he was nearly fifty.",
                        "vi": "Nhìn anh ấy, bạn sẽ không bao giờ nghĩ rằng anh ấy đã gần năm mươi."
                    }
                ]
            }
        ]
    },
    {
        "id": "bc9c3109141e4c8e88a122663dc47fc9",
        "word": "will",
        "pos": "modal verb",
        "level": "b1",
        "phonetic": {
            "uk": "/wɪl/",
            "us": "/wɪl/"
        },
        "nearby": [
            {
                "word": "will",
                "pos": "verb"
            },
            {
                "word": "will",
                "pos": "verb"
            },
            {
                "word": "will",
                "pos": "modal verb"
            },
            {
                "word": "will",
                "pos": "noun"
            },
            {
                "word": "Will",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "used for talking about or predicting the future",
                    "vi": "được sử dụng để nói về hoặc dự đoán tương lai"
                },
                "examples": [
                    {
                        "en": "You'll be in time if you hurry.",
                        "vi": "Bạn sẽ đến kịp nếu bạn nhanh chóng."
                    },
                    {
                        "en": "How long will you be staying in Paris?",
                        "vi": "Bạn sẽ ở lại Paris bao lâu?"
                    },
                    {
                        "en": "Fred said he'd be leaving soon.",
                        "vi": "Fred nói rằng anh ấy sẽ sớm rời đi."
                    },
                    {
                        "en": "By next year all the money will have been spent.",
                        "vi": "Đến năm sau, tất cả số tiền sẽ được tiêu hết."
                    }
                ]
            },
            {
                "define": {
                    "en": "used for asking somebody to do something",
                    "vi": "được sử dụng để yêu cầu ai đó làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "Will you send this letter for me, please?",
                        "vi": "Bạn sẽ gửi bức thư này cho tôi, làm ơn?"
                    },
                    {
                        "en": "You'll water the plants while I'm away, won't you?",
                        "vi": "Bạn sẽ tưới cây khi tôi đi vắng, phải không?"
                    },
                    {
                        "en": "I asked him if he wouldn't mind calling later.",
                        "vi": "Tôi hỏi anh ấy liệu anh ấy có phiền gọi lại sau không."
                    }
                ]
            },
            {
                "define": {
                    "en": "used for inviting somebody to do something",
                    "vi": "được sử dụng để mời ai đó làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "Will you join us for lunch?",
                        "vi": "Bạn sẽ tham gia ăn trưa với chúng tôi chứ?"
                    }
                ]
            },
            {
                "define": {
                    "en": "used for showing that somebody is willing to do something",
                    "vi": "được sử dụng để thể hiện rằng ai đó sẵn sàng làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "I'll check this letter for you, if you want.",
                        "vi": "Tôi sẽ kiểm tra lá thư này cho bạn, nếu bạn muốn."
                    },
                    {
                        "en": "They won't lend us any more money.",
                        "vi": "Họ sẽ không cho chúng tôi vay tiền nữa."
                    },
                    {
                        "en": "He wouldn't come—he said he was too busy.",
                        "vi": "Anh ấy sẽ không đến - anh ấy nói rằng anh ấy quá bận."
                    },
                    {
                        "en": "We said we would keep them.",
                        "vi": "Chúng tôi đã nói rằng chúng tôi sẽ giữ chúng."
                    }
                ]
            },
            {
                "define": {
                    "en": "used for ordering somebody to do something",
                    "vi": "được sử dụng để ra lệnh cho ai đó làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "You'll do it this minute!",
                        "vi": "Bạn sẽ làm được điều đó ngay phút này!"
                    },
                    {
                        "en": "Will you be quiet!",
                        "vi": "Bạn sẽ im lặng!"
                    }
                ]
            },
            {
                "define": {
                    "en": "used for stating what you think is probably true",
                    "vi": "được sử dụng để nói rõ những gì bạn nghĩ là có thể đúng"
                },
                "examples": [
                    {
                        "en": "That'll be the doctor now.",
                        "vi": "Đó sẽ là bác sĩ bây giờ."
                    },
                    {
                        "en": "You'll have had dinner already, I suppose.",
                        "vi": "Tôi cho là bạn đã ăn tối rồi."
                    }
                ]
            },
            {
                "define": {
                    "en": "used for stating what is generally true",
                    "vi": "được sử dụng để nói những gì thường là đúng"
                },
                "examples": [
                    {
                        "en": "If it's made of wood it will float.",
                        "vi": "Nếu nó được làm bằng gỗ, nó sẽ nổi."
                    },
                    {
                        "en": "Engines won't run without lubricants.",
                        "vi": "Động cơ sẽ không chạy nếu không có chất bôi trơn."
                    }
                ]
            },
            {
                "define": {
                    "en": "used for stating what is true or possible in a particular case",
                    "vi": "được sử dụng để nêu rõ điều gì là đúng hoặc có thể xảy ra trong một trường hợp cụ thể"
                },
                "examples": [
                    {
                        "en": "This jar will hold a kilo.",
                        "vi": "Hũ này sẽ chứa được một kg."
                    },
                    {
                        "en": "The door won't open!",
                        "vi": "Cửa sẽ không mở!"
                    }
                ]
            },
            {
                "define": {
                    "en": "used for talking about habits",
                    "vi": "dùng để nói về thói quen"
                },
                "examples": [
                    {
                        "en": "She'll listen to music, alone in her room, for hours.",
                        "vi": "Cô ấy sẽ nghe nhạc, một mình trong phòng, hàng giờ."
                    },
                    {
                        "en": "He would spend hours on the telephone.",
                        "vi": "Anh ấy sẽ dành hàng giờ trên điện thoại."
                    }
                ]
            },
            {
                "define": {
                    "en": "used in questions with I for making offers or suggestions",
                    "vi": "được sử dụng trong các câu hỏi với Tôi để đưa ra đề nghị hoặc đề xuất"
                },
                "examples": [
                    {
                        "en": "Will I call back later?",
                        "vi": "Tôi sẽ gọi lại sau?"
                    }
                ]
            }
        ]
    },
    {
        "id": "11b020e5f9f34e8f818c98a555e6aeec",
        "word": "expect",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/ɪkˈspekt/",
            "us": "/ɪkˈspekt/"
        },
        "nearby": [
            {
                "word": "expatriate",
                "pos": "noun"
            },
            {
                "word": "expatriate",
                "pos": "adjective"
            },
            {
                "word": "expect",
                "pos": "verb"
            },
            {
                "word": "expectancy",
                "pos": "noun"
            },
            {
                "word": "expectant",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to think or believe that something will happen or that somebody will do something",
                    "vi": "nghĩ hoặc tin rằng điều gì đó sẽ xảy ra hoặc ai đó sẽ làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "expect something The company is expecting record sales this year.",
                        "vi": "mong đợi điều gì đó Công ty đang mong đợi doanh thu kỷ lục trong năm nay."
                    },
                    {
                        "en": "Change often happens when you least expect it.",
                        "vi": "Thay đổi thường xảy ra khi bạn ít mong đợi nhất."
                    },
                    {
                        "en": "expect something from somebody/something Don't expect sympathy from me!",
                        "vi": "Mong đợi điều gì đó từ ai đó / điều gì đó Đừng mong đợi sự thông cảm từ tôi!"
                    },
                    {
                        "en": "expect something of somebody/something That's not the sort of behaviour I expect of you!",
                        "vi": "mong đợi điều gì đó của ai đó / điều gì đó Đó không phải là kiểu cư xử mà tôi mong đợi ở bạn!"
                    },
                    {
                        "en": "expect to do something They never expected to find their dream home.",
                        "vi": "mong đợi để làm điều gì đó Họ không bao giờ mong đợi để tìm thấy ngôi nhà mơ ước của họ."
                    },
                    {
                        "en": "I looked back, half expecting to see someone following me.",
                        "vi": "Tôi nhìn lại, nửa mong đợi sẽ thấy ai đó đang theo dõi mình."
                    },
                    {
                        "en": "expect somebody/something to do something Analysts expect the company to announce growth of at least 5 per cent.",
                        "vi": "mong đợi ai đó / điều gì đó làm điều gì đó Các nhà phân tích kỳ vọng công ty sẽ công bố mức tăng trưởng ít nhất 5%."
                    },
                    {
                        "en": "I fully expected her to refuse my offer.",
                        "vi": "Tôi hoàn toàn mong đợi cô ấy từ chối lời đề nghị của tôi."
                    },
                    {
                        "en": "House prices are expected to rise sharply.",
                        "vi": "Giá nhà dự kiến sẽ tăng mạnh."
                    },
                    {
                        "en": "Do you really expect me to believe you?",
                        "vi": "Bạn có thực sự mong đợi tôi tin bạn?"
                    },
                    {
                        "en": "expect (that)… Many people were expecting (that) the peace talks would break down.",
                        "vi": "mong đợi (điều đó)… Nhiều người đã mong đợi (rằng) cuộc đàm phán hòa bình sẽ đổ vỡ."
                    },
                    {
                        "en": "it is expected that… It is widely expected that interest rates will rise.",
                        "vi": "dự kiến rằng… Nhiều người cho rằng lãi suất sẽ tăng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be waiting for somebody/something to arrive, as this has been arranged",
                    "vi": "chờ ai đó / cái gì đó đến, vì điều này đã được sắp xếp"
                },
                "examples": [
                    {
                        "en": "expect somebody/something to expect a visit/call/letter from somebody",
                        "vi": "mong đợi ai đó / điều gì đó mong đợi một chuyến thăm / cuộc gọi / thư từ ai đó"
                    },
                    {
                        "en": "We were expecting him yesterday.",
                        "vi": "Chúng tôi đã mong đợi anh ấy ngày hôm qua."
                    },
                    {
                        "en": "They are not expected until tomorrow.",
                        "vi": "Họ không được mong đợi cho đến ngày mai."
                    },
                    {
                        "en": "Are you expecting visitors?",
                        "vi": "Bạn đang mong đợi khách truy cập?"
                    },
                    {
                        "en": "I'm expecting an important call.",
                        "vi": "Tôi đang chờ một cuộc gọi quan trọng."
                    },
                    {
                        "en": "expect somebody to do something We were expecting him to arrive yesterday.",
                        "vi": "mong ai đó làm điều gì đó. Chúng tôi đã mong đợi anh ấy đến ngày hôm qua."
                    }
                ]
            },
            {
                "define": {
                    "en": "to demand that somebody will do something because it is their duty or responsibility",
                    "vi": "yêu cầu ai đó sẽ làm điều gì đó vì đó là nghĩa vụ hoặc trách nhiệm của họ"
                },
                "examples": [
                    {
                        "en": "expect something It is reasonable to expect changes in the way we work.",
                        "vi": "mong đợi điều gì đó Thật hợp lý khi mong đợi những thay đổi trong cách chúng ta làm việc."
                    },
                    {
                        "en": "No one has a right to expect good results without working hard.",
                        "vi": "Không ai có quyền mong đợi kết quả tốt nếu không làm việc chăm chỉ."
                    },
                    {
                        "en": "These are the high standards that hotel guests have come to expect.",
                        "vi": "Đây là những tiêu chuẩn cao mà khách hàng mong đợi."
                    },
                    {
                        "en": "expect something from somebody He's still getting over his illness, so it's unrealistic to expect too much from him.",
                        "vi": "mong đợi điều gì đó từ ai đó Anh ấy vẫn đang vượt qua căn bệnh của mình, vì vậy việc trông đợi quá nhiều ở anh ấy là không thực tế."
                    },
                    {
                        "en": "expect something of somebody Are you clear what is expected of you?",
                        "vi": "mong đợi điều gì đó ở ai đó Bạn có rõ điều gì được mong đợi ở bạn không?"
                    },
                    {
                        "en": "expect somebody to do something You can't reasonably expect people to pay such high taxes.",
                        "vi": "mong đợi ai đó làm điều gì đó Bạn không thể mong đợi một cách hợp lý mọi người phải trả thuế cao như vậy."
                    },
                    {
                        "en": "We are expected to work on Saturdays.",
                        "vi": "Chúng tôi dự kiến sẽ làm việc vào các ngày thứ Bảy."
                    },
                    {
                        "en": "It would be unreasonable to expect them to do all that work for free.",
                        "vi": "Sẽ là không hợp lý nếu mong đợi họ làm tất cả những công việc đó miễn phí."
                    },
                    {
                        "en": "expect to do something I expect to be paid promptly for the work.",
                        "vi": "mong đợi để làm một cái gì đó mà tôi mong đợi để được trả công kịp thời cho công việc."
                    }
                ]
            },
            {
                "define": {
                    "en": "used when you think something is probably true",
                    "vi": "được sử dụng khi bạn nghĩ điều gì đó có thể đúng"
                },
                "examples": [
                    {
                        "en": "‘Will you be late?’ ‘I expect so.’",
                        "vi": "Bạn sẽ đến muộn chứ?' 'Tôi mong đợi như vậy.'"
                    },
                    {
                        "en": "‘Are you going out tonight?’ ‘I don't expect so.’",
                        "vi": "Bạn có đi chơi tối nay không?' 'Tôi không mong đợi như vậy.'"
                    },
                    {
                        "en": "expect (that…) ‘Who’s eaten all the cake?’ ‘Tom, I expect/I expect it was Tom.’",
                        "vi": "mong đợi (rằng…) 'Ai đã ăn hết cái bánh?' 'Tom, tôi mong đợi / Tôi mong đợi đó là Tom.'"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be pregnant",
                    "vi": "có thai"
                },
                "examples": [
                    {
                        "en": "Ann's expecting a baby in June.",
                        "vi": "Ann đang mong chờ một em bé vào tháng Sáu."
                    },
                    {
                        "en": "I didn't know she was expecting!",
                        "vi": "Tôi không biết cô ấy đang mong đợi!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be likely to happen; to be quite normal",
                    "vi": "có khả năng xảy ra; khá bình thường"
                },
                "examples": [
                    {
                        "en": "A little tiredness after taking these drugs is to be expected.",
                        "vi": "Dự kiến sẽ có một chút mệt mỏi sau khi dùng các loại thuốc này."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to tell somebody not to be surprised by something",
                    "vi": "được sử dụng để nói với ai đó đừng ngạc nhiên bởi điều gì đó"
                },
                "examples": [
                    {
                        "en": "She swore at you? What do you expect when you treat her like that?",
                        "vi": "Cô ấy đã chửi thề với bạn? Bạn mong đợi điều gì khi đối xử với cô ấy như vậy?"
                    }
                ]
            }
        ]
    },
    {
        "id": "c9821c66c8854e15bb811972c934fc41",
        "word": "forecast",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈfɔːkɑːst/",
            "us": "/ˈfɔːrkæst/"
        },
        "nearby": [
            {
                "word": "foreboding",
                "pos": "adjective"
            },
            {
                "word": "forebrain",
                "pos": "noun"
            },
            {
                "word": "forecast",
                "pos": "noun"
            },
            {
                "word": "forecast",
                "pos": "verb"
            },
            {
                "word": "forecaster",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a statement about what will happen in the future, based on information that is available now",
                    "vi": "tuyên bố về những gì sẽ xảy ra trong tương lai, dựa trên thông tin hiện có"
                },
                "examples": [
                    {
                        "en": "The sales forecasts are encouraging.",
                        "vi": "Các dự báo bán hàng là đáng khích lệ."
                    },
                    {
                        "en": "It is difficult to make long-term forecasts for a fast-growing industry.",
                        "vi": "Rất khó để đưa ra dự báo dài hạn cho một ngành đang phát triển nhanh."
                    },
                    {
                        "en": "The forecast said there would be sunny intervals and showers.",
                        "vi": "Dự báo cho biết sẽ có những khoảng thời gian nắng và mưa rào."
                    },
                    {
                        "en": "The shipping forecast gave warnings of gales.",
                        "vi": "Dự báo vận chuyển đã đưa ra những cảnh báo về gales."
                    }
                ]
            }
        ]
    },
    {
        "id": "56cc4ab986b144a8aec0791f08af21ad",
        "word": "forecast",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈfɔːkɑːst/",
            "us": "/ˈfɔːrkæst/"
        },
        "nearby": [
            {
                "word": "forebrain",
                "pos": "noun"
            },
            {
                "word": "forecast",
                "pos": "noun"
            },
            {
                "word": "forecast",
                "pos": "verb"
            },
            {
                "word": "forecaster",
                "pos": "noun"
            },
            {
                "word": "forecastle",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to say what you think will happen in the future based on information that you have now",
                    "vi": "để nói những gì bạn nghĩ sẽ xảy ra trong tương lai dựa trên thông tin mà bạn có bây giờ"
                },
                "examples": [
                    {
                        "en": "forecast something Experts are forecasting a recovery in the economy.",
                        "vi": "dự báo điều gì Các chuyên gia đang dự báo một sự phục hồi trong nền kinh tế."
                    },
                    {
                        "en": "Snow is forecast for tomorrow.",
                        "vi": "Dự báo ngày mai có tuyết rơi."
                    },
                    {
                        "en": "It is difficult to forecast the demand for the new train service.",
                        "vi": "Khó có thể dự báo nhu cầu đối với dịch vụ tàu mới."
                    },
                    {
                        "en": "forecast something to do something Temperatures were forecast to reach 40°C.",
                        "vi": "dự báo điều gì đó để làm điều gì đó Nhiệt độ được dự báo lên tới 40 ° C."
                    },
                    {
                        "en": "forecast that… The report forecasts that prices will rise by 3% next month.",
                        "vi": "dự báo rằng… Báo cáo dự báo giá sẽ tăng 3% trong tháng tới."
                    },
                    {
                        "en": "forecast how, what, etc… It is difficult to forecast how the markets will react.",
                        "vi": "dự báo như thế nào, cái gì, v.v.… Rất khó để dự báo thị trường sẽ phản ứng như thế nào."
                    }
                ]
            }
        ]
    },
    {
        "id": "c54a795c5cbf44a1afc0dbab48fa42da",
        "word": "no doubt",
        "pos": "idiom",
        "level": "b2",
        "phonetic": {
            "uk": "/daʊt/",
            "us": "/daʊt/"
        },
        "nearby": [
            {
                "word": "doubloon",
                "pos": "noun"
            },
            {
                "word": "doubly",
                "pos": "adverb"
            },
            {
                "word": "doubt",
                "pos": "noun"
            },
            {
                "word": "doubt",
                "pos": "verb"
            },
            {
                "word": "doubter",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a feeling of being uncertain about something or not believing something",
                    "vi": "cảm giác không chắc chắn về điều gì đó hoặc không tin vào điều gì đó"
                },
                "examples": [
                    {
                        "en": "a feeling of doubt and uncertainty",
                        "vi": "một cảm giác nghi ngờ và không chắc chắn"
                    },
                    {
                        "en": "New evidence has cast doubt on the guilt of the man jailed for the crime.",
                        "vi": "Bằng chứng mới đã làm dấy lên nghi ngờ về tội của người đàn ông bị bỏ tù vì tội ác này."
                    },
                    {
                        "en": "He was starting to have some serious doubts.",
                        "vi": "Anh bắt đầu có một số nghi ngờ nghiêm trọng."
                    },
                    {
                        "en": "to have lingering/grave/nagging doubts",
                        "vi": "có những nghi ngờ kéo dài / nghiêm trọng / dai dẳng"
                    },
                    {
                        "en": "doubt about something The article raised doubts about how effective the new drug really was.",
                        "vi": "nghi ngờ về điều gì đó Bài báo nêu lên những nghi ngờ về hiệu quả thực sự của loại thuốc mới."
                    },
                    {
                        "en": "There is some doubt about the best way to do it.",
                        "vi": "Có một số nghi ngờ về cách tốt nhất để làm điều đó."
                    },
                    {
                        "en": "doubt (that)… There is no doubt at all that we did the right thing.",
                        "vi": "nghi ngờ (điều đó)… Không còn nghi ngờ gì nữa rằng chúng tôi đã làm đúng."
                    },
                    {
                        "en": "There's little doubt in my mind that he's going to go right to the top.",
                        "vi": "Tôi có chút nghi ngờ rằng anh ấy sẽ đi ngay đến đỉnh."
                    },
                    {
                        "en": "doubt as to something She leaves no doubt as to her own view of Picasso's work.",
                        "vi": "nghi ngờ về điều gì đó Cô ấy không nghi ngờ gì về quan điểm của chính mình về tác phẩm của Picasso."
                    },
                    {
                        "en": "doubt as to who, what, etc… If you are in any doubt as to whether you should be doing these exercises, consult your doctor.",
                        "vi": "nghi ngờ về ai, cái gì, v.v.… Nếu bạn có bất kỳ nghi ngờ nào về việc liệu bạn có nên thực hiện các bài tập này hay không, hãy tham khảo ý kiến bác sĩ của bạn."
                    },
                    {
                        "en": "doubt over something Medical experts have expressed doubt over how the scientist died.",
                        "vi": "nghi ngờ về điều gì đó Các chuyên gia y tế đã bày tỏ sự nghi ngờ về việc nhà khoa học đã chết như thế nào."
                    },
                    {
                        "en": "She knew without a shadow of a doubt that he was lying to her.",
                        "vi": "Cô không chút nghi ngờ rằng anh đang nói dối cô."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be uncertain",
                    "vi": "không chắc chắn"
                },
                "examples": [
                    {
                        "en": "The success of the system is not in doubt.",
                        "vi": "Sự thành công của hệ thống không có gì phải nghi ngờ."
                    },
                    {
                        "en": "The arrangements for the event still seemed to be in doubt.",
                        "vi": "Việc sắp xếp cho sự kiện dường như vẫn còn đang bị nghi ngờ."
                    }
                ]
            },
            {
                "define": {
                    "en": "in a way that shows that something is completely certain",
                    "vi": "theo cách cho thấy rằng có điều gì đó hoàn toàn chắc chắn"
                },
                "examples": [
                    {
                        "en": "The research showed beyond doubt that smoking contributes to heart disease.",
                        "vi": "Nghiên cứu đã chỉ ra rằng hút thuốc lá góp phần gây ra bệnh tim."
                    },
                    {
                        "en": "(law) The prosecution was able to establish beyond reasonable doubt that the woman had been lying.",
                        "vi": "(luật) Việc truy tố có thể đưa ra nghi ngờ hợp lý rằng người phụ nữ đã nói dối."
                    },
                    {
                        "en": "The evidence proves beyond doubt that he is innocent.",
                        "vi": "Các bằng chứng chứng minh rằng anh ta vô tội."
                    }
                ]
            },
            {
                "define": {
                    "en": "to accept that somebody has told the truth or behaved well because you cannot prove that they have not",
                    "vi": "chấp nhận rằng ai đó đã nói sự thật hoặc cư xử tốt bởi vì bạn không thể chứng minh rằng họ không"
                },
                "examples": [
                    {
                        "en": "She may have been lying, but I felt I had to give her the benefit of the doubt.",
                        "vi": "Cô ấy có thể đã nói dối, nhưng tôi cảm thấy tôi phải cho cô ấy lợi ích của sự nghi ngờ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have reasons why you are not certain about whether something is good or whether something good will happen",
                    "vi": "để có lý do tại sao bạn không chắc chắn về việc liệu điều gì đó tốt hay điều gì đó tốt sẽ xảy ra"
                },
                "examples": [
                    {
                        "en": "I've had my doubts about his work since he joined the firm.",
                        "vi": "Tôi đã nghi ngờ về công việc của anh ấy kể từ khi anh ấy gia nhập công ty."
                    },
                    {
                        "en": "It may be all right. Personally, I have my doubts.",
                        "vi": "Nó có thể ổn. Cá nhân tôi có những nghi ngờ của tôi."
                    },
                    {
                        "en": "They say they'll be here on time, but I have my doubts about that.",
                        "vi": "Họ nói rằng họ sẽ đến đây đúng giờ, nhưng tôi nghi ngờ về điều đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to give advice to somebody who cannot decide what to do",
                    "vi": "được sử dụng để đưa ra lời khuyên cho ai đó không thể quyết định phải làm gì"
                },
                "examples": [
                    {
                        "en": "If in doubt, wear black.",
                        "vi": "Nếu nghi ngờ, hãy mặc đồ đen."
                    },
                    {
                        "en": "If in doubt, consult your doctor.",
                        "vi": "Nếu nghi ngờ, hãy hỏi ý kiến bác sĩ của bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "used when you are saying that something is likely",
                    "vi": "được sử dụng khi bạn nói rằng điều gì đó có khả năng xảy ra"
                },
                "examples": [
                    {
                        "en": "No doubt she'll call us when she gets there.",
                        "vi": "Không nghi ngờ gì nữa, cô ấy sẽ gọi cho chúng tôi khi cô ấy đến đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "used when you are saying that something is certainly true",
                    "vi": "được sử dụng khi bạn đang nói rằng điều gì đó chắc chắn là đúng"
                },
                "examples": [
                    {
                        "en": "He's made some great movies. There's no doubt about it.",
                        "vi": "Anh ấy đã làm một số bộ phim tuyệt vời. Không có nghi ngờ gì về điều đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make something uncertain",
                    "vi": "để làm cho một cái gì đó không chắc chắn"
                },
                "examples": [
                    {
                        "en": "The proposed development has been thrown into doubt by the decision.",
                        "vi": "Sự phát triển được đề xuất đã bị nghi ngờ bởi quyết định."
                    }
                ]
            },
            {
                "define": {
                    "en": "used when you are giving your opinion and emphasizing the point that you are making",
                    "vi": "được sử dụng khi bạn đưa ra ý kiến của mình và nhấn mạnh quan điểm mà bạn đang đưa ra"
                },
                "examples": [
                    {
                        "en": "This meeting has been, without doubt, one of the most useful we have had so far.",
                        "vi": "Không nghi ngờ gì, cuộc họp này là một trong những cuộc gặp gỡ hữu ích nhất mà chúng tôi có được cho đến nay."
                    },
                    {
                        "en": "Without the slightest doubt this is a remarkable exhibition.",
                        "vi": "Không nghi ngờ gì nữa, đây là một cuộc triển lãm đáng chú ý."
                    },
                    {
                        "en": "She is without a doubt the best player I know.",
                        "vi": "Cô ấy chắc chắn là cầu thủ xuất sắc nhất mà tôi biết."
                    }
                ]
            }
        ]
    },
    {
        "id": "0adcc4df886a4b7fb2012b12a91dd3ac",
        "word": "ought to",
        "pos": "modal verb",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈɔːt tə/",
            "us": "/ˈɔːt tə/"
        },
        "nearby": [
            {
                "word": "ouch",
                "pos": "exclamation"
            },
            {
                "word": "oud",
                "pos": "noun"
            },
            {
                "word": "ought to",
                "pos": "modal verb"
            },
            {
                "word": "Ouija board",
                "pos": "noun"
            },
            {
                "word": "ounce",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "used to say what is the right thing to do",
                    "vi": "được sử dụng để nói điều phải làm là gì"
                },
                "examples": [
                    {
                        "en": "They ought to apologize.",
                        "vi": "Họ phải xin lỗi."
                    },
                    {
                        "en": "They ought to have apologized (= but they didn't).",
                        "vi": "Đáng lẽ họ phải xin lỗi (= nhưng họ đã không làm như vậy)."
                    },
                    {
                        "en": "Such things ought not to be allowed.",
                        "vi": "Những điều như vậy không nên được phép."
                    },
                    {
                        "en": "He oughtn't to have been driving so fast.",
                        "vi": "Anh ta không nên lái xe quá nhanh."
                    },
                    {
                        "en": "(formal) ‘Ought I to write to say thank you?’ ‘Yes, I think you ought (to).’",
                        "vi": "(trang trọng) 'Tôi có nên viết thư để nói lời cảm ơn không?' 'Vâng, tôi nghĩ bạn nên (đến).'"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say what you expect or would like to happen",
                    "vi": "được sử dụng để nói những gì bạn mong đợi hoặc muốn xảy ra"
                },
                "examples": [
                    {
                        "en": "Children ought to be able to read by the age of 7.",
                        "vi": "Trẻ em phải biết đọc khi 7 tuổi."
                    },
                    {
                        "en": "Nurses ought to earn more.",
                        "vi": "Y tá phải kiếm được nhiều tiền hơn."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say what you advise or recommend",
                    "vi": "được sử dụng để nói những gì bạn khuyên hoặc giới thiệu"
                },
                "examples": [
                    {
                        "en": "We ought to be leaving now.",
                        "vi": "Chúng ta nên đi ngay bây giờ."
                    },
                    {
                        "en": "This is delicious. You ought to try some.",
                        "vi": "Món này rất ngon. Bạn nên thử một số."
                    },
                    {
                        "en": "You ought to have come to the meeting. It was interesting.",
                        "vi": "Bạn phải đến cuộc họp. Nó rất thú vị."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say what has probably happened or is probably true",
                    "vi": "được sử dụng để nói những gì có thể đã xảy ra hoặc có lẽ là sự thật"
                },
                "examples": [
                    {
                        "en": "If he started out at nine, he ought to be here by now.",
                        "vi": "Nếu anh ta xuất phát lúc chín giờ, anh ta phải ở đây ngay bây giờ."
                    },
                    {
                        "en": "That ought to be enough food for the four of us.",
                        "vi": "Đó phải là đủ thức ăn cho bốn chúng tôi."
                    },
                    {
                        "en": "Oughtn't the water to have boiled by now?",
                        "vi": "Không phải bây giờ nước đã sôi rồi sao?"
                    }
                ]
            }
        ]
    },
    {
        "id": "cb1bbabb42ed49cf8450d1fb1d5eba94",
        "word": "probability",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˌprɒbəˈbɪləti/",
            "us": "/ˌprɑːbəˈbɪləti/"
        },
        "nearby": [
            {
                "word": "prob",
                "pos": "noun"
            },
            {
                "word": "probabilistic",
                "pos": "adjective"
            },
            {
                "word": "probability",
                "pos": "noun"
            },
            {
                "word": "probable",
                "pos": "adjective"
            },
            {
                "word": "probable",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "how likely something is to happen",
                    "vi": "khả năng một cái gì đó sẽ xảy ra như thế nào"
                },
                "examples": [
                    {
                        "en": "The probability is that prices will rise rapidly.",
                        "vi": "Khả năng là giá sẽ tăng nhanh chóng."
                    },
                    {
                        "en": "There seemed to be a high probability of success.",
                        "vi": "Dường như có một xác suất thành công cao."
                    }
                ]
            },
            {
                "define": {
                    "en": "a thing that is likely to happen",
                    "vi": "một điều có khả năng xảy ra"
                },
                "examples": [
                    {
                        "en": "A fall in interest rates is a strong probability in the present economic climate.",
                        "vi": "Lãi suất giảm là một xác suất mạnh trong bối cảnh kinh tế hiện nay."
                    },
                    {
                        "en": "It now seems a probability rather than just a possibility.",
                        "vi": "Bây giờ nó dường như là một xác suất hơn là một khả năng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a ratio showing the chances that a particular thing will happen",
                    "vi": "một tỷ lệ cho thấy khả năng một điều cụ thể sẽ xảy ra"
                },
                "examples": [
                    {
                        "en": "There is a 60 per cent probability that the population will be infected with the disease.",
                        "vi": "Có 60% xác suất rằng dân số sẽ bị nhiễm bệnh."
                    }
                ]
            },
            {
                "define": {
                    "en": "(considering) the evidence on both sides of an argument, to find the most likely reason for or result of something",
                    "vi": "(xem xét) bằng chứng về cả hai phía của một cuộc tranh luận, để tìm ra lý do có khả năng nhất cho hoặc kết quả của điều gì đó"
                },
                "examples": [
                    {
                        "en": "The balance of evidence suggests the Liberal party's decline began before the First World War.",
                        "vi": "Sự cân bằng bằng chứng cho thấy sự suy tàn của đảng Tự do bắt đầu từ trước Chiến tranh thế giới thứ nhất."
                    },
                    {
                        "en": "The coroner thought that on the balance of probabilities, the pilot had suffered a stroke just before the crash.",
                        "vi": "Nhân viên điều tra nghĩ rằng trên sự cân bằng của các xác suất, phi công đã bị đột quỵ ngay trước khi máy bay rơi."
                    }
                ]
            },
            {
                "define": {
                    "en": "(considering) the evidence on both sides of an argument, to find the most likely reason for or result of something",
                    "vi": "(xem xét) bằng chứng về cả hai phía của một cuộc tranh luận, để tìm ra lý do có khả năng nhất cho hoặc kết quả của điều gì đó"
                },
                "examples": [
                    {
                        "en": "The coroner thought that on the balance of probabilities, the pilot had suffered a stroke just before the crash.",
                        "vi": "Nhân viên điều tra nghĩ rằng trên sự cân bằng của các xác suất, phi công đã bị đột quỵ ngay trước khi máy bay rơi."
                    }
                ]
            },
            {
                "define": {
                    "en": "it is very likely that",
                    "vi": "rất có thể là"
                },
                "examples": [
                    {
                        "en": "In all probability he failed to understand the consequences of his actions.",
                        "vi": "Trong tất cả khả năng anh ta không thể hiểu được hậu quả của hành động của mình."
                    },
                    {
                        "en": "In all probability she wouldn't come even if we invited her.",
                        "vi": "Trong tất cả khả năng cô ấy sẽ không đến ngay cả khi chúng tôi mời cô ấy."
                    }
                ]
            }
        ]
    },
    {
        "id": "58b6a25f4f6740cf8d8659e4fa3c5e1b",
        "word": "probable",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈprɒbəbl/",
            "us": "/ˈprɑːbəbl/"
        },
        "nearby": [
            {
                "word": "probabilistic",
                "pos": "adjective"
            },
            {
                "word": "probability",
                "pos": "noun"
            },
            {
                "word": "probable",
                "pos": "adjective"
            },
            {
                "word": "probable",
                "pos": "noun"
            },
            {
                "word": "probable cause",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "likely to happen, to exist or to be true",
                    "vi": "có khả năng xảy ra, tồn tại hoặc đúng"
                },
                "examples": [
                    {
                        "en": "the probable cause/explanation/outcome",
                        "vi": "nguyên nhân / giải thích / kết quả có thể xảy ra"
                    },
                    {
                        "en": "highly/quite/most probable",
                        "vi": "cao / khá / có thể xảy ra nhất"
                    },
                    {
                        "en": "It is probable that the disease has a genetic element.",
                        "vi": "Có khả năng bệnh có yếu tố di truyền."
                    }
                ]
            }
        ]
    },
    {
        "id": "fd7766eaea8e4a519ff5f5191da462a5",
        "word": "suspect",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/səˈspekt/",
            "us": "/səˈspekt/"
        },
        "nearby": [
            {
                "word": "sushi",
                "pos": "noun"
            },
            {
                "word": "Susie",
                "pos": ""
            },
            {
                "word": "suspect",
                "pos": "verb"
            },
            {
                "word": "suspect",
                "pos": "noun"
            },
            {
                "word": "suspect",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to have an idea that something is probably true or likely to happen, especially something bad, but without having definite proof",
                    "vi": "có ý tưởng rằng điều gì đó có thể đúng hoặc có khả năng xảy ra, đặc biệt là điều gì đó tồi tệ, nhưng không có bằng chứng chắc chắn"
                },
                "examples": [
                    {
                        "en": "As I had suspected all along, he was not a real policeman.",
                        "vi": "Như tôi đã nghi ngờ tất cả, anh ta không phải là một cảnh sát thực sự."
                    },
                    {
                        "en": "suspect something If you suspect a gas leak, do not strike a match or even turn on an electric light.",
                        "vi": "nghi ngờ điều gì đó Nếu bạn nghi ngờ có rò rỉ khí gas, không dùng que diêm hoặc thậm chí bật đèn điện."
                    },
                    {
                        "en": "Suspecting nothing, he walked right into the trap.",
                        "vi": "Không nghi ngờ gì nữa, anh ta chui ngay vào bẫy."
                    },
                    {
                        "en": "I didn’t want the neighbours suspecting anything.",
                        "vi": "Tôi không muốn hàng xóm nghi ngờ bất cứ điều gì."
                    },
                    {
                        "en": "suspect (that)… I began to suspect (that) they were trying to get rid of me.",
                        "vi": "nghi ngờ (điều đó)… Tôi bắt đầu nghi ngờ (rằng) họ đang cố gắng loại bỏ tôi."
                    },
                    {
                        "en": "I strongly suspect (that) this whole story is fictional.",
                        "vi": "Tôi thực sự nghi ngờ (rằng) toàn bộ câu chuyện này là hư cấu."
                    },
                    {
                        "en": "She had no reason to suspect (that) Sylvia had not been telling the truth.",
                        "vi": "Cô không có lý do gì để nghi ngờ (rằng) Sylvia đã không nói sự thật."
                    },
                    {
                        "en": "I suspect (that) she might be lying.",
                        "vi": "Tôi nghi ngờ (rằng) cô ấy có thể đang nói dối."
                    },
                    {
                        "en": "it is suspected that… It was suspected that the drugs had been brought into the country by boat.",
                        "vi": "người ta nghi ngờ rằng… Người ta nghi ngờ rằng ma túy đã được đưa vào đất nước bằng thuyền."
                    },
                    {
                        "en": "suspect somebody/something to be/have something She suspected him to be an impostor.",
                        "vi": "nghi ngờ ai đó / điều gì đó được / có điều gì đó Cô ấy nghi ngờ anh ta là kẻ mạo danh."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have an idea that somebody is guilty of something, without having definite proof",
                    "vi": "có ý tưởng rằng ai đó có tội với điều gì đó, mà không có bằng chứng rõ ràng"
                },
                "examples": [
                    {
                        "en": "suspect somebody/something of something He resigned after being suspected of theft.",
                        "vi": "nghi ngờ ai đó / điều gì đó về điều gì đó Anh ấy đã từ chức sau khi bị nghi ngờ ăn cắp."
                    },
                    {
                        "en": "He is not suspected of any involvement in the recent attacks.",
                        "vi": "Anh ta không bị nghi ngờ có liên quan đến các vụ tấn công gần đây."
                    },
                    {
                        "en": "He was wrongly suspected of the crime.",
                        "vi": "Anh ta đã bị nghi ngờ một cách sai lầm về tội ác."
                    },
                    {
                        "en": "They arrested four men suspected of links to an extremist group.",
                        "vi": "Họ đã bắt giữ 4 người đàn ông bị tình nghi có liên hệ với một nhóm cực đoan."
                    },
                    {
                        "en": "suspect somebody/something of doing something I suspected her of damaging the equipment.",
                        "vi": "nghi ngờ ai đó / điều gì đó đang làm gì đó Tôi nghi ngờ cô ấy làm hỏng thiết bị."
                    },
                    {
                        "en": "The drug is suspected of causing over 200 deaths.",
                        "vi": "Loại thuốc này bị nghi ngờ là nguyên nhân gây ra cái chết cho hơn 200 người."
                    },
                    {
                        "en": "suspect somebody/something Whom do the police suspect?",
                        "vi": "nghi ngờ ai đó / điều gì đó Cảnh sát nghi ngờ ai?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to feel that something is not completely right, legal or honest, without having any proof; to not trust something",
                    "vi": "cảm thấy rằng điều gì đó không hoàn toàn đúng, hợp pháp hoặc trung thực, mà không có bất kỳ bằng chứng nào; không tin tưởng một cái gì đó"
                },
                "examples": [
                    {
                        "en": "I suspected her motives in offering to help.",
                        "vi": "Tôi nghi ngờ động cơ của cô ấy trong việc đề nghị giúp đỡ."
                    },
                    {
                        "en": "He dealt through a broker whose honesty he had no reason to suspect.",
                        "vi": "Anh ta đã giao dịch thông qua một nhà môi giới mà anh ta không có lý do gì để nghi ngờ sự trung thực của họ."
                    }
                ]
            }
        ]
    },
    {
        "id": "2999476fe91748afbaab32ba73873ee2",
        "word": "easily",
        "pos": "adverb",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈiːzəli/",
            "us": "/ˈiːzəli/"
        },
        "nearby": [
            {
                "word": "ease up",
                "pos": "phrasal verb"
            },
            {
                "word": "ease up on",
                "pos": "phrasal verb"
            },
            {
                "word": "easily",
                "pos": "adverb"
            },
            {
                "word": "easiness",
                "pos": "noun"
            },
            {
                "word": "east",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "without problems or difficulty",
                    "vi": "không có vấn đề hoặc khó khăn"
                },
                "examples": [
                    {
                        "en": "The museum is easily accessible by car.",
                        "vi": "Có thể dễ dàng đến bảo tàng bằng ô tô."
                    },
                    {
                        "en": "The software is easily available.",
                        "vi": "Phần mềm có sẵn dễ dàng."
                    },
                    {
                        "en": "easily identifiable/recognizable/visible",
                        "vi": "dễ dàng nhận biết / nhận ra / nhìn thấy được"
                    },
                    {
                        "en": "I can easily finish it tonight.",
                        "vi": "Tôi có thể dễ dàng hoàn thành nó trong đêm nay."
                    },
                    {
                        "en": "The major problems of the city can be easily identified.",
                        "vi": "Có thể dễ dàng nhận ra những vấn đề lớn của thành phố."
                    },
                    {
                        "en": "Learning languages doesn't come easily to him.",
                        "vi": "Việc học ngôn ngữ không dễ dàng đến với anh ấy."
                    },
                    {
                        "en": "We won easily by six goals to two.",
                        "vi": "Chúng tôi đã thắng dễ dàng với tỷ số cách biệt sáu bàn."
                    }
                ]
            },
            {
                "define": {
                    "en": "very probably; very likely",
                    "vi": "rất có thể; rất có khả năng"
                },
                "examples": [
                    {
                        "en": "Are you sure you locked the gate? You could easily have forgotten.",
                        "vi": "Bạn có chắc là bạn đã khóa cổng? Bạn có thể dễ dàng quên."
                    },
                    {
                        "en": "The situation might all too easily have become a disaster.",
                        "vi": "Tình hình có thể quá dễ dàng đã trở thành một thảm họa."
                    }
                ]
            },
            {
                "define": {
                    "en": "without doubt; definitely",
                    "vi": "không nghi ngờ gì nữa; chắc chắn"
                },
                "examples": [
                    {
                        "en": "It's easily the best play I've seen this year.",
                        "vi": "Đây dễ dàng là vở kịch hay nhất mà tôi đã xem trong năm nay."
                    },
                    {
                        "en": "She is easily the most experienced teacher in the school.",
                        "vi": "Cô ấy dễ dàng là giáo viên có kinh nghiệm nhất trong trường."
                    }
                ]
            },
            {
                "define": {
                    "en": "quickly; more quickly than is usual",
                    "vi": "Mau; nhanh hơn bình thường"
                },
                "examples": [
                    {
                        "en": "I get bored easily.",
                        "vi": "Tôi dễ dàng chán nản."
                    },
                    {
                        "en": "He's easily distracted.",
                        "vi": "Anh ấy rất dễ bị phân tâm."
                    }
                ]
            }
        ]
    },
    {
        "id": "7b65b4acaa564322a16320b9bee0a7b3",
        "word": "outlook",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈaʊtlʊk/",
            "us": "/ˈaʊtlʊk/"
        },
        "nearby": [
            {
                "word": "outliner",
                "pos": "noun"
            },
            {
                "word": "outlive",
                "pos": "verb"
            },
            {
                "word": "outlook",
                "pos": "noun"
            },
            {
                "word": "outlying",
                "pos": "adjective"
            },
            {
                "word": "outmanoeuvre",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the attitude to life and the world of a particular person, group or culture",
                    "vi": "thái độ đối với cuộc sống và thế giới của một người, một nhóm hoặc một nền văn hóa cụ thể"
                },
                "examples": [
                    {
                        "en": "Travel broadens your outlook.",
                        "vi": "Du lịch mở rộng tầm nhìn của bạn."
                    },
                    {
                        "en": "a/an positive/optimistic outlook",
                        "vi": "a / một triển vọng tích cực / lạc quan"
                    },
                    {
                        "en": "a bleak/gloomy/pessimistic outlook",
                        "vi": "một triển vọng ảm đạm / u ám / bi quan"
                    },
                    {
                        "en": "outlook on something He had a practical outlook on life.",
                        "vi": "triển vọng về một cái gì đó Anh ấy đã có một cái nhìn thực tế về cuộc sống."
                    },
                    {
                        "en": "in outlook Most Western societies are liberal in outlook.",
                        "vi": "trong triển vọng Hầu hết các xã hội phương Tây đều có quan điểm tự do."
                    }
                ]
            },
            {
                "define": {
                    "en": "the likely future for somebody/something; what is likely to happen",
                    "vi": "tương lai có thể xảy ra cho ai đó / cái gì đó; điều gì có khả năng xảy ra"
                },
                "examples": [
                    {
                        "en": "the country’s economic outlook",
                        "vi": "triển vọng kinh tế của đất nước"
                    },
                    {
                        "en": "outlook for something The outlook for jobs is bleak.",
                        "vi": "triển vọng cho một cái gì đó Triển vọng cho việc làm là ảm đạm."
                    },
                    {
                        "en": "The outlook (= the probable weather) for the weekend is dry and sunny.",
                        "vi": "Triển vọng (= thời tiết có thể xảy ra) cho cuối tuần là khô và nắng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a view from a particular place",
                    "vi": "một cái nhìn từ một địa điểm cụ thể"
                },
                "examples": [
                    {
                        "en": "The house has a pleasant outlook over the valley.",
                        "vi": "Ngôi nhà có tầm nhìn dễ chịu ra thung lũng."
                    }
                ]
            }
        ]
    },
    {
        "id": "e3251830971644acb1112f139f75d33f",
        "word": "paradox",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈpærədɒks/",
            "us": "/ˈpærədɑːks/"
        },
        "nearby": [
            {
                "word": "paradise",
                "pos": "noun"
            },
            {
                "word": "Paradise Lost",
                "pos": ""
            },
            {
                "word": "paradox",
                "pos": "noun"
            },
            {
                "word": "paradoxical",
                "pos": "adjective"
            },
            {
                "word": "paradoxically",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person, thing or situation that has two opposite features and therefore seems strange",
                    "vi": "một người, sự vật hoặc tình huống có hai đặc điểm đối lập và do đó có vẻ kỳ lạ"
                },
                "examples": [
                    {
                        "en": "He was a paradox—a loner who loved to chat to strangers.",
                        "vi": "Anh ta là một kẻ nghịch lý - một kẻ cô độc thích trò chuyện với người lạ."
                    },
                    {
                        "en": "It is a curious paradox that professional comedians often have unhappy personal lives.",
                        "vi": "Có một nghịch lý gây tò mò là những nghệ sĩ hài chuyên nghiệp thường có cuộc sống cá nhân không hạnh phúc."
                    }
                ]
            },
            {
                "define": {
                    "en": "a statement containing two opposite ideas that make it seem impossible or unlikely, although it is probably true; the use of this in writing",
                    "vi": "một tuyên bố chứa hai ý kiến trái ngược nhau khiến điều đó dường như không thể hoặc khó xảy ra, mặc dù nó có thể đúng; việc sử dụng điều này trong văn bản"
                },
                "examples": [
                    {
                        "en": "‘More haste, less speed’ is a well-known paradox.",
                        "vi": "Nhanh hơn, ít tốc độ hơn' là một nghịch lý nổi tiếng."
                    },
                    {
                        "en": "It's a work full of paradox and ambiguity.",
                        "vi": "Đó là một công việc đầy nghịch lý và mơ hồ."
                    }
                ]
            }
        ]
    },
    {
        "id": "519bd82cd8f84669938fd4b4edcaf2b8",
        "word": "paradoxical",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌpærəˈdɒksɪkl/",
            "us": "/ˌpærəˈdɑːksɪkl/"
        },
        "nearby": [
            {
                "word": "Paradise Lost",
                "pos": ""
            },
            {
                "word": "paradox",
                "pos": "noun"
            },
            {
                "word": "paradoxical",
                "pos": "adjective"
            },
            {
                "word": "paradoxically",
                "pos": "adverb"
            },
            {
                "word": "paraffin",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "having two opposite features and therefore seeming strange",
                    "vi": "có hai đặc điểm trái ngược nhau và do đó có vẻ lạ"
                },
                "examples": [
                    {
                        "en": "It is paradoxical that some of the poorest people live in some of the richest areas of the country.",
                        "vi": "Có một nghịch lý là một số người nghèo nhất lại sống ở một số khu vực giàu có nhất của đất nước."
                    }
                ]
            },
            {
                "define": {
                    "en": "containing two opposite ideas that make it seem impossible or unlikely, although it is probably true",
                    "vi": "có chứa hai ý kiến trái ngược nhau khiến điều đó dường như không thể hoặc khó xảy ra, mặc dù nó có thể đúng"
                },
                "examples": [
                    {
                        "en": "These seemingly paradoxical statements need to be looked at a little further to get the true picture.",
                        "vi": "Những tuyên bố có vẻ nghịch lý này cần được nhìn xa hơn một chút để có được bức tranh chân thực."
                    }
                ]
            }
        ]
    },
    {
        "id": "e4d46e5a310244dcbd0c7bf8f57bc77a",
        "word": "presumably",
        "pos": "adverb",
        "level": "c1",
        "phonetic": {
            "uk": "/prɪˈzjuːməbli/",
            "us": "/prɪˈzuːməbli/"
        },
        "nearby": [
            {
                "word": "the Battle of Prestonpans",
                "pos": ""
            },
            {
                "word": "Prestwick",
                "pos": ""
            },
            {
                "word": "presumably",
                "pos": "adverb"
            },
            {
                "word": "presume",
                "pos": "verb"
            },
            {
                "word": "presume on",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "used to say that you think that something is probably true",
                    "vi": "từng nói rằng bạn nghĩ rằng điều gì đó có thể đúng"
                },
                "examples": [
                    {
                        "en": "Presumably this is where the accident happened.",
                        "vi": "Có lẽ đây là nơi xảy ra vụ tai nạn."
                    },
                    {
                        "en": "You'll be taking the car, presumably?",
                        "vi": "Có lẽ là bạn sẽ lấy xe?"
                    },
                    {
                        "en": "I couldn't concentrate, presumably because I was so tired.",
                        "vi": "Tôi không thể tập trung, có lẽ vì tôi quá mệt mỏi."
                    },
                    {
                        "en": "Presumably you’ll be leaving the children at home.",
                        "vi": "Có lẽ bạn sẽ để bọn trẻ ở nhà."
                    }
                ]
            }
        ]
    },
    {
        "id": "0a9809dbf6724d52a066c3f223aeaf6f",
        "word": "set",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/set/",
            "us": "/set/"
        },
        "nearby": [
            {
                "word": "set",
                "pos": "verb"
            },
            {
                "word": "set",
                "pos": "noun"
            },
            {
                "word": "set",
                "pos": "adjective"
            },
            {
                "word": "set about",
                "pos": "phrasal verb"
            },
            {
                "word": "set about doing",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "in a particular position",
                    "vi": "ở một vị trí cụ thể"
                },
                "examples": [
                    {
                        "en": "a house set in 40 acres of parkland",
                        "vi": "một ngôi nhà nằm trong 40 mẫu đất công viên"
                    },
                    {
                        "en": "He had close-set eyes.",
                        "vi": "Anh ta có đôi mắt cận."
                    }
                ]
            },
            {
                "define": {
                    "en": "planned or fixed",
                    "vi": "lên kế hoạch hoặc cố định"
                },
                "examples": [
                    {
                        "en": "Each person was given set jobs to do.",
                        "vi": "Mỗi người được giao những công việc phải làm."
                    },
                    {
                        "en": "The school funds a set number of free places.",
                        "vi": "Trường tài trợ cho một số địa điểm miễn phí."
                    },
                    {
                        "en": "Mornings in our house always follow a set pattern.",
                        "vi": "Buổi sáng trong nhà của chúng tôi luôn tuân theo một khuôn mẫu đã định."
                    },
                    {
                        "en": "New vehicles must comply with set safety standards.",
                        "vi": "Các phương tiện mới phải tuân thủ các tiêu chuẩn an toàn đã đặt ra."
                    }
                ]
            },
            {
                "define": {
                    "en": "not likely to change",
                    "vi": "không có khả năng thay đổi"
                },
                "examples": [
                    {
                        "en": "set ideas/opinions/views on how to teach",
                        "vi": "thiết lập ý tưởng / quan điểm / quan điểm về cách giảng dạy"
                    },
                    {
                        "en": "As people get older, they get set in their ways.",
                        "vi": "Khi mọi người già đi, họ sẽ theo cách của họ."
                    },
                    {
                        "en": "He had very set ideas of what he wanted.",
                        "vi": "Anh ấy đã có những ý tưởng rất chính xác về những gì anh ấy muốn."
                    }
                ]
            },
            {
                "define": {
                    "en": "having a fixed price and a limited choice of dishes",
                    "vi": "có một mức giá cố định và sự lựa chọn món ăn hạn chế"
                },
                "examples": [
                    {
                        "en": "a set dinner/lunch/meal",
                        "vi": "một bữa tối / bữa trưa / bữa ăn lập sẵn"
                    },
                    {
                        "en": "Shall we have the set menu?",
                        "vi": "Chúng ta có thực đơn không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "likely to do something; ready for something or to do something",
                    "vi": "có khả năng làm điều gì đó; sẵn sàng cho một cái gì đó hoặc để làm một cái gì đó"
                },
                "examples": [
                    {
                        "en": "set for something The team looks set for victory.",
                        "vi": "thiết lập cho một cái gì đó Đội trông mong muốn chiến thắng."
                    },
                    {
                        "en": "set to do something Interest rates look set to rise again.",
                        "vi": "thiết lập để làm điều gì đó Lãi suất có vẻ sẽ tăng trở lại."
                    },
                    {
                        "en": "Be set to leave by 10 o'clock.",
                        "vi": "Hãy chuẩn bị khởi hành trước 10 giờ."
                    },
                    {
                        "en": "Get set… Go!",
                        "vi": "Bắt đầu ... Đi!"
                    }
                ]
            },
            {
                "define": {
                    "en": "fixed; not natural",
                    "vi": "đã sửa; không thuộc về thiên nhiên"
                },
                "examples": [
                    {
                        "en": "a set smile",
                        "vi": "một nụ cười thiết lập"
                    },
                    {
                        "en": "His face took on a set expression.",
                        "vi": "Khuôn mặt của anh ấy có một biểu cảm cố định."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be strongly opposed to something",
                    "vi": "phản đối mạnh mẽ điều gì đó"
                },
                "examples": [
                    {
                        "en": "Why are you so dead set against the idea?",
                        "vi": "Tại sao bạn rất khó chống lại ý tưởng?"
                    },
                    {
                        "en": "Her father is dead set against the marriage.",
                        "vi": "Cha cô đã chết vì chống lại cuộc hôn nhân."
                    }
                ]
            },
            {
                "define": {
                    "en": "to want to do or have something very much; to be determined to do something",
                    "vi": "muốn làm hoặc có một cái gì đó rất nhiều; quyết tâm làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "She’s set on a career in medicine.",
                        "vi": "Cô ấy bắt đầu sự nghiệp trong ngành y."
                    },
                    {
                        "en": "He’s set on getting a new car",
                        "vi": "Anh ấy chuẩn bị có một chiếc xe hơi mới"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to tell runners in a race to get ready and then to start",
                    "vi": "được sử dụng để nói với những người chạy trong một cuộc đua hãy sẵn sàng và sau đó bắt đầu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "what you say to tell people to start a race",
                    "vi": "những gì bạn nói để nói với mọi người bắt đầu một cuộc đua"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "34bd3580f95149ecac33c526548c32f7",
        "word": "suspected",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/səˈspektɪd/",
            "us": "/səˈspektɪd/"
        },
        "nearby": [
            {
                "word": "suspect",
                "pos": "noun"
            },
            {
                "word": "suspect",
                "pos": "adjective"
            },
            {
                "word": "suspected",
                "pos": "adjective"
            },
            {
                "word": "suspend",
                "pos": "verb"
            },
            {
                "word": "suspended animation",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "believed to have probably happened, although there is no definite proof",
                    "vi": "được cho là có thể đã xảy ra, mặc dù không có bằng chứng chắc chắn"
                },
                "examples": [
                    {
                        "en": "a suspected broken arm",
                        "vi": "nghi ngờ bị gãy tay"
                    },
                    {
                        "en": "suspected tax evasion",
                        "vi": "nghi ngờ trốn thuế"
                    }
                ]
            },
            {
                "define": {
                    "en": "believed to be guilty of something, although there is no definite proof",
                    "vi": "được cho là có tội với điều gì đó, mặc dù không có bằng chứng chắc chắn"
                },
                "examples": [
                    {
                        "en": "suspected terrorists",
                        "vi": "những kẻ khủng bố bị nghi ngờ"
                    }
                ]
            }
        ]
    },
    {
        "id": "b8e7d0cd7d20467585e51bcac839aac3",
        "word": "well",
        "pos": "adverb",
        "level": "c1",
        "phonetic": {
            "uk": "/wel/",
            "us": "/wel/"
        },
        "nearby": [
            {
                "word": "Welfare to Work",
                "pos": ""
            },
            {
                "word": "welkin",
                "pos": "noun"
            },
            {
                "word": "well",
                "pos": "adverb"
            },
            {
                "word": "we'll",
                "pos": "short form"
            },
            {
                "word": "well",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "in a good, right or acceptable way",
                    "vi": "theo cách tốt, đúng hoặc có thể chấp nhận được"
                },
                "examples": [
                    {
                        "en": "They played well in the tournament.",
                        "vi": "Họ đã chơi tốt trong giải đấu."
                    },
                    {
                        "en": "The team work well together.",
                        "vi": "Nhóm làm việc tốt với nhau."
                    },
                    {
                        "en": "The kids all behaved well.",
                        "vi": "Những đứa trẻ đều cư xử tốt."
                    },
                    {
                        "en": "The conference was very well organized.",
                        "vi": "Hội nghị đã được tổ chức rất tốt."
                    },
                    {
                        "en": "Well done! (= expressing admiration for what somebody has done)",
                        "vi": "Làm tốt! (= bày tỏ sự ngưỡng mộ đối với những gì ai đó đã làm)"
                    },
                    {
                        "en": "His campaign was not going well.",
                        "vi": "Chiến dịch của anh ấy đã không diễn ra tốt đẹp."
                    },
                    {
                        "en": "These animals make very good pets if treated well (= with kindness).",
                        "vi": "Những con vật này trở thành vật nuôi rất tốt nếu được đối xử tốt (= với lòng tốt)."
                    },
                    {
                        "en": "People spoke well of (= spoke with approval of) him.",
                        "vi": "Mọi người đã nói tốt về (= nói với sự tán thành của) anh ấy."
                    },
                    {
                        "en": "She took it very well (= did not react too badly), all things considered.",
                        "vi": "Cô ấy tiếp thu rất tốt (= không phản ứng quá tệ), tất cả mọi thứ đều cân nhắc."
                    },
                    {
                        "en": "They lived well (= in comfort and spending a lot of money) and were generous with their money.",
                        "vi": "Họ sống tốt (= an nhàn và tiêu nhiều tiền) và hào phóng với tiền của họ."
                    },
                    {
                        "en": "She was determined to marry well (= marry somebody rich and/or with a high social position).",
                        "vi": "Cô ấy quyết tâm kết hôn tốt (= kết hôn với ai đó giàu có và / hoặc có vị trí xã hội cao)."
                    }
                ]
            },
            {
                "define": {
                    "en": "completely and properly",
                    "vi": "hoàn toàn và đúng cách"
                },
                "examples": [
                    {
                        "en": "Add the lemon juice and mix well.",
                        "vi": "Thêm nước cốt chanh và trộn đều."
                    },
                    {
                        "en": "The surface must be well prepared before you start to paint.",
                        "vi": "Bề mặt phải được chuẩn bị tốt trước khi bạn bắt đầu sơn."
                    },
                    {
                        "en": "How well do you know Carla?",
                        "vi": "Làm thế nào để bạn biết Carla?"
                    },
                    {
                        "en": "He's well able to take care of himself.",
                        "vi": "Anh ấy có thể tự chăm sóc bản thân rất tốt."
                    },
                    {
                        "en": "a well trained dog",
                        "vi": "một con chó được huấn luyện tốt"
                    }
                ]
            },
            {
                "define": {
                    "en": "to a great extent or degree",
                    "vi": "ở một mức độ hoặc mức độ lớn"
                },
                "examples": [
                    {
                        "en": "He was driving at well over the speed limit.",
                        "vi": "Anh ta đã lái xe vượt quá tốc độ cho phép."
                    },
                    {
                        "en": "She is well aware of the dangers.",
                        "vi": "Cô ấy nhận thức rõ về những nguy hiểm."
                    },
                    {
                        "en": "They are very well suited to each other.",
                        "vi": "Chúng rất phù hợp với nhau."
                    },
                    {
                        "en": "a well-loved tale",
                        "vi": "một câu chuyện được yêu thích"
                    },
                    {
                        "en": "The castle is well worth a visit.",
                        "vi": "Lâu đài rất đáng để ghé thăm."
                    },
                    {
                        "en": "He liked her well enough (= to a reasonable degree) but he wasn't going to make a close friend of her.",
                        "vi": "Anh ấy thích cô ấy đủ tốt (= ở một mức độ hợp lý) nhưng anh ấy sẽ không trở thành bạn thân của cô ấy."
                    },
                    {
                        "en": "(British English, informal) I was well annoyed, I can tell you.",
                        "vi": "(Anh Anh, thân mật) Tôi rất khó chịu, tôi có thể nói với bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "easily",
                    "vi": "một cách dễ dàng"
                },
                "examples": [
                    {
                        "en": "She could well afford to pay for it herself.",
                        "vi": "Cô ấy có đủ khả năng để tự trả cho nó."
                    }
                ]
            },
            {
                "define": {
                    "en": "probably",
                    "vi": "có lẽ"
                },
                "examples": [
                    {
                        "en": "You may well be right.",
                        "vi": "Bạn cũng có thể đúng."
                    },
                    {
                        "en": "It may well be that the train is delayed.",
                        "vi": "Cũng có thể là chuyến tàu bị hoãn."
                    }
                ]
            },
            {
                "define": {
                    "en": "with good reason",
                    "vi": "với lý do chính đáng"
                },
                "examples": [
                    {
                        "en": "I can't very well leave now.",
                        "vi": "Tôi không thể rời đi bây giờ rất tốt."
                    },
                    {
                        "en": "I couldn't very well refuse to help them, could I?",
                        "vi": "Tôi rất không thể từ chối giúp đỡ họ, phải không?"
                    },
                    {
                        "en": "‘What are we doing here?’ ‘You may well ask (= I don't really know either).’",
                        "vi": "Chúng tôi đang làm gì ở đây?' 'Bạn cũng có thể hỏi (= Tôi cũng không thực sự biết).'"
                    }
                ]
            },
            {
                "define": {
                    "en": "in addition to somebody/something; too",
                    "vi": "ngoài ai đó / cái gì đó; cũng vậy"
                },
                "examples": [
                    {
                        "en": "Are they coming as well?",
                        "vi": "Họ cũng đến chứ?"
                    },
                    {
                        "en": "They sell books as well as newspapers.",
                        "vi": "Họ bán sách cũng như báo."
                    },
                    {
                        "en": "She is a talented musician as well as being a photographer.",
                        "vi": "Cô ấy là một nhạc sĩ tài năng cũng như là một nhiếp ảnh gia."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be getting healthier after an illness; to be in good health after a birth",
                    "vi": "để trở nên khỏe mạnh hơn sau một trận ốm; để có sức khỏe tốt sau khi sinh"
                },
                "examples": [
                    {
                        "en": "Mother and baby are doing well.",
                        "vi": "Mẹ và con đều khỏe."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have nearly achieved something and be going to achieve it soon",
                    "vi": "gần đạt được điều gì đó và sẽ sớm đạt được nó"
                },
                "examples": [
                    {
                        "en": "She is well on the way to recovery.",
                        "vi": "Cô ấy đang trên đường hồi phục tốt."
                    },
                    {
                        "en": "He is well on the way to establishing himself among the top ten players in the world.",
                        "vi": "Anh ấy đang trên đường khẳng định mình trong số 10 cầu thủ hàng đầu thế giới."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be lucky that you are not involved in something unpleasant or difficult to deal with",
                    "vi": "may mắn là bạn không dính líu đến điều gì đó khó chịu hoặc khó giải quyết"
                },
                "examples": [
                    {
                        "en": "I don’t know exactly what’s been going on. I only know that you’re well out of it.",
                        "vi": "Tôi không biết chính xác chuyện gì đang xảy ra. Tôi chỉ biết rằng bạn đã vượt qua nó."
                    }
                ]
            },
            {
                "define": {
                    "en": "to know a lot about something",
                    "vi": "để biết nhiều điều về điều gì đó"
                },
                "examples": [
                    {
                        "en": "He's well up in all the latest developments.",
                        "vi": "Anh ấy khỏe lên trong tất cả các diễn biến mới nhất."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to emphasize an angry statement or an order",
                    "vi": "được sử dụng để nhấn mạnh một tuyên bố tức giận hoặc một mệnh lệnh"
                },
                "examples": [
                    {
                        "en": "You can bloody well keep your job—I don't want it!",
                        "vi": "Bạn cũng có thể giữ được công việc của mình — tôi không muốn!"
                    },
                    {
                        "en": "‘I’m not coming.’ ‘Yes, you bloody well are!’",
                        "vi": "Tôi không đén.' \"Vâng, bạn rất tốt!\""
                    },
                    {
                        "en": "You're fucking well coming whether you want to or not.",
                        "vi": "Bạn đang đến rất tốt cho dù bạn có muốn hay không."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to emphasize an angry statement or an order",
                    "vi": "được sử dụng để nhấn mạnh một tuyên bố tức giận hoặc một mệnh lệnh"
                },
                "examples": [
                    {
                        "en": "You can bloody well keep your job—I don't want it!",
                        "vi": "Bạn cũng có thể giữ được công việc của mình — tôi không muốn!"
                    },
                    {
                        "en": "‘I’m not coming.’ ‘Yes, you bloody well are!’",
                        "vi": "Tôi không đén.' \"Vâng, bạn rất tốt!\""
                    }
                ]
            },
            {
                "define": {
                    "en": "to be successful",
                    "vi": "để đạt thanh công"
                },
                "examples": [
                    {
                        "en": "Jack is doing very well at school.",
                        "vi": "Jack học rất tốt ở trường."
                    }
                ]
            },
            {
                "define": {
                    "en": "to treat somebody generously",
                    "vi": "đối xử hào phóng với ai đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to become successful or rich",
                    "vi": "để trở nên thành công hoặc giàu có"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to make a profit or get money from somebody/something",
                    "vi": "để kiếm lợi nhuận hoặc nhận tiền từ ai đó / cái gì đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be sensible or wise to do something",
                    "vi": "hợp lý hoặc khôn ngoan khi làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "He would do well to concentrate more on his work.",
                        "vi": "Anh ấy sẽ làm tốt để tập trung hơn vào công việc của mình."
                    },
                    {
                        "en": "You did well to sell when the price was high.",
                        "vi": "Bạn đã bán tốt khi giá cao."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to emphasize an angry statement or an order",
                    "vi": "được sử dụng để nhấn mạnh một tuyên bố tức giận hoặc một mệnh lệnh"
                },
                "examples": [
                    {
                        "en": "You're fucking well coming whether you want to or not.",
                        "vi": "Bạn đang đến rất tốt cho dù bạn có muốn hay không."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to emphasize a statement when you are annoyed about something",
                    "vi": "được sử dụng để nhấn mạnh một tuyên bố khi bạn khó chịu về điều gì đó"
                },
                "examples": [
                    {
                        "en": "If you don't come now, you can jolly well walk home!",
                        "vi": "Nếu bạn không đến bây giờ, bạn có thể vui vẻ đi bộ về nhà!"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to criticize somebody by saying that they should realize or understand something",
                    "vi": "được sử dụng để chỉ trích ai đó bằng cách nói rằng họ nên nhận ra hoặc hiểu điều gì đó"
                },
                "examples": [
                    {
                        "en": "You know as well as I do that you're being unreasonable.",
                        "vi": "Bạn cũng như tôi biết rằng bạn đang không hợp lý."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be very aware of a fact and unable to deny or ignore it",
                    "vi": "nhận thức rất rõ về một sự kiện và không thể phủ nhận hoặc phớt lờ nó"
                },
                "examples": [
                    {
                        "en": "He knew full well what she thought of it.",
                        "vi": "Anh biết rõ cô nghĩ gì về nó."
                    }
                ]
            },
            {
                "define": {
                    "en": "to not get involved in something that you have no connection with",
                    "vi": "để không tham gia vào một cái gì đó mà bạn không có liên hệ với"
                },
                "examples": [
                    {
                        "en": "When it comes to other people's arguments, it's better to leave well alone.",
                        "vi": "Khi nói đến lý lẽ của người khác, tốt hơn hết bạn nên để yên."
                    }
                ]
            },
            {
                "define": {
                    "en": "if you are going to be punished for doing something wrong, whether it is a big or small thing, you may as well do the big thing",
                    "vi": "Nếu bạn sẽ bị trừng phạt vì làm điều gì đó sai trái, dù đó là việc lớn hay việc nhỏ, bạn cũng có thể làm được việc lớn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to say that something seems the best thing to do in the situation that you are in, although you may not really want to do it",
                    "vi": "được sử dụng để nói rằng điều gì đó dường như là điều tốt nhất để làm trong tình huống mà bạn đang ở, mặc dù bạn có thể không thực sự muốn làm điều đó"
                },
                "examples": [
                    {
                        "en": "If no one else wants it, we might as well give it to him.",
                        "vi": "Nếu không ai muốn nó, chúng tôi cũng có thể đưa nó cho anh ta."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that there is no real difference between two things that you might do",
                    "vi": "được sử dụng để nói rằng không có sự khác biệt thực sự giữa hai điều mà bạn có thể làm"
                },
                "examples": [
                    {
                        "en": "If you are going to have sugar, you may as well have a bar of chocolate.",
                        "vi": "Nếu bạn chuẩn bị có đường, bạn cũng có thể có một thanh sô cô la."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have good intentions, although their effect may not be good",
                    "vi": "có ý định tốt, mặc dù tác dụng của chúng có thể không tốt"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "almost; almost completely",
                    "vi": "hầu hết; gần như hoàn toàn"
                },
                "examples": [
                    {
                        "en": "One dog looks pretty much like another to me.",
                        "vi": "Với tôi, một con chó trông khá giống một con khác."
                    },
                    {
                        "en": "He goes out pretty well every night.",
                        "vi": "Anh ấy đi ra ngoài khá tốt mỗi đêm."
                    },
                    {
                        "en": "The first stage is pretty near finished.",
                        "vi": "Giai đoạn đầu tiên là khá gần hoàn thành."
                    }
                ]
            },
            {
                "define": {
                    "en": "completely",
                    "vi": "hoàn toàn"
                },
                "examples": [
                    {
                        "en": "By that time we were well and truly lost.",
                        "vi": "Vào thời điểm đó, chúng tôi đã khỏe và thực sự mất mát."
                    }
                ]
            },
            {
                "define": {
                    "en": "having made good progress",
                    "vi": "có tiến bộ tốt"
                },
                "examples": [
                    {
                        "en": "If we got Terry to do that, we'd be well away.",
                        "vi": "Nếu chúng tôi để Terry làm điều đó, chúng tôi sẽ đi xa."
                    }
                ]
            },
            {
                "define": {
                    "en": "drunk or in a deep sleep",
                    "vi": "say rượu hoặc trong giấc ngủ sâu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be good friends with somebody, especially somebody important",
                    "vi": "trở thành bạn tốt với ai đó, đặc biệt là ai đó quan trọng"
                },
                "examples": [
                    {
                        "en": "She seems to be well in with all the right people.",
                        "vi": "Cô ấy có vẻ hòa thuận với tất cả những người phù hợp."
                    }
                ]
            }
        ]
    },
    {
        "id": "2c35650e8ead4168a9a3f2483dae5e80",
        "word": "you’ll be lucky",
        "pos": "idiom",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈlʌki/",
            "us": "/ˈlʌki/"
        },
        "nearby": [
            {
                "word": "luckless",
                "pos": "adjective"
            },
            {
                "word": "luck out",
                "pos": "phrasal verb"
            },
            {
                "word": "lucky",
                "pos": "adjective"
            },
            {
                "word": "lucky dip",
                "pos": "noun"
            },
            {
                "word": "Lucky Jim",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "having good luck",
                    "vi": "chúc may mắn"
                },
                "examples": [
                    {
                        "en": "lucky to do something His friend was killed and he knows he is lucky to be alive.",
                        "vi": "may mắn khi làm điều gì đó Bạn của anh ấy đã bị giết và anh ấy biết rằng anh ấy may mắn còn sống."
                    },
                    {
                        "en": "She was lucky enough to be chosen for the team.",
                        "vi": "Cô ấy may mắn được chọn vào đội."
                    },
                    {
                        "en": "lucky (that) You were lucky (that) you spotted the danger in time.",
                        "vi": "may mắn (điều đó) Bạn đã may mắn (điều đó) bạn đã phát hiện ra nguy hiểm kịp thời."
                    },
                    {
                        "en": "In terms of my career I feel incredibly lucky.",
                        "vi": "Về sự nghiệp, tôi cảm thấy mình may mắn vô cùng."
                    },
                    {
                        "en": "You can think yourself lucky you didn't get mugged.",
                        "vi": "Bạn có thể nghĩ rằng mình may mắn khi không bị cản trở."
                    },
                    {
                        "en": "She counted herself lucky that she still had a job.",
                        "vi": "Cô tự cho rằng mình may mắn vì vẫn còn có việc làm."
                    },
                    {
                        "en": "Mark is one of the lucky ones—he at least has somewhere to sleep.",
                        "vi": "Mark là một trong những người may mắn - ít nhất anh ấy cũng có chỗ nào đó để ngủ."
                    },
                    {
                        "en": "the lucky winners",
                        "vi": "những người chiến thắng may mắn"
                    },
                    {
                        "en": "He was among the lucky ones whose works were approved.",
                        "vi": "Anh ấy nằm trong số những người may mắn có tác phẩm được duyệt."
                    }
                ]
            },
            {
                "define": {
                    "en": "being the result of good luck",
                    "vi": "là kết quả của sự may mắn"
                },
                "examples": [
                    {
                        "en": "lucky for somebody that… It was lucky for us that we were able to go.",
                        "vi": "may mắn cho ai đó… Thật may mắn cho chúng tôi là chúng tôi đã có thể đi."
                    },
                    {
                        "en": "lucky for somebody Lucky for her, a police car was passing.",
                        "vi": "may mắn cho ai đó May mắn cho cô ấy, một chiếc xe cảnh sát đã chạy qua."
                    },
                    {
                        "en": "lucky (that) It is lucky (that) neither were killed in the accident.",
                        "vi": "may mắn (điều đó) Thật may mắn (điều đó) không ai thiệt mạng trong vụ tai nạn."
                    },
                    {
                        "en": "That was the luckiest escape of my life.",
                        "vi": "Đó là lần trốn thoát may mắn nhất trong đời tôi."
                    },
                    {
                        "en": "a lucky guess",
                        "vi": "một dự đoán may mắn"
                    },
                    {
                        "en": "A lucky find on the edge of the Cotswolds is helping archaeologists discover what life was like in Roman Britain.",
                        "vi": "Một phát hiện may mắn ở rìa Cotswolds đang giúp các nhà khảo cổ học khám phá ra cuộc sống ở Anh thời La Mã."
                    },
                    {
                        "en": "I had a lucky break when I left school getting a job on local radio.",
                        "vi": "Tôi đã có một kỳ nghỉ may mắn khi tôi rời trường học và nhận được một công việc trên đài phát thanh địa phương."
                    }
                ]
            },
            {
                "define": {
                    "en": "bringing good luck",
                    "vi": "mang lại may mắn"
                },
                "examples": [
                    {
                        "en": "a lucky charm",
                        "vi": "một cái bùa may mắn"
                    },
                    {
                        "en": "The team thinks of me as their lucky mascot.",
                        "vi": "Nhóm nghiên cứu coi tôi như linh vật may mắn của họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have good luck",
                    "vi": "chúc may mắn"
                },
                "examples": [
                    {
                        "en": "She hopes that some day she'll get lucky and win the jackpot.",
                        "vi": "Cô ấy hy vọng rằng một ngày nào đó mình sẽ gặp may mắn và trúng số độc đắc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to meet somebody new and have sex with them",
                    "vi": "gặp ai đó mới và quan hệ tình dục với họ"
                },
                "examples": [
                    {
                        "en": "Mike's hoping to get lucky tonight.",
                        "vi": "Mike hy vọng sẽ gặp may mắn tối nay."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to show that you think somebody is lucky to have something, be able to do something, etc.",
                    "vi": "được sử dụng để thể hiện rằng bạn nghĩ rằng ai đó may mắn có được điều gì đó, có thể làm được điều gì đó, v.v."
                },
                "examples": [
                    {
                        "en": "‘I'm off to Paris.’ ‘Lucky you!’",
                        "vi": "Tôi đi Paris.' 'Bạn thật may mắn!'"
                    }
                ]
            },
            {
                "define": {
                    "en": "to have good luck",
                    "vi": "chúc may mắn"
                },
                "examples": [
                    {
                        "en": "We certainly struck it lucky with the weather.",
                        "vi": "Chúng tôi chắc chắn đã đánh nó một cách may mắn với thời tiết."
                    }
                ]
            },
            {
                "define": {
                    "en": "to feel very grateful and lucky about something",
                    "vi": "cảm thấy rất biết ơn và may mắn về điều gì đó"
                },
                "examples": [
                    {
                        "en": "Just thank your lucky stars you weren’t in the house at the time.",
                        "vi": "Chỉ cần cảm ơn những ngôi sao may mắn của bạn khi bạn không ở trong nhà vào thời điểm đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "used when you have failed to do something twice and hope that you will succeed the third time",
                    "vi": "được sử dụng khi bạn đã thất bại trong việc làm điều gì đó hai lần và hy vọng rằng bạn sẽ thành công lần thứ ba"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to tell somebody that something that they are expecting probably will not happen",
                    "vi": "được sử dụng để nói với ai đó rằng điều gì đó mà họ đang mong đợi có thể sẽ không xảy ra"
                },
                "examples": [
                    {
                        "en": "‘I was hoping to get a ticket for Saturday.’ ‘You'll be lucky.’",
                        "vi": "Tôi đã hy vọng có được một vé cho thứ Bảy.' 'Bạn sẽ gặp may mắn.'"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to tell somebody that they will probably not get what they are hoping for, and may not deserve it",
                    "vi": "được sử dụng để nói với ai đó rằng họ có thể sẽ không đạt được những gì họ đang hy vọng, và có thể không xứng đáng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "1da94d18db324d5981ce9df7100fa0a7",
        "word": "(as) like as not",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/laɪk/",
            "us": "/laɪk/"
        },
        "nearby": [
            {
                "word": "like",
                "pos": "conjunction"
            },
            {
                "word": "like",
                "pos": "adjective"
            },
            {
                "word": "like",
                "pos": "adverb"
            },
            {
                "word": "likeable",
                "pos": "adjective"
            },
            {
                "word": "likelihood",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "used in very informal speech, for example when you are thinking what to say next, explaining something, or giving an example of something",
                    "vi": "được sử dụng trong bài phát biểu rất thân mật, chẳng hạn như khi bạn đang nghĩ phải nói gì tiếp theo, giải thích điều gì đó hoặc đưa ra ví dụ về điều gì đó"
                },
                "examples": [
                    {
                        "en": "It was, like, weird.",
                        "vi": "Nó, giống như, kỳ lạ."
                    },
                    {
                        "en": "It was kind of scary, like.",
                        "vi": "Đó là một loại đáng sợ, giống như."
                    },
                    {
                        "en": "It's really hard. Like I have no time for my own work.",
                        "vi": "Nó thật sự khó. Giống như tôi không có thời gian cho công việc của riêng mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "used in very informal speech to show that what you are saying may not be exactly right but is nearly so",
                    "vi": "được sử dụng trong bài phát biểu rất thân mật để cho thấy rằng những gì bạn đang nói có thể không chính xác nhưng gần như vậy"
                },
                "examples": [
                    {
                        "en": "I'm leaving in like twenty minutes.",
                        "vi": "Tôi sẽ rời đi trong khoảng hai mươi phút nữa."
                    },
                    {
                        "en": "It's going to cost like a hundred dollars.",
                        "vi": "Nó sẽ có giá như một trăm đô la."
                    }
                ]
            },
            {
                "define": {
                    "en": "used in very informal speech, to mean ‘I say’, ‘he/she says’, etc.",
                    "vi": "được sử dụng trong bài phát biểu rất thân mật, có nghĩa là 'tôi nói', 'anh ấy / cô ấy nói', v.v."
                },
                "examples": [
                    {
                        "en": "And then I'm like ‘No Way!’",
                        "vi": "Và sau đó tôi giống như 'Không có cách nào!'"
                    }
                ]
            },
            {
                "define": {
                    "en": "used in informal speech instead of as to say that something happens in the same way",
                    "vi": "được sử dụng trong lời nói thân mật thay vì để nói rằng điều gì đó xảy ra theo cùng một cách"
                },
                "examples": [
                    {
                        "en": "There was silence, but not like before.",
                        "vi": "Có sự im lặng, nhưng không giống như trước đây."
                    }
                ]
            },
            {
                "define": {
                    "en": "quite probably",
                    "vi": "khá có thể"
                },
                "examples": [
                    {
                        "en": "She would be in bed by now, as like as not.",
                        "vi": "Cô ấy sẽ ở trên giường bây giờ, như không."
                    }
                ]
            }
        ]
    },
    {
        "id": "714ebc4d028b41569b2a06fa9392959c",
        "word": "admit of",
        "pos": "phrasal verb",
        "level": "c2",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "admission",
                "pos": "noun"
            },
            {
                "word": "admit",
                "pos": "verb"
            },
            {
                "word": "admit of",
                "pos": "phrasal verb"
            },
            {
                "word": "admittance",
                "pos": "noun"
            },
            {
                "word": "admittedly",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to show that something is possible or likely as a solution, an explanation, etc.",
                    "vi": "để chỉ ra rằng điều gì đó có thể xảy ra hoặc có khả năng xảy ra như một giải pháp, một lời giải thích, v.v."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "1ec19fc21d1349da860bfad69c88713c",
        "word": "a good/safe/sure bet",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/bet/",
            "us": "/bet/"
        },
        "nearby": [
            {
                "word": "besuited",
                "pos": "adjective"
            },
            {
                "word": "bet",
                "pos": "verb"
            },
            {
                "word": "bet",
                "pos": "noun"
            },
            {
                "word": "beta",
                "pos": "noun"
            },
            {
                "word": "beta blocker",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an arrangement to risk money, etc. on the result of a particular event; the money that you risk in this way",
                    "vi": "một thỏa thuận để rủi ro tiền bạc, v.v. dựa trên kết quả của một sự kiện cụ thể; số tiền mà bạn mạo hiểm theo cách này"
                },
                "examples": [
                    {
                        "en": "to win/lose a bet",
                        "vi": "thắng / thua cược"
                    },
                    {
                        "en": "I was tempted to place a large bet.",
                        "vi": "Tôi đã bị cám dỗ để đặt một cược lớn."
                    },
                    {
                        "en": "bet on something We've got a bet on who's going to arrive first.",
                        "vi": "đặt cược vào điều gì đó Chúng tôi đã đặt cược xem ai sẽ đến trước."
                    },
                    {
                        "en": "He had a bet on the horses.",
                        "vi": "Anh ta đã đặt cược vào những con ngựa."
                    },
                    {
                        "en": "They all put a bet on the race.",
                        "vi": "Tất cả đều đặt cược vào cuộc đua."
                    },
                    {
                        "en": "I hear you're taking bets on whether she'll marry him.",
                        "vi": "Tôi nghe nói bạn đang đặt cược vào việc liệu cô ấy có kết hôn với anh ấy không."
                    },
                    {
                        "en": "I did it for a bet (= because somebody had agreed to pay me money if I did).",
                        "vi": "Tôi đã làm điều đó để đặt cược (= bởi vì ai đó đã đồng ý trả tiền cho tôi nếu tôi làm vậy)."
                    },
                    {
                        "en": "‘Liverpool are bound to win.’ ‘Do you want a bet?’ (= I disagree with you, I don't think they will.)",
                        "vi": "Liverpool nhất định giành chiến thắng.' 'Bạn có muốn cá cược không?' (= Tôi không đồng ý với bạn, tôi không nghĩ họ sẽ làm như vậy.)"
                    }
                ]
            },
            {
                "define": {
                    "en": "an opinion about what is likely to happen or to have happened",
                    "vi": "một ý kiến về những gì có thể xảy ra hoặc đã xảy ra"
                },
                "examples": [
                    {
                        "en": "My bet is that they've been held up in traffic.",
                        "vi": "Cá của tôi là họ đã bị tắc nghẽn giao thông."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that if a particular event happens then your current prediction, agreement, etc. will no longer apply",
                    "vi": "được sử dụng để nói rằng nếu một sự kiện cụ thể xảy ra thì dự đoán, thỏa thuận, v.v. hiện tại của bạn sẽ không còn áp dụng"
                },
                "examples": [
                    {
                        "en": "We expect shares to rise unless the economy slows down again, in which case all bets are off.",
                        "vi": "Chúng tôi kỳ vọng cổ phiếu sẽ tăng trừ khi nền kinh tế giảm tốc trở lại, trong trường hợp đó, tất cả các cược đều tắt."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to tell somebody what is the best action for them to take to get the result they want",
                    "vi": "được sử dụng để nói với ai đó hành động tốt nhất để họ thực hiện để đạt được kết quả họ muốn"
                },
                "examples": [
                    {
                        "en": "If you want to get around London fast, the Underground is your best bet.",
                        "vi": "Nếu bạn muốn đi vòng quanh London nhanh chóng, thì Tàu điện ngầm là lựa chọn tốt nhất cho bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "something that is likely to happen, to succeed or to be suitable",
                    "vi": "điều gì đó có khả năng xảy ra, thành công hoặc phù hợp"
                },
                "examples": [
                    {
                        "en": "He's a good bet to earn a spot on the US team.",
                        "vi": "Anh ấy đánh cược tốt để kiếm được một suất trong đội tuyển Mỹ."
                    },
                    {
                        "en": "Clothes are a safe bet as a present for a teenager.",
                        "vi": "Quần áo là một món quà an toàn như một món quà cho một thiếu niên."
                    },
                    {
                        "en": "The movie looks like a sure bet for Best Film.",
                        "vi": "Bộ phim có vẻ như một sự đặt cược chắc chắn cho Phim hay nhất."
                    }
                ]
            },
            {
                "define": {
                    "en": "to reduce the risk of losing or making a mistake by supporting more than one side in a competition, an argument, etc., or by having several choices available to you",
                    "vi": "để giảm nguy cơ thua cuộc hoặc mắc sai lầm bằng cách hỗ trợ nhiều hơn một bên trong một cuộc cạnh tranh, một cuộc tranh cãi, v.v. hoặc bằng cách cung cấp một số lựa chọn cho bạn"
                },
                "examples": [
                    {
                        "en": "She hedged her bets by applying for various other jobs as well.",
                        "vi": "Cô ấy cũng đã tự bảo hiểm tiền cược của mình bằng cách nộp đơn cho nhiều công việc khác."
                    }
                ]
            }
        ]
    },
    {
        "id": "fd04c4042ed6488f82952118a30be530",
        "word": "a priori",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌeɪ praɪˈɔːraɪ/",
            "us": "/ˌɑː priˈɔːri/"
        },
        "nearby": [
            {
                "word": "April Fool",
                "pos": "noun"
            },
            {
                "word": "April Fool's Day",
                "pos": ""
            },
            {
                "word": "a priori",
                "pos": "adjective, adverb"
            },
            {
                "word": "apron",
                "pos": "noun"
            },
            {
                "word": "apropos",
                "pos": "preposition"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "using facts or principles that are known to be true in order to decide what the likely effects or results of something will be, for example saying ‘They haven’t eaten anything all day so they must be hungry.’",
                    "vi": "sử dụng các sự kiện hoặc nguyên tắc được biết là đúng để quyết định những tác động hoặc kết quả có thể xảy ra của một việc gì đó, chẳng hạn như nói 'Họ chưa ăn gì cả ngày nên họ phải đói.'"
                },
                "examples": [
                    {
                        "en": "an a priori assumption",
                        "vi": "một giả định tiên nghiệm"
                    }
                ]
            }
        ]
    },
    {
        "id": "c3073fa0872a4fc193d26815ed86c231",
        "word": "I dare say",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/deə(r)/",
            "us": "/der/"
        },
        "nearby": [
            {
                "word": "Darcey",
                "pos": ""
            },
            {
                "word": "the Dardanelles",
                "pos": ""
            },
            {
                "word": "dare",
                "pos": "verb"
            },
            {
                "word": "dare",
                "pos": "noun"
            },
            {
                "word": "daredevil",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to be brave enough to do something",
                    "vi": "đủ can đảm để làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "She said it as loudly as she dared.",
                        "vi": "Cô ấy nói to như cô ấy dám."
                    },
                    {
                        "en": "dare (to) do something He didn’t dare (to) say what he thought.",
                        "vi": "dám (để) làm điều gì đó Anh ấy không dám (để) nói những gì anh ấy nghĩ."
                    },
                    {
                        "en": "They daren't ask for any more money.",
                        "vi": "Họ không dám đòi tiền nữa."
                    },
                    {
                        "en": "(literary) She dared not breathe a word of it to anybody.",
                        "vi": "(văn học) Cô ấy không dám thở một lời về nó với bất kỳ ai."
                    },
                    {
                        "en": "Dare to be different!",
                        "vi": "Dám khác biệt!"
                    },
                    {
                        "en": "There was something, dare I say it, a little unusual about him.",
                        "vi": "Có điều gì đó, tôi dám nói ra, một chút khác thường về anh ta."
                    }
                ]
            },
            {
                "define": {
                    "en": "to persuade somebody to do something dangerous, difficult or embarrassing so that they can show that they are not afraid",
                    "vi": "thuyết phục ai đó làm điều gì đó nguy hiểm, khó khăn hoặc xấu hổ để họ thể hiện rằng họ không sợ hãi"
                },
                "examples": [
                    {
                        "en": "dare somebody Go on! Take it! I dare you.",
                        "vi": "ai đó dám đi tiếp! Lấy nó! Tao thách mày."
                    },
                    {
                        "en": "dare somebody to do something Some of the older boys had dared him to do it.",
                        "vi": "dám ai đó làm điều gì đó Một số cậu bé lớn hơn đã dám anh ta làm điều đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to tell somebody strongly not to do something",
                    "vi": "được sử dụng để nói với ai đó mạnh mẽ rằng đừng làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "‘I'll tell her about it.’ ‘Don't you dare!’",
                        "vi": "Tôi sẽ nói với cô ấy về điều đó.' 'Bạn không dám!'"
                    },
                    {
                        "en": "Don't you dare say anything to anybody.",
                        "vi": "Bạn không dám nói bất cứ điều gì với bất kỳ ai."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to show that you are angry about something that somebody has done",
                    "vi": "được sử dụng để cho thấy rằng bạn đang tức giận về điều gì đó mà ai đó đã làm"
                },
                "examples": [
                    {
                        "en": "How dare you talk to me like that?",
                        "vi": "Sao anh dám nói chuyện với tôi như vậy?"
                    },
                    {
                        "en": "How dare she imply that I was lying?",
                        "vi": "Sao cô ấy dám ám chỉ rằng tôi đang nói dối?"
                    }
                ]
            },
            {
                "define": {
                    "en": "used when you are saying that something is likely",
                    "vi": "được sử dụng khi bạn nói rằng điều gì đó có khả năng xảy ra"
                },
                "examples": [
                    {
                        "en": "I dare say you know about it already.",
                        "vi": "Tôi dám chắc rằng bạn đã biết về nó rồi."
                    }
                ]
            }
        ]
    },
    {
        "id": "3a8712d4e02945578a811f4effce6bb3",
        "word": "lend colour to something",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/lend/",
            "us": "/lend/"
        },
        "nearby": [
            {
                "word": "lemur",
                "pos": "noun"
            },
            {
                "word": "Len",
                "pos": ""
            },
            {
                "word": "lend",
                "pos": "verb"
            },
            {
                "word": "lender",
                "pos": "noun"
            },
            {
                "word": "lending",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to give something to somebody or allow them to use something that belongs to you, which they have to return to you later",
                    "vi": "để đưa thứ gì đó cho ai đó hoặc cho phép họ sử dụng thứ thuộc về bạn, thứ mà họ phải trả lại cho bạn sau này"
                },
                "examples": [
                    {
                        "en": "lend something They will lend equipment free of charge.",
                        "vi": "cho mượn thứ gì đó Họ sẽ cho mượn thiết bị miễn phí."
                    },
                    {
                        "en": "lend something to somebody I've lent the car to a friend.",
                        "vi": "cho ai đó mượn cái gì đó. Tôi đã cho một người bạn mượn xe."
                    },
                    {
                        "en": "lend out something The gallery has been willing to lend out works of art in the past.",
                        "vi": "cho mượn thứ gì đó Phòng trưng bày đã sẵn sàng cho mượn các tác phẩm nghệ thuật trong quá khứ."
                    },
                    {
                        "en": "lend out something to somebody The charity lends out toys to children with special needs and disabilities.",
                        "vi": "cho ai đó mượn đồ chơi Tổ chức từ thiện cho trẻ em có nhu cầu đặc biệt và khuyết tật mượn đồ chơi."
                    },
                    {
                        "en": "lend somebody something Can you lend me £10?",
                        "vi": "cho ai đó mượn cái gì đó Bạn có thể cho tôi mượn £ 10 được không?"
                    },
                    {
                        "en": "Can you lend me your car this evening?",
                        "vi": "Bạn có thể cho tôi mượn xe của bạn tối nay?"
                    },
                    {
                        "en": "Has he returned that book you lent him?",
                        "vi": "Anh ấy đã trả lại cuốn sách mà bạn cho anh ấy mượn chưa?"
                    },
                    {
                        "en": "She very kindly lent me her bicycle.",
                        "vi": "Cô ấy rất vui lòng cho tôi mượn xe đạp của cô ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to give money to somebody on condition that they pay it back over a period of time and pay interest on it",
                    "vi": "đưa tiền cho ai đó với điều kiện họ phải trả lại trong một khoảng thời gian và trả lãi suất cho số tiền đó"
                },
                "examples": [
                    {
                        "en": "lend something The bank lends money at very cheap rates.",
                        "vi": "cho vay cái gì đó Ngân hàng cho vay tiền với lãi suất rất rẻ."
                    },
                    {
                        "en": "lend somebody something They refused to lend us the money.",
                        "vi": "cho ai đó mượn thứ gì đó Họ từ chối cho chúng tôi vay tiền."
                    },
                    {
                        "en": "lend something to somebody The bank refused to lend the money to us.",
                        "vi": "cho ai đó mượn cái gì đó. Ngân hàng từ chối cho chúng tôi vay tiền."
                    },
                    {
                        "en": "lend (to somebody) Banks are less willing to lend in these uncertain times.",
                        "vi": "cho vay (cho ai đó) Các ngân hàng ít sẵn sàng cho vay trong những thời điểm không chắc chắn này."
                    },
                    {
                        "en": "There are a large number of financial providers lending to businesses across the country.",
                        "vi": "Có một số lượng lớn các nhà cung cấp tài chính cho vay các doanh nghiệp trên cả nước."
                    }
                ]
            },
            {
                "define": {
                    "en": "to give a particular quality to a person or a situation",
                    "vi": "để cung cấp một phẩm chất cụ thể cho một người hoặc một tình huống"
                },
                "examples": [
                    {
                        "en": "lend something (to somebody/something) The setting sun lent an air of melancholy to the scene.",
                        "vi": "cho mượn cái gì đó (cho ai đó / cái gì đó) Mặt trời lặn mang lại không khí u uất cho cảnh vật."
                    },
                    {
                        "en": "lend somebody/something sth Her presence lent the occasion a certain dignity.",
                        "vi": "cho mượn ai đó / cái gì đó sth Sự hiện diện của cô ấy cho dịp này một phẩm giá nhất định."
                    }
                ]
            },
            {
                "define": {
                    "en": "to give or provide help, support, etc.",
                    "vi": "để cung cấp hoặc cung cấp sự giúp đỡ, hỗ trợ, v.v."
                },
                "examples": [
                    {
                        "en": "lend something (to somebody/something) I was more than happy to lend my support to such a good cause.",
                        "vi": "cho ai đó mượn cái gì đó"
                    },
                    {
                        "en": "lend somebody/something sth He came along to lend me moral support.",
                        "vi": "cho mượn ai đó / cái gì đó sth Anh ấy đến để cho tôi mượn sự hỗ trợ về mặt tinh thần."
                    }
                ]
            },
            {
                "define": {
                    "en": "to help somebody",
                    "vi": "để giúp ai đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to make something seem true or likely",
                    "vi": "để làm cho một cái gì đó có vẻ đúng hoặc có khả năng"
                },
                "examples": [
                    {
                        "en": "Most of the available evidence lends colour to this view.",
                        "vi": "Hầu hết các bằng chứng có sẵn đều cho thấy quan điểm này có màu sắc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to listen in a patient and kind way to somebody",
                    "vi": "lắng nghe một cách kiên nhẫn và tử tế với ai đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to help somebody with something",
                    "vi": "để giúp ai đó một cái gì đó"
                },
                "examples": [
                    {
                        "en": "I went over to see if I could lend a hand.",
                        "vi": "Tôi đi qua xem có thể giúp một tay không."
                    }
                ]
            },
            {
                "define": {
                    "en": "to let it be known in public that you support or agree with something",
                    "vi": "để công chúng biết rằng bạn ủng hộ hoặc đồng ý với điều gì đó"
                },
                "examples": [
                    {
                        "en": "I am more than happy to lend my name to this campaign.",
                        "vi": "Tôi rất vui khi được cho mượn tên của mình cho chiến dịch này."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have a place named after you",
                    "vi": "có một nơi được đặt theo tên bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to make something seem more likely to be true or real",
                    "vi": "để làm cho điều gì đó có vẻ đúng hơn hoặc có thật hơn"
                },
                "examples": [
                    {
                        "en": "This latest evidence lends support to her theory.",
                        "vi": "Bằng chứng mới nhất này hỗ trợ cho lý thuyết của cô ấy."
                    }
                ]
            }
        ]
    },
    {
        "id": "a8af14e36e264d13bb7fdaf8ed6d86cf",
        "word": "presumption",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/prɪˈzʌmpʃn/",
            "us": "/prɪˈzʌmpʃn/"
        },
        "nearby": [
            {
                "word": "presume on",
                "pos": "phrasal verb"
            },
            {
                "word": "presume upon",
                "pos": "phrasal verb"
            },
            {
                "word": "presumption",
                "pos": "noun"
            },
            {
                "word": "presumptive",
                "pos": "adjective"
            },
            {
                "word": "presumptuous",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "something that is thought to be true or likely",
                    "vi": "điều gì đó được cho là đúng hoặc có thể"
                },
                "examples": [
                    {
                        "en": "There is a general presumption that the doctor knows best.",
                        "vi": "Có một giả định chung mà bác sĩ biết rõ nhất."
                    }
                ]
            },
            {
                "define": {
                    "en": "behaviour that is too confident and shows a lack of respect for other people",
                    "vi": "hành vi quá tự tin và thiếu tôn trọng người khác"
                },
                "examples": [
                    {
                        "en": "She was infuriated by his presumption in not consulting her first.",
                        "vi": "Cô đã tức giận bởi sự cho rằng anh ta đã không hỏi ý kiến cô trước."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of supposing that something is true, although it has not yet been proved or is not certain",
                    "vi": "hành động giả định rằng một cái gì đó là sự thật, mặc dù nó vẫn chưa được chứng minh hoặc không chắc chắn"
                },
                "examples": [
                    {
                        "en": "Everyone is entitled to the presumption of innocence until they are proved to be guilty.",
                        "vi": "Mọi người đều có quyền được coi là vô tội cho đến khi họ được chứng minh là có tội."
                    }
                ]
            }
        ]
    },
    {
        "id": "aeb6ed2a0ab4452db2f62e7b787955c1",
        "word": "probabilistic",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌprɒbəbəˈlɪstɪk/",
            "us": "/ˌprɑːbəbəˈlɪstɪk/"
        },
        "nearby": [
            {
                "word": "pro-am",
                "pos": "noun"
            },
            {
                "word": "prob",
                "pos": "noun"
            },
            {
                "word": "probabilistic",
                "pos": "adjective"
            },
            {
                "word": "probability",
                "pos": "noun"
            },
            {
                "word": "probable",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "based on the idea that, as we cannot be certain about things, we can base our beliefs or actions on what is likely",
                    "vi": "dựa trên ý tưởng rằng, vì chúng ta không thể chắc chắn về mọi thứ, chúng ta có thể đặt niềm tin hoặc hành động của mình vào những gì có thể"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "df273735986a4cf2a2c603da9e72986c",
        "word": "ten to one",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/ten/",
            "us": "/ten/"
        },
        "nearby": [
            {
                "word": "temptress",
                "pos": "noun"
            },
            {
                "word": "tempura",
                "pos": "noun"
            },
            {
                "word": "ten",
                "pos": "number"
            },
            {
                "word": "tenable",
                "pos": "adjective"
            },
            {
                "word": "tenacious",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "10",
                    "vi": "10"
                },
                "examples": [
                    {
                        "en": "There are only ten of these rare animals left.",
                        "vi": "Chỉ còn lại mười loài động vật quý hiếm này."
                    },
                    {
                        "en": "ten of Sweden’s top financial experts",
                        "vi": "mười chuyên gia tài chính hàng đầu của Thụy Điển"
                    },
                    {
                        "en": "Twelve people were invited but only ten turned up.",
                        "vi": "Mười hai người được mời nhưng chỉ có mười người xuất hiện."
                    },
                    {
                        "en": "Do you have change for ten dollars?",
                        "vi": "Bạn có tiền lẻ cho mười đô la không?"
                    },
                    {
                        "en": "a ten-month contract",
                        "vi": "một hợp đồng mười tháng"
                    },
                    {
                        "en": "Look at page ten.",
                        "vi": "Nhìn vào trang 10."
                    },
                    {
                        "en": "Ten and two is twelve.",
                        "vi": "Mười và hai là mười hai."
                    },
                    {
                        "en": "Two tens are twenty.",
                        "vi": "Hai chục là hai mươi."
                    },
                    {
                        "en": "I can't read your writing—is this meant to be a ten?",
                        "vi": "Tôi không thể đọc bài viết của bạn — điều này có nghĩa là một điểm mười?"
                    },
                    {
                        "en": "The bulbs are planted in sevens or tens (= groups of seven or ten).",
                        "vi": "Củ được trồng thành hàng chục hoặc hàng chục (= nhóm bảy hoặc mười)."
                    },
                    {
                        "en": "We moved to America when I was ten (= ten years old).",
                        "vi": "Chúng tôi chuyển đến Mỹ khi tôi mười (= mười tuổi)."
                    },
                    {
                        "en": "Shall we meet at ten (= at ten o'clock), then?",
                        "vi": "Vậy thì chúng ta sẽ gặp nhau lúc mười giờ (= lúc mười giờ) chứ?"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that somebody has guessed something correctly or done something very well",
                    "vi": "thường nói rằng ai đó đã đoán đúng điều gì đó hoặc làm điều gì đó rất tốt"
                },
                "examples": [
                    {
                        "en": "Not brilliant, Robyn, but I'll give you ten out of ten for effort.",
                        "vi": "Không xuất sắc, Robyn, nhưng tôi sẽ cho bạn mười trên mười cho nỗ lực."
                    }
                ]
            },
            {
                "define": {
                    "en": "very probably",
                    "vi": "rất có thể"
                },
                "examples": [
                    {
                        "en": "Ten to one he'll be late.",
                        "vi": "Mười một, anh ấy sẽ đến muộn."
                    }
                ]
            },
            {
                "define": {
                    "en": "very common and therefore not valuable",
                    "vi": "rất phổ biến và do đó không có giá trị"
                },
                "examples": [
                    {
                        "en": "Teachers of history are ten a penny.",
                        "vi": "Giáo viên dạy lịch sử là mười một xu."
                    }
                ]
            }
        ]
    }
]