[
    {
        "id": "71dd345125954096ba899748f1545df7",
        "word": "bring A and B together",
        "pos": "phrasal verb",
        "level": "c1",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "brine",
                "pos": "noun"
            },
            {
                "word": "bring",
                "pos": "verb"
            },
            {
                "word": "bring A and B together",
                "pos": "phrasal verb"
            },
            {
                "word": "bring about",
                "pos": "phrasal verb"
            },
            {
                "word": "bring-and-buy sale",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to help two people or groups to end a disagreement",
                    "vi": "để giúp hai người hoặc nhóm chấm dứt bất đồng"
                },
                "examples": [
                    {
                        "en": "The loss of their son brought the two of them together.",
                        "vi": "Việc mất đi đứa con trai của họ đã đưa hai người họ đến với nhau."
                    }
                ]
            }
        ]
    },
    {
        "id": "71eb43601f834976aced3ebb63ae6655",
        "word": "intervene",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌɪntəˈviːn/",
            "us": "/ˌɪntərˈviːn/"
        },
        "nearby": [
            {
                "word": "interval",
                "pos": "noun"
            },
            {
                "word": "interval training",
                "pos": "noun"
            },
            {
                "word": "intervene",
                "pos": "verb"
            },
            {
                "word": "intervening",
                "pos": "adjective"
            },
            {
                "word": "intervention",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to become involved in a situation in order to improve or help it",
                    "vi": "tham gia vào một tình huống để cải thiện hoặc giúp đỡ nó"
                },
                "examples": [
                    {
                        "en": "She might have been killed if the neighbours hadn't intervened.",
                        "vi": "Cô ấy có thể đã bị giết nếu những người hàng xóm không can thiệp."
                    },
                    {
                        "en": "intervene in something The President intervened personally in the crisis.",
                        "vi": "can thiệp vào điều gì đó Tổng thống đã can thiệp cá nhân vào cuộc khủng hoảng."
                    },
                    {
                        "en": "intervene between A and B She went over to intervene between the two men.",
                        "vi": "can thiệp giữa A và B Cô ấy đến can thiệp giữa hai người đàn ông."
                    },
                    {
                        "en": "intervene against somebody They would not intervene against the rebels themselves.",
                        "vi": "can thiệp chống lại ai đó Họ sẽ không can thiệp chống lại chính những người nổi dậy."
                    },
                    {
                        "en": "intervene (with somebody) (on behalf of somebody) attempts to intervene with the authorities on the prisoners' behalf",
                        "vi": "can thiệp (với ai đó) (thay mặt cho ai đó) cố gắng can thiệp với chính quyền nhân danh tù nhân"
                    },
                    {
                        "en": "intervene to do something They intervened to halt the attack.",
                        "vi": "can thiệp để làm điều gì đó Họ đã can thiệp để ngăn chặn cuộc tấn công."
                    }
                ]
            },
            {
                "define": {
                    "en": "to interrupt somebody when they are speaking in order to say something",
                    "vi": "ngắt lời ai đó khi họ đang nói để nói điều gì đó"
                },
                "examples": [
                    {
                        "en": "‘But,’ she intervened, ‘what about the others?’",
                        "vi": "Nhưng, cô ấy xen vào, \"còn những người khác thì sao?\""
                    }
                ]
            },
            {
                "define": {
                    "en": "to happen in a way that delays something or prevents it from happening",
                    "vi": "xảy ra theo cách làm trì hoãn điều gì đó hoặc ngăn nó xảy ra"
                },
                "examples": [
                    {
                        "en": "They were planning to get married and then the war intervened.",
                        "vi": "Họ đã dự định kết hôn và sau đó chiến tranh xen vào."
                    }
                ]
            },
            {
                "define": {
                    "en": "to exist between two events or places",
                    "vi": "tồn tại giữa hai sự kiện hoặc địa điểm"
                },
                "examples": [
                    {
                        "en": "I saw nothing of her during the years that intervened.",
                        "vi": "Tôi không thấy gì của cô ấy trong suốt nhiều năm đã can thiệp."
                    }
                ]
            }
        ]
    },
    {
        "id": "4f18f49c67114164ac8b1eddd3dcb744",
        "word": "intervention",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌɪntəˈvenʃn/",
            "us": "/ˌɪntərˈvenʃn/"
        },
        "nearby": [
            {
                "word": "intervene",
                "pos": "verb"
            },
            {
                "word": "intervening",
                "pos": "adjective"
            },
            {
                "word": "intervention",
                "pos": "noun"
            },
            {
                "word": "interventionism",
                "pos": "noun"
            },
            {
                "word": "interventionist",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "action taken to improve or help a situation",
                    "vi": "hành động được thực hiện để cải thiện hoặc giúp đỡ một tình huống"
                },
                "examples": [
                    {
                        "en": "calls for government intervention to save the steel industry",
                        "vi": "kêu gọi chính phủ can thiệp để cứu ngành thép"
                    },
                    {
                        "en": "intervention in something In the second group of states, direct intervention in the economy was limited.",
                        "vi": "can thiệp vào điều gì đó Ở nhóm quốc gia thứ hai, sự can thiệp trực tiếp vào nền kinh tế bị hạn chế."
                    }
                ]
            },
            {
                "define": {
                    "en": "action by a country to become involved in the affairs of another country when they have not been asked to do so",
                    "vi": "hành động của một quốc gia để can dự vào các công việc của quốc gia khác khi họ không được yêu cầu làm như vậy"
                },
                "examples": [
                    {
                        "en": "armed/military intervention",
                        "vi": "can thiệp vũ trang / quân sự"
                    },
                    {
                        "en": "intervention in something NATO intervention in the troubled region",
                        "vi": "can thiệp vào một cái gì đó NATO can thiệp vào khu vực gặp khó khăn"
                    }
                ]
            },
            {
                "define": {
                    "en": "action taken to improve a medical condition or illness",
                    "vi": "hành động được thực hiện để cải thiện tình trạng sức khỏe hoặc bệnh tật"
                },
                "examples": [
                    {
                        "en": "a medical/surgical intervention",
                        "vi": "can thiệp y tế / phẫu thuật"
                    },
                    {
                        "en": "Most patients make a recovery without further intervention.",
                        "vi": "Hầu hết bệnh nhân tự phục hồi mà không cần can thiệp thêm."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of interrupting somebody when they are speaking in order to say something",
                    "vi": "hành động ngắt lời ai đó khi họ đang nói để nói điều gì đó"
                },
                "examples": [
                    {
                        "en": "People resented his repeated interventions in the debate.",
                        "vi": "Mọi người phẫn nộ với những can thiệp lặp đi lặp lại của ông trong cuộc tranh luận."
                    }
                ]
            },
            {
                "define": {
                    "en": "an occasion when a group of people meet to take action with a friend or family member who has an addiction to drugs or alcohol, in order to help them recover",
                    "vi": "một dịp khi một nhóm người gặp gỡ để hành động với một người bạn hoặc thành viên gia đình nghiện ma túy hoặc rượu, nhằm giúp họ phục hồi"
                },
                "examples": [
                    {
                        "en": "Her daughters staged an intervention.",
                        "vi": "Các con gái của bà đã can thiệp."
                    },
                    {
                        "en": "Family intervention is an essential component of treatment for adolescent drug abuse.",
                        "vi": "Sự can thiệp của gia đình là một thành phần thiết yếu của điều trị lạm dụng ma túy ở tuổi vị thành niên."
                    }
                ]
            }
        ]
    },
    {
        "id": "96f742b0f46a44b0a188fd6b7a8b6674",
        "word": "peacekeeper",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈpiːskiːpə(r)/",
            "us": "/ˈpiːskiːpər/"
        },
        "nearby": [
            {
                "word": "peacefulness",
                "pos": "noun"
            },
            {
                "word": "peace in our time",
                "pos": ""
            },
            {
                "word": "peacekeeper",
                "pos": "noun"
            },
            {
                "word": "peacekeeping",
                "pos": "adjective"
            },
            {
                "word": "peace-loving",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a member of a military force who has been sent to help stop people fighting in a place where war or violence is likely",
                    "vi": "một thành viên của lực lượng quân đội đã được cử đến để giúp ngăn chặn những người chiến đấu ở một nơi có khả năng xảy ra chiến tranh hoặc bạo lực"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a person who tries to stop people arguing or fighting",
                    "vi": "một người cố gắng ngăn mọi người tranh cãi hoặc đánh nhau"
                },
                "examples": [
                    {
                        "en": "She's the peacekeeper in that family.",
                        "vi": "Cô ấy là người gìn giữ hòa bình trong gia đình đó."
                    }
                ]
            }
        ]
    },
    {
        "id": "6f530900417945439dbc7fa30327b29a",
        "word": "arbitrate",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɑːbɪtreɪt/",
            "us": "/ˈɑːrbɪtreɪt/"
        },
        "nearby": [
            {
                "word": "arbitrariness",
                "pos": "noun"
            },
            {
                "word": "arbitrary",
                "pos": "adjective"
            },
            {
                "word": "arbitrate",
                "pos": "verb"
            },
            {
                "word": "arbitration",
                "pos": "noun"
            },
            {
                "word": "arbitrator",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to officially settle an argument or a disagreement between two people or groups",
                    "vi": "để chính thức giải quyết một cuộc tranh cãi hoặc bất đồng giữa hai người hoặc nhóm"
                },
                "examples": [
                    {
                        "en": "He is the official responsible for arbitrating the case of disputed trades.",
                        "vi": "Anh ta là quan chức chịu trách nhiệm phân xử các trường hợp giao dịch tranh chấp."
                    },
                    {
                        "en": "They rejected the offer of an arbitrated settlement.",
                        "vi": "Họ từ chối đề nghị giải quyết bằng trọng tài."
                    },
                    {
                        "en": "arbitrate (in/on) (something) to arbitrate in a dispute",
                        "vi": "phân xử (trong / trên) (cái gì đó) để phân xử trong một tranh chấp"
                    },
                    {
                        "en": "arbitrate between A and B A committee was created to arbitrate between management and the unions.",
                        "vi": "phân xử giữa A và BA ủy ban được thành lập để phân xử giữa quản lý và các công đoàn."
                    }
                ]
            }
        ]
    },
    {
        "id": "b63d140bb14649c18b8a009dbaf4e20a",
        "word": "arbitration",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌɑːbɪˈtreɪʃn/",
            "us": "/ˌɑːrbɪˈtreɪʃn/"
        },
        "nearby": [
            {
                "word": "arbitrary",
                "pos": "adjective"
            },
            {
                "word": "arbitrate",
                "pos": "verb"
            },
            {
                "word": "arbitration",
                "pos": "noun"
            },
            {
                "word": "arbitrator",
                "pos": "noun"
            },
            {
                "word": "Arbor Day",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the official process of settling an argument or a disagreement by somebody who is not involved",
                    "vi": "quy trình chính thức giải quyết một cuộc tranh cãi hoặc bất đồng bởi một người nào đó không liên quan"
                },
                "examples": [
                    {
                        "en": "Both sides in the dispute have agreed to go to arbitration.",
                        "vi": "Cả hai bên trong tranh chấp đã đồng ý đi đến trọng tài."
                    },
                    {
                        "en": "Trade unions want the question referred to arbitration.",
                        "vi": "Công đoàn muốn câu hỏi được chuyển đến trọng tài."
                    }
                ]
            }
        ]
    },
    {
        "id": "f4865ac8cf994fce8c82c6a36e6e24a3",
        "word": "arbitrator",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɑːbɪtreɪtə(r)/",
            "us": "/ˈɑːrbɪtreɪtər/"
        },
        "nearby": [
            {
                "word": "arbitrate",
                "pos": "verb"
            },
            {
                "word": "arbitration",
                "pos": "noun"
            },
            {
                "word": "arbitrator",
                "pos": "noun"
            },
            {
                "word": "Arbor Day",
                "pos": ""
            },
            {
                "word": "arboreal",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who is chosen to settle a disagreement",
                    "vi": "một người được chọn để giải quyết bất đồng"
                },
                "examples": [
                    {
                        "en": "An outside arbitrator may be appointed in such cases.",
                        "vi": "Một trọng tài bên ngoài có thể được chỉ định trong những trường hợp như vậy."
                    },
                    {
                        "en": "Where no agreement can be reached, the matter will be referred to an independent arbitrator.",
                        "vi": "Trường hợp không thể đạt được thỏa thuận, vấn đề sẽ được chuyển đến một trọng tài độc lập."
                    }
                ]
            }
        ]
    },
    {
        "id": "bf31c02bf550403d87ec956bb3897f99",
        "word": "cooling-off period",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌkuːlɪŋ ˈɒf pɪəriəd/",
            "us": "/ˌkuːlɪŋ ˈɔːf pɪriəd/"
        },
        "nearby": [
            {
                "word": "coolie",
                "pos": "noun"
            },
            {
                "word": "cooling centre",
                "pos": "noun"
            },
            {
                "word": "cooling-off period",
                "pos": "noun"
            },
            {
                "word": "cooling tower",
                "pos": "noun"
            },
            {
                "word": "coolly",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a period of time during which two sides that disagree try to reach an agreement before taking further action, for example by going on strike",
                    "vi": "Khoảng thời gian mà hai bên không đồng ý cố gắng đạt được thỏa thuận trước khi thực hiện các hành động tiếp theo, ví dụ bằng cách đình công"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a period of time after somebody has agreed to buy something, such as an insurance plan, during which they can change their mind",
                    "vi": "một khoảng thời gian sau khi ai đó đã đồng ý mua thứ gì đó, chẳng hạn như gói bảo hiểm, trong thời gian đó họ có thể thay đổi quyết định"
                },
                "examples": [
                    {
                        "en": "Customers signing new life policies will have a longer cooling-off period of 14 days.",
                        "vi": "Khách hàng ký hợp đồng trọn đời mới sẽ có thời gian hạ nhiệt dài hơn là 14 ngày."
                    },
                    {
                        "en": "The customer has the right to cancel the contract during the seven-day cooling-off period.",
                        "vi": "Khách hàng có quyền hủy hợp đồng trong thời gian bảy ngày làm mát."
                    }
                ]
            }
        ]
    },
    {
        "id": "c3b18ba988e14718b029cd160ea839fd",
        "word": "fence-mending",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈfens mendɪŋ/",
            "us": "/ˈfens mendɪŋ/"
        },
        "nearby": [
            {
                "word": "fence",
                "pos": "verb"
            },
            {
                "word": "fence in",
                "pos": "phrasal verb"
            },
            {
                "word": "fence-mending",
                "pos": "noun"
            },
            {
                "word": "fence off",
                "pos": "phrasal verb"
            },
            {
                "word": "fencer",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an attempt to improve relations between two people or groups and to try to find a solution when they disagree",
                    "vi": "nỗ lực cải thiện mối quan hệ giữa hai người hoặc nhóm và cố gắng tìm ra giải pháp khi họ không đồng ý"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a4f38649f9ce42c09dc46701f692dae9",
        "word": "honest broker",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌɒnɪst ˈbrəʊkə(r)/",
            "us": "/ˌɑːnɪst ˈbrəʊkər/"
        },
        "nearby": [
            {
                "word": "hone in on",
                "pos": "phrasal verb"
            },
            {
                "word": "honest",
                "pos": "adjective"
            },
            {
                "word": "honest broker",
                "pos": "noun"
            },
            {
                "word": "honestly",
                "pos": "adverb"
            },
            {
                "word": "honest-to-goodness",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person or country that tries to get other people or countries to reach an agreement or to solve a problem, without getting involved with either side",
                    "vi": "một người hoặc quốc gia cố gắng khiến những người hoặc quốc gia khác đạt được thỏa thuận hoặc giải quyết vấn đề mà không can dự vào bất kỳ bên nào"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a1595282a84b4e999f06ec7a4bffb4b5",
        "word": "intercede",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌɪntəˈsiːd/",
            "us": "/ˌɪntərˈsiːd/"
        },
        "nearby": [
            {
                "word": "inter alia",
                "pos": "adverb"
            },
            {
                "word": "interbreed",
                "pos": "verb"
            },
            {
                "word": "intercede",
                "pos": "verb"
            },
            {
                "word": "intercept",
                "pos": "verb"
            },
            {
                "word": "interception",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to speak to somebody in order to persuade them to be kind to somebody else or to help settle an argument",
                    "vi": "nói chuyện với ai đó để thuyết phục họ đối xử tốt với người khác hoặc giúp giải quyết một cuộc tranh cãi"
                },
                "examples": [
                    {
                        "en": "They interceded with the authorities on behalf of the detainees.",
                        "vi": "Họ thay mặt những người bị giam giữ can thiệp với chính quyền."
                    },
                    {
                        "en": "Their father made no attempt to intercede.",
                        "vi": "Cha của họ không cố gắng can thiệp."
                    }
                ]
            }
        ]
    },
    {
        "id": "87bcfd0fb709433298b185443f645c49",
        "word": "intercession",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌɪntəˈseʃn/",
            "us": "/ˌɪntərˈseʃn/"
        },
        "nearby": [
            {
                "word": "interception",
                "pos": "noun"
            },
            {
                "word": "interceptor",
                "pos": "noun"
            },
            {
                "word": "intercession",
                "pos": "noun"
            },
            {
                "word": "interchange",
                "pos": "noun"
            },
            {
                "word": "interchange",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act of speaking to somebody in order to persuade them to be kind to somebody else or to help settle an argument",
                    "vi": "hành động nói chuyện với ai đó để thuyết phục họ đối xử tốt với người khác hoặc giúp giải quyết một cuộc tranh cãi"
                },
                "examples": [
                    {
                        "en": "He was released owing to English intercession with the French.",
                        "vi": "Anh ta được thả do sự can thiệp của người Anh với người Pháp."
                    },
                    {
                        "en": "the intercession of a priest",
                        "vi": "sự cầu thay của một linh mục"
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of saying a prayer for somebody/something; a prayer that is said for somebody/something",
                    "vi": "hành động nói lời cầu nguyện cho ai đó / điều gì đó; một lời cầu nguyện được nói cho ai đó / điều gì đó"
                },
                "examples": [
                    {
                        "en": "prayers of intercession for her healing",
                        "vi": "những lời cầu nguyện chuyển cầu cho sự chữa lành của cô ấy"
                    },
                    {
                        "en": "The church service comprised readings, reflections and intercessions.",
                        "vi": "Buổi lễ nhà thờ bao gồm các bài đọc, bài suy niệm và lời cầu bầu."
                    }
                ]
            }
        ]
    },
    {
        "id": "f8548aa6b40c4c6180ea399421d8ec12",
        "word": "intermediary",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌɪntəˈmiːdiəri/",
            "us": "/ˌɪntərˈmiːdieri/"
        },
        "nearby": [
            {
                "word": "intermarriage",
                "pos": "noun"
            },
            {
                "word": "intermarry",
                "pos": "verb"
            },
            {
                "word": "intermediary",
                "pos": "noun"
            },
            {
                "word": "intermediary",
                "pos": "adjective"
            },
            {
                "word": "intermediate",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person or an organization that helps other people or organizations to make an agreement by being a means of communication between them",
                    "vi": "một người hoặc một tổ chức giúp những người hoặc tổ chức khác thực hiện một thỏa thuận bằng cách trở thành một phương tiện giao tiếp giữa họ"
                },
                "examples": [
                    {
                        "en": "Financial institutions act as intermediaries between lenders and borrowers.",
                        "vi": "Các tổ chức tài chính đóng vai trò trung gian giữa người cho vay và người đi vay."
                    },
                    {
                        "en": "All talks have so far been conducted through an intermediary.",
                        "vi": "Tất cả các cuộc đàm phán cho đến nay đều được thực hiện thông qua một bên trung gian."
                    }
                ]
            }
        ]
    },
    {
        "id": "d6e72222ed5247958d50ac41030750cc",
        "word": "intermediary",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌɪntəˈmiːdiəri/",
            "us": "/ˌɪntərˈmiːdieri/"
        },
        "nearby": [
            {
                "word": "intermarry",
                "pos": "verb"
            },
            {
                "word": "intermediary",
                "pos": "noun"
            },
            {
                "word": "intermediary",
                "pos": "adjective"
            },
            {
                "word": "intermediate",
                "pos": "adjective"
            },
            {
                "word": "intermediate",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "helping other people or organizations to make an agreement by being a means of communication between them",
                    "vi": "giúp những người hoặc tổ chức khác thực hiện một thỏa thuận bằng cách trở thành một phương tiện giao tiếp giữa họ"
                },
                "examples": [
                    {
                        "en": "to play an intermediary role in the dispute",
                        "vi": "đóng vai trò trung gian trong tranh chấp"
                    }
                ]
            },
            {
                "define": {
                    "en": "located or happening between two places, times or stages",
                    "vi": "định vị hoặc xảy ra giữa hai địa điểm, thời gian hoặc giai đoạn"
                },
                "examples": [
                    {
                        "en": "an intermediary stage of development",
                        "vi": "một giai đoạn phát triển trung gian"
                    },
                    {
                        "en": "Mountains were seen as an intermediary realm between heaven and earth.",
                        "vi": "Núi được xem như một cõi trung gian giữa trời và đất."
                    }
                ]
            }
        ]
    },
    {
        "id": "e81da821eaa84284949a9879de3a78cf",
        "word": "mediate",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmiːdieɪt/",
            "us": "/ˈmiːdieɪt/"
        },
        "nearby": [
            {
                "word": "media-savvy",
                "pos": "adjective"
            },
            {
                "word": "media studies",
                "pos": "noun"
            },
            {
                "word": "mediate",
                "pos": "verb"
            },
            {
                "word": "mediation",
                "pos": "noun"
            },
            {
                "word": "mediator",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to try to end a situation between two or more people or groups who disagree by talking to them and trying to find things that everyone can agree on",
                    "vi": "cố gắng kết thúc tình huống giữa hai hoặc nhiều người hoặc nhiều nhóm không đồng ý bằng cách nói chuyện với họ và cố gắng tìm ra những điều mà mọi người có thể đồng ý"
                },
                "examples": [
                    {
                        "en": "mediate (in something) The Secretary-General was asked to mediate in the dispute.",
                        "vi": "hòa giải (trong một cái gì đó) Tổng thư ký được yêu cầu hòa giải trong tranh chấp."
                    },
                    {
                        "en": "mediate between A and B An independent body was brought in to mediate between staff and management.",
                        "vi": "trung gian giữa A và B Một cơ quan độc lập đã được đưa vào để làm trung gian giữa nhân viên và quản lý."
                    },
                    {
                        "en": "Wilson tried to mediate between the European powers to end the war.",
                        "vi": "Wilson đã cố gắng làm trung gian giữa các cường quốc châu Âu để chấm dứt chiến tranh."
                    },
                    {
                        "en": "mediate something to mediate differences/disputes/problems",
                        "vi": "hòa giải điều gì đó để hòa giải sự khác biệt / tranh chấp / vấn đề"
                    }
                ]
            },
            {
                "define": {
                    "en": "to succeed in finding a solution to a problem between people or groups who disagree",
                    "vi": "để thành công trong việc tìm ra giải pháp cho một vấn đề giữa những người hoặc các nhóm không đồng ý với nhau"
                },
                "examples": [
                    {
                        "en": "They mediated a settlement.",
                        "vi": "Họ làm trung gian dàn xếp."
                    },
                    {
                        "en": "The UN attempted to mediate a solution to the conflict.",
                        "vi": "LHQ đã cố gắng hòa giải một giải pháp cho cuộc xung đột."
                    }
                ]
            },
            {
                "define": {
                    "en": "to influence something and/or make it possible for it to happen",
                    "vi": "để ảnh hưởng đến điều gì đó và / hoặc làm cho nó có thể xảy ra"
                },
                "examples": [
                    {
                        "en": "be mediated (by something) Educational success is mediated by economic factors.",
                        "vi": "được trung gian (bởi một cái gì đó) Thành công trong giáo dục được trung gian bởi các yếu tố kinh tế."
                    }
                ]
            }
        ]
    },
    {
        "id": "c099b00d316e4e99995af7beb6dd5e0a",
        "word": "mediation",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌmiːdiˈeɪʃn/",
            "us": "/ˌmiːdiˈeɪʃn/"
        },
        "nearby": [
            {
                "word": "media studies",
                "pos": "noun"
            },
            {
                "word": "mediate",
                "pos": "verb"
            },
            {
                "word": "mediation",
                "pos": "noun"
            },
            {
                "word": "mediator",
                "pos": "noun"
            },
            {
                "word": "medic",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "attempts to end a problem between two or more people or groups who disagree by talking to them and trying to find things that everyone can agree on",
                    "vi": "cố gắng kết thúc một vấn đề giữa hai hoặc nhiều người hoặc nhiều nhóm không đồng ý bằng cách nói chuyện với họ và cố gắng tìm ra những điều mà mọi người có thể đồng ý"
                },
                "examples": [
                    {
                        "en": "Mediation is a way of sorting out the issues that arise when a couple separates.",
                        "vi": "Hòa giải là một cách giải quyết các vấn đề nảy sinh khi một cặp vợ chồng ly thân."
                    },
                    {
                        "en": "The mediation process is without admission of liability.",
                        "vi": "Quá trình hòa giải là không có trách nhiệm pháp lý."
                    }
                ]
            },
            {
                "define": {
                    "en": "the process of influencing something and/or make it possible for it to happen",
                    "vi": "quá trình ảnh hưởng đến điều gì đó và / hoặc làm cho nó có thể xảy ra"
                },
                "examples": [
                    {
                        "en": "The species may have arrived in North America through human mediation.",
                        "vi": "Loài này có thể đã đến Bắc Mỹ thông qua trung gian của con người."
                    }
                ]
            }
        ]
    },
    {
        "id": "7826a83fc0ec4248bee3a4929a86fd54",
        "word": "mediator",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmiːdieɪtə(r)/",
            "us": "/ˈmiːdieɪtər/"
        },
        "nearby": [
            {
                "word": "mediate",
                "pos": "verb"
            },
            {
                "word": "mediation",
                "pos": "noun"
            },
            {
                "word": "mediator",
                "pos": "noun"
            },
            {
                "word": "medic",
                "pos": "noun"
            },
            {
                "word": "Medicaid",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person or an organization that tries to get agreement between people or groups who disagree with each other",
                    "vi": "một người hoặc một tổ chức cố gắng đạt được thỏa thuận giữa những người hoặc nhóm không đồng ý với nhau"
                },
                "examples": [
                    {
                        "en": "to act as (a) mediator in the negotiations",
                        "vi": "đóng vai trò là (a) hòa giải viên trong các cuộc đàm phán"
                    },
                    {
                        "en": "A Swedish diplomat acted as mediator between the government and the rebels.",
                        "vi": "Một nhà ngoại giao Thụy Điển đóng vai trò trung gian giữa chính phủ và quân nổi dậy."
                    },
                    {
                        "en": "The peace talks were chaired by international mediators.",
                        "vi": "Các cuộc hòa đàm do các hòa giải viên quốc tế chủ trì."
                    }
                ]
            }
        ]
    },
    {
        "id": "a9877da94d09404e9191af5da2689de3",
        "word": "moderator",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmɒdəreɪtə(r)/",
            "us": "/ˈmɑːdəreɪtər/"
        },
        "nearby": [
            {
                "word": "moderation",
                "pos": "noun"
            },
            {
                "word": "moderato",
                "pos": "adverb, adjective"
            },
            {
                "word": "moderator",
                "pos": "noun"
            },
            {
                "word": "Moderator of the Church of Scotland",
                "pos": ""
            },
            {
                "word": "modern",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person whose job is to help people or groups who disagree to reach an agreement",
                    "vi": "một người có công việc là giúp đỡ những người hoặc nhóm không đồng ý để đạt được thỏa thuận"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a person whose job is to make sure that a discussion or a debate is fair",
                    "vi": "một người có công việc đảm bảo rằng một cuộc thảo luận hoặc một cuộc tranh luận là công bằng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a person whose job is to make sure that an exam is marked fairly",
                    "vi": "một người có công việc đảm bảo rằng một kỳ thi được chấm công bằng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a person who is responsible for preventing offensive material from being published on a website",
                    "vi": "một người chịu trách nhiệm ngăn chặn các tài liệu xúc phạm được xuất bản trên một trang web"
                },
                "examples": [
                    {
                        "en": "moderators of online discussion groups",
                        "vi": "người điều hành các nhóm thảo luận trực tuyến"
                    },
                    {
                        "en": "A moderator had removed the message.",
                        "vi": "Một người kiểm duyệt đã xóa tin nhắn."
                    },
                    {
                        "en": "The moderator will then post the article.",
                        "vi": "Người kiểm duyệt sau đó sẽ đăng bài viết."
                    }
                ]
            },
            {
                "define": {
                    "en": "a religious leader in the Presbyterian Church who is in charge of the Church council",
                    "vi": "một nhà lãnh đạo tôn giáo trong Giáo hội Trưởng lão, người phụ trách hội đồng Giáo hội"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "e1654d85bea7426682b4ae80ddce4179",
        "word": "peacemaker",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpiːsmeɪkə(r)/",
            "us": "/ˈpiːsmeɪkər/"
        },
        "nearby": [
            {
                "word": "peacekeeping",
                "pos": "adjective"
            },
            {
                "word": "peace-loving",
                "pos": "adjective"
            },
            {
                "word": "peacemaker",
                "pos": "noun"
            },
            {
                "word": "peacenik",
                "pos": "noun"
            },
            {
                "word": "peace offering",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who tries to persuade people or countries to stop arguing or fighting and to make peace",
                    "vi": "một người cố gắng thuyết phục mọi người hoặc các quốc gia ngừng tranh cãi hoặc chiến đấu và thực hiện hòa bình"
                },
                "examples": [
                    {
                        "en": "She always acted as the peacemaker when family arguments boiled over.",
                        "vi": "Cô ấy luôn đóng vai trò là người hòa giải khi các cuộc tranh cãi trong gia đình trở nên sôi nổi."
                    }
                ]
            }
        ]
    },
    {
        "id": "41c4386f34c04028b3e8c90617a38598",
        "word": "referee",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌrefəˈriː/",
            "us": "/ˌrefəˈriː/"
        },
        "nearby": [
            {
                "word": "refer",
                "pos": "verb"
            },
            {
                "word": "referable",
                "pos": "adjective"
            },
            {
                "word": "referee",
                "pos": "noun"
            },
            {
                "word": "referee",
                "pos": "verb"
            },
            {
                "word": "referee's assistant",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the official who controls the game in some sports",
                    "vi": "quan chức điều khiển trò chơi trong một số môn thể thao"
                },
                "examples": [
                    {
                        "en": "He was sent off for arguing with the referee.",
                        "vi": "Anh ta đã bị đuổi khỏi sân vì tranh cãi với trọng tài."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who gives information about your character and ability, usually in a letter, for example when you are applying for a job",
                    "vi": "một người cung cấp thông tin về tính cách và khả năng của bạn, thường là trong một lá thư, chẳng hạn như khi bạn đang nộp đơn xin việc"
                },
                "examples": [
                    {
                        "en": "The principal often acts as a referee for his students.",
                        "vi": "Hiệu trưởng thường làm trọng tài cho học sinh của mình."
                    },
                    {
                        "en": "His former employer agreed to act as a referee for him.",
                        "vi": "Người chủ cũ của anh đã đồng ý làm trọng tài cho anh."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who is asked to settle an argument",
                    "vi": "một người được yêu cầu giải quyết một cuộc tranh cãi"
                },
                "examples": [
                    {
                        "en": "to act as a referee between the parties involved",
                        "vi": "hoạt động như một trọng tài giữa các bên liên quan"
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who reads and checks the quality of an academic article before it is published",
                    "vi": "một người đọc và kiểm tra chất lượng của một bài báo học thuật trước khi nó được xuất bản"
                },
                "examples": [
                    {
                        "en": "All papers are sent out to external referees.",
                        "vi": "Tất cả các giấy tờ được gửi cho các trọng tài bên ngoài."
                    }
                ]
            }
        ]
    }
]