[
    {
        "id": "575ec4829e2844d280f59b70ade4b83a",
        "word": "radio",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/ˈreɪdiəʊ/",
            "us": "/ˈreɪdiəʊ/"
        },
        "nearby": [
            {
                "word": "Radio 4",
                "pos": ""
            },
            {
                "word": "Radio 5 Live",
                "pos": ""
            },
            {
                "word": "radio",
                "pos": "noun"
            },
            {
                "word": "radio",
                "pos": "verb"
            },
            {
                "word": "radio-",
                "pos": "combining form"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the activity of broadcasting programmes for people to listen to; the programmes that are broadcast",
                    "vi": "hoạt động phát sóng các chương trình để mọi người cùng nghe; các chương trình được phát sóng"
                },
                "examples": [
                    {
                        "en": "The play was written specially for radio.",
                        "vi": "Vở kịch được viết đặc biệt cho đài phát thanh."
                    },
                    {
                        "en": "I listen to the radio on the way to work.",
                        "vi": "Tôi nghe đài trên đường đi làm."
                    },
                    {
                        "en": "on radio The interview was broadcast on radio and television.",
                        "vi": "trên đài phát thanh Cuộc phỏng vấn được phát trên đài phát thanh và truyền hình."
                    },
                    {
                        "en": "on the radio Did you hear the interview with him on the radio?",
                        "vi": "trên radio Bạn có nghe cuộc phỏng vấn với anh ấy trên radio không?"
                    },
                    {
                        "en": "national radio",
                        "vi": "đài phát thanh quốc gia"
                    },
                    {
                        "en": "a radio programme/show/broadcast/interview",
                        "vi": "một chương trình radio / chương trình / phát sóng / phỏng vấn"
                    },
                    {
                        "en": "a radio station/network",
                        "vi": "một đài phát thanh / mạng"
                    },
                    {
                        "en": "a radio host",
                        "vi": "một người dẫn chương trình phát thanh"
                    },
                    {
                        "en": "FM/commercial radio",
                        "vi": "Đài FM / thương mại"
                    },
                    {
                        "en": "digital/satellite radio",
                        "vi": "đài kỹ thuật số / vệ tinh"
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of equipment used for listening to programmes that are broadcast to the public",
                    "vi": "một thiết bị được sử dụng để nghe các chương trình được phát sóng cho công chúng"
                },
                "examples": [
                    {
                        "en": "to turn the radio on/off",
                        "vi": "để bật / tắt đài"
                    },
                    {
                        "en": "to have the radio on",
                        "vi": "bật đài"
                    },
                    {
                        "en": "a car radio",
                        "vi": "một đài phát thanh xe hơi"
                    },
                    {
                        "en": "His radio is permanently tuned to Heart FM.",
                        "vi": "Đài của anh ấy được điều chỉnh vĩnh viễn thành Heart FM."
                    }
                ]
            },
            {
                "define": {
                    "en": "the process of sending and receiving messages through the air using electromagnetic waves",
                    "vi": "quá trình gửi và nhận thông điệp qua không khí bằng sóng điện từ"
                },
                "examples": [
                    {
                        "en": "by radio He was unable to contact Blake by radio.",
                        "vi": "bằng radio Anh ấy không thể liên lạc với Blake bằng radio."
                    },
                    {
                        "en": "to keep in radio contact",
                        "vi": "để giữ liên lạc vô tuyến"
                    },
                    {
                        "en": "radio frequencies/signals/communications/waves",
                        "vi": "tần số / tín hiệu vô tuyến / truyền thông / sóng"
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of equipment, for example on ships or planes, for sending and receiving radio signals",
                    "vi": "một phần thiết bị, ví dụ trên tàu hoặc máy bay, để gửi và nhận tín hiệu vô tuyến"
                },
                "examples": [
                    {
                        "en": "on/over a radio They heard the gale warning over the ship’s radio.",
                        "vi": "trên / qua radio Họ nghe thấy cảnh báo gió giật qua radio của con tàu."
                    },
                    {
                        "en": "The airline company failed to reach the plane on its radio.",
                        "vi": "Công ty hàng không liên lạc với máy bay trên đài của họ."
                    },
                    {
                        "en": "There were calls for cab radios to link train drivers and signal boxes.",
                        "vi": "Đã có những cuộc gọi đến đài taxi để liên kết người lái tàu và hộp tín hiệu."
                    }
                ]
            }
        ]
    },
    {
        "id": "4928dc9fc7a04e5e888f5b0c1b4bba48",
        "word": "bottom",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈbɒtəm/",
            "us": "/ˈbɑːtəm/"
        },
        "nearby": [
            {
                "word": "bottle store",
                "pos": "noun"
            },
            {
                "word": "bottle up",
                "pos": "phrasal verb"
            },
            {
                "word": "bottom",
                "pos": "noun"
            },
            {
                "word": "bottom",
                "pos": "adjective"
            },
            {
                "word": "bottom",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the lowest part of something",
                    "vi": "Phần thấp nhất của cái gì đó"
                },
                "examples": [
                    {
                        "en": "the bottom of the screen/stairs/hill",
                        "vi": "cuối màn hình / cầu thang / đồi"
                    },
                    {
                        "en": "at the bottom of something Footnotes are given at the bottom of each page.",
                        "vi": "ở cuối trang nào đó Chú thích được đưa ra ở cuối mỗi trang."
                    },
                    {
                        "en": "at the bottom The book I want is right at the bottom (= of the pile).",
                        "vi": "ở dưới cùng Cuốn sách tôi muốn ở ngay dưới cùng (= của đống)."
                    },
                    {
                        "en": "The wind blew through gaps at the top and bottom of the door.",
                        "vi": "Gió thổi qua các khe hở ở trên và dưới cửa."
                    },
                    {
                        "en": "farmers who lived in the valley bottoms",
                        "vi": "những người nông dân sống ở đáy thung lũng"
                    }
                ]
            },
            {
                "define": {
                    "en": "the part of something that faces downwards and is not usually seen",
                    "vi": "phần của cái gì đó hướng xuống dưới và thường không được nhìn thấy"
                },
                "examples": [
                    {
                        "en": "The bottom of the pan was all sticky.",
                        "vi": "Đáy chảo đều dính."
                    },
                    {
                        "en": "on the bottom of something The ingredients are listed on the bottom of the box",
                        "vi": "ở dưới cùng của một cái gì đó Các thành phần được liệt kê ở dưới cùng của hộp"
                    }
                ]
            },
            {
                "define": {
                    "en": "the lowest surface on the inside of a container",
                    "vi": "bề mặt thấp nhất ở bên trong thùng chứa"
                },
                "examples": [
                    {
                        "en": "Line the bottom of the cage with newspaper.",
                        "vi": "Lót dưới đáy lồng bằng giấy báo."
                    },
                    {
                        "en": "at the bottom of something I found some coins at the bottom of my bag.",
                        "vi": "Tôi tìm thấy một số đồng xu ở đáy túi của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "the ground below the water in a lake, the sea, a swimming pool, etc.",
                    "vi": "mặt đất bên dưới mặt nước trong hồ, biển, bể bơi, v.v."
                },
                "examples": [
                    {
                        "en": "I feel safe as long as I can touch the bottom.",
                        "vi": "Tôi cảm thấy an toàn miễn là tôi có thể chạm vào đáy."
                    },
                    {
                        "en": "on the bottom (of something) He dived in and hit his head on the bottom.",
                        "vi": "on the bottom (of something) Anh ta lao vào và đập đầu vào đáy."
                    },
                    {
                        "en": "to the bottom (of something) The boat sank to the bottom of the sea.",
                        "vi": "to the bottom (of something) Con thuyền chìm xuống đáy biển."
                    }
                ]
            },
            {
                "define": {
                    "en": "the lowest position in a class, on a list, etc.; a person, team, etc. that is in this position",
                    "vi": "vị trí thấp nhất trong lớp, trong danh sách, v.v.; một người, nhóm, v.v. ở vị trí này"
                },
                "examples": [
                    {
                        "en": "When the list came out, my name was near the bottom.",
                        "vi": "Khi danh sách xuất hiện, tên tôi đã ở gần cuối."
                    },
                    {
                        "en": "I was always bottom of the class in math.",
                        "vi": "Tôi luôn đứng cuối lớp về môn toán."
                    },
                    {
                        "en": "at the bottom of something a battle between the teams at the bottom of the league",
                        "vi": "ở dưới cùng của một cái gì đó một trận chiến giữa các đội ở cuối giải đấu"
                    },
                    {
                        "en": "at the bottom You have to be prepared to start at the bottom and work your way up.",
                        "vi": "ở phía dưới Bạn phải chuẩn bị để bắt đầu từ phía dưới và làm việc theo cách của bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "the part of the body that you sit on",
                    "vi": "phần cơ thể mà bạn ngồi"
                },
                "examples": [
                    {
                        "en": "We sat on our bottoms on the damp grass.",
                        "vi": "Chúng tôi ngồi vắt vẻo trên bãi cỏ ẩm ướt."
                    }
                ]
            },
            {
                "define": {
                    "en": "the lower part of a set of clothes that consists of two pieces",
                    "vi": "phần dưới của một bộ quần áo bao gồm hai mảnh"
                },
                "examples": [
                    {
                        "en": "a pair of pyjama/tracksuit bottoms",
                        "vi": "một cặp đáy quần pyjama / bộ đồ thể thao"
                    },
                    {
                        "en": "a bikini bottom",
                        "vi": "đáy bikini"
                    }
                ]
            },
            {
                "define": {
                    "en": "the part of something that is furthest from you, your house, etc.",
                    "vi": "phần của thứ gì đó xa bạn nhất, ngôi nhà của bạn, v.v."
                },
                "examples": [
                    {
                        "en": "at the bottom of something There was a stream at the bottom of the garden.",
                        "vi": "ở dưới cùng của cái gì Có một con suối ở dưới cùng của khu vườn."
                    },
                    {
                        "en": "I went to the school at the bottom of our street.",
                        "vi": "Tôi đến trường ở cuối con phố của chúng tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "the lower part of a ship that is below the surface of the water",
                    "vi": "phần dưới của một con tàu nằm dưới mặt nước"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "having the type of bottom mentioned",
                    "vi": "có loại dưới cùng được đề cập"
                },
                "examples": [
                    {
                        "en": "a flat-bottomed boat",
                        "vi": "thuyền đáy bằng"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say what somebody/something is really like",
                    "vi": "được sử dụng để nói ai đó / cái gì đó thực sự như thế nào"
                },
                "examples": [
                    {
                        "en": "Their offer to help was at bottom self-centred.",
                        "vi": "Lời đề nghị giúp đỡ của họ cuối cùng là tự cho mình là trung tâm."
                    }
                ]
            },
            {
                "define": {
                    "en": "high up/low down in the structure of an organization or a society",
                    "vi": "lên / xuống thấp trong cấu trúc của một tổ chức hoặc một xã hội"
                },
                "examples": [
                    {
                        "en": "These workers are at the bottom of the economic heap.",
                        "vi": "Những người lao động này đang ở dưới cùng của đống kinh tế."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be the original cause of something, especially something unpleasant",
                    "vi": "là nguyên nhân ban đầu của điều gì đó, đặc biệt là điều gì đó khó chịu"
                },
                "examples": [
                    {
                        "en": "We need to find out what lies at the bottom of these fears.",
                        "vi": "Chúng ta cần tìm ra điều gì nằm dưới đáy của những nỗi sợ hãi này."
                    },
                    {
                        "en": "I'd love to know what lies at the bottom of all this.",
                        "vi": "Tôi muốn biết điều gì nằm ở cuối cùng của tất cả những điều này."
                    }
                ]
            },
            {
                "define": {
                    "en": "people stop buying or using the products of a particular industry",
                    "vi": "mọi người ngừng mua hoặc sử dụng các sản phẩm của một ngành cụ thể"
                },
                "examples": [
                    {
                        "en": "The bottom has fallen out of the travel market.",
                        "vi": "Đáy đã tụt khỏi thị trường du lịch."
                    }
                ]
            },
            {
                "define": {
                    "en": "in the least/most important position in a group of people or things",
                    "vi": "ở vị trí ít nhất / quan trọng nhất trong một nhóm người hoặc sự vật"
                },
                "examples": [
                    {
                        "en": "It’s been 20 years since a British player was top of the pile.",
                        "vi": "Đã 20 năm kể từ khi một cầu thủ người Anh đứng đầu bảng xếp hạng."
                    },
                    {
                        "en": "The government is doing little to help those at the bottom of the social pile.",
                        "vi": "Chính phủ đang làm rất ít để giúp đỡ những người ở dưới cùng của xã hội."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to express good wishes when drinking alcohol, or to tell somebody to finish their drink",
                    "vi": "được sử dụng để bày tỏ những lời chúc tốt đẹp khi uống rượu hoặc để nói với ai đó hãy uống hết đồ uống của họ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "in a way that is sincere",
                    "vi": "theo một cách chân thành"
                },
                "examples": [
                    {
                        "en": "I beg you, from the bottom of my heart, to spare his life.",
                        "vi": "Tôi cầu xin bạn, từ tận đáy lòng, hãy tha mạng cho anh ấy."
                    },
                    {
                        "en": "It was clearly an offer that came from the heart.",
                        "vi": "Đó rõ ràng là một lời đề nghị xuất phát từ trái tim."
                    },
                    {
                        "en": "I could tell he spoke from the heart.",
                        "vi": "Tôi có thể nói rằng anh ấy đã nói từ trái tim."
                    }
                ]
            },
            {
                "define": {
                    "en": "going to every part of a place in a very careful way",
                    "vi": "đi đến mọi nơi của một nơi một cách rất cẩn thận"
                },
                "examples": [
                    {
                        "en": "We cleaned the house from top to bottom.",
                        "vi": "Chúng tôi đã lau nhà từ trên xuống dưới."
                    }
                ]
            },
            {
                "define": {
                    "en": "to find out the real cause of something, especially something unpleasant",
                    "vi": "để tìm ra nguyên nhân thực sự của điều gì đó, đặc biệt là điều gì đó khó chịu"
                },
                "examples": [
                    {
                        "en": "I won’t rest until I’ve got to the bottom of this!",
                        "vi": "Tôi sẽ không nghỉ ngơi cho đến khi tôi đi đến tận cùng của chuyện này!"
                    },
                    {
                        "en": "The only way to get to the bottom of it is to confront the chairman.",
                        "vi": "Cách duy nhất để đi đến tận cùng của nó là đối đầu với chủ tịch."
                    }
                ]
            },
            {
                "define": {
                    "en": "a situation in which companies and countries compete with each other to produce goods as cheaply as possible by paying low wages and giving workers poor conditions and few rights",
                    "vi": "tình huống trong đó các công ty và quốc gia cạnh tranh với nhau để sản xuất hàng hóa càng rẻ càng tốt bằng cách trả lương thấp và tạo cho người lao động những điều kiện tồi tệ và ít quyền lợi"
                },
                "examples": [
                    {
                        "en": "They are caught in the cheap food syndrome, the race to the bottom, the chase for the lowest cost of production globally.",
                        "vi": "Họ bị mắc vào hội chứng thực phẩm rẻ, cuộc chạy đua tới đáy, cuộc chạy đua để có giá thành sản xuất thấp nhất trên toàn cầu."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have to use things or people that are not the best or most suitable because the ones that were the best or most suitable are no longer available",
                    "vi": "phải sử dụng những thứ hoặc những người không phải là tốt nhất hoặc phù hợp nhất vì những thứ tốt nhất hoặc phù hợp nhất không còn nữa"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to reach the ground at the bottom of an area of water",
                    "vi": "chạm đất ở đáy một vùng nước"
                },
                "examples": [
                    {
                        "en": "I put my feet down and touched bottom.",
                        "vi": "Tôi đặt chân xuống và chạm vào bên dưới."
                    }
                ]
            },
            {
                "define": {
                    "en": "to reach the worst possible state or condition",
                    "vi": "để đạt đến trạng thái hoặc điều kiện tồi tệ nhất có thể"
                },
                "examples": [
                    {
                        "en": "Her career really touched bottom with that movie.",
                        "vi": "Sự nghiệp của cô ấy thực sự chạm đáy với bộ phim đó."
                    }
                ]
            }
        ]
    },
    {
        "id": "33a489f139714fec8af6329c9821a2eb",
        "word": "sail",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/seɪl/",
            "us": "/seɪl/"
        },
        "nearby": [
            {
                "word": "said",
                "pos": ""
            },
            {
                "word": "sail",
                "pos": "verb"
            },
            {
                "word": "sail",
                "pos": "noun"
            },
            {
                "word": "sailboard",
                "pos": "noun"
            },
            {
                "word": "sailboarder",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a sheet of strong cloth which the wind blows against to make a boat or ship travel through the water",
                    "vi": "một tấm vải chắc chắn để gió thổi ngược lại để thuyền hoặc tàu đi trên mặt nước"
                },
                "examples": [
                    {
                        "en": "As the boat moved down the river the wind began to fill the sails.",
                        "vi": "Khi con thuyền di chuyển trên sông, gió bắt đầu lấp đầy cánh buồm."
                    },
                    {
                        "en": "under sail a ship under sail (= using sails)",
                        "vi": "dưới buồm một con tàu dưới buồm (= dùng buồm)"
                    },
                    {
                        "en": "in the days of sail (= when ships all used sails)",
                        "vi": "trong những ngày ra khơi (= khi tất cả các tàu đều sử dụng buồm)"
                    },
                    {
                        "en": "She moved away like a ship in full sail (= with all its sails spread out).",
                        "vi": "Cô ấy rời đi như một con tàu đang căng đầy buồm (= với tất cả các cánh buồm của nó dang rộng ra)."
                    },
                    {
                        "en": "The vessel can be propelled by oars or sail (= sails).",
                        "vi": "Con tàu có thể được đẩy bằng mái chèo hoặc buồm (= buồm)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a trip in a boat or ship",
                    "vi": "một chuyến đi trên thuyền hoặc tàu"
                },
                "examples": [
                    {
                        "en": "We went for a sail.",
                        "vi": "Chúng tôi ra khơi."
                    },
                    {
                        "en": "a two-hour sail across the bay",
                        "vi": "hai giờ đi thuyền qua vịnh"
                    },
                    {
                        "en": "He took us for a sail up the river.",
                        "vi": "Anh ấy đưa chúng tôi đi thuyền ngược dòng sông."
                    }
                ]
            },
            {
                "define": {
                    "en": "a set of boards attached to the arm of a windmill",
                    "vi": "một bộ ván gắn vào cánh tay của cối xay gió"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to begin a trip by sea",
                    "vi": "bắt đầu một chuyến đi bằng đường biển"
                },
                "examples": [
                    {
                        "en": "a liner setting sail from New York",
                        "vi": "một tàu buồm ra khơi từ New York"
                    },
                    {
                        "en": "We set sail (for France) at high tide.",
                        "vi": "Chúng tôi ra khơi (cho Pháp) khi thủy triều lên."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody suddenly less confident or angry, especially when you do or say something that they do not expect",
                    "vi": "khiến ai đó đột nhiên trở nên thiếu tự tin hoặc tức giận, đặc biệt là khi bạn làm hoặc nói điều gì đó mà họ không mong đợi"
                },
                "examples": [
                    {
                        "en": "When I agreed to his suggestion at once, it really took the wind out of his sails.",
                        "vi": "Khi tôi đồng ý với lời đề nghị của anh ấy ngay lập tức, điều đó thực sự đã khiến cánh buồm của anh ấy thuận buồm xuôi gió."
                    }
                ]
            },
            {
                "define": {
                    "en": "to arrange the sails of a boat to suit the wind so that the boat moves faster",
                    "vi": "sắp xếp buồm của thuyền cho phù hợp với gió để thuyền chuyển động nhanh hơn."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to reduce your costs",
                    "vi": "để giảm chi phí của bạn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "6f329845cc5b41feb8f62164261ecabb",
        "word": "wheel",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/wiːl/",
            "us": "/wiːl/"
        },
        "nearby": [
            {
                "word": "whee",
                "pos": "exclamation"
            },
            {
                "word": "wheedle",
                "pos": "verb"
            },
            {
                "word": "wheel",
                "pos": "noun"
            },
            {
                "word": "wheel",
                "pos": "verb"
            },
            {
                "word": "wheel arch",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "one of the round objects under a car, bicycle, bus, etc. that turns when it moves",
                    "vi": "một trong những vật thể tròn bên dưới ô tô, xe đạp, xe buýt, v.v. quay khi nó chuyển động"
                },
                "examples": [
                    {
                        "en": "He braked suddenly, causing the front wheels to skid.",
                        "vi": "Anh phanh gấp khiến bánh trước bị trượt."
                    },
                    {
                        "en": "the rear wheels of the car",
                        "vi": "bánh sau của ô tô"
                    },
                    {
                        "en": "She was killed when she was crushed under the wheels of a bus.",
                        "vi": "Cô đã thiệt mạng khi bị đè dưới bánh xe buýt."
                    },
                    {
                        "en": "I had lightweight wheels on my bike.",
                        "vi": "Tôi đã có bánh xe nhẹ trên chiếc xe đạp của mình."
                    },
                    {
                        "en": "tractors with powered front wheels",
                        "vi": "máy kéo có bánh trước được trợ lực"
                    },
                    {
                        "en": "on wheels One of the boys was pushing the other along in a little box on wheels.",
                        "vi": "trên bánh xe Một trong hai cậu bé đang đẩy người kia theo một chiếc hộp nhỏ trên bánh xe."
                    }
                ]
            },
            {
                "define": {
                    "en": "the round object used for controlling the direction in which a car, etc. or ship moves",
                    "vi": "vật thể tròn được sử dụng để điều khiển hướng mà ô tô, v.v. hoặc tàu di chuyển"
                },
                "examples": [
                    {
                        "en": "Always keep both hands on the wheel.",
                        "vi": "Luôn giữ cả hai tay trên bánh xe."
                    },
                    {
                        "en": "behind the wheel Never get behind the wheel if you're too tired.",
                        "vi": "sau tay lái Không bao giờ ngồi sau tay lái nếu bạn quá mệt."
                    },
                    {
                        "en": "This is the first time I've sat behind the wheel since the accident.",
                        "vi": "Đây là lần đầu tiên tôi ngồi sau tay lái kể từ vụ tai nạn."
                    },
                    {
                        "en": "at the wheel A car swept past with Laura at the wheel.",
                        "vi": "tại bánh xe Một chiếc xe lướt qua với Laura ở phía bánh xe."
                    },
                    {
                        "en": "Do you want to take the wheel (= drive) now?",
                        "vi": "Bạn có muốn cầm lái (= lái xe) ngay bây giờ không?"
                    },
                    {
                        "en": "She fell asleep at the wheel and crashed into a tree.",
                        "vi": "Cô ấy ngủ quên ở tay lái và đâm vào một cái cây."
                    }
                ]
            },
            {
                "define": {
                    "en": "a car",
                    "vi": "xe hơi"
                },
                "examples": [
                    {
                        "en": "At last he had his own wheels.",
                        "vi": "Cuối cùng thì anh ấy cũng có bánh xe của riêng mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "a flat, round part in a machine",
                    "vi": "một bộ phận tròn, phẳng trong máy"
                },
                "examples": [
                    {
                        "en": "gear wheels",
                        "vi": "bánh răng"
                    }
                ]
            },
            {
                "define": {
                    "en": "an organization or a system that seems to work like a complicated machine that is difficult to understand",
                    "vi": "một tổ chức hoặc một hệ thống dường như hoạt động như một cỗ máy phức tạp khó hiểu"
                },
                "examples": [
                    {
                        "en": "the wheels of bureaucracy/commerce/government",
                        "vi": "bánh xe của bộ máy quan liêu / thương mại / chính phủ"
                    },
                    {
                        "en": "It was Rob's idea. I merely set the wheels in motion (= started the process).",
                        "vi": "Đó là ý tưởng của Rob. Tôi chỉ đơn thuần đặt các bánh xe chuyển động (= bắt đầu quá trình)."
                    }
                ]
            },
            {
                "define": {
                    "en": "having the number or type of wheels mentioned",
                    "vi": "có số lượng hoặc loại bánh xe được đề cập"
                },
                "examples": [
                    {
                        "en": "a sixteen-wheeled lorry",
                        "vi": "một chiếc xe tải mười sáu bánh"
                    }
                ]
            },
            {
                "define": {
                    "en": "a car, bicycle, etc. with the number of wheels mentioned",
                    "vi": "một chiếc ô tô, xe đạp, v.v. với số bánh xe được đề cập"
                },
                "examples": [
                    {
                        "en": "a three-wheeler",
                        "vi": "một chiếc xe ba bánh"
                    }
                ]
            },
            {
                "define": {
                    "en": "not paying enough attention to what you need to do",
                    "vi": "không chú ý đủ đến những gì bạn cần làm"
                },
                "examples": [
                    {
                        "en": "Let's hope the regulators are not asleep at the wheel.",
                        "vi": "Hãy hy vọng các cơ quan quản lý không ngủ quên trong bánh xe."
                    },
                    {
                        "en": "They were asleep on the job as the financial crisis deepened.",
                        "vi": "Họ đã ngủ quên trong công việc khi cuộc khủng hoảng tài chính ngày càng sâu sắc."
                    },
                    {
                        "en": "Someone must have been asleep at the switch to alow this to happen.",
                        "vi": "Chắc hẳn ai đó đã ngủ quên ở công tắc để báo cho điều này xảy ra."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who is a small part of a large organization",
                    "vi": "một người là một phần nhỏ của một tổ chức lớn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to help something to happen easily and without problems, especially in business or politics",
                    "vi": "để giúp một điều gì đó xảy ra dễ dàng và không gặp vấn đề, đặc biệt là trong kinh doanh hoặc chính trị"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to start working very hard at a particular task",
                    "vi": "bắt đầu làm việc rất chăm chỉ trong một nhiệm vụ cụ thể"
                },
                "examples": [
                    {
                        "en": "Everyone is going to have to put their shoulder to the wheel.",
                        "vi": "Mọi người sẽ phải đặt vai của họ vào bánh xe."
                    }
                ]
            },
            {
                "define": {
                    "en": "to prevent somebody from putting their plans into operation",
                    "vi": "để ngăn chặn ai đó đưa kế hoạch của họ vào hoạt động"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to waste time creating something that already exists and works well",
                    "vi": "lãng phí thời gian để tạo ra thứ gì đó đã tồn tại và hoạt động tốt"
                },
                "examples": [
                    {
                        "en": "There’s no point in us reinventing the wheel.",
                        "vi": "Không có ích gì khi chúng tôi phát minh lại bánh xe."
                    }
                ]
            },
            {
                "define": {
                    "en": "a situation that is difficult to understand because it involves complicated or secret processes and decisions",
                    "vi": "một tình huống khó hiểu vì nó liên quan đến các quá trình và quyết định phức tạp hoặc bí mật"
                },
                "examples": [
                    {
                        "en": "There are wheels within wheels in this organization—you never really know what is going on.",
                        "vi": "Có những bánh xe trong bánh xe trong tổ chức này — bạn không bao giờ thực sự biết điều gì đang xảy ra."
                    }
                ]
            }
        ]
    },
    {
        "id": "0dfe76277e6546c9a33ef9a685887417",
        "word": "cabin",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈkæbɪn/",
            "us": "/ˈkæbɪn/"
        },
        "nearby": [
            {
                "word": "caber",
                "pos": "noun"
            },
            {
                "word": "Cabernet Sauvignon",
                "pos": "noun"
            },
            {
                "word": "cabin",
                "pos": "noun"
            },
            {
                "word": "cabin boy",
                "pos": "noun"
            },
            {
                "word": "cabin crew",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small room on a ship in which you live or sleep",
                    "vi": "một căn phòng nhỏ trên con tàu nơi bạn sống hoặc ngủ"
                },
                "examples": [
                    {
                        "en": "I lay in my cabin feeling miserably seasick.",
                        "vi": "Tôi nằm trong cabin của mình với cảm giác say sóng thảm hại."
                    }
                ]
            },
            {
                "define": {
                    "en": "one of the areas for passengers to sit in a plane",
                    "vi": "một trong những khu vực dành cho hành khách ngồi máy bay"
                },
                "examples": [
                    {
                        "en": "the first-class cabin",
                        "vi": "khoang hạng nhất"
                    }
                ]
            },
            {
                "define": {
                    "en": "a small house or shelter, usually made of wood",
                    "vi": "một ngôi nhà nhỏ hoặc nơi trú ẩn, thường làm bằng gỗ"
                },
                "examples": [
                    {
                        "en": "a log cabin",
                        "vi": "nhà chòi bằng gỗ"
                    }
                ]
            }
        ]
    },
    {
        "id": "c6815f6abcd943fca2154fb67faf56a4",
        "word": "deck",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/dek/",
            "us": "/dek/"
        },
        "nearby": [
            {
                "word": "decisively",
                "pos": "adverb"
            },
            {
                "word": "decisiveness",
                "pos": "noun"
            },
            {
                "word": "deck",
                "pos": "noun"
            },
            {
                "word": "deck",
                "pos": "verb"
            },
            {
                "word": "deckchair",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the top outside floor of a ship or boat",
                    "vi": "tầng trên cùng bên ngoài của một con tàu hoặc thuyền"
                },
                "examples": [
                    {
                        "en": "on deck I was the only person on deck at that time of night.",
                        "vi": "trên boong tôi là người duy nhất trên boong vào thời điểm đó trong đêm."
                    },
                    {
                        "en": "When we heard the alarm, we went up on deck.",
                        "vi": "Khi chúng tôi nghe thấy tiếng chuông báo động, chúng tôi đi lên boong."
                    },
                    {
                        "en": "below deck(s) As the storm began, everyone disappeared below deck(s).",
                        "vi": "bên dưới boong Khi cơn bão bắt đầu, tất cả mọi người đều biến mất bên dưới (các) boong."
                    }
                ]
            },
            {
                "define": {
                    "en": "one of the floors of a ship or a bus",
                    "vi": "một trong các tầng của tàu hoặc xe buýt"
                },
                "examples": [
                    {
                        "en": "the upper/lower/main deck of a ship",
                        "vi": "boong trên / dưới / chính của tàu"
                    },
                    {
                        "en": "We sat on the top deck of the bus.",
                        "vi": "Chúng tôi ngồi trên boong trên cùng của xe buýt."
                    },
                    {
                        "en": "My cabin is on deck C.",
                        "vi": "Cabin của tôi ở trên boong C."
                    }
                ]
            },
            {
                "define": {
                    "en": "a floor or platform similar to the deck of a ship",
                    "vi": "sàn hoặc bệ tương tự như boong tàu"
                },
                "examples": [
                    {
                        "en": "There is an open-air observation deck on the building's top floor.",
                        "vi": "Có một đài quan sát ngoài trời trên tầng cao nhất của tòa nhà."
                    },
                    {
                        "en": "He fell from the upper deck of the car park.",
                        "vi": "Anh ta rơi từ boong trên của bãi đậu xe."
                    },
                    {
                        "en": "a roof/rooftop deck",
                        "vi": "một mái nhà / sân thượng"
                    }
                ]
            },
            {
                "define": {
                    "en": "a complete set of 52 playing cards",
                    "vi": "một bộ hoàn chỉnh gồm 52 thẻ chơi"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a wooden floor that is built outside the back of a house where you can sit and relax",
                    "vi": "một sàn gỗ được xây dựng bên ngoài phía sau của một ngôi nhà, nơi bạn có thể ngồi và thư giãn"
                },
                "examples": [
                    {
                        "en": "After dinner we sat out on the deck.",
                        "vi": "Sau bữa tối, chúng tôi ngồi trên boong."
                    }
                ]
            },
            {
                "define": {
                    "en": "a part of a sound system that records and/or plays sounds on a disc or tape",
                    "vi": "một phần của hệ thống âm thanh ghi và / hoặc phát âm thanh trên đĩa hoặc băng"
                },
                "examples": [
                    {
                        "en": "a cassette/tape deck",
                        "vi": "một khay băng / cassette"
                    }
                ]
            },
            {
                "define": {
                    "en": "a set of slides (= pages created on a computer that contain text and images) that are used to accompany a person’s presentation",
                    "vi": "một tập hợp các trang trình bày (= các trang được tạo trên máy tính có chứa văn bản và hình ảnh) được sử dụng để đi kèm với bản trình bày của một người"
                },
                "examples": [
                    {
                        "en": "Three slides into my 35-slide deck, they asked me to turn off the projector.",
                        "vi": "Ba trang chiếu vào bộ bài gồm 35 trang của tôi, họ yêu cầu tôi tắt máy chiếu."
                    }
                ]
            },
            {
                "define": {
                    "en": "everyone helps or must help, especially in a difficult situation",
                    "vi": "mọi người giúp đỡ hoặc phải giúp đỡ, đặc biệt là trong một hoàn cảnh khó khăn"
                },
                "examples": [
                    {
                        "en": "There are 30 people coming to dinner tonight, so it's all hands on deck.",
                        "vi": "Có 30 người đến ăn tối tối nay, vì vậy tất cả đều sẵn sàng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to prepare for an activity, event, etc. by removing anything that is not essential to it",
                    "vi": "để chuẩn bị cho một hoạt động, sự kiện, v.v. bằng cách loại bỏ bất cứ thứ gì không cần thiết đối với nó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to fall to the ground",
                    "vi": "rơi xuống đất"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "026a0e2230f44b1ca188083c0e9e9e0b",
        "word": "engine room",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈendʒɪn ruːm/",
            "us": "/ˈendʒɪn ruːm/"
        },
        "nearby": [
            {
                "word": "engineer",
                "pos": "verb"
            },
            {
                "word": "engineering",
                "pos": "noun"
            },
            {
                "word": "engine room",
                "pos": "noun"
            },
            {
                "word": "England",
                "pos": ""
            },
            {
                "word": "the England and Wales Cricket Board",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the part of a ship where the engines are",
                    "vi": "phần của một con tàu nơi có động cơ"
                },
                "examples": [
                    {
                        "en": "There was a fire in the engine room.",
                        "vi": "Có một đám cháy trong phòng máy."
                    },
                    {
                        "en": "the ship's engine room",
                        "vi": "phòng máy của tàu"
                    }
                ]
            },
            {
                "define": {
                    "en": "the part of an organization where most of the important activity takes place or important decisions are made",
                    "vi": "bộ phận của tổ chức nơi hầu hết các hoạt động quan trọng diễn ra hoặc các quyết định quan trọng được đưa ra"
                },
                "examples": [
                    {
                        "en": "The Madrid office is the engine room of the company.",
                        "vi": "Văn phòng Madrid là phòng máy của công ty."
                    }
                ]
            }
        ]
    },
    {
        "id": "1d7a9b24e45e445ca448a7513a2a2c02",
        "word": "life jacket",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈlaɪf dʒækɪt/",
            "us": "/ˈlaɪf dʒækɪt/"
        },
        "nearby": [
            {
                "word": "life history",
                "pos": "noun"
            },
            {
                "word": "life insurance",
                "pos": "noun"
            },
            {
                "word": "life jacket",
                "pos": "noun"
            },
            {
                "word": "lifeless",
                "pos": "adjective"
            },
            {
                "word": "lifelike",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a jacket without arms that can be filled with air, designed to help you float if you fall in water",
                    "vi": "một chiếc áo khoác không có tay có thể chứa đầy không khí, được thiết kế để giúp bạn nổi nếu bạn rơi xuống nước"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c325e10fdd184eb59db27bafb121181e",
        "word": "life vest",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈlaɪf vest/",
            "us": "/ˈlaɪf vest/"
        },
        "nearby": [
            {
                "word": "life-threatening",
                "pos": "adjective"
            },
            {
                "word": "lifetime",
                "pos": "noun"
            },
            {
                "word": "life vest",
                "pos": "noun"
            },
            {
                "word": "LIFO",
                "pos": "abbreviation"
            },
            {
                "word": "lift",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a jacket without arms that can be filled with air, designed to help you float if you fall in water",
                    "vi": "một chiếc áo khoác không có tay có thể chứa đầy không khí, được thiết kế để giúp bạn nổi nếu bạn rơi xuống nước"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "06ac1cf492054f0f8e7955b3ad610479",
        "word": "anchor",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈæŋkə(r)/",
            "us": "/ˈæŋkər/"
        },
        "nearby": [
            {
                "word": "ancestral",
                "pos": "adjective"
            },
            {
                "word": "ancestry",
                "pos": "noun"
            },
            {
                "word": "anchor",
                "pos": "noun"
            },
            {
                "word": "anchor",
                "pos": "verb"
            },
            {
                "word": "anchorage",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a heavy metal object that is attached to a rope or chain and dropped over the side of a ship or boat to keep it in one place",
                    "vi": "một vật kim loại nặng được gắn vào một sợi dây hoặc dây xích và thả xuống mạn tàu hoặc thuyền để giữ nó ở một chỗ"
                },
                "examples": [
                    {
                        "en": "to drop anchor",
                        "vi": "thả neo"
                    },
                    {
                        "en": "We raised the anchor and set sail.",
                        "vi": "Chúng tôi nhổ neo và ra khơi."
                    },
                    {
                        "en": "We weighed anchor (= pulled it out of the water).",
                        "vi": "Chúng tôi cân neo (= kéo nó lên khỏi mặt nước)."
                    },
                    {
                        "en": "at anchor The ship lay at anchor two miles off the rocky coast.",
                        "vi": "lúc thả neo Con tàu thả neo cách bờ biển đầy đá hai dặm."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person or thing that gives somebody a feeling of safety",
                    "vi": "một người hoặc vật mang lại cho ai đó cảm giác an toàn"
                },
                "examples": [
                    {
                        "en": "the anchor of the family",
                        "vi": "mỏ neo của gia đình"
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who presents a live radio or television programme and introduces reports by other people; an anchorman or anchorwoman",
                    "vi": "người trình bày chương trình phát thanh, truyền hình trực tiếp và giới thiệu các báo cáo của người khác; một người thợ neo hoặc người phụ nữ neo đậu"
                },
                "examples": [
                    {
                        "en": "ABC news anchor Peter Jennings",
                        "vi": "Người dẫn chương trình tin tức ABC Peter Jennings"
                    }
                ]
            }
        ]
    },
    {
        "id": "1e0937ae1b9246c4bbd3016678f66181",
        "word": "automatic pilot",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌɔːtəmætɪk ˈpaɪlət/",
            "us": "/ˌɔːtəmætɪk ˈpaɪlət/"
        },
        "nearby": [
            {
                "word": "automatic license plate recognition",
                "pos": "noun"
            },
            {
                "word": "automatic number plate recognition",
                "pos": "noun"
            },
            {
                "word": "automatic pilot",
                "pos": "noun"
            },
            {
                "word": "automatic transmission",
                "pos": "noun"
            },
            {
                "word": "automatic writing",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a device in an aircraft or a ship that keeps it on a fixed course without the need for a person to control it",
                    "vi": "một thiết bị trên máy bay hoặc tàu thủy giữ nó đi theo hướng cố định mà không cần người điều khiển"
                },
                "examples": [
                    {
                        "en": "The aircraft was set on automatic pilot.",
                        "vi": "Máy bay được thiết lập trên phi công tự động."
                    }
                ]
            },
            {
                "define": {
                    "en": "to do something without thinking because you have done the same thing many times before",
                    "vi": "để làm điều gì đó mà không cần suy nghĩ bởi vì bạn đã làm điều tương tự nhiều lần trước đây"
                },
                "examples": [
                    {
                        "en": "I got up and dressed on automatic pilot.",
                        "vi": "Tôi đứng dậy và mặc quần áo phi công tự động."
                    }
                ]
            }
        ]
    },
    {
        "id": "7d93e65870454caf8fa6f954df545a4e",
        "word": "autopilot",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈɔːtəʊpaɪlət/",
            "us": "/ˈɔːtəʊpaɪlət/"
        },
        "nearby": [
            {
                "word": "autonomously",
                "pos": "adverb"
            },
            {
                "word": "autonomy",
                "pos": "noun"
            },
            {
                "word": "autopilot",
                "pos": "noun"
            },
            {
                "word": "autopsy",
                "pos": "noun"
            },
            {
                "word": "auto racing",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a device in an aircraft or a ship that keeps it on a fixed course without the need for a person to control it",
                    "vi": "một thiết bị trên máy bay hoặc tàu thủy giữ nó đi theo hướng cố định mà không cần người điều khiển"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to do something without thinking because you have done the same thing many times before",
                    "vi": "để làm điều gì đó mà không cần suy nghĩ bởi vì bạn đã làm điều tương tự nhiều lần trước đây"
                },
                "examples": [
                    {
                        "en": "I got up and dressed on autopilot.",
                        "vi": "Tôi đứng dậy và mặc quần áo trên máy lái tự động."
                    }
                ]
            }
        ]
    },
    {
        "id": "08b5f68b296543f1834813bba7acbdaa",
        "word": "cable",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈkeɪbl/",
            "us": "/ˈkeɪbl/"
        },
        "nearby": [
            {
                "word": "cabinet pudding",
                "pos": "noun"
            },
            {
                "word": "cabinetry",
                "pos": "noun"
            },
            {
                "word": "cable",
                "pos": "noun"
            },
            {
                "word": "cable",
                "pos": "verb"
            },
            {
                "word": "Cable & Wireless Communications",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a set of wires, covered in plastic or rubber, that carries electricity, phone signals, etc.",
                    "vi": "một bộ dây dẫn điện, tín hiệu điện thoại, v.v."
                },
                "examples": [
                    {
                        "en": "fibre-optic cable",
                        "vi": "cáp quang"
                    },
                    {
                        "en": "a power cable",
                        "vi": "một dây cáp điện"
                    },
                    {
                        "en": "overhead/underground/undersea cables",
                        "vi": "cáp trên không / ngầm / dưới biển"
                    },
                    {
                        "en": "a 10 000-volt cable",
                        "vi": "cáp 10 000 vôn"
                    },
                    {
                        "en": "a USB cable",
                        "vi": "một cáp USB"
                    },
                    {
                        "en": "a length of electric cable",
                        "vi": "chiều dài của cáp điện"
                    },
                    {
                        "en": "They're digging up the road to lay cables.",
                        "vi": "Họ đang đào đường để đặt dây cáp."
                    }
                ]
            },
            {
                "define": {
                    "en": "thick strong metal rope used on ships, for supporting bridges, etc.",
                    "vi": "dây kim loại dày chắc chắn được sử dụng trên tàu, để hỗ trợ cầu, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a system of broadcasting television programmes along wires rather than by radio waves",
                    "vi": "một hệ thống phát sóng các chương trình truyền hình dọc theo dây chứ không phải bằng sóng vô tuyến"
                },
                "examples": [
                    {
                        "en": "We can receive up to 500 cable channels.",
                        "vi": "Chúng tôi có thể nhận tới 500 kênh truyền hình cáp."
                    },
                    {
                        "en": "We just had cable installed.",
                        "vi": "Chúng tôi vừa mới lắp đặt cáp."
                    }
                ]
            },
            {
                "define": {
                    "en": "a message sent by electrical signals and printed out",
                    "vi": "một thông điệp được gửi bởi các tín hiệu điện và được in ra"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "b1e0bdc5128743debe8290e695d9a9dd",
        "word": "cargo",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈkɑːɡəʊ/",
            "us": "/ˈkɑːrɡəʊ/"
        },
        "nearby": [
            {
                "word": "care worker",
                "pos": "noun"
            },
            {
                "word": "careworn",
                "pos": "adjective"
            },
            {
                "word": "cargo",
                "pos": "noun"
            },
            {
                "word": "cargo pants",
                "pos": "noun"
            },
            {
                "word": "Carib",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the goods carried in a ship, an aircraft or a motor vehicle",
                    "vi": "hàng hóa được vận chuyển trên tàu thủy, máy bay hoặc một phương tiện cơ giới"
                },
                "examples": [
                    {
                        "en": "The tanker began to spill its cargo of oil.",
                        "vi": "Chiếc tàu chở dầu bắt đầu làm tràn dầu của nó."
                    },
                    {
                        "en": "a cargo ship",
                        "vi": "một con tàu chở hàng"
                    }
                ]
            }
        ]
    },
    {
        "id": "222878168b47480285c34627fad917bc",
        "word": "cockpit",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈkɒkpɪt/",
            "us": "/ˈkɑːkpɪt/"
        },
        "nearby": [
            {
                "word": "cockleshell",
                "pos": "noun"
            },
            {
                "word": "cockney",
                "pos": "noun"
            },
            {
                "word": "cockpit",
                "pos": "noun"
            },
            {
                "word": "cockroach",
                "pos": "noun"
            },
            {
                "word": "John Cockroft",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the area in a plane, boat or racing car where the pilot or driver sits",
                    "vi": "khu vực trên máy bay, thuyền hoặc xe đua nơi phi công hoặc người lái"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "eb424cc45c794320bd1db8317772b57c",
        "word": "container",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/kənˈteɪnə(r)/",
            "us": "/kənˈteɪnər/"
        },
        "nearby": [
            {
                "word": "contagiously",
                "pos": "adverb"
            },
            {
                "word": "contain",
                "pos": "verb"
            },
            {
                "word": "container",
                "pos": "noun"
            },
            {
                "word": "containerization",
                "pos": "noun"
            },
            {
                "word": "containerized",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a box, bottle, etc. in which something can be stored or transported",
                    "vi": "một hộp, chai, v.v. trong đó một thứ gì đó có thể được cất giữ hoặc vận chuyển"
                },
                "examples": [
                    {
                        "en": "a plastic container",
                        "vi": "một hộp nhựa"
                    },
                    {
                        "en": "in a container Food will last longer if kept in an airtight container.",
                        "vi": "trong hộp Thực phẩm sẽ tươi lâu hơn nếu được giữ trong hộp kín."
                    },
                    {
                        "en": "container of something These women carry heavy containers of water over long distances.",
                        "vi": "thùng chứa thứ gì đó Những người phụ nữ này mang những thùng nước nặng trên quãng đường dài."
                    },
                    {
                        "en": "container for something containers for nuclear materials",
                        "vi": "thùng chứa thứ gì đó thùng chứa vật liệu hạt nhân"
                    }
                ]
            },
            {
                "define": {
                    "en": "a large metal or wooden box of a standard size in which goods are packed so that they can easily be lifted onto a ship, train, etc. to be transported",
                    "vi": "một hộp lớn bằng kim loại hoặc bằng gỗ có kích thước tiêu chuẩn để hàng hóa được đóng gói để có thể dễ dàng nâng lên tàu, xe lửa, v.v. để vận chuyển"
                },
                "examples": [
                    {
                        "en": "a shipping container",
                        "vi": "một container vận chuyển"
                    },
                    {
                        "en": "a container ship (= one designed to transport such containers)",
                        "vi": "một tàu container (= một tàu được thiết kế để vận chuyển những container như vậy)"
                    }
                ]
            },
            {
                "define": {
                    "en": "a box or pot made of wood, clay, plastic, etc. for growing plants in",
                    "vi": "hộp hoặc chậu làm bằng gỗ, đất sét, nhựa, v.v. để trồng cây trong"
                },
                "examples": [
                    {
                        "en": "Planting bulbs in containers is a great alternative if you don't have a garden.",
                        "vi": "Trồng củ trong thùng chứa là một giải pháp thay thế tuyệt vời nếu bạn không có vườn."
                    }
                ]
            }
        ]
    },
    {
        "id": "b52c5406458f47b3b9661896201a3a62",
        "word": "forward",
        "pos": "adverb",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈfɔːwəd/",
            "us": "/ˈfɔːrwərd/"
        },
        "nearby": [
            {
                "word": "forty winks",
                "pos": "noun"
            },
            {
                "word": "forum",
                "pos": "noun"
            },
            {
                "word": "forward",
                "pos": "adverb"
            },
            {
                "word": "forward",
                "pos": "adjective"
            },
            {
                "word": "forward",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "towards a place or position that is in front",
                    "vi": "hướng tới một địa điểm hoặc vị trí ở phía trước"
                },
                "examples": [
                    {
                        "en": "She leaned forward and kissed him on the cheek.",
                        "vi": "Cô rướn người và hôn lên má anh."
                    },
                    {
                        "en": "He took two steps forwards.",
                        "vi": "Anh ta tiến hai bước về phía trước."
                    },
                    {
                        "en": "They ran forward to welcome her.",
                        "vi": "Họ chạy về phía trước để chào đón cô."
                    },
                    {
                        "en": "The procession slowly moved forward.",
                        "vi": "Đoàn rước từ từ tiến về phía trước."
                    },
                    {
                        "en": "Turn your wrists so that your palms face forward.",
                        "vi": "Xoay cổ tay để lòng bàn tay hướng về phía trước."
                    },
                    {
                        "en": "He stands by the fire, rocking backward and forward.",
                        "vi": "Anh ta đứng bên đống lửa, đung đưa về phía sau và phía trước."
                    }
                ]
            },
            {
                "define": {
                    "en": "towards the future; ahead in time",
                    "vi": "hướng tới tương lai; đi trước trong thời gian"
                },
                "examples": [
                    {
                        "en": "Looking forward, we hope to expand our operations in several of our overseas branches.",
                        "vi": "Về phía trước, chúng tôi hy vọng sẽ mở rộng hoạt động của mình tại một số chi nhánh ở nước ngoài."
                    },
                    {
                        "en": "The next scene takes the story forwards five years.",
                        "vi": "Cảnh tiếp theo đưa câu chuyện về sau năm năm."
                    },
                    {
                        "en": "The series moves back and forward through time.",
                        "vi": "Chuỗi di chuyển ngược và xuôi theo thời gian."
                    },
                    {
                        "en": "(old use) from this day forward",
                        "vi": "(sử dụng cũ) kể từ ngày này trở đi"
                    }
                ]
            },
            {
                "define": {
                    "en": "towards a good result",
                    "vi": "hướng tới một kết quả tốt"
                },
                "examples": [
                    {
                        "en": "We consider this agreement to be an important step forward.",
                        "vi": "Chúng tôi coi thỏa thuận này là một bước tiến quan trọng."
                    },
                    {
                        "en": "Cutting our costs is the only way forward.",
                        "vi": "Cắt giảm chi phí của chúng tôi là cách duy nhất để tiếp tục."
                    },
                    {
                        "en": "We are not getting any further forward with the discussion.",
                        "vi": "Chúng tôi sẽ không tiến xa hơn với cuộc thảo luận."
                    },
                    {
                        "en": "The project will go forward (= continue) as planned.",
                        "vi": "Dự án sẽ tiếp tục (= tiếp tục) theo kế hoạch."
                    },
                    {
                        "en": "The 21st century has seen trade between the two countries leap forward.",
                        "vi": "Thế kỷ 21 đã chứng kiến thương mại giữa hai nước có bước phát triển vượt bậc."
                    }
                ]
            },
            {
                "define": {
                    "en": "earlier; sooner",
                    "vi": "sớm hơn; sớm hơn"
                },
                "examples": [
                    {
                        "en": "It was decided to bring the meeting forward two weeks.",
                        "vi": "Nó đã được quyết định đưa cuộc họp về phía trước hai tuần."
                    }
                ]
            },
            {
                "define": {
                    "en": "in or towards the front part of a ship or plane",
                    "vi": "trong hoặc về phía trước của một con tàu hoặc máy bay"
                },
                "examples": [
                    {
                        "en": "forward of something The main cabin is situated forward of (= in front of) the mast.",
                        "vi": "phía trước của cái gì đó Cabin chính nằm phía trước (= phía trước) cột buồm."
                    }
                ]
            },
            {
                "define": {
                    "en": "from one place or position to another and back again many times",
                    "vi": "từ vị trí này sang vị trí khác và quay lại nhiều lần"
                },
                "examples": [
                    {
                        "en": "She rocked backwards and forwards on her chair.",
                        "vi": "Cô đung đưa tới lui trên ghế."
                    },
                    {
                        "en": "The film skips backwards and forwards through time.",
                        "vi": "Bộ phim tua đi tua lại xuyên thời gian."
                    }
                ]
            },
            {
                "define": {
                    "en": "in the future, starting from now",
                    "vi": "trong tương lai, bắt đầu từ bây giờ"
                },
                "examples": [
                    {
                        "en": "We have a very solid financial position going forward.",
                        "vi": "Chúng tôi có một tình hình tài chính rất vững chắc trong tương lai."
                    },
                    {
                        "en": "The strategy going forward is still undecided.",
                        "vi": "Chiến lược sắp tới vẫn chưa được quyết định."
                    },
                    {
                        "en": "Moving forward, we need to have a real plan.",
                        "vi": "Về phía trước, chúng ta cần phải có một kế hoạch thực sự."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make a great effort to do something, especially if it is difficult or you are feeling tired",
                    "vi": "nỗ lực rất nhiều để làm một việc gì đó, đặc biệt nếu việc đó khó hoặc bạn đang cảm thấy mệt mỏi"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to change the time shown by clocks, usually by one hour, when the time changes officially, for example at the beginning and end of summer",
                    "vi": "để thay đổi thời gian được hiển thị bởi đồng hồ, thường là một giờ, khi thời gian chính thức thay đổi, ví dụ: vào đầu và cuối mùa hè"
                },
                "examples": [
                    {
                        "en": "Remember to put your clocks back tonight.",
                        "vi": "Hãy nhớ đặt lại đồng hồ của bạn tối nay."
                    }
                ]
            }
        ]
    },
    {
        "id": "ada6e0ac44fd4748b7c487825ef1db1c",
        "word": "hold",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/həʊld/",
            "us": "/həʊld/"
        },
        "nearby": [
            {
                "word": "Holby City",
                "pos": ""
            },
            {
                "word": "hold",
                "pos": "verb"
            },
            {
                "word": "hold",
                "pos": "noun"
            },
            {
                "word": "hold against",
                "pos": "phrasal verb"
            },
            {
                "word": "holdall",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the action of holding somebody/something; the way you are holding somebody/something",
                    "vi": "hành động giữ ai đó / cái gì đó; cách bạn đang ôm ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "hold on somebody/something His hold on her arm tightened.",
                        "vi": "giữ chặt ai đó / cái gì đó Anh ấy ôm chặt lấy cánh tay của cô ấy."
                    },
                    {
                        "en": "He lost his hold on the rock and was swept away by the tide.",
                        "vi": "Anh ta mất khả năng bám vào tảng đá và bị thủy triều cuốn trôi."
                    },
                    {
                        "en": "Make sure you've got a steady hold on the camera.",
                        "vi": "Đảm bảo bạn đã cầm chắc máy ảnh."
                    },
                    {
                        "en": "She tried to keep hold of the child's hand.",
                        "vi": "Cô cố gắng giữ tay đứa trẻ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a particular way of holding somebody, especially in a fight or in a sport such as wrestling",
                    "vi": "một cách cụ thể để giữ ai đó, đặc biệt là trong một cuộc chiến hoặc trong một môn thể thao như đấu vật"
                },
                "examples": [
                    {
                        "en": "in a hold He still had me in a tight hold.",
                        "vi": "trong tình trạng bế tắc Anh vẫn giữ chặt tôi."
                    },
                    {
                        "en": "The wrestler put his opponent into a head hold.",
                        "vi": "Đô vật đặt đối thủ của mình vào thế ôm đầu."
                    },
                    {
                        "en": "The exercise called for the recruits to get out of various holds.",
                        "vi": "Cuộc tập trận kêu gọi các tân binh thoát ra khỏi các đợt giam giữ khác nhau."
                    }
                ]
            },
            {
                "define": {
                    "en": "influence, power or control over somebody/something",
                    "vi": "ảnh hưởng, quyền lực hoặc quyền kiểm soát ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "He struggled to get a hold of his anger.",
                        "vi": "Anh cố gắng kìm chế cơn tức giận của mình."
                    },
                    {
                        "en": "hold over somebody/something What she knew about his past gave her a hold over him.",
                        "vi": "nắm giữ ai đó / điều gì đó Những gì cô ấy biết về quá khứ của anh ấy đã giúp cô ấy nắm giữ anh ấy."
                    },
                    {
                        "en": "hold on somebody/something This crisis had weakened his hold on power.",
                        "vi": "giữ chặt ai đó / cái gì đó Cuộc khủng hoảng này đã làm suy yếu khả năng nắm giữ quyền lực của anh ta."
                    }
                ]
            },
            {
                "define": {
                    "en": "a place where you can put your hands or feet when climbing",
                    "vi": "nơi bạn có thể đặt tay hoặc chân khi leo núi"
                },
                "examples": [
                    {
                        "en": "in a hold She put her foot firmly in the hold and pulled herself up.",
                        "vi": "Cô ấy đặt chân vào chỗ giữ và kéo người lên."
                    }
                ]
            },
            {
                "define": {
                    "en": "the part of a ship or plane where the goods being carried are stored",
                    "vi": "phần của một con tàu hoặc máy bay nơi hàng hóa được vận chuyển được lưu trữ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to have or take somebody/something in your hands",
                    "vi": "có hoặc nắm lấy ai đó / thứ gì đó trong tay bạn"
                },
                "examples": [
                    {
                        "en": "He caught hold of her wrists so she couldn't get away.",
                        "vi": "Anh nắm lấy cổ tay cô để cô không thể thoát ra."
                    },
                    {
                        "en": "Lee got hold of the dog by its collar.",
                        "vi": "Lee đã nắm lấy cổ của con chó."
                    },
                    {
                        "en": "Quick, grab a hold of that rope.",
                        "vi": "Nhanh lên, nắm lấy sợi dây đó."
                    },
                    {
                        "en": "Gently, she took hold of the door handle and turned it.",
                        "vi": "Nhẹ nhàng, cô nắm lấy tay nắm cửa và xoay nó."
                    }
                ]
            },
            {
                "define": {
                    "en": "to contact or find somebody",
                    "vi": "để liên hệ hoặc tìm ai đó"
                },
                "examples": [
                    {
                        "en": "Where have you been? I've been trying to get hold of you all day.",
                        "vi": "Bạn đã ở đâu Tôi đã cố gắng giữ lấy bạn cả ngày."
                    },
                    {
                        "en": "Eventually, we got hold of Dan in New York.",
                        "vi": "Cuối cùng, chúng tôi đã nắm được Dan ở New York."
                    },
                    {
                        "en": "Do you know where I can get hold of a good plumber?",
                        "vi": "Bạn có biết tôi có thể tìm được một thợ sửa ống nước giỏi ở đâu không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to find something that you want or need",
                    "vi": "để tìm một cái gì đó mà bạn muốn hoặc cần"
                },
                "examples": [
                    {
                        "en": "I need to get hold of Tom's address.",
                        "vi": "Tôi cần biết địa chỉ của Tom."
                    },
                    {
                        "en": "It's almost impossible to get hold of tickets for the final.",
                        "vi": "Gần như không thể cầm được vé xem trận chung kết."
                    },
                    {
                        "en": "The police do not know how the boy got hold of the knife.",
                        "vi": "Cảnh sát không biết làm thế nào mà cậu bé cầm được con dao."
                    },
                    {
                        "en": "How did the press get hold of the story?",
                        "vi": "Làm thế nào mà báo chí nắm bắt được câu chuyện?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to learn or understand something",
                    "vi": "để học hoặc hiểu điều gì đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to understand something in the wrong way",
                    "vi": "hiểu sai điều gì đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "with no rules or limits on what somebody is allowed to do",
                    "vi": "không có quy tắc hoặc giới hạn về những gì ai đó được phép làm"
                },
                "examples": [
                    {
                        "en": "There will be no holds barred in his interview with the president this evening.",
                        "vi": "Sẽ không có bất kỳ điều gì bị cấm trong cuộc phỏng vấn của anh ấy với tổng thống vào tối nay."
                    }
                ]
            },
            {
                "define": {
                    "en": "delayed until a later time or date",
                    "vi": "bị trì hoãn cho đến một thời gian hoặc ngày sau đó"
                },
                "examples": [
                    {
                        "en": "She put her career on hold to have a baby.",
                        "vi": "Cô tạm gác sự nghiệp để sinh con."
                    },
                    {
                        "en": "The project is on hold until more money is available.",
                        "vi": "Dự án đang tạm dừng cho đến khi có thêm tiền."
                    },
                    {
                        "en": "The department has placed its plans on hold pending the results of the elections.",
                        "vi": "Bộ đã tạm dừng các kế hoạch của mình trong khi chờ kết quả của cuộc bầu cử."
                    }
                ]
            },
            {
                "define": {
                    "en": "if a person on the phone is put on hold, they have to wait until the person they want to talk to becomes free or has found out the information that is needed",
                    "vi": "nếu một người đang gọi điện thoại, họ phải đợi cho đến khi người mà họ muốn trò chuyện trở nên rảnh rỗi hoặc đã tìm ra thông tin cần thiết"
                },
                "examples": [
                    {
                        "en": "(British English) I’ll just pop you on hold.",
                        "vi": "(Anh Anh) Tôi sẽ chỉ cho bạn biết."
                    }
                ]
            },
            {
                "define": {
                    "en": "to begin to have complete control over somebody/something; to become very strong",
                    "vi": "để bắt đầu có toàn quyền kiểm soát ai đó / cái gì đó; trở nên rất mạnh mẽ"
                },
                "examples": [
                    {
                        "en": "Panic took hold of him and he couldn't move.",
                        "vi": "Sự hoảng loạn nắm lấy anh và anh không thể di chuyển."
                    },
                    {
                        "en": "They got out of the house just before the flames took hold.",
                        "vi": "Họ ra khỏi nhà ngay trước khi ngọn lửa bùng lên."
                    },
                    {
                        "en": "It is best to treat the disease early before it takes a hold.",
                        "vi": "Tốt nhất bạn nên điều trị bệnh sớm trước khi khỏi bệnh."
                    }
                ]
            }
        ]
    },
    {
        "id": "c9b59ee151404f6488f59a191dfda9a8",
        "word": "mast",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/mɑːst/",
            "us": "/mæst/"
        },
        "nearby": [
            {
                "word": "mass production",
                "pos": "noun"
            },
            {
                "word": "mass transit",
                "pos": "noun"
            },
            {
                "word": "mast",
                "pos": "noun"
            },
            {
                "word": "mastectomy",
                "pos": "noun"
            },
            {
                "word": "master",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a tall pole on a boat or ship that supports the sails",
                    "vi": "một chiếc cột cao trên thuyền hoặc tàu để hỗ trợ các cánh buồm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a tall metal tower with an aerial that sends and receives radio, television or phone signals",
                    "vi": "một tháp kim loại cao có thiết bị bay gửi và nhận tín hiệu radio, truyền hình hoặc điện thoại"
                },
                "examples": [
                    {
                        "en": "people who worry about the health risks of mobile phone masts",
                        "vi": "những người lo lắng về nguy cơ sức khỏe của cột điện thoại di động"
                    }
                ]
            },
            {
                "define": {
                    "en": "a tall pole that is used for holding a flag",
                    "vi": "một cây cột cao được sử dụng để giữ một lá cờ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to say publicly and clearly what you believe or who you support",
                    "vi": "nói một cách công khai và rõ ràng những gì bạn tin tưởng hoặc những người bạn ủng hộ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "7637472ee2ff42c5bf1534b517311d02",
        "word": "paddle",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈpædl/",
            "us": "/ˈpædl/"
        },
        "nearby": [
            {
                "word": "Paddington",
                "pos": ""
            },
            {
                "word": "Paddington Bear",
                "pos": ""
            },
            {
                "word": "paddle",
                "pos": "noun"
            },
            {
                "word": "paddle",
                "pos": "verb"
            },
            {
                "word": "paddleboard",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a short pole with a flat wide part at one or both ends, that you hold in both hands and use for moving a small boat, especially a canoe, through water",
                    "vi": "một cây sào ngắn với phần rộng bằng phẳng ở một hoặc cả hai đầu, bạn cầm bằng cả hai tay và dùng để di chuyển một chiếc thuyền nhỏ, đặc biệt là một chiếc ca nô, trên mặt nước"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a tool or part of a machine that is like a paddle in shape, especially one used for mixing food",
                    "vi": "một công cụ hoặc một bộ phận của máy có hình dạng giống như cánh khuấy, đặc biệt là loại được sử dụng để trộn thực phẩm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "an act or period of walking in shallow water with no shoes or socks",
                    "vi": "một hành động hoặc khoảng thời gian đi bộ ở vùng nước nông mà không mang giày hoặc tất"
                },
                "examples": [
                    {
                        "en": "Let's go for a paddle.",
                        "vi": "Hãy chèo thuyền đi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a bat used for playing table tennis",
                    "vi": "một cây gậy dùng để chơi bóng bàn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a piece of wood with a handle, used in the past for hitting children as a punishment",
                    "vi": "một khúc gỗ có cán, ngày xưa dùng để đánh trẻ em như một hình phạt"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "in a difficult or bad situation",
                    "vi": "trong một tình huống khó khăn hoặc tồi tệ"
                },
                "examples": [
                    {
                        "en": "If they won't accept my credit card, I'll really be up the creek.",
                        "vi": "Nếu họ không chấp nhận thẻ tín dụng của tôi, tôi thực sự sẽ rất khó khăn."
                    }
                ]
            }
        ]
    },
    {
        "id": "64db4de10e9949caae2ad7ab4009becd",
        "word": "radar",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈreɪdɑː(r)/",
            "us": "/ˈreɪdɑːr/"
        },
        "nearby": [
            {
                "word": "rad",
                "pos": "noun"
            },
            {
                "word": "RADA",
                "pos": ""
            },
            {
                "word": "radar",
                "pos": "noun"
            },
            {
                "word": "radar trap",
                "pos": "noun"
            },
            {
                "word": "raddled",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a system that uses radio waves to find the position and movement of objects, for example planes and ships, when they cannot be seen",
                    "vi": "một hệ thống sử dụng sóng vô tuyến để tìm vị trí và chuyển động của các vật thể, ví dụ như máy bay và tàu, khi không thể nhìn thấy chúng"
                },
                "examples": [
                    {
                        "en": "They located the ship by radar.",
                        "vi": "Họ định vị con tàu bằng radar."
                    },
                    {
                        "en": "a radar screen",
                        "vi": "một màn hình radar"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that people are not aware of something",
                    "vi": "được sử dụng để nói rằng mọi người không nhận thức được một cái gì đó"
                },
                "examples": [
                    {
                        "en": "Experts say a lot of corporate crime stays under the radar.",
                        "vi": "Các chuyên gia cho biết rất nhiều tội phạm doanh nghiệp vẫn nằm trong tầm ngắm."
                    },
                    {
                        "en": "The conflict has slipped below the radar of the mass media.",
                        "vi": "Cuộc xung đột đã tuột xuống dưới tầm ngắm của các phương tiện thông tin đại chúng."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that people’s attention is on or not on something",
                    "vi": "được sử dụng để nói rằng sự chú ý của mọi người đang tập trung vào hoặc không vào một cái gì đó"
                },
                "examples": [
                    {
                        "en": "The issue of terrorism is back on the radar screen.",
                        "vi": "Vấn đề khủng bố đã trở lại trên màn hình radar."
                    },
                    {
                        "en": "Since the scandal broke, all other issues seem to have disappeared off the radar screen as far as the media is concerned.",
                        "vi": "Kể từ khi vụ bê bối nổ ra, tất cả các vấn đề khác dường như đã biến mất khỏi màn hình radar theo như phương tiện truyền thông quan tâm."
                    }
                ]
            }
        ]
    },
    {
        "id": "407d4ffaad594737bd8e93ca9a18d59b",
        "word": "abaft",
        "pos": "adverb",
        "level": "c2",
        "phonetic": {
            "uk": "/əˈbɑːft/",
            "us": "/əˈbæft/"
        },
        "nearby": [
            {
                "word": "aback",
                "pos": "adverb"
            },
            {
                "word": "abacus",
                "pos": "noun"
            },
            {
                "word": "abaft",
                "pos": "adverb"
            },
            {
                "word": "abalone",
                "pos": "noun"
            },
            {
                "word": "abandon",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "in or behind the stern (= back end) of a ship",
                    "vi": "trong hoặc sau đuôi tàu (= đầu sau) của một con tàu"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "8109529214f842bbad6f73814ceadff3",
        "word": "aft",
        "pos": "adverb",
        "level": "c2",
        "phonetic": {
            "uk": "/ɑːft/",
            "us": "/æft/"
        },
        "nearby": [
            {
                "word": "Afro-Caribbean",
                "pos": "adjective"
            },
            {
                "word": "Afrocentric",
                "pos": "adjective"
            },
            {
                "word": "aft",
                "pos": "adverb, adjective"
            },
            {
                "word": "after",
                "pos": "preposition"
            },
            {
                "word": "after",
                "pos": "conjunction"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "in, near or towards the back of a ship or an aircraft",
                    "vi": "ở, gần hoặc về phía sau của một con tàu hoặc một chiếc máy bay"
                },
                "examples": [
                    {
                        "en": "fore and aft of the cockpit",
                        "vi": "phía trước và phía sau buồng lái"
                    },
                    {
                        "en": "The ship was moored to the dock fore and aft.",
                        "vi": "Con tàu được thả vào bến phía trước và phía sau."
                    },
                    {
                        "en": "the aft cabin/deck",
                        "vi": "cabin / boong phía sau"
                    }
                ]
            }
        ]
    },
    {
        "id": "b8cb108db0ba48a0a13cb062c1ab7be1",
        "word": "aftermost",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɑːftəməʊst/",
            "us": "/ˈæftərməʊst/"
        },
        "nearby": [
            {
                "word": "aftermarket",
                "pos": "noun"
            },
            {
                "word": "aftermath",
                "pos": "noun"
            },
            {
                "word": "aftermost",
                "pos": "adjective"
            },
            {
                "word": "afternoon",
                "pos": "noun"
            },
            {
                "word": "afternoons",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "nearest to the stern of a ship or the tail of an aircraft",
                    "vi": "gần đuôi tàu hoặc đuôi máy bay nhất"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "0149d6762d074cafbc74cb52f94a3dbd",
        "word": "amidships",
        "pos": "adverb",
        "level": "c2",
        "phonetic": {
            "uk": "/əˈmɪdʃɪps/",
            "us": "/əˈmɪdʃɪps/"
        },
        "nearby": [
            {
                "word": "amicably",
                "pos": "adverb"
            },
            {
                "word": "amid",
                "pos": "preposition"
            },
            {
                "word": "amidships",
                "pos": "adverb"
            },
            {
                "word": "amigo",
                "pos": "noun"
            },
            {
                "word": "amino acid",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "in or near the middle part of a ship",
                    "vi": "trong hoặc gần phần giữa của một con tàu"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "8f046a7a31dc4941ba081d0a41070d30",
        "word": "astern",
        "pos": "adverb",
        "level": "c2",
        "phonetic": {
            "uk": "/əˈstɜːn/",
            "us": "/əˈstɜːrn/"
        },
        "nearby": [
            {
                "word": "asterisk",
                "pos": "verb"
            },
            {
                "word": "asterisk",
                "pos": "noun"
            },
            {
                "word": "astern",
                "pos": "adverb"
            },
            {
                "word": "asteroid",
                "pos": "noun"
            },
            {
                "word": "asthma",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "in, at or towards the back part of a ship or boat",
                    "vi": "ở, tại hoặc về phía sau của một con tàu hoặc thuyền"
                },
                "examples": [
                    {
                        "en": "with the wind and waves astern",
                        "vi": "với gió và sóng biển"
                    }
                ]
            },
            {
                "define": {
                    "en": "if a ship or boat is moving astern, it is moving backwards",
                    "vi": "nếu một con tàu hoặc thuyền đang di chuyển phía trước, nó đang di chuyển ngược lại"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "8b720c18d9e748b3a31d69a8f75008c4",
        "word": "ballast",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbæləst/",
            "us": "/ˈbæləst/"
        },
        "nearby": [
            {
                "word": "ball-and-socket joint",
                "pos": "noun"
            },
            {
                "word": "J G Ballard",
                "pos": ""
            },
            {
                "word": "ballast",
                "pos": "noun"
            },
            {
                "word": "ball bearing",
                "pos": "noun"
            },
            {
                "word": "ballboy",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "heavy material placed in a ship or hot-air balloon to make it heavier and keep it steady",
                    "vi": "vật liệu nặng được đặt trong một con tàu hoặc khinh khí cầu để làm cho nó nặng hơn và giữ cho nó ổn định"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a layer of stones that makes a strong base on which a road, railway, etc. can be built",
                    "vi": "một lớp đá tạo nên nền tảng vững chắc để có thể xây dựng đường bộ, đường sắt, v.v."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "1e125ad9ff214b93920cbe7d08fb4cdc",
        "word": "berth",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/bɜːθ/",
            "us": "/bɜːrθ/"
        },
        "nearby": [
            {
                "word": "berserk",
                "pos": "adjective"
            },
            {
                "word": "Bert",
                "pos": ""
            },
            {
                "word": "berth",
                "pos": "noun"
            },
            {
                "word": "berth",
                "pos": "verb"
            },
            {
                "word": "Bertram Mills",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a place to sleep on a ship or train, or in a caravan",
                    "vi": "một nơi để ngủ trên tàu hoặc xe lửa, hoặc trong một đoàn lữ hành"
                },
                "examples": [
                    {
                        "en": "a cabin with three berths",
                        "vi": "một cabin với ba bến"
                    }
                ]
            },
            {
                "define": {
                    "en": "a place where a ship or boat can stop and stay, usually in a harbour",
                    "vi": "một nơi mà một con tàu hoặc thuyền có thể dừng lại và ở lại, thường là trong một bến cảng"
                },
                "examples": [
                    {
                        "en": "a berth in dock",
                        "vi": "một bến trong bến"
                    },
                    {
                        "en": "Water and electricity are supplied at each berth.",
                        "vi": "Điện nước được cung cấp tại mỗi bến."
                    }
                ]
            },
            {
                "define": {
                    "en": "to not go too near somebody/something; to avoid somebody/something",
                    "vi": "không đi quá gần ai đó / cái gì đó; để tránh ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "He gave the dog a wide berth.",
                        "vi": "Anh đã cho con chó một bến đỗ rộng."
                    }
                ]
            }
        ]
    },
    {
        "id": "728e82a4f28748708c7221f08cf17eb6",
        "word": "bilge",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/bɪldʒ/",
            "us": "/bɪldʒ/"
        },
        "nearby": [
            {
                "word": "bile",
                "pos": "noun"
            },
            {
                "word": "bile duct",
                "pos": "noun"
            },
            {
                "word": "bilge",
                "pos": "noun"
            },
            {
                "word": "bilharzia",
                "pos": "noun"
            },
            {
                "word": "biliary",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the almost flat part of the bottom of a boat or a ship, inside or outside",
                    "vi": "phần gần như bằng phẳng của đáy thuyền hoặc tàu, bên trong hoặc bên ngoài"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "dirty water that collects in a ship’s bilge",
                    "vi": "nước bẩn tích tụ trong đáy tàu"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "978914ad57ff4ea1bf36c4e80e1fe0db",
        "word": "boiler room",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbɔɪlə ruːm/",
            "us": "/ˈbɔɪlər ruːm/"
        },
        "nearby": [
            {
                "word": "boilermaker",
                "pos": "noun"
            },
            {
                "word": "boilerplate",
                "pos": "noun"
            },
            {
                "word": "boiler room",
                "pos": "noun"
            },
            {
                "word": "boiler suit",
                "pos": "noun"
            },
            {
                "word": "boiling",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a room in a building or ship containing the boiler",
                    "vi": "một căn phòng trong một tòa nhà hoặc con tàu có chứa lò hơi"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a room or office used by people using phones to sell something, especially shares, in an aggressive or a dishonest way",
                    "vi": "một phòng hoặc văn phòng được sử dụng bởi những người sử dụng điện thoại để bán một cái gì đó, đặc biệt là cổ phiếu, một cách hung hăng hoặc không trung thực"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "e5c892cbe29140aea356fc3633ad7ae2",
        "word": "bollard",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbɒlɑːd/",
            "us": "/ˈbɑːlərd/"
        },
        "nearby": [
            {
                "word": "Bolivian",
                "pos": "noun, adjective"
            },
            {
                "word": "boll",
                "pos": "noun"
            },
            {
                "word": "bollard",
                "pos": "noun"
            },
            {
                "word": "bollocking",
                "pos": "noun"
            },
            {
                "word": "bollocks",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a short thick post that is used to stop vehicles from going on to a road or part of a road",
                    "vi": "một cột dày ngắn dùng để ngăn các phương tiện đi sang đường hoặc một phần của đường"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a short thick post on a ship, or on land close to water, to which a ship’s rope may be tied",
                    "vi": "một cột dày ngắn trên tàu, hoặc trên đất liền gần mặt nước, mà dây của tàu có thể được buộc vào"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "7268ac5809d846f5b7ddb3d3bb23f937",
        "word": "boom",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/buːm/",
            "us": "/buːm/"
        },
        "nearby": [
            {
                "word": "Boolean",
                "pos": "adjective"
            },
            {
                "word": "Boolean operator",
                "pos": "noun"
            },
            {
                "word": "boom",
                "pos": "noun"
            },
            {
                "word": "boom",
                "pos": "verb"
            },
            {
                "word": "boom box",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a sudden increase in trade and economic activity; a period of wealth and success",
                    "vi": "sự gia tăng đột biến trong thương mại và hoạt động kinh tế; một thời kỳ giàu có và thành công"
                },
                "examples": [
                    {
                        "en": "Living standards improved rapidly during the post-war boom.",
                        "vi": "Mức sống được cải thiện nhanh chóng trong thời kỳ bùng nổ sau chiến tranh."
                    },
                    {
                        "en": "boom in something a boom in car sales",
                        "vi": "bùng nổ cái gì đó bùng nổ doanh số bán xe hơi"
                    },
                    {
                        "en": "a boom year (for trade, exports, etc.)",
                        "vi": "một năm bùng nổ (đối với thương mại, xuất khẩu, v.v.)"
                    },
                    {
                        "en": "a property/housing boom",
                        "vi": "sự bùng nổ bất động sản / nhà ở"
                    }
                ]
            },
            {
                "define": {
                    "en": "a period when something such as a sport or a type of music suddenly becomes very popular and successful",
                    "vi": "thời kỳ mà một thứ gì đó chẳng hạn như một môn thể thao hoặc một loại âm nhạc đột nhiên trở nên rất phổ biến và thành công"
                },
                "examples": [
                    {
                        "en": "The only way to satisfy the golf boom was to build more courses.",
                        "vi": "Cách duy nhất để đáp ứng sự bùng nổ của môn golf là xây dựng nhiều sân hơn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a long pole that the bottom of a sail is attached to and that you move to change the position of the sail",
                    "vi": "một cái sào dài mà đáy của một cánh buồm được gắn vào và bạn di chuyển để thay đổi vị trí của cánh buồm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a loud deep sound",
                    "vi": "một âm thanh sâu lớn"
                },
                "examples": [
                    {
                        "en": "the distant boom of the guns",
                        "vi": "tiếng nổ xa của súng"
                    }
                ]
            },
            {
                "define": {
                    "en": "a floating barrier that is placed across a river or the entrance to a harbour to prevent ships or other objects from coming in or going out",
                    "vi": "một rào chắn nổi được đặt qua sông hoặc lối vào bến cảng để ngăn tàu hoặc các vật thể khác ra vào"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a long pole that carries a microphone or other equipment",
                    "vi": "một cột dài mang micrô hoặc thiết bị khác"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a situation in which a period of rapid economic growth is followed by one of sudden decline",
                    "vi": "một tình huống trong đó một giai đoạn tăng trưởng kinh tế nhanh chóng được theo sau bởi một sự suy giảm đột ngột"
                },
                "examples": [
                    {
                        "en": "High house prices encourage boom and bust and leave the economy vulnerable.",
                        "vi": "Giá nhà cao khuyến khích bùng nổ và phá sản và khiến nền kinh tế dễ bị tổn thương."
                    },
                    {
                        "en": "Amid the inevitable boom and bust cycle, families are facing pay cuts and job losses.",
                        "vi": "Giữa chu kỳ bùng nổ và phá sản không thể tránh khỏi, các gia đình đang phải đối mặt với việc cắt giảm lương và mất việc làm."
                    }
                ]
            }
        ]
    },
    {
        "id": "827f6d3a2f44412f9104f7e6ad260241",
        "word": "bow",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/baʊ/",
            "us": "/baʊ/"
        },
        "nearby": [
            {
                "word": "bovver boots",
                "pos": "noun"
            },
            {
                "word": "bow1",
                "pos": "verb"
            },
            {
                "word": "bow1",
                "pos": "noun"
            },
            {
                "word": "bow2",
                "pos": "noun"
            },
            {
                "word": "bow2",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act of bending your head or the upper part of your body forward in order to say hello or goodbye to somebody or to show respect",
                    "vi": "Hành động cúi đầu hoặc phần trên của cơ thể về phía trước để chào hoặc tạm biệt ai đó hoặc để thể hiện sự tôn trọng"
                },
                "examples": [
                    {
                        "en": "She gave a slight bow of her head in greeting.",
                        "vi": "Cô khẽ cúi đầu chào."
                    },
                    {
                        "en": "The messenger made a formal bow and left the room.",
                        "vi": "Sứ giả cúi đầu chính thức và rời khỏi phòng."
                    }
                ]
            },
            {
                "define": {
                    "en": "the front part of a boat or ship",
                    "vi": "phần trước của một chiếc thuyền hoặc tàu"
                },
                "examples": [
                    {
                        "en": "A huge whale crossed our bows.",
                        "vi": "Một con cá voi khổng lồ vượt qua cung của chúng tôi."
                    },
                    {
                        "en": "We left two men in the bow to receive the cargo.",
                        "vi": "Chúng tôi để lại hai người đàn ông ở mũi tàu để nhận hàng."
                    },
                    {
                        "en": "There's a small boat on the port bow.",
                        "vi": "Có một chiếc thuyền nhỏ ở mũi cảng."
                    }
                ]
            },
            {
                "define": {
                    "en": "something that you say or do as a warning to somebody about what might happen if they do not change, etc.",
                    "vi": "điều gì đó bạn nói hoặc làm như một lời cảnh báo cho ai đó về những gì có thể xảy ra nếu họ không thay đổi, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to bow to the audience as they are applauding you",
                    "vi": "cúi chào khán giả khi họ đang tán thưởng bạn"
                },
                "examples": [
                    {
                        "en": "She came back on stage to take another bow.",
                        "vi": "Cô ấy trở lại sân khấu để cúi đầu."
                    },
                    {
                        "en": "The song ended and Albert took a bow.",
                        "vi": "Bài hát kết thúc và Albert cúi đầu chào."
                    },
                    {
                        "en": "(figurative) The boss takes his final bow today.",
                        "vi": "(nghĩa bóng) Ông chủ sẽ cúi đầu cuối cùng vào ngày hôm nay."
                    },
                    {
                        "en": "(figurative) The team's chairman takes his final bow at this match.",
                        "vi": "(nghĩa bóng) Chủ tịch của đội cúi đầu cuối cùng ở trận đấu này."
                    }
                ]
            }
        ]
    },
    {
        "id": "a3bba41a25bc4ff089dee2bad94536bf",
        "word": "bowline",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbaʊlaɪn/",
            "us": "/ˈbaʊlaɪn/"
        },
        "nearby": [
            {
                "word": "bowler",
                "pos": "noun"
            },
            {
                "word": "bowl game",
                "pos": "noun"
            },
            {
                "word": "bowline1",
                "pos": "noun"
            },
            {
                "word": "bowline2",
                "pos": "noun"
            },
            {
                "word": "bowling",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a rope that attaches one side of a sail to the bow of a boat",
                    "vi": "một sợi dây buộc một bên buồm vào mũi thuyền"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "df357e6b76664a8bb2c90410fdb47c89",
        "word": "bowsprit",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbəʊsprɪt/",
            "us": "/ˈbəʊsprɪt/"
        },
        "nearby": [
            {
                "word": "bow out",
                "pos": "phrasal verb"
            },
            {
                "word": "bowser",
                "pos": "noun"
            },
            {
                "word": "bowsprit",
                "pos": "noun"
            },
            {
                "word": "Bow Street",
                "pos": ""
            },
            {
                "word": "Bow Street Runner",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a long piece of wood or metal that sticks forward at the front of a ship",
                    "vi": "một miếng gỗ hoặc kim loại dài nhô ra phía trước của một con tàu"
                },
                "examples": [
                    {
                        "en": "The bowsprit was made of oak.",
                        "vi": "Bowsprit được làm bằng gỗ sồi."
                    },
                    {
                        "en": "The ropes are attached to the bowsprit.",
                        "vi": "Các sợi dây được gắn vào bowsprit."
                    }
                ]
            }
        ]
    },
    {
        "id": "c04d9d660cda43978c1e6168cbd940aa",
        "word": "bridge",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/brɪdʒ/",
            "us": "/brɪdʒ/"
        },
        "nearby": [
            {
                "word": "bridesmaid",
                "pos": "noun"
            },
            {
                "word": "bridezilla",
                "pos": "noun"
            },
            {
                "word": "bridge",
                "pos": "noun"
            },
            {
                "word": "bridge",
                "pos": "verb"
            },
            {
                "word": "bridge-building",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a structure that is built over a road, railway, river, etc. so that people, vehicles, etc. can cross from one side to the other",
                    "vi": "một công trình được xây dựng trên đường bộ, đường sắt, sông, v.v. để người, phương tiện, v.v. có thể băng qua bên này sang bên kia"
                },
                "examples": [
                    {
                        "en": "We crossed the bridge over the River Windrush.",
                        "vi": "Chúng tôi băng qua cây cầu bắc qua sông Windrush."
                    },
                    {
                        "en": "The river was spanned by a railway bridge.",
                        "vi": "Con sông được bắc qua một cây cầu đường sắt."
                    },
                    {
                        "en": "The plan incudes a pedestrian bridge connecting the arena with the convention centre.",
                        "vi": "Kế hoạch bao gồm một cây cầu đi bộ nối đấu trường với trung tâm hội nghị."
                    },
                    {
                        "en": "I don't have time to walk across the bridge.",
                        "vi": "Tôi không có thời gian để đi bộ qua cầu."
                    }
                ]
            },
            {
                "define": {
                    "en": "a thing that provides a connection or contact between two different things",
                    "vi": "một thứ cung cấp kết nối hoặc liên hệ giữa hai thứ khác nhau"
                },
                "examples": [
                    {
                        "en": "The book serves as a bridge between ancient wisdom and modern science.",
                        "vi": "Cuốn sách như một cầu nối giữa trí tuệ cổ đại và khoa học hiện đại."
                    },
                    {
                        "en": "Cultural exchanges are a way of building bridges between countries.",
                        "vi": "Giao lưu văn hóa là một cách xây dựng cầu nối giữa các quốc gia."
                    }
                ]
            },
            {
                "define": {
                    "en": "the part of a ship where the captain and other officers stand when they are controlling the ship",
                    "vi": "phần tàu nơi thuyền trưởng và các sĩ quan khác đứng khi họ điều khiển tàu"
                },
                "examples": [
                    {
                        "en": "Who was on the bridge when the collision took place?",
                        "vi": "Ai đã ở trên cầu khi vụ va chạm xảy ra?"
                    }
                ]
            },
            {
                "define": {
                    "en": "a card game for two pairs of players who have to predict how many cards they will win. They score points if they succeed in winning that number of cards and lose points if they fail.",
                    "vi": "một trò chơi bài dành cho hai cặp người chơi phải dự đoán xem họ sẽ thắng bao nhiêu quân bài. Họ ghi điểm nếu thắng thành công số thẻ đó và mất điểm nếu thất bại."
                },
                "examples": [
                    {
                        "en": "I enjoy a game of bridge occasionally.",
                        "vi": "Tôi thỉnh thoảng thích chơi cầu."
                    }
                ]
            },
            {
                "define": {
                    "en": "the hard part at the top of the nose, between the eyes",
                    "vi": "phần cứng ở đầu mũi, giữa hai mắt"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the part of a pair of glasses that rests on your nose",
                    "vi": "phần của một cặp kính nằm trên mũi của bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a small piece of wood on a guitar, violin, etc. over which the strings are stretched",
                    "vi": "một miếng gỗ nhỏ trên cây đàn ghita, đàn vi-ô-lông, v.v. trên đó các dây đàn được kéo căng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a false tooth or false teeth, held permanently in place by being fastened to natural teeth on either side",
                    "vi": "một chiếc răng giả hoặc răng giả, được giữ cố định tại chỗ bằng cách được gắn chặt vào răng tự nhiên ở cả hai bên"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to encourage good relationships between two groups, countries, etc.",
                    "vi": "khuyến khích mối quan hệ tốt đẹp giữa hai nhóm, quốc gia, v.v."
                },
                "examples": [
                    {
                        "en": "The aim of the project was to build bridges between communities through joint events.",
                        "vi": "Mục đích của dự án là xây dựng cầu nối giữa các cộng đồng thông qua các sự kiện chung."
                    }
                ]
            },
            {
                "define": {
                    "en": "to do something that makes it impossible to return to the previous situation later",
                    "vi": "để làm điều gì đó khiến bạn không thể quay lại tình trạng trước đó sau này"
                },
                "examples": [
                    {
                        "en": "Think carefully before you resign—you don't want to burn your bridges.",
                        "vi": "Hãy suy nghĩ kỹ trước khi từ chức — bạn không muốn đốt cháy những cây cầu của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to worry about a problem when it actually happens and not before",
                    "vi": "lo lắng về một vấn đề khi nó thực sự xảy ra chứ không phải trước đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to say that something happened in the past and is now forgotten or no longer important",
                    "vi": "được sử dụng để nói rằng một cái gì đó đã xảy ra trong quá khứ và bây giờ đã bị lãng quên hoặc không còn quan trọng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "cc3578d8dd9142e388c56a2615967804",
        "word": "brig",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/brɪɡ/",
            "us": "/brɪɡ/"
        },
        "nearby": [
            {
                "word": "briefs",
                "pos": "noun"
            },
            {
                "word": "brier",
                "pos": "noun"
            },
            {
                "word": "brig",
                "pos": "noun"
            },
            {
                "word": "Brig.",
                "pos": "abbreviation"
            },
            {
                "word": "brigade",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a ship with two masts (= posts that support the sails) and square sails",
                    "vi": "một con tàu có hai cột buồm (= cột chống buồm) và buồm vuông"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a prison, especially one on a warship",
                    "vi": "một nhà tù, đặc biệt là một nhà tù trên tàu chiến"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "9e7a21c8da494d33976cbd3b6c2b276d",
        "word": "bulkhead",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbʌlkhed/",
            "us": "/ˈbʌlkhed/"
        },
        "nearby": [
            {
                "word": "bulk",
                "pos": "noun"
            },
            {
                "word": "bulk",
                "pos": "verb"
            },
            {
                "word": "bulkhead",
                "pos": "noun"
            },
            {
                "word": "bulk out",
                "pos": "phrasal verb"
            },
            {
                "word": "bulk up",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a wall that divides a ship or an aircraft into separate parts",
                    "vi": "một bức tường chia một con tàu hoặc một chiếc máy bay thành các phần riêng biệt"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "afbf17e7f183413aa54124da2120e2ae",
        "word": "bunk",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/bʌŋk/",
            "us": "/bʌŋk/"
        },
        "nearby": [
            {
                "word": "bung up",
                "pos": "phrasal verb"
            },
            {
                "word": "bunion",
                "pos": "noun"
            },
            {
                "word": "bunk",
                "pos": "noun"
            },
            {
                "word": "bunk",
                "pos": "verb"
            },
            {
                "word": "bunker",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a narrow bed that is fixed to a wall, especially on a ship or train",
                    "vi": "giường hẹp được cố định vào tường, đặc biệt là trên tàu hoặc xe lửa"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "one of two beds that are fixed together, one above the other, especially for children",
                    "vi": "một trong hai giường được cố định với nhau, giường này nằm trên giường kia, đặc biệt dành cho trẻ em"
                },
                "examples": [
                    {
                        "en": "I slept in the bottom bunk of a set of bunk beds.",
                        "vi": "Tôi ngủ ở tầng dưới cùng của một bộ giường tầng."
                    }
                ]
            },
            {
                "define": {
                    "en": "ideas, statements or beliefs that you think are silly or not true",
                    "vi": "ý tưởng, tuyên bố hoặc niềm tin mà bạn cho là ngớ ngẩn hoặc không đúng sự thật"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to run away from a place without telling anyone",
                    "vi": "chạy khỏi một nơi mà không nói với ai"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "07c41fd835d7410ba4b3021831cc8def",
        "word": "bunker",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbʌŋkə(r)/",
            "us": "/ˈbʌŋkər/"
        },
        "nearby": [
            {
                "word": "bunk",
                "pos": "noun"
            },
            {
                "word": "bunk",
                "pos": "verb"
            },
            {
                "word": "bunker",
                "pos": "noun"
            },
            {
                "word": "Archie Bunker",
                "pos": ""
            },
            {
                "word": "bunker",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a strongly built shelter for soldiers or guns, usually underground",
                    "vi": "nơi trú ẩn được xây dựng kiên cố cho binh lính hoặc súng ống, thường là dưới lòng đất"
                },
                "examples": [
                    {
                        "en": "a concrete/underground/secret bunker",
                        "vi": "một hầm bê tông / ngầm / bí mật"
                    }
                ]
            },
            {
                "define": {
                    "en": "a container for storing coal, especially on a ship or outside a house",
                    "vi": "một thùng chứa để chứa than, đặc biệt là trên tàu hoặc bên ngoài một ngôi nhà"
                },
                "examples": [
                    {
                        "en": "a coal bunker",
                        "vi": "một hầm than"
                    }
                ]
            },
            {
                "define": {
                    "en": "a small area filled with sand on a golf course",
                    "vi": "một khu vực nhỏ đầy cát trên sân gôn"
                },
                "examples": [
                    {
                        "en": "He hit his second shot into a bunker.",
                        "vi": "Anh ta bắn phát thứ hai vào một boongke."
                    },
                    {
                        "en": "She had a difficult job getting the ball out of the bunker.",
                        "vi": "Cô ấy gặp khó khăn trong việc đưa bóng ra khỏi boongke."
                    }
                ]
            }
        ]
    },
    {
        "id": "2afc194aa9eb446397fbff0e4ed958fe",
        "word": "capstan",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkæpstən/",
            "us": "/ˈkæpstən/"
        },
        "nearby": [
            {
                "word": "capsid",
                "pos": "noun"
            },
            {
                "word": "capsize",
                "pos": "verb"
            },
            {
                "word": "capstan",
                "pos": "noun"
            },
            {
                "word": "capstone",
                "pos": "noun"
            },
            {
                "word": "capsule",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a thick cylinder that winds up a rope, used for lifting heavy objects such as an anchor on a ship",
                    "vi": "một hình trụ dày dùng để cuốn một sợi dây thừng, được sử dụng để nâng các vật nặng như neo trên tàu"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "3f95e2d406d24401bc029ce84dca59e2",
        "word": "color",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkʌlə(r)/",
            "us": "/ˈkʌlər/"
        },
        "nearby": [
            {
                "word": "colony",
                "pos": "noun"
            },
            {
                "word": "colophon",
                "pos": "noun"
            },
            {
                "word": "color",
                "pos": "noun"
            },
            {
                "word": "color",
                "pos": "verb"
            },
            {
                "word": "Colorado",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the appearance that things have that results from the way in which they reflect light. Red, orange and green are colors.",
                    "vi": "vẻ ngoài mà mọi thứ có được là kết quả của cách mà chúng phản xạ ánh sáng. Màu đỏ, cam và xanh lá cây là các màu."
                },
                "examples": [
                    {
                        "en": "What's your favorite color?",
                        "vi": "Màu yêu thích của bạn là gì?"
                    },
                    {
                        "en": "bright/vibrant colors",
                        "vi": "màu sắc tươi sáng / rực rỡ"
                    },
                    {
                        "en": "dark/light colors",
                        "vi": "màu đậm / nhạt"
                    },
                    {
                        "en": "She always wears dark colors.",
                        "vi": "Cô ấy luôn mặc đồ tối màu."
                    },
                    {
                        "en": "vivid/rich/bold colors",
                        "vi": "màu sắc sống động / phong phú / đậm"
                    },
                    {
                        "en": "a warm color palette (= the range of colors used for something)",
                        "vi": "bảng màu ấm (= dải màu được sử dụng cho một thứ gì đó)"
                    },
                    {
                        "en": "available in 12 different colors",
                        "vi": "có sẵn 12 màu khác nhau"
                    },
                    {
                        "en": "the color of the sky",
                        "vi": "màu sắc của bầu trời"
                    },
                    {
                        "en": "skin/hair/eye color",
                        "vi": "màu da / tóc / mắt"
                    },
                    {
                        "en": "in color red/green/blue in color",
                        "vi": "màu đỏ / xanh lá cây / xanh lam"
                    },
                    {
                        "en": "Her hair is a reddish-brown color.",
                        "vi": "Tóc cô ấy có màu nâu đỏ."
                    },
                    {
                        "en": "The stage lights changed color from red to blue.",
                        "vi": "Đèn sân khấu đổi màu từ đỏ sang xanh."
                    },
                    {
                        "en": "Foods that go through a factory process lose much of their color, flavor and texture.",
                        "vi": "Thực phẩm trải qua quá trình chế biến tại nhà máy bị mất đi nhiều màu sắc, hương vị và kết cấu."
                    }
                ]
            },
            {
                "define": {
                    "en": "the use of all the colors, not only black and white",
                    "vi": "việc sử dụng tất cả các màu, không chỉ đen và trắng"
                },
                "examples": [
                    {
                        "en": "the introduction of color television in the 1960s",
                        "vi": "sự ra đời của tivi màu vào những năm 1960"
                    },
                    {
                        "en": "color photographs",
                        "vi": "ảnh màu"
                    },
                    {
                        "en": "a color printer",
                        "vi": "một máy in màu"
                    },
                    {
                        "en": "a full-color brochure",
                        "vi": "một tờ rơi đầy màu sắc"
                    },
                    {
                        "en": "in color Do you dream in color?",
                        "vi": "màu sắc Bạn có mơ thấy màu sắc không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "the color of a person’s skin, when it shows the race they belong to",
                    "vi": "màu da của một người, khi nó thể hiện chủng tộc mà họ thuộc về"
                },
                "examples": [
                    {
                        "en": "Discrimination on the grounds of race, religion or color was outlawed.",
                        "vi": "Phân biệt đối xử vì lý do chủng tộc, tôn giáo hoặc màu da đã bị cấm."
                    },
                    {
                        "en": "people of all ages, genders, creeds and colors",
                        "vi": "mọi người ở mọi lứa tuổi, giới tính, tín ngưỡng và màu sắc"
                    },
                    {
                        "en": "Can we seriously believe people who claim not to see color?",
                        "vi": "Chúng ta có thể nghiêm túc tin những người tuyên bố không nhìn thấy màu sắc không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "a red or pink color in somebody’s face, especially when it shows that they look healthy or that they are embarrassed",
                    "vi": "màu đỏ hoặc hồng trên khuôn mặt của ai đó, đặc biệt là khi điều đó cho thấy họ trông khỏe mạnh hoặc họ đang xấu hổ"
                },
                "examples": [
                    {
                        "en": "The fresh air brought color to their cheeks.",
                        "vi": "Không khí trong lành đã mang lại màu sắc cho đôi má của họ."
                    },
                    {
                        "en": "Color flooded her face when she thought of what had happened.",
                        "vi": "Màu sắc tràn ngập trên khuôn mặt cô khi cô nghĩ về những gì đã xảy ra."
                    },
                    {
                        "en": "His face was drained of color (= he looked pale and ill).",
                        "vi": "Mặt anh ta tái mét (= trông anh ta xanh xao và ốm yếu)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a substance that is used to give color to something",
                    "vi": "một chất được sử dụng để tạo màu cho một thứ gì đó"
                },
                "examples": [
                    {
                        "en": "a semi-permanent hair color that lasts six to eight washes",
                        "vi": "màu tóc bán vĩnh viễn kéo dài từ sáu đến tám lần gội"
                    },
                    {
                        "en": "This color runs, so wash the shirt separately.",
                        "vi": "Màu này chạy, nên giặt riêng áo."
                    }
                ]
            },
            {
                "define": {
                    "en": "interesting and exciting details or qualities",
                    "vi": "những chi tiết hoặc phẩm chất thú vị và hấp dẫn"
                },
                "examples": [
                    {
                        "en": "The old town is full of color and attractions.",
                        "vi": "Khu phố cổ đầy màu sắc và hấp dẫn."
                    },
                    {
                        "en": "to give/lend color to something (= make it brighter, more interesting, etc.)",
                        "vi": "để cung cấp / cho mượn màu sắc cho thứ gì đó (= làm cho nó sáng hơn, thú vị hơn, v.v.)"
                    },
                    {
                        "en": "Her acting added warmth and color to the production.",
                        "vi": "Diễn xuất của cô ấy đã tạo thêm sự ấm áp và màu sắc cho quá trình sản xuất."
                    }
                ]
            },
            {
                "define": {
                    "en": "the particular colors that are used on clothes, flags, etc. to represent a team, school, political party or country",
                    "vi": "các màu cụ thể được sử dụng trên quần áo, cờ, v.v. để đại diện cho một đội, trường học, đảng chính trị hoặc quốc gia"
                },
                "examples": [
                    {
                        "en": "Red and white are the team colors.",
                        "vi": "Màu đỏ và trắng là màu của đội."
                    },
                    {
                        "en": "Spain’s national colors",
                        "vi": "Màu quốc gia của Tây Ban Nha"
                    },
                    {
                        "en": "(figurative) There are people of different political colors on the committee.",
                        "vi": "(nghĩa bóng) Có những người mang màu sắc chính trị khác nhau trong ủy ban."
                    }
                ]
            },
            {
                "define": {
                    "en": "a flag, badge, etc. that represents a team, country, ship, etc.",
                    "vi": "cờ, huy hiệu, v.v. đại diện cho đội, quốc gia, tàu, v.v."
                },
                "examples": [
                    {
                        "en": "sailing under the French colors",
                        "vi": "chèo thuyền dưới màu sắc của Pháp"
                    }
                ]
            },
            {
                "define": {
                    "en": "to say publicly and clearly what you believe or who you support",
                    "vi": "nói một cách công khai và rõ ràng những gì bạn tin tưởng hoặc những người bạn ủng hộ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "who is not white",
                    "vi": "ai không da trắng"
                },
                "examples": [
                    {
                        "en": "people of color",
                        "vi": "người da màu"
                    },
                    {
                        "en": "As a woman of color, this concerns me.",
                        "vi": "Là một phụ nữ da màu, điều này khiến tôi quan tâm."
                    },
                    {
                        "en": "a literary prize for writers of color",
                        "vi": "một giải thưởng văn học cho các nhà văn da màu"
                    },
                    {
                        "en": "students of color",
                        "vi": "sinh viên da màu"
                    }
                ]
            },
            {
                "define": {
                    "en": "to make sure that somebody has enough money to pay for something",
                    "vi": "để đảm bảo rằng ai đó có đủ tiền để trả cho một thứ gì đó"
                },
                "examples": [
                    {
                        "en": "You need to see the color of his money before you sell him the car.",
                        "vi": "Bạn cần phải xem màu tiền của anh ta trước khi bạn bán xe cho anh ta."
                    }
                ]
            },
            {
                "define": {
                    "en": "your real character, rather than the one that you usually allow other people to see",
                    "vi": "nhân vật thực của bạn, thay vì nhân vật mà bạn thường cho phép người khác nhìn thấy"
                },
                "examples": [
                    {
                        "en": "It was only after they got married that he showed himself in his true colors.",
                        "vi": "Chỉ sau khi họ kết hôn, anh ấy mới thể hiện bản thân mình trong màu sắc thực sự của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "very well; with a very high mark",
                    "vi": "rất tốt; với một điểm rất cao"
                },
                "examples": [
                    {
                        "en": "She passed the exam with flying colors.",
                        "vi": "Cô ấy đã vượt qua kỳ thi với màu sắc bay bổng."
                    }
                ]
            }
        ]
    },
    {
        "id": "ec9c709af38a4b8d9359b927afba5633",
        "word": "colour",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkʌlə(r)/",
            "us": "/ˈkʌlər/"
        },
        "nearby": [
            {
                "word": "colostomy",
                "pos": "noun"
            },
            {
                "word": "colostrum",
                "pos": "noun"
            },
            {
                "word": "colour",
                "pos": "noun"
            },
            {
                "word": "colour",
                "pos": "verb"
            },
            {
                "word": "colourant",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the appearance that things have that results from the way in which they reflect light. Red, orange and green are colours.",
                    "vi": "vẻ ngoài mà mọi thứ có được là kết quả của cách mà chúng phản xạ ánh sáng. Màu đỏ, cam và xanh lá cây là các màu."
                },
                "examples": [
                    {
                        "en": "What's your favourite colour?",
                        "vi": "Bạn thích màu nào?"
                    },
                    {
                        "en": "bright/vibrant/bold colours",
                        "vi": "màu sắc tươi sáng / rực rỡ / đậm"
                    },
                    {
                        "en": "She always wears dark colours.",
                        "vi": "Cô ấy luôn mặc đồ tối màu."
                    },
                    {
                        "en": "I'd like to paint this room in a lighter colour.",
                        "vi": "Tôi muốn sơn căn phòng này bằng màu sáng hơn."
                    },
                    {
                        "en": "a warm colour palette (= the range of colours used for something)",
                        "vi": "bảng màu ấm (= dải màu được sử dụng cho một thứ gì đó)"
                    },
                    {
                        "en": "available in 12 different colours",
                        "vi": "có sẵn 12 màu khác nhau"
                    },
                    {
                        "en": "the colour of the sky",
                        "vi": "màu sắc của bầu trời"
                    },
                    {
                        "en": "skin/hair colour",
                        "vi": "màu da / tóc"
                    },
                    {
                        "en": "in colour red/green/blue, etc. in colour",
                        "vi": "màu đỏ / xanh lá cây / xanh lam, v.v. trong màu"
                    },
                    {
                        "en": "Her hair is a reddish-brown colour.",
                        "vi": "Tóc cô ấy có màu nâu đỏ."
                    },
                    {
                        "en": "The stage lights changed colour from red to blue.",
                        "vi": "Đèn sân khấu đổi màu từ đỏ sang xanh."
                    },
                    {
                        "en": "Foods which go through a factory process lose much of their colour, flavour and texture.",
                        "vi": "Thực phẩm trải qua quá trình chế biến tại nhà máy sẽ mất đi nhiều màu sắc, hương vị và kết cấu."
                    }
                ]
            },
            {
                "define": {
                    "en": "the use of all the colours, not only black and white",
                    "vi": "việc sử dụng tất cả các màu, không chỉ đen và trắng"
                },
                "examples": [
                    {
                        "en": "the introduction of colour television in the UK in 1967",
                        "vi": "sự ra đời của tivi màu ở Anh vào năm 1967"
                    },
                    {
                        "en": "colour photographs",
                        "vi": "ảnh màu"
                    },
                    {
                        "en": "a colour printer",
                        "vi": "một máy in màu"
                    },
                    {
                        "en": "a full-colour brochure",
                        "vi": "một tờ rơi đầy màu sắc"
                    },
                    {
                        "en": "in colour Do you dream in colour?",
                        "vi": "màu sắc Bạn có mơ thấy màu sắc không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "the colour of a person’s skin, when it shows the group of people they belong to",
                    "vi": "màu da của một người, khi nó thể hiện nhóm người mà họ thuộc về"
                },
                "examples": [
                    {
                        "en": "Discrimination on the grounds of race, religion or colour was outlawed.",
                        "vi": "Phân biệt đối xử vì lý do chủng tộc, tôn giáo hoặc màu da đã bị cấm."
                    },
                    {
                        "en": "people of all ages, genders, creeds and colours",
                        "vi": "mọi người ở mọi lứa tuổi, giới tính, tín ngưỡng và màu sắc"
                    },
                    {
                        "en": "to discriminate on the basis of colour",
                        "vi": "để phân biệt dựa trên màu sắc"
                    },
                    {
                        "en": "Can we seriously believe people who claim not to see colour?",
                        "vi": "Chúng ta có thể nghiêm túc tin những người tuyên bố không nhìn thấy màu sắc không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "a red or pink colour in somebody’s face, especially when it shows that they look healthy or that they are embarrassed",
                    "vi": "màu đỏ hoặc hồng trên khuôn mặt của ai đó, đặc biệt là khi điều đó cho thấy họ trông khỏe mạnh hoặc họ đang xấu hổ"
                },
                "examples": [
                    {
                        "en": "The fresh air brought colour to their cheeks.",
                        "vi": "Không khí trong lành đã mang lại màu sắc cho đôi má của họ."
                    },
                    {
                        "en": "Colour flooded her face when she thought of what had happened.",
                        "vi": "Màu sắc tràn ngập trên khuôn mặt cô khi cô nghĩ về những gì đã xảy ra."
                    },
                    {
                        "en": "His face was drained of colour (= he looked pale and ill).",
                        "vi": "Mặt anh ta tái mét (= trông anh ta xanh xao và ốm yếu)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a substance that is used to give colour to something",
                    "vi": "một chất được sử dụng để tạo màu cho một thứ gì đó"
                },
                "examples": [
                    {
                        "en": "a semi-permanent hair colour that lasts six to eight washes",
                        "vi": "màu tóc bán vĩnh viễn kéo dài từ sáu đến tám lần gội"
                    },
                    {
                        "en": "This colour runs, so wash the shirt separately.",
                        "vi": "Màu này chạy, nên giặt riêng áo."
                    }
                ]
            },
            {
                "define": {
                    "en": "interesting and exciting details or qualities",
                    "vi": "những chi tiết hoặc phẩm chất thú vị và hấp dẫn"
                },
                "examples": [
                    {
                        "en": "The old town is full of colour and attractions.",
                        "vi": "Khu phố cổ đầy màu sắc và hấp dẫn."
                    },
                    {
                        "en": "Her acting added warmth and colour to the production.",
                        "vi": "Diễn xuất của cô ấy đã tạo thêm sự ấm áp và màu sắc cho quá trình sản xuất."
                    },
                    {
                        "en": "to add/give/lend colour to something (= make it brighter, more interesting, etc.)",
                        "vi": "để thêm / cho / cho mượn màu sắc cho thứ gì đó (= làm cho nó sáng hơn, thú vị hơn, v.v.)"
                    }
                ]
            },
            {
                "define": {
                    "en": "the particular colours that are used on clothes, flags, etc. to represent a team, school, political party or country",
                    "vi": "các màu cụ thể được sử dụng trên quần áo, cờ, v.v. để đại diện cho một đội, trường học, đảng chính trị hoặc quốc gia"
                },
                "examples": [
                    {
                        "en": "Red and white are the team colours.",
                        "vi": "Màu đỏ và trắng là màu của đội."
                    },
                    {
                        "en": "Spain’s national colours",
                        "vi": "Màu quốc gia của Tây Ban Nha"
                    },
                    {
                        "en": "(figurative) There are people of different political colours on the committee.",
                        "vi": "(nghĩa bóng) Có những người mang màu sắc chính trị khác nhau trong ủy ban."
                    }
                ]
            },
            {
                "define": {
                    "en": "a flag, badge, etc. that represents a team, country, ship, etc.",
                    "vi": "cờ, huy hiệu, v.v. đại diện cho đội, quốc gia, tàu, v.v."
                },
                "examples": [
                    {
                        "en": "Most buildings had a flagpole with the national colours flying.",
                        "vi": "Hầu hết các tòa nhà đều có cột cờ với màu cờ sắc áo tung bay."
                    },
                    {
                        "en": "sailing under the French colours",
                        "vi": "chèo thuyền dưới màu sắc của Pháp"
                    }
                ]
            },
            {
                "define": {
                    "en": "to make something seem true or likely",
                    "vi": "để làm cho một cái gì đó có vẻ đúng hoặc có khả năng"
                },
                "examples": [
                    {
                        "en": "Most of the available evidence lends colour to this view.",
                        "vi": "Hầu hết các bằng chứng có sẵn đều cho thấy quan điểm này có màu sắc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to say publicly and clearly what you believe or who you support",
                    "vi": "nói một cách công khai và rõ ràng những gì bạn tin tưởng hoặc những người bạn ủng hộ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "who is not white",
                    "vi": "ai không da trắng"
                },
                "examples": [
                    {
                        "en": "people of colour",
                        "vi": "người da màu"
                    },
                    {
                        "en": "As a woman of colour, this concerns me.",
                        "vi": "Là một phụ nữ da màu, điều này khiến tôi quan tâm."
                    },
                    {
                        "en": "a literary prize for writers of colour",
                        "vi": "một giải thưởng văn học cho các nhà văn da màu"
                    },
                    {
                        "en": "students of colour",
                        "vi": "sinh viên da màu"
                    }
                ]
            },
            {
                "define": {
                    "en": "to make sure that somebody has enough money to pay for something",
                    "vi": "để đảm bảo rằng ai đó có đủ tiền để trả cho một thứ gì đó"
                },
                "examples": [
                    {
                        "en": "You need to see the colour of his money before you sell him the car.",
                        "vi": "Bạn cần phải xem màu tiền của anh ta trước khi bạn bán xe cho anh ta."
                    }
                ]
            },
            {
                "define": {
                    "en": "your real character, rather than the one that you usually allow other people to see",
                    "vi": "nhân vật thực của bạn, thay vì nhân vật mà bạn thường cho phép người khác nhìn thấy"
                },
                "examples": [
                    {
                        "en": "It was only after they got married that he showed himself in his true colours.",
                        "vi": "Chỉ sau khi họ kết hôn, anh ấy mới thể hiện bản thân mình trong màu sắc thực sự của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "very well; with a very high mark",
                    "vi": "rất tốt; với một điểm rất cao"
                },
                "examples": [
                    {
                        "en": "She passed the exam with flying colours.",
                        "vi": "Cô ấy đã vượt qua kỳ thi với màu sắc bay bổng."
                    }
                ]
            }
        ]
    },
    {
        "id": "0372de67ae274807afdff94dadf2cdd0",
        "word": "companionway",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/kəmˈpænjənweɪ/",
            "us": "/kəmˈpænjənweɪ/"
        },
        "nearby": [
            {
                "word": "Companion of Honour",
                "pos": "noun"
            },
            {
                "word": "companionship",
                "pos": "noun"
            },
            {
                "word": "companionway",
                "pos": "noun"
            },
            {
                "word": "company",
                "pos": "noun"
            },
            {
                "word": "the Company",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a set of stairs on a ship",
                    "vi": "một bộ cầu thang trên tàu"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "8fc61aa678d6491f832253e6081a70cc",
        "word": "crow’s nest",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkrəʊz nest/",
            "us": "/ˈkrəʊz nest/"
        },
        "nearby": [
            {
                "word": "Crown prosecutor",
                "pos": "noun"
            },
            {
                "word": "crow's feet",
                "pos": "noun"
            },
            {
                "word": "crow's nest",
                "pos": "noun"
            },
            {
                "word": "crozier",
                "pos": "noun"
            },
            {
                "word": "cru",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a platform at the top of a ship’s mast (= the post that supports the sails) from which somebody can see a long way and watch for land, danger, etc.",
                    "vi": "một bệ trên đỉnh cột buồm của con tàu (= cột chống buồm) từ đó ai đó có thể nhìn thấy một chặng đường dài và quan sát đất liền, nguy hiểm, v.v."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "e46577415b0345899197f7a7e8670488",
        "word": "deckhouse",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈdekhaʊs/",
            "us": "/ˈdekhaʊs/"
        },
        "nearby": [
            {
                "word": "deckchair",
                "pos": "noun"
            },
            {
                "word": "deckhand",
                "pos": "noun"
            },
            {
                "word": "deckhouse",
                "pos": "noun"
            },
            {
                "word": "decking",
                "pos": "noun"
            },
            {
                "word": "deck quoits",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small shelter on the deck of a ship, used for navigation or accommodation",
                    "vi": "một nơi trú ẩn nhỏ trên boong tàu, dùng để điều hướng hoặc làm chỗ ở"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "fb219fe2b13e45fa938baad99ce2e391",
        "word": "derrick",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈderɪk/",
            "us": "/ˈderɪk/"
        },
        "nearby": [
            {
                "word": "derogation",
                "pos": "noun"
            },
            {
                "word": "derogatory",
                "pos": "adjective"
            },
            {
                "word": "derrick",
                "pos": "noun"
            },
            {
                "word": "derring-do",
                "pos": "noun"
            },
            {
                "word": "derringer",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a tall machine used for moving or lifting heavy weights, especially on a ship; a type of crane",
                    "vi": "một máy cao được sử dụng để di chuyển hoặc nâng vật nặng, đặc biệt là trên tàu; một loại cần trục"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a tall structure over an oil well for holding the drill (= the machine that makes the hole in the ground for getting the oil out)",
                    "vi": "một cấu trúc cao trên giếng dầu để giữ máy khoan (= máy tạo lỗ trên mặt đất để lấy dầu ra)"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "d462d4b7fc38406f9f6b65e09763b714",
        "word": "ensign",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈensən/",
            "us": "/ˈensən/"
        },
        "nearby": [
            {
                "word": "enshrine",
                "pos": "verb"
            },
            {
                "word": "enshroud",
                "pos": "verb"
            },
            {
                "word": "ensign",
                "pos": "noun"
            },
            {
                "word": "enslave",
                "pos": "verb"
            },
            {
                "word": "enslavement",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a flag flown on a ship to show which country it belongs to",
                    "vi": "một lá cờ bay trên một con tàu để cho biết nó thuộc về quốc gia nào"
                },
                "examples": [
                    {
                        "en": "the White Ensign (= the flag of the British Navy)",
                        "vi": "the White Ensign (= lá cờ của Hải quân Anh)"
                    }
                ]
            },
            {
                "define": {
                    "en": "an officer of low rank in the US navy",
                    "vi": "một sĩ quan cấp thấp trong hải quân Hoa Kỳ"
                },
                "examples": [
                    {
                        "en": "Ensign Marshall",
                        "vi": "Ensign Marshall"
                    }
                ]
            }
        ]
    },
    {
        "id": "6e3c4c293a8e42c29c1e1a4b62deb274",
        "word": "figurehead",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈfɪɡəhed/",
            "us": "/ˈfɪɡjərhed/"
        },
        "nearby": [
            {
                "word": "figured",
                "pos": "adjective"
            },
            {
                "word": "figured bass",
                "pos": "noun"
            },
            {
                "word": "figurehead",
                "pos": "noun"
            },
            {
                "word": "figure-hugging",
                "pos": "adjective"
            },
            {
                "word": "figure of eight",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who is in a high position in a country or an organization but who has no real power or authority",
                    "vi": "một người ở vị trí cao trong một quốc gia hoặc một tổ chức nhưng không có thực quyền hoặc quyền hạn"
                },
                "examples": [
                    {
                        "en": "The president of the club is not just a figurehead.",
                        "vi": "Chủ tịch của câu lạc bộ không chỉ là một bù nhìn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a large wooden statue, usually representing a woman, that used to be fixed to the front end of a ship",
                    "vi": "một bức tượng lớn bằng gỗ, thường tượng trưng cho một người phụ nữ, từng được cố định vào đầu trước của một con tàu"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "16fdf59e93794fb2bd6d52d2535f274d",
        "word": "flight deck",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈflaɪt dek/",
            "us": "/ˈflaɪt dek/"
        },
        "nearby": [
            {
                "word": "flight attendant",
                "pos": "noun"
            },
            {
                "word": "flight crew",
                "pos": "noun"
            },
            {
                "word": "flight deck",
                "pos": "noun"
            },
            {
                "word": "flight jacket",
                "pos": "noun"
            },
            {
                "word": "flightless",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an area at the front of a large plane where the pilot sits to use the controls and fly the plane",
                    "vi": "một khu vực phía trước máy bay lớn nơi phi công ngồi để sử dụng các điều khiển và lái máy bay"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a long flat surface on top of a ship that carries aircraft (= an aircraft carrier) where they take off and land",
                    "vi": "một bề mặt phẳng dài trên đầu tàu chở máy bay (= tàu sân bay) nơi chúng cất cánh và hạ cánh"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "601bee1ce38040b78816b4f3721a8567",
        "word": "fo’c’sle",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈfəʊksl/",
            "us": "/ˈfəʊksl/"
        },
        "nearby": [
            {
                "word": "focal length",
                "pos": "noun"
            },
            {
                "word": "focal point",
                "pos": "noun"
            },
            {
                "word": "fo'c'sle",
                "pos": "noun"
            },
            {
                "word": "focus",
                "pos": "verb"
            },
            {
                "word": "focus",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the front part of a ship below the deck, where the sailors live",
                    "vi": "phần trước của một con tàu bên dưới boong, nơi các thủy thủ sống"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "54c89b722ce4442ab071724bafc66904",
        "word": "fore",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/fɔː(r)/",
            "us": "/fɔːr/"
        },
        "nearby": [
            {
                "word": "the Ford Motor Company",
                "pos": ""
            },
            {
                "word": "fore",
                "pos": "noun"
            },
            {
                "word": "fore",
                "pos": "adjective"
            },
            {
                "word": "fore",
                "pos": "adverb"
            },
            {
                "word": "fore-",
                "pos": "combining form"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "located at the front of a ship, an aircraft or an animal",
                    "vi": "nằm ở phía trước của một con tàu, một chiếc máy bay hoặc một con vật"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "ac109781b50d4935b49a6dacbbaae8d6",
        "word": "forecastle",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈfəʊksl/",
            "us": "/ˈfəʊksl/"
        },
        "nearby": [
            {
                "word": "forecast",
                "pos": "verb"
            },
            {
                "word": "forecaster",
                "pos": "noun"
            },
            {
                "word": "forecastle",
                "pos": "noun"
            },
            {
                "word": "foreclose",
                "pos": "verb"
            },
            {
                "word": "foreclosure",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the front part of a ship below the deck, where the sailors live",
                    "vi": "phần trước của một con tàu bên dưới boong, nơi các thủy thủ sống"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c65903930e86409ebf88945e0444b616",
        "word": "foresail",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈfɔːseɪl/",
            "us": "/ˈfɔːrseɪl/"
        },
        "nearby": [
            {
                "word": "forerib",
                "pos": "noun"
            },
            {
                "word": "forerunner",
                "pos": "noun"
            },
            {
                "word": "foresail",
                "pos": "noun"
            },
            {
                "word": "foresee",
                "pos": "verb"
            },
            {
                "word": "foreseeable",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the main sail on the mast of a ship that is nearest the front (called the foremast  /ˈfɔːmɑːst/  /ˈfɔːrmæst/)",
                    "vi": "cánh buồm chính trên cột buồm của một con tàu gần phía trước (được gọi là mũi tàu / ˈfɔːmɑːst / / ˈfɔːrmæst /)"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "48c1caa5aed74b92bb25a237353b17bf",
        "word": "funnel",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈfʌnl/",
            "us": "/ˈfʌnl/"
        },
        "nearby": [
            {
                "word": "funky",
                "pos": "adjective"
            },
            {
                "word": "fun-loving",
                "pos": "adjective"
            },
            {
                "word": "funnel",
                "pos": "noun"
            },
            {
                "word": "funnel",
                "pos": "verb"
            },
            {
                "word": "the funnies",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a device that is wide at the top and narrow at the bottom, used for pouring liquids or powders into a small opening",
                    "vi": "một thiết bị rộng ở phía trên và hẹp ở phía dưới, được sử dụng để rót chất lỏng hoặc bột vào một lỗ nhỏ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a metal chimney, for example on a ship or an engine, through which smoke comes out",
                    "vi": "một ống khói kim loại, ví dụ như trên một con tàu hoặc một động cơ, qua đó khói bay ra"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c4fdd2c82abe46e3be3753ac7d2c0686",
        "word": "galley",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɡæli/",
            "us": "/ˈɡæli/"
        },
        "nearby": [
            {
                "word": "galleried",
                "pos": "adjective"
            },
            {
                "word": "gallery",
                "pos": "noun"
            },
            {
                "word": "galley",
                "pos": "noun"
            },
            {
                "word": "galliard",
                "pos": "noun"
            },
            {
                "word": "Gallic",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a long flat ship with sails, especially one used by the ancient Greeks or Romans in war, usually rowed by slaves or prisoners",
                    "vi": "một con tàu phẳng dài có buồm, đặc biệt là con tàu được người Hy Lạp hoặc La Mã cổ đại sử dụng trong chiến tranh, thường được chèo bởi nô lệ hoặc tù nhân"
                },
                "examples": [
                    {
                        "en": "a galley slave",
                        "vi": "một nô lệ galley"
                    }
                ]
            },
            {
                "define": {
                    "en": "the kitchen on a ship or plane",
                    "vi": "nhà bếp trên tàu hoặc máy bay"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "ed297258473a42c48b1183dde9c1e898",
        "word": "gangplank",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɡæŋplæŋk/",
            "us": "/ˈɡæŋplæŋk/"
        },
        "nearby": [
            {
                "word": "ganglion",
                "pos": "noun"
            },
            {
                "word": "gangmaster",
                "pos": "noun"
            },
            {
                "word": "gangplank",
                "pos": "noun"
            },
            {
                "word": "gang rape",
                "pos": "noun"
            },
            {
                "word": "gang-rape",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a board placed between the side of a boat and land so people can get on and off",
                    "vi": "một tấm ván đặt giữa mạn thuyền và đất liền để mọi người có thể lên và xuống"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "1db0af7769074755925f7169a1b74855",
        "word": "gangway",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɡæŋweɪ/",
            "us": "/ˈɡæŋweɪ/"
        },
        "nearby": [
            {
                "word": "gang together",
                "pos": "phrasal verb"
            },
            {
                "word": "gang up",
                "pos": "phrasal verb"
            },
            {
                "word": "gangway",
                "pos": "noun"
            },
            {
                "word": "ganja",
                "pos": "noun"
            },
            {
                "word": "gannet",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a passage between rows of seats in a theatre, an aircraft, etc.",
                    "vi": "lối đi giữa các hàng ghế trong rạp hát, máy bay, v.v."
                },
                "examples": [
                    {
                        "en": "I made my way along the narrow gangway.",
                        "vi": "Tôi đã đi theo con đường hẹp."
                    },
                    {
                        "en": "His suitcase was blocking the gangway.",
                        "vi": "Chiếc vali của anh ta nằm chắn ngang đường băng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a bridge placed between the side of a ship and land so people can get on and off",
                    "vi": "một cây cầu được đặt giữa mạn tàu và đất liền để mọi người có thể lên và xuống"
                },
                "examples": [
                    {
                        "en": "They staggered down the gangway to the quay.",
                        "vi": "Họ loạng choạng đi xuống đường sắt để đến bến tàu."
                    },
                    {
                        "en": "They finally agreed to let us on board and we climbed the gangway.",
                        "vi": "Cuối cùng họ đồng ý cho chúng tôi lên tàu và chúng tôi leo lên đường băng."
                    }
                ]
            }
        ]
    },
    {
        "id": "a90b819f1f08461c9d4677e2c982121f",
        "word": "guard rail",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɡɑːd reɪl/",
            "us": "/ˈɡɑːrd reɪl/"
        },
        "nearby": [
            {
                "word": "Guardian reader",
                "pos": "noun"
            },
            {
                "word": "guardianship",
                "pos": "noun"
            },
            {
                "word": "guard rail",
                "pos": "noun"
            },
            {
                "word": "guardroom",
                "pos": "noun"
            },
            {
                "word": "the Guards Division",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a bar placed on the edge of a path, a boat, etc. to protect people and prevent them falling over the edge",
                    "vi": "một thanh đặt trên mép của lối đi, một chiếc thuyền, v.v. để bảo vệ mọi người và ngăn họ rơi xuống mép"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a strong low fence or wall at the side of a road or between the two halves of a major road such as a motorway or interstate",
                    "vi": "hàng rào hoặc bức tường thấp chắc chắn ở bên đường hoặc giữa hai nửa của đường chính, chẳng hạn như đường cao tốc hoặc đường liên bang"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "48e826027d4649e79d8812836d1e41a0",
        "word": "gunnel",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɡʌnl/",
            "us": "/ˈɡʌnl/"
        },
        "nearby": [
            {
                "word": "gunman",
                "pos": "noun"
            },
            {
                "word": "gunmetal",
                "pos": "noun"
            },
            {
                "word": "gunnel",
                "pos": "noun"
            },
            {
                "word": "gunner",
                "pos": "noun"
            },
            {
                "word": "gunnery",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the upper edge of the side of a boat or small ship",
                    "vi": "mép trên của mạn thuyền hoặc tàu nhỏ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "1fc0fc960cf04400b9f023714f12d211",
        "word": "gunwale",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɡʌnl/",
            "us": "/ˈɡʌnl/"
        },
        "nearby": [
            {
                "word": "Gunsmoke",
                "pos": ""
            },
            {
                "word": "Guns N' Roses",
                "pos": ""
            },
            {
                "word": "gunwale",
                "pos": "noun"
            },
            {
                "word": "guppy",
                "pos": "noun"
            },
            {
                "word": "gurdwara",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the upper edge of the side of a boat or small ship",
                    "vi": "mép trên của mạn thuyền hoặc tàu nhỏ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "b6b66c358a714419b54259e35fc58ba1",
        "word": "gyroscope",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈdʒaɪrəskəʊp/",
            "us": "/ˈdʒaɪrəskəʊp/"
        },
        "nearby": [
            {
                "word": "gyratory",
                "pos": "adjective"
            },
            {
                "word": "gyratory",
                "pos": "noun"
            },
            {
                "word": "gyroscope",
                "pos": "noun"
            },
            {
                "word": "gyroscopic",
                "pos": "adjective"
            },
            {
                "word": "H2O",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a device consisting of a wheel that turns rapidly inside a frame and does not change position when the frame is moved. Gyroscopes are often used to keep ships and aircraft steady.",
                    "vi": "một thiết bị bao gồm một bánh xe quay nhanh dần đều bên trong khung và không thay đổi vị trí khi khung được chuyển động. Con quay hồi chuyển thường được sử dụng để giữ cho tàu và máy bay ổn định."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "29035ac5ba7d44ac986dd14c65b5eb2f",
        "word": "hatch",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/hætʃ/",
            "us": "/hætʃ/"
        },
        "nearby": [
            {
                "word": "hatbox",
                "pos": "noun"
            },
            {
                "word": "hatch",
                "pos": "verb"
            },
            {
                "word": "hatch",
                "pos": "noun"
            },
            {
                "word": "Hatchards",
                "pos": ""
            },
            {
                "word": "hatchback",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an opening or a door in a ship, aircraft or spacecraft",
                    "vi": "một sự mở hoặc một cánh cửa trong một con tàu, máy bay hoặc tàu vũ trụ"
                },
                "examples": [
                    {
                        "en": "The engineer was peering into the service hatch.",
                        "vi": "Kỹ sư đang chăm chú vào cửa hầm dịch vụ."
                    },
                    {
                        "en": "an escape hatch",
                        "vi": "một lối thoát hiểm"
                    }
                ]
            },
            {
                "define": {
                    "en": "an opening in a wall between two rooms, especially a kitchen and a dining room, through which food can be passed",
                    "vi": "một khe hở trong bức tường giữa hai phòng, đặc biệt là nhà bếp và phòng ăn, qua đó thức ăn có thể đi qua"
                },
                "examples": [
                    {
                        "en": "a serving hatch",
                        "vi": "một khẩu phần ăn"
                    }
                ]
            },
            {
                "define": {
                    "en": "an opening or a door in a floor or ceiling",
                    "vi": "một lỗ mở hoặc một cánh cửa trên sàn nhà hoặc trần nhà"
                },
                "examples": [
                    {
                        "en": "a hatch to the attic",
                        "vi": "một cửa sập cho tầng áp mái"
                    }
                ]
            },
            {
                "define": {
                    "en": "to prepare yourself for a period of difficulty or trouble",
                    "vi": "để chuẩn bị cho mình trong một giai đoạn khó khăn hoặc rắc rối"
                },
                "examples": [
                    {
                        "en": "A natural tendency in times of recession is to batten down the hatches and think about our own needs.",
                        "vi": "Một xu hướng tự nhiên trong thời kỳ suy thoái là thu mình lại và suy nghĩ về nhu cầu của chính chúng ta."
                    }
                ]
            },
            {
                "define": {
                    "en": "to shut all the entrances to the lower part, especially because a storm is expected",
                    "vi": "đóng tất cả các lối vào phần dưới, đặc biệt là vì dự kiến sẽ có bão"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used before drinking something, especially to express good wishes before drinking alcohol",
                    "vi": "được sử dụng trước khi uống một thứ gì đó, đặc biệt là để bày tỏ những lời chúc tốt đẹp trước khi uống rượu"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "66723b4d90d84d2583b2d620aa5ef91e",
        "word": "hatchway",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈhætʃweɪ/",
            "us": "/ˈhætʃweɪ/"
        },
        "nearby": [
            {
                "word": "hatchet man",
                "pos": "noun"
            },
            {
                "word": "hatchling",
                "pos": "noun"
            },
            {
                "word": "hatchway",
                "pos": "noun"
            },
            {
                "word": "hate",
                "pos": "verb"
            },
            {
                "word": "hate",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an opening or a door in a ship, aircraft or spacecraft",
                    "vi": "một sự mở hoặc một cánh cửa trong một con tàu, máy bay hoặc tàu vũ trụ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "cf2426bfc55e49ada634b5a52fb6a571",
        "word": "hawser",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈhɔːzə(r)/",
            "us": "/ˈhɔːzər/"
        },
        "nearby": [
            {
                "word": "Nicholas Hawksmoor",
                "pos": ""
            },
            {
                "word": "Haworth",
                "pos": ""
            },
            {
                "word": "hawser",
                "pos": "noun"
            },
            {
                "word": "hawthorn",
                "pos": "noun"
            },
            {
                "word": "Nathaniel Hawthorne",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a thick rope or steel cable used on a ship",
                    "vi": "một sợi dây dày hoặc cáp thép được sử dụng trên tàu"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "8145b2f9bc9741c2a831859a4454a18e",
        "word": "helm",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/helm/",
            "us": "/helm/"
        },
        "nearby": [
            {
                "word": "Hells Angel",
                "pos": "noun"
            },
            {
                "word": "helluva",
                "pos": ""
            },
            {
                "word": "helm",
                "pos": "noun"
            },
            {
                "word": "helm",
                "pos": "verb"
            },
            {
                "word": "helmet",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a handle or wheel used for controlling the direction in which a boat or ship moves",
                    "vi": "một tay cầm hoặc bánh xe được sử dụng để điều khiển hướng thuyền hoặc tàu di chuyển"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "in charge of an organization, project, etc.",
                    "vi": "phụ trách một tổ chức, dự án, v.v."
                },
                "examples": [
                    {
                        "en": "Sarah is at the helm.",
                        "vi": "Sarah đang lãnh đạo."
                    }
                ]
            },
            {
                "define": {
                    "en": "controlling the direction in which a boat or ship moves",
                    "vi": "kiểm soát hướng mà thuyền hoặc tàu di chuyển"
                },
                "examples": [
                    {
                        "en": "The skipper remained at the helm all night.",
                        "vi": "Người đội trưởng vẫn chỉ huy suốt đêm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to take charge of an organization, project, etc.",
                    "vi": "phụ trách một tổ chức, dự án, v.v."
                },
                "examples": [
                    {
                        "en": "Lucenti took over the helm when the previous director retired.",
                        "vi": "Lucenti tiếp quản quyền lãnh đạo khi giám đốc trước đó nghỉ hưu."
                    }
                ]
            },
            {
                "define": {
                    "en": "to begin controlling the direction in which a boat or ship moves",
                    "vi": "để bắt đầu kiểm soát hướng mà thuyền hoặc tàu di chuyển"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a553f96f4927434d8591418fd410e518",
        "word": "hulk",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/hʌlk/",
            "us": "/hʌlk/"
        },
        "nearby": [
            {
                "word": "hula",
                "pos": "noun"
            },
            {
                "word": "hula hoop",
                "pos": "noun"
            },
            {
                "word": "hulk",
                "pos": "noun"
            },
            {
                "word": "hulking",
                "pos": "adjective"
            },
            {
                "word": "hull",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the main part of an old vehicle or large structure that is no longer used",
                    "vi": "phần chính của một chiếc xe cũ hoặc kết cấu lớn không còn được sử dụng"
                },
                "examples": [
                    {
                        "en": "the rusting hulks of cars",
                        "vi": "những chiếc xe ô tô rỉ sét"
                    },
                    {
                        "en": "the hulk of a wrecked ship",
                        "vi": "vỏ của một con tàu bị đắm"
                    }
                ]
            },
            {
                "define": {
                    "en": "an old ship kept in one place and used as a prison",
                    "vi": "một con tàu cũ được giữ ở một nơi và được sử dụng như một nhà tù"
                },
                "examples": [
                    {
                        "en": "prison hulks",
                        "vi": "nhà tù"
                    }
                ]
            },
            {
                "define": {
                    "en": "a large heavy person",
                    "vi": "một người nặng nề"
                },
                "examples": [
                    {
                        "en": "a great hulk of a man",
                        "vi": "một người đàn ông tuyệt vời"
                    }
                ]
            },
            {
                "define": {
                    "en": "a very large object, especially one that causes you to feel nervous or afraid",
                    "vi": "một vật thể rất lớn, đặc biệt là vật thể khiến bạn cảm thấy lo lắng hoặc sợ hãi"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "edd2a9d2d2714415b4ecfae1f2ae7dd9",
        "word": "hull",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/hʌl/",
            "us": "/hʌl/"
        },
        "nearby": [
            {
                "word": "hulk",
                "pos": "noun"
            },
            {
                "word": "hulking",
                "pos": "adjective"
            },
            {
                "word": "hull",
                "pos": "noun"
            },
            {
                "word": "hull",
                "pos": "verb"
            },
            {
                "word": "Hull",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the main, bottom part of a ship, that goes in the water",
                    "vi": "phần chính, phần dưới cùng của một con tàu, chìm trong nước"
                },
                "examples": [
                    {
                        "en": "a wooden/steel hull",
                        "vi": "một con tàu bằng gỗ / thép"
                    },
                    {
                        "en": "They climbed onto the upturned hull and waited to be rescued.",
                        "vi": "Họ trèo lên thân tàu bị lật và chờ được giải cứu."
                    }
                ]
            }
        ]
    },
    {
        "id": "407ae94d52d245fc9294989e76eb7c50",
        "word": "jib",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/dʒɪb/",
            "us": "/dʒɪb/"
        },
        "nearby": [
            {
                "word": "jhuggi",
                "pos": "noun"
            },
            {
                "word": "-ji",
                "pos": "combining form"
            },
            {
                "word": "jib",
                "pos": "noun"
            },
            {
                "word": "jib",
                "pos": "verb"
            },
            {
                "word": "jibba",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small sail in front of the large sail on a boat",
                    "vi": "một cánh buồm nhỏ phía trước cánh buồm lớn trên thuyền"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the arm of a crane that lifts things",
                    "vi": "cánh tay của cần cẩu nâng hạ mọi thứ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "3c2208af9e604c14995bee45c975a5e6",
        "word": "keel",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/kiːl/",
            "us": "/kiːl/"
        },
        "nearby": [
            {
                "word": "Keds",
                "pos": ""
            },
            {
                "word": "Keebler",
                "pos": ""
            },
            {
                "word": "keel",
                "pos": "noun"
            },
            {
                "word": "keel",
                "pos": "verb"
            },
            {
                "word": "keelhaul",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the long piece of wood or steel along the bottom of a ship, on which the frame is built, and which sometimes sticks out below the bottom to help it to keep steady in the water and prevent it from falling on its side",
                    "vi": "miếng gỗ hoặc thép dài dọc theo đáy tàu, trên đó làm khung, và đôi khi nhô ra dưới đáy để giúp tàu giữ cố định trong nước và ngăn tàu đổ nghiêng."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "living, working or happening in a calm way, with no sudden changes, especially after a difficult time",
                    "vi": "sống, làm việc, diễn biến bình lặng, không đột biến, nhất là sau thời kỳ khó khăn."
                },
                "examples": [
                    {
                        "en": "Business is now back on an even keel after the strike.",
                        "vi": "Công việc kinh doanh hiện đã ổn định trở lại sau cuộc đình công."
                    },
                    {
                        "en": "Setting her life back on an even keel after their break-up had been incredibly difficult.",
                        "vi": "Việc thiết lập cuộc sống của cô ấy ổn định trở lại sau khi họ chia tay là một điều vô cùng khó khăn."
                    }
                ]
            }
        ]
    },
    {
        "id": "f973f3b7cc3d471f9de2dccb486c56d7",
        "word": "lifebelt",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈlaɪfbelt/",
            "us": "/ˈlaɪfbelt/"
        },
        "nearby": [
            {
                "word": "life-and-death",
                "pos": "adjective"
            },
            {
                "word": "life assurance",
                "pos": "noun"
            },
            {
                "word": "lifebelt",
                "pos": "noun"
            },
            {
                "word": "lifeblood",
                "pos": "noun"
            },
            {
                "word": "lifeboat",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a large ring made of material that floats well, that is used to rescue somebody who has fallen into water, to prevent them from drowning",
                    "vi": "một chiếc vòng lớn làm bằng vật liệu nổi tốt, được sử dụng để giải cứu ai đó bị rơi xuống nước, tránh cho họ bị chết đuối"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a special belt worn to help somebody float in water",
                    "vi": "một chiếc thắt lưng đặc biệt được đeo để giúp ai đó nổi trong nước"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "ceb55ee8dddc4888b886a25461468553",
        "word": "load line",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈləʊd laɪn/",
            "us": "/ˈləʊd laɪn/"
        },
        "nearby": [
            {
                "word": "loaded",
                "pos": "adjective"
            },
            {
                "word": "loading",
                "pos": "noun"
            },
            {
                "word": "load line",
                "pos": "noun"
            },
            {
                "word": "load-shedding",
                "pos": "noun"
            },
            {
                "word": "load up on",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a line on the side of a ship showing the highest point that the water can safely reach when the ship is loaded",
                    "vi": "một đường ở mạn tàu thể hiện điểm cao nhất mà mặt nước có thể chạm tới một cách an toàn khi tàu được chất hàng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "9df1677f4eea4ba99a855f552be3c683",
        "word": "mainsail",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmeɪnseɪl/",
            "us": "/ˈmeɪnseɪl/"
        },
        "nearby": [
            {
                "word": "mainly",
                "pos": "adverb"
            },
            {
                "word": "main man",
                "pos": "noun"
            },
            {
                "word": "mainsail",
                "pos": "noun"
            },
            {
                "word": "mainspring",
                "pos": "noun"
            },
            {
                "word": "mainstay",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the largest and most important sail on a boat or ship",
                    "vi": "cánh buồm lớn nhất và quan trọng nhất trên thuyền hoặc tàu"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "1dcb055215e14b43be59ca4ea49ffadf",
        "word": "masthead",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmɑːsthed/",
            "us": "/ˈmæsthed/"
        },
        "nearby": [
            {
                "word": "masterwork",
                "pos": "noun"
            },
            {
                "word": "mastery",
                "pos": "noun"
            },
            {
                "word": "masthead",
                "pos": "noun"
            },
            {
                "word": "mastic",
                "pos": "noun"
            },
            {
                "word": "masticate",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the top of a mast on a ship",
                    "vi": "đỉnh cột buồm trên con tàu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the name of a newspaper at the top of the front page or website",
                    "vi": "tên của một tờ báo ở đầu trang nhất hoặc trang web"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the part of a newspaper or a news website that gives details of the people who work on it and other information about it",
                    "vi": "phần của một tờ báo hoặc một trang web tin tức cung cấp thông tin chi tiết về những người làm việc trên đó và thông tin khác về nó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "06f15801279b4be1a3208613a536274c",
        "word": "mizzen",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmɪzn/",
            "us": "/ˈmɪzn/"
        },
        "nearby": [
            {
                "word": "mix up",
                "pos": "phrasal verb"
            },
            {
                "word": "mix-up",
                "pos": "noun"
            },
            {
                "word": "mizzen",
                "pos": "noun"
            },
            {
                "word": "ml",
                "pos": "abbreviation"
            },
            {
                "word": "MLA",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the mast of a ship that is behind the main mast",
                    "vi": "cột buồm của con tàu nằm sau cột buồm chính"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a sail on the mizzen of a ship",
                    "vi": "một cánh buồm trên mizzen của một con tàu"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "da477bfef80640fc9ba21156c765182c",
        "word": "oar",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ɔː(r)/",
            "us": "/ɔːr/"
        },
        "nearby": [
            {
                "word": "oakum",
                "pos": "noun"
            },
            {
                "word": "OAP",
                "pos": "noun"
            },
            {
                "word": "oar",
                "pos": "noun"
            },
            {
                "word": "oarlock",
                "pos": "noun"
            },
            {
                "word": "oarsman",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a long pole with a flat part at one end that is used for rowing a boat",
                    "vi": "một cái sào dài với một phần bằng phẳng ở một đầu dùng để chèo thuyền"
                },
                "examples": [
                    {
                        "en": "He pulled as hard as he could on the oars.",
                        "vi": "Anh kéo mái chèo hết sức có thể."
                    },
                    {
                        "en": "We took one oar each and rowed quickly to the shore.",
                        "vi": "Chúng tôi mỗi người cầm một chiếc mái chèo và chèo nhanh vào bờ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to give your opinion, advice, etc. without being asked and when it is probably not wanted",
                    "vi": "đưa ra ý kiến, lời khuyên của bạn, v.v. mà không cần được hỏi và khi nó có thể không được mong muốn"
                },
                "examples": [
                    {
                        "en": "I was getting along very nicely until Patrick stuck his oar in.",
                        "vi": "Tôi đã rất hòa hợp với nhau cho đến khi Patrick mắc kẹt."
                    }
                ]
            }
        ]
    },
    {
        "id": "f9e29abfd65e48d0aa0562c0db66ff2d",
        "word": "oarlock",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɔːlɒk/",
            "us": "/ˈɔːrlɑːk/"
        },
        "nearby": [
            {
                "word": "OAP",
                "pos": "noun"
            },
            {
                "word": "oar",
                "pos": "noun"
            },
            {
                "word": "oarlock",
                "pos": "noun"
            },
            {
                "word": "oarsman",
                "pos": "noun"
            },
            {
                "word": "oarswoman",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a device fixed to the side of a boat for holding an oar",
                    "vi": "một thiết bị cố định vào mạn thuyền để giữ mái chèo"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "69ddd13547264c78851bf71e4963636b",
        "word": "outboard",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈaʊtbɔːd/",
            "us": "/ˈaʊtbɔːrd/"
        },
        "nearby": [
            {
                "word": "outback",
                "pos": "noun"
            },
            {
                "word": "outbid",
                "pos": "verb"
            },
            {
                "word": "outboard",
                "pos": "adjective"
            },
            {
                "word": "outboard motor",
                "pos": "noun"
            },
            {
                "word": "outbound",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "on, towards or near the outside of a ship or an aircraft",
                    "vi": "trên, về phía hoặc gần bên ngoài của một con tàu hoặc một chiếc máy bay"
                },
                "examples": [
                    {
                        "en": "outboard wing panels",
                        "vi": "tấm cánh ngoài"
                    }
                ]
            }
        ]
    },
    {
        "id": "df7c106f2ae2495ca4293f55f1e4377b",
        "word": "outboard motor",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌaʊtbɔːd ˈməʊtə(r)/",
            "us": "/ˌaʊtbɔːrd ˈməʊtər/"
        },
        "nearby": [
            {
                "word": "outbid",
                "pos": "verb"
            },
            {
                "word": "outboard",
                "pos": "adjective"
            },
            {
                "word": "outboard motor",
                "pos": "noun"
            },
            {
                "word": "outbound",
                "pos": "adjective"
            },
            {
                "word": "out box",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an engine that you can fix to the back of a small boat",
                    "vi": "một động cơ mà bạn có thể gắn vào phía sau của một chiếc thuyền nhỏ"
                },
                "examples": [
                    {
                        "en": "a boat with a powerful outboard motor",
                        "vi": "một chiếc thuyền với động cơ bên ngoài mạnh mẽ"
                    }
                ]
            }
        ]
    },
    {
        "id": "c68313e0967a48218b5c08fbbd181953",
        "word": "outrigger",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈaʊtrɪɡə(r)/",
            "us": "/ˈaʊtrɪɡər/"
        },
        "nearby": [
            {
                "word": "outreach",
                "pos": "noun"
            },
            {
                "word": "outrider",
                "pos": "noun"
            },
            {
                "word": "outrigger",
                "pos": "noun"
            },
            {
                "word": "outright",
                "pos": "adjective"
            },
            {
                "word": "outright",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a wooden structure that is fixed to the side of a boat or ship in order to keep it steady in the water; a boat fitted with such a structure",
                    "vi": "một cấu trúc bằng gỗ được cố định vào mạn thuyền hoặc tàu để giữ cố định trong nước; một chiếc thuyền được trang bị cấu trúc như vậy"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "295f6f98146d41acabca3760b41547b9",
        "word": "pennant",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpenənt/",
            "us": "/ˈpenənt/"
        },
        "nearby": [
            {
                "word": "William Penn",
                "pos": ""
            },
            {
                "word": "pen name",
                "pos": "noun"
            },
            {
                "word": "pennant",
                "pos": "noun"
            },
            {
                "word": "penne",
                "pos": "noun"
            },
            {
                "word": "penniless",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a long narrow pointed flag, for example one used on a ship to give signals",
                    "vi": "một lá cờ dài hẹp nhọn, ví dụ một lá cờ được sử dụng trên tàu để phát tín hiệu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a flag given to the team that wins in a sports league, especially in baseball",
                    "vi": "một lá cờ được trao cho đội chiến thắng trong một giải đấu thể thao, đặc biệt là trong môn bóng chày"
                },
                "examples": [
                    {
                        "en": "The Dodgers defeated the Mets 6–0 to win the pennant.",
                        "vi": "Dodgers đã đánh bại Mets với tỷ số 6–0 để giành được cờ hiệu."
                    }
                ]
            }
        ]
    },
    {
        "id": "1b0a0bf9f44748c397e12252aba39bf8",
        "word": "periscope",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈperɪskəʊp/",
            "us": "/ˈperɪskəʊp/"
        },
        "nearby": [
            {
                "word": "periphrasis",
                "pos": "noun"
            },
            {
                "word": "periphrastic",
                "pos": "adjective"
            },
            {
                "word": "periscope",
                "pos": "noun"
            },
            {
                "word": "perish",
                "pos": "verb"
            },
            {
                "word": "perishable",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a device consisting of a long tube containing mirrors that enable the user to see over the top of something, used especially in a submarine (= a ship that can operate underwater) to see above the surface of the sea",
                    "vi": "một thiết bị bao gồm một ống dài có chứa gương cho phép người dùng nhìn bao quát phần trên của vật gì đó, được sử dụng đặc biệt trong tàu ngầm (= tàu có thể hoạt động dưới nước) để nhìn trên mặt biển"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "236b8882f2cf42b89372284ab3849275",
        "word": "Plimsoll line",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈplɪmsəl laɪn/",
            "us": "/ˈplɪmsəl laɪn/"
        },
        "nearby": [
            {
                "word": "plight",
                "pos": "verb"
            },
            {
                "word": "plimsoll",
                "pos": "noun"
            },
            {
                "word": "Plimsoll line",
                "pos": "noun"
            },
            {
                "word": "plinth",
                "pos": "noun"
            },
            {
                "word": "plod",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a line on the side of a ship showing the highest point that the water can safely reach when the ship is loaded",
                    "vi": "một đường ở mạn tàu thể hiện điểm cao nhất mà mặt nước có thể chạm tới một cách an toàn khi tàu được chất hàng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a0e050071f944a1c8ed04f03e507d1fc",
        "word": "poop",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/puːp/",
            "us": "/puːp/"
        },
        "nearby": [
            {
                "word": "poolroom",
                "pos": "noun"
            },
            {
                "word": "poolside",
                "pos": "noun"
            },
            {
                "word": "poop",
                "pos": "noun"
            },
            {
                "word": "poop",
                "pos": "verb"
            },
            {
                "word": "pooped",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the raised part at the back end of a ship",
                    "vi": "phần nâng lên ở cuối tàu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a child’s word for the solid waste that is passed through the bowels",
                    "vi": "lời nói của một đứa trẻ về chất thải rắn đi qua ruột"
                },
                "examples": [
                    {
                        "en": "dog poop on the sidewalk",
                        "vi": "chó đi vệ sinh trên vỉa hè"
                    }
                ]
            },
            {
                "define": {
                    "en": "information about something, especially the most recent news",
                    "vi": "thông tin về điều gì đó, đặc biệt là tin tức gần đây nhất"
                },
                "examples": [
                    {
                        "en": "The website gives you the latest poop from Hollywood.",
                        "vi": "Trang web cung cấp cho bạn những poop mới nhất từ Hollywood."
                    }
                ]
            }
        ]
    },
    {
        "id": "87cad6f1ec8542159e70d82468908956",
        "word": "porthole",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpɔːthəʊl/",
            "us": "/ˈpɔːrthəʊl/"
        },
        "nearby": [
            {
                "word": "Cole Porter",
                "pos": ""
            },
            {
                "word": "portfolio",
                "pos": "noun"
            },
            {
                "word": "porthole",
                "pos": "noun"
            },
            {
                "word": "portico",
                "pos": "noun"
            },
            {
                "word": "portion",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a round window in the side of a ship or an aircraft",
                    "vi": "cửa sổ tròn ở mạn tàu hoặc máy bay"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "0304fed9039c4d0ebb139eac798c8c3c",
        "word": "propeller",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/prəˈpelə(r)/",
            "us": "/prəˈpelər/"
        },
        "nearby": [
            {
                "word": "propel",
                "pos": "verb"
            },
            {
                "word": "propellant",
                "pos": "noun"
            },
            {
                "word": "propeller",
                "pos": "noun"
            },
            {
                "word": "propelling pencil",
                "pos": "noun"
            },
            {
                "word": "propensity",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a device with two or more long, flat blades that turn quickly and cause a ship or an aircraft to move forward",
                    "vi": "một thiết bị có hai hoặc nhiều cánh phẳng, dài trở lên quay nhanh và làm cho tàu hoặc máy bay chuyển động về phía trước"
                },
                "examples": [
                    {
                        "en": "The propeller suddenly stopped turning.",
                        "vi": "Cánh quạt đột ngột ngừng quay."
                    },
                    {
                        "en": "The boat is fitted with a two-blade propeller.",
                        "vi": "Thuyền được gắn một chân vịt hai lưỡi."
                    },
                    {
                        "en": "The front engine drives the propellers.",
                        "vi": "Động cơ phía trước dẫn động các cánh quạt."
                    }
                ]
            }
        ]
    },
    {
        "id": "6940852ec37449ca8d1893e2c14bc9dc",
        "word": "prow",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/praʊ/",
            "us": "/praʊ/"
        },
        "nearby": [
            {
                "word": "provoke",
                "pos": "verb"
            },
            {
                "word": "provost",
                "pos": "noun"
            },
            {
                "word": "prow",
                "pos": "noun"
            },
            {
                "word": "prowess",
                "pos": "noun"
            },
            {
                "word": "prowl",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the pointed front part of a ship or boat",
                    "vi": "phần phía trước nhọn của một con tàu hoặc thuyền"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "57dc5d93511e474f8fc3b388bb2d9b17",
        "word": "quarterdeck",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkwɔːtədek/",
            "us": "/ˈkwɔːrtərdek/"
        },
        "nearby": [
            {
                "word": "quarterback",
                "pos": "verb"
            },
            {
                "word": "quarter day",
                "pos": "noun"
            },
            {
                "word": "quarterdeck",
                "pos": "noun"
            },
            {
                "word": "quarter-final",
                "pos": "noun"
            },
            {
                "word": "quarter-finalist",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a part of the upper level of a ship, at the back, that is used mainly by officers",
                    "vi": "một phần của tầng trên của tàu, ở phía sau, được sử dụng chủ yếu bởi các sĩ quan"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "0af56fd0c5f040b9ae1ee76b5c813592",
        "word": "rig",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/rɪɡ/",
            "us": "/rɪɡ/"
        },
        "nearby": [
            {
                "word": "rift valley",
                "pos": "noun"
            },
            {
                "word": "rig",
                "pos": "verb"
            },
            {
                "word": "rig",
                "pos": "noun"
            },
            {
                "word": "rigamarole",
                "pos": "noun"
            },
            {
                "word": "rigatoni",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a large piece of equipment that is used for taking oil or gas from the ground or the bottom of the sea",
                    "vi": "một thiết bị lớn được sử dụng để lấy dầu hoặc khí đốt từ lòng đất hoặc dưới đáy biển"
                },
                "examples": [
                    {
                        "en": "an oil rig",
                        "vi": "một giàn khoan dầu"
                    },
                    {
                        "en": "Her husband works on a rig in the North Sea for weeks at a time.",
                        "vi": "Chồng cô làm việc trên một giàn khoan ở Biển Bắc trong nhiều tuần liền."
                    }
                ]
            },
            {
                "define": {
                    "en": "the way that the masts and sails on a boat, etc. are arranged",
                    "vi": "cách sắp xếp các cột buồm và buồm trên thuyền, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a large lorry",
                    "vi": "một chiếc xe tải lớn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "equipment that is used for a special purpose",
                    "vi": "thiết bị được sử dụng cho một mục đích đặc biệt"
                },
                "examples": [
                    {
                        "en": "a CB radio rig",
                        "vi": "một giàn đài CB"
                    }
                ]
            }
        ]
    },
    {
        "id": "1f72862b74fc4796b5734405f2127708",
        "word": "rigging",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈrɪɡɪŋ/",
            "us": "/ˈrɪɡɪŋ/"
        },
        "nearby": [
            {
                "word": "rigamarole",
                "pos": "noun"
            },
            {
                "word": "rigatoni",
                "pos": "noun"
            },
            {
                "word": "rigging",
                "pos": "noun"
            },
            {
                "word": "right",
                "pos": "adjective"
            },
            {
                "word": "right",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the ropes that support the masts and sails of a boat or ship",
                    "vi": "những sợi dây hỗ trợ cột buồm và buồm của thuyền hoặc tàu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the act of influencing something in a dishonest way in order to get the result that you want",
                    "vi": "hành động ảnh hưởng đến điều gì đó theo cách không trung thực để đạt được kết quả như bạn muốn"
                },
                "examples": [
                    {
                        "en": "vote rigging",
                        "vi": "gian lận phiếu bầu"
                    }
                ]
            }
        ]
    },
    {
        "id": "edea4fd0f6d8443f9428b6fc8ac566c6",
        "word": "screw",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/skruː/",
            "us": "/skruː/"
        },
        "nearby": [
            {
                "word": "screenwriter",
                "pos": "noun"
            },
            {
                "word": "screw",
                "pos": "verb"
            },
            {
                "word": "screw",
                "pos": "noun"
            },
            {
                "word": "screw around",
                "pos": "phrasal verb"
            },
            {
                "word": "screwball",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a thin pointed piece of metal like a nail with a raised spiral line (called a thread) along it and a line or cross cut into its head. Screws are turned and pressed into wood, metal, etc. with a screwdriver in order to fasten two things together.",
                    "vi": "một mảnh kim loại nhọn mỏng như đinh với một đường xoắn ốc nhô lên (gọi là chỉ) dọc theo nó và một đường hoặc vết cắt chéo trên đầu của nó. Vít được vặn và ép vào gỗ, kim loại, v.v. bằng tuốc nơ vít để gắn chặt hai vật với nhau."
                },
                "examples": [
                    {
                        "en": "One of the screws is loose.",
                        "vi": "Một trong các vít bị lỏng."
                    },
                    {
                        "en": "Now tighten all the screws.",
                        "vi": "Bây giờ hãy siết chặt tất cả các vít."
                    }
                ]
            },
            {
                "define": {
                    "en": "an act of turning a screw",
                    "vi": "một hành động xoay một cái vít"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "an act of having sex",
                    "vi": "một hành động quan hệ tình dục"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a partner in sex",
                    "vi": "bạn tình trong quan hệ tình dục"
                },
                "examples": [
                    {
                        "en": "a good screw",
                        "vi": "một cái vít tốt"
                    }
                ]
            },
            {
                "define": {
                    "en": "a propeller on a ship, a boat or an aircraft",
                    "vi": "một cánh quạt trên tàu, thuyền hoặc máy bay"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a prison officer",
                    "vi": "một viên chức quản giáo"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be slightly strange in your behaviour",
                    "vi": "hơi lạ trong cách cư xử của bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to force somebody to do something by frightening and threatening them",
                    "vi": "buộc ai đó làm điều gì đó bằng cách làm họ sợ hãi và đe dọa"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "an extra amount of pressure, cruelty, etc. added to a situation that is already difficult to bear or understand",
                    "vi": "thêm một lượng áp lực, sự tàn nhẫn, v.v. đã thêm vào một tình huống vốn đã khó chịu đựng hoặc khó hiểu"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a4acd0ebc1d1452db3710588f272e955",
        "word": "scull",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/skʌl/",
            "us": "/skʌl/"
        },
        "nearby": [
            {
                "word": "scuffle",
                "pos": "verb"
            },
            {
                "word": "scuffling",
                "pos": "noun"
            },
            {
                "word": "scull",
                "pos": "noun"
            },
            {
                "word": "scull",
                "pos": "verb"
            },
            {
                "word": "sculler",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "one of a pair of small oars used by a single person rowing a boat, one in each hand",
                    "vi": "một trong một cặp mái chèo nhỏ được sử dụng bởi một người chèo thuyền, mỗi người cầm một chiếc"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a race between small light boats with pairs of sculls",
                    "vi": "một cuộc đua giữa những chiếc thuyền nhẹ nhỏ với những cặp thuyền"
                },
                "examples": [
                    {
                        "en": "single/double sculls (= with one/two people in each boat)",
                        "vi": "thuyền đơn / thuyền đôi (= với một / hai người trên mỗi thuyền)"
                    }
                ]
            },
            {
                "define": {
                    "en": "a small light boat used in sculls races",
                    "vi": "một chiếc thuyền nhẹ nhỏ được sử dụng trong các cuộc đua thuyền buồm"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "2bf67eadb04f48fea4d9e4ca0f3d8568",
        "word": "shell",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ʃel/",
            "us": "/ʃel/"
        },
        "nearby": [
            {
                "word": "shelf life",
                "pos": "noun"
            },
            {
                "word": "shelf-stacker",
                "pos": "noun"
            },
            {
                "word": "shell",
                "pos": "noun"
            },
            {
                "word": "shell",
                "pos": "verb"
            },
            {
                "word": "Shell",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the hard outer part of eggs, nuts, some seeds, and some animals",
                    "vi": "phần bên ngoài cứng của trứng, quả hạch, một số hạt và một số động vật"
                },
                "examples": [
                    {
                        "en": "We collected shells on the beach.",
                        "vi": "Chúng tôi đã thu thập vỏ sò trên bãi biển."
                    },
                    {
                        "en": "snail/oyster/clam shells",
                        "vi": "vỏ ốc / hàu / ngao"
                    },
                    {
                        "en": "walnut shells",
                        "vi": "vỏ quả óc chó"
                    },
                    {
                        "en": "earrings made out of coconut shell",
                        "vi": "bông tai làm từ gáo dừa"
                    },
                    {
                        "en": "the shell of a turtle",
                        "vi": "mai của một con rùa"
                    }
                ]
            },
            {
                "define": {
                    "en": "any object that looks like the shell of a snail or sea creature",
                    "vi": "bất kỳ vật thể nào trông giống như vỏ của ốc sên hoặc sinh vật biển"
                },
                "examples": [
                    {
                        "en": "pasta shells",
                        "vi": "vỏ mì ống"
                    }
                ]
            },
            {
                "define": {
                    "en": "a metal case filled with explosive, to be fired from a large gun",
                    "vi": "một hộp kim loại chứa đầy thuốc nổ, được bắn ra từ một khẩu súng lớn"
                },
                "examples": [
                    {
                        "en": "mortar/artillery shells",
                        "vi": "đạn cối / pháo"
                    },
                    {
                        "en": "A shell burst only yards away from us.",
                        "vi": "Một quả đạn nổ chỉ cách chúng tôi vài thước."
                    },
                    {
                        "en": "Several empty shell casings were found in the area.",
                        "vi": "Một số vỏ đạn rỗng đã được tìm thấy trong khu vực."
                    }
                ]
            },
            {
                "define": {
                    "en": "a tube or case containing explosive and a bullet or shot, for shooting from a gun",
                    "vi": "một ống hoặc hộp đựng thuốc nổ và đạn hoặc súng bắn, để bắn từ súng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the walls or outer structure of something, for example, an empty building or ship after a fire or a bomb attack",
                    "vi": "các bức tường hoặc cấu trúc bên ngoài của một cái gì đó, ví dụ, một tòa nhà trống hoặc một con tàu sau một vụ hỏa hoạn hoặc một cuộc tấn công bằng bom"
                },
                "examples": [
                    {
                        "en": "The house was now a shell gutted by flames.",
                        "vi": "Ngôi nhà giờ chỉ còn là một cái vỏ bị lửa thiêu rụi."
                    },
                    {
                        "en": "(figurative) My life has been an empty shell since he died.",
                        "vi": "(nghĩa bóng) Cuộc sống của tôi đã trở thành một cái vỏ trống rỗng kể từ khi anh ấy chết."
                    },
                    {
                        "en": "The fire reduced the school to a hollow shell.",
                        "vi": "Ngọn lửa đã thu nhỏ ngôi trường thành một lớp vỏ rỗng."
                    }
                ]
            },
            {
                "define": {
                    "en": "any structure that forms a hard outer frame",
                    "vi": "bất kỳ cấu trúc nào tạo thành khung cứng bên ngoài"
                },
                "examples": [
                    {
                        "en": "the body shell of a car",
                        "vi": "thân vỏ của một chiếc ô tô"
                    }
                ]
            },
            {
                "define": {
                    "en": "the outer layer of somebody’s personality; how they seem to be or feel",
                    "vi": "lớp bên ngoài của nhân cách ai đó; họ có vẻ như thế nào hoặc cảm thấy như thế nào"
                },
                "examples": [
                    {
                        "en": "She had developed a shell of indifference.",
                        "vi": "Cô đã phát triển một lớp vỏ của sự thờ ơ."
                    },
                    {
                        "en": "She had built up a protective shell around herself.",
                        "vi": "Cô đã tự tạo cho mình một lớp vỏ bảo vệ xung quanh mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to become less shy and more confident when talking to other people",
                    "vi": "trở nên bớt nhút nhát và tự tin hơn khi nói chuyện với người khác"
                },
                "examples": [
                    {
                        "en": "He’s really come out of his shell since he met Marie.",
                        "vi": "Anh ấy thực sự thoát ra khỏi vỏ bọc của mình kể từ khi anh ấy gặp Marie."
                    }
                ]
            },
            {
                "define": {
                    "en": "to become shyer and avoid talking to other people",
                    "vi": "trở nên nhút nhát hơn và tránh nói chuyện với người khác"
                },
                "examples": [
                    {
                        "en": "Whenever my friends are here, she just withdraws into her shell.",
                        "vi": "Bất cứ khi nào bạn bè của tôi ở đây, cô ấy chỉ rút vào vỏ của mình."
                    }
                ]
            }
        ]
    },
    {
        "id": "69b7568c33104749b20e61f474e61ee8",
        "word": "sickbay",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsɪkbeɪ/",
            "us": "/ˈsɪkbeɪ/"
        },
        "nearby": [
            {
                "word": "sick",
                "pos": "verb"
            },
            {
                "word": "sick bag",
                "pos": "noun"
            },
            {
                "word": "sickbay",
                "pos": "noun"
            },
            {
                "word": "sickbed",
                "pos": "noun"
            },
            {
                "word": "sick building syndrome",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a room or rooms, for example on a ship or in a school, with beds for people who are ill",
                    "vi": "một phòng hoặc các phòng, ví dụ như trên tàu hoặc trong trường học, có giường cho những người bị bệnh"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "aeff878649e24afc825137bc027b8902",
        "word": "smokestack",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsməʊkstæk/",
            "us": "/ˈsməʊkstæk/"
        },
        "nearby": [
            {
                "word": "smoke shop",
                "pos": "noun"
            },
            {
                "word": "smoke signal",
                "pos": "noun"
            },
            {
                "word": "smokestack",
                "pos": "noun"
            },
            {
                "word": "smokestack industry",
                "pos": "noun"
            },
            {
                "word": "Smokey the Bear",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a tall chimney that takes away smoke from factories",
                    "vi": "một ống khói cao hút khói từ các nhà máy"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a metal chimney, for example on a ship or an engine, through which smoke comes out",
                    "vi": "một ống khói kim loại, ví dụ như trên một con tàu hoặc một động cơ, qua đó khói bay ra"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "57d16137f82348768fe9298e5e31d225",
        "word": "spar",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/spɑː(r)/",
            "us": "/spɑːr/"
        },
        "nearby": [
            {
                "word": "spanner",
                "pos": "noun"
            },
            {
                "word": "spar",
                "pos": "verb"
            },
            {
                "word": "spar",
                "pos": "noun"
            },
            {
                "word": "spare",
                "pos": "adjective"
            },
            {
                "word": "spare",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a strong pole used to support the sails, etc. on a ship",
                    "vi": "một chiếc cột chắc chắn được sử dụng để hỗ trợ các cánh buồm, v.v. trên một con tàu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a structure that supports the wing of an aircraft",
                    "vi": "một cấu trúc hỗ trợ cánh máy bay"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "b65b3190bdc748c4a3ea7210d4ad2bac",
        "word": "stabilizer",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsteɪbəlaɪzə(r)/",
            "us": "/ˈsteɪbəlaɪzər/"
        },
        "nearby": [
            {
                "word": "stabilization",
                "pos": "noun"
            },
            {
                "word": "stabilize",
                "pos": "verb"
            },
            {
                "word": "stabilizer",
                "pos": "noun"
            },
            {
                "word": "stable",
                "pos": "adjective"
            },
            {
                "word": "stable",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a device that keeps something steady, especially one that stops an aircraft or a ship from rolling to one side",
                    "vi": "một thiết bị giữ cho thứ gì đó ổn định, đặc biệt là thiết bị ngăn máy bay hoặc tàu thủy lăn sang một bên"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "small wheels that are fitted at each side of the back wheel on a child’s bicycle to stop it from falling over",
                    "vi": "bánh xe nhỏ được lắp ở mỗi bên của bánh sau trên xe đạp của trẻ để ngăn xe bị đổ"
                },
                "examples": [
                    {
                        "en": "She can ride her bike without stabilizers now.",
                        "vi": "Bây giờ cô ấy có thể đạp xe mà không cần ổn định."
                    }
                ]
            },
            {
                "define": {
                    "en": "a chemical that is sometimes added to food or paint to stop the various substances in it from becoming separate",
                    "vi": "một hóa chất đôi khi được thêm vào thực phẩm hoặc sơn để ngăn các chất khác nhau trong đó trở nên riêng biệt"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "299567e484344e4896e74c3db1c66a2d",
        "word": "starboard",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈstɑːbəd/",
            "us": "/ˈstɑːrbərd/"
        },
        "nearby": [
            {
                "word": "the Star",
                "pos": ""
            },
            {
                "word": "star anise",
                "pos": "noun"
            },
            {
                "word": "starboard",
                "pos": "noun"
            },
            {
                "word": "Starbucks",
                "pos": ""
            },
            {
                "word": "starburst",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the side of a ship or an aircraft that is on the right when you are facing forward",
                    "vi": "mạn tàu hoặc máy bay ở bên phải khi bạn hướng về phía trước"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "5a549118c036496a88b1db89487f9ef2",
        "word": "stateroom",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsteɪtruːm/",
            "us": "/ˈsteɪtruːm/"
        },
        "nearby": [
            {
                "word": "the State of the Union Address",
                "pos": "noun"
            },
            {
                "word": "the State Opening of Parliament",
                "pos": ""
            },
            {
                "word": "stateroom",
                "pos": "noun"
            },
            {
                "word": "state's attorney",
                "pos": "noun"
            },
            {
                "word": "state school",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a private room on a large ship",
                    "vi": "một phòng riêng trên một con tàu lớn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a room used by important government members, members of a royal family, etc. on formal occasions",
                    "vi": "một căn phòng được sử dụng bởi các thành viên quan trọng của chính phủ, thành viên của gia đình hoàng gia, v.v. trong những dịp trang trọng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "75b2769290a1483c80e0a8ffda48e73b",
        "word": "steerage",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈstɪərɪdʒ/",
            "us": "/ˈstɪrɪdʒ/"
        },
        "nearby": [
            {
                "word": "steer",
                "pos": "verb"
            },
            {
                "word": "steer",
                "pos": "noun"
            },
            {
                "word": "steerage",
                "pos": "noun"
            },
            {
                "word": "steering",
                "pos": "noun"
            },
            {
                "word": "steering column",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "(in the past) the part of a ship where passengers with the cheapest tickets used to travel",
                    "vi": "(trước đây) phần con tàu nơi hành khách có vé rẻ nhất từng đi"
                },
                "examples": [
                    {
                        "en": "steerage passengers",
                        "vi": "hành khách steerage"
                    }
                ]
            }
        ]
    }
]