[
    {
        "id": "5ac5ab2444084e559e6d67f682ed3831",
        "word": "black",
        "pos": "adjective",
        "level": "a1",
        "phonetic": {
            "uk": "/blæk/",
            "us": "/blæk/"
        },
        "nearby": [
            {
                "word": "blabber",
                "pos": "verb"
            },
            {
                "word": "blabbermouth",
                "pos": "noun"
            },
            {
                "word": "black",
                "pos": "adjective"
            },
            {
                "word": "Cilla Black",
                "pos": ""
            },
            {
                "word": "black",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "having the very darkest colour, like coal or the sky at night",
                    "vi": "có màu tối nhất, giống như màu than hoặc bầu trời vào ban đêm"
                },
                "examples": [
                    {
                        "en": "a shiny black car",
                        "vi": "một chiếc ô tô màu đen bóng"
                    },
                    {
                        "en": "black storm clouds",
                        "vi": "mây bão đen"
                    },
                    {
                        "en": "She had curly black hair and hazel eyes.",
                        "vi": "Cô có mái tóc đen xoăn và đôi mắt màu hạt dẻ."
                    }
                ]
            },
            {
                "define": {
                    "en": "without light; completely dark",
                    "vi": "không có ánh sáng; hoàn toàn tối"
                },
                "examples": [
                    {
                        "en": "a black night",
                        "vi": "một đêm đen"
                    },
                    {
                        "en": "My head banged on a rock and everything went black.",
                        "vi": "Đầu tôi đập vào một tảng đá và mọi thứ trở nên đen kịt."
                    }
                ]
            },
            {
                "define": {
                    "en": "belonging to a group of people who have dark skin, especially people who come from or whose ancestors came from Africa; connected with black people",
                    "vi": "thuộc nhóm người có nước da ngăm đen, đặc biệt là những người đến từ hoặc tổ tiên đến từ Châu Phi; kết nối với người da đen"
                },
                "examples": [
                    {
                        "en": "The film is set in a historically black community.",
                        "vi": "Bộ phim lấy bối cảnh là một cộng đồng người da đen trong lịch sử."
                    },
                    {
                        "en": "a discussion of what it means to be Black and British",
                        "vi": "thảo luận về ý nghĩa của việc trở thành người da đen và người Anh"
                    }
                ]
            },
            {
                "define": {
                    "en": "without milk",
                    "vi": "không có sữa"
                },
                "examples": [
                    {
                        "en": "Two black coffees, please.",
                        "vi": "Làm ơn cho hai ly cà phê đen."
                    }
                ]
            },
            {
                "define": {
                    "en": "very dirty; covered with dirt",
                    "vi": "Rất bẩn; phủ đầy bụi bẩn"
                },
                "examples": [
                    {
                        "en": "chimneys black with smoke",
                        "vi": "ống khói đen có khói"
                    },
                    {
                        "en": "Go and wash your hands; they're absolutely black!",
                        "vi": "Đi rửa tay; chúng hoàn toàn đen!"
                    }
                ]
            },
            {
                "define": {
                    "en": "full of anger or hate",
                    "vi": "đầy tức giận hoặc căm ghét"
                },
                "examples": [
                    {
                        "en": "She's been in a really black mood all day.",
                        "vi": "Cô ấy đã có một tâm trạng thực sự đen suốt cả ngày."
                    },
                    {
                        "en": "Rory shot her a black look.",
                        "vi": "Rory ném cho cô một cái nhìn đen đủi."
                    }
                ]
            },
            {
                "define": {
                    "en": "without hope; very depressing",
                    "vi": "không có hi vọng; rất buồn"
                },
                "examples": [
                    {
                        "en": "The future looks pretty black.",
                        "vi": "Tương lai trông khá đen."
                    },
                    {
                        "en": "It's been another black day for the north-east with the announcement of further job losses.",
                        "vi": "Lại là một ngày đen đủi đối với vùng đông bắc với thông báo về việc tiếp tục mất việc làm."
                    }
                ]
            },
            {
                "define": {
                    "en": "evil or immoral",
                    "vi": "xấu xa hoặc vô đạo đức"
                },
                "examples": [
                    {
                        "en": "black deeds/lies",
                        "vi": "hành động đen tối / dối trá"
                    }
                ]
            },
            {
                "define": {
                    "en": "dealing with unpleasant or terrible things, such as murder, in a humorous way",
                    "vi": "đối phó với những điều khó chịu hoặc khủng khiếp, chẳng hạn như giết người, theo cách hài hước"
                },
                "examples": [
                    {
                        "en": "‘Good place to bury the bodies,’ she joked with black humour.",
                        "vi": "Nơi tốt để chôn các thi thể, cô nói đùa với sự hài hước của người da đen."
                    },
                    {
                        "en": "The play is a black comedy.",
                        "vi": "Vở kịch là một vở hài kịch đen."
                    }
                ]
            },
            {
                "define": {
                    "en": "(to hit somebody until they are) covered with bruises (= blue, brown or purple marks on the body)",
                    "vi": "(đánh ai đó cho đến khi họ bị thương) đầy vết bầm tím (= vết xanh, nâu hoặc tím trên cơ thể)"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "not as bad as people say he/she/it is",
                    "vi": "không tệ như mọi người nói anh ấy / cô ấy / nó là"
                },
                "examples": [
                    {
                        "en": "He's not very friendly, but he's not as black as he's painted.",
                        "vi": "Anh ấy không thân thiện cho lắm, nhưng anh ấy không đen như vẽ."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that you should not criticize somebody for a fault that you have yourself",
                    "vi": "đã từng nói rằng bạn không nên chỉ trích ai đó vì lỗi mà bản thân bạn mắc phải"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "750dd22fc35b46c38dda75209bf83fef",
        "word": "of color",
        "pos": "idiom",
        "level": "a1",
        "phonetic": {
            "uk": "/ˈkʌlə(r)/",
            "us": "/ˈkʌlər/"
        },
        "nearby": [
            {
                "word": "colony",
                "pos": "noun"
            },
            {
                "word": "colophon",
                "pos": "noun"
            },
            {
                "word": "color",
                "pos": "noun"
            },
            {
                "word": "color",
                "pos": "verb"
            },
            {
                "word": "Colorado",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the appearance that things have that results from the way in which they reflect light. Red, orange and green are colors.",
                    "vi": "vẻ ngoài mà mọi thứ có được là kết quả của cách mà chúng phản xạ ánh sáng. Màu đỏ, cam và xanh lá cây là các màu."
                },
                "examples": [
                    {
                        "en": "What's your favorite color?",
                        "vi": "Màu yêu thích của bạn là gì?"
                    },
                    {
                        "en": "bright/vibrant colors",
                        "vi": "màu sắc tươi sáng / rực rỡ"
                    },
                    {
                        "en": "dark/light colors",
                        "vi": "màu đậm / nhạt"
                    },
                    {
                        "en": "She always wears dark colors.",
                        "vi": "Cô ấy luôn mặc đồ tối màu."
                    },
                    {
                        "en": "vivid/rich/bold colors",
                        "vi": "màu sắc sống động / phong phú / đậm"
                    },
                    {
                        "en": "a warm color palette (= the range of colors used for something)",
                        "vi": "bảng màu ấm (= dải màu được sử dụng cho một thứ gì đó)"
                    },
                    {
                        "en": "available in 12 different colors",
                        "vi": "có sẵn 12 màu khác nhau"
                    },
                    {
                        "en": "the color of the sky",
                        "vi": "màu sắc của bầu trời"
                    },
                    {
                        "en": "skin/hair/eye color",
                        "vi": "màu da / tóc / mắt"
                    },
                    {
                        "en": "in color red/green/blue in color",
                        "vi": "màu đỏ / xanh lá cây / xanh lam"
                    },
                    {
                        "en": "Her hair is a reddish-brown color.",
                        "vi": "Tóc cô ấy có màu nâu đỏ."
                    },
                    {
                        "en": "The stage lights changed color from red to blue.",
                        "vi": "Đèn sân khấu đổi màu từ đỏ sang xanh."
                    },
                    {
                        "en": "Foods that go through a factory process lose much of their color, flavor and texture.",
                        "vi": "Thực phẩm trải qua quá trình chế biến tại nhà máy bị mất đi nhiều màu sắc, hương vị và kết cấu."
                    }
                ]
            },
            {
                "define": {
                    "en": "the use of all the colors, not only black and white",
                    "vi": "việc sử dụng tất cả các màu, không chỉ đen và trắng"
                },
                "examples": [
                    {
                        "en": "the introduction of color television in the 1960s",
                        "vi": "sự ra đời của tivi màu vào những năm 1960"
                    },
                    {
                        "en": "color photographs",
                        "vi": "ảnh màu"
                    },
                    {
                        "en": "a color printer",
                        "vi": "một máy in màu"
                    },
                    {
                        "en": "a full-color brochure",
                        "vi": "một tờ rơi đầy màu sắc"
                    },
                    {
                        "en": "in color Do you dream in color?",
                        "vi": "màu sắc Bạn có mơ thấy màu sắc không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "the color of a person’s skin, when it shows the race they belong to",
                    "vi": "màu da của một người, khi nó thể hiện chủng tộc mà họ thuộc về"
                },
                "examples": [
                    {
                        "en": "Discrimination on the grounds of race, religion or color was outlawed.",
                        "vi": "Phân biệt đối xử vì lý do chủng tộc, tôn giáo hoặc màu da đã bị cấm."
                    },
                    {
                        "en": "people of all ages, genders, creeds and colors",
                        "vi": "mọi người ở mọi lứa tuổi, giới tính, tín ngưỡng và màu sắc"
                    },
                    {
                        "en": "Can we seriously believe people who claim not to see color?",
                        "vi": "Chúng ta có thể nghiêm túc tin những người tuyên bố không nhìn thấy màu sắc không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "a red or pink color in somebody’s face, especially when it shows that they look healthy or that they are embarrassed",
                    "vi": "màu đỏ hoặc hồng trên khuôn mặt của ai đó, đặc biệt là khi điều đó cho thấy họ trông khỏe mạnh hoặc họ đang xấu hổ"
                },
                "examples": [
                    {
                        "en": "The fresh air brought color to their cheeks.",
                        "vi": "Không khí trong lành đã mang lại màu sắc cho đôi má của họ."
                    },
                    {
                        "en": "Color flooded her face when she thought of what had happened.",
                        "vi": "Màu sắc tràn ngập trên khuôn mặt cô khi cô nghĩ về những gì đã xảy ra."
                    },
                    {
                        "en": "His face was drained of color (= he looked pale and ill).",
                        "vi": "Mặt anh ta tái mét (= trông anh ta xanh xao và ốm yếu)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a substance that is used to give color to something",
                    "vi": "một chất được sử dụng để tạo màu cho một thứ gì đó"
                },
                "examples": [
                    {
                        "en": "a semi-permanent hair color that lasts six to eight washes",
                        "vi": "màu tóc bán vĩnh viễn kéo dài từ sáu đến tám lần gội"
                    },
                    {
                        "en": "This color runs, so wash the shirt separately.",
                        "vi": "Màu này chạy, nên giặt riêng áo."
                    }
                ]
            },
            {
                "define": {
                    "en": "interesting and exciting details or qualities",
                    "vi": "những chi tiết hoặc phẩm chất thú vị và hấp dẫn"
                },
                "examples": [
                    {
                        "en": "The old town is full of color and attractions.",
                        "vi": "Khu phố cổ đầy màu sắc và hấp dẫn."
                    },
                    {
                        "en": "to give/lend color to something (= make it brighter, more interesting, etc.)",
                        "vi": "để cung cấp / cho mượn màu sắc cho thứ gì đó (= làm cho nó sáng hơn, thú vị hơn, v.v.)"
                    },
                    {
                        "en": "Her acting added warmth and color to the production.",
                        "vi": "Diễn xuất của cô ấy đã tạo thêm sự ấm áp và màu sắc cho quá trình sản xuất."
                    }
                ]
            },
            {
                "define": {
                    "en": "the particular colors that are used on clothes, flags, etc. to represent a team, school, political party or country",
                    "vi": "các màu cụ thể được sử dụng trên quần áo, cờ, v.v. để đại diện cho một đội, trường học, đảng chính trị hoặc quốc gia"
                },
                "examples": [
                    {
                        "en": "Red and white are the team colors.",
                        "vi": "Màu đỏ và trắng là màu của đội."
                    },
                    {
                        "en": "Spain’s national colors",
                        "vi": "Màu quốc gia của Tây Ban Nha"
                    },
                    {
                        "en": "(figurative) There are people of different political colors on the committee.",
                        "vi": "(nghĩa bóng) Có những người mang màu sắc chính trị khác nhau trong ủy ban."
                    }
                ]
            },
            {
                "define": {
                    "en": "a flag, badge, etc. that represents a team, country, ship, etc.",
                    "vi": "cờ, huy hiệu, v.v. đại diện cho đội, quốc gia, tàu, v.v."
                },
                "examples": [
                    {
                        "en": "sailing under the French colors",
                        "vi": "chèo thuyền dưới màu sắc của Pháp"
                    }
                ]
            },
            {
                "define": {
                    "en": "to say publicly and clearly what you believe or who you support",
                    "vi": "nói một cách công khai và rõ ràng những gì bạn tin tưởng hoặc những người bạn ủng hộ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "who is not white",
                    "vi": "ai không da trắng"
                },
                "examples": [
                    {
                        "en": "people of color",
                        "vi": "người da màu"
                    },
                    {
                        "en": "As a woman of color, this concerns me.",
                        "vi": "Là một phụ nữ da màu, điều này khiến tôi quan tâm."
                    },
                    {
                        "en": "a literary prize for writers of color",
                        "vi": "một giải thưởng văn học cho các nhà văn da màu"
                    },
                    {
                        "en": "students of color",
                        "vi": "sinh viên da màu"
                    }
                ]
            },
            {
                "define": {
                    "en": "to make sure that somebody has enough money to pay for something",
                    "vi": "để đảm bảo rằng ai đó có đủ tiền để trả cho một thứ gì đó"
                },
                "examples": [
                    {
                        "en": "You need to see the color of his money before you sell him the car.",
                        "vi": "Bạn cần phải xem màu tiền của anh ta trước khi bạn bán xe cho anh ta."
                    }
                ]
            },
            {
                "define": {
                    "en": "your real character, rather than the one that you usually allow other people to see",
                    "vi": "nhân vật thực của bạn, thay vì nhân vật mà bạn thường cho phép người khác nhìn thấy"
                },
                "examples": [
                    {
                        "en": "It was only after they got married that he showed himself in his true colors.",
                        "vi": "Chỉ sau khi họ kết hôn, anh ấy mới thể hiện bản thân mình trong màu sắc thực sự của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "very well; with a very high mark",
                    "vi": "rất tốt; với một điểm rất cao"
                },
                "examples": [
                    {
                        "en": "She passed the exam with flying colors.",
                        "vi": "Cô ấy đã vượt qua kỳ thi với màu sắc bay bổng."
                    }
                ]
            }
        ]
    },
    {
        "id": "6645cdea7d6047ef8b57c9406f370231",
        "word": "of colour",
        "pos": "idiom",
        "level": "a1",
        "phonetic": {
            "uk": "/ˈkʌlə(r)/",
            "us": "/ˈkʌlər/"
        },
        "nearby": [
            {
                "word": "colostomy",
                "pos": "noun"
            },
            {
                "word": "colostrum",
                "pos": "noun"
            },
            {
                "word": "colour",
                "pos": "noun"
            },
            {
                "word": "colour",
                "pos": "verb"
            },
            {
                "word": "colourant",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the appearance that things have that results from the way in which they reflect light. Red, orange and green are colours.",
                    "vi": "vẻ ngoài mà mọi thứ có được là kết quả của cách mà chúng phản xạ ánh sáng. Màu đỏ, cam và xanh lá cây là các màu."
                },
                "examples": [
                    {
                        "en": "What's your favourite colour?",
                        "vi": "Bạn thích màu nào?"
                    },
                    {
                        "en": "bright/vibrant/bold colours",
                        "vi": "màu sắc tươi sáng / rực rỡ / đậm"
                    },
                    {
                        "en": "She always wears dark colours.",
                        "vi": "Cô ấy luôn mặc đồ tối màu."
                    },
                    {
                        "en": "I'd like to paint this room in a lighter colour.",
                        "vi": "Tôi muốn sơn căn phòng này bằng màu sáng hơn."
                    },
                    {
                        "en": "a warm colour palette (= the range of colours used for something)",
                        "vi": "bảng màu ấm (= dải màu được sử dụng cho một thứ gì đó)"
                    },
                    {
                        "en": "available in 12 different colours",
                        "vi": "có sẵn 12 màu khác nhau"
                    },
                    {
                        "en": "the colour of the sky",
                        "vi": "màu sắc của bầu trời"
                    },
                    {
                        "en": "skin/hair colour",
                        "vi": "màu da / tóc"
                    },
                    {
                        "en": "in colour red/green/blue, etc. in colour",
                        "vi": "màu đỏ / xanh lá cây / xanh lam, v.v. trong màu"
                    },
                    {
                        "en": "Her hair is a reddish-brown colour.",
                        "vi": "Tóc cô ấy có màu nâu đỏ."
                    },
                    {
                        "en": "The stage lights changed colour from red to blue.",
                        "vi": "Đèn sân khấu đổi màu từ đỏ sang xanh."
                    },
                    {
                        "en": "Foods which go through a factory process lose much of their colour, flavour and texture.",
                        "vi": "Thực phẩm trải qua quá trình chế biến tại nhà máy sẽ mất đi nhiều màu sắc, hương vị và kết cấu."
                    }
                ]
            },
            {
                "define": {
                    "en": "the use of all the colours, not only black and white",
                    "vi": "việc sử dụng tất cả các màu, không chỉ đen và trắng"
                },
                "examples": [
                    {
                        "en": "the introduction of colour television in the UK in 1967",
                        "vi": "sự ra đời của tivi màu ở Anh vào năm 1967"
                    },
                    {
                        "en": "colour photographs",
                        "vi": "ảnh màu"
                    },
                    {
                        "en": "a colour printer",
                        "vi": "một máy in màu"
                    },
                    {
                        "en": "a full-colour brochure",
                        "vi": "một tờ rơi đầy màu sắc"
                    },
                    {
                        "en": "in colour Do you dream in colour?",
                        "vi": "màu sắc Bạn có mơ thấy màu sắc không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "the colour of a person’s skin, when it shows the group of people they belong to",
                    "vi": "màu da của một người, khi nó thể hiện nhóm người mà họ thuộc về"
                },
                "examples": [
                    {
                        "en": "Discrimination on the grounds of race, religion or colour was outlawed.",
                        "vi": "Phân biệt đối xử vì lý do chủng tộc, tôn giáo hoặc màu da đã bị cấm."
                    },
                    {
                        "en": "people of all ages, genders, creeds and colours",
                        "vi": "mọi người ở mọi lứa tuổi, giới tính, tín ngưỡng và màu sắc"
                    },
                    {
                        "en": "to discriminate on the basis of colour",
                        "vi": "để phân biệt dựa trên màu sắc"
                    },
                    {
                        "en": "Can we seriously believe people who claim not to see colour?",
                        "vi": "Chúng ta có thể nghiêm túc tin những người tuyên bố không nhìn thấy màu sắc không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "a red or pink colour in somebody’s face, especially when it shows that they look healthy or that they are embarrassed",
                    "vi": "màu đỏ hoặc hồng trên khuôn mặt của ai đó, đặc biệt là khi điều đó cho thấy họ trông khỏe mạnh hoặc họ đang xấu hổ"
                },
                "examples": [
                    {
                        "en": "The fresh air brought colour to their cheeks.",
                        "vi": "Không khí trong lành đã mang lại màu sắc cho đôi má của họ."
                    },
                    {
                        "en": "Colour flooded her face when she thought of what had happened.",
                        "vi": "Màu sắc tràn ngập trên khuôn mặt cô khi cô nghĩ về những gì đã xảy ra."
                    },
                    {
                        "en": "His face was drained of colour (= he looked pale and ill).",
                        "vi": "Mặt anh ta tái mét (= trông anh ta xanh xao và ốm yếu)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a substance that is used to give colour to something",
                    "vi": "một chất được sử dụng để tạo màu cho một thứ gì đó"
                },
                "examples": [
                    {
                        "en": "a semi-permanent hair colour that lasts six to eight washes",
                        "vi": "màu tóc bán vĩnh viễn kéo dài từ sáu đến tám lần gội"
                    },
                    {
                        "en": "This colour runs, so wash the shirt separately.",
                        "vi": "Màu này chạy, nên giặt riêng áo."
                    }
                ]
            },
            {
                "define": {
                    "en": "interesting and exciting details or qualities",
                    "vi": "những chi tiết hoặc phẩm chất thú vị và hấp dẫn"
                },
                "examples": [
                    {
                        "en": "The old town is full of colour and attractions.",
                        "vi": "Khu phố cổ đầy màu sắc và hấp dẫn."
                    },
                    {
                        "en": "Her acting added warmth and colour to the production.",
                        "vi": "Diễn xuất của cô ấy đã tạo thêm sự ấm áp và màu sắc cho quá trình sản xuất."
                    },
                    {
                        "en": "to add/give/lend colour to something (= make it brighter, more interesting, etc.)",
                        "vi": "để thêm / cho / cho mượn màu sắc cho thứ gì đó (= làm cho nó sáng hơn, thú vị hơn, v.v.)"
                    }
                ]
            },
            {
                "define": {
                    "en": "the particular colours that are used on clothes, flags, etc. to represent a team, school, political party or country",
                    "vi": "các màu cụ thể được sử dụng trên quần áo, cờ, v.v. để đại diện cho một đội, trường học, đảng chính trị hoặc quốc gia"
                },
                "examples": [
                    {
                        "en": "Red and white are the team colours.",
                        "vi": "Màu đỏ và trắng là màu của đội."
                    },
                    {
                        "en": "Spain’s national colours",
                        "vi": "Màu quốc gia của Tây Ban Nha"
                    },
                    {
                        "en": "(figurative) There are people of different political colours on the committee.",
                        "vi": "(nghĩa bóng) Có những người mang màu sắc chính trị khác nhau trong ủy ban."
                    }
                ]
            },
            {
                "define": {
                    "en": "a flag, badge, etc. that represents a team, country, ship, etc.",
                    "vi": "cờ, huy hiệu, v.v. đại diện cho đội, quốc gia, tàu, v.v."
                },
                "examples": [
                    {
                        "en": "Most buildings had a flagpole with the national colours flying.",
                        "vi": "Hầu hết các tòa nhà đều có cột cờ với màu cờ sắc áo tung bay."
                    },
                    {
                        "en": "sailing under the French colours",
                        "vi": "chèo thuyền dưới màu sắc của Pháp"
                    }
                ]
            },
            {
                "define": {
                    "en": "to make something seem true or likely",
                    "vi": "để làm cho một cái gì đó có vẻ đúng hoặc có khả năng"
                },
                "examples": [
                    {
                        "en": "Most of the available evidence lends colour to this view.",
                        "vi": "Hầu hết các bằng chứng có sẵn đều cho thấy quan điểm này có màu sắc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to say publicly and clearly what you believe or who you support",
                    "vi": "nói một cách công khai và rõ ràng những gì bạn tin tưởng hoặc những người bạn ủng hộ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "who is not white",
                    "vi": "ai không da trắng"
                },
                "examples": [
                    {
                        "en": "people of colour",
                        "vi": "người da màu"
                    },
                    {
                        "en": "As a woman of colour, this concerns me.",
                        "vi": "Là một phụ nữ da màu, điều này khiến tôi quan tâm."
                    },
                    {
                        "en": "a literary prize for writers of colour",
                        "vi": "một giải thưởng văn học cho các nhà văn da màu"
                    },
                    {
                        "en": "students of colour",
                        "vi": "sinh viên da màu"
                    }
                ]
            },
            {
                "define": {
                    "en": "to make sure that somebody has enough money to pay for something",
                    "vi": "để đảm bảo rằng ai đó có đủ tiền để trả cho một thứ gì đó"
                },
                "examples": [
                    {
                        "en": "You need to see the colour of his money before you sell him the car.",
                        "vi": "Bạn cần phải xem màu tiền của anh ta trước khi bạn bán xe cho anh ta."
                    }
                ]
            },
            {
                "define": {
                    "en": "your real character, rather than the one that you usually allow other people to see",
                    "vi": "nhân vật thực của bạn, thay vì nhân vật mà bạn thường cho phép người khác nhìn thấy"
                },
                "examples": [
                    {
                        "en": "It was only after they got married that he showed himself in his true colours.",
                        "vi": "Chỉ sau khi họ kết hôn, anh ấy mới thể hiện bản thân mình trong màu sắc thực sự của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "very well; with a very high mark",
                    "vi": "rất tốt; với một điểm rất cao"
                },
                "examples": [
                    {
                        "en": "She passed the exam with flying colours.",
                        "vi": "Cô ấy đã vượt qua kỳ thi với màu sắc bay bổng."
                    }
                ]
            }
        ]
    },
    {
        "id": "586e21b7934747f48f02b9d2ec78ab86",
        "word": "white",
        "pos": "adjective",
        "level": "a1",
        "phonetic": {
            "uk": "/waɪt/",
            "us": "/waɪt/"
        },
        "nearby": [
            {
                "word": "Whitaker's Almanack",
                "pos": ""
            },
            {
                "word": "Whitbread",
                "pos": ""
            },
            {
                "word": "white",
                "pos": "adjective"
            },
            {
                "word": "white",
                "pos": "noun"
            },
            {
                "word": "E B White",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "having the colour of fresh snow or of milk",
                    "vi": "có màu của tuyết tươi hoặc sữa"
                },
                "examples": [
                    {
                        "en": "a crisp white shirt",
                        "vi": "áo sơ mi trắng sắc nét"
                    },
                    {
                        "en": "a white dress",
                        "vi": "một chiếc váy trắng"
                    },
                    {
                        "en": "a plant with beautiful white flowers",
                        "vi": "cây có hoa màu trắng đẹp"
                    },
                    {
                        "en": "The suspect was seen driving a white van.",
                        "vi": "Nghi phạm được nhìn thấy đang lái một chiếc xe van màu trắng."
                    },
                    {
                        "en": "a spacious room with white walls and large windows",
                        "vi": "một căn phòng rộng rãi với những bức tường trắng và cửa sổ lớn"
                    },
                    {
                        "en": "a set of perfect white teeth",
                        "vi": "một bộ răng trắng hoàn hảo"
                    },
                    {
                        "en": "His hair was as white as snow.",
                        "vi": "Tóc anh trắng như tuyết."
                    },
                    {
                        "en": "The horse was almost pure white in colour.",
                        "vi": "Con ngựa gần như có màu trắng tinh."
                    }
                ]
            },
            {
                "define": {
                    "en": "belonging to or connected with a group of people who have pale skin, especially people who come from or whose ancestors came from Europe",
                    "vi": "thuộc hoặc có liên hệ với một nhóm người có làn da nhợt nhạt, đặc biệt là những người đến từ hoặc có tổ tiên đến từ Châu Âu"
                },
                "examples": [
                    {
                        "en": "white middle-class families",
                        "vi": "gia đình trung lưu da trắng"
                    },
                    {
                        "en": "She writes about her experiences as a black girl in a predominantly white city.",
                        "vi": "Cô ấy viết về những trải nghiệm của mình khi là một cô gái da đen ở một thành phố chủ yếu là người da trắng."
                    },
                    {
                        "en": "He grew up in a mostly white neighbourhood.",
                        "vi": "Anh lớn lên trong một khu phố chủ yếu là người da trắng."
                    },
                    {
                        "en": "middle-aged white men in suits",
                        "vi": "người đàn ông da trắng trung niên mặc vest"
                    },
                    {
                        "en": "policies intended to appeal to white working-class voters",
                        "vi": "các chính sách nhằm thu hút các cử tri thuộc tầng lớp lao động da trắng"
                    }
                ]
            },
            {
                "define": {
                    "en": "pale because of emotion or illness",
                    "vi": "nhợt nhạt vì cảm xúc hoặc bệnh tật"
                },
                "examples": [
                    {
                        "en": "white with something white with shock",
                        "vi": "màu trắng với một cái gì đó màu trắng với sự sốc"
                    },
                    {
                        "en": "Zack's face turned white and his jaw dropped.",
                        "vi": "Mặt Zack trở nên trắng bệch và quai hàm cụp xuống."
                    },
                    {
                        "en": "She went white as a sheet when she heard the news.",
                        "vi": "Cô ấy trắng như tờ khi nghe tin."
                    },
                    {
                        "en": "He looked red-eyed and white-faced, slightly fearful and anxious.",
                        "vi": "Anh ta trông có đôi mắt đỏ và khuôn mặt trắng bệch, hơi sợ hãi và lo lắng."
                    }
                ]
            },
            {
                "define": {
                    "en": "with milk added",
                    "vi": "có thêm sữa"
                },
                "examples": [
                    {
                        "en": "Two white coffees, please.",
                        "vi": "Làm ơn cho hai ly cà phê trắng."
                    },
                    {
                        "en": "Do you take your coffee black or white?",
                        "vi": "Bạn uống cà phê đen hay trắng?"
                    }
                ]
            }
        ]
    },
    {
        "id": "3a82f250f8524adebedcf488b1374514",
        "word": "African",
        "pos": "adjective",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈæfrɪkən/",
            "us": "/ˈæfrɪkən/"
        },
        "nearby": [
            {
                "word": "afresh",
                "pos": "adverb"
            },
            {
                "word": "Africa",
                "pos": "noun"
            },
            {
                "word": "African",
                "pos": "adjective"
            },
            {
                "word": "African",
                "pos": "noun"
            },
            {
                "word": "African American",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "of or connected with Africa",
                    "vi": "của hoặc kết nối với Châu Phi"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "223b042d08414cd99555166bdc81fe72",
        "word": "African",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈæfrɪkən/",
            "us": "/ˈæfrɪkən/"
        },
        "nearby": [
            {
                "word": "Africa",
                "pos": "noun"
            },
            {
                "word": "African",
                "pos": "adjective"
            },
            {
                "word": "African",
                "pos": "noun"
            },
            {
                "word": "African American",
                "pos": "noun"
            },
            {
                "word": "African American",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person from Africa, especially a black person",
                    "vi": "một người đến từ Châu Phi, đặc biệt là một người da đen"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a1a269bb13404c32a85b3fd32b8abe80",
        "word": "Asian",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈeɪʒn/",
            "us": "/ˈeɪʒn/"
        },
        "nearby": [
            {
                "word": "Asia",
                "pos": "noun"
            },
            {
                "word": "Asia Minor",
                "pos": "noun"
            },
            {
                "word": "Asian",
                "pos": "noun"
            },
            {
                "word": "Asian",
                "pos": "adjective"
            },
            {
                "word": "Asian American",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person from Asia, or whose family originally came from Asia",
                    "vi": "một người đến từ Châu Á hoặc gia đình của họ ban đầu đến từ Châu Á"
                },
                "examples": [
                    {
                        "en": "British Asians",
                        "vi": "Người Anh gốc Á"
                    }
                ]
            }
        ]
    },
    {
        "id": "af44200ecffd453c9c658680fcdb1d32",
        "word": "Asian",
        "pos": "adjective",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈeɪʒn/",
            "us": "/ˈeɪʒn/"
        },
        "nearby": [
            {
                "word": "Asia Minor",
                "pos": "noun"
            },
            {
                "word": "Asian",
                "pos": "noun"
            },
            {
                "word": "Asian",
                "pos": "adjective"
            },
            {
                "word": "Asian American",
                "pos": "noun"
            },
            {
                "word": "Asian-American",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "of or connected with Asia",
                    "vi": "trong số hoặc kết nối với Châu Á"
                },
                "examples": [
                    {
                        "en": "Asian music",
                        "vi": "Âm nhạc châu á"
                    }
                ]
            }
        ]
    },
    {
        "id": "8dcf75cd0e4b466597c350d3c10fefb6",
        "word": "background",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈbækɡraʊnd/",
            "us": "/ˈbækɡraʊnd/"
        },
        "nearby": [
            {
                "word": "back-formation",
                "pos": "noun"
            },
            {
                "word": "backgammon",
                "pos": "noun"
            },
            {
                "word": "background",
                "pos": "noun"
            },
            {
                "word": "backhand",
                "pos": "noun"
            },
            {
                "word": "backhanded",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the details of a person’s family, education, experience, etc.",
                    "vi": "thông tin chi tiết về gia đình, học vấn, kinh nghiệm của một người, v.v."
                },
                "examples": [
                    {
                        "en": "somebody's ethnic/genetic/cultural background",
                        "vi": "nền tảng dân tộc / di truyền / văn hóa của ai đó"
                    },
                    {
                        "en": "somebody's family/educational background",
                        "vi": "gia đình / nền tảng giáo dục của ai đó"
                    },
                    {
                        "en": "The job would suit someone with a business background.",
                        "vi": "Công việc sẽ phù hợp với những người có nền tảng kinh doanh."
                    },
                    {
                        "en": "We come from very different backgrounds but we get on well.",
                        "vi": "Chúng tôi đến từ những hoàn cảnh rất khác nhau nhưng chúng tôi hòa hợp với nhau."
                    },
                    {
                        "en": "background in something She has a background in journalism.",
                        "vi": "background in something Cô ấy có kiến thức về báo chí."
                    },
                    {
                        "en": "In the future, we will require background checks on airport employees.",
                        "vi": "Trong tương lai, chúng tôi sẽ yêu cầu kiểm tra lý lịch đối với nhân viên sân bay."
                    }
                ]
            },
            {
                "define": {
                    "en": "the circumstances or past events that help explain why something is how it is; information about these",
                    "vi": "hoàn cảnh hoặc sự kiện trong quá khứ giúp giải thích tại sao một cái gì đó lại như thế nào; thông tin về những"
                },
                "examples": [
                    {
                        "en": "I'm including a little background information on the situation.",
                        "vi": "Tôi đang cung cấp một chút thông tin cơ bản về tình hình."
                    },
                    {
                        "en": "background to something The book explains the complex historical background to the war.",
                        "vi": "background to something Cuốn sách giải thích bối cảnh lịch sử phức tạp của cuộc chiến."
                    },
                    {
                        "en": "against a background of something The elections are taking place against a background of violence.",
                        "vi": "chống lại bối cảnh của một cái gì đó Các cuộc bầu cử đang diễn ra trên nền của bạo lực."
                    },
                    {
                        "en": "background on something Our reporter can now provide more background on this story.",
                        "vi": "thông tin cơ bản về điều gì đó Phóng viên của chúng tôi hiện có thể cung cấp thêm thông tin cơ bản về câu chuyện này."
                    },
                    {
                        "en": "Can you give me more background on the company?",
                        "vi": "Bạn có thể cho tôi biết thêm thông tin về công ty được không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "the part of a picture, photograph or view behind the main objects, people, etc.",
                    "vi": "phần của một bức tranh, ảnh chụp hoặc khung cảnh phía sau các đối tượng chính, con người, v.v."
                },
                "examples": [
                    {
                        "en": "in the background a photograph with trees in the background",
                        "vi": "trong nền một bức ảnh với cây trong nền"
                    },
                    {
                        "en": "A shadowy figure is visible in the background of the scene.",
                        "vi": "Một hình bóng mờ có thể nhìn thấy trong nền của cảnh."
                    },
                    {
                        "en": "against the… background The areas of water stood out against the dark background.",
                        "vi": "chống lại nền… Các vùng nước nổi bật trên nền tối."
                    }
                ]
            },
            {
                "define": {
                    "en": "a position in which people are not paying attention to somebody/something or not as much attention as they are paying to somebody/something else",
                    "vi": "một vị trí trong đó mọi người không chú ý đến ai đó / điều gì đó hoặc không chú ý nhiều như họ đang chú ý đến ai đó / điều gì đó khác"
                },
                "examples": [
                    {
                        "en": "The camerawork, the background music and the locations all contribute to the mood of the film.",
                        "vi": "Cảnh quay, nhạc nền và địa điểm đều góp phần tạo nên tâm trạng của bộ phim."
                    },
                    {
                        "en": "There was a lot of background noise (= that you could hear, but were not listening to).",
                        "vi": "Có rất nhiều tiếng ồn xung quanh (= bạn có thể nghe thấy nhưng không nghe thấy)."
                    },
                    {
                        "en": "background radiation",
                        "vi": "bức xạ nền"
                    },
                    {
                        "en": "in the background He prefers to remain in the background and let his assistant talk to the press.",
                        "vi": "trong nền Anh ấy muốn ở trong nền và để trợ lý của mình nói chuyện với báo chí."
                    },
                    {
                        "en": "A piano was playing gently in the background.",
                        "vi": "Một cây đàn piano đang nhẹ nhàng chơi trong nền."
                    },
                    {
                        "en": "Danger was always lurking in the background.",
                        "vi": "Nguy hiểm luôn rình rập ở hậu cảnh."
                    },
                    {
                        "en": "The issue has recently faded into the background.",
                        "vi": "Vấn đề gần đây đã trở nên mờ nhạt."
                    },
                    {
                        "en": "After the first scene, his character is relegated to the background.",
                        "vi": "Sau cảnh đầu tiên, nhân vật của anh ấy được đưa xuống nền."
                    }
                ]
            },
            {
                "define": {
                    "en": "a colour or design on which something is painted, drawn, etc.",
                    "vi": "một màu sắc hoặc thiết kế mà trên đó một cái gì đó được vẽ, vẽ, v.v."
                },
                "examples": [
                    {
                        "en": "on a… background The name of the company is written in red on a white background.",
                        "vi": "trên nền… Tên công ty được viết bằng màu đỏ trên nền trắng."
                    },
                    {
                        "en": "against a… background Most paintings look good against a neutral background colour.",
                        "vi": "chống lại nền… Hầu hết các bức tranh trông đẹp khi có màu nền trung tính."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to refer to tasks or processes that the user is not actively working on at the present time",
                    "vi": "được sử dụng để chỉ các nhiệm vụ hoặc quy trình mà người dùng không tích cực làm việc tại thời điểm hiện tại"
                },
                "examples": [
                    {
                        "en": "in the background Programs can be left running in the background.",
                        "vi": "trong nền Các chương trình có thể được để chạy trong nền."
                    },
                    {
                        "en": "Find and kill unwanted background processes like viruses and trojans.",
                        "vi": "Tìm và diệt các tiến trình nền không mong muốn như vi rút và trojan."
                    }
                ]
            },
            {
                "define": {
                    "en": "to behave quietly when you are with a group of people so that they do not notice you",
                    "vi": "cư xử nhẹ nhàng khi bạn ở với một nhóm người để họ không chú ý đến bạn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "57f4a8549b214e7da4f0246e358ac2a6",
        "word": "color",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈkʌlə(r)/",
            "us": "/ˈkʌlər/"
        },
        "nearby": [
            {
                "word": "colony",
                "pos": "noun"
            },
            {
                "word": "colophon",
                "pos": "noun"
            },
            {
                "word": "color",
                "pos": "noun"
            },
            {
                "word": "color",
                "pos": "verb"
            },
            {
                "word": "Colorado",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the appearance that things have that results from the way in which they reflect light. Red, orange and green are colors.",
                    "vi": "vẻ ngoài mà mọi thứ có được là kết quả của cách mà chúng phản xạ ánh sáng. Màu đỏ, cam và xanh lá cây là các màu."
                },
                "examples": [
                    {
                        "en": "What's your favorite color?",
                        "vi": "Màu yêu thích của bạn là gì?"
                    },
                    {
                        "en": "bright/vibrant colors",
                        "vi": "màu sắc tươi sáng / rực rỡ"
                    },
                    {
                        "en": "dark/light colors",
                        "vi": "màu đậm / nhạt"
                    },
                    {
                        "en": "She always wears dark colors.",
                        "vi": "Cô ấy luôn mặc đồ tối màu."
                    },
                    {
                        "en": "vivid/rich/bold colors",
                        "vi": "màu sắc sống động / phong phú / đậm"
                    },
                    {
                        "en": "a warm color palette (= the range of colors used for something)",
                        "vi": "bảng màu ấm (= dải màu được sử dụng cho một thứ gì đó)"
                    },
                    {
                        "en": "available in 12 different colors",
                        "vi": "có sẵn 12 màu khác nhau"
                    },
                    {
                        "en": "the color of the sky",
                        "vi": "màu sắc của bầu trời"
                    },
                    {
                        "en": "skin/hair/eye color",
                        "vi": "màu da / tóc / mắt"
                    },
                    {
                        "en": "in color red/green/blue in color",
                        "vi": "màu đỏ / xanh lá cây / xanh lam"
                    },
                    {
                        "en": "Her hair is a reddish-brown color.",
                        "vi": "Tóc cô ấy có màu nâu đỏ."
                    },
                    {
                        "en": "The stage lights changed color from red to blue.",
                        "vi": "Đèn sân khấu đổi màu từ đỏ sang xanh."
                    },
                    {
                        "en": "Foods that go through a factory process lose much of their color, flavor and texture.",
                        "vi": "Thực phẩm trải qua quá trình chế biến tại nhà máy bị mất đi nhiều màu sắc, hương vị và kết cấu."
                    }
                ]
            },
            {
                "define": {
                    "en": "the use of all the colors, not only black and white",
                    "vi": "việc sử dụng tất cả các màu, không chỉ đen và trắng"
                },
                "examples": [
                    {
                        "en": "the introduction of color television in the 1960s",
                        "vi": "sự ra đời của tivi màu vào những năm 1960"
                    },
                    {
                        "en": "color photographs",
                        "vi": "ảnh màu"
                    },
                    {
                        "en": "a color printer",
                        "vi": "một máy in màu"
                    },
                    {
                        "en": "a full-color brochure",
                        "vi": "một tờ rơi đầy màu sắc"
                    },
                    {
                        "en": "in color Do you dream in color?",
                        "vi": "màu sắc Bạn có mơ thấy màu sắc không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "the color of a person’s skin, when it shows the race they belong to",
                    "vi": "màu da của một người, khi nó thể hiện chủng tộc mà họ thuộc về"
                },
                "examples": [
                    {
                        "en": "Discrimination on the grounds of race, religion or color was outlawed.",
                        "vi": "Phân biệt đối xử vì lý do chủng tộc, tôn giáo hoặc màu da đã bị cấm."
                    },
                    {
                        "en": "people of all ages, genders, creeds and colors",
                        "vi": "mọi người ở mọi lứa tuổi, giới tính, tín ngưỡng và màu sắc"
                    },
                    {
                        "en": "Can we seriously believe people who claim not to see color?",
                        "vi": "Chúng ta có thể nghiêm túc tin những người tuyên bố không nhìn thấy màu sắc không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "a red or pink color in somebody’s face, especially when it shows that they look healthy or that they are embarrassed",
                    "vi": "màu đỏ hoặc hồng trên khuôn mặt của ai đó, đặc biệt là khi điều đó cho thấy họ trông khỏe mạnh hoặc họ đang xấu hổ"
                },
                "examples": [
                    {
                        "en": "The fresh air brought color to their cheeks.",
                        "vi": "Không khí trong lành đã mang lại màu sắc cho đôi má của họ."
                    },
                    {
                        "en": "Color flooded her face when she thought of what had happened.",
                        "vi": "Màu sắc tràn ngập trên khuôn mặt cô khi cô nghĩ về những gì đã xảy ra."
                    },
                    {
                        "en": "His face was drained of color (= he looked pale and ill).",
                        "vi": "Mặt anh ta tái mét (= trông anh ta xanh xao và ốm yếu)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a substance that is used to give color to something",
                    "vi": "một chất được sử dụng để tạo màu cho một thứ gì đó"
                },
                "examples": [
                    {
                        "en": "a semi-permanent hair color that lasts six to eight washes",
                        "vi": "màu tóc bán vĩnh viễn kéo dài từ sáu đến tám lần gội"
                    },
                    {
                        "en": "This color runs, so wash the shirt separately.",
                        "vi": "Màu này chạy, nên giặt riêng áo."
                    }
                ]
            },
            {
                "define": {
                    "en": "interesting and exciting details or qualities",
                    "vi": "những chi tiết hoặc phẩm chất thú vị và hấp dẫn"
                },
                "examples": [
                    {
                        "en": "The old town is full of color and attractions.",
                        "vi": "Khu phố cổ đầy màu sắc và hấp dẫn."
                    },
                    {
                        "en": "to give/lend color to something (= make it brighter, more interesting, etc.)",
                        "vi": "để cung cấp / cho mượn màu sắc cho thứ gì đó (= làm cho nó sáng hơn, thú vị hơn, v.v.)"
                    },
                    {
                        "en": "Her acting added warmth and color to the production.",
                        "vi": "Diễn xuất của cô ấy đã tạo thêm sự ấm áp và màu sắc cho quá trình sản xuất."
                    }
                ]
            },
            {
                "define": {
                    "en": "the particular colors that are used on clothes, flags, etc. to represent a team, school, political party or country",
                    "vi": "các màu cụ thể được sử dụng trên quần áo, cờ, v.v. để đại diện cho một đội, trường học, đảng chính trị hoặc quốc gia"
                },
                "examples": [
                    {
                        "en": "Red and white are the team colors.",
                        "vi": "Màu đỏ và trắng là màu của đội."
                    },
                    {
                        "en": "Spain’s national colors",
                        "vi": "Màu quốc gia của Tây Ban Nha"
                    },
                    {
                        "en": "(figurative) There are people of different political colors on the committee.",
                        "vi": "(nghĩa bóng) Có những người mang màu sắc chính trị khác nhau trong ủy ban."
                    }
                ]
            },
            {
                "define": {
                    "en": "a flag, badge, etc. that represents a team, country, ship, etc.",
                    "vi": "cờ, huy hiệu, v.v. đại diện cho đội, quốc gia, tàu, v.v."
                },
                "examples": [
                    {
                        "en": "sailing under the French colors",
                        "vi": "chèo thuyền dưới màu sắc của Pháp"
                    }
                ]
            },
            {
                "define": {
                    "en": "to say publicly and clearly what you believe or who you support",
                    "vi": "nói một cách công khai và rõ ràng những gì bạn tin tưởng hoặc những người bạn ủng hộ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "who is not white",
                    "vi": "ai không da trắng"
                },
                "examples": [
                    {
                        "en": "people of color",
                        "vi": "người da màu"
                    },
                    {
                        "en": "As a woman of color, this concerns me.",
                        "vi": "Là một phụ nữ da màu, điều này khiến tôi quan tâm."
                    },
                    {
                        "en": "a literary prize for writers of color",
                        "vi": "một giải thưởng văn học cho các nhà văn da màu"
                    },
                    {
                        "en": "students of color",
                        "vi": "sinh viên da màu"
                    }
                ]
            },
            {
                "define": {
                    "en": "to make sure that somebody has enough money to pay for something",
                    "vi": "để đảm bảo rằng ai đó có đủ tiền để trả cho một thứ gì đó"
                },
                "examples": [
                    {
                        "en": "You need to see the color of his money before you sell him the car.",
                        "vi": "Bạn cần phải xem màu tiền của anh ta trước khi bạn bán xe cho anh ta."
                    }
                ]
            },
            {
                "define": {
                    "en": "your real character, rather than the one that you usually allow other people to see",
                    "vi": "nhân vật thực của bạn, thay vì nhân vật mà bạn thường cho phép người khác nhìn thấy"
                },
                "examples": [
                    {
                        "en": "It was only after they got married that he showed himself in his true colors.",
                        "vi": "Chỉ sau khi họ kết hôn, anh ấy mới thể hiện bản thân mình trong màu sắc thực sự của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "very well; with a very high mark",
                    "vi": "rất tốt; với một điểm rất cao"
                },
                "examples": [
                    {
                        "en": "She passed the exam with flying colors.",
                        "vi": "Cô ấy đã vượt qua kỳ thi với màu sắc bay bổng."
                    }
                ]
            }
        ]
    },
    {
        "id": "88d2a80c360349f09d43971cd1bd2705",
        "word": "colour",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈkʌlə(r)/",
            "us": "/ˈkʌlər/"
        },
        "nearby": [
            {
                "word": "colostomy",
                "pos": "noun"
            },
            {
                "word": "colostrum",
                "pos": "noun"
            },
            {
                "word": "colour",
                "pos": "noun"
            },
            {
                "word": "colour",
                "pos": "verb"
            },
            {
                "word": "colourant",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the appearance that things have that results from the way in which they reflect light. Red, orange and green are colours.",
                    "vi": "vẻ ngoài mà mọi thứ có được là kết quả của cách mà chúng phản xạ ánh sáng. Màu đỏ, cam và xanh lá cây là các màu."
                },
                "examples": [
                    {
                        "en": "What's your favourite colour?",
                        "vi": "Bạn thích màu nào?"
                    },
                    {
                        "en": "bright/vibrant/bold colours",
                        "vi": "màu sắc tươi sáng / rực rỡ / đậm"
                    },
                    {
                        "en": "She always wears dark colours.",
                        "vi": "Cô ấy luôn mặc đồ tối màu."
                    },
                    {
                        "en": "I'd like to paint this room in a lighter colour.",
                        "vi": "Tôi muốn sơn căn phòng này bằng màu sáng hơn."
                    },
                    {
                        "en": "a warm colour palette (= the range of colours used for something)",
                        "vi": "bảng màu ấm (= dải màu được sử dụng cho một thứ gì đó)"
                    },
                    {
                        "en": "available in 12 different colours",
                        "vi": "có sẵn 12 màu khác nhau"
                    },
                    {
                        "en": "the colour of the sky",
                        "vi": "màu sắc của bầu trời"
                    },
                    {
                        "en": "skin/hair colour",
                        "vi": "màu da / tóc"
                    },
                    {
                        "en": "in colour red/green/blue, etc. in colour",
                        "vi": "màu đỏ / xanh lá cây / xanh lam, v.v. trong màu"
                    },
                    {
                        "en": "Her hair is a reddish-brown colour.",
                        "vi": "Tóc cô ấy có màu nâu đỏ."
                    },
                    {
                        "en": "The stage lights changed colour from red to blue.",
                        "vi": "Đèn sân khấu đổi màu từ đỏ sang xanh."
                    },
                    {
                        "en": "Foods which go through a factory process lose much of their colour, flavour and texture.",
                        "vi": "Thực phẩm trải qua quá trình chế biến tại nhà máy sẽ mất đi nhiều màu sắc, hương vị và kết cấu."
                    }
                ]
            },
            {
                "define": {
                    "en": "the use of all the colours, not only black and white",
                    "vi": "việc sử dụng tất cả các màu, không chỉ đen và trắng"
                },
                "examples": [
                    {
                        "en": "the introduction of colour television in the UK in 1967",
                        "vi": "sự ra đời của tivi màu ở Anh vào năm 1967"
                    },
                    {
                        "en": "colour photographs",
                        "vi": "ảnh màu"
                    },
                    {
                        "en": "a colour printer",
                        "vi": "một máy in màu"
                    },
                    {
                        "en": "a full-colour brochure",
                        "vi": "một tờ rơi đầy màu sắc"
                    },
                    {
                        "en": "in colour Do you dream in colour?",
                        "vi": "màu sắc Bạn có mơ thấy màu sắc không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "the colour of a person’s skin, when it shows the group of people they belong to",
                    "vi": "màu da của một người, khi nó thể hiện nhóm người mà họ thuộc về"
                },
                "examples": [
                    {
                        "en": "Discrimination on the grounds of race, religion or colour was outlawed.",
                        "vi": "Phân biệt đối xử vì lý do chủng tộc, tôn giáo hoặc màu da đã bị cấm."
                    },
                    {
                        "en": "people of all ages, genders, creeds and colours",
                        "vi": "mọi người ở mọi lứa tuổi, giới tính, tín ngưỡng và màu sắc"
                    },
                    {
                        "en": "to discriminate on the basis of colour",
                        "vi": "để phân biệt dựa trên màu sắc"
                    },
                    {
                        "en": "Can we seriously believe people who claim not to see colour?",
                        "vi": "Chúng ta có thể nghiêm túc tin những người tuyên bố không nhìn thấy màu sắc không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "a red or pink colour in somebody’s face, especially when it shows that they look healthy or that they are embarrassed",
                    "vi": "màu đỏ hoặc hồng trên khuôn mặt của ai đó, đặc biệt là khi điều đó cho thấy họ trông khỏe mạnh hoặc họ đang xấu hổ"
                },
                "examples": [
                    {
                        "en": "The fresh air brought colour to their cheeks.",
                        "vi": "Không khí trong lành đã mang lại màu sắc cho đôi má của họ."
                    },
                    {
                        "en": "Colour flooded her face when she thought of what had happened.",
                        "vi": "Màu sắc tràn ngập trên khuôn mặt cô khi cô nghĩ về những gì đã xảy ra."
                    },
                    {
                        "en": "His face was drained of colour (= he looked pale and ill).",
                        "vi": "Mặt anh ta tái mét (= trông anh ta xanh xao và ốm yếu)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a substance that is used to give colour to something",
                    "vi": "một chất được sử dụng để tạo màu cho một thứ gì đó"
                },
                "examples": [
                    {
                        "en": "a semi-permanent hair colour that lasts six to eight washes",
                        "vi": "màu tóc bán vĩnh viễn kéo dài từ sáu đến tám lần gội"
                    },
                    {
                        "en": "This colour runs, so wash the shirt separately.",
                        "vi": "Màu này chạy, nên giặt riêng áo."
                    }
                ]
            },
            {
                "define": {
                    "en": "interesting and exciting details or qualities",
                    "vi": "những chi tiết hoặc phẩm chất thú vị và hấp dẫn"
                },
                "examples": [
                    {
                        "en": "The old town is full of colour and attractions.",
                        "vi": "Khu phố cổ đầy màu sắc và hấp dẫn."
                    },
                    {
                        "en": "Her acting added warmth and colour to the production.",
                        "vi": "Diễn xuất của cô ấy đã tạo thêm sự ấm áp và màu sắc cho quá trình sản xuất."
                    },
                    {
                        "en": "to add/give/lend colour to something (= make it brighter, more interesting, etc.)",
                        "vi": "để thêm / cho / cho mượn màu sắc cho thứ gì đó (= làm cho nó sáng hơn, thú vị hơn, v.v.)"
                    }
                ]
            },
            {
                "define": {
                    "en": "the particular colours that are used on clothes, flags, etc. to represent a team, school, political party or country",
                    "vi": "các màu cụ thể được sử dụng trên quần áo, cờ, v.v. để đại diện cho một đội, trường học, đảng chính trị hoặc quốc gia"
                },
                "examples": [
                    {
                        "en": "Red and white are the team colours.",
                        "vi": "Màu đỏ và trắng là màu của đội."
                    },
                    {
                        "en": "Spain’s national colours",
                        "vi": "Màu quốc gia của Tây Ban Nha"
                    },
                    {
                        "en": "(figurative) There are people of different political colours on the committee.",
                        "vi": "(nghĩa bóng) Có những người mang màu sắc chính trị khác nhau trong ủy ban."
                    }
                ]
            },
            {
                "define": {
                    "en": "a flag, badge, etc. that represents a team, country, ship, etc.",
                    "vi": "cờ, huy hiệu, v.v. đại diện cho đội, quốc gia, tàu, v.v."
                },
                "examples": [
                    {
                        "en": "Most buildings had a flagpole with the national colours flying.",
                        "vi": "Hầu hết các tòa nhà đều có cột cờ với màu cờ sắc áo tung bay."
                    },
                    {
                        "en": "sailing under the French colours",
                        "vi": "chèo thuyền dưới màu sắc của Pháp"
                    }
                ]
            },
            {
                "define": {
                    "en": "to make something seem true or likely",
                    "vi": "để làm cho một cái gì đó có vẻ đúng hoặc có khả năng"
                },
                "examples": [
                    {
                        "en": "Most of the available evidence lends colour to this view.",
                        "vi": "Hầu hết các bằng chứng có sẵn đều cho thấy quan điểm này có màu sắc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to say publicly and clearly what you believe or who you support",
                    "vi": "nói một cách công khai và rõ ràng những gì bạn tin tưởng hoặc những người bạn ủng hộ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "who is not white",
                    "vi": "ai không da trắng"
                },
                "examples": [
                    {
                        "en": "people of colour",
                        "vi": "người da màu"
                    },
                    {
                        "en": "As a woman of colour, this concerns me.",
                        "vi": "Là một phụ nữ da màu, điều này khiến tôi quan tâm."
                    },
                    {
                        "en": "a literary prize for writers of colour",
                        "vi": "một giải thưởng văn học cho các nhà văn da màu"
                    },
                    {
                        "en": "students of colour",
                        "vi": "sinh viên da màu"
                    }
                ]
            },
            {
                "define": {
                    "en": "to make sure that somebody has enough money to pay for something",
                    "vi": "để đảm bảo rằng ai đó có đủ tiền để trả cho một thứ gì đó"
                },
                "examples": [
                    {
                        "en": "You need to see the colour of his money before you sell him the car.",
                        "vi": "Bạn cần phải xem màu tiền của anh ta trước khi bạn bán xe cho anh ta."
                    }
                ]
            },
            {
                "define": {
                    "en": "your real character, rather than the one that you usually allow other people to see",
                    "vi": "nhân vật thực của bạn, thay vì nhân vật mà bạn thường cho phép người khác nhìn thấy"
                },
                "examples": [
                    {
                        "en": "It was only after they got married that he showed himself in his true colours.",
                        "vi": "Chỉ sau khi họ kết hôn, anh ấy mới thể hiện bản thân mình trong màu sắc thực sự của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "very well; with a very high mark",
                    "vi": "rất tốt; với một điểm rất cao"
                },
                "examples": [
                    {
                        "en": "She passed the exam with flying colours.",
                        "vi": "Cô ấy đã vượt qua kỳ thi với màu sắc bay bổng."
                    }
                ]
            }
        ]
    },
    {
        "id": "7129c19101c84c0eacc6cc162980fd4f",
        "word": "European",
        "pos": "adjective",
        "level": "a2",
        "phonetic": {
            "uk": "/ˌjʊərəˈpiːən/",
            "us": "/ˌjʊrəˈpiːən/"
        },
        "nearby": [
            {
                "word": "Euro-MP",
                "pos": "noun"
            },
            {
                "word": "Europe",
                "pos": "noun"
            },
            {
                "word": "European",
                "pos": "adjective"
            },
            {
                "word": "European",
                "pos": "noun"
            },
            {
                "word": "the European Atomic Energy Community",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "of or connected with Europe",
                    "vi": "của hoặc kết nối với Châu Âu"
                },
                "examples": [
                    {
                        "en": "European languages",
                        "vi": "Ngôn ngữ châu âu"
                    }
                ]
            },
            {
                "define": {
                    "en": "of or connected with the European Union",
                    "vi": "của hoặc được kết nối với Liên minh Châu Âu"
                },
                "examples": [
                    {
                        "en": "European law",
                        "vi": "Luật Châu Âu"
                    }
                ]
            }
        ]
    },
    {
        "id": "81835fb68843401eafd840c633e808ce",
        "word": "European",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˌjʊərəˈpiːən/",
            "us": "/ˌjʊrəˈpiːən/"
        },
        "nearby": [
            {
                "word": "Europe",
                "pos": "noun"
            },
            {
                "word": "European",
                "pos": "adjective"
            },
            {
                "word": "European",
                "pos": "noun"
            },
            {
                "word": "the European Atomic Energy Community",
                "pos": ""
            },
            {
                "word": "the European Commission",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person from Europe, or whose ancestors came from Europe",
                    "vi": "một người đến từ Châu Âu hoặc tổ tiên của họ đến từ Châu Âu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a person who supports the principles and aims of the European Union",
                    "vi": "một người ủng hộ các nguyên tắc và mục tiêu của Liên minh Châu Âu"
                },
                "examples": [
                    {
                        "en": "a good European",
                        "vi": "một người châu Âu tốt"
                    }
                ]
            }
        ]
    },
    {
        "id": "f44d96d1db3749368b3f5564a7025b3f",
        "word": "African American",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˌæfrɪkən əˈmerɪkən/",
            "us": "/ˌæfrɪkən əˈmerɪkən/"
        },
        "nearby": [
            {
                "word": "African",
                "pos": "adjective"
            },
            {
                "word": "African",
                "pos": "noun"
            },
            {
                "word": "African American",
                "pos": "noun"
            },
            {
                "word": "African American",
                "pos": "adjective"
            },
            {
                "word": "African Canadian",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person from America who is a member of a group of people who have dark skin and whose ancestors came from Africa",
                    "vi": "một người đến từ Châu Mỹ là thành viên của một nhóm người có nước da ngăm đen và tổ tiên đến từ Châu Phi"
                },
                "examples": [
                    {
                        "en": "a young African American",
                        "vi": "một người Mỹ gốc Phi trẻ"
                    }
                ]
            }
        ]
    },
    {
        "id": "648c79e2eaeb43039a73cf21de5b827f",
        "word": "African American",
        "pos": "adjective",
        "level": "b1",
        "phonetic": {
            "uk": "/ˌæfrɪkən əˈmerɪkən/",
            "us": "/ˌæfrɪkən əˈmerɪkən/"
        },
        "nearby": [
            {
                "word": "African",
                "pos": "noun"
            },
            {
                "word": "African American",
                "pos": "noun"
            },
            {
                "word": "African American",
                "pos": "adjective"
            },
            {
                "word": "African Canadian",
                "pos": "noun"
            },
            {
                "word": "African Canadian",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "of or connected with American people whose families were originally from Africa",
                    "vi": "trong số hoặc kết nối với những người Mỹ có gia đình gốc từ Châu Phi"
                },
                "examples": [
                    {
                        "en": "African American culture",
                        "vi": "Văn hóa người Mỹ gốc Phi"
                    },
                    {
                        "en": "My doctor is African American.",
                        "vi": "Bác sĩ của tôi là người Mỹ gốc Phi."
                    }
                ]
            }
        ]
    },
    {
        "id": "62dcdf8a6d3a4fa5b404eae262830734",
        "word": "man of colour",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˌmæn əv ˈkʌlə(r)/",
            "us": "/ˌmæn əv ˈkʌlər/"
        },
        "nearby": [
            {
                "word": "manoeuvre",
                "pos": "verb"
            },
            {
                "word": "manoeuvring",
                "pos": "noun"
            },
            {
                "word": "man of colour",
                "pos": "noun"
            },
            {
                "word": "Man of Kent",
                "pos": "noun"
            },
            {
                "word": "man of letters",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a man who is not white",
                    "vi": "một người đàn ông không phải là người da trắng"
                },
                "examples": [
                    {
                        "en": "They are hoping to attract more men of color into the teaching profession.",
                        "vi": "Họ đang hy vọng sẽ thu hút thêm nhiều người da màu tham gia nghề giáo."
                    }
                ]
            }
        ]
    },
    {
        "id": "68f873979d884a7482bc756e251c8b33",
        "word": "person of colour",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˌpɜːsn əv ˈkʌlə(r)/",
            "us": "/ˌpɜːrsn əv ˈkʌlər/"
        },
        "nearby": [
            {
                "word": "personnel",
                "pos": "noun"
            },
            {
                "word": "personnel carrier",
                "pos": "noun"
            },
            {
                "word": "person of colour",
                "pos": "noun"
            },
            {
                "word": "person-to-person",
                "pos": "adjective"
            },
            {
                "word": "perspective",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who is not white",
                    "vi": "một người không phải là người da trắng"
                },
                "examples": [
                    {
                        "en": "Young people and people of color are among the communities most affected by the changes.",
                        "vi": "Thanh niên và người da màu là một trong những cộng đồng bị ảnh hưởng nhiều nhất bởi những thay đổi này."
                    }
                ]
            }
        ]
    },
    {
        "id": "4cd53990be9945b98603f69aec9d8664",
        "word": "race",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/reɪs/",
            "us": "/reɪs/"
        },
        "nearby": [
            {
                "word": "RAC",
                "pos": "abbreviation"
            },
            {
                "word": "raccoon",
                "pos": "noun"
            },
            {
                "word": "race",
                "pos": "noun"
            },
            {
                "word": "race",
                "pos": "verb"
            },
            {
                "word": "race car",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a competition between people, animals, vehicles, etc. to see which one is the faster or fastest",
                    "vi": "cuộc thi giữa người, động vật, xe cộ, v.v. để xem cái nào nhanh hơn hoặc nhanh nhất"
                },
                "examples": [
                    {
                        "en": "a boat/horse race",
                        "vi": "một cuộc đua thuyền / ngựa"
                    },
                    {
                        "en": "a five-kilometre road race",
                        "vi": "một cuộc đua đường dài năm km"
                    },
                    {
                        "en": "Who won the race?",
                        "vi": "Ai đã thắng cuộc đua?"
                    },
                    {
                        "en": "Shall we have a race to the end of the beach?",
                        "vi": "Chúng ta sẽ có một cuộc đua đến cuối bãi biển chứ?"
                    },
                    {
                        "en": "She ran a good race to finish second.",
                        "vi": "Cô ấy đã chạy một cuộc đua tốt để về nhì."
                    },
                    {
                        "en": "race between A and B a race between the two best runners of the club",
                        "vi": "cuộc đua giữa A và B một cuộc đua giữa hai người chạy tốt nhất của câu lạc bộ"
                    },
                    {
                        "en": "race against somebody He's already in training for the big race against Bailey.",
                        "vi": "chạy đua với ai đó Anh ấy đang luyện tập cho cuộc đua lớn với Bailey."
                    },
                    {
                        "en": "in a race Their horse came third in the race last year.",
                        "vi": "trong một cuộc đua Ngựa của họ về thứ ba trong cuộc đua năm ngoái."
                    }
                ]
            },
            {
                "define": {
                    "en": "a situation in which a number of people, groups, organizations, etc. are competing, especially for political power or to achieve something first",
                    "vi": "tình huống trong đó một số người, nhóm, tổ chức, v.v. đang cạnh tranh, đặc biệt là để giành quyền lực chính trị hoặc để đạt được điều gì đó trước tiên"
                },
                "examples": [
                    {
                        "en": "race for something Who will win the race for the White House?",
                        "vi": "ai sẽ thắng cuộc đua vào Nhà Trắng?"
                    },
                    {
                        "en": "race to do something The race is on (= has begun) to find a cure for the disease.",
                        "vi": "cuộc chạy đua để làm điều gì đó Cuộc chạy đua đang diễn ra (= đã bắt đầu) để tìm ra phương pháp chữa trị căn bệnh này."
                    },
                    {
                        "en": "race between A and B The 1960 election was a close race between Nixon and Kennedy.",
                        "vi": "cuộc chạy đua giữa A và B Cuộc bầu cử năm 1960 là một cuộc chạy đua chặt chẽ giữa Nixon và Kennedy."
                    },
                    {
                        "en": "race against somebody She is in a tight race against her Republican opponent.",
                        "vi": "chạy đua với ai đó Cô ấy đang trong một cuộc đua chặt chẽ với đối thủ Đảng Cộng hòa của cô ấy."
                    },
                    {
                        "en": "in a race He has taken a lead in the presidential race.",
                        "vi": "trong một cuộc đua Anh đã dẫn đầu trong cuộc đua tổng thống."
                    },
                    {
                        "en": "This week she dropped out of the leadership race.",
                        "vi": "Tuần này, cô ấy đã bị loại khỏi cuộc đua lãnh đạo."
                    }
                ]
            },
            {
                "define": {
                    "en": "a series of horse races that happen at one place on a particular day",
                    "vi": "một loạt các cuộc đua ngựa diễn ra tại một địa điểm vào một ngày cụ thể"
                },
                "examples": [
                    {
                        "en": "to go to the races",
                        "vi": "đi đến các cuộc đua"
                    },
                    {
                        "en": "We had a great day at the races.",
                        "vi": "Chúng tôi đã có một ngày tuyệt vời tại cuộc đua."
                    }
                ]
            },
            {
                "define": {
                    "en": "one of the main groups that humans can be divided into according to their physical differences, for example the colour of their skin; the fact of belonging to one of these groups",
                    "vi": "một trong những nhóm chính mà con người có thể được chia thành các nhóm khác nhau về thể chất, ví dụ như màu da của họ; thực tế là thuộc một trong những nhóm này"
                },
                "examples": [
                    {
                        "en": "This custom is found in people of all races throughout the world.",
                        "vi": "Phong tục này được tìm thấy ở mọi người thuộc mọi chủng tộc trên khắp thế giới."
                    },
                    {
                        "en": "legislation against discrimination on the grounds of race or gender",
                        "vi": "luật chống phân biệt đối xử vì lý do chủng tộc hoặc giới tính"
                    },
                    {
                        "en": "Race is a major issue in this election.",
                        "vi": "Chủng tộc là một vấn đề chính trong cuộc bầu cử này."
                    },
                    {
                        "en": "Britain has always been a country of many races and ethnicities.",
                        "vi": "Nước Anh luôn là đất nước của nhiều chủng tộc và sắc tộc."
                    },
                    {
                        "en": "Her poetry explores questions of race and identity.",
                        "vi": "Thơ của cô khám phá những câu hỏi về chủng tộc và danh tính."
                    }
                ]
            },
            {
                "define": {
                    "en": "a group of people who share the same language, history, culture, etc.",
                    "vi": "một nhóm người có cùng ngôn ngữ, lịch sử, văn hóa, v.v."
                },
                "examples": [
                    {
                        "en": "the Nordic races",
                        "vi": "các cuộc đua Bắc Âu"
                    },
                    {
                        "en": "He admired Canadians as a hardy and determined race.",
                        "vi": "Anh ngưỡng mộ người Canada là một chủng tộc gan lì và đầy quyết tâm."
                    }
                ]
            },
            {
                "define": {
                    "en": "a breed or type of animal or plant",
                    "vi": "một giống hoặc một loại động vật hoặc thực vật"
                },
                "examples": [
                    {
                        "en": "a race of cattle",
                        "vi": "một cuộc đua của gia súc"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be involved in a situation so that you will gain or lose according to the result",
                    "vi": "tham gia vào một tình huống để bạn sẽ được hoặc mất tùy theo kết quả"
                },
                "examples": [
                    {
                        "en": "I really don't have a dog in this fight, so I can just enjoy the game.",
                        "vi": "Tôi thực sự không có một con chó trong cuộc chiến này, vì vậy tôi chỉ có thể tận hưởng trò chơi."
                    },
                    {
                        "en": "The employees have a dog in the hunt, so their views should be listened to.",
                        "vi": "Các nhân viên có một con chó trong cuộc đi săn, vì vậy quan điểm của họ nên được lắng nghe."
                    }
                ]
            },
            {
                "define": {
                    "en": "a competition or an election in which there are only one, two, etc. teams or candidates with a chance of winning",
                    "vi": "một cuộc thi hoặc một cuộc bầu cử trong đó chỉ có một, hai, v.v. đội hoặc ứng cử viên có cơ hội chiến thắng"
                },
                "examples": [
                    {
                        "en": "The women’s competition was a two horse race between last year’s winners Surrey and the previous champions Essex.",
                        "vi": "Cuộc thi dành cho nữ là cuộc đua hai ngựa giữa người chiến thắng năm ngoái Surrey và nhà vô địch trước đó là Essex."
                    }
                ]
            },
            {
                "define": {
                    "en": "a situation in which you have to do something or finish something very fast before it is too late",
                    "vi": "một tình huống mà bạn phải làm một cái gì đó hoặc hoàn thành một cái gì đó rất nhanh trước khi quá muộn"
                },
                "examples": [
                    {
                        "en": "Getting food to the starving refugees is now a race against time.",
                        "vi": "Kiếm thức ăn cho những người tị nạn chết đói giờ đây là một cuộc chạy đua với thời gian."
                    }
                ]
            },
            {
                "define": {
                    "en": "a situation in which companies and countries compete with each other to produce goods as cheaply as possible by paying low wages and giving workers poor conditions and few rights",
                    "vi": "tình huống trong đó các công ty và quốc gia cạnh tranh với nhau để sản xuất hàng hóa càng rẻ càng tốt bằng cách trả lương thấp và tạo cho người lao động những điều kiện tồi tệ và ít quyền lợi"
                },
                "examples": [
                    {
                        "en": "They are caught in the cheap food syndrome, the race to the bottom, the chase for the lowest cost of production globally.",
                        "vi": "Họ bị mắc vào hội chứng thực phẩm rẻ, cuộc chạy đua tới đáy, cuộc chạy đua để có giá thành sản xuất thấp nhất trên toàn cầu."
                    }
                ]
            }
        ]
    },
    {
        "id": "161d75712402497aa43823387c169184",
        "word": "woman of colour",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˌwʊmən əv ˈkʌlə(r)/",
            "us": "/ˌwʊmən əv ˈkʌlər/"
        },
        "nearby": [
            {
                "word": "womanliness",
                "pos": "noun"
            },
            {
                "word": "womanly",
                "pos": "adjective"
            },
            {
                "word": "woman of colour",
                "pos": "noun"
            },
            {
                "word": "Woman's Hour",
                "pos": ""
            },
            {
                "word": "Woman's Own",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a woman who is not white",
                    "vi": "một người phụ nữ không phải là người da trắng"
                },
                "examples": [
                    {
                        "en": "The organization works to advance women of color in politics.",
                        "vi": "Tổ chức này hoạt động để thúc đẩy phụ nữ da màu tham gia chính trị."
                    }
                ]
            }
        ]
    },
    {
        "id": "1e1a6c206ee74e03b25305321888d349",
        "word": "Arab",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈærəb/",
            "us": "/ˈærəb/"
        },
        "nearby": [
            {
                "word": "AR",
                "pos": "abbreviation"
            },
            {
                "word": "AR",
                "pos": "noun"
            },
            {
                "word": "Arab",
                "pos": "noun"
            },
            {
                "word": "Arab",
                "pos": "adjective"
            },
            {
                "word": "Arabella",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person from the Middle East or North Africa, whose ancestors lived in the Arabian peninsula",
                    "vi": "một người từ Trung Đông hoặc Bắc Phi, có tổ tiên sống ở bán đảo Ả Rập"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a type of horse originally from Arabia",
                    "vi": "một loại ngựa có nguồn gốc từ Ả Rập"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "05a3a612ce0340eebe64e0ac8b6dd4e5",
        "word": "Arab",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈærəb/",
            "us": "/ˈærəb/"
        },
        "nearby": [
            {
                "word": "AR",
                "pos": "noun"
            },
            {
                "word": "Arab",
                "pos": "noun"
            },
            {
                "word": "Arab",
                "pos": "adjective"
            },
            {
                "word": "Arabella",
                "pos": ""
            },
            {
                "word": "arabesque",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "of or connected with Arabia or Arabs",
                    "vi": "trong số hoặc kết nối với Ả Rập hoặc Ả Rập"
                },
                "examples": [
                    {
                        "en": "Arab countries",
                        "vi": "Các nước Ả Rập"
                    }
                ]
            }
        ]
    },
    {
        "id": "ce37c88e90e342ba88e58e5122cda611",
        "word": "Asian American",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˌeɪʒn əˈmerɪkən/",
            "us": "/ˌeɪʒn əˈmerɪkən/"
        },
        "nearby": [
            {
                "word": "Asian",
                "pos": "noun"
            },
            {
                "word": "Asian",
                "pos": "adjective"
            },
            {
                "word": "Asian American",
                "pos": "noun"
            },
            {
                "word": "Asian-American",
                "pos": "adjective"
            },
            {
                "word": "Asian Dub Foundation",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person from America whose family come from Asia, especially East Asia",
                    "vi": "một người từ Châu Mỹ có gia đình đến từ Châu Á, đặc biệt là Đông Á"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c6ff71aff5a04f46bf27faead408e2e3",
        "word": "Asian-American",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/ˌeɪʒn əˈmerɪkən/",
            "us": "/ˌeɪʒn əˈmerɪkən/"
        },
        "nearby": [
            {
                "word": "Asian",
                "pos": "adjective"
            },
            {
                "word": "Asian American",
                "pos": "noun"
            },
            {
                "word": "Asian-American",
                "pos": "adjective"
            },
            {
                "word": "Asian Dub Foundation",
                "pos": ""
            },
            {
                "word": "Asiatic",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "being an Asian American; connected with Asian Americans",
                    "vi": "là một người Mỹ gốc Á; kết nối với người Mỹ gốc Á"
                },
                "examples": [
                    {
                        "en": "Asian-American families",
                        "vi": "Gia đình người Mỹ gốc Á"
                    }
                ]
            }
        ]
    },
    {
        "id": "7c088ce3ba08408e92021e0c4ef64ca6",
        "word": "black",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/blæk/",
            "us": "/blæk/"
        },
        "nearby": [
            {
                "word": "black",
                "pos": "adjective"
            },
            {
                "word": "Cilla Black",
                "pos": ""
            },
            {
                "word": "black",
                "pos": "noun"
            },
            {
                "word": "black",
                "pos": "verb"
            },
            {
                "word": "Blackadder",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the very darkest colour, like night or coal",
                    "vi": "màu tối nhất, như đêm hoặc than"
                },
                "examples": [
                    {
                        "en": "the black of the night sky",
                        "vi": "bầu trời đêm đen"
                    },
                    {
                        "en": "Everyone at the funeral was dressed in black.",
                        "vi": "Tất cả mọi người trong lễ tang đều mặc đồ đen."
                    }
                ]
            },
            {
                "define": {
                    "en": "a member of a group of people who have dark skin, especially people who come from or whose ancestors came from Africa",
                    "vi": "thành viên của một nhóm những người có làn da sẫm màu, đặc biệt là những người đến từ hoặc tổ tiên đến từ Châu Phi"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to have money, for example in your bank account",
                    "vi": "để có tiền, chẳng hạn như trong tài khoản ngân hàng của bạn"
                },
                "examples": [
                    {
                        "en": "The company has managed to stay in the black for the year ending December 31.",
                        "vi": "Công ty đã tiếp tục duy trì tình trạng đen đủi cho năm kết thúc vào ngày 31 tháng 12."
                    }
                ]
            },
            {
                "define": {
                    "en": "having no colours except black, white and shades of grey (in photographs, on television, etc.)",
                    "vi": "không có màu nào ngoại trừ đen, trắng và xám (trong ảnh, trên tivi, v.v.)"
                },
                "examples": [
                    {
                        "en": "a film made in black and white",
                        "vi": "phim đen trắng"
                    },
                    {
                        "en": "black-and-white photos",
                        "vi": "ảnh đen trắng"
                    }
                ]
            },
            {
                "define": {
                    "en": "in a way that makes people or things seem completely bad or good, or completely right or wrong",
                    "vi": "theo cách làm cho mọi người hoặc mọi thứ có vẻ hoàn toàn xấu hoặc tốt, hoặc hoàn toàn đúng hoặc sai"
                },
                "examples": [
                    {
                        "en": "It's a complex issue, but he only sees it in black and white.",
                        "vi": "Đó là một vấn đề phức tạp, nhưng anh ấy chỉ nhìn nhận nó bằng hai màu đen và trắng."
                    },
                    {
                        "en": "This is not a black-and-white decision (= where the difference between two choices is completely clear).",
                        "vi": "Đây không phải là quyết định trắng đen (= khi sự khác biệt giữa hai lựa chọn là hoàn toàn rõ ràng)."
                    }
                ]
            },
            {
                "define": {
                    "en": "in writing or in print",
                    "vi": "bằng văn bản hoặc bản in"
                },
                "examples": [
                    {
                        "en": "I never thought they'd put it in black and white on the front page.",
                        "vi": "Tôi chưa bao giờ nghĩ rằng họ sẽ đặt nó bằng màu đen trắng trên trang nhất."
                    }
                ]
            }
        ]
    },
    {
        "id": "e82c1d0360684f87be22c20f9fb6f15c",
        "word": "diversity",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/daɪˈvɜːsəti/",
            "us": "/daɪˈvɜːrsəti/"
        },
        "nearby": [
            {
                "word": "diversion",
                "pos": "noun"
            },
            {
                "word": "diversionary",
                "pos": "adjective"
            },
            {
                "word": "diversity",
                "pos": "noun"
            },
            {
                "word": "divert",
                "pos": "verb"
            },
            {
                "word": "diverticulitis",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a range of many people or things that are very different from each other",
                    "vi": "một loạt nhiều người hoặc nhiều thứ rất khác nhau"
                },
                "examples": [
                    {
                        "en": "the biological diversity of the rainforests",
                        "vi": "sự đa dạng sinh học của rừng nhiệt đới"
                    },
                    {
                        "en": "a great/wide/rich diversity of opinion",
                        "vi": "đa dạng ý kiến lớn / rộng / phong phú"
                    }
                ]
            },
            {
                "define": {
                    "en": "the quality or fact of including a range of many people or things",
                    "vi": "chất lượng hoặc thực tế của việc bao gồm nhiều người hoặc nhiều thứ"
                },
                "examples": [
                    {
                        "en": "There is a need for greater diversity and choice in education.",
                        "vi": "Cần có sự đa dạng và lựa chọn nhiều hơn trong giáo dục."
                    },
                    {
                        "en": "The company is working to improve its profile in terms of diversity and inclusion (= offering equal opportunities to people from minority groups).",
                        "vi": "Công ty đang nỗ lực cải thiện hồ sơ của mình về sự đa dạng và hòa nhập (= mang lại cơ hội bình đẳng cho những người thuộc các nhóm thiểu số)."
                    }
                ]
            }
        ]
    },
    {
        "id": "9bcac8d83d4f42519ba078ffe630111b",
        "word": "ethnic",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈeθnɪk/",
            "us": "/ˈeθnɪk/"
        },
        "nearby": [
            {
                "word": "Ethiopia",
                "pos": "noun"
            },
            {
                "word": "Ethiopian",
                "pos": "noun, adjective"
            },
            {
                "word": "ethnic",
                "pos": "adjective"
            },
            {
                "word": "ethnic",
                "pos": "noun"
            },
            {
                "word": "ethnically",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "connected with or belonging to a group of people that share a cultural tradition",
                    "vi": "được kết nối với hoặc thuộc về một nhóm người có chung truyền thống văn hóa"
                },
                "examples": [
                    {
                        "en": "ethnic background/origin",
                        "vi": "nền tảng / nguồn gốc dân tộc"
                    },
                    {
                        "en": "ethnic strife/tensions/violence (= between different ethnic groups)",
                        "vi": "xung đột sắc tộc / căng thẳng / bạo lực (= giữa các nhóm dân tộc khác nhau)"
                    },
                    {
                        "en": "Our government should reflect the racial and ethnic diversity of our country.",
                        "vi": "Chính phủ của chúng ta nên phản ánh sự đa dạng về chủng tộc và sắc tộc của đất nước chúng ta."
                    },
                    {
                        "en": "ethnic Albanians living in Germany",
                        "vi": "người Albania sống ở Đức"
                    },
                    {
                        "en": "The country is divided along ethnic lines.",
                        "vi": "Đất nước bị chia cắt dọc theo các dòng tộc."
                    }
                ]
            },
            {
                "define": {
                    "en": "typical of a country or culture that is very different from modern Western culture and therefore interesting for people in Western countries",
                    "vi": "đặc trưng của một quốc gia hoặc nền văn hóa rất khác với văn hóa phương Tây hiện đại và do đó rất thú vị đối với người dân ở các nước phương Tây"
                },
                "examples": [
                    {
                        "en": "ethnic clothes/jewellery/cooking",
                        "vi": "quần áo dân tộc / đồ trang sức / nấu ăn"
                    }
                ]
            }
        ]
    },
    {
        "id": "025ec6899ef4483195cb8142927f3936",
        "word": "minority",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/maɪˈnɒrəti/",
            "us": "/maɪˈnɔːrəti/"
        },
        "nearby": [
            {
                "word": "minor",
                "pos": "verb"
            },
            {
                "word": "minor in",
                "pos": "phrasal verb"
            },
            {
                "word": "minority",
                "pos": "noun"
            },
            {
                "word": "minority government",
                "pos": "noun"
            },
            {
                "word": "minority leader",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the smaller part of a group; less than half of the people or things in a large group",
                    "vi": "phần nhỏ hơn của một nhóm; ít hơn một nửa số người hoặc sự vật trong một nhóm lớn"
                },
                "examples": [
                    {
                        "en": "Only a small minority of students is/are interested in politics these days.",
                        "vi": "Ngày nay, chỉ có một số ít sinh viên quan tâm đến chính trị."
                    },
                    {
                        "en": "Only a tiny minority of products is/are affected.",
                        "vi": "Chỉ một số ít sản phẩm bị / bị ảnh hưởng."
                    },
                    {
                        "en": "For a minority, the decision was a disappointment.",
                        "vi": "Đối với một bộ phận thiểu số, quyết định này là một sự thất vọng."
                    },
                    {
                        "en": "That's very much a minority view.",
                        "vi": "Đó là một quan điểm thiểu số."
                    },
                    {
                        "en": "Minority interest groups have gained disproportionate influence.",
                        "vi": "Các nhóm lợi ích thiểu số đã đạt được ảnh hưởng không tương xứng."
                    },
                    {
                        "en": "among a/the minority You are definitely among the minority.",
                        "vi": "giữa a / thiểu số Bạn chắc chắn nằm trong số thiểu số."
                    },
                    {
                        "en": "minority shareholders in the bank",
                        "vi": "cổ đông thiểu số trong ngân hàng"
                    },
                    {
                        "en": "to have a minority stake in a company",
                        "vi": "có cổ phần thiểu số trong một công ty"
                    }
                ]
            },
            {
                "define": {
                    "en": "a small group within a community or country that is different because of race, religion, language, etc.",
                    "vi": "một nhóm nhỏ trong một cộng đồng hoặc quốc gia khác biệt vì chủng tộc, tôn giáo, ngôn ngữ, v.v."
                },
                "examples": [
                    {
                        "en": "the rights of ethnic/racial minorities",
                        "vi": "quyền của dân tộc thiểu số / chủng tộc"
                    },
                    {
                        "en": "There is a large German-speaking minority in the east of the country.",
                        "vi": "Có một bộ phận thiểu số nói tiếng Đức lớn ở phía đông của đất nước."
                    },
                    {
                        "en": "persecuted/oppressed minorities",
                        "vi": "thiểu số bị bắt bớ / bị áp bức"
                    },
                    {
                        "en": "minority languages",
                        "vi": "Ngôn ngữ thiểu số"
                    },
                    {
                        "en": "(North American English) minority neighborhoods (= where no or few white people live)",
                        "vi": "(Tiếng Anh Bắc Mỹ) khu dân cư thiểu số (= nơi không có hoặc ít người da trắng sinh sống)"
                    },
                    {
                        "en": "minority groups/populations/leaders",
                        "vi": "nhóm thiểu số / dân số / lãnh đạo"
                    }
                ]
            },
            {
                "define": {
                    "en": "the state of being under the age at which you are legally an adult",
                    "vi": "tình trạng dưới độ tuổi mà bạn là người lớn hợp pháp"
                },
                "examples": [
                    {
                        "en": "When his minority ended he had to fight to reclaim his property.",
                        "vi": "Khi thiểu số của anh kết thúc, anh phải chiến đấu để đòi lại tài sản của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to form less than half of a large group",
                    "vi": "để tạo thành ít hơn một nửa của một nhóm lớn"
                },
                "examples": [
                    {
                        "en": "Men are in the minority in this profession.",
                        "vi": "Nam giới chiếm thiểu số trong nghề này."
                    },
                    {
                        "en": "We are in the minority on this issue.",
                        "vi": "Chúng tôi là thiểu số về vấn đề này."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be the only person to have a particular opinion or to vote a particular way",
                    "vi": "trở thành người duy nhất có ý kiến cụ thể hoặc bỏ phiếu theo cách cụ thể"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "84dcdd8fa7ca47379bf26c6cb64d6683",
        "word": "mixed",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/mɪkst/",
            "us": "/mɪkst/"
        },
        "nearby": [
            {
                "word": "Tom Mix",
                "pos": ""
            },
            {
                "word": "mix",
                "pos": "noun"
            },
            {
                "word": "mixed",
                "pos": "adjective"
            },
            {
                "word": "mixed-ability",
                "pos": "adjective"
            },
            {
                "word": "mixed bag",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "consisting of different qualities or elements",
                    "vi": "bao gồm các phẩm chất hoặc yếu tố khác nhau"
                },
                "examples": [
                    {
                        "en": "a mixed diet",
                        "vi": "một chế độ ăn uống hỗn hợp"
                    },
                    {
                        "en": "beaches with mixed sand and shingle",
                        "vi": "bãi biển với cát hỗn hợp và đá vôi"
                    }
                ]
            },
            {
                "define": {
                    "en": "having both good and bad qualities or feelings",
                    "vi": "có cả những phẩm chất hoặc cảm xúc tốt và xấu"
                },
                "examples": [
                    {
                        "en": "I still have mixed feelings about going to Brazil (= I am not sure what to think).",
                        "vi": "Tôi vẫn có cảm xúc lẫn lộn về việc đến Brazil (= Tôi không biết phải nghĩ gì)."
                    },
                    {
                        "en": "I listened to her story with mixed emotions.",
                        "vi": "Tôi lắng nghe câu chuyện của cô ấy với nhiều cảm xúc lẫn lộn."
                    },
                    {
                        "en": "These studies have produced mixed results.",
                        "vi": "Những nghiên cứu này đã tạo ra nhiều kết quả khác nhau."
                    },
                    {
                        "en": "The results were decidedly mixed.",
                        "vi": "Các kết quả đã được quyết định trộn lẫn."
                    },
                    {
                        "en": "The weather has been very mixed recently.",
                        "vi": "Thời tiết gần đây rất hỗn hợp."
                    },
                    {
                        "en": "Having a famous father can be a mixed blessing.",
                        "vi": "Có một người cha nổi tiếng có thể là một may mắn hỗn hợp."
                    },
                    {
                        "en": "The play was given a mixed reception by the critics (= some liked it, some did not).",
                        "vi": "Vở kịch đã được các nhà phê bình đón nhận trái chiều (= một số thích nó, một số thì không)."
                    },
                    {
                        "en": "The film met with a mixed reaction from viewers and critics.",
                        "vi": "Bộ phim vấp phải phản ứng trái chiều từ người xem và giới phê bình."
                    },
                    {
                        "en": "British athletes had mixed fortunes in yesterday's competition.",
                        "vi": "Các vận động viên người Anh đã có những vận may trái ngược nhau trong cuộc thi ngày hôm qua."
                    }
                ]
            },
            {
                "define": {
                    "en": "consisting of different kinds of people, for example, people from different races and cultures",
                    "vi": "bao gồm các loại người khác nhau, ví dụ, những người từ các chủng tộc và nền văn hóa khác nhau"
                },
                "examples": [
                    {
                        "en": "an ethnically mixed community",
                        "vi": "một cộng đồng dân tộc hỗn hợp"
                    },
                    {
                        "en": "people of mixed race",
                        "vi": "người thuộc chủng tộc hỗn hợp"
                    },
                    {
                        "en": "a mixed marriage (= between two people of different races or religions)",
                        "vi": "một cuộc hôn nhân hỗn hợp (= giữa hai người thuộc các chủng tộc hoặc tôn giáo khác nhau)"
                    }
                ]
            },
            {
                "define": {
                    "en": "consisting of different types of the same thing",
                    "vi": "bao gồm các loại khác nhau của cùng một thứ"
                },
                "examples": [
                    {
                        "en": "a mixed salad",
                        "vi": "một món salad trộn"
                    },
                    {
                        "en": "I served chicken with mixed vegetables.",
                        "vi": "Tôi phục vụ gà với rau trộn."
                    },
                    {
                        "en": "a mixed woodland of ash, oak and birch",
                        "vi": "một vùng rừng hỗn hợp của tro, sồi và bạch dương"
                    },
                    {
                        "en": "(British English) The students in the class are of mixed ability (= different levels of ability).",
                        "vi": "(Tiếng Anh Anh) Các học sinh trong lớp có khả năng khác nhau (= các mức độ khác nhau của khả năng)."
                    }
                ]
            },
            {
                "define": {
                    "en": "of or for both males and females",
                    "vi": "của hoặc cho cả nam và nữ"
                },
                "examples": [
                    {
                        "en": "a mixed school",
                        "vi": "một trường hỗn hợp"
                    },
                    {
                        "en": "I'd rather not talk about it in mixed company.",
                        "vi": "Tôi không muốn nói về nó trong một công ty hỗn hợp."
                    }
                ]
            }
        ]
    },
    {
        "id": "03c77dfc03af4e1ca3c4128d26256090",
        "word": "racism",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈreɪsɪzəm/",
            "us": "/ˈreɪsɪzəm/"
        },
        "nearby": [
            {
                "word": "racing car",
                "pos": "noun"
            },
            {
                "word": "racing certainty",
                "pos": "noun"
            },
            {
                "word": "racism",
                "pos": "noun"
            },
            {
                "word": "racist",
                "pos": "adjective"
            },
            {
                "word": "racist",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the unfair treatment of people who belong to a different race; violent behaviour towards them",
                    "vi": "đối xử bất công với những người thuộc một chủng tộc khác nhau; hành vi bạo lực đối với họ"
                },
                "examples": [
                    {
                        "en": "a victim of racism",
                        "vi": "nạn nhân của phân biệt chủng tộc"
                    },
                    {
                        "en": "ugly outbreaks of racism",
                        "vi": "sự bùng phát xấu xí của sự phân biệt chủng tộc"
                    },
                    {
                        "en": "the urgent need to address institutional racism within the organization",
                        "vi": "nhu cầu cấp thiết để giải quyết vấn đề phân biệt chủng tộc trong tổ chức"
                    },
                    {
                        "en": "It is important to identify root causes that perpetuate systemic racism in the city.",
                        "vi": "Điều quan trọng là phải xác định các nguyên nhân gốc rễ gây ra tình trạng phân biệt chủng tộc có hệ thống trong thành phố."
                    },
                    {
                        "en": "structural/casual racism",
                        "vi": "phân biệt chủng tộc cấu trúc / bình thường"
                    },
                    {
                        "en": "Half a million people held a mass protest against racism last night.",
                        "vi": "Nửa triệu người đã tổ chức một cuộc biểu tình lớn chống phân biệt chủng tộc vào đêm qua."
                    }
                ]
            },
            {
                "define": {
                    "en": "the belief that some races of people are better than others, or a general belief about a whole group of people based only on their race",
                    "vi": "niềm tin rằng một số chủng tộc người tốt hơn những người khác hoặc niềm tin chung về một nhóm người chỉ dựa trên chủng tộc của họ"
                },
                "examples": [
                    {
                        "en": "irrational racism",
                        "vi": "phân biệt chủng tộc phi lý"
                    },
                    {
                        "en": "Many 19th-century scientific theories were underpinned by racism.",
                        "vi": "Nhiều lý thuyết khoa học của thế kỷ 19 được củng cố bởi chủ nghĩa phân biệt chủng tộc."
                    }
                ]
            }
        ]
    },
    {
        "id": "82e9819d870f4916bdbfef460ae7f2c8",
        "word": "racist",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈreɪsɪst/",
            "us": "/ˈreɪsɪst/"
        },
        "nearby": [
            {
                "word": "racing certainty",
                "pos": "noun"
            },
            {
                "word": "racism",
                "pos": "noun"
            },
            {
                "word": "racist",
                "pos": "adjective"
            },
            {
                "word": "racist",
                "pos": "noun"
            },
            {
                "word": "rack",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "having the belief that some races of people are better than others or having general beliefs about other people based only on their race; showing this through violent or unfair treatment of people of other races",
                    "vi": "có niềm tin rằng một số chủng tộc người tốt hơn những người khác hoặc có niềm tin chung chung về những người khác chỉ dựa trên chủng tộc của họ; thể hiện điều này thông qua việc đối xử bạo lực hoặc bất công với những người thuộc chủng tộc khác"
                },
                "examples": [
                    {
                        "en": "racist attitudes/remarks",
                        "vi": "thái độ / nhận xét phân biệt chủng tộc"
                    },
                    {
                        "en": "racist thugs/attacks",
                        "vi": "côn đồ phân biệt chủng tộc / tấn công"
                    },
                    {
                        "en": "It's a bit racist to assume I only eat Chinese food.",
                        "vi": "Có một chút phân biệt chủng tộc khi cho rằng tôi chỉ ăn đồ ăn Trung Quốc."
                    }
                ]
            }
        ]
    },
    {
        "id": "c7418a0fb9524af8a539e7b04624c574",
        "word": "white",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/waɪt/",
            "us": "/waɪt/"
        },
        "nearby": [
            {
                "word": "Whitbread",
                "pos": ""
            },
            {
                "word": "white",
                "pos": "adjective"
            },
            {
                "word": "white",
                "pos": "noun"
            },
            {
                "word": "E B White",
                "pos": ""
            },
            {
                "word": "Gilbert White",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the colour of fresh snow or of milk",
                    "vi": "màu của tuyết hoặc sữa tươi"
                },
                "examples": [
                    {
                        "en": "various shades of white",
                        "vi": "các sắc thái khác nhau của màu trắng"
                    },
                    {
                        "en": "in white She was dressed all in white.",
                        "vi": "trong màu trắng Cô ấy đã mặc toàn đồ trắng."
                    },
                    {
                        "en": "the pure white of the newly painted walls",
                        "vi": "màu trắng tinh khiết của bức tường mới sơn"
                    },
                    {
                        "en": "In China, you wear white when you are mourning.",
                        "vi": "Ở Trung Quốc, bạn mặc đồ trắng khi để tang."
                    }
                ]
            },
            {
                "define": {
                    "en": "a member of a group of people who have pale skin, especially people who come from or whose ancestors came from Europe",
                    "vi": "thành viên của một nhóm những người có làn da nhợt nhạt, đặc biệt là những người đến từ hoặc tổ tiên đến từ Châu Âu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "white wine",
                    "vi": "rượu trắng"
                },
                "examples": [
                    {
                        "en": "Would you like red or white?",
                        "vi": "Bạn muốn màu đỏ hay trắng?"
                    },
                    {
                        "en": "a very dry white",
                        "vi": "một màu trắng rất khô"
                    }
                ]
            },
            {
                "define": {
                    "en": "the part of an egg that surrounds the yolk (= the yellow part)",
                    "vi": "phần trứng bao quanh lòng đỏ (= phần màu vàng)"
                },
                "examples": [
                    {
                        "en": "Use the whites of two eggs.",
                        "vi": "Sử dụng lòng trắng của hai quả trứng."
                    },
                    {
                        "en": "Whisk the egg whites until stiff.",
                        "vi": "Đánh bông lòng trắng trứng cho đến khi bông cứng."
                    }
                ]
            },
            {
                "define": {
                    "en": "the white part of the eye",
                    "vi": "phần trắng của mắt"
                },
                "examples": [
                    {
                        "en": "The whites of her eyes were bloodshot.",
                        "vi": "Lòng trắng mắt cô đỏ ngầu."
                    }
                ]
            },
            {
                "define": {
                    "en": "white clothes, sheets, etc. when they are separated from coloured ones to be washed",
                    "vi": "quần áo trắng, ga trải giường, v.v. khi chúng được tách ra khỏi quần áo màu để giặt"
                },
                "examples": [
                    {
                        "en": "(British English) Don't wash whites and coloureds together.",
                        "vi": "(Tiếng Anh Anh) Không giặt chung màu trắng và màu."
                    },
                    {
                        "en": "(North American English) Don't wash whites and colors together.",
                        "vi": "(Tiếng Anh Bắc Mỹ) Không giặt chung màu trắng và màu."
                    }
                ]
            },
            {
                "define": {
                    "en": "white clothes worn for playing some sports",
                    "vi": "quần áo trắng mặc để chơi một số môn thể thao"
                },
                "examples": [
                    {
                        "en": "cricket/tennis whites",
                        "vi": "người da trắng cricket / tennis"
                    }
                ]
            },
            {
                "define": {
                    "en": "having no colours except black, white and shades of grey (in photographs, on television, etc.)",
                    "vi": "không có màu nào ngoại trừ đen, trắng và xám (trong ảnh, trên tivi, v.v.)"
                },
                "examples": [
                    {
                        "en": "a film made in black and white",
                        "vi": "phim đen trắng"
                    },
                    {
                        "en": "black-and-white photos",
                        "vi": "ảnh đen trắng"
                    }
                ]
            },
            {
                "define": {
                    "en": "in a way that makes people or things seem completely bad or good, or completely right or wrong",
                    "vi": "theo cách làm cho mọi người hoặc mọi thứ có vẻ hoàn toàn xấu hoặc tốt, hoặc hoàn toàn đúng hoặc sai"
                },
                "examples": [
                    {
                        "en": "It's a complex issue, but he only sees it in black and white.",
                        "vi": "Đó là một vấn đề phức tạp, nhưng anh ấy chỉ nhìn nhận nó bằng hai màu đen và trắng."
                    },
                    {
                        "en": "This is not a black-and-white decision (= where the difference between two choices is completely clear).",
                        "vi": "Đây không phải là quyết định trắng đen (= khi sự khác biệt giữa hai lựa chọn là hoàn toàn rõ ràng)."
                    }
                ]
            }
        ]
    },
    {
        "id": "adc5ae03eae144abbdcf4741d53f29b5",
        "word": "ancestry",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈænsestri/",
            "us": "/ˈænsestri/"
        },
        "nearby": [
            {
                "word": "ancestor",
                "pos": "noun"
            },
            {
                "word": "ancestral",
                "pos": "adjective"
            },
            {
                "word": "ancestry",
                "pos": "noun"
            },
            {
                "word": "anchor",
                "pos": "noun"
            },
            {
                "word": "anchor",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the family or the group of people that you come from",
                    "vi": "gia đình hoặc nhóm người mà bạn đến từ"
                },
                "examples": [
                    {
                        "en": "to have Scottish ancestry",
                        "vi": "có tổ tiên là người Scotland"
                    },
                    {
                        "en": "He was able to trace his ancestry back over 1 000 years.",
                        "vi": "Ông đã có thể truy tìm nguồn gốc của mình từ hơn 1000 năm trước."
                    },
                    {
                        "en": "people of Japanese ancestry",
                        "vi": "người gốc Nhật Bản"
                    }
                ]
            }
        ]
    },
    {
        "id": "4d488c48e686484a8363513e930f6d47",
        "word": "biracial",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌbaɪˈreɪʃl/",
            "us": "/ˌbaɪˈreɪʃl/"
        },
        "nearby": [
            {
                "word": "bipolar",
                "pos": "adjective"
            },
            {
                "word": "bipolar disorder",
                "pos": "noun"
            },
            {
                "word": "biracial",
                "pos": "adjective"
            },
            {
                "word": "birch",
                "pos": "noun"
            },
            {
                "word": "bird",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "involving people of two different races; having parents from two different races",
                    "vi": "liên quan đến những người thuộc hai chủng tộc khác nhau; có cha mẹ từ hai chủng tộc khác nhau"
                },
                "examples": [
                    {
                        "en": "His biracial identity and history are important to him.",
                        "vi": "Danh tính và lịch sử hai chủng tộc của anh ấy rất quan trọng đối với anh ấy."
                    }
                ]
            }
        ]
    },
    {
        "id": "b1fee4f17a0d46af8f053b0a00072924",
        "word": "ethnicity",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/eθˈnɪsəti/",
            "us": "/eθˈnɪsəti/"
        },
        "nearby": [
            {
                "word": "ethnically",
                "pos": "adverb"
            },
            {
                "word": "ethnic cleansing",
                "pos": "noun"
            },
            {
                "word": "ethnicity",
                "pos": "noun"
            },
            {
                "word": "ethnic minority",
                "pos": "noun"
            },
            {
                "word": "ethnocentric",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the fact of belonging to a particular ethnic group (= a group of people that share a cultural tradition)",
                    "vi": "thực tế thuộc về một nhóm dân tộc cụ thể (= một nhóm người có chung truyền thống văn hóa)"
                },
                "examples": [
                    {
                        "en": "Many factors are important, for example class, gender, age and ethnicity.",
                        "vi": "Nhiều yếu tố rất quan trọng, ví dụ như giai cấp, giới tính, tuổi tác và dân tộc."
                    },
                    {
                        "en": "the diverse experience of women of different ethnicities",
                        "vi": "trải nghiệm đa dạng của phụ nữ thuộc các sắc tộc khác nhau"
                    }
                ]
            }
        ]
    },
    {
        "id": "9d99494470534a9b9ddfc2263cadfb76",
        "word": "ethnic minority",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌeθnɪk maɪˈnɒrəti/",
            "us": "/ˌeθnɪk maɪˈnɔːrəti/"
        },
        "nearby": [
            {
                "word": "ethnic cleansing",
                "pos": "noun"
            },
            {
                "word": "ethnicity",
                "pos": "noun"
            },
            {
                "word": "ethnic minority",
                "pos": "noun"
            },
            {
                "word": "ethnocentric",
                "pos": "adjective"
            },
            {
                "word": "ethnocentrism",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an ethnic group (= a group of people that share a cultural tradition, religion, etc.), or a member of this group, living in a country where the main ethnic group is different",
                    "vi": "một nhóm dân tộc (= một nhóm người có chung truyền thống văn hóa, tôn giáo, v.v.) hoặc một thành viên của nhóm này, sống ở một quốc gia mà nhóm dân tộc chính khác nhau"
                },
                "examples": [
                    {
                        "en": "The main political parties have little to offer Britain’s ethnic minorities.",
                        "vi": "Các đảng chính trị chính có rất ít sự ủng hộ của các dân tộc thiểu số ở Anh."
                    }
                ]
            }
        ]
    },
    {
        "id": "12a1c69aa2074626abddb1a106a64f69",
        "word": "mixed-race",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌmɪkst ˈreɪs/",
            "us": "/ˌmɪkst ˈreɪs/"
        },
        "nearby": [
            {
                "word": "mixed metaphor",
                "pos": "noun"
            },
            {
                "word": "mixed number",
                "pos": "noun"
            },
            {
                "word": "mixed-race",
                "pos": "adjective"
            },
            {
                "word": "mixed up",
                "pos": "adjective"
            },
            {
                "word": "mixer",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "involving people of different races, or having parents from different races",
                    "vi": "liên quan đến những người thuộc các chủng tộc khác nhau hoặc có cha mẹ từ các chủng tộc khác nhau"
                },
                "examples": [
                    {
                        "en": "a mixed-race child",
                        "vi": "một đứa trẻ thuộc chủng tộc hỗn hợp"
                    }
                ]
            }
        ]
    },
    {
        "id": "7c957c57e595413591c30b1c0d9becb3",
        "word": "multi-ethnic",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌmʌlti ˈeθnɪk/",
            "us": "/ˌmʌlti ˈeθnɪk/"
        },
        "nearby": [
            {
                "word": "multidimensional",
                "pos": "adjective"
            },
            {
                "word": "multidisciplinary",
                "pos": "adjective"
            },
            {
                "word": "multi-ethnic",
                "pos": "adjective"
            },
            {
                "word": "multifaceted",
                "pos": "adjective"
            },
            {
                "word": "multi-faith",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "consisting of people from many different ethnic groups",
                    "vi": "bao gồm những người từ nhiều dân tộc khác nhau"
                },
                "examples": [
                    {
                        "en": "New York City is one of the country’s most multi-ethnic cities.",
                        "vi": "Thành phố New York là một trong những thành phố đa sắc tộc nhất của đất nước."
                    }
                ]
            }
        ]
    },
    {
        "id": "1f7c7a294d6846979f2e7a5b2adc859e",
        "word": "segregation",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌseɡrɪˈɡeɪʃn/",
            "us": "/ˌseɡrɪˈɡeɪʃn/"
        },
        "nearby": [
            {
                "word": "segmentation",
                "pos": "noun"
            },
            {
                "word": "segregate",
                "pos": "verb"
            },
            {
                "word": "segregation",
                "pos": "noun"
            },
            {
                "word": "segregationist",
                "pos": "adjective"
            },
            {
                "word": "segregationist",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act or policy of separating people from different groups, for example people of different races, religions or sexes, and treating them in a different way",
                    "vi": "hành động hoặc chính sách tách mọi người khỏi các nhóm khác nhau, ví dụ như những người thuộc các chủng tộc, tôn giáo hoặc giới tính khác nhau và đối xử với họ theo một cách khác"
                },
                "examples": [
                    {
                        "en": "racial/religious segregation",
                        "vi": "phân biệt chủng tộc / tôn giáo"
                    },
                    {
                        "en": "segregation by age and sex",
                        "vi": "phân biệt theo tuổi và giới tính"
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of separating people or things from a larger group",
                    "vi": "hành động tách mọi người hoặc mọi thứ khỏi một nhóm lớn hơn"
                },
                "examples": [
                    {
                        "en": "The report recommends segregation of cyclists from both cars and pedestrians.",
                        "vi": "Báo cáo khuyến nghị tách biệt người đi xe đạp khỏi ô tô và người đi bộ."
                    },
                    {
                        "en": "the segregation of recycling waste into categories",
                        "vi": "sự phân loại rác thải tái chế thành các loại"
                    }
                ]
            }
        ]
    },
    {
        "id": "85369783e03844e8bf62aa9d837ad8e0",
        "word": "Afro-Caribbean",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌæfrəʊ kærɪˈbiːən/",
            "us": "/ˌæfrəʊ kærɪˈbiːən/"
        },
        "nearby": [
            {
                "word": "Afrikaner",
                "pos": "noun"
            },
            {
                "word": "Afrobeat",
                "pos": "noun"
            },
            {
                "word": "Afro-Caribbean",
                "pos": "noun"
            },
            {
                "word": "Afro-Caribbean",
                "pos": "adjective"
            },
            {
                "word": "Afrocentric",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who comes, or whose family comes, from the Caribbean and who is a member of a group of people who have dark skin and whose ancestors came from Africa",
                    "vi": "một người đến hoặc có gia đình đến từ vùng Caribê và là thành viên của một nhóm người có nước da ngăm đen và tổ tiên đến từ Châu Phi"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a5d34d2bc74645079a4da2c88c857180",
        "word": "apartheid",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/əˈpɑːtaɪt/",
            "us": "/əˈpɑːrtaɪt/"
        },
        "nearby": [
            {
                "word": "apart",
                "pos": "adverb"
            },
            {
                "word": "apart from",
                "pos": "preposition"
            },
            {
                "word": "apartheid",
                "pos": "noun"
            },
            {
                "word": "aparthotel",
                "pos": "noun"
            },
            {
                "word": "apartment",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the former political system in South Africa in which only white people had full political rights and other people, especially black people, were forced to live away from white people, go to separate schools, etc.",
                    "vi": "hệ thống chính trị trước đây ở Nam Phi, trong đó chỉ có người da trắng mới có đầy đủ quyền chính trị và những người khác, đặc biệt là người da đen, bị buộc phải sống xa rời người da trắng, đi học ở các trường riêng biệt, v.v."
                },
                "examples": [
                    {
                        "en": "under apartheid the pressures of life under apartheid",
                        "vi": "dưới chế độ phân biệt chủng tộc những áp lực của cuộc sống dưới chế độ phân biệt chủng tộc"
                    }
                ]
            }
        ]
    },
    {
        "id": "52d980cb7e974b06baf53bc4d930f5f5",
        "word": "BAME",
        "pos": "abbreviation",
        "level": "c2",
        "phonetic": {
            "uk": "/beɪm/",
            "us": "/beɪm/"
        },
        "nearby": [
            {
                "word": "bamboo",
                "pos": "noun"
            },
            {
                "word": "bamboozle",
                "pos": "verb"
            },
            {
                "word": "BAME",
                "pos": "abbreviation"
            },
            {
                "word": "ban",
                "pos": "verb"
            },
            {
                "word": "ban",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "black, Asian and minority ethnic (used in the UK to refer to people who are not white)",
                    "vi": "da đen, châu Á và dân tộc thiểu số (được sử dụng ở Vương quốc Anh để chỉ những người không phải là người da trắng)"
                },
                "examples": [
                    {
                        "en": "Around 20% of the teachers are from BAME backgrounds.",
                        "vi": "Khoảng 20% giáo viên là người gốc BAME."
                    }
                ]
            }
        ]
    },
    {
        "id": "5e64799cd09941fd9965f991de63abd1",
        "word": "BME",
        "pos": "abbreviation",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌbiː em ˈiː/",
            "us": "/ˌbiː em ˈiː/"
        },
        "nearby": [
            {
                "word": "Enid Blyton",
                "pos": ""
            },
            {
                "word": "the BMA",
                "pos": ""
            },
            {
                "word": "BME",
                "pos": "abbreviation"
            },
            {
                "word": "BMI",
                "pos": "abbreviation"
            },
            {
                "word": "The BMJ",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "black and minority ethnic (used in the UK to refer to people who are not white)",
                    "vi": "người da đen và dân tộc thiểu số (được sử dụng ở Vương quốc Anh để chỉ những người không phải là người da trắng)"
                },
                "examples": [
                    {
                        "en": "The research was based on focus groups of BME mothers of children under five.",
                        "vi": "Nghiên cứu dựa trên các nhóm tập trung gồm các bà mẹ có BME có con dưới 5 tuổi."
                    }
                ]
            }
        ]
    },
    {
        "id": "04346e0995c84ce4ab23dae3a1102692",
        "word": "Caucasian",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/kɔːˈkeɪʒn/",
            "us": "/kɔːˈkeɪʒn/"
        },
        "nearby": [
            {
                "word": "CATV",
                "pos": ""
            },
            {
                "word": "catwalk",
                "pos": "noun"
            },
            {
                "word": "Caucasian",
                "pos": "noun"
            },
            {
                "word": "Caucasian",
                "pos": "adjective"
            },
            {
                "word": "caucus",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a member of any of the groups of people who have pale skin",
                    "vi": "thành viên của bất kỳ nhóm người nào có làn da nhợt nhạt"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "4f30d5c453124b1689b04242d7cb97ac",
        "word": "Caucasian",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/kɔːˈkeɪʒn/",
            "us": "/kɔːˈkeɪʒn/"
        },
        "nearby": [
            {
                "word": "catwalk",
                "pos": "noun"
            },
            {
                "word": "Caucasian",
                "pos": "noun"
            },
            {
                "word": "Caucasian",
                "pos": "adjective"
            },
            {
                "word": "caucus",
                "pos": "noun"
            },
            {
                "word": "caucus",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "belonging to one of the groups of people who have pale skin",
                    "vi": "thuộc một trong những nhóm người có làn da nhợt nhạt"
                },
                "examples": [
                    {
                        "en": "The police are looking for a Caucasian male in his forties.",
                        "vi": "Cảnh sát đang tìm kiếm một người đàn ông da trắng khoảng bốn mươi tuổi."
                    }
                ]
            }
        ]
    },
    {
        "id": "da9da7b19e1046368fc6ff7a2005b6bf",
        "word": "Celt",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/kelt/",
            "us": "/kelt/"
        },
        "nearby": [
            {
                "word": "Celsius",
                "pos": "adjective"
            },
            {
                "word": "Celsius",
                "pos": "noun"
            },
            {
                "word": "Celt",
                "pos": "noun"
            },
            {
                "word": "CELTA",
                "pos": "noun"
            },
            {
                "word": "Celtic",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a member of a people from western Europe who settled in ancient Britain before the Romans came",
                    "vi": "một thành viên của một dân tộc từ Tây Âu đến định cư ở Anh cổ đại trước khi người La Mã đến"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a person whose ancestors were Celts, especially one from Ireland, Wales, Scotland, Cornwall or Brittany",
                    "vi": "một người có tổ tiên là người Celt, đặc biệt là một người đến từ Ireland, Wales, Scotland, Cornwall hoặc Brittany"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "01a2ca76bd8e4fe5a2d67c0a663554e0",
        "word": "Chicana",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/tʃɪˈkɑːnə/",
            "us": "/tʃɪˈkɑːnə/"
        },
        "nearby": [
            {
                "word": "Chicago",
                "pos": ""
            },
            {
                "word": "the Chicago Seven",
                "pos": ""
            },
            {
                "word": "Chicana",
                "pos": "noun"
            },
            {
                "word": "chicane",
                "pos": "noun"
            },
            {
                "word": "chicanery",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a girl or woman living in the US whose family came from Mexico",
                    "vi": "một cô gái hoặc phụ nữ sống ở Hoa Kỳ có gia đình đến từ Mexico"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "3ad79399ee4e4a65b3ceb8e07b615059",
        "word": "Chicano",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/tʃɪˈkɑːnəʊ/",
            "us": "/tʃɪˈkɑːnəʊ/"
        },
        "nearby": [
            {
                "word": "chicane",
                "pos": "noun"
            },
            {
                "word": "chicanery",
                "pos": "noun"
            },
            {
                "word": "Chicano",
                "pos": "noun"
            },
            {
                "word": "Chichester",
                "pos": ""
            },
            {
                "word": "Francis Chichester",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person living in the US whose family came from Mexico",
                    "vi": "một người sống ở Mỹ có gia đình đến từ Mexico"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "94a10aa6fc3b41f3a4ce1b348bbf5407",
        "word": "color bar",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkʌlə bɑː(r)/",
            "us": "/ˈkʌlər bɑːr/"
        },
        "nearby": [
            {
                "word": "coloration",
                "pos": "noun"
            },
            {
                "word": "coloratura",
                "pos": "noun"
            },
            {
                "word": "color bar",
                "pos": "noun"
            },
            {
                "word": "color-blind",
                "pos": "adjective"
            },
            {
                "word": "color code",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a social system that does not allow black people the same rights as white people",
                    "vi": "một hệ thống xã hội không cho phép người da đen có quyền như người da trắng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "9c2a9001f0944dd4880ff99572d577f7",
        "word": "color-blind",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkʌlə blaɪnd/",
            "us": "/ˈkʌlər blaɪnd/"
        },
        "nearby": [
            {
                "word": "coloratura",
                "pos": "noun"
            },
            {
                "word": "color bar",
                "pos": "noun"
            },
            {
                "word": "color-blind",
                "pos": "adjective"
            },
            {
                "word": "color code",
                "pos": "noun"
            },
            {
                "word": "color-code",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "unable to see the difference between some colors, especially red and green; unable to see colors at all (although this is rare in humans)",
                    "vi": "không thể nhìn thấy sự khác biệt giữa một số màu, đặc biệt là đỏ và xanh lá cây; hoàn toàn không thể nhìn thấy màu sắc (mặc dù điều này hiếm gặp ở người)"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "not considering skin color when deciding how to treat somebody, what job somebody should have, etc.",
                    "vi": "không xem xét màu da khi quyết định đối xử với ai đó như thế nào, công việc mà ai đó nên có, v.v."
                },
                "examples": [
                    {
                        "en": "color-blind casting (= giving roles to actors without considering their skin color)",
                        "vi": "tuyển diễn viên mù màu (= giao vai cho diễn viên mà không xem xét màu da của họ)"
                    }
                ]
            }
        ]
    },
    {
        "id": "da25780ba5774544affbcc679ad85d2d",
        "word": "colour bar",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkʌlə bɑː(r)/",
            "us": "/ˈkʌlər bɑːr/"
        },
        "nearby": [
            {
                "word": "colourant",
                "pos": "noun"
            },
            {
                "word": "colouration",
                "pos": "noun"
            },
            {
                "word": "colour bar",
                "pos": "noun"
            },
            {
                "word": "colour-blind",
                "pos": "adjective"
            },
            {
                "word": "colour blindness",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a social system that does not allow black people the same rights as white people",
                    "vi": "một hệ thống xã hội không cho phép người da đen có quyền như người da trắng"
                },
                "examples": [
                    {
                        "en": "South Africa’s colour bar made marriages between different races illegal.",
                        "vi": "Thanh màu của Nam Phi khiến hôn nhân giữa các chủng tộc khác nhau trở nên bất hợp pháp."
                    }
                ]
            }
        ]
    },
    {
        "id": "865b07f8a5a64af5a886ecec0f174f77",
        "word": "colour-blind",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkʌlə blaɪnd/",
            "us": "/ˈkʌlər blaɪnd/"
        },
        "nearby": [
            {
                "word": "colouration",
                "pos": "noun"
            },
            {
                "word": "colour bar",
                "pos": "noun"
            },
            {
                "word": "colour-blind",
                "pos": "adjective"
            },
            {
                "word": "colour blindness",
                "pos": "noun"
            },
            {
                "word": "colour code",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "unable to see the difference between some colours, especially red and green; unable to see colours at all (although this is rare in humans)",
                    "vi": "không thể nhìn thấy sự khác biệt giữa một số màu, đặc biệt là đỏ và xanh lá cây; hoàn toàn không thể nhìn thấy màu sắc (mặc dù điều này hiếm gặp ở người)"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "not considering skin colour when deciding how to treat somebody, what job somebody should have, etc.",
                    "vi": "không xem xét màu da khi quyết định đối xử với ai đó như thế nào, công việc mà ai đó nên có, v.v."
                },
                "examples": [
                    {
                        "en": "colour-blind casting (= giving roles to actors without considering their skin colour)",
                        "vi": "tuyển diễn viên mù màu (= giao vai cho diễn viên mà không xem xét màu da của họ)"
                    }
                ]
            }
        ]
    },
    {
        "id": "ad03ac5fcc2a4ac58fe70d386f49e2d6",
        "word": "Eurasian",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/juˈreɪʒn/",
            "us": "/juˈreɪʒn/"
        },
        "nearby": [
            {
                "word": "euphoria",
                "pos": "noun"
            },
            {
                "word": "euphoric",
                "pos": "adjective"
            },
            {
                "word": "Eurasian",
                "pos": "adjective"
            },
            {
                "word": "Eurasian",
                "pos": "noun"
            },
            {
                "word": "Euratom",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "of or connected with both Europe and Asia",
                    "vi": "trong số hoặc kết nối với cả Châu Âu và Châu Á"
                },
                "examples": [
                    {
                        "en": "the Centre for Russian and Eurasian Studies",
                        "vi": "Trung tâm Nghiên cứu Nga và Á-Âu"
                    },
                    {
                        "en": "the Eurasian badger",
                        "vi": "con lửng Âu Á"
                    }
                ]
            },
            {
                "define": {
                    "en": "having one Asian parent and one parent who is white or from Europe",
                    "vi": "có cha hoặc mẹ là người châu Á và cha hoặc mẹ là người da trắng hoặc đến từ châu Âu"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "65b9287c147c4ea1b340d6a6ed707ed8",
        "word": "Eurasian",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/juˈreɪʒn/",
            "us": "/juˈreɪʒn/"
        },
        "nearby": [
            {
                "word": "euphoric",
                "pos": "adjective"
            },
            {
                "word": "Eurasian",
                "pos": "adjective"
            },
            {
                "word": "Eurasian",
                "pos": "noun"
            },
            {
                "word": "Euratom",
                "pos": ""
            },
            {
                "word": "eureka",
                "pos": "exclamation"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person with one Asian parent and one parent who is white or from Europe",
                    "vi": "một người có cha hoặc mẹ là người Châu Á và cha / mẹ là người da trắng hoặc đến từ Châu Âu"
                },
                "examples": [
                    {
                        "en": "Singapore Eurasians",
                        "vi": "Singapore Âu-Á"
                    }
                ]
            }
        ]
    },
    {
        "id": "02659ba1c7744bb1868ac434ce3f45de",
        "word": "Hispanic",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/hɪˈspænɪk/",
            "us": "/hɪˈspænɪk/"
        },
        "nearby": [
            {
                "word": "his",
                "pos": "pronoun"
            },
            {
                "word": "His Master's Voice",
                "pos": ""
            },
            {
                "word": "Hispanic",
                "pos": "adjective"
            },
            {
                "word": "Hispanic",
                "pos": "noun"
            },
            {
                "word": "Hispanist",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "of or connected with Spain or Spanish-speaking countries, especially those of Latin America",
                    "vi": "hoặc kết nối với Tây Ban Nha hoặc các nước nói tiếng Tây Ban Nha, đặc biệt là các nước Mỹ Latinh"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "781c2f74e59a4384a003d0be9192c27a",
        "word": "Hispanic",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/hɪˈspænɪk/",
            "us": "/hɪˈspænɪk/"
        },
        "nearby": [
            {
                "word": "His Master's Voice",
                "pos": ""
            },
            {
                "word": "Hispanic",
                "pos": "adjective"
            },
            {
                "word": "Hispanic",
                "pos": "noun"
            },
            {
                "word": "Hispanist",
                "pos": "noun"
            },
            {
                "word": "Hispano-",
                "pos": "combining form"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person whose first language is Spanish, especially one from a Latin American country living in the US or Canada",
                    "vi": "một người có ngôn ngữ đầu tiên là tiếng Tây Ban Nha, đặc biệt là một người đến từ một quốc gia Mỹ Latinh sống ở Hoa Kỳ hoặc Canada"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "20560fc17f444f77907147ce343eedcb",
        "word": "Ku Klux Klan",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌkuː klʌks ˈklæn/",
            "us": "/ˌkuː klʌks ˈklæn/"
        },
        "nearby": [
            {
                "word": "kudu",
                "pos": "noun"
            },
            {
                "word": "kudzu",
                "pos": "noun"
            },
            {
                "word": "Ku Klux Klan",
                "pos": "noun"
            },
            {
                "word": "kulfi",
                "pos": "noun"
            },
            {
                "word": "Kumbh Mela",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a secret organization of white men in the southern states of the US who use violence to oppose social change and equal rights for black people",
                    "vi": "một tổ chức bí mật của những người đàn ông da trắng ở các bang miền nam nước Mỹ sử dụng bạo lực để phản đối sự thay đổi xã hội và đòi quyền bình đẳng cho người da đen"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "6299ee6a0fff4f9caf044530fce3aaf4",
        "word": "Latina",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/læˈtiːnə/",
            "us": "/læˈtiːnə/"
        },
        "nearby": [
            {
                "word": "Latin",
                "pos": "noun"
            },
            {
                "word": "Latin",
                "pos": "adjective"
            },
            {
                "word": "Latina",
                "pos": "adjective"
            },
            {
                "word": "Latina",
                "pos": "noun"
            },
            {
                "word": "Latin America",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "describing or connected with a Latina or with Latinas",
                    "vi": "mô tả hoặc kết nối với người Latina hoặc với người Latina"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "1891e4129e404801af32d02fb8fc6e80",
        "word": "Latina",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/læˈtiːnə/",
            "us": "/læˈtiːnə/"
        },
        "nearby": [
            {
                "word": "Latin",
                "pos": "adjective"
            },
            {
                "word": "Latina",
                "pos": "adjective"
            },
            {
                "word": "Latina",
                "pos": "noun"
            },
            {
                "word": "Latin America",
                "pos": "noun"
            },
            {
                "word": "Latin American",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a woman or girl, especially one who is living in the US, who comes from Latin America, or whose family came from there",
                    "vi": "một phụ nữ hoặc trẻ em gái, đặc biệt là một người đang sống ở Hoa Kỳ, người đến từ Châu Mỹ Latinh hoặc gia đình của họ đến từ đó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "cef1cad1be5f43ed81a1df4d4ce273cf",
        "word": "Latino",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/læˈtiːnəʊ/",
            "us": "/læˈtiːnəʊ/"
        },
        "nearby": [
            {
                "word": "Latinate",
                "pos": "adjective"
            },
            {
                "word": "Latin lover",
                "pos": "noun"
            },
            {
                "word": "Latino",
                "pos": "adjective"
            },
            {
                "word": "Latino",
                "pos": "noun"
            },
            {
                "word": "Latinx",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "describing or connected with a Latino or with Latinos",
                    "vi": "mô tả hoặc kết nối với người Latino hoặc với người Latinh"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "5a6ff4987e294f2bbe2a708368beec91",
        "word": "Latino",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/læˈtiːnəʊ/",
            "us": "/læˈtiːnəʊ/"
        },
        "nearby": [
            {
                "word": "Latin lover",
                "pos": "noun"
            },
            {
                "word": "Latino",
                "pos": "adjective"
            },
            {
                "word": "Latino",
                "pos": "noun"
            },
            {
                "word": "Latinx",
                "pos": "noun"
            },
            {
                "word": "Latinx",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person, especially one who is living in the US, who comes from Latin America, or whose family came from there",
                    "vi": "một người, đặc biệt là một người đang sống ở Mỹ, người đến từ Châu Mỹ Latinh hoặc gia đình của họ đến từ đó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "8dd20ed95346457e866a318f6cb0e20a",
        "word": "lynch",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/lɪntʃ/",
            "us": "/lɪntʃ/"
        },
        "nearby": [
            {
                "word": "lymphocyte",
                "pos": "noun"
            },
            {
                "word": "lymphoma",
                "pos": "noun"
            },
            {
                "word": "lynch",
                "pos": "verb"
            },
            {
                "word": "lynching",
                "pos": "noun"
            },
            {
                "word": "lynch mob",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "if a crowd of people lynch somebody whom they consider guilty of a crime, they capture them, do not allow them to have a trial in court, and kill them illegally, usually by hanging",
                    "vi": "Nếu một đám đông bắt giữ ai đó mà họ coi là phạm tội, họ bắt họ, không cho họ xét xử trước tòa, và giết họ một cách bất hợp pháp, thường là bằng cách treo cổ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "7747d1d620734b9bba45413ec00be7f0",
        "word": "lynching",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈlɪntʃɪŋ/",
            "us": "/ˈlɪntʃɪŋ/"
        },
        "nearby": [
            {
                "word": "lymphoma",
                "pos": "noun"
            },
            {
                "word": "lynch",
                "pos": "verb"
            },
            {
                "word": "lynching",
                "pos": "noun"
            },
            {
                "word": "lynch mob",
                "pos": "noun"
            },
            {
                "word": "lynchpin",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the illegal killing of somebody, usually by hanging, by a crowd of people and without a trial",
                    "vi": "giết người bất hợp pháp, thường bằng cách treo cổ, bởi một đám đông người và không xét xử"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "e266dba7bbac4b89b49caefff5dd66a0",
        "word": "lynch mob",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈlɪntʃ mɒb/",
            "us": "/ˈlɪntʃ mɑːb/"
        },
        "nearby": [
            {
                "word": "lynch",
                "pos": "verb"
            },
            {
                "word": "lynching",
                "pos": "noun"
            },
            {
                "word": "lynch mob",
                "pos": "noun"
            },
            {
                "word": "lynchpin",
                "pos": "noun"
            },
            {
                "word": "the Lyndon B Johnson Space Center",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a crowd of people who gather to lynch somebody",
                    "vi": "một đám đông tụ tập để lynch ai đó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c037fa0bb97b4d39aa640c697756ac33",
        "word": "multiracial",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌmʌltiˈreɪʃl/",
            "us": "/ˌmʌltiˈreɪʃl/"
        },
        "nearby": [
            {
                "word": "multiprocessor",
                "pos": "noun"
            },
            {
                "word": "multipurpose",
                "pos": "adjective"
            },
            {
                "word": "multiracial",
                "pos": "adjective"
            },
            {
                "word": "multi-skilling",
                "pos": "noun"
            },
            {
                "word": "multi-storey car park",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "including or involving people of several different races",
                    "vi": "bao gồm hoặc liên quan đến những người thuộc một số chủng tộc khác nhau"
                },
                "examples": [
                    {
                        "en": "a multiracial society",
                        "vi": "một xã hội đa chủng tộc"
                    },
                    {
                        "en": "The proposals were aimed at bringing a peaceful transition to multiracial democracy.",
                        "vi": "Các đề xuất nhằm mang lại một quá trình chuyển đổi hòa bình sang nền dân chủ đa chủng tộc."
                    },
                    {
                        "en": "The island has relatively high rates of multiracial folk.",
                        "vi": "Đảo có tỷ lệ dân gian đa chủng tộc tương đối cao."
                    }
                ]
            }
        ]
    },
    {
        "id": "5e4acd5390484a798087e3a2fa81c5eb",
        "word": "non-white",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌnɒn ˈwaɪt/",
            "us": "/ˌnɑːn ˈwaɪt/"
        },
        "nearby": [
            {
                "word": "non-violence",
                "pos": "noun"
            },
            {
                "word": "non-violent",
                "pos": "adjective"
            },
            {
                "word": "non-white",
                "pos": "noun"
            },
            {
                "word": "non-white",
                "pos": "adjective"
            },
            {
                "word": "noob",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who belongs to a group of people who do not have white skin",
                    "vi": "một người thuộc nhóm người không có làn da trắng."
                },
                "examples": [
                    {
                        "en": "the ratio of whites to non-whites",
                        "vi": "tỷ lệ giữa người da trắng và người không da trắng"
                    }
                ]
            }
        ]
    },
    {
        "id": "0d77953cd0f54e699a448a36bda8619e",
        "word": "non-white",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌnɒn ˈwaɪt/",
            "us": "/ˌnɑːn ˈwaɪt/"
        },
        "nearby": [
            {
                "word": "non-violent",
                "pos": "adjective"
            },
            {
                "word": "non-white",
                "pos": "noun"
            },
            {
                "word": "non-white",
                "pos": "adjective"
            },
            {
                "word": "noob",
                "pos": "noun"
            },
            {
                "word": "noodle",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "belonging to a group of people who do not have white skin",
                    "vi": "thuộc nhóm người không có làn da trắng."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "4c6f869308f6484c9a84b6dbdc90ff29",
        "word": "segregate",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈseɡrɪɡeɪt/",
            "us": "/ˈseɡrɪɡeɪt/"
        },
        "nearby": [
            {
                "word": "segmental",
                "pos": "adjective"
            },
            {
                "word": "segmentation",
                "pos": "noun"
            },
            {
                "word": "segregate",
                "pos": "verb"
            },
            {
                "word": "segregation",
                "pos": "noun"
            },
            {
                "word": "segregationist",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to separate people of different races, religions or sexes and treat them in a different way",
                    "vi": "để phân biệt những người thuộc các chủng tộc, tôn giáo hoặc giới tính khác nhau và đối xử với họ theo một cách khác"
                },
                "examples": [
                    {
                        "en": "a culture in which women are segregated from men",
                        "vi": "một nền văn hóa mà phụ nữ bị tách biệt với nam giới"
                    },
                    {
                        "en": "White people and black people were segregated into different parts of town.",
                        "vi": "Người da trắng và người da đen được tách biệt thành các khu vực khác nhau của thị trấn."
                    },
                    {
                        "en": "a racially segregated community",
                        "vi": "một cộng đồng tách biệt về chủng tộc"
                    },
                    {
                        "en": "a segregated school (= one for students of one race or religion only)",
                        "vi": "một trường học tách biệt (= một trường chỉ dành cho học sinh của một chủng tộc hoặc tôn giáo)"
                    }
                ]
            },
            {
                "define": {
                    "en": "to keep one thing separate from another",
                    "vi": "để giữ một thứ riêng biệt với một thứ khác"
                },
                "examples": [
                    {
                        "en": "Pedestrians are segregated from the traffic by a metal barrier.",
                        "vi": "Người đi bộ được ngăn cách với giao thông bằng một rào chắn kim loại."
                    },
                    {
                        "en": "It was proposed that patients be segregated into three categories: critical, moderate and mild.",
                        "vi": "Người ta đề xuất rằng bệnh nhân được chia thành ba loại: nguy kịch, trung bình và nhẹ."
                    }
                ]
            }
        ]
    },
    {
        "id": "56c2fa49319146fd842a2b095626bd7c",
        "word": "segregationist",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌseɡrɪˈɡeɪʃənɪst/",
            "us": "/ˌseɡrɪˈɡeɪʃənɪst/"
        },
        "nearby": [
            {
                "word": "segregate",
                "pos": "verb"
            },
            {
                "word": "segregation",
                "pos": "noun"
            },
            {
                "word": "segregationist",
                "pos": "adjective"
            },
            {
                "word": "segregationist",
                "pos": "noun"
            },
            {
                "word": "segue",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "believing that people from different groups should be separated and treated differently, especially according to their race",
                    "vi": "tin rằng mọi người từ các nhóm khác nhau nên được tách biệt và đối xử khác nhau, đặc biệt là theo chủng tộc của họ"
                },
                "examples": [
                    {
                        "en": "segregationist policies",
                        "vi": "chính sách phân ly"
                    }
                ]
            }
        ]
    },
    {
        "id": "a49de41f03c84fbe848380373459a415",
        "word": "segregationist",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌseɡrɪˈɡeɪʃənɪst/",
            "us": "/ˌseɡrɪˈɡeɪʃənɪst/"
        },
        "nearby": [
            {
                "word": "segregation",
                "pos": "noun"
            },
            {
                "word": "segregationist",
                "pos": "adjective"
            },
            {
                "word": "segregationist",
                "pos": "noun"
            },
            {
                "word": "segue",
                "pos": "verb"
            },
            {
                "word": "segue",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who believes that people from different groups should be separated and treated differently, especially according to their race",
                    "vi": "một người tin rằng mọi người từ các nhóm khác nhau nên được tách biệt và đối xử khác nhau, đặc biệt là theo chủng tộc của họ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "d0ca63fa58494713a5c264b679f8c084",
        "word": "supremacist",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/suˈpreməsɪst/",
            "us": "/suˈpreməsɪst/"
        },
        "nearby": [
            {
                "word": "supranational",
                "pos": "adjective"
            },
            {
                "word": "suprasegmental",
                "pos": "adjective"
            },
            {
                "word": "supremacist",
                "pos": "noun"
            },
            {
                "word": "supremacy",
                "pos": "noun"
            },
            {
                "word": "supreme",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who believes that the group of people they belong to is better than other groups and should have power over them",
                    "vi": "một người tin rằng nhóm người mà họ thuộc về tốt hơn các nhóm khác và nên có quyền lực đối với họ"
                },
                "examples": [
                    {
                        "en": "male supremacists",
                        "vi": "những người theo chủ nghĩa tối cao nam"
                    }
                ]
            }
        ]
    }
]