[
    {
        "id": "86a34bf99721457e94e5db126384aa8c",
        "word": "act",
        "pos": "verb",
        "level": "a2",
        "phonetic": {
            "uk": "/ækt/",
            "us": "/ækt/"
        },
        "nearby": [
            {
                "word": "acrylic",
                "pos": "adjective"
            },
            {
                "word": "acrylic",
                "pos": "noun"
            },
            {
                "word": "act",
                "pos": "verb"
            },
            {
                "word": "act",
                "pos": "noun"
            },
            {
                "word": "ACT",
                "pos": "abbreviation"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to do something for a particular purpose or in order to deal with a situation",
                    "vi": "để làm điều gì đó cho một mục đích cụ thể hoặc để đối phó với một tình huống"
                },
                "examples": [
                    {
                        "en": "act to do something It is vital that we act to stop the destruction of the rainforests.",
                        "vi": "hành động để làm điều gì đó Điều quan trọng là chúng ta phải hành động để ngăn chặn sự tàn phá các khu rừng nhiệt đới."
                    },
                    {
                        "en": "+ adv./prep. By acting quickly doctors saved her life.",
                        "vi": "Err:509"
                    },
                    {
                        "en": "The government was criticized for failing to act decisively.",
                        "vi": "Chính phủ đã bị chỉ trích vì đã không hành động một cách quyết đoán."
                    },
                    {
                        "en": "Initial reports indicated he acted alone.",
                        "vi": "Các báo cáo ban đầu chỉ ra rằng anh ta đã hành động một mình."
                    },
                    {
                        "en": "He claims he acted in self-defence.",
                        "vi": "Anh ta tuyên bố anh ta đã hành động để tự vệ."
                    },
                    {
                        "en": "We acted in good faith (= believing that we were doing the right thing).",
                        "vi": "Chúng tôi đã hành động một cách thiện chí (= tin rằng chúng tôi đang làm điều đúng đắn)."
                    },
                    {
                        "en": "They are acting out of self-interest.",
                        "vi": "Họ đang hành động vì tư lợi."
                    },
                    {
                        "en": "She was not acting for personal gain.",
                        "vi": "Cô ấy không hành động vì lợi ích cá nhân."
                    }
                ]
            },
            {
                "define": {
                    "en": "to behave in a particular way",
                    "vi": "cư xử theo một cách cụ thể"
                },
                "examples": [
                    {
                        "en": "+ adv. The man was seen acting suspiciously.",
                        "vi": "Err:509"
                    },
                    {
                        "en": "I think that most employers act responsibly in these situations.",
                        "vi": "Tôi nghĩ rằng hầu hết các nhà tuyển dụng đều hành động có trách nhiệm trong những tình huống này."
                    },
                    {
                        "en": "Decide what your priorities are and act accordingly (= in an appropriate way).",
                        "vi": "Quyết định ưu tiên của bạn là gì và hành động phù hợp (= theo cách thích hợp)."
                    },
                    {
                        "en": "act like somebody/something Stop acting like spoilt children!",
                        "vi": "hành động như ai đó / cái gì đó Hãy ngừng hành động như những đứa trẻ hư hỏng!"
                    },
                    {
                        "en": "act as if/though… She was acting as if she'd seen a ghost.",
                        "vi": "hành động như thể / mặc dù… Cô ấy đang hành động như thể cô ấy đã nhìn thấy một con ma."
                    }
                ]
            },
            {
                "define": {
                    "en": "to perform a part in a play or film",
                    "vi": "để biểu diễn một phần trong một vở kịch hoặc một bộ phim"
                },
                "examples": [
                    {
                        "en": "Have you ever acted?",
                        "vi": "Bạn đã từng hành động chưa?"
                    },
                    {
                        "en": "He just can't act.",
                        "vi": "Anh ấy không thể hành động."
                    },
                    {
                        "en": "Most of the cast act well.",
                        "vi": "Hầu hết các diễn viên đều diễn xuất tốt."
                    },
                    {
                        "en": "The play was well acted.",
                        "vi": "Vở kịch đã được diễn xuất tốt."
                    },
                    {
                        "en": "Who's acting the part of Hamlet?",
                        "vi": "Ai sẽ đóng vai Hamlet?"
                    },
                    {
                        "en": "She is acting the role of Juliet.",
                        "vi": "Cô ấy đang đóng vai Juliet."
                    }
                ]
            },
            {
                "define": {
                    "en": "to pretend by your behaviour to be a particular type of person",
                    "vi": "giả vờ bằng hành vi của bạn là một kiểu người cụ thể"
                },
                "examples": [
                    {
                        "en": "+ noun He's been acting the devoted husband all day.",
                        "vi": "Err:509"
                    },
                    {
                        "en": "+ adj. I decided to act dumb.",
                        "vi": "Err:509"
                    },
                    {
                        "en": "to act weird/strange/normal/stupid",
                        "vi": "hành động kỳ lạ / kỳ lạ / bình thường / ngu ngốc"
                    },
                    {
                        "en": "He acts all macho, but he’s a real softie underneath.",
                        "vi": "Anh ấy hành động như một nam nhi, nhưng bên dưới anh ấy là một người mềm mại thực sự."
                    }
                ]
            },
            {
                "define": {
                    "en": "to perform a particular role or function",
                    "vi": "để thực hiện một vai trò hoặc chức năng cụ thể"
                },
                "examples": [
                    {
                        "en": "act as something She acted as an adviser to the committee.",
                        "vi": "hành động như một cái gì đó Cô ấy đã đóng vai trò là một cố vấn cho ủy ban."
                    },
                    {
                        "en": "Can you act as interpreter?",
                        "vi": "Bạn có thể hoạt động như một thông dịch viên?"
                    },
                    {
                        "en": "We hope this sentence will act as a deterrent to others.",
                        "vi": "Chúng tôi hy vọng bản án này sẽ có tác dụng răn đe những người khác."
                    },
                    {
                        "en": "Culture can act as a powerful catalyst for urban regeneration.",
                        "vi": "Văn hóa có thể đóng vai trò như một chất xúc tác mạnh mẽ để tái tạo đô thị."
                    },
                    {
                        "en": "The council is only really acting as an agent.",
                        "vi": "Hội đồng chỉ thực sự hoạt động như một đại lý."
                    },
                    {
                        "en": "act like something hormones in the brain that act like natural painkillers",
                        "vi": "hoạt động giống như một thứ gì đó kích thích tố trong não hoạt động giống như thuốc giảm đau tự nhiên"
                    }
                ]
            },
            {
                "define": {
                    "en": "to have an effect on something",
                    "vi": "có ảnh hưởng đến một cái gì đó"
                },
                "examples": [
                    {
                        "en": "Alcohol acts quickly on the brain.",
                        "vi": "Rượu tác động nhanh lên não."
                    },
                    {
                        "en": "It took a few minutes for the drug to act.",
                        "vi": "Phải mất vài phút để thuốc phát huy tác dụng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to behave in a stupid way in order to make people laugh, especially in a way that may also annoy them",
                    "vi": "cư xử một cách ngu ngốc để chọc cười mọi người, đặc biệt là theo cách có thể khiến họ khó chịu"
                },
                "examples": [
                    {
                        "en": "Quit playing the fool and get some work done!",
                        "vi": "Đừng chơi trò ngu ngốc và hoàn thành một số công việc!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to behave in a way that is suitable for somebody of your age and not as though you were much younger",
                    "vi": "cư xử theo cách phù hợp với ai đó ở độ tuổi của bạn chứ không phải như thể bạn trẻ hơn nhiều"
                },
                "examples": [
                    {
                        "en": "Isn’t it time you started acting your age?",
                        "vi": "Đó không phải là thời gian bạn bắt đầu diễn xuất tuổi của bạn?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to behave in a very confident way that annoys other people, for example by telling them what to do",
                    "vi": "cư xử một cách rất tự tin khiến người khác khó chịu, chẳng hạn như bằng cách nói với họ phải làm gì"
                },
                "examples": [
                    {
                        "en": "She was acting as if she owned the place.",
                        "vi": "Cô ấy đang hành động như thể cô ấy làm chủ nơi này."
                    }
                ]
            }
        ]
    },
    {
        "id": "8ee1730664654f94823758a020ca1f26",
        "word": "perform",
        "pos": "verb",
        "level": "a2",
        "phonetic": {
            "uk": "/pəˈfɔːm/",
            "us": "/pərˈfɔːrm/"
        },
        "nearby": [
            {
                "word": "perforation",
                "pos": "noun"
            },
            {
                "word": "perforce",
                "pos": "adverb"
            },
            {
                "word": "perform",
                "pos": "verb"
            },
            {
                "word": "performance",
                "pos": "noun"
            },
            {
                "word": "performance art",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to entertain an audience by playing a piece of music, acting in a play, etc.",
                    "vi": "để giải trí cho khán giả bằng cách chơi một bản nhạc, diễn xuất trong một vở kịch, v.v."
                },
                "examples": [
                    {
                        "en": "to perform a song/dance/play",
                        "vi": "để biểu diễn một bài hát / khiêu vũ / chơi"
                    },
                    {
                        "en": "The play was first performed in 2007.",
                        "vi": "Vở kịch được công diễn lần đầu tiên vào năm 2007."
                    },
                    {
                        "en": "Visiting artists will perform their music and poetry.",
                        "vi": "Các nghệ sĩ đến thăm sẽ biểu diễn âm nhạc và thơ ca của họ."
                    },
                    {
                        "en": "I'm looking forward to seeing you perform.",
                        "vi": "Tôi rất mong được xem bạn biểu diễn."
                    },
                    {
                        "en": "I'd love to see them perform live (= in a live show, not a recording).",
                        "vi": "Tôi muốn xem họ biểu diễn trực tiếp (= trong một chương trình trực tiếp, không phải ghi âm)."
                    },
                    {
                        "en": "What do you like about performing on stage?",
                        "vi": "Bạn thích điều gì khi biểu diễn trên sân khấu?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to do something, such as a piece of work, task or duty",
                    "vi": "để làm điều gì đó, chẳng hạn như một phần của công việc, nhiệm vụ hoặc nghĩa vụ"
                },
                "examples": [
                    {
                        "en": "She performs an important role in our organization.",
                        "vi": "Cô ấy đóng một vai trò quan trọng trong tổ chức của chúng tôi."
                    },
                    {
                        "en": "A computer can perform many tasks at once.",
                        "vi": "Một máy tính có thể thực hiện nhiều tác vụ cùng một lúc."
                    },
                    {
                        "en": "to perform a function/duty",
                        "vi": "để thực hiện một chức năng / nhiệm vụ"
                    },
                    {
                        "en": "to perform an analysis/a test/an experiment",
                        "vi": "để thực hiện một phân tích / một thử nghiệm / một thử nghiệm"
                    },
                    {
                        "en": "to perform a ceremony/ritual",
                        "vi": "để thực hiện một buổi lễ / nghi lễ"
                    },
                    {
                        "en": "(medical) to perform an operation/a procedure/surgery",
                        "vi": "(y tế) để thực hiện một ca phẫu thuật / một thủ thuật / phẫu thuật"
                    },
                    {
                        "en": "The procedure was performed safely on ten patients.",
                        "vi": "Thủ tục được thực hiện an toàn trên mười bệnh nhân."
                    }
                ]
            },
            {
                "define": {
                    "en": "to work or function well or badly",
                    "vi": "làm việc hoặc hoạt động tốt hay xấu"
                },
                "examples": [
                    {
                        "en": "The engine seems to be performing well.",
                        "vi": "Động cơ dường như đang hoạt động tốt."
                    },
                    {
                        "en": "The company has been performing poorly over the past year.",
                        "vi": "Công ty đã hoạt động kém hiệu quả trong năm qua."
                    },
                    {
                        "en": "England's players perform better for their clubs than for their country.",
                        "vi": "Các cầu thủ của Anh thể hiện tốt hơn cho câu lạc bộ của họ hơn là cho đất nước của họ."
                    },
                    {
                        "en": "to perform admirably/brilliantly/strongly",
                        "vi": "hoạt động đáng ngưỡng mộ / xuất sắc / mạnh mẽ"
                    },
                    {
                        "en": "She performed less well in the second test.",
                        "vi": "Cô ấy thể hiện kém hơn trong bài kiểm tra thứ hai."
                    },
                    {
                        "en": "They gather information on how businesses are performing.",
                        "vi": "Họ thu thập thông tin về cách các doanh nghiệp đang hoạt động."
                    },
                    {
                        "en": "If Bale performs (= performs well) then I believe Wales can win.",
                        "vi": "Nếu Bale thực hiện (= thực hiện tốt) thì tôi tin rằng Xứ Wales có thể giành chiến thắng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to achieve very good results",
                    "vi": "để đạt được kết quả rất tốt"
                },
                "examples": [
                    {
                        "en": "Her exercise programme has worked miracles for her.",
                        "vi": "Chương trình tập thể dục của cô ấy đã mang lại những điều kỳ diệu cho cô ấy."
                    },
                    {
                        "en": "You can work miracles with very little money if you follow our home decoration tips.",
                        "vi": "Bạn có thể làm nên những điều kỳ diệu với rất ít tiền nếu làm theo các mẹo trang trí nhà cửa của chúng tôi."
                    },
                    {
                        "en": "He performed miracles to get everything ready in time.",
                        "vi": "Anh ấy đã thực hiện phép màu để mọi thứ sẵn sàng kịp thời."
                    }
                ]
            }
        ]
    },
    {
        "id": "7827acaf3f7d483a9adde8bf8dbeb718",
        "word": "costume",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈkɒstjuːm/",
            "us": "/ˈkɑːstuːm/"
        },
        "nearby": [
            {
                "word": "the cost of living",
                "pos": "noun"
            },
            {
                "word": "cost price",
                "pos": "noun"
            },
            {
                "word": "costume",
                "pos": "noun"
            },
            {
                "word": "costumed",
                "pos": "adjective"
            },
            {
                "word": "costume drama",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the clothes worn by people from a particular place or during a particular historical period",
                    "vi": "quần áo được mặc bởi những người từ một địa điểm cụ thể hoặc trong một giai đoạn lịch sử cụ thể"
                },
                "examples": [
                    {
                        "en": "an exhibition of Victorian costumes",
                        "vi": "triển lãm trang phục thời Victoria"
                    },
                    {
                        "en": "She wore a traditional costume of bright pink silk.",
                        "vi": "Cô diện trang phục truyền thống lụa hồng rực rỡ."
                    },
                    {
                        "en": "in… costume a painting of an old woman in Welsh costume",
                        "vi": "trong… trang phục một bức tranh vẽ một bà già trong trang phục xứ Wales"
                    },
                    {
                        "en": "Many locals dressed in period costume (= typical of a particular time in history) for the celebrations.",
                        "vi": "Nhiều người dân địa phương mặc trang phục thời kỳ (= điển hình của một thời điểm cụ thể trong lịch sử) cho lễ kỷ niệm."
                    }
                ]
            },
            {
                "define": {
                    "en": "the clothes worn by actors in a play or film, or worn by somebody to make them look like somebody/something else",
                    "vi": "quần áo của các diễn viên mặc trong một vở kịch hoặc bộ phim hoặc được ai đó mặc để khiến họ trông giống ai đó / thứ gì đó khác"
                },
                "examples": [
                    {
                        "en": "The former dancer has also designed the costumes.",
                        "vi": "Cựu vũ công cũng đã thiết kế trang phục."
                    },
                    {
                        "en": "The costumes for this production were gorgeous.",
                        "vi": "Trang phục cho sản xuất này rất lộng lẫy."
                    },
                    {
                        "en": "They are already planning their costumes for Halloween.",
                        "vi": "Họ đã lên kế hoạch trang phục cho Halloween."
                    },
                    {
                        "en": "in a costume He went to the party in a giant chicken costume.",
                        "vi": "trong một bộ trang phục. Anh ấy đến bữa tiệc trong một bộ trang phục con gà khổng lồ."
                    },
                    {
                        "en": "in costume The actors were still in costume and make-up.",
                        "vi": "trong trang phục Các diễn viên vẫn mặc trang phục và trang điểm."
                    },
                    {
                        "en": "She has four costume changes during the play.",
                        "vi": "Cô ấy có bốn lần thay đổi trang phục trong suốt vở kịch."
                    },
                    {
                        "en": "a costume designer",
                        "vi": "một nhà thiết kế trang phục"
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of clothing worn for swimming, especially the type worn by women and girls",
                    "vi": "một bộ quần áo mặc khi đi bơi, đặc biệt là loại quần áo của phụ nữ và trẻ em gái"
                },
                "examples": [
                    {
                        "en": "If you’d like a swim, we can lend you a costume.",
                        "vi": "Nếu bạn muốn bơi, chúng tôi có thể cho bạn mượn trang phục."
                    }
                ]
            }
        ]
    },
    {
        "id": "c37be728f77f477c976b73b0c0e253a1",
        "word": "direct",
        "pos": "verb",
        "level": "b1",
        "phonetic": {
            "uk": "/dəˈrekt/",
            "us": "/dəˈrekt/"
        },
        "nearby": [
            {
                "word": "dire",
                "pos": "adjective"
            },
            {
                "word": "direct",
                "pos": "adjective"
            },
            {
                "word": "direct",
                "pos": "verb"
            },
            {
                "word": "direct",
                "pos": "adverb"
            },
            {
                "word": "direct access",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to control or be in charge of somebody/something",
                    "vi": "để kiểm soát hoặc phụ trách ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "He was asked to take command and direct operations.",
                        "vi": "Anh ta được yêu cầu nắm quyền chỉ huy và chỉ đạo các hoạt động."
                    },
                    {
                        "en": "A police officer was directing traffic.",
                        "vi": "Một cảnh sát đang chỉ đạo giao thông."
                    },
                    {
                        "en": "How much should the teacher guide and direct the students?",
                        "vi": "Giáo viên nên hướng dẫn và chỉ đạo học sinh ở mức độ nào?"
                    },
                    {
                        "en": "A new manager has been appointed to direct the project.",
                        "vi": "Một nhà quản lý mới đã được chỉ định để chỉ đạo dự án."
                    },
                    {
                        "en": "The campaign was carefully directed from party central office.",
                        "vi": "Chiến dịch được chỉ đạo cẩn thận từ văn phòng trung ương đảng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be in charge of actors in a play or film, or musicians in a band, orchestra, etc.",
                    "vi": "phụ trách các diễn viên trong một vở kịch hoặc bộ phim, hoặc các nhạc sĩ trong ban nhạc, dàn nhạc, v.v."
                },
                "examples": [
                    {
                        "en": "She prefers to act rather than direct.",
                        "vi": "Cô ấy thích hành động hơn là chỉ đạo."
                    },
                    {
                        "en": "direct somebody/something He directed the school play.",
                        "vi": "chỉ đạo ai đó / cái gì đó Anh ấy đã chỉ đạo vở kịch của trường."
                    },
                    {
                        "en": "The film was written and directed by Sofia Coppola.",
                        "vi": "Phim do Sofia Coppola viết kịch bản và đạo diễn."
                    },
                    {
                        "en": "She now directs a large choir.",
                        "vi": "Bây giờ cô ấy chỉ đạo một dàn hợp xướng lớn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to aim something at a particular goal or person, or in a particular direction",
                    "vi": "để nhắm một cái gì đó vào một mục tiêu hoặc một người cụ thể, hoặc theo một hướng cụ thể"
                },
                "examples": [
                    {
                        "en": "direct something to something/somebody He directed his attention to the next task.",
                        "vi": "hướng điều gì đó đến điều gì đó / ai đó Anh ấy hướng sự chú ý của mình vào nhiệm vụ tiếp theo."
                    },
                    {
                        "en": "direct something towards/toward something/somebody All our efforts should be directed towards helping those who need it.",
                        "vi": "hướng điều gì đó về phía / về phía điều gì đó / ai đó Mọi nỗ lực của chúng ta nên hướng tới việc giúp đỡ những người cần nó."
                    },
                    {
                        "en": "direct something at something/somebody Her criticism was directed at her own superiors.",
                        "vi": "chỉ đạo điều gì đó vào một cái gì đó / ai đó Lời chỉ trích của cô ấy là nhắm vào cấp trên của chính cô ấy."
                    },
                    {
                        "en": "She directs her gaze straight at the viewer.",
                        "vi": "Cô hướng ánh nhìn thẳng vào người xem."
                    },
                    {
                        "en": "The book is directed at younger readers.",
                        "vi": "Cuốn sách hướng đến những độc giả nhỏ tuổi."
                    },
                    {
                        "en": "direct something against something/somebody Most of his anger was directed against himself.",
                        "vi": "hướng điều gì đó chống lại điều gì đó / ai đó Hầu hết sự tức giận của anh ấy hướng đến chính anh ấy."
                    },
                    {
                        "en": "direct something + adv./prep. He directed the light straight in her face.",
                        "vi": "trực tiếp điều gì đó + adv./prep. Anh hướng ánh sáng thẳng vào mặt cô."
                    }
                ]
            },
            {
                "define": {
                    "en": "to tell or show somebody how to get to somewhere or where to go",
                    "vi": "để nói hoặc chỉ cho ai đó cách đến một nơi nào đó hoặc đi đâu"
                },
                "examples": [
                    {
                        "en": "direct somebody It's not far—I'll direct you.",
                        "vi": "chỉ đạo ai đó Nó không xa — tôi sẽ chỉ dẫn cho bạn."
                    },
                    {
                        "en": "direct somebody to something Could you direct me to the station?",
                        "vi": "hướng dẫn ai đó đến điều gì đó Bạn có thể chỉ dẫn tôi đến nhà ga được không?"
                    },
                    {
                        "en": "He was directed to a table beside the window.",
                        "vi": "Anh ta được dẫn đến một cái bàn bên cạnh cửa sổ."
                    },
                    {
                        "en": "direct somebody + adv./prep. The app directs you along the best cycle route to your destination.",
                        "vi": "trực tiếp ai đó + adv./prep. Ứng dụng hướng dẫn bạn dọc theo tuyến đường chu kỳ tốt nhất để đến đích của bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to give an official order",
                    "vi": "để đưa ra một đơn đặt hàng chính thức"
                },
                "examples": [
                    {
                        "en": "direct somebody to do something The police officers had been directed to search the building.",
                        "vi": "chỉ đạo ai đó làm điều gì đó Các nhân viên cảnh sát đã được chỉ đạo để khám xét tòa nhà."
                    },
                    {
                        "en": "direct that… The judge directed that the mother be given custody of the children.",
                        "vi": "chỉ đạo rằng… Thẩm phán chỉ đạo rằng người mẹ được trao quyền nuôi con."
                    },
                    {
                        "en": "(British English also) The judge directed that the mother should be given custody of the children.",
                        "vi": "(Anh Anh cũng vậy) Thẩm phán chỉ đạo rằng người mẹ nên được trao quyền nuôi con."
                    }
                ]
            },
            {
                "define": {
                    "en": "to send a letter, etc. to a particular place or to a particular person",
                    "vi": "để gửi một lá thư, v.v. đến một nơi cụ thể hoặc cho một người cụ thể"
                },
                "examples": [
                    {
                        "en": "Direct any complaints to the Customer Services department.",
                        "vi": "Gửi bất kỳ khiếu nại nào đến bộ phận Dịch vụ khách hàng."
                    },
                    {
                        "en": "I directed my question to the chairman.",
                        "vi": "Tôi chuyển câu hỏi của mình cho chủ tọa."
                    },
                    {
                        "en": "Inquiries should be directed to Mark Davis.",
                        "vi": "Các câu hỏi nên được chuyển đến Mark Davis."
                    }
                ]
            }
        ]
    },
    {
        "id": "a3d4ad8c71eb4928800fe5b1fc3b3b69",
        "word": "performance",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/pəˈfɔːməns/",
            "us": "/pərˈfɔːrməns/"
        },
        "nearby": [
            {
                "word": "perforce",
                "pos": "adverb"
            },
            {
                "word": "perform",
                "pos": "verb"
            },
            {
                "word": "performance",
                "pos": "noun"
            },
            {
                "word": "performance art",
                "pos": "noun"
            },
            {
                "word": "performance-enhancing",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act of performing a play, concert or some other form of entertainment",
                    "vi": "hành động biểu diễn một vở kịch, buổi hòa nhạc hoặc một số hình thức giải trí khác"
                },
                "examples": [
                    {
                        "en": "The performance starts at seven.",
                        "vi": "Buổi biểu diễn bắt đầu lúc bảy giờ."
                    },
                    {
                        "en": "an evening performance",
                        "vi": "một buổi biểu diễn buổi tối"
                    },
                    {
                        "en": "They put on performances for the tourists.",
                        "vi": "Họ biểu diễn cho khách du lịch."
                    },
                    {
                        "en": "This was one of the band's rare live performances.",
                        "vi": "Đây là một trong những buổi biểu diễn trực tiếp hiếm hoi của ban nhạc."
                    },
                    {
                        "en": "performance of something They gave a performance of Ravel’s String Quartet",
                        "vi": "biểu diễn của một cái gì đó Họ đã trình diễn Bộ tứ chuỗi của Ravel"
                    },
                    {
                        "en": "performance by somebody/something a series of performances by the Kirov Ballet",
                        "vi": "màn trình diễn của ai đó / cái gì đó một loạt các buổi biểu diễn của Kirov Ballet"
                    }
                ]
            },
            {
                "define": {
                    "en": "the way a person performs in a play, concert, etc.",
                    "vi": "cách một người biểu diễn trong một vở kịch, buổi hòa nhạc, v.v."
                },
                "examples": [
                    {
                        "en": "She gave the greatest performance of her career.",
                        "vi": "Cô ấy đã cống hiến một màn trình diễn tuyệt vời nhất trong sự nghiệp của mình."
                    },
                    {
                        "en": "Both actors deliver outstanding performances.",
                        "vi": "Cả hai diễn viên đều mang đến những màn trình diễn xuất sắc."
                    },
                    {
                        "en": "an excellent/a fine/an impressive performance",
                        "vi": "một xuất sắc / một tốt / một màn trình diễn ấn tượng"
                    }
                ]
            },
            {
                "define": {
                    "en": "how well or badly you do something; how well or badly something works",
                    "vi": "bạn làm việc gì đó tốt hay xấu; cái gì đó hoạt động tốt hay xấu như thế nào"
                },
                "examples": [
                    {
                        "en": "the country's strong economic performance over the last two years",
                        "vi": "hoạt động kinh tế mạnh mẽ của đất nước trong hai năm qua"
                    },
                    {
                        "en": "It was an impressive performance by the French team.",
                        "vi": "Đó là một màn trình diễn ấn tượng của đội tuyển Pháp."
                    },
                    {
                        "en": "He criticized the recent poor performance of the company.",
                        "vi": "Ông chỉ trích hoạt động kém hiệu quả gần đây của công ty."
                    },
                    {
                        "en": "Her academic performance has been inconsistent.",
                        "vi": "Kết quả học tập của cô ấy không ổn định."
                    },
                    {
                        "en": "Profits continue to grow, with strong performances in South America and the Far East.",
                        "vi": "Lợi nhuận tiếp tục tăng với hiệu suất mạnh mẽ ở Nam Mỹ và Viễn Đông."
                    },
                    {
                        "en": "The team has continued to improve performance.",
                        "vi": "Đội đã tiếp tục cải thiện hiệu suất."
                    },
                    {
                        "en": "This machine delivers excellent performance at a very competitive price.",
                        "vi": "Máy này mang lại hiệu suất tuyệt vời với mức giá rất cạnh tranh."
                    },
                    {
                        "en": "to measure/evaluate the performance of somebody/something",
                        "vi": "để đo lường / đánh giá hiệu suất của ai đó / cái gì đó"
                    },
                    {
                        "en": "high-performance (= very powerful) cars",
                        "vi": "xe hiệu suất cao (= rất mạnh)"
                    },
                    {
                        "en": "performance indicators (= things that show how well or badly something is working)",
                        "vi": "chỉ số hiệu suất (= những thứ cho biết một thứ gì đó đang hoạt động tốt hay không tốt như thế nào)"
                    }
                ]
            },
            {
                "define": {
                    "en": "the act or process of performing a task, an action, etc.",
                    "vi": "hành động hoặc quá trình thực hiện một nhiệm vụ, một hành động, v.v."
                },
                "examples": [
                    {
                        "en": "She has shown enthusiasm in the performance of her duties.",
                        "vi": "Cô ấy đã thể hiện sự nhiệt tình trong việc thực hiện nhiệm vụ của mình."
                    },
                    {
                        "en": "He did not want a repeat performance of the humiliating defeat he had suffered.",
                        "vi": "Anh không muốn một màn trình diễn lặp lại thất bại nhục nhã mà anh đã phải gánh chịu."
                    },
                    {
                        "en": "The party are dreading a repeat performance of their defeat in the last election.",
                        "vi": "Đảng đang sợ một màn trình diễn lặp lại thất bại của họ trong cuộc bầu cử vừa qua."
                    }
                ]
            },
            {
                "define": {
                    "en": "an act that involves a lot of effort or trouble, sometimes when it is not necessary",
                    "vi": "một hành động đòi hỏi nhiều nỗ lực hoặc rắc rối, đôi khi không cần thiết"
                },
                "examples": [
                    {
                        "en": "It's such a performance getting the children off to school in the morning.",
                        "vi": "Đó là một màn trình diễn đưa bọn trẻ đến trường vào buổi sáng."
                    },
                    {
                        "en": "He always goes through the whole performance of checking the oil and water even if we’re in a hurry.",
                        "vi": "Anh ấy luôn thực hiện toàn bộ quá trình kiểm tra dầu và nước ngay cả khi chúng tôi đang vội."
                    }
                ]
            }
        ]
    },
    {
        "id": "4d5963b2dc2e428db6421904323f4766",
        "word": "script",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/skrɪpt/",
            "us": "/skrɪpt/"
        },
        "nearby": [
            {
                "word": "scrimp",
                "pos": "verb"
            },
            {
                "word": "scrip",
                "pos": "noun"
            },
            {
                "word": "script",
                "pos": "noun"
            },
            {
                "word": "script",
                "pos": "verb"
            },
            {
                "word": "scripted",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a written text of a play, film, broadcast, talk, etc.",
                    "vi": "một văn bản của một vở kịch, bộ phim, chương trình phát sóng, bài nói chuyện, v.v."
                },
                "examples": [
                    {
                        "en": "That line isn't in the original script.",
                        "vi": "Dòng đó không có trong kịch bản gốc."
                    },
                    {
                        "en": "a film script",
                        "vi": "một kịch bản phim"
                    },
                    {
                        "en": "to write/read a script",
                        "vi": "để viết / đọc một kịch bản"
                    },
                    {
                        "en": "We're currently working on a script.",
                        "vi": "Chúng tôi hiện đang làm việc trên một kịch bản."
                    },
                    {
                        "en": "He was reading from a prepared script.",
                        "vi": "Anh ấy đang đọc từ một kịch bản đã chuẩn bị sẵn."
                    }
                ]
            },
            {
                "define": {
                    "en": "writing done by hand",
                    "vi": "viết bằng tay"
                },
                "examples": [
                    {
                        "en": "She admired his neat script.",
                        "vi": "Cô ngưỡng mộ kịch bản gọn gàng của anh ta."
                    }
                ]
            },
            {
                "define": {
                    "en": "a set of letters in which a language is written",
                    "vi": "một tập hợp các chữ cái trong đó một ngôn ngữ được viết"
                },
                "examples": [
                    {
                        "en": "a document in Cyrillic script (= used to write Russian and some other languages)",
                        "vi": "một tài liệu bằng chữ viết Kirin (= dùng để viết tiếng Nga và một số ngôn ngữ khác)"
                    }
                ]
            },
            {
                "define": {
                    "en": "a candidate’s written answer or answers in an exam",
                    "vi": "câu trả lời bằng văn bản của ứng viên hoặc câu trả lời trong một kỳ thi"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a series of instructions for a computer, carried out in a particular order, for example when a link in a website is clicked",
                    "vi": "một loạt các hướng dẫn cho máy tính, được thực hiện theo một thứ tự cụ thể, chẳng hạn như khi một liên kết trong một trang web được nhấp vào"
                },
                "examples": [
                    {
                        "en": "The bug was caused by an error in the script.",
                        "vi": "Lỗi là do lỗi trong tập lệnh."
                    }
                ]
            }
        ]
    },
    {
        "id": "049ca096f4e74b20a8a90a7bd3126088",
        "word": "set",
        "pos": "verb",
        "level": "b1",
        "phonetic": {
            "uk": "/set/",
            "us": "/set/"
        },
        "nearby": [
            {
                "word": "session",
                "pos": "noun"
            },
            {
                "word": "session musician",
                "pos": "noun"
            },
            {
                "word": "set",
                "pos": "verb"
            },
            {
                "word": "set",
                "pos": "noun"
            },
            {
                "word": "set",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to prepare or arrange something so that it is ready for use or in position",
                    "vi": "chuẩn bị hoặc sắp xếp thứ gì đó để nó sẵn sàng sử dụng hoặc ở vị trí"
                },
                "examples": [
                    {
                        "en": "set something Have you set the alarm clock?",
                        "vi": "đặt một cái gì đó Bạn đã đặt đồng hồ báo thức chưa?"
                    },
                    {
                        "en": "set something + adv.prep. She set the camera on automatic.",
                        "vi": "đặt cái gì đó + adv.prep. Cô ấy đặt máy ảnh ở chế độ tự động."
                    },
                    {
                        "en": "I set my watch by (= make it show the same time as) the TV.",
                        "vi": "Tôi đặt đồng hồ của mình bằng (= làm cho đồng hồ hiển thị cùng giờ với) TV."
                    },
                    {
                        "en": "Set the alarm for 7 o'clock.",
                        "vi": "Đặt báo thức lúc 7 giờ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to arrange knives, forks, etc. on a table for a meal",
                    "vi": "sắp xếp dao, nĩa, v.v. trên bàn ăn"
                },
                "examples": [
                    {
                        "en": "set a/the table Can you help me set the table?",
                        "vi": "set a / the table Bạn có thể giúp tôi đặt cái bàn được không?"
                    },
                    {
                        "en": "set a/the table for somebody/something Could you set the table for dinner?",
                        "vi": "set a / the table for somebody / something Bạn có thể dọn bàn ăn tối được không?"
                    },
                    {
                        "en": "The table was set for six guests.",
                        "vi": "Bàn được đặt cho sáu khách."
                    }
                ]
            },
            {
                "define": {
                    "en": "to fix something so that others copy it or try to achieve it",
                    "vi": "sửa một cái gì đó để người khác sao chép nó hoặc cố gắng đạt được nó"
                },
                "examples": [
                    {
                        "en": "This could set a new fashion.",
                        "vi": "Điều này có thể thiết lập một thời trang mới."
                    },
                    {
                        "en": "They set high standards of customer service.",
                        "vi": "Họ đặt ra các tiêu chuẩn cao về dịch vụ khách hàng."
                    },
                    {
                        "en": "I am unwilling to set a precedent.",
                        "vi": "Tôi không muốn thiết lập một tiền lệ."
                    },
                    {
                        "en": "She set a new world record for the high jump.",
                        "vi": "Cô đã lập kỷ lục thế giới mới cho môn nhảy cao."
                    },
                    {
                        "en": "I rely on you to set a good example.",
                        "vi": "Tôi dựa vào bạn để làm gương tốt."
                    },
                    {
                        "en": "The opening scene sets the tone for the rest of the movie.",
                        "vi": "Cảnh mở đầu tạo nên âm hưởng cho phần còn lại của bộ phim."
                    }
                ]
            },
            {
                "define": {
                    "en": "to give somebody a piece of work to do or a task or target to achieve",
                    "vi": "giao cho ai đó một phần công việc phải làm hoặc một nhiệm vụ hoặc mục tiêu để đạt được"
                },
                "examples": [
                    {
                        "en": "set something Who will be setting (= writing the questions for) the French exam?",
                        "vi": "đặt điều gì Ai sẽ sắp đặt (= viết câu hỏi cho) kỳ thi tiếng Pháp?"
                    },
                    {
                        "en": "The government has set a growth target of 6%.",
                        "vi": "Chính phủ đã đặt mục tiêu tăng trưởng là 6%."
                    },
                    {
                        "en": "set something for something What books have been set (= are to be studied) for the English course?",
                        "vi": "set something for something Sách nào đã được thiết lập (= sẽ được học) cho khóa học tiếng Anh?"
                    },
                    {
                        "en": "set something for somebody/yourself She's set a difficult task for herself.",
                        "vi": "đặt điều gì đó cho ai đó / bản thân Cô ấy đang đặt ra một nhiệm vụ khó khăn cho chính mình."
                    },
                    {
                        "en": "He likes to set challenging goals for himself.",
                        "vi": "Anh ấy thích đặt ra những mục tiêu thử thách cho bản thân."
                    },
                    {
                        "en": "set somebody/yourself something She's set herself a difficult task.",
                        "vi": "đặt cho ai đó / cho mình một việc gì đó Cô ấy tự đặt cho mình một nhiệm vụ khó khăn."
                    },
                    {
                        "en": "set somebody/yourself to do something I've set myself to finish the job by the end of the month.",
                        "vi": "yêu cầu ai đó / chính bạn làm điều gì đó mà tôi đã tự đặt mình để hoàn thành công việc vào cuối tháng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to arrange or fix something; to decide on something",
                    "vi": "để sắp xếp hoặc sửa chữa một cái gì đó; để quyết định một cái gì đó"
                },
                "examples": [
                    {
                        "en": "They haven't set a date for their wedding yet.",
                        "vi": "Họ vẫn chưa ấn định ngày tổ chức đám cưới của mình."
                    },
                    {
                        "en": "The government has set strict limits on public spending this year.",
                        "vi": "Chính phủ đã đặt ra các giới hạn nghiêm ngặt đối với chi tiêu công trong năm nay."
                    },
                    {
                        "en": "We can't just let the global corporations set the agenda (= decide what is important) every time.",
                        "vi": "Chúng ta không thể để các tập đoàn toàn cầu thiết lập chương trình nghị sự (= quyết định điều gì là quan trọng) mọi lúc."
                    },
                    {
                        "en": "Set a time limit for your studying each night.",
                        "vi": "Đặt giới hạn thời gian cho việc học của bạn mỗi đêm."
                    },
                    {
                        "en": "Individual countries don't really set the price of oil.",
                        "vi": "Các quốc gia riêng lẻ không thực sự ấn định giá dầu."
                    }
                ]
            },
            {
                "define": {
                    "en": "to place the action of a play, novel or film in a particular place, time, etc.",
                    "vi": "để đặt hành động của một vở kịch, tiểu thuyết hoặc phim ở một địa điểm, thời gian cụ thể, v.v."
                },
                "examples": [
                    {
                        "en": "be set + adv./prep. The novel is set in London in the 1960s.",
                        "vi": "được đặt + adv./prep. Cuốn tiểu thuyết lấy bối cảnh ở London vào những năm 1960."
                    },
                    {
                        "en": "The movie is set in Los Angeles in the year 2019.",
                        "vi": "Phim lấy bối cảnh ở Los Angeles vào năm 2019."
                    },
                    {
                        "en": "This powerful drama is set against the backdrop of the Civil War.",
                        "vi": "Bộ phim truyền hình mạnh mẽ này được đặt trong bối cảnh của Nội chiến."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be located in a particular place",
                    "vi": "được đặt ở một nơi cụ thể"
                },
                "examples": [
                    {
                        "en": "be set + adv./prep. The house is set in fifty acres of parkland.",
                        "vi": "được đặt + adv./prep. Ngôi nhà nằm trong khu đất công viên rộng 50 mẫu Anh."
                    }
                ]
            },
            {
                "define": {
                    "en": "to put something/somebody in a particular place or position",
                    "vi": "để đặt một cái gì đó / ai đó ở một nơi hoặc vị trí cụ thể"
                },
                "examples": [
                    {
                        "en": "She set a tray down on the table.",
                        "vi": "Cô đặt một cái khay xuống bàn."
                    },
                    {
                        "en": "They ate everything that was set in front of them.",
                        "vi": "Họ ăn tất cả mọi thứ được bày ra trước mặt."
                    },
                    {
                        "en": "When she fell he picked her up and set her on her feet again.",
                        "vi": "Khi cô ngã, anh ta đã bế cô lên và đặt cô đứng lên một lần nữa."
                    }
                ]
            },
            {
                "define": {
                    "en": "to cause somebody/something to be in a particular state; to start something happening",
                    "vi": "khiến ai đó / cái gì đó ở trong một trạng thái cụ thể; để bắt đầu một cái gì đó đang xảy ra"
                },
                "examples": [
                    {
                        "en": "set somebody/something + adv./prep. Her manner immediately set everyone at their ease.",
                        "vi": "đặt ai đó / cái gì đó + adv./prep. Phong thái của cô ấy ngay lập tức khiến mọi người cảm thấy thoải mái."
                    },
                    {
                        "en": "He pulled the lever and set the machine in motion.",
                        "vi": "Anh kéo cần gạt và đặt máy chuyển động."
                    },
                    {
                        "en": "The new leader has set the party on the road to success.",
                        "vi": "Người lãnh đạo mới đã đưa cả nhóm đi trên con đường thành công."
                    },
                    {
                        "en": "Demonstrators set two cars on fire.",
                        "vi": "Người biểu tình đốt cháy hai xe ô tô."
                    },
                    {
                        "en": "Demonstrators set fire to two cars.",
                        "vi": "Người biểu tình phóng hỏa hai xe ô tô."
                    },
                    {
                        "en": "set somebody/something + adj. The hijackers set the hostages free.",
                        "vi": "đặt ai đó / cái gì đó + adj. Những kẻ không tặc giải phóng con tin."
                    },
                    {
                        "en": "set somebody/something doing something Her remarks set me thinking.",
                        "vi": "thiết lập ai đó / điều gì đó làm điều gì đó Nhận xét của cô ấy khiến tôi phải suy nghĩ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to go down below the horizon",
                    "vi": "đi xuống dưới đường chân trời"
                },
                "examples": [
                    {
                        "en": "We sat and watched the sun setting.",
                        "vi": "Chúng tôi ngồi và nhìn mặt trời lặn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to put a precious stone into a piece of jewellery",
                    "vi": "đặt một viên đá quý thành một món đồ trang sức"
                },
                "examples": [
                    {
                        "en": "set A in B She had the sapphire set in a gold ring.",
                        "vi": "set A in B Cô ấy đã đặt viên sapphire trong một chiếc nhẫn vàng."
                    },
                    {
                        "en": "set B with A Her bracelet was set with emeralds.",
                        "vi": "bộ B với A Vòng tay của cô được đặt bằng ngọc lục bảo."
                    }
                ]
            },
            {
                "define": {
                    "en": "to become solid or hard",
                    "vi": "trở nên rắn hay cứng"
                },
                "examples": [
                    {
                        "en": "Leave the concrete to set for a few hours.",
                        "vi": "Để bê tông đông kết trong vài giờ."
                    },
                    {
                        "en": "+ adj. The glue had set hard.",
                        "vi": "Err:509"
                    }
                ]
            },
            {
                "define": {
                    "en": "to fix your face into a determined expression",
                    "vi": "để sửa khuôn mặt của bạn thành một biểu cảm kiên quyết"
                },
                "examples": [
                    {
                        "en": "Her jaw was set in a determined manner.",
                        "vi": "Hàm của cô ấy được thiết lập một cách kiên quyết."
                    }
                ]
            },
            {
                "define": {
                    "en": "to arrange somebody’s hair while it is wet so that it dries in a particular style",
                    "vi": "sắp xếp tóc của ai đó trong khi tóc ướt để tóc khô theo một kiểu cụ thể"
                },
                "examples": [
                    {
                        "en": "She had her hair washed and set.",
                        "vi": "Cô ấy đã gội đầu và chải đầu."
                    }
                ]
            },
            {
                "define": {
                    "en": "to put a broken bone into a fixed position and hold it there, so that it will join together again and get better; to get better in this way",
                    "vi": "đặt xương gãy vào một vị trí cố định và giữ ở đó, để xương liền lại với nhau và mau khỏi; để trở nên tốt hơn theo cách này"
                },
                "examples": [
                    {
                        "en": "The surgeon set her broken arm.",
                        "vi": "Các bác sĩ phẫu thuật đặt cánh tay bị gãy của cô ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to use a machine or computer to arrange writing and images on pages in order to prepare a book, newspaper, etc. for printing",
                    "vi": "sử dụng máy hoặc máy tính để sắp xếp chữ viết và hình ảnh trên các trang để chuẩn bị in sách, báo, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to write music to go with words",
                    "vi": "viết nhạc đi kèm với lời nói"
                },
                "examples": [
                    {
                        "en": "Schubert set many poems to music.",
                        "vi": "Schubert đã phổ nhạc nhiều bài thơ."
                    }
                ]
            }
        ]
    },
    {
        "id": "dd8e7da4f1274e0d8b44bc4bc7adefba",
        "word": "cue",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/kjuː/",
            "us": "/kjuː/"
        },
        "nearby": [
            {
                "word": "cudgel",
                "pos": "noun"
            },
            {
                "word": "cudgel",
                "pos": "verb"
            },
            {
                "word": "cue",
                "pos": "noun"
            },
            {
                "word": "cue",
                "pos": "verb"
            },
            {
                "word": "cue ball",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an action or event that is a signal for somebody to do something",
                    "vi": "một hành động hoặc sự kiện là tín hiệu cho ai đó làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "cue (for something) Jon's arrival was a cue for more champagne.",
                        "vi": "gợi ý (vì điều gì đó) Sự đến của Jon là một gợi ý cho thêm rượu sâm panh."
                    },
                    {
                        "en": "cue to do something I think that's my cue to explain why I'm here.",
                        "vi": "gợi ý để làm điều gì đó Tôi nghĩ đó là gợi ý của tôi để giải thích tại sao tôi ở đây."
                    }
                ]
            },
            {
                "define": {
                    "en": "a few words or an action in a play that is a signal for another actor to do something",
                    "vi": "một vài từ hoặc một hành động trong vở kịch là tín hiệu cho một diễn viên khác làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "She stood in the wings and waited for her cue to go on.",
                        "vi": "Cô đứng trong cánh và chờ tín hiệu của mình tiếp tục."
                    },
                    {
                        "en": "She had not yet been given the cue to go on to the stage.",
                        "vi": "Cô vẫn chưa được gợi ý để bước lên sân khấu."
                    }
                ]
            },
            {
                "define": {
                    "en": "a long wooden stick with a leather tip, used for hitting the ball in the games of billiards, pool and snooker",
                    "vi": "một thanh gỗ dài có đầu bằng da, dùng để đánh bóng trong các trò chơi bida, bida và bi da"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "at exactly the moment you expect or that is appropriate",
                    "vi": "vào đúng thời điểm bạn mong đợi hoặc điều đó là thích hợp"
                },
                "examples": [
                    {
                        "en": "‘Where is that boy?’ As if on cue, Simon appeared in the doorway.",
                        "vi": "Cậu ấy ở đâu vậy?' Như được báo trước, Simon xuất hiện ở ngưỡng cửa."
                    },
                    {
                        "en": "I can't just cry on cue!",
                        "vi": "Tôi không thể chỉ khóc vì gợi ý!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to copy what somebody else does as an example of how to behave or what to do",
                    "vi": "sao chép những gì người khác làm như một ví dụ về cách cư xử hoặc những gì phải làm"
                },
                "examples": [
                    {
                        "en": "Investors are taking their cue from the big banks and selling dollars.",
                        "vi": "Các nhà đầu tư đang lấy tín hiệu của họ từ các ngân hàng lớn và bán đô la."
                    },
                    {
                        "en": "They all took their cue from their leader.",
                        "vi": "Tất cả đều lấy tín hiệu từ người lãnh đạo của họ."
                    }
                ]
            }
        ]
    },
    {
        "id": "4df95fe15d7446b79968e52365a612d9",
        "word": "produce",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/prəˈdjuːs/",
            "us": "/prəˈduːs/"
        },
        "nearby": [
            {
                "word": "prodigy",
                "pos": "noun"
            },
            {
                "word": "The Prodigy",
                "pos": ""
            },
            {
                "word": "produce",
                "pos": "verb"
            },
            {
                "word": "produce",
                "pos": "noun"
            },
            {
                "word": "producer",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to make things to be sold, especially in large quantities",
                    "vi": "để làm cho những thứ được bán, đặc biệt là với số lượng lớn"
                },
                "examples": [
                    {
                        "en": "Our company mainly produces goods for export.",
                        "vi": "Công ty chúng tôi chủ yếu sản xuất hàng hóa để xuất khẩu."
                    },
                    {
                        "en": "We pride ourselves on producing high-quality products.",
                        "vi": "Chúng tôi tự hào về việc sản xuất các sản phẩm chất lượng cao."
                    },
                    {
                        "en": "The local factory produces electronic components.",
                        "vi": "Nhà máy địa phương sản xuất các linh kiện điện tử."
                    }
                ]
            },
            {
                "define": {
                    "en": "to grow or make something as part of a natural process; to have a baby or young animal",
                    "vi": "để phát triển hoặc tạo ra thứ gì đó như một phần của quá trình tự nhiên; sinh con hoặc động vật non"
                },
                "examples": [
                    {
                        "en": "The region produces over 50 per cent of the country's wheat.",
                        "vi": "Khu vực này sản xuất hơn 50% lúa mì của cả nước."
                    },
                    {
                        "en": "I would like to find out more about how our food is produced.",
                        "vi": "Tôi muốn tìm hiểu thêm về cách thức sản xuất thực phẩm của chúng tôi."
                    },
                    {
                        "en": "All our meat is locally produced.",
                        "vi": "Tất cả thịt của chúng tôi đều được sản xuất tại địa phương."
                    },
                    {
                        "en": "These shrubs produce bright red berries.",
                        "vi": "Những cây bụi này tạo ra những quả mọng màu đỏ tươi."
                    },
                    {
                        "en": "Under stress, the body produces adrenalin.",
                        "vi": "Khi bị căng thẳng, cơ thể sản xuất adrenalin."
                    },
                    {
                        "en": "Our cat produced kittens last week.",
                        "vi": "Con mèo của chúng tôi đã sản xuất mèo con vào tuần trước."
                    },
                    {
                        "en": "Her duty was to produce an heir to the throne.",
                        "vi": "Nhiệm vụ của cô là tạo ra một người thừa kế ngai vàng."
                    },
                    {
                        "en": "produce something from something The wine is produced from Chardonnay grapes.",
                        "vi": "sản xuất một cái gì đó từ một cái gì đó Rượu được sản xuất từ nho Chardonnay."
                    }
                ]
            },
            {
                "define": {
                    "en": "to create something, especially when skill is needed",
                    "vi": "để tạo ra thứ gì đó, đặc biệt là khi cần có kỹ năng"
                },
                "examples": [
                    {
                        "en": "She produced a delicious meal out of a few leftovers.",
                        "vi": "Cô ấy đã tạo ra một bữa ăn ngon lành từ một ít thức ăn thừa."
                    },
                    {
                        "en": "By 1912 he was producing purely abstract works.",
                        "vi": "Đến năm 1912, ông đã sản xuất các tác phẩm hoàn toàn trừu tượng."
                    },
                    {
                        "en": "United produced their best performance of the season.",
                        "vi": "United đã tạo ra màn trình diễn tốt nhất của họ trong mùa giải."
                    },
                    {
                        "en": "He produces reports on economic and social trends for manufacturers and trade associations.",
                        "vi": "Ông đưa ra các báo cáo về xu hướng kinh tế và xã hội cho các nhà sản xuất và hiệp hội thương mại."
                    }
                ]
            },
            {
                "define": {
                    "en": "to cause a particular result or effect",
                    "vi": "để gây ra một kết quả hoặc hiệu ứng cụ thể"
                },
                "examples": [
                    {
                        "en": "A phone call to the manager produced the result she wanted.",
                        "vi": "Một cuộc điện thoại cho người quản lý đã tạo ra kết quả mà cô ấy mong muốn."
                    },
                    {
                        "en": "His words failed to produce the desired effect.",
                        "vi": "Lời nói của anh ta không tạo được hiệu quả như mong muốn."
                    },
                    {
                        "en": "These reforms will produce little change.",
                        "vi": "Những cải cách này sẽ tạo ra ít thay đổi."
                    },
                    {
                        "en": "The drug produces a feeling of excitement.",
                        "vi": "Thuốc tạo cảm giác hưng phấn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to show something or make something appear from somewhere",
                    "vi": "để hiển thị một cái gì đó hoặc làm cho một cái gì đó xuất hiện từ một nơi nào đó"
                },
                "examples": [
                    {
                        "en": "produce something from/out of something He produced a letter from his pocket.",
                        "vi": "sản xuất một cái gì đó từ / ra một cái gì đó Anh ấy đã sản xuất một bức thư từ trong túi của mình."
                    },
                    {
                        "en": "produce something She failed to produce any evidence to support these claims.",
                        "vi": "sản xuất một cái gì đó Cô ấy không đưa ra được bất kỳ bằng chứng nào để hỗ trợ những tuyên bố này."
                    },
                    {
                        "en": "At the meeting the finance director produced the figures for the previous year.",
                        "vi": "Tại cuộc họp, giám đốc tài chính đưa ra các số liệu của năm trước."
                    }
                ]
            },
            {
                "define": {
                    "en": "if a town, country, etc. produces somebody with a particular skill or quality, the person comes from that town, country, etc.",
                    "vi": "nếu một thị trấn, quốc gia, v.v. tạo ra một người nào đó có kỹ năng hoặc phẩm chất cụ thể, thì người đó đến từ thị trấn, quốc gia đó, v.v."
                },
                "examples": [
                    {
                        "en": "He is the greatest athlete this country has ever produced.",
                        "vi": "Anh ấy là vận động viên vĩ đại nhất mà đất nước này từng sản sinh ra."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be in charge of preparing a film, play, etc. for the public to see",
                    "vi": "chịu trách nhiệm chuẩn bị một bộ phim, vở kịch, v.v. cho công chúng xem"
                },
                "examples": [
                    {
                        "en": "She produced a TV series about adopted children.",
                        "vi": "Cô đã sản xuất một bộ phim truyền hình về những người con nuôi."
                    }
                ]
            }
        ]
    },
    {
        "id": "dbf9d4674edd4da9a3ce784374ee72ae",
        "word": "production",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/prəˈdʌkʃn/",
            "us": "/prəˈdʌkʃn/"
        },
        "nearby": [
            {
                "word": "producer",
                "pos": "noun"
            },
            {
                "word": "product",
                "pos": "noun"
            },
            {
                "word": "production",
                "pos": "noun"
            },
            {
                "word": "production line",
                "pos": "noun"
            },
            {
                "word": "production number",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the process of growing or making food, goods or materials, especially large quantities",
                    "vi": "quá trình trồng trọt hoặc làm thực phẩm, hàng hóa hoặc vật liệu, đặc biệt là số lượng lớn"
                },
                "examples": [
                    {
                        "en": "food/oil production",
                        "vi": "sản xuất thực phẩm / dầu"
                    },
                    {
                        "en": "The new plant is due to begin production next year.",
                        "vi": "Nhà máy mới sẽ bắt đầu được sản xuất vào năm sau."
                    },
                    {
                        "en": "Production of the new aircraft will start next year.",
                        "vi": "Việc sản xuất máy bay mới sẽ bắt đầu vào năm sau."
                    },
                    {
                        "en": "in production The new model will be in production by the end of the year.",
                        "vi": "trong sản xuất Mẫu mới sẽ được sản xuất vào cuối năm nay."
                    },
                    {
                        "en": "The car goes into production later this year.",
                        "vi": "Chiếc xe sẽ được sản xuất vào cuối năm nay."
                    },
                    {
                        "en": "This model went out of production last year.",
                        "vi": "Mô hình này đã hết sản xuất vào năm ngoái."
                    },
                    {
                        "en": "production costs/processes",
                        "vi": "chi phí / quy trình sản xuất"
                    },
                    {
                        "en": "Prices have fallen below the cost of production.",
                        "vi": "Giá đã giảm xuống dưới giá thành sản xuất."
                    }
                ]
            },
            {
                "define": {
                    "en": "the quantity of goods that is produced",
                    "vi": "số lượng hàng hóa được sản xuất"
                },
                "examples": [
                    {
                        "en": "a decline/an increase in production",
                        "vi": "sự suy giảm / sự gia tăng sản xuất"
                    },
                    {
                        "en": "The goal is to increase production by 40%.",
                        "vi": "Mục tiêu là tăng sản lượng lên 40%."
                    },
                    {
                        "en": "Industries boosted production last month.",
                        "vi": "Các ngành công nghiệp đã thúc đẩy sản xuất trong tháng trước."
                    },
                    {
                        "en": "Production declined by 20%.",
                        "vi": "Sản lượng giảm 20%."
                    },
                    {
                        "en": "Production will drop by 60 000 next year.",
                        "vi": "Sản lượng sẽ giảm 60 000 vào năm tới."
                    },
                    {
                        "en": "It is important not to let production levels fall.",
                        "vi": "Điều quan trọng là không để mức sản xuất giảm."
                    },
                    {
                        "en": "Market demand could outpace production capacity.",
                        "vi": "Nhu cầu thị trường có thể vượt xa năng lực sản xuất."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act or process of making something naturally",
                    "vi": "hành động hoặc quá trình tạo ra một cái gì đó một cách tự nhiên"
                },
                "examples": [
                    {
                        "en": "Eating cheese stimulates the production of saliva.",
                        "vi": "Ăn pho mát kích thích sản xuất nước bọt."
                    },
                    {
                        "en": "Exposure to sunlight increases the production of melanin.",
                        "vi": "Tiếp xúc với ánh nắng mặt trời làm tăng sản xuất sắc tố melanin."
                    },
                    {
                        "en": "Green tea inhibits the production of this enzyme.",
                        "vi": "Trà xanh ức chế sản xuất enzym này."
                    }
                ]
            },
            {
                "define": {
                    "en": "a film, play or broadcast that is prepared for the public; the act of preparing a film, play, etc.",
                    "vi": "một bộ phim, vở kịch hoặc chương trình phát sóng được chuẩn bị cho công chúng; hành động chuẩn bị một bộ phim, vở kịch, v.v."
                },
                "examples": [
                    {
                        "en": "a new production of ‘King Lear’",
                        "vi": "một sản phẩm mới của 'King Lear'"
                    },
                    {
                        "en": "The college will be staging a production of 'The Wizard of Oz'.",
                        "vi": "Trường đại học sẽ tổ chức sản xuất phim 'The Wizard of Oz'."
                    },
                    {
                        "en": "Every year the school puts on a musical production.",
                        "vi": "Mỗi năm trường tổ chức một buổi sản xuất âm nhạc."
                    },
                    {
                        "en": "He wants a career in film production.",
                        "vi": "Anh ấy muốn có một sự nghiệp sản xuất phim."
                    },
                    {
                        "en": "in production Series four is currently in production.",
                        "vi": "trong sản xuất Dòng bốn hiện đang được sản xuất."
                    },
                    {
                        "en": "The film goes into production next year.",
                        "vi": "Bộ phim sẽ được sản xuất vào năm sau."
                    }
                ]
            },
            {
                "define": {
                    "en": "when you show something",
                    "vi": "khi bạn thể hiện một cái gì đó"
                },
                "examples": [
                    {
                        "en": "Discounts only on production of your student ID card.",
                        "vi": "Giảm giá chỉ khi xuất trình thẻ sinh viên của bạn."
                    }
                ]
            }
        ]
    },
    {
        "id": "86e9f8dbb6674905bf13f49307b47702",
        "word": "rehearsal",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/rɪˈhɜːsl/",
            "us": "/rɪˈhɜːrsl/"
        },
        "nearby": [
            {
                "word": "rehear",
                "pos": "verb"
            },
            {
                "word": "rehearing",
                "pos": "noun"
            },
            {
                "word": "rehearsal",
                "pos": "noun"
            },
            {
                "word": "rehearsal dinner",
                "pos": "noun"
            },
            {
                "word": "rehearse",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "time that is spent practising a play or piece of music in preparation for a public performance",
                    "vi": "thời gian dành để luyện tập một vở kịch hoặc một bản nhạc để chuẩn bị cho buổi biểu diễn trước công chúng"
                },
                "examples": [
                    {
                        "en": "to have a rehearsal",
                        "vi": "để có một buổi diễn tập"
                    },
                    {
                        "en": "We only had six days of rehearsal.",
                        "vi": "Chúng tôi chỉ có sáu ngày diễn tập."
                    },
                    {
                        "en": "The leading man broke his leg in the middle of rehearsals.",
                        "vi": "Người dẫn đầu bị gãy chân giữa buổi tập."
                    },
                    {
                        "en": "rehearsal for something rehearsals for ‘Romeo and Juliet’",
                        "vi": "diễn tập cho một cái gì đó diễn tập cho 'Romeo và Juliet'"
                    },
                    {
                        "en": "in rehearsal Our new production of ‘Hamlet’ is currently in rehearsal.",
                        "vi": "đang diễn tập Sản phẩm mới của chúng tôi 'Hamlet' hiện đang trong quá trình diễn tập."
                    },
                    {
                        "en": "a rehearsal room",
                        "vi": "một phòng tập"
                    }
                ]
            },
            {
                "define": {
                    "en": "an experience or event that helps to prepare you for something that is going to happen in the future",
                    "vi": "một trải nghiệm hoặc sự kiện giúp bạn chuẩn bị cho điều gì đó sẽ xảy ra trong tương lai"
                },
                "examples": [
                    {
                        "en": "These training exercises are designed to be a rehearsal for the invasion.",
                        "vi": "Các bài tập huấn luyện này được thiết kế để trở thành một cuộc diễn tập cho cuộc xâm lược."
                    },
                    {
                        "en": "Life is not a rehearsal.",
                        "vi": "Cuộc sống không phải là một cuộc diễn tập."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of repeating something that has been said before",
                    "vi": "hành động lặp lại điều gì đó đã được nói trước đó"
                },
                "examples": [
                    {
                        "en": "We listened to his lengthy rehearsal of the arguments.",
                        "vi": "Chúng tôi đã lắng nghe cuộc diễn tập kéo dài của anh ấy về các lập luận."
                    }
                ]
            }
        ]
    },
    {
        "id": "11a5bf9136ed44edb94538389939ae9b",
        "word": "rehearse",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/rɪˈhɜːs/",
            "us": "/rɪˈhɜːrs/"
        },
        "nearby": [
            {
                "word": "rehearsal",
                "pos": "noun"
            },
            {
                "word": "rehearsal dinner",
                "pos": "noun"
            },
            {
                "word": "rehearse",
                "pos": "verb"
            },
            {
                "word": "reheat",
                "pos": "verb"
            },
            {
                "word": "William H Rehnquist",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to practise or make people practise a play, piece of music, etc. in preparation for a public performance",
                    "vi": "để luyện tập hoặc yêu cầu mọi người luyện tập một vở kịch, bản nhạc, v.v. để chuẩn bị cho buổi biểu diễn trước công chúng"
                },
                "examples": [
                    {
                        "en": "rehearse (for something) We were given only two weeks to rehearse.",
                        "vi": "diễn tập (cho một cái gì đó) Chúng tôi chỉ có hai tuần để diễn tập."
                    },
                    {
                        "en": "We're rehearsing for the show.",
                        "vi": "Chúng tôi đang tập dượt cho buổi biểu diễn."
                    },
                    {
                        "en": "rehearse something/somebody Today, we'll just be rehearsing the final scene.",
                        "vi": "diễn tập một cái gì đó / ai đó Hôm nay, chúng ta sẽ diễn tập cảnh cuối cùng."
                    },
                    {
                        "en": "The actors were poorly rehearsed.",
                        "vi": "Các diễn viên đã được tập dượt kém."
                    }
                ]
            },
            {
                "define": {
                    "en": "to prepare in your mind or practise privately what you are going to do or say to somebody",
                    "vi": "chuẩn bị trong tâm trí của bạn hoặc thực hành một cách riêng tư những gì bạn sẽ làm hoặc nói với ai đó"
                },
                "examples": [
                    {
                        "en": "rehearse something She walked along rehearsing her excuse for being late.",
                        "vi": "tập dượt một cái gì đó Cô ấy vừa đi vừa diễn tập lại lời bào chữa của cô ấy vì đã đến muộn."
                    },
                    {
                        "en": "He had his speech well rehearsed.",
                        "vi": "Anh ấy đã diễn tập rất kỹ bài phát biểu của mình."
                    },
                    {
                        "en": "rehearse what, how, etc… She mentally rehearsed what she would say to Jeff.",
                        "vi": "luyện tập những gì, như thế nào, v.v."
                    }
                ]
            },
            {
                "define": {
                    "en": "to repeat ideas or opinions that have often been expressed before",
                    "vi": "lặp lại các ý tưởng hoặc quan điểm thường được bày tỏ trước đây"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "37eb0abc0b854b068ce807727aa86cd2",
        "word": "show business",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈʃəʊbɪz/",
            "us": "/ˈʃəʊbɪz/"
        },
        "nearby": [
            {
                "word": "showboat",
                "pos": "noun"
            },
            {
                "word": "showboating",
                "pos": "noun"
            },
            {
                "word": "show business",
                "pos": "noun"
            },
            {
                "word": "showcase",
                "pos": "noun"
            },
            {
                "word": "showcase",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the business of providing public entertainment, for example in the theatre, in films or in television",
                    "vi": "kinh doanh cung cấp giải trí công cộng, ví dụ như trong rạp hát, trong phim hoặc truyền hình"
                },
                "examples": [
                    {
                        "en": "in show business to be in show business",
                        "vi": "trong kinh doanh chương trình để kinh doanh chương trình"
                    },
                    {
                        "en": "show-business people/stars",
                        "vi": "giới kinh doanh / ngôi sao"
                    },
                    {
                        "en": "That's showbiz!",
                        "vi": "Đó là showbiz!"
                    }
                ]
            }
        ]
    },
    {
        "id": "3cfc64b67f9e493abe5143137df9e8a3",
        "word": "stage",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/steɪdʒ/",
            "us": "/steɪdʒ/"
        },
        "nearby": [
            {
                "word": "stag beetle",
                "pos": "noun"
            },
            {
                "word": "stage",
                "pos": "noun"
            },
            {
                "word": "stage",
                "pos": "verb"
            },
            {
                "word": "stagecoach",
                "pos": "noun"
            },
            {
                "word": "stagecraft",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to organize and present a play or an event for people to see",
                    "vi": "để tổ chức và trình bày một vở kịch hoặc một sự kiện cho mọi người xem"
                },
                "examples": [
                    {
                        "en": "to stage a play/an event/an exhibition",
                        "vi": "tổ chức một vở kịch / một sự kiện / một cuộc triển lãm"
                    },
                    {
                        "en": "The local theatre group is staging a production of ‘Hamlet’.",
                        "vi": "Nhóm kịch địa phương đang dàn dựng vở \"Hamlet\"."
                    },
                    {
                        "en": "Birmingham has bid to stage the next national athletics championships.",
                        "vi": "Birmingham đã đấu thầu để tổ chức các giải vô địch điền kinh quốc gia tiếp theo."
                    }
                ]
            },
            {
                "define": {
                    "en": "to organize and take part in action that needs careful planning, especially as a public protest",
                    "vi": "để tổ chức và tham gia hành động cần có kế hoạch cẩn thận, đặc biệt là khi công khai phản đối"
                },
                "examples": [
                    {
                        "en": "to stage a protest/demonstration/rally",
                        "vi": "tổ chức một cuộc biểu tình / biểu tình / biểu tình"
                    },
                    {
                        "en": "to stage a sit-in/strike/walkout",
                        "vi": "để sắp xếp một ngồi / đình công / đi bộ"
                    },
                    {
                        "en": "Generals staged a coup in 1964, beginning 21 years of military dictatorship.",
                        "vi": "Các tướng lãnh cuộc đảo chính vào năm 1964, bắt đầu 21 năm chế độ độc tài quân sự."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make something happen",
                    "vi": "để làm một cái gì đó xảy ra"
                },
                "examples": [
                    {
                        "en": "The dollar staged a recovery earlier today.",
                        "vi": "Đồng đô la đã bắt đầu phục hồi vào đầu ngày hôm nay."
                    },
                    {
                        "en": "After five years in retirement, he staged a comeback to international tennis.",
                        "vi": "Sau 5 năm giải nghệ, anh đã trở lại với quần vợt quốc tế."
                    }
                ]
            }
        ]
    },
    {
        "id": "df98191be35a4859b806b8cc57d4dc2d",
        "word": "casting",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈkɑːstɪŋ/",
            "us": "/ˈkæstɪŋ/"
        },
        "nearby": [
            {
                "word": "castigate",
                "pos": "verb"
            },
            {
                "word": "castigation",
                "pos": "noun"
            },
            {
                "word": "casting",
                "pos": "noun"
            },
            {
                "word": "casting couch",
                "pos": "noun"
            },
            {
                "word": "casting vote",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the process of choosing actors for a play or film",
                    "vi": "quá trình chọn diễn viên cho một vở kịch hoặc một bộ phim"
                },
                "examples": [
                    {
                        "en": "Casting was completed by May.",
                        "vi": "Quá trình truyền đã hoàn thành vào tháng 5."
                    },
                    {
                        "en": "an odd piece of casting",
                        "vi": "một mảnh đúc kỳ lạ"
                    },
                    {
                        "en": "a casting director",
                        "vi": "một giám đốc casting"
                    }
                ]
            },
            {
                "define": {
                    "en": "an object made by pouring hot liquid metal, etc. into a mould (= a container with a particular shape)",
                    "vi": "một vật được làm bằng cách đổ kim loại lỏng nóng, v.v. vào khuôn (= vật chứa có hình dạng cụ thể)"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "4c3fed52b03e4074b0778786a31b9828",
        "word": "dramatize",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈdræmətaɪz/",
            "us": "/ˈdræmətaɪz/"
        },
        "nearby": [
            {
                "word": "dramatist",
                "pos": "noun"
            },
            {
                "word": "dramatization",
                "pos": "noun"
            },
            {
                "word": "dramatize",
                "pos": "verb"
            },
            {
                "word": "dramaturge",
                "pos": "noun"
            },
            {
                "word": "dramaturgy",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to present a book, an event, etc. as a play or a film",
                    "vi": "trình bày một cuốn sách, một sự kiện, v.v. dưới dạng một vở kịch hoặc một bộ phim"
                },
                "examples": [
                    {
                        "en": "Jane Austen’s ‘Emma’ was dramatized on television recently.",
                        "vi": "Emma của Jane Austen đã được dựng kịch bản trên truyền hình gần đây."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make something seem more exciting or important than it really is",
                    "vi": "để làm cho điều gì đó có vẻ thú vị hoặc quan trọng hơn thực tế"
                },
                "examples": [
                    {
                        "en": "Don't worry too much about what she said—she tends to dramatize things.",
                        "vi": "Đừng quá lo lắng về những gì cô ấy nói — cô ấy có xu hướng bi kịch hóa mọi thứ."
                    }
                ]
            }
        ]
    },
    {
        "id": "ae3700a75e6342689c5263dd50fc5d28",
        "word": "dress rehearsal",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌdres rɪˈhɜːsl/",
            "us": "/ˌdres rɪˈhɜːrsl/"
        },
        "nearby": [
            {
                "word": "dressmaker",
                "pos": "noun"
            },
            {
                "word": "dressmaking",
                "pos": "noun"
            },
            {
                "word": "dress rehearsal",
                "pos": "noun"
            },
            {
                "word": "dress shirt",
                "pos": "noun"
            },
            {
                "word": "dress uniform",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the final practice of a play in the theatre, using the clothes and lights that will be used for the real performance",
                    "vi": "thực hành cuối cùng của một vở kịch trong nhà hát, sử dụng quần áo và đèn sẽ được sử dụng cho buổi biểu diễn thực sự"
                },
                "examples": [
                    {
                        "en": "(figurative) The earlier protests had just been dress rehearsals for full-scale revolution.",
                        "vi": "(nghĩa bóng) Các cuộc biểu tình trước đó chỉ là các cuộc diễn tập trang phục cho một cuộc cách mạng toàn diện."
                    },
                    {
                        "en": "a dress rehearsal for a Broadway play",
                        "vi": "một buổi thử trang phục cho một vở kịch Broadway"
                    }
                ]
            }
        ]
    },
    {
        "id": "5a5de459d7cd48028f5a6c187a26d157",
        "word": "interpretation",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ɪnˌtɜːprəˈteɪʃn/",
            "us": "/ɪnˌtɜːrprəˈteɪʃn/"
        },
        "nearby": [
            {
                "word": "interpret",
                "pos": "verb"
            },
            {
                "word": "interpretable",
                "pos": "adjective"
            },
            {
                "word": "interpretation",
                "pos": "noun"
            },
            {
                "word": "interpretative",
                "pos": "adjective"
            },
            {
                "word": "interpreter",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the particular way in which something is understood or explained",
                    "vi": "cách cụ thể mà một cái gì đó được hiểu hoặc giải thích"
                },
                "examples": [
                    {
                        "en": "Her evidence suggests a different interpretation of the events.",
                        "vi": "Bằng chứng của cô ấy gợi ý một cách giải thích khác về các sự kiện."
                    },
                    {
                        "en": "It is not possible for everyone to put their own interpretation on the law.",
                        "vi": "Không phải ai cũng có thể đặt cách giải thích của mình vào luật."
                    },
                    {
                        "en": "Dreams are open to interpretation (= they can be explained in different ways).",
                        "vi": "Các giấc mơ có thể giải thích được (= chúng có thể được giải thích theo nhiều cách khác nhau)."
                    }
                ]
            },
            {
                "define": {
                    "en": "the particular way in which somebody chooses to perform a piece of music, a role in a play, etc.",
                    "vi": "cách cụ thể mà ai đó chọn để biểu diễn một bản nhạc, một vai trong vở kịch, v.v."
                },
                "examples": [
                    {
                        "en": "a modern interpretation of ‘King Lear’",
                        "vi": "một cách giải thích hiện đại của 'King Lear'"
                    }
                ]
            }
        ]
    },
    {
        "id": "8fbdb9cbda8d43dc898f40a2cd065ec7",
        "word": "portray",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/pɔːˈtreɪ/",
            "us": "/pɔːrˈtreɪ/"
        },
        "nearby": [
            {
                "word": "portraitist",
                "pos": "noun"
            },
            {
                "word": "portraiture",
                "pos": "noun"
            },
            {
                "word": "portray",
                "pos": "verb"
            },
            {
                "word": "portrayal",
                "pos": "noun"
            },
            {
                "word": "Portsmouth",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to show somebody/something in a picture; to describe somebody/something in a piece of writing",
                    "vi": "để hiển thị ai đó / cái gì đó trong một bức tranh; để mô tả ai đó / điều gì đó trong một đoạn văn bản"
                },
                "examples": [
                    {
                        "en": "The painting portrays the duke’s third wife.",
                        "vi": "Bức tranh vẽ người vợ thứ ba của công tước."
                    },
                    {
                        "en": "He was one of the first to portray animals from the New World.",
                        "vi": "Ông là một trong những người đầu tiên vẽ chân dung động vật từ Thế giới mới."
                    },
                    {
                        "en": "His war poetry vividly portrays life in the trenches.",
                        "vi": "Thơ chiến tranh của ông đã khắc họa một cách sinh động cuộc sống trong chiến hào."
                    }
                ]
            },
            {
                "define": {
                    "en": "to describe or show somebody/something in a particular way, especially when this does not give a complete or accurate impression of what they are like",
                    "vi": "để mô tả hoặc chỉ cho ai đó / điều gì đó theo một cách cụ thể, đặc biệt là khi điều này không mang lại ấn tượng đầy đủ hoặc chính xác về những gì họ như thế nào"
                },
                "examples": [
                    {
                        "en": "Throughout the trial, he portrayed himself as the victim.",
                        "vi": "Xuyên suốt phiên tòa, anh ta tự miêu tả mình là nạn nhân."
                    }
                ]
            },
            {
                "define": {
                    "en": "to act a particular role in a film or play",
                    "vi": "đóng một vai cụ thể trong một bộ phim hoặc một vở kịch"
                },
                "examples": [
                    {
                        "en": "Her father will be portrayed by Jim Broadbent.",
                        "vi": "Cha của cô sẽ do Jim Broadbent thể hiện."
                    }
                ]
            }
        ]
    },
    {
        "id": "b651f76aad14479d92e3697f1784793a",
        "word": "put on",
        "pos": "phrasal verb",
        "level": "c1",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "put into",
                "pos": "phrasal verb"
            },
            {
                "word": "put off",
                "pos": "phrasal verb"
            },
            {
                "word": "put on",
                "pos": "phrasal verb"
            },
            {
                "word": "put-on",
                "pos": "noun"
            },
            {
                "word": "putonghua",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to give somebody the phone so that they can talk to the person at the other end",
                    "vi": "đưa điện thoại cho ai đó để họ có thể nói chuyện với người ở đầu dây bên kia"
                },
                "examples": [
                    {
                        "en": "Hi, Dad—can you put Nicky on?",
                        "vi": "Xin chào, bố - bố có thể cho Nicky mặc không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to try to make somebody believe something that is not true, usually as a joke",
                    "vi": "để cố gắng làm cho ai đó tin vào điều gì đó không đúng, thường là một trò đùa"
                },
                "examples": [
                    {
                        "en": "Oh, come on, you know I was only putting you on.",
                        "vi": "Oh, thôi nào, bạn biết tôi chỉ đặt bạn vào."
                    }
                ]
            },
            {
                "define": {
                    "en": "to dress yourself in something",
                    "vi": "mặc cho mình một cái gì đó"
                },
                "examples": [
                    {
                        "en": "Hurry up! Put your coat on!",
                        "vi": "Nhanh lên! Mặc áo khoác vào!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to apply something to your skin, face, etc.",
                    "vi": "để thoa thứ gì đó lên da, mặt, v.v."
                },
                "examples": [
                    {
                        "en": "She's just putting on her make-up.",
                        "vi": "Cô ấy chỉ đang trang điểm thôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to switch on a piece of equipment",
                    "vi": "để bật một thiết bị"
                },
                "examples": [
                    {
                        "en": "I'll put the kettle on for tea.",
                        "vi": "Tôi sẽ đặt ấm để pha trà."
                    },
                    {
                        "en": "She put on the brakes suddenly.",
                        "vi": "Cô phanh gấp."
                    }
                ]
            },
            {
                "define": {
                    "en": "to start to play recorded music or a video",
                    "vi": "để bắt đầu phát nhạc đã ghi hoặc video"
                },
                "examples": [
                    {
                        "en": "Do you mind if I put some music on?",
                        "vi": "Bạn có phiền nếu tôi bật nhạc lên không?"
                    },
                    {
                        "en": "The DJ put on a techno dance number.",
                        "vi": "DJ đã bật một bản nhạc kỹ thuật số."
                    }
                ]
            },
            {
                "define": {
                    "en": "to start cooking food, especially on top of a cooker",
                    "vi": "để bắt đầu nấu thức ăn, đặc biệt là trên miệng nồi"
                },
                "examples": [
                    {
                        "en": "I just need to put the potatoes on.",
                        "vi": "Tôi chỉ cần đặt khoai tây vào."
                    }
                ]
            },
            {
                "define": {
                    "en": "to become heavier, especially by the amount mentioned",
                    "vi": "trở nên nặng hơn, đặc biệt là theo số lượng đã đề cập"
                },
                "examples": [
                    {
                        "en": "She looks like she's put on weight.",
                        "vi": "Cô ấy trông giống như cô ấy đang tăng cân."
                    },
                    {
                        "en": "He must have put on several kilos.",
                        "vi": "Chắc anh ấy đã lên vài ký rồi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to provide something specially",
                    "vi": "để cung cấp một cái gì đó đặc biệt"
                },
                "examples": [
                    {
                        "en": "The city is putting on extra buses during the summer.",
                        "vi": "Thành phố đang tăng cường thêm xe buýt trong mùa hè."
                    }
                ]
            },
            {
                "define": {
                    "en": "to produce or present a play, a show, etc.",
                    "vi": "để sản xuất hoặc trình bày một vở kịch, một chương trình, v.v."
                },
                "examples": [
                    {
                        "en": "The local drama club is putting on ‘Macbeth’.",
                        "vi": "Câu lạc bộ kịch địa phương đang đưa vào vở kịch 'Macbeth'."
                    }
                ]
            },
            {
                "define": {
                    "en": "to pretend to have a particular feeling, quality, way of speaking, etc.",
                    "vi": "giả vờ có một cảm giác, phẩm chất, cách nói cụ thể, v.v."
                },
                "examples": [
                    {
                        "en": "He put on an American accent.",
                        "vi": "Anh ta nói giọng Mỹ."
                    },
                    {
                        "en": "I don't think she was hurt. She was just putting it on.",
                        "vi": "Tôi không nghĩ cô ấy bị thương. Cô ấy chỉ đang mặc nó vào."
                    }
                ]
            },
            {
                "define": {
                    "en": "to add an amount of money or a tax to the cost of something",
                    "vi": "để thêm một số tiền hoặc một khoản thuế vào chi phí của một thứ gì đó"
                },
                "examples": [
                    {
                        "en": "The government has put ten pence on the price of twenty cigarettes.",
                        "vi": "Chính phủ đã đặt mười pence vào giá của hai mươi điếu thuốc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to bet money on something",
                    "vi": "đặt cược tiền vào một cái gì đó"
                },
                "examples": [
                    {
                        "en": "I've never put money on a horse.",
                        "vi": "Tôi chưa bao giờ đặt tiền lên ngựa."
                    },
                    {
                        "en": "I put £5 on him to win.",
                        "vi": "Tôi đặt 5 bảng cho anh ấy để giành chiến thắng."
                    }
                ]
            }
        ]
    },
    {
        "id": "e7797b2378ad45a8baa6046048adafbe",
        "word": "theatrical",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/θiˈætrɪkl/",
            "us": "/θiˈætrɪkl/"
        },
        "nearby": [
            {
                "word": "the Theatre Royal",
                "pos": ""
            },
            {
                "word": "Theatr Genedlaethol Cymru",
                "pos": ""
            },
            {
                "word": "theatrical",
                "pos": "adjective"
            },
            {
                "word": "theatricality",
                "pos": "noun"
            },
            {
                "word": "theatrically",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "connected with the theatre",
                    "vi": "kết nối với nhà hát"
                },
                "examples": [
                    {
                        "en": "a theatrical agent",
                        "vi": "một đại lý sân khấu"
                    }
                ]
            },
            {
                "define": {
                    "en": "deliberately attracting attention or creating a particular effect in a way that seems false",
                    "vi": "cố tình thu hút sự chú ý hoặc tạo hiệu ứng cụ thể theo cách có vẻ sai"
                },
                "examples": [
                    {
                        "en": "a theatrical gesture",
                        "vi": "một cử chỉ sân khấu"
                    }
                ]
            }
        ]
    },
    {
        "id": "3e0701c7ed3e440e81e0d7eafcf3e940",
        "word": "ad lib",
        "pos": "adverb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌæd ˈlɪb/",
            "us": "/ˌæd ˈlɪb/"
        },
        "nearby": [
            {
                "word": "adjutant general",
                "pos": "noun"
            },
            {
                "word": "Larry Adler",
                "pos": ""
            },
            {
                "word": "ad lib",
                "pos": "adverb"
            },
            {
                "word": "ad lib",
                "pos": "noun"
            },
            {
                "word": "ad-lib",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "if you give a speech or performance ad lib, you do it without preparing or practising",
                    "vi": "nếu bạn đưa ra một bài phát biểu hoặc trình diễn quảng cáo lib, bạn sẽ làm điều đó mà không cần chuẩn bị hoặc luyện tập"
                },
                "examples": [
                    {
                        "en": "She delivered her lines ad lib.",
                        "vi": "Cô ấy đã gửi những dòng của mình ad lib."
                    }
                ]
            }
        ]
    },
    {
        "id": "8f0e230d8a5941ab9252da04f1c2c807",
        "word": "ad lib",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌæd ˈlɪb/",
            "us": "/ˌæd ˈlɪb/"
        },
        "nearby": [
            {
                "word": "Larry Adler",
                "pos": ""
            },
            {
                "word": "ad lib",
                "pos": "adverb"
            },
            {
                "word": "ad lib",
                "pos": "noun"
            },
            {
                "word": "ad-lib",
                "pos": "verb"
            },
            {
                "word": "ad-lib",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "something that you say in a speech or a performance that you have not prepared or practised",
                    "vi": "điều gì đó mà bạn nói trong một bài phát biểu hoặc một buổi biểu diễn mà bạn chưa chuẩn bị hoặc thực hành"
                },
                "examples": [
                    {
                        "en": "The speech was full of ad libs.",
                        "vi": "Bài phát biểu chứa đầy những lời quảng cáo."
                    }
                ]
            }
        ]
    },
    {
        "id": "f70d52fda22d4d60983fb422ebe3fdc7",
        "word": "ad-lib",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌæd ˈlɪb/",
            "us": "/ˌæd ˈlɪb/"
        },
        "nearby": [
            {
                "word": "ad lib",
                "pos": "adverb"
            },
            {
                "word": "ad lib",
                "pos": "noun"
            },
            {
                "word": "ad-lib",
                "pos": "verb"
            },
            {
                "word": "ad-lib",
                "pos": "adjective"
            },
            {
                "word": "adman",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to say something in a speech or a performance that you have not prepared or practised",
                    "vi": "để nói điều gì đó trong một bài phát biểu hoặc một buổi biểu diễn mà bạn chưa chuẩn bị hoặc thực hành"
                },
                "examples": [
                    {
                        "en": "She abandoned her script and began ad-libbing.",
                        "vi": "Cô ấy từ bỏ kịch bản của mình và bắt đầu say mê quảng cáo."
                    },
                    {
                        "en": "ad-lib something I lost my notes and had to ad-lib the whole speech.",
                        "vi": "ad-lib cái gì đó tôi bị mất ghi chú và phải ad-lib toàn bộ bài phát biểu."
                    },
                    {
                        "en": "He ad-libbed his way through the meeting.",
                        "vi": "Anh ấy đã nói dối theo cách của mình trong suốt cuộc họp."
                    }
                ]
            }
        ]
    },
    {
        "id": "f51a0911f55a4de486813a4781d8e0ec",
        "word": "ad-lib",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌæd ˈlɪb/",
            "us": "/ˌæd ˈlɪb/"
        },
        "nearby": [
            {
                "word": "ad lib",
                "pos": "noun"
            },
            {
                "word": "ad-lib",
                "pos": "verb"
            },
            {
                "word": "ad-lib",
                "pos": "adjective"
            },
            {
                "word": "adman",
                "pos": "noun"
            },
            {
                "word": "admin",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an ad-lib speech or performance has not been prepared or practised",
                    "vi": "một bài phát biểu hoặc màn trình diễn ad-lib chưa được chuẩn bị hoặc thực hành"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "d5ad347240094bebaaa47fb3b17e6158",
        "word": "amateur dramatics",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌæmətə drəˈmætɪks/",
            "us": "/ˌæmətər drəˈmætɪks/"
        },
        "nearby": [
            {
                "word": "the Amateur Athletic Association",
                "pos": ""
            },
            {
                "word": "the Amateur Athletic Union",
                "pos": ""
            },
            {
                "word": "amateur dramatics",
                "pos": "noun"
            },
            {
                "word": "amateurish",
                "pos": "adjective"
            },
            {
                "word": "amateurism",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the activity of producing and acting in plays for the theatre, by people who do it for pleasure, not as a job",
                    "vi": "hoạt động sản xuất và diễn xuất các vở kịch cho nhà hát, bởi những người làm điều đó vì niềm vui, không phải như một công việc"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "62a3a2f3ef674377be5e1cda5dc22907",
        "word": "audition",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ɔːˈdɪʃn/",
            "us": "/ɔːˈdɪʃn/"
        },
        "nearby": [
            {
                "word": "the Audit Commission",
                "pos": "noun"
            },
            {
                "word": "audition",
                "pos": "noun"
            },
            {
                "word": "audition",
                "pos": "verb"
            },
            {
                "word": "auditor",
                "pos": "noun"
            },
            {
                "word": "auditorium",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to take part in an audition",
                    "vi": "tham gia một buổi thử giọng"
                },
                "examples": [
                    {
                        "en": "She was auditioning for the role of Lady Macbeth.",
                        "vi": "Cô ấy đang thử vai cho Lady Macbeth."
                    },
                    {
                        "en": "Hundreds of people auditioned.",
                        "vi": "Hàng trăm người đã thử giọng."
                    },
                    {
                        "en": "I auditioned and was given the part.",
                        "vi": "Tôi đã thử giọng và được giao một phần."
                    }
                ]
            },
            {
                "define": {
                    "en": "to watch, listen to and judge somebody at an audition",
                    "vi": "để xem, nghe và đánh giá ai đó trong buổi thử giọng"
                },
                "examples": [
                    {
                        "en": "We auditioned over 200 children for the part.",
                        "vi": "Chúng tôi đã thử vai hơn 200 trẻ em."
                    },
                    {
                        "en": "We auditioned several excellent musicians.",
                        "vi": "Chúng tôi đã thử giọng một số nhạc sĩ xuất sắc."
                    }
                ]
            }
        ]
    },
    {
        "id": "60f8fdb53cbc4d4fa74dcbb79f88e044",
        "word": "community theater",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/kəˌmjuːnəti ˈθɪətə(r)/",
            "us": "/kəˌmjuːnəti ˈθiːətər/"
        },
        "nearby": [
            {
                "word": "community service",
                "pos": "noun"
            },
            {
                "word": "community spread",
                "pos": "noun"
            },
            {
                "word": "community theater",
                "pos": "noun"
            },
            {
                "word": "community transmission",
                "pos": "noun"
            },
            {
                "word": "commutable",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the activity of producing and acting in plays by people who do it for pleasure and not as a job",
                    "vi": "hoạt động sản xuất và diễn xuất các vở kịch của những người làm việc đó vì niềm vui chứ không phải công việc"
                },
                "examples": [
                    {
                        "en": "She joined the local community theater in a production of ‘It's a Wonderful Life’.",
                        "vi": "Cô đã tham gia nhà hát cộng đồng địa phương trong vở kịch 'Đó là một cuộc sống tuyệt vời'."
                    }
                ]
            },
            {
                "define": {
                    "en": "a small theatre where these plays are performed",
                    "vi": "một nhà hát nhỏ nơi những vở kịch này được trình diễn"
                },
                "examples": [
                    {
                        "en": "The musical has been performed at numerous community theaters in the south-east United States.",
                        "vi": "Vở nhạc kịch đã được biểu diễn tại nhiều nhà hát cộng đồng ở đông nam Hoa Kỳ."
                    }
                ]
            }
        ]
    },
    {
        "id": "b4d56c23f1ae4071b997e4076826ec48",
        "word": "curtain call",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkɜːtn kɔːl/",
            "us": "/ˈkɜːrtn kɔːl/"
        },
        "nearby": [
            {
                "word": "curtain",
                "pos": "noun"
            },
            {
                "word": "curtain",
                "pos": "verb"
            },
            {
                "word": "curtain call",
                "pos": "noun"
            },
            {
                "word": "curtain off",
                "pos": "phrasal verb"
            },
            {
                "word": "curtain-raiser",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the time in the theatre when the actors come to the front of the stage at the end of a play to receive the applause of the audience",
                    "vi": "thời điểm diễn viên đứng trước sân khấu khi kết thúc vở diễn để nhận được sự tán thưởng của khán giả trong rạp."
                },
                "examples": [
                    {
                        "en": "The audience clapped so much that the stars had to take fifteen curtain calls.",
                        "vi": "Khán giả vỗ tay nhiều đến nỗi các ngôi sao phải đến mười lăm lần hạ màn."
                    }
                ]
            }
        ]
    },
    {
        "id": "5e2f9f5fff454e64a66e126373d45630",
        "word": "curtain-up",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌkɜːtn ˈʌp/",
            "us": "/ˌkɜːrtn ˈʌp/"
        },
        "nearby": [
            {
                "word": "curtain off",
                "pos": "phrasal verb"
            },
            {
                "word": "curtain-raiser",
                "pos": "noun"
            },
            {
                "word": "curtain-up",
                "pos": "noun"
            },
            {
                "word": "Tony Curtis",
                "pos": ""
            },
            {
                "word": "the Curtis Cup",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the beginning of a play or show",
                    "vi": "sự bắt đầu của một vở kịch hoặc chương trình"
                },
                "examples": [
                    {
                        "en": "Curtain-up's at 7.30.",
                        "vi": "Màn che ở 7h30."
                    }
                ]
            }
        ]
    },
    {
        "id": "4198376d7e794fb189f4aef71274a29b",
        "word": "enact",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ɪˈnækt/",
            "us": "/ɪˈnækt/"
        },
        "nearby": [
            {
                "word": "enabler",
                "pos": "noun"
            },
            {
                "word": "enabling act",
                "pos": "noun"
            },
            {
                "word": "enact",
                "pos": "verb"
            },
            {
                "word": "enactment",
                "pos": "noun"
            },
            {
                "word": "enamel",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to pass a law",
                    "vi": "qua một đạo luật"
                },
                "examples": [
                    {
                        "en": "(be) enacted (by somebody/something) legislation enacted by parliament",
                        "vi": "(được) ban hành (bởi ai đó / cái gì đó) luật do quốc hội ban hành"
                    }
                ]
            },
            {
                "define": {
                    "en": "to perform a play or act a part in a play",
                    "vi": "biểu diễn một vở kịch hoặc đóng một vai trong một vở kịch"
                },
                "examples": [
                    {
                        "en": "(be) enacted (by somebody) scenes from history enacted by local residents",
                        "vi": "(được) thực hiện (bởi ai đó) cảnh trong lịch sử do cư dân địa phương tạo ra"
                    }
                ]
            },
            {
                "define": {
                    "en": "to take place",
                    "vi": "diễn ra"
                },
                "examples": [
                    {
                        "en": "They seemed unaware of the drama being enacted a few feet away from them.",
                        "vi": "Họ dường như không biết về việc bộ phim đang diễn ra cách họ vài bước chân."
                    }
                ]
            },
            {
                "define": {
                    "en": "to put something into practice",
                    "vi": "để đưa một cái gì đó vào thực tế"
                },
                "examples": [
                    {
                        "en": "This involves identifying problems and enacting solutions.",
                        "vi": "Điều này liên quan đến việc xác định các vấn đề và ban hành các giải pháp."
                    }
                ]
            }
        ]
    },
    {
        "id": "ec3abad53ddb4dc8b6e801d2f83212df",
        "word": "first night",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌfɜːst ˈnaɪt/",
            "us": "/ˌfɜːrst ˈnaɪt/"
        },
        "nearby": [
            {
                "word": "first name",
                "pos": "noun"
            },
            {
                "word": "First Nation",
                "pos": "noun"
            },
            {
                "word": "first night",
                "pos": "noun"
            },
            {
                "word": "first offender",
                "pos": "noun"
            },
            {
                "word": "first officer",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the first public performance of a play, film, etc.",
                    "vi": "buổi biểu diễn đầu tiên trước công chúng của một vở kịch, bộ phim, v.v."
                },
                "examples": [
                    {
                        "en": "I got tickets for the first night of ‘Romeo and Juliet’.",
                        "vi": "Tôi đã nhận được vé cho đêm đầu tiên của 'Romeo và Juliet'."
                    },
                    {
                        "en": "The first night of the school play is just days away and the cast still don’t know their lines.",
                        "vi": "Đêm đầu tiên của vở kịch ở trường chỉ còn vài ngày nữa và dàn diễn viên vẫn chưa biết lời thoại của họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a public celebration of New Year’s Eve",
                    "vi": "một lễ kỷ niệm đêm giao thừa của công chúng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "f25398b30feb4a219ec8e681bac21bf9",
        "word": "miscast",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌmɪsˈkɑːst/",
            "us": "/ˌmɪsˈkæst/"
        },
        "nearby": [
            {
                "word": "miscarriage of justice",
                "pos": "noun"
            },
            {
                "word": "miscarry",
                "pos": "verb"
            },
            {
                "word": "miscast",
                "pos": "verb"
            },
            {
                "word": "miscegenation",
                "pos": "noun"
            },
            {
                "word": "miscellanea",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to choose an actor to play a role for which they are not suitable; to give the roles in a play or film to unsuitable actors",
                    "vi": "chọn diễn viên đóng vai không phù hợp; giao vai trong một vở kịch hoặc bộ phim cho những diễn viên không phù hợp"
                },
                "examples": [
                    {
                        "en": "be miscast as somebody/something He was hopelessly miscast as the romantic hero.",
                        "vi": "bị gọi nhầm là ai đó / điều gì đó Anh ấy đã bị gọi nhầm là anh hùng lãng mạn một cách vô vọng."
                    },
                    {
                        "en": "be miscast The whole production is miscast.",
                        "vi": "bị phát hiện sai Toàn bộ quá trình sản xuất bị phát hiện sai."
                    }
                ]
            }
        ]
    },
    {
        "id": "4eff9a236d4846bcab6b95af266f3958",
        "word": "overact",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌəʊvərˈækt/",
            "us": "/ˌəʊvərˈækt/"
        },
        "nearby": [
            {
                "word": "overachieve",
                "pos": "verb"
            },
            {
                "word": "overachiever",
                "pos": "noun"
            },
            {
                "word": "overact",
                "pos": "verb"
            },
            {
                "word": "overactive",
                "pos": "adjective"
            },
            {
                "word": "overage",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to behave in a way that is exaggerated and not natural, especially when you are acting a part in a play",
                    "vi": "hành xử theo cách cường điệu và không tự nhiên, đặc biệt là khi bạn đang đóng một vai trong vở kịch"
                },
                "examples": [
                    {
                        "en": "He's a poor actor with a strong tendency to overact.",
                        "vi": "Anh ấy là một diễn viên nghèo với xu hướng hoạt động quá mức."
                    },
                    {
                        "en": "overact something She dreadfully overacted the part.",
                        "vi": "phóng đại cái gì đó Cô ấy nói quá đáng một cách đáng sợ."
                    }
                ]
            }
        ]
    },
    {
        "id": "c8125b490c8c4da392d4dd1ba57cebf0",
        "word": "prompt",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/prɒmpt/",
            "us": "/prɑːmpt/"
        },
        "nearby": [
            {
                "word": "promotion",
                "pos": "noun"
            },
            {
                "word": "promotional",
                "pos": "adjective"
            },
            {
                "word": "prompt",
                "pos": "verb"
            },
            {
                "word": "prompt",
                "pos": "adjective"
            },
            {
                "word": "prompt",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to make somebody decide to do something; to cause something to happen",
                    "vi": "để khiến ai đó quyết định làm điều gì đó; để gây ra một cái gì đó xảy ra"
                },
                "examples": [
                    {
                        "en": "prompt something The discovery of the bomb prompted an increase in security.",
                        "vi": "nhắc nhở điều gì đó Việc phát hiện ra quả bom đã thúc đẩy sự gia tăng an ninh."
                    },
                    {
                        "en": "His speech prompted an angry outburst from a man in the crowd.",
                        "vi": "Bài phát biểu của ông đã khiến một người đàn ông trong đám đông bùng phát tức giận."
                    },
                    {
                        "en": "prompt somebody to do something The thought of her daughter's wedding day prompted her to lose some weight.",
                        "vi": "Nhắc ai đó làm gì đó Suy nghĩ về ngày cưới của con gái đã khiến cô giảm cân."
                    }
                ]
            },
            {
                "define": {
                    "en": "to encourage somebody to speak by asking them questions or suggesting words that they could say",
                    "vi": "khuyến khích ai đó nói bằng cách đặt câu hỏi cho họ hoặc gợi ý những từ mà họ có thể nói"
                },
                "examples": [
                    {
                        "en": "prompt somebody She was too nervous to speak and had to be prompted.",
                        "vi": "nhắc ai đó Cô ấy quá lo lắng để nói và phải được nhắc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to follow the text of a play and remind the actors what the words are if they forget their lines",
                    "vi": "theo dõi văn bản của một vở kịch và nhắc nhở các diễn viên những từ ngữ nếu họ quên lời thoại của họ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "eac6cd965ea54bf9b11ba4ba9dbdbcae",
        "word": "prompt",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/prɒmpt/",
            "us": "/prɑːmpt/"
        },
        "nearby": [
            {
                "word": "prompt",
                "pos": "verb"
            },
            {
                "word": "prompt",
                "pos": "adjective"
            },
            {
                "word": "prompt",
                "pos": "noun"
            },
            {
                "word": "prompt",
                "pos": "adverb"
            },
            {
                "word": "prompter",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a word or words said to an actor, to remind them what to say next when they have forgotten",
                    "vi": "một từ hoặc những từ đã nói với một diễn viên, để nhắc họ phải nói gì tiếp theo khi họ đã quên"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a sign on a computer screen that shows that the computer has finished doing something and is ready for more instructions",
                    "vi": "một dấu hiệu trên màn hình máy tính cho thấy rằng máy tính đã hoàn thành việc gì đó và sẵn sàng để được hướng dẫn thêm"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a342bd6c846543b3bdc80b7d12b89c19",
        "word": "read-through",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈriːd θruː/",
            "us": "/ˈriːd θruː/"
        },
        "nearby": [
            {
                "word": "read over",
                "pos": "phrasal verb"
            },
            {
                "word": "read through",
                "pos": "phrasal verb"
            },
            {
                "word": "read-through",
                "pos": "noun"
            },
            {
                "word": "read up",
                "pos": "phrasal verb"
            },
            {
                "word": "read up on",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an occasion when the words of a play are spoken by members of a theatre group, before they begin practising acting it",
                    "vi": "một dịp khi các thành viên của một vở kịch nói lời của một vở kịch, trước khi họ bắt đầu thực hành diễn xuất"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "b7de916250d247f2a8bc35a9c0c148fa",
        "word": "revival",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/rɪˈvaɪvl/",
            "us": "/rɪˈvaɪvl/"
        },
        "nearby": [
            {
                "word": "revitalization",
                "pos": "noun"
            },
            {
                "word": "revitalize",
                "pos": "verb"
            },
            {
                "word": "revival",
                "pos": "noun"
            },
            {
                "word": "revivalism",
                "pos": "noun"
            },
            {
                "word": "revivalist",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an improvement in the condition or strength of something",
                    "vi": "sự cải thiện về tình trạng hoặc sức mạnh của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "the revival of trade",
                        "vi": "sự hồi sinh của thương mại"
                    },
                    {
                        "en": "an economic revival",
                        "vi": "một sự phục hưng kinh tế"
                    },
                    {
                        "en": "a revival of property values",
                        "vi": "sự hồi sinh của các giá trị tài sản"
                    }
                ]
            },
            {
                "define": {
                    "en": "the process of something becoming or being made popular or fashionable again",
                    "vi": "quá trình một thứ gì đó trở nên phổ biến hoặc thời thượng trở lại"
                },
                "examples": [
                    {
                        "en": "a religious revival",
                        "vi": "một sự phục hưng tôn giáo"
                    },
                    {
                        "en": "Jazz is enjoying a revival.",
                        "vi": "Nhạc Jazz đang được hồi sinh."
                    },
                    {
                        "en": "a revival of interest in folk music",
                        "vi": "sự hồi sinh của sở thích âm nhạc dân gian"
                    }
                ]
            },
            {
                "define": {
                    "en": "a new production of a play that has not been performed for some time",
                    "vi": "sản xuất mới của một vở kịch đã không được trình diễn trong một thời gian"
                },
                "examples": [
                    {
                        "en": "a revival of Peter Shaffer’s ‘Equus’",
                        "vi": "sự hồi sinh của 'Equus' của Peter Shaffer"
                    }
                ]
            }
        ]
    },
    {
        "id": "3152fb39bc46420089e40beb90a194ff",
        "word": "run-through",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈrʌn θruː/",
            "us": "/ˈrʌn θruː/"
        },
        "nearby": [
            {
                "word": "runt",
                "pos": "noun"
            },
            {
                "word": "run through",
                "pos": "phrasal verb"
            },
            {
                "word": "run-through",
                "pos": "noun"
            },
            {
                "word": "runtime",
                "pos": "noun"
            },
            {
                "word": "run to",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a practice for a performance of a play, show, etc.",
                    "vi": "thực hành trình diễn vở kịch, chương trình, v.v."
                },
                "examples": [
                    {
                        "en": "Can we have just one more run-through?",
                        "vi": "Chúng ta có thể chạy thêm một lần nữa không?"
                    }
                ]
            }
        ]
    },
    {
        "id": "a4bb56aa4eb640aba0f8bd9eb3df2a79",
        "word": "scene-shifting",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsiːn ʃɪftɪŋ/",
            "us": "/ˈsiːn ʃɪftɪŋ/"
        },
        "nearby": [
            {
                "word": "scenery",
                "pos": "noun"
            },
            {
                "word": "scene-shifter",
                "pos": "noun"
            },
            {
                "word": "scene-shifting",
                "pos": "noun"
            },
            {
                "word": "scene-stealer",
                "pos": "noun"
            },
            {
                "word": "scenester",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the job of moving scenery in a theatre",
                    "vi": "công việc chuyển cảnh trong rạp hát"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "e1037f0db0c542a080f92341770ef712",
        "word": "set piece",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌset ˈpiːs/",
            "us": "/ˌset ˈpiːs/"
        },
        "nearby": [
            {
                "word": "set out",
                "pos": "phrasal verb"
            },
            {
                "word": "set phrase",
                "pos": "noun"
            },
            {
                "word": "set piece",
                "pos": "noun"
            },
            {
                "word": "set point",
                "pos": "noun"
            },
            {
                "word": "set shot",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a part of a play, film, piece of music, etc. that has a well-known pattern or style, and is used to create a particular effect",
                    "vi": "một phần của vở kịch, bộ phim, bản nhạc, v.v. có khuôn mẫu hoặc phong cách nổi tiếng và được sử dụng để tạo hiệu ứng cụ thể"
                },
                "examples": [
                    {
                        "en": "The play contained all kinds of theatrical set pieces.",
                        "vi": "Vở kịch bao gồm tất cả các loại thiết lập sân khấu."
                    }
                ]
            },
            {
                "define": {
                    "en": "a move in a sports game that is well planned and practised",
                    "vi": "một bước di chuyển trong một trò chơi thể thao được lên kế hoạch và thực hành tốt"
                },
                "examples": [
                    {
                        "en": "to score from a set piece",
                        "vi": "để ghi bàn từ một tập hợp"
                    }
                ]
            }
        ]
    },
    {
        "id": "22715cbb25d047bc803cd7de8ff3dc70",
        "word": "stagecraft",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsteɪdʒkrɑːft/",
            "us": "/ˈsteɪdʒkræft/"
        },
        "nearby": [
            {
                "word": "stage",
                "pos": "verb"
            },
            {
                "word": "stagecoach",
                "pos": "noun"
            },
            {
                "word": "stagecraft",
                "pos": "noun"
            },
            {
                "word": "stage direction",
                "pos": "noun"
            },
            {
                "word": "stage door",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "skill in presenting plays in a theatre",
                    "vi": "kỹ năng trình bày vở kịch trong nhà hát"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "e5345d83cd4d401cb4b0da996eb42be8",
        "word": "stage direction",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsteɪdʒ dərekʃn/",
            "us": "/ˈsteɪdʒ dərekʃn/"
        },
        "nearby": [
            {
                "word": "stagecoach",
                "pos": "noun"
            },
            {
                "word": "stagecraft",
                "pos": "noun"
            },
            {
                "word": "stage direction",
                "pos": "noun"
            },
            {
                "word": "stage door",
                "pos": "noun"
            },
            {
                "word": "stage fright",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a note in the text of a play telling actors when to come on to or leave the stage, what actions to perform, etc.",
                    "vi": "một ghi chú trong văn bản của một vở kịch cho các diễn viên biết khi nào nên đến hoặc rời khỏi sân khấu, những hành động cần thực hiện, v.v."
                },
                "examples": [
                    {
                        "en": "The stage direction reads, ‘Exit left’.",
                        "vi": "Hướng sân khấu có nội dung 'Lối ra bên trái'."
                    },
                    {
                        "en": "Shakespeare's famous stage direction: ‘Exit, pursued by a bear.’",
                        "vi": "Hướng dẫn sân khấu nổi tiếng của Shakespeare: 'Thoát ra, bị một con gấu truy đuổi.'"
                    },
                    {
                        "en": "As the stage directions indicate, it is early morning in Moscow.",
                        "vi": "Như chỉ dẫn sân khấu cho biết, bây giờ là sáng sớm ở Matxcova."
                    }
                ]
            }
        ]
    },
    {
        "id": "554fe3b432ce48f0bf47203924ace6d9",
        "word": "stage-struck",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsteɪdʒ strʌk/",
            "us": "/ˈsteɪdʒ strʌk/"
        },
        "nearby": [
            {
                "word": "stage name",
                "pos": "noun"
            },
            {
                "word": "stage right",
                "pos": "adverb"
            },
            {
                "word": "stage-struck",
                "pos": "adjective"
            },
            {
                "word": "stagette",
                "pos": "noun"
            },
            {
                "word": "stage whisper",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "enjoying the theatre a lot and wishing very much to become an actor",
                    "vi": "thưởng thức rạp hát rất nhiều và rất mong muốn trở thành một diễn viên"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "807d771dd7994193aa984bf6649374d1",
        "word": "stage whisper",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌsteɪdʒ ˈwɪspə(r)/",
            "us": "/ˌsteɪdʒ ˈwɪspər/"
        },
        "nearby": [
            {
                "word": "stage-struck",
                "pos": "adjective"
            },
            {
                "word": "stagette",
                "pos": "noun"
            },
            {
                "word": "stage whisper",
                "pos": "noun"
            },
            {
                "word": "stagey",
                "pos": "adjective"
            },
            {
                "word": "stagflation",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "words that are spoken quietly by an actor to the audience and that the other people on stage are not supposed to hear",
                    "vi": "những từ được diễn viên nói nhẹ nhàng với khán giả và những người khác trên sân khấu không được nghe thấy"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "words that are spoken quietly by somebody but that they in fact want everyone to hear",
                    "vi": "những từ được ai đó nói nhẹ nhàng nhưng thực tế là họ muốn mọi người nghe thấy"
                },
                "examples": [
                    {
                        "en": "‘I knew this would happen,’ she said in a stage whisper.",
                        "vi": "Tôi biết điều này sẽ xảy ra, cô nói trong một sân khấu thì thầm."
                    }
                ]
            }
        ]
    },
    {
        "id": "ee7d7ba07be44346b4aa8b1c36dd1c91",
        "word": "surtitles",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsɜːtaɪtlz/",
            "us": "/ˈsɜːrtaɪtlz/"
        },
        "nearby": [
            {
                "word": "surround sound",
                "pos": "noun"
            },
            {
                "word": "surtax",
                "pos": "noun"
            },
            {
                "word": "surtitles",
                "pos": "noun"
            },
            {
                "word": "surveillance",
                "pos": "noun"
            },
            {
                "word": "survey",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "words that appear on a screen above or next to the stage to show or translate into a different language what is being sung in an opera, or spoken in a play in the theatre",
                    "vi": "các từ xuất hiện trên màn hình phía trên hoặc bên cạnh sân khấu để hiển thị hoặc dịch sang một ngôn ngữ khác những gì đang được hát trong một vở opera hoặc được nói trong một vở kịch trong rạp hát"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "ea6b320d44444109a32513f0081b9307",
        "word": "typecast",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈtaɪpkɑːst/",
            "us": "/ˈtaɪpkæst/"
        },
        "nearby": [
            {
                "word": "type",
                "pos": "noun"
            },
            {
                "word": "type",
                "pos": "verb"
            },
            {
                "word": "typecast",
                "pos": "verb"
            },
            {
                "word": "typeface",
                "pos": "noun"
            },
            {
                "word": "typescript",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "if an actor is typecast, they are always given the same kind of character to play",
                    "vi": "nếu một diễn viên là người đánh máy, họ luôn được giao cùng một loại nhân vật để đóng"
                },
                "examples": [
                    {
                        "en": "I didn't want to be typecast as a sensitive intellectual.",
                        "vi": "Tôi không muốn trở thành người đánh máy như một trí thức nhạy cảm."
                    }
                ]
            }
        ]
    }
]