[
    {
        "en": "To the world, you may just only be one normal person but to one normal person, you may be all the world.",
        "vi": "Đối với thế gian này bạn chỉ là một con người bé nhỏ nhưng đối với một ai đó bé nhỏ, bạn là cả thế giới.",
        "id": "4975da7aa6c54ac99bab7038cdb3a29a"
    },
    {
        "en": "Love has no limit, no age and even no death.",
        "vi": "Tình yêu không có giới hạn, không có tuổi tác, và thậm chí không có cả chết chóc.",
        "id": "68c522f87f364dacb264589a4657c0da"
    },
    {
        "en": "The indeed friendship is when people like and dislike exactly the same things.",
        "vi": "Tình bạn thực sự là khi chúng ta yêu và ghét chính xác những thứ giống nhau.",
        "id": "dcfe445f486b488eb8bf123e9da2ebec"
    },
    {
        "en": "Friendship starts with smiles, grows with stories and only ends with a death.",
        "vi": "Tình bạn bắt đầu bởi nụ cười, lớn lên bởi những câu chuyện và chỉ kết thúc, khi chúng ta không còn sống.",
        "id": "2af8f0749a1f48ae9c54994f903266b4"
    },
    {
        "en": "When we faces a hundred reasons to sad and cry, show this life that we also have a thousand reasons to smile and happy.",
        "vi": "Khi chúng ta phải đối mặt với hàng trăm lý do làm mình buồn và khóc, hãy cho cuộc đời thấy bạn còn có cả ngàn lý do để tươi cười và hạnh phúc.",
        "id": "4bc5afaf3d074fc8bca99d0bd5e317dd"
    },
    {
        "en": "We could never learn to be forgive, patient and brave If there were only happiness and joy in the world",
        "vi": "Chúng ta có thể sẽ không bao giờ học được cách tha thứ, kiên nhẫn và can đảm, nếu trên thế gian này chỉ tồn tại hạnh phúc và niềm vui",
        "id": "a0b7da1ae366476fb09c9071712a0864"
    },
    {
        "en": "I always use the laziest guys to do hard work. Because, he will find the easiest ways to do it.",
        "vi": "Tôi luôn luôn chọn người lười biếng nhất để làm một công việc khó. Bởi vì anh ta sẽ luôn tìm ra cách để hoàn thành nó dễ dàng nhất.",
        "id": "43b85b07772b4249ab5f854feb9f5818"
    },
    {
        "en": "Life is not fair, please get used to it.",
        "vi": "Cuộc đời không công bằng đâu, hãy làm quen với nó đi.",
        "id": "9756c015198f4d94bf9f87e45501eed0"
    },
    {
        "en": "Please never give up. Although today is hard, tomorrow will be worse, but the day after tomorrow will surely be sunshine.",
        "vi": "Xin đừng bao giờ từ bỏ. Mặc dù ngày hôm nay thật khó khăn, ngày mai còn tồi tệ hơn nhưng ngày kia chắc chắn sẽ là thật tuyệt vời.",
        "id": "21f40a7873174a4a8398f189e9d00b1a"
    },
    {
        "en": "You really should learn from your adversary, but never copy. Copy and you’ll die.",
        "vi": "Bạn thực sự nên học từ đối thủ, nhưng đừng bao giờ đi sao chép. Sao chép và bạn sẽ chết.",
        "id": "db4d3abbcd6b4b19b397f16211de6707"
    },
    {
        "en": "An intelligent person is like a river, the deeper the less noise.",
        "vi": "Người thông minh giống như một dòng sông, càng sâu lắng càng ít ồn ào.",
        "id": "1f4377b5101c4c5b92476bf106101c52"
    },
    {
        "en": "It is better to be hated for what you are than to be loved for what you are not.",
        "vi": "Bị ghét vì là chính bản thân mình còn tốt hơn là được yêu bởi những gì không phải là bạn.",
        "id": "a7748f9a942e41399bd31461fb5800b2"
    },
    {
        "en": "Never say all things you know. And never believe all the things you hear.",
        "vi": "Đừng bao giờ nói ra hết tất cả những gì bạn biết. Và cũng đừng bao giờ tin tất cả những điều bạn nghe.",
        "id": "e9fb2a28df664defa7259f4e548b8b05"
    },
    {
        "en": "Insanity is doing the same thing, over and over again, but expecting different results.",
        "vi": "Sự điên rồ là làm một việc giống nhau, lặp đi lặp lại, nhưng mong chờ những kết quả khác nhau.",
        "id": "0f170e9ff24044809754f25696fab99e"
    },
    {
        "en": "It does not do to dwell on dreams and forget to live.",
        "vi": "Đừng bám lấy những giấc mơ mà quên mất cuộc sống hiện tại.",
        "id": "2133866ac645469ebea9e22f69491ea9"
    },
    {
        "en": "Good friends, good books, and a sleepy conscience: this is the ideal life.",
        "vi": "Bạn tốt, sách hay và một lương tâm thanh thản: đó chính là cuộc sống lý tưởng.",
        "id": "92be6c170f2b48bd9429128c9d3a89fe"
    },
    {
        "en": "Don’t cry because it’s over, smile because it happened.",
        "vi": "Đừng khóc vì nó kết thúc, hãy cười vì nó đã xảy ra.",
        "id": "c9fb71f0e0dc4201bf64ed378c3eabbb"
    },
    {
        "en": "To live is the rarest thing in the world. Most people exist, that is all.",
        "vi": "Sống là điều hiếm có nhất nhất trên thế giới này, phần lớn mọi người chỉ tồn tại, đó là tất cả.",
        "id": "d714f58b89754ba3801f8839da310bf2"
    },
    {
        "en": "Life is not fair – get used to it!",
        "vi": "Cuộc sống vốn không công bằng, hãy học cách thích nghi với chúng.",
        "id": "4498777ca3404da6a6a08450a3696f3d"
    },
    {
        "en": "Life is a story. Make yours the best seller.",
        "vi": "Cuộc đời là một câu chuyện. Hãy biến câu chuyện cuộc đời của bạn thành tác phẩm bán chạy nhất.",
        "id": "0e25c631c2ff4e45bbde12a53afdcc21"
    },
    {
        "en": "Life is really simple, but we insist on making it complicated.",
        "vi": "Cuộc sống vốn đơn giản, nhưng chúng ta luôn làm cho nó phức tạp lên.",
        "id": "1c8b47d563954375b2627b2444b8a7b1"
    },
    {
        "en": "Life isn’t about finding yourself. Life is about creating yourself.",
        "vi": "Cuộc sống không phải là đi tìm chính bạn mà cuộc sống là tạo nên chính bạn.",
        "id": "6766f8cb7fca4559be09b5def7d78a9a"
    },
    {
        "en": "You should learn from your competitor, but never copy. Copy and you die.",
        "vi": "Bạn nên học từ đối thủ, nhưng đừng bao giờ sao chép. Sao chép và bạn sẽ chết.",
        "id": "d3774f0f549b4741bfca27b308097b87"
    },
    {
        "en": "Not how long, but how well you have lived is the main thing.",
        "vi": "Không phải sống bao lâu mà sống tốt như thế nào mới là điều quan trọng.",
        "id": "e29e1b486c5a403899ccbac90f140de6"
    },
    {
        "en": "I’m the one that’s got to die when it’s time for me to die, so let me live my life the way I want to.",
        "vi": "Tôi sẽ chết khi mà tôi cần phải chết. Vì thế hãy để tôi sống cuộc sống theo cách tôi muốn.",
        "id": "13f35e1b679249adbacf42a4c7a6273c"
    },
    {
        "en": "I am thankful to all who said no to me. It is because of them that I’m doing it myself.",
        "vi": "Tôi rất biết ơn những người đã nói không với tôi. Chính nhờ họ mà tôi đang làm việc bằng chính sức mình.",
        "id": "82e540b9cbeb4d5ea649c87809aa84ae"
    },
    {
        "en": "Life is short, smile while you still have teeth.",
        "vi": "Cuộc đời ngắn lắm, hãy cười khi bạn còn răng.",
        "id": "7815fef14eda443bb88682092714c603"
    },
    {
        "en": "The only person you should try to be better than is the person you were yesterday.",
        "vi": "Người mà bạn nên cố gắng để trở nên tốt đẹp hơn chính là bạn của ngày hôm qua.",
        "id": "335bc2f9e011464aa1b2db3ab663fbf2"
    },
    {
        "en": "Faith is the art of holding on to things your reason has once accepted, in spite of your changing moods.",
        "vi": "Niềm tin là nghệ thuật níu giữ những điều mà bạn có lý do chấp nhận nó, dù cho bạn có thay đổi tâm trạng như thế nào.",
        "id": "e276c1a7118f4d868cc6017e04045501"
    },
    {
        "en": "A man who flies from his fear may find that he has only taken a shortcut to meet it.",
        "vi": "Người mà thoát được ra khỏi nỗi sợ của họ sẽ hiểu rằng họ chỉ đi 1 đoạn đường tắt đến gặp nó mà thôi.",
        "id": "e5e8e6c4dd034602bb352c5997bc667f"
    },
    {
        "en": "No one can make you feel inferior without your consent.",
        "vi": "Không ai có thể làm bạn cảm thấy kém hơn nếu không có sự bằng lòng của bạn.",
        "id": "707fbd3df15c48e69b2e14c4bb53659d"
    },
    {
        "en": "If you want to go fast, go alone. If you want to go far, go together.",
        "vi": "Nếu bạn muốn đi nhanh, hãy đi một mình. Nếu bạn muốn đi xa, hãy đi cùng nhau.",
        "id": "5d853535a47c4aec809f728d2b7523d4"
    },
    {
        "en": "Defeat is simply a signal to press onward.",
        "vi": "Sự thất bại chỉ đơn giản là một tín hiệu để tiến lên phía trước.",
        "id": "664ed95b8af4492dbfe69694a31f7f73"
    },
    {
        "en": "Those who don’t believe in magic will never find it.",
        "vi": "Ai không tin vào phép màu sẽ không bao giờ tìm thấy nó.",
        "id": "37ae9b59e79f4599bbd67d1784e5512b"
    },
    {
        "en": "There is no elevator to success — you have to take the stairs.",
        "vi": "Không có chiếc thang máy nào đưa bạn đến thành công, bạn phải leo thang thôi.",
        "id": "67c9ed3c817b4e77a10baec131addd2f"
    },
    {
        "en": "Don’t sweat the petty things and don’t pet the sweaty things.",
        "vi": "Đừng đổ mồ hôi cho những thứ nhỏ nhặt và đừng cưng nựng những thứ khiến bạn tốn mồ hôi.",
        "id": "640e9dd6da13442894d8ff513bf03b39"
    },
    {
        "en": "I’m selfish, impatient and a little insecure. I make mistakes, I am out of control and at times hard to handle. But if you can’t handle me at my worst, then you sure as hell don’t deserve me at my best.",
        "vi": "Tôi là kẻ ích kỷ, thiếu kiên nhẫn và dễ dao động. Tôi thường sai lầm, mất kiểm soát và có những thời điểm tôi khó mà điều khiển được. Nhưng nếu bạn không thể đối đãi với tôi trong những lúc tôi tệ nhất, thì bạn chắc chắn không xứng đáng với những gì tốt nhất mà tôi có.",
        "id": "ca321e9158904b328ae40830bdf2458c"
    },
    {
        "en": "You’ve gotta dance like there’s nobody watching,\nLove like you’ll never be hurt,\nSing like there’s nobody listening,\nAnd live like it’s heaven on earth.",
        "vi": "Bạn hãy nhảy như không ai nhìn thấy bạn,\nHãy yêu như bạn không bao giờ bị tổn thương,\nHát như không ai nghe thấy,\nVà sống như thể thiên đường ở trên trái đất.",
        "id": "155246bd3fb246438a1e4ad9cfb7f3a8"
    },
    {
        "en": "In three words I can sum up everything I’ve learned about life: it goes on.",
        "vi": "Trong 3 từ tôi có thể tổng kết mọi thứ tôi học được về cuộc sống: Nó vẫn tiếp tục thôi.",
        "id": "767a058cc25643c59f98f877f6e71c94"
    },
    {
        "en": "There are only two ways to live your life. One is as though nothing is a miracle. The other is as though everything is a miracle.",
        "vi": "Chỉ có duy nhất 2 cách để bạn sống cuộc đời của mình. Một là sống như thể không gì là phép màu cả. Điều còn lại là sống như thể phép màu là tất cả mọi thứ.",
        "id": "16ecdea3e86945ea8496e2aac0eb689b"
    },
    {
        "en": "Life is what happens to us while we are making other plans.",
        "vi": "Cuộc sống là những điều xảy ra với chúng ta khi mình đang tạo nên những kế hoạch khác.",
        "id": "f5d19d1eebe34378b36da8179ebcde49"
    },
    {
        "en": "I may not have gone where I intended to go, but I think I have ended up where I needed to be.",
        "vi": "Tôi có thể đã không đến nơi tôi định đi nhưng tôi nghĩ mình đã đến được nơi tôi cần đến.",
        "id": "e852a53e3d0d477bab2f953ee297891c"
    },
    {
        "en": "Everything you can imagine is real.",
        "vi": "Mọi điều bạn có thể tưởng tượng được đều là thật.",
        "id": "3ce69bbd5945462581f0116998736844"
    },
    {
        "en": "Sometimes the questions are complicated and the answers are simple.",
        "vi": "Đôi khi câu hỏi thường phức tạp thì câu trả lời sẽ rất đơn giản.",
        "id": "417536a5a7bb48a1881cd9d4e3c8c293"
    },
    {
        "en": "Today you are You, that is truer than true. There is no one alive who is Youer than You.",
        "vi": "Hôm nay bạn là chính mình, đó là một điều không ai có thể chối cãi. Chẳng ai có khả năng biến thành bạn giỏi hơn bản thân bạn đâu.",
        "id": "8c63c3cd770244ae9c154497dc2cb538"
    },
    {
        "en": "I’m not afraid of death; I just don’t want to be there when it happens.",
        "vi": "Tôi không sợ cái chết; tôi chỉ không muốn ở đó khi điều này xảy ra.",
        "id": "283b2a8589904c9db18d543dcf89b3d4"
    },
    {
        "en": "Sometimes people are beautiful.\nNot in looks.\nNot in what they say.\nJust in what they are.",
        "vi": "Đôi khi con người thật đẹp.\nHọ đẹp không phải ở hình dáng,\nKhông phải ở lời họ nói,\nMà ở chính họ là ai.",
        "id": "3c3944288429478cb4a8689484b2bcc0"
    },
    {
        "en": "Life is like riding a bicycle. To keep your balance, you must keep moving.",
        "vi": "Cuộc sống như thể việc đạp một chiếc xe. Để giữ thăng bằng, bạn phải đi tiếp.",
        "id": "fae8a4613dca4866a3c93a50489b457c"
    },
    {
        "en": "Reality continues to ruin my life.",
        "vi": "Thực tế tiếp tục hủy hoại cuộc sống của tôi.",
        "id": "8074b80e851c44f6a79fd7b63e6d36d7"
    },
    {
        "en": "Things change. And friends leave. Life doesn’t stop for anybody.",
        "vi": "Mọi thứ thay đổi, và bạn bè rời đi. Cuộc sống không dừng lại cho bất kỳ ai.",
        "id": "47d3bbd91ac94e318b83f1245b866e8a"
    },
    {
        "en": "When someone loves you, the way they talk about you is different. You feel safe and comfortable.",
        "vi": "Khi ai đó yêu bạn thì cái cách họ nói về bạn rất khác biệt. Bạn sẽ cảm thấy an toàn và thoải mái.",
        "id": "f81d512bf0c147188c8046b4ddaa8670"
    },
    {
        "en": "But better to get hurt by the truth than comforted with a lie.",
        "vi": "Thà bị tổn thương bởi sự thật còn hơn là được xoa dịu bởi lời nói dối.",
        "id": "07a1269329b84a6f955a44c5e83321b6"
    },
    {
        "en": "We are all in the gutter, but some of us are looking at the stars.",
        "vi": "Tất cả chúng ta đều bước đi trên cống rãnh, nhưng chỉ một số người vẫn ngắm các vì sao.",
        "id": "df46fe35932047ff8d5848ba58fbbb9a"
    },
    {
        "en": "Be who you are and say what you mean, because those who mind don’t matter and those who matter don’t mind.",
        "vi": "Hãy là chính mình và nói điều bạn muốn nói. Bởi những người thấy phiền lòng chẳng có ý nghĩa, và những người có ý nghĩa sẽ không thấy phiền lòng.",
        "id": "1f185e2a398e4f73add8e5672748116d"
    },
    {
        "en": "This too, shall pass.",
        "vi": "Rồi mọi chuyện sẽ qua.",
        "id": "c2e6bf3ab385497684793f9c4a401de8"
    },
    {
        "en": "Keep your eyes on the stars and your feet on the ground.",
        "vi": "Hướng đôi mắt về phía những vì sao, và chạm đôi chân trên mặt đất.",
        "id": "e2cfc0ec521d4258bafcf894c12c6706"
    },
    {
        "en": "Never be bullied into silence. Never allow yourself to be made a victim. Accept no one’s definition of your life; define yourself.",
        "vi": "Không bao giờ để bị ngược đãi bởi sự im lặng. Không bao giờ cho phép bản thân trở thành nạn nhân. Không chấp nhận ai định nghĩa cuộc sống của bạn; hãy tự định nghĩa bản thân mình.",
        "id": "5665b6597b4a45ab80d9c8e139295d6a"
    },
    {
        "en": "You never know what worse luck your bad luck has saved you from.",
        "vi": "Bạn sẽ không bao giờ biết được những điều thực sự tồi tệ nào mà được cứu bởi những điều tồi tệ khác của bạn đâu.",
        "id": "f9d23ff2cb674328b43624c920c61899"
    },
    {
        "en": "Life’s too mysterious to take too serious.",
        "vi": "Cuộc sống này quá bí ẩn để coi nó quá nghiêm trọng.",
        "id": "2aa0a6f22cd24eb7a2fed5d55b51299a"
    },
    {
        "en": "The woman who follows the crowd will usually go no further than the crowd. The woman who walks alone is likely to find herself in places no one has been before.",
        "vi": "Người phụ nữ mà đi theo đám đông sẽ luôn không thể đi xa hơn đám đông, người phụ nữ mà đi một mình thì thường tìm thấy cô ấy ở những nơi mà chưa ai từng đến trước đó.",
        "id": "a9bba858873b4b0998b1f7f35785fb71"
    },
    {
        "en": "You can’t go around building a better world for people. Only people can build a better world for people. Otherwise it’s just a cage.",
        "vi": "Bạn không thể xây dựng một thế giới đẹp hơn cho mọi người được. Chỉ có tất cả con người mới có thể xây dựng một thế giới đẹp hơn cho con người thôi. Nếu không thì nó chỉ là một cái lồng sắt.",
        "id": "259e0a85d7d14ebab4b0ed972164b9a8"
    },
    {
        "en": "There isn’t a way things should be. There’s just what happens, and what we do.",
        "vi": "Không có cách nào khiến mọi việc nên như thế. Sẽ chỉ có điều gì đang diễn ra và chúng ta làm gì mà thôi.",
        "id": "fa9674e675194c7f85a3963d47d5e415"
    },
    {
        "en": "Be where your feet are.",
        "vi": "Hãy sống vui với hiện tại.",
        "id": "caf8a0da187b4cf7bd2e7c4e2f6db5d0"
    },
    {
        "en": "It’s not about how hard you can hit; it’s about how hard you can get hit and keep moving forward.",
        "vi": "Bạn đấm mạnh thế nào không thành vấn đề bằng việc bạn bị đánh mạnh thế nào và vẫn tiếp tục tiến về phía trước.",
        "id": "c837816d90ec4b6dba5457316990c639"
    },
    {
        "en": "The trick in life is learning how to deal with it.",
        "vi": "Trò đời chính là việc bạn học được cách xử lý chúng thế nào.",
        "id": "518a42b5019d41be875fb8029efa3377"
    },
    {
        "en": "It’s OK to not be OK, as long as you don’t stay that way.",
        "vi": "Hoàn toàn OK nếu bạn không ổn, miễn là bạn đừng mãi dừng lại ở đó",
        "id": "11e18574ba42404a809ee72076639835"
    },
    {
        "en": "I can be changed by what happens to me but I refuse to be reduced by it.",
        "vi": "Tôi có thể bị thay đổi bởi những điều đang xảy ra nhưng tôi từ chối để bị tuyệt vọng bởi chúng.",
        "id": "7ecc2e1ea6d8497d8c9feb67def457eb"
    },
    {
        "en": "Believe you can and you’re halfway there.",
        "vi": "Hãy tin rằng bạn có thể và bạn đã đang ở nửa chặng đường rồi.",
        "id": "e17f45434726483da1dd31a207e7e4ea"
    },
    {
        "en": "Nothing in life is to be feared; it is only to be understood. Now is the time to understand more so that we may fear less.",
        "vi": "Không có gì trên cuộc đời này là đáng sợ, chỉ cần nó được hiểu. Đây chính là thời điểm để hiểu nhiều hơn vì thế mà chúng ta có thể lo sợ ít hơn.",
        "id": "07d2e5e55ba34e52a1b066cc3fb90603"
    },
    {
        "en": "Plant your garden and decorate your own soul, instead of waiting for someone to bring you flowers.",
        "vi": "Hãy tự trồng vườn và trang trí cho tâm hồn bạn, thay vì chờ đợi ai đó mang hoa đến cho bạn.",
        "id": "e6fb018d35f0480fbcefa74086cd65b1"
    },
    {
        "en": "Do what you feel in your heart to be right- for you’ll be criticized anyway. You’ll be damned if you do, and damned if you don’t.",
        "vi": "Hãy làm điều thâm tâm bạn cho là đúng – vì đằng nào bạn cũng bị chỉ trích. Bạn sẽ bị chửi bới nếu bạn làm, và nguyền rủa nếu bạn không làm.",
        "id": "364cfa03976f47ea93500ed2403ab104"
    },
    {
        "en": "Do not set yourself on fire in order to keep others warm.",
        "vi": "Đừng đặt mình vào lửa để giữ ấm cho những người khác.",
        "id": "ba98359ff945455eb5325ccf842c7b04"
    },
    {
        "en": "I love those who can smile in trouble.",
        "vi": "Tôi thích những người có thể cười khi gặp rắc rối.",
        "id": "f20ba64ab6b84d47bef7bb70d2d58083"
    },
    {
        "en": "Time means a lot to me because, you see, I, too, am also a learner and am often lost in the joy of forever developing and simplifying. If you love life, don’t waste time, for time is what life is made up of.",
        "vi": "Thì giờ rất quan trọng đối với tôi, bạn thấy đấy, tôi cũng luôn học hỏi và thường lạc trong niềm vui của việc sẽ mãi mãi phát triển và đơn giản hóa.",
        "id": "496b9907a4244e089ce6005cc895a779"
    },
    {
        "en": "Very little is needed to make a happy life; it is all within yourself, in your way of thinking.",
        "vi": "Một cuộc sống hạnh phúc được tạo nên từ những thứ nhỏ bé: luôn sống với bản thân mình, theo cách mà bạn suy nghĩ.",
        "id": "882f9c925e6c447288a32f09a4fa8ae4"
    },
    {
        "en": "Life is like playing a violin in public and learning the instrument as one goes on.",
        "vi": "Cuộc sống giống như chơi đàn violin giữa chốn công cộng và học nhạc cụ khi bản nhạc cứ tiếp tục.",
        "id": "685b6e032683496ea58986dceba80e9b"
    },
    {
        "en": "Believe that life is worth living and your belief will help create the fact.",
        "vi": "Hãy tin tưởng rằng cuộc sống này xứng đáng để sống và niềm tin đó của bạn sẽ tạo nên sự thật.",
        "id": "4e28594be7c74871a115fa57b09ff8a6"
    },
    {
        "en": "Do not take life too seriously. You will never get out of it alive.",
        "vi": "Đừng coi cuộc đời quá nghiêm trọng. Bạn sẽ không bao giờ sống sót thoát khỏi nó đâu.",
        "id": "db32fa7971ab427c9c6b3e80de9e8ad7"
    },
    {
        "en": "The heart, like the stomach, wants a varied diet.",
        "vi": "Trái tim giống như chiếc dạ dày muốn 1 chế độ ăn uống đa dạng.",
        "id": "2a69bcdb7f724038b82256c4705ef00e"
    },
    {
        "en": "Life is too important to be taken seriously.",
        "vi": "Cuộc sống quá quan trọng để nghiêm túc quá với nó.",
        "id": "62f910a9e5334108922b408a712733f8"
    },
    {
        "en": "What lies behind you and what lies in front of you, pales in comparison to what lies inside of you.",
        "vi": "Điều nằm sau bạn và điều nằm trước bạn không bằng được điều nằm trong bạn.",
        "id": "1a09768fd63343a0be7f51ca16ef40fc"
    },
    {
        "en": "Don’t gain the world and lose your soul, wisdom is better than silver or gold.",
        "vi": "Đừng đuổi theo quyền lực mà đánh mất đạo đức, cũng như trí tuệ đem đến cho bạn hạnh phúc chứ không phải là tiền bạc và vật chất.",
        "id": "bfa236585f7a42ac8c47f902bd5e50b8"
    },
    {
        "en": "Life can only be understood backwards; but it must be lived forwards.",
        "vi": "Cuộc sống chỉ có thể được giác ngộ bởi những gì đã trải qua; nhưng nó phải tiếp tục được sống hướng về phía trước.",
        "id": "3d7b081cad4740d7bc9e06c9561a28ab"
    },
    {
        "en": "Your time is limited, so don’t waste it living someone else’s life. Don’t be trapped by dogma, which is living with the results of other people’s thinking. Don’t let the noise of others’ opinions drown out your own inner voice. And most important, have the courage to follow your heart and intuition.",
        "vi": "Thời gian có hạn vì thế đừng lãng phí chúng để sống cuộc sống của người khác. Đừng bị mắc kẹt trong giáo điều bằng việc bạn sống với suy nghĩ của người khác. Đừng để ý kiến của người khác làm mất đi giọng nói bên trong bạn. Và quan trọng nhất, hãy có can đảm để dõi theo trái tim và trực giác của bạn.",
        "id": "cf4759127f5d4717a480c259c1e82fca"
    },
    {
        "en": "If you want to live a happy life, tie it to a goal, not to people or things.",
        "vi": "Nếu bạn muốn sống một cuộc sống hạnh phúc, hãy trói nó vào một mục tiêu chứ đừng trói nó vào vật nào hay người nào.",
        "id": "3cb88f47e3f5488887bcf8af714fca5a"
    },
    {
        "en": "You can be the ripest, juiciest peach in the world and there’s still going to be someone who hates peaches.",
        "vi": "Bạn có thể là quả đào chín mọng nước nhất thế giới này nhưng ngoài kia chắc chắn vẫn sẽ có ai ghét đào.",
        "id": "860a8246d4d64a278945b7f289062d0e"
    },
    {
        "en": "3 most difficult things to do in the world\nYou can’t count your hair\nYou can’t wash your eyes with soap\nYou can’t breathe when your tongue is out.\nNow please put your tongue back inside.",
        "vi": "Ba điều khó nhất trên đời này:\nBạn không thể đếm được số tóc trên đầu bạn.\nBạn không thể rửa mắt bằng xà phòng.\nBạn không thể thở khi thè lưỡi ra ngoài.\nBây giờ thì bạn đặt lưỡi lại vào trong được rồi.",
        "id": "f22033d6502e49c4a62e7ec5a7576f41"
    },
    {
        "en": "When I die, I want my tombstone to offer free WiFi, just so people will visit more often.",
        "vi": "Khi tôi chết, tôi muốn mộ của mình có wifi và mọi người sẽ ghé thăm thường xuyên hơn.",
        "id": "c359761aec134641bd0e86e678c514d8"
    },
    {
        "en": "I’m not lazy. I’m just on my energy saving mode.",
        "vi": "Tôi không lười, tôi chỉ đang ở chế độ tiết kiệm năng lượng thôi.",
        "id": "cec56f7237ed4beca5507e3111466d28"
    },
    {
        "en": "You never know what you have until… you clean your room.",
        "vi": "Bạn sẽ không bao giờ biết mình có gì cho đến khi… bạn dọn phòng mình.",
        "id": "77f14434b5b543bd91b151c82a295585"
    },
    {
        "en": "I wish I were a unicorn so I could stab idiots with my head.",
        "vi": "Tôi ước gì mình là một chú kỳ lân để tôi có thể đâm những kẻ ngốc bằng đầu mình.",
        "id": "ba9e30de3c9a4eb69ca564d0c87cc70c"
    },
    {
        "en": "The brain is a wonderful organ; it starts working in the moment you get up in the morning, and does not stop until you get into the office.",
        "vi": "Não bộ là một cơ quan diệu kỳ, nó bắt đầu hoạt động vào thời điểm bạn thức dậy buổi sáng và không dừng lại cho đến khi bạn vào văn phòng.",
        "id": "c2754c74f4aa4be49ba80bd6f82f2ec9"
    },
    {
        "en": "People say nothing is impossible, but I do nothing everyday.",
        "vi": "Mọi người nói không gì là không thể nhưng tôi lại không làm gì mỗi ngày.",
        "id": "897c89d52c804440bbd86ba1c2384a4d"
    },
    {
        "en": "Light travels faster than sound. This is why some people appear bright until you hear them speak.",
        "vi": "Ánh sáng có tốc độ nhanh hơn âm thanh. Vì thế mà một vài người sẽ xuất hiện sáng bừng cho tới khi bạn nghe được giọng của họ.",
        "id": "0d050ebe219d412fb68bbf41306f0862"
    },
    {
        "en": "Facebook just sounds like a drag, in my day seeing pictures of peoples vacations was considered a punishment.",
        "vi": "Facebook giống như một cái lưỡi rê vậy, nhìn ảnh mọi người đi nghỉ mát cứ như thể một hình phạt.",
        "id": "b87e758c0d5c4704acc752ed7b41027a"
    },
    {
        "en": "Money won’t buy happiness, but it will pay the salaries of a large research staff to study the problem.",
        "vi": "Tiền không mua được hạnh phúc nhưng nó sẽ trả được lương cho lượng lớn nhân viên để nghiên cứu vấn đề.",
        "id": "112e4fcb2faf454da1707cdf187d0069"
    },
    {
        "en": "I’m going to stand outside. So If anyone asks, I am outstanding.",
        "vi": "Tôi sẽ đứng ở ngoài thôi và nếu có ai hỏi thì tôi nói là tôi nổi bật đấy.",
        "id": "6900d15a251a44cdb53db5c6a5609506"
    },
    {
        "en": "You can’t always control who walks into your life… but you can control which window you throw them out of.",
        "vi": "Bạn không thể điều khiển việc ai sẽ bước vào cuộc sống của mình nhưng bạn có thể quyết định bạn có thể ném họ ra khỏi chiếc cửa sổ nào.",
        "id": "fadce87aed43402690385c012107e7ae"
    },
    {
        "en": "I never make the same mistake twice. I make it like five or six times, you know, just to be sure.",
        "vi": "Tôi không bao giờ sai lầm đến lần hai. Tôi thường sai lầm lần thứ năm hoặc sáu để thấy chắc chắn.",
        "id": "0859d38925a9468f94c603aeead3124f"
    },
    {
        "en": "Behind every successful man stands a surprised mother-in-law.",
        "vi": "Đằng sau mỗi người đàn ông thành công thường là một người mẹ vợ đáng kinh ngạc.",
        "id": "2a0d090d08084b2598cc9134a375d470"
    },
    {
        "en": "The man who can smile when things go wrong has thought of someone else he can blame it on.",
        "vi": "Người đàn ông mà có thể mỉm cười khi mọi việc tệ đi chính là do anh ta đã nghĩ đến người mà anh ta có thể đổ lỗi lên họ rồi.",
        "id": "3693093958d54a3986c3a608815fef34"
    },
    {
        "en": "Before you criticize someone, you should walk a mile in their shoes. That way when you criticize them, you are a mile away from them and you have their shoes.",
        "vi": "Trước khi bạn chỉ trích ai đó, bạn nên đi một dặm trên đôi giày của họ (chơi chữ: đặt mình vào vị trí của họ), vì thế mà khi bạn chỉ trích họ, bạn đã chạy xa cả mét và có giày của họ.",
        "id": "c19f755a88324455a0a1d7c83348f5e6"
    },
    {
        "en": "Men are like bank accounts. Without a lot of money they don’t generate a lot of interest.",
        "vi": "Đàn ông như thể những chiếc tài khoản ngân hàng. Nếu không có nhiều tiền thì họ sẽ không nảy sinh sở thích được.",
        "id": "9fafd97acd8442c1b8bc67283691c42f"
    },
    {
        "en": "Men marry women with the hope they will never change. Women marry men with the hope they will change. Invariably they are both disappointed.",
        "vi": "Người đàn ông cưới phụ nữ với hy vọng họ sẽ không bao giờ thay đổi. Phụ nữ cưới đàn ông với hy vọng họ sẽ thay đổi. Chỉ có điều không thay đổi đó là họ đều cùng thất vọng.",
        "id": "b8643d2dcea842f6b77c37eb014c2af5"
    },
    {
        "en": "Do not argue with an idiot. He will drag you down to his level and beat you with experience.",
        "vi": "Đừng tranh cãi với kẻ ngốc. Anh ta sẽ kéo bạn xuống trình độ của mình và đánh bại bạn với kinh nghiệm.",
        "id": "e6ed150d575e49c393ac3d57363f6892"
    },
    {
        "en": "Death is life’s way of telling you you’ve been fired.",
        "vi": "Cái chết là cách mà cuộc sống nói với bạn rằng bạn đã bị sa thải.",
        "id": "5dcf2be7f65b4067b03c7fb337334ac4"
    },
    {
        "en": "People often say that motivation doesn’t last. Well, neither does bathing – that’s why we recommend it daily.",
        "vi": "Mọi người thường nói rằng động lực không tồn tại mãi. Việc tắm rửa cũng vậy, vì thế mà chúng ta mới gợi ý là nó phải được làm hàng ngày.",
        "id": "7dddf525cdb742da9c5167e76faeae19"
    },
    {
        "en": "Don’t worry about the world coming to an end today. It’s already tomorrow in Australia.",
        "vi": "Đừng lo lắng về việc thế giới sẽ kết thúc hôm nay. Bởi nó đã là ngày mai ở Úc rồi.",
        "id": "93834dcd86a44e06ac9a129e30a32311"
    },
    {
        "en": "Whoever said, “It’s not whether you win or lose that counts”, probably lost.",
        "vi": "Bất kỳ ai nói rằng thắng bại không quan trọng thì chắc chắn đã thất bại.",
        "id": "bc21d9fd283e45b09f53eb62b843ead1"
    },
    {
        "en": "Even if you are on the right track, you’ll get run over if you just sit there.",
        "vi": "Kể cả khi bạn đi đúng hướng rồi thì bạn sẽ phải làm lại nếu bạn vẫn chỉ ngồi đó.",
        "id": "524a2113c0784512b60bf55ce869daa6"
    },
    {
        "en": "I wake up every morning at nine and grab for the morning paper. Then I look at the obituary page. If my name is not on it, I get up.",
        "vi": "Tôi thức dậy mỗi sáng vào lúc 9h và cầm lấy tờ báo. Sau đó tôi nhìn vào trang cáo phó. Nếu tên tôi không ở trên đó thì tôi dậy.",
        "id": "4845407057494a37adfc8a089a9635ab"
    },
    {
        "en": "I think being in love with life is a key to eternal youth.",
        "vi": "Tôi nghĩ rằng yêu cuộc sống là một chìa khóa cho tuổi trẻ vĩnh cửu.",
        "id": "0b79585e729e4fc2975a4ea0fc562b96"
    },
    {
        "en": "A man who dares to waste one hour of time has not discovered the value of life.",
        "vi": "Một người đàn ông dám lãng phí một giờ thời gian đã không khám phá ra giá trị của cuộc sống.",
        "id": "9d4f57c75e654a53a3bfdb0c7f3d33bb"
    },
    {
        "en": "If life were predictable it would cease to be life, and be without flavor.",
        "vi": "Nếu cuộc sống được dự đoán thì nó sẽ không còn là cuộc sống, và không có hương vị.",
        "id": "3f08afd75fde48b9bdc2f0d5bf6dad65"
    },
    {
        "en": "All life is an experiment. The more experiments you make the better.",
        "vi": "Tất cả cuộc sống là một thử nghiệm. Càng nhiều thí nghiệm bạn làm càng tốt.",
        "id": "f641ae3938d34da88f0142c7313659cd"
    },
    {
        "en": "All of life is peaks and valleys. Don’t let the peaks get too high and the valleys too low.",
        "vi": "Tất cả cuộc sống là đỉnh và thung lũng. Đừng để cho đỉnh quá cao và thung lũng quá thấp.",
        "id": "d4133573e1f449d6a7cb0f681a9e49c4"
    },
    {
        "en": "Find ecstasy in life; the mere sense of living is joy enough.",
        "vi": "Tìm thuốc lắc trong cuộc sống; ý thức sống đơn thuần là đủ niềm vui.",
        "id": "10ec2c6e5ebe47a48dbaa993598166ba"
    },
    {
        "en": "My mission in life is not merely to survive, but to thrive; and to do so with some passion, some compassion, some humor, and some style.",
        "vi": "Nhiệm vụ của tôi trong cuộc sống không chỉ đơn thuần là để tồn tại, mà là phát triển mạnh; và để làm như vậy với một số niềm đam mê, một số từ bi, một số hài hước, và một số phong cách.",
        "id": "9d32d9a5aec249b0ad42d8c0d082a5cf"
    },
    {
        "en": "However difficult life may seem, there is always something you can do and succeed at.",
        "vi": "Tuy cuộc sống khó khăn nhưng đường như có những điều bạn có thể làm và thành công.",
        "id": "e1e48148a88749a9ba5512834950fe13"
    },
    {
        "en": "The more you praise and celebrate your life, the more there is in life to celebrate.",
        "vi": "Bạn càng ca ngợi và ăn mừng cuộc sống của bạn, càng có nhiều điều trong cuộc sống để ăn mừng.",
        "id": "ebb6e2cb8f764d1a84fc4811fec448c5"
    },
    {
        "en": "The most important thing is to enjoy your life-to be happy-it’s all that matters.",
        "vi": "Điều quan trọng nhất là hãy tận hưởng cuộc sống của bạn để được hạnh phúc – Đó là tất cả những gì quan trọng.",
        "id": "24d0bec5e7874bcbba52fd96ba09ff5b"
    },
    {
        "en": "I enjoy life when things are happening. I don’t care if it’s good things or bad things. That means you’re alive.",
        "vi": "Tôi tận hưởng cuộc sống khi mọi thứ đang xảy ra. Tôi không quan tâm nếu nó có những điều tốt hay xấu. Điều đó có nghĩa là bạn còn sống.",
        "id": "d696645aa68542c9986abb2903c9d5a8"
    },
    {
        "en": "Life is short, and it is up to you to make it sweet.",
        "vi": "Cuộc sống là ngắn ngủi, và nó là tùy thuộc vào bạn để làm cho nó ngọt ngào.",
        "id": "2379056e56e149779f8f7ea6c300798a"
    },
    {
        "en": "Life doesn’t require that we be the best, only that we try our best.",
        "vi": "Cuộc sống không có gì đòi hỏi chúng ta phải là người giỏi nhất, chỉ có điều chúng ta cố gắng hết sức.",
        "id": "a64072fc173e437f88bfcfe6385c9c7e"
    },
    {
        "en": "I always like to look on the optimistic side of life, but I am realistic enough to know that life is a complex matter.",
        "vi": "Tôi luôn thích nhìn vào mặt lạc quan của cuộc sống, nhưng tôi đủ thực tế để biết rằng cuộc sống là một vấn đề phức tạp.",
        "id": "eef10eb8f4e44a328f39b5631e1494a4"
    },
    {
        "en": "The truth is you don’t know what is going to happen tomorrow. Life is a crazy ride, and nothing is guaranteed.",
        "vi": "Sự thật là bạn không biết ngày mai điều gì sẽ xảy ra. Cuộc sống là một chuyến đi điên rồ, và không có gì được đảm bảo.",
        "id": "8e98b63ed91e4f7d884b206f5e235150"
    },
    {
        "en": "The most beautiful things in the world cannot be seen or even touched. They must be felt with the heart.",
        "vi": "Những điều đẹp nhất trên thế giới không thể được nhìn thấy hoặc thậm chí chạm vào. Họ phải được cảm nhận bằng trái tim.",
        "id": "b29a7d2fbd89414abd57fed64a1097ba"
    },
    {
        "en": "A laugh, to be joyous, must flow from a joyous heart, for without kindness, there can be no true joy.",
        "vi": "Để một tiếng cười trở nên tràn đầy niềm hạnh phúc, cần phải xuất phát từ một trái tim vui sướng, bởi không có lòng tử tế, không thể có niềm vui thực sự.",
        "id": "143e1131e18a4f82819e35386415ed87"
    },
    {
        "en": "Be strong enough to let go, and patient enough to wait for what you deserve.",
        "vi": "Đủ mạnh mẽ để cho đi, và đủ kiên nhẫn để chờ đợi những gì bạn xứng đáng nhận.",
        "id": "327102b6aeeb42309c22746fc914f378"
    },
    {
        "en": "Difficult roads often lead to beautiful destinations.",
        "vi": "Những con đường khó khăn luôn luôn dẫn đến những đích đến tươi đẹp.",
        "id": "be71d80c76d744d9a0b16418d69fd647"
    },
    {
        "en": "Don’t judge someone for their choices when you don’t understand their reasons.",
        "vi": "Đừng bao giờ phán xét sự lựa chọn của một ai, vì bạn không hề biết lý do của họ.",
        "id": "fa5997bfc559415094166a0bfdabb9b1"
    },
    {
        "en": "Don’t mix bad words with a bad mood. You’ll have many opportunities to change a mood, but you won’t be able to replace words you spoke.",
        "vi": "Đừng nói những điều tồi tệ khi tâm trạng không tốt. Tâm trạng của bạn có thể thay đổi, nhưng những điều đã nói ra, không thể rút lại được đâu.",
        "id": "8a410c5aaca142328f8fae65c2f89210"
    },
    {
        "en": "If you born poor it’s not your mistake, but you die poor it’s your mistake.",
        "vi": "Nếu bạn sinh ra nghèo khó, đó không phải lỗi của bạn, nhưng nếu bạn chết trong nghèo khó thì đó là lỗi của bạn.",
        "id": "5b4eeca12fbb4f07a7e8c1d5fb606821"
    },
    {
        "en": "Life is like riding a bicycle. To keep your balance you must keep moving.",
        "vi": "Cuộc sống giống như việc lái một chiếc xe đạp. Để giữ được thăng bằng, bạn phải tiếp tục di chuyển.",
        "id": "1ddf79aa4ca64004ab2983a51827d682"
    },
    {
        "en": "Life is the greatest journey you will be ever on.",
        "vi": "Cuộc sống là hành trình vĩ đại nhất mà bạn từng trải qua.",
        "id": "372629853e20430c8e890ec7332938b8"
    },
    {
        "en": "Life is short. Smile while you still have teeth!",
        "vi": "Cuộc sống vốn rất ngắn. Hãy mỉm cười khi bạn vẫn còn có thể!",
        "id": "906121e9bf7244b6b7529a5c4606a2bc"
    },
    {
        "en": "Learn to earn, not to save.",
        "vi": "Hãy học cách kiếm tiền thay vì học cách tiết kiệm.",
        "id": "21abb54ecf034f6299a6321d73b2ba2e"
    },
    {
        "en": "Never ignore a person who cares for you Because one day you may realize you’ve lost the moon while counting the stars.",
        "vi": "Đừng bao giờ bỏ lỡ những người quan tâm bạn thật lòng. Vì một ngày nào đó bạn nhận ra rằng mình đã đánh mất mặt trăng chỉ vì mải mê đếm những vì sao.",
        "id": "cfac2b0899a147faa12d7e8d3afd642f"
    },
    {
        "en": "No matter how good or bad you think life is, wake up each day and be thankful for life. Someone somewhere else is fighting to survive.",
        "vi": "Bất luận bạn nghĩ cuộc sống này tươi đẹp hay xấu xa. Thức dậy mỗi ngày và hãy cảm ơn cuộc sống vì đâu đó trên thế giới này, có người phải đấu tranh để tồn tại.",
        "id": "fa7218325f914bc6b666d7b80208d346"
    },
    {
        "en": "Never be afraid of change. You may lose something good, but you may gain something even better.",
        "vi": "Đừng sợ thay đổi. Bạn có thể đánh mất đi một vài điều tốt đẹp, nhưng bạn có thể đạt được những điều còn tốt đẹp hơn.",
        "id": "e255fe4f432346a3be7712757f8dcefb"
    },
    {
        "en": "Never give up. Today is hard, tomorrow will be worse, but the day after tomorrow will be sunshine.",
        "vi": "Đừng bao giờ từ bỏ. Hôm nay khó khăn, ngài mai còn khó khăn hơn nhưng ngày kia sẽ là ngày tuyệt vời.",
        "id": "191bb154c9fc4fb2b0937fcf2cf5202b"
    },
    {
        "en": "Never say all you know. And never believe all you hear.",
        "vi": "Đừng bao giờ nói tất cả những gì bạn biết. Và đừng bao giờ tin tất cả những gì bạn nghe.",
        "id": "3cd5460a95154ac9ac74f8003c051317"
    },
    {
        "en": "Smiling is the best way to face any problem, to crush every fear and to hide every pain.",
        "vi": "Mỉm cười là cách tốt nhất để đối mặt với mọi vấn đề. Để đè bẹp mọi nỗi sợ hãi, và khoả lấp mọi nỗi đau.",
        "id": "a929177797434af1bde155baabb95d2e"
    },
    {
        "en": "Smile, even if it’s a sad smile, because sadder than a sad smile is the sadness of not knowing how to smile.",
        "vi": "Hãy cười, thậm chí dù đó là nụ cười buồn bã, bởi còn đáng buồn hơn nụ cười buồn bã là sự bi thảm vì không biết phải cười thế nào.",
        "id": "caef3e6de18e402eb91dbc03d239088b"
    },
    {
        "en": "To laugh with others is one of life’s great pleasures. To be laughed at by others is one of life’s great hurts.",
        "vi": "Cười với người khác là một trong những niềm vui thú của cuộc đời. Bị người khác cười là một trong những sự tổn thương lớn của cuộc đời.",
        "id": "603cac545f6f4a4bb56369685fadc9ee"
    },
    {
        "en": "When life gives you a hundred reasons to cry, show life that you have a thousand reasons to smile.",
        "vi": "Khi cuộc đời cho bạn cả trăm lý do để khóc, hãy cho đời thấy bạn có cả ngàn lý do để cười.",
        "id": "11f3877c17ae42d99f3912e78d22b39f"
    },
    {
        "en": "What hurts you today, makes you stronger tomorrow.",
        "vi": "Những gì làm tổn thương bạn hôm nay, ngày mai sẽ cho bạn sức mạnh.",
        "id": "d855187471074b3a91bc8f2eebb0b31e"
    },
    {
        "en": "We could never learn to be brave and patient, if there were only joy in the world.",
        "vi": "Chúng ta không bao giờ có thể học được sự can đảm và kiên nhẫn nếu chỉ có niềm vui trên thế gian này.",
        "id": "e22d7ecf2a9a4c4f866e53c92d069669"
    },
    {
        "en": "You only live once, but if you do it right, once is enough.",
        "vi": "Bạn chỉ sống một lần duy nhất, nhưng nếu bạn làm đúng thì một lần là đủ.",
        "id": "194e43e084984ee48c4515c65c282024"
    },
    {
        "en": "You have two ears and one mouth. Follow that ratio. Listen more, talk less.",
        "vi": "Bạn có 2 cái tai và 1 cái miệng. Cứ vậy đi, nghe nhiều và nói ít thôi.",
        "id": "a5395f40492c4aa997d6ee1073e05a91"
    },
    {
        "en": "Live as if you were to die tomorrow. Learn as if you were to live forever.",
        "vi": "Hãy sống như ngày mai sẽ chết. Hãy học như sẽ sống suốt đời.",
        "id": "43d49002cb40405cb3435f0f9b0fd73c"
    },
    {
        "en": "Fools learn nothing from wise men, but wise men learn much from fools.",
        "vi": "Người ngu ngốc không học hỏi được gì từ người khôn ngoan, nhưng người khôn ngoan học hỏi được nhiều từ người ngu ngốc.",
        "id": "6d5ea50931fc42ef91edc6daee9f73c3"
    },
    {
        "en": "Reading without reflecting is like eating without digesting",
        "vi": "Đọc mà không suy nghĩ giống như ăn mà không tiêu hóa\"",
        "id": "c62727f7762d4bde869d52cf7e53053e"
    },
    {
        "en": "Genius is one percent inspiration and ninety-nine percent perspiration",
        "vi": "Thiên tài là một phần trăm cảm hứng và 99 phần trăm đổ mồ hôi",
        "id": "c6646b6801cb4b2784ebd2c3c9b20d97"
    },
    {
        "en": "There are more men who have missed opportunities than there are who have lacked opportunities",
        "vi": "Chỉ có những người bỏ lỡ cơ hội, chứ không có những người không có cơ hội",
        "id": "d3891a8e14c84024aca35cc6c18be92b"
    },
    {
        "en": "Where there is a will, there is a way",
        "vi": "Nơi nào có ý chí, nơi đó có con đường",
        "id": "2006938c030244db80dfb384b84faae9"
    },
    {
        "en": "On the way to success, there is no trace of lazy men",
        "vi": "rên bước đường thành công không có dấu chân của kẻ lười biếng",
        "id": "6891af9129f246eaae3fb7ea1fd23498"
    },
    {
        "en": "All men who have achieved great things have been great dreamers",
        "vi": "Tất cả những người đã đạt được những điều vĩ đại đều là những người có ước mơ lớn",
        "id": "792fbf88532d4810b75f10212e034e58"
    },
    {
        "en": "Brief is life but love is long",
        "vi": "Cuộc đời ngắn ngủi nhưng tình yêu thì dài",
        "id": "0f7db8382ac042d0be656a73ddf8b3b2"
    },
    {
        "en": "I much prefer being unhappy while loving you to never having seen you",
        "vi": "Thà rằng yêu em mà đau khổ còn hơn cả một đời ta không biết em.",
        "id": "8d4d7c72eea54900b7d409d87dcba788"
    },
    {
        "en": "Only do what your heart tells you",
        "vi": "Chỉ làm những gì con tim mách bảo",
        "id": "7e6e5fd7ff814d3f9ebb0a5cf280694f"
    },
    {
        "en": "The first symptom of true love in a young man is timidity, in a girl it is boldness.",
        "vi": "Triệu chứng đầu tiên của tình yêu chân thành ở người con trai là sự rụt rè, còn ở người con gái là sự táo bạo.",
        "id": "50b7afacd40143bdafb9baa1d54f76c4"
    },
    {
        "en": "We come to love not by finding a perfect person, but by learning to see an imperfect person perfectly.",
        "vi": "Chúng ta sinh ra không phải để yêu một con người hoàn hảo, nhưng là để học cách yêu người không hoàn hảo một cách hoàn hảo.",
        "id": "56707f721b8d4822b8274df6e7c6a0ac"
    },
    {
        "en": "Love can turn the cottage into a golden palace.",
        "vi": "Tình yêu có thể biến mái nhà tranh thành lâu đài vàng.",
        "id": "784dbf6d2d1944c298f04a18b88168b2"
    },
    {
        "en": "Knowledge is a treasure, but practice is the key to it.",
        "vi": "Kiến thức là một kho báu, nhưng thực hành là chìa khóa để mở nó.",
        "id": "a97e86948eca4d7caecf0ca4387c51aa"
    },
    {
        "en": "Every hour of lost time is a chance of future misfortune",
        "vi": "Mỗi một giờ mất đi là một dịp cho sự rủi ro ở tương lai",
        "id": "968fd79e56104e32b3ec50f70ec7e7de"
    },
    {
        "en": "Living without an aim is like sailing without a compass",
        "vi": "Sống mà không có mục đích giống như đi thuyền mà không có la bàn",
        "id": "8c4f1a45566b43ceb6929ad09b0c3292"
    },
    {
        "en": "The golden rule for every business man is this: Put yourself in your customer's place.",
        "vi": "Quy tắc vàng đối với mỗi doanh nhân chính là đặt mình vào vị trí khách hàng.",
        "id": "b094e41696a4458692649378d2863d87"
    },
    {
        "en": "Breakfast like a king, lunch like a queen, dinner like a pauper.",
        "vi": "Ăn sáng như vua, ăn trưa như hoàng hậu, ăn tối như kẻ ăn mày.",
        "id": "d3450cbdbcb344b2ac07b8637e57f6a3"
    },
    {
        "en": "Tell me who's your friend and I'll tell you who you are",
        "vi": "Hãy nói cho tôi biết bạn của anh là ai, tôi sẽ nói cho anh biết anh là người như thế nào",
        "id": "aab64460ba0b4b929bd15a689e15826d"
    },
    {
        "en": "Forgive yourself for your faults and your mistakes and move on.",
        "vi": "Bạn hãy biết cách tha thứ cho những lỗi lầm của chính bản thân mình và bước tiếp.",
        "id": "5991d2afbea841288d76bb32bcde0316"
    },
    {
        "en": "The heart of a mother is a deep abyss at the bottom of which you will always find forgiveness.",
        "vi": "Trái tim của một người mẹ có thể ví như vực sâu muôn trượng và ngự trị tại đáy của trái tim đó là lòng vị tha cho những đứa con.",
        "id": "c4ac8acc88194d76ad8284476373a93c"
    },
    {
        "en": "Forgive those who have hurt you.",
        "vi": "Bạn hãy biết tha thứ cho những kẻ đã làm bạn bị tổn thương.",
        "id": "94f9f55096dd4f61bf5d6dcc6b6f9121"
    },
    {
        "en": "Selfishness must always be forgiven you know, because there is no hope of a cure.",
        "vi": "Sự ích kỷ luôn cần có một sự tha thứ vì bạn không thể tìm thấy loiaj thuốc nào có thể cứu chữa sự ích kỷ.",
        "id": "f4ffe1c5ac79414886e78a768b96d658"
    },
    {
        "en": "Anger ventilated often hurries toward forgiveness; and concealed often hardens into revenge.",
        "vi": "Cơn giận dữ bộc phát ra ngoài luôn được làm dụi bởi lòng vị tha, còn sự giận dữ đưuọc giấu trong lòng sẽ thổi bùng lên ngọn lửa trả thù.",
        "id": "641fd5810f424ae68c9ea3cb2a8d028d"
    },
    {
        "en": "This is the miracle that happens every time to those who really love: the more they give, the more they possess.",
        "vi": "Phép màu luôn tìm đến với những người thực sự có tấm lòng yêu thương: Họ cho đi càng nhiều, họ lại càng có nhiều.",
        "id": "73dad599e7154656b7a67bdcca489f7b"
    },
    {
        "en": "No act of kindness, no matter how small, is ever wasted.",
        "vi": "Sự tử tế, dù nó có nhỏ nhoi như thế nào đi nữa thì nó cũng không bao giờ là lãng phí.",
        "id": "34d0ca66767a4893993e541e479c17af"
    },
    {
        "en": "The injuries we do and the injuries we suffer are seldom weighed on the same scales.",
        "vi": "Những vết thương mà chúng ta nhận không bao giờ bằng những vết thương mà chúng ta gây ra.",
        "id": "79801914a1a8438b847abec5f3e0c6d9"
    },
    {
        "en": "Never find your delight in another's misfortune.",
        "vi": "Bạn đừng bao giờ vui trên nỗi đau của người khác.",
        "id": "73fb1dad5314452c91ab0a84fe983a43"
    },
    {
        "en": "Wherever a man turns he can find someone who needs him.",
        "vi": "Dù bạn có ngoảnh mặt làm ngơ với những gì bạn thấy thì vẫn nhìn thấy người mà bạn cần giúp đỡ.",
        "id": "e1924d80a7b34a9cb75338353eeee22d"
    },
    {
        "en": "It is a characteristic of wisdom not to do desperate things.",
        "vi": "Một đặc điểm của sự khôn ngoan là không bao giờ hành động liều lĩnh.",
        "id": "89532328240a4dfe9914398765b7ac76"
    },
    {
        "en": "A truly good book teaches me better than to read it. I must soon lay it down, and commence living on its hint. What I began by reading, I must finish by acting.",
        "vi": "Một cuốn sách thực sự hay dạy tôi nhiều điều hơn là đọc nó. Tôi phải nhanh chóng đặt nó xuống, bắt đầu sống theo những điều nó chỉ dẫn. Điều tôi bắt đầu bằng cách đọc, tôi phải kết thúc bằng hành động.",
        "id": "14e0e45b445049ee8b7a0e0f936fa08b"
    },
    {
        "en": "The perception of beauty is a moral test.",
        "vi": "Nhận thức về cái đẹp mà một bài kiểm tra đạo đức.",
        "id": "024b18c0ad8e4795907edb0b623e6cf3"
    },
    {
        "en": "There is no odor so bad as that which arises from goodness tainted.",
        "vi": "Không mùi gì tệ hơn mùi bốc ra từ lòng tốt bị nhuốm bẩn.",
        "id": "d6c0d0048e644e1b8cbf23f40b17f091"
    },
    {
        "en": "Not until we are lost do we begin to understand ourselves.",
        "vi": "Chỉ tới khi lạc lối chúng ta mới bắt đầu hiểu bản thân mình.",
        "id": "280d8f5681a8440eae1a3616032dd5e4"
    },
    {
        "en": "It is not enough to be busy. So are the ants. The question is: What are we busy about?",
        "vi": "Bận rộn không là không đủ. Kiến cũng bận rộn. Câu hỏi là: Chúng ta bận rộn vì cái gì?",
        "id": "225ee1d4fcb24865a6865a89650e7a22"
    },
    {
        "en": "In the long run, men hit only what they aim at. Therefore, they had better aim at something high.",
        "vi": "Nhìn về lâu dài, con người chỉ trúng đích những gì mình nhắm tới. Vì vậy tốt nhất anh ta nên nhắm cao.",
        "id": "1afdb90635514f16881d7b9b55a9507b"
    },
    {
        "en": "Do what nobody else can do for you. Omit to do anything else.",
        "vi": "Hãy làm điều không ai khác có thể làm cho bạn. Bỏ qua mọi điều khác.",
        "id": "488e29f381724ca298f706374f4f634e"
    },
    {
        "en": "None are so old as those who have outlived enthusiasm.",
        "vi": "Không ai già hơn những người đã sống cạn bầu nhiệt huyết.",
        "id": "0d67356a691c4dcc87f01b14339e9bc7"
    },
    {
        "en": "Success usually comes to those who are too busy to be looking for it.",
        "vi": "Sự thành công thường đến với những ai không quá bận rộn đi tìm nó.",
        "id": "88b60b47edb54c1eaaf30623ca1e6b49"
    },
    {
        "en": "I never found a companion that was so companionable as solitude.",
        "vi": "Tôi chưa bao giờ tìm thấy người bạn đồng hành nào tốt hơn sự cô độc.",
        "id": "9c0f946633b44079b95d1e9ad1e10167"
    },
    {
        "en": "It is only when we forget all our learning that we begin to know.",
        "vi": "Chỉ khi chúng ta quên hết những gì mình đã học thì chúng ta mới bắt đầu hiểu biết.",
        "id": "736f0b7e41ce4ac3bd7876415e121a33"
    },
    {
        "en": "Money is not required to buy one necessity of the soul.",
        "vi": "Không cần tiền bạc để mua điều cốt yếu của tâm hồn.",
        "id": "9fe75d00e2364e899950f2974730fa20"
    },
    {
        "en": "Nothing goes by luck in composition. It allows of no tricks. The best you can write will be the best you are.",
        "vi": "Không có may mắn trong sáng tác. Không có chỗ cho những trò lừa gạt. Điều tốt nhất anh có thể viết là con người tốt nhất của anh.",
        "id": "7c24c38940ee45c99e3a8efb016f5bcc"
    },
    {
        "en": "I have learned, that if one advances confidently in the direction of his dreams, and endeavors to live the life he has imagined, he will meet with a success unexpected in common hours.",
        "vi": "Tôi đã học được rằng nếu một người tự tin tiến bước theo hướng của giấc mơ và nỗ lực sống cuộc đời mình đã mường tượng thì anh ta sẽ bất ngờ ngặp được thành công trong những lúc bình thường.",
        "id": "5a072c64a0f6416dbd5b97b4a3664529"
    },
    {
        "en": "Nay, be a Columbus to whole new continents and worlds within you, opening new channels, not of trade, but of thought.",
        "vi": "Hãy trở thành Columbus để khám phá những lục địa và thế giới mới bên trong bạn, mở ra những kênh mới, không phải về thương mại mà về tư tưởng.",
        "id": "2836565afb7b45ddab1ecc009a78b0c6"
    },
    {
        "en": "It is what a man thinks of himself that really determines his fate.",
        "vi": "Điều ta nghĩ về bản thân quyết định số phận ta.",
        "id": "e2e55ec59e514562bbccbf00d5be88ea"
    },
    {
        "en": "Justice is sweet and musical; but injustice is harsh and discordant.",
        "vi": "Công lý ngọt ngào và du dương, nhưng bất công thì cay nghiệt và chói tai.",
        "id": "18f29f34d15b471ca47437c59ef8009e"
    },
    {
        "en": "Our truest life is when we are in dreams awake.",
        "vi": "Chúng ta sống thật nhất khi đang mơ trong lúc tỉnh.",
        "id": "4c04d065d2354326854065370010ffb4"
    },
    {
        "en": "As a single footstep will not make a path on the earth, so a single thought will not make a pathway in the mind. To make a deep physical path, we walk again and again. To make a deep mental path, we must think over and over the kind of thoughts we wish to dominate our lives.",
        "vi": "Cũng như một bước chân đơn độc không thể tạo nên đường mòn trên mặt đất, một ý nghĩ đơn độc không thể tạo nên con đường của tư duy. Để xây dựng con đường hằn sâu xuống đất, chúng ta phải qua lại rất nhiều. Để xây dựng con đường hằn sâu trong trí óc, chúng ta phải nghĩ đi nghĩ lại loại ý nghĩ chúng ta muốn chi phối cuộc đời mình.",
        "id": "cd5f6e913c7e45a1b3f52ae2551e9dfe"
    },
    {
        "en": "There are a thousand hacking at the branches of evil to one who is striking at the root.",
        "vi": "Có hàng ngàn cách để chặt cành xấu xa với người bắt đầu từ gốc rễ.",
        "id": "12e05fab346746208659a324356e5049"
    },
    {
        "en": "As you simplify your life, the laws of the universe will be simpler; solitude will not be solitude, poverty will not be poverty, nor weakness weakness.",
        "vi": "Khi anh đơn giản hóa cuộc đời mình, quy luật của vũ trụ cũng trở nên đơn giản hơn, cô độc không còn là cô độc, nghèo đói không còn là nghèo đói, sự yếu đuối không còn là yếu đuối.",
        "id": "c8255f9b63864e7d8e78b645c1b17c5d"
    },
    {
        "en": "It's not what you look at that matters, it's what you see.",
        "vi": "Quan trọng không phải là bạn nhìn gì mà là bạn thấy gì.",
        "id": "0c7d939eb7ca472cb9ea7472a002f359"
    },
    {
        "en": "May we so love as never to have occasion to repent of our love!",
        "vi": "Mong chúng ta có thể yêu thương sao cho không bao giờ phải hối tiếc vì tình yêu của chúng ta.",
        "id": "0c4953de2cae4c8caf9e7185c76f49a1"
    },
    {
        "en": "Aim above morality. Be not simply good, be good for something.",
        "vi": "Hãy nhắm tới cái đích cao hơn đạo đức. Đừng chỉ đơn thuần là tốt, hãy tốt vì một điều gì đó.",
        "id": "ba0f1e3c80444123931f7aa15f017dae"
    },
    {
        "en": "Things do not change; we change.",
        "vi": "Sự việc không thay đổi, chúng ta thay đổi.",
        "id": "5ec8185fee964846b26c1665d9d8da2b"
    },
    {
        "en": "Many men go fishing all of their lives without knowing that it is not fish they are after.",
        "vi": "Nhiều người đi câu cả cuộc đời mà không biết cái mình nhắm đến không phải là cá.",
        "id": "dddb7fbe6e88462a8c3e6dee24f1aa89"
    },
    {
        "en": "Truths and roses have thorns about them.",
        "vi": "Sự thật và hoa hồng đều có gai.",
        "id": "1dd8b270ff0d4e91ada44fb7afc1e47d"
    },
    {
        "en": "Sometimes life is going to hit you in the head with a brick. Don't lose faith.",
        "vi": "Đôi khi cuộc đời sẽ ném gạch vào đầu bạn. Đừng đánh mất niềm tin.",
        "id": "1e33748b1704427f959b9bc976a25daa"
    },
    {
        "en": "Here's to the crazy ones, the misfits, the rebels, the troublemakers, the round pegs in the square holes... the ones who see things differently — they're not fond of rules... You can quote them, disagree with them, glorify or vilify them, but the only thing you can't do is ignore them because they change things... they push the human race forward, and while some may see them as the crazy ones, we see genius, because the ones who are crazy enough to think that they can change the world, are the ones who do.",
        "vi": "Đây là những kẻ điên rồ, lạc lõng, phản kháng, đầy rắc rối, những cái chốt tròn trong những cái lỗ vuông... những người có cách nhìn khác biệt – họ không ưa luật lệ... Bạn có thể trích dẫn họ, không tán đồng với họ, vinh danh họ hoặc lăng mạ họ, nhưng điều duy nhất bạn không thể làm là lờ họ đi bởi vì họ thay đổi nhiều điều... họ thúc đẩy nhân loại tiến lên phía trước, và trong khi một số người có thể thấy họ là điên rồ, chúng tôi thấy những thiên tài, bởi chỉ những người đủ điên rồ để nghĩ mình có thể thay đổi thế giới mới là những người thay đổi thế giới.",
        "id": "ae27c0ddce814e01a1ca304d7469078c"
    },
    {
        "en": "You can't connect the dots looking forward; you can only connect them looking backwards. So you have to trust that the dots will somehow connect in your future. You have to trust in something — your gut, destiny, life, karma, whatever. This approach has never let me down, and it has made all the difference in my life.",
        "vi": "Bạn không thể kết nối các điểm trong đời bạn khi nhìn về phía trước; bạn chỉ có thể kết nối chúng khi nhìn lại phía sau. Vì vậy bạn phải tin tưởng rằng các điểm đó rồi sẽ kết nối trong tương lai. Bạn phải tin vào cái gì đó – lòng can đảm, vận mệnh, cuộc đời, nghiệp chướng, bất cứ điều gì. Cách tiếp cận này chưa bao giờ khiến tôi thất vọng, nó đã tạo nên tất cả sự khác biệt trong cuộc đời tôi.",
        "id": "911ca9446d3d4d50a978435aaf731589"
    },
    {
        "en": "When I was 17, I read a quote that went something like: \"If you live each day as if it was your last, someday you'll most certainly be right.\" It made an impression on me, and since then, for the past 33 years, I have looked in the mirror every morning and asked myself: \"If today were the last day of my life, would I want to do what I am about to do today?\" And whenever the answer has been \"No\" for too many days in a row, I know I need to change something.",
        "vi": "Khi tôi 17 tuổi, tôi đã đọc được một câu trích dẫn: \"Nếu bạn sống mỗi ngày như thể đó là ngày cuối cùng của bạn, một ngày nào đó, bạn sẽ đúng\". Câu nói ấy đã thực sự tạo được ấn tượng với tôi, và kể từ đó, 33 năm qua, tôi đã nhìn vào gương mỗi buổi sáng và tự hỏi mình: \"Nếu hôm nay là ngày cuối cùng của đời mình, thì tôi có muốn làm những điều mình sẽ làm hôm nay không?\". Và bất cứ khi nào câu trả lời là: \"không\" trong nhiều ngày liên tiếp, tôi biết tôi cần phải thay đổi.",
        "id": "66491cb01a5d47e489ec590916cfcdc8"
    },
    {
        "en": "Your time is limited, so don't waste it living someone else's life. Don't be trapped by dogma — which is living with the results of other people's thinking. Don't let the noise of others' opinions drown out your own inner voice. And most important, have the courage to follow your heart and intuition. They somehow already know what you truly want to become. Everything else is secondary.",
        "vi": "Thời gian của bạn không nhiều, vì vậy đừng lãng phí nó để sống cuộc đời của người khác. Đừng nghe những lời giáo điều – đó là sống với kết quả suy nghĩ của người khác. Đừng để âm thanh của những quan điểm khác lấn át đi giọng nói bên trong bạn. Và quan trọng nhất, hãy giữ lấy sự can đảm để đi theo trái tim và trực giác. Chúng biết bạn thực sự muốn trở thành con người như thế nào. Mọi thứ khác chỉ là thứ yếu.",
        "id": "891f6f9ffbe24fe89f6ae7d7df14f784"
    },
    {
        "en": "We don't get a chance to do that many things, and every one should be really excellent. Because this is our life. Life is brief, and then you die, you know? And we've all chosen to do this with our lives. So it better be damn good. It better be worth it.",
        "vi": "Chúng ta không có cơ hội làm quá nhiều điều, và mỗi thứ chúng ta làm đều phải thật sự tuyệt vời. Bởi vì đây là cuộc đời của chúng ta. Cuộc đời ngắn ngủi lắm, và rồi bạn chết, bạn biết chứ? Và chúng ta đều được lựa chọn để làm điều này với cuộc đời mình. Vì vậy điều ta làm nên thật tốt. Nên đáng giá.",
        "id": "e8345d09135f49e589d60d5fee3bdb48"
    },
    {
        "en": "Creativity is just connecting things. When you ask creative people how they did something, they feel a little guilty because they didn't really do it, they just saw something. It seemed obvious to them after a while. That's because they were able to connect experiences they've had and synthesize new things. And the reason they were able to do that was that they've had more experiences or they have thought more about their experiences than other people.",
        "vi": "Sáng tạo chỉ là việc kết nối các vấn đề. Khi bạn hỏi những người giàu tính sáng tạo về cách họ làm điều gì đó, họ cảm thấy hơi gượng gập bởi họ thực sự không làm gì, họ chỉ thấy một số việc. Mọi thứ sẽ trở nên rõ ràng hơn theo thời gian. Đó là bởi vì họ có thể kết nối những kinh nghiệm mình có và tổng hợp thành những thứ mới. Và lý do khiến họ có thể làm điều đó là họ có nhiều kinh nghiệm hơn hoặc họ đã suy nghĩ nhiều về kinh nghiệm của mình hơn người khác.",
        "id": "3046d697e99c42a79152375f177c66d2"
    },
    {
        "en": "Remembering that I'll be dead soon is the most important tool I've ever encountered to help me make the big choices in life. Because almost everything — all external expectations, all pride, all fear of embarrassment or failure — these things just fall away in the face of death, leaving only what is truly important. Remembering that you are going to die is the best way I know to avoid the trap of thinking you have something to lose. You are already naked. There is no reason not to follow your heart.",
        "vi": "Nhớ rằng tôi sẽ chết, đó là công cụ quan trọng nhất tôi từng có để giúp mình thực hiện những lựa chọn lớn trong cuộc đời. Bởi vì hầu hết tất cả mọi thứ – tất cả những hy vọng phù phiếm, lòng kiêu hãnh, nỗi sợ mất mặt hay thất bại – tất cả những thứ này sẽ mờ nhạt đi khi ta đối diện với cái chết, chỉ để lại điều gì thật sự quan trọng. Nhớ rằng bạn sẽ chết, đó là cách tốt nhất tôi biết để tránh cái bẫy suy nghĩ rằng bạn vẫn còn thứ để mất. Bạn thực chất chẳng có gì. Không có lí do để không đi theo trái tim.",
        "id": "b0cb7fef2a4f42ab90fcb2fa7c5fae51"
    },
    {
        "en": "I'm as proud of what we don't do as I am of what we do.",
        "vi": "Tôi tự hào vì những gì chúng tôi không làm cũng như tôi tự hào vì những gì chúng tôi đã làm.",
        "id": "2cab3df663ab454aa572733f8761f209"
    },
    {
        "en": "No one wants to die. Even people who want to go to heaven don't want to die to get there. And yet death is the destination we all share. No one has ever escaped it. And that is as it should be, because Death is very likely the single best invention of Life. It is Life's change agent. It clears out the old to make way for the new. Right now the new is you, but someday not too long from now, you will gradually become the old and be cleared away. Sorry to be so dramatic, but it is quite true.",
        "vi": "Không ai muốn chết. Thậm chí cả những người muốn tới thiên đường cũng không muốn phải chết để lên được đó. Và cái chết là điểm đến của tất cả chúng ta, không ai có thể trốn thoát. Và nên như vậy, bởi cái chết có lẽ là phát minh tốt nhất của sự sống. Nó là tác nhân thay đổi của cuộc sống. Nó xóa cái cũ để mở đường cho cái mới. Ngay bây giờ là bạn, nhưng một ngày không xa hôm nay, bạn dần dần sẽ trở nên già và bị xóa đi. Tôi xin lỗi nếu điều đó nghe có vẻ cường điệu, nhưng đó hoàn toàn là sự thật.",
        "id": "a8f70387d6244e13b3c4cb3c021bdc32"
    },
    {
        "en": "I think if you do something and it turns out pretty good, then you should go do something else wonderful, not dwell on it for too long. Just figure out what's next.",
        "vi": "Tôi nghĩ nếu bạn làm điều gì đó và thu được kết quả tốt đẹp, bạn nên đi tiếp để làm những điều tuyệt vời khác, đừng dừng chân lại quá lâu. Hãy tìm xem nên làm gì tiếp.",
        "id": "606a0fc765d84cf394573e4aa4dbc3e5"
    },
    {
        "en": "Stay hungry, stay foolish.",
        "vi": "Hãy sống khát khao, hãy sống dại khờ.",
        "id": "0eed6ffe97dc4e40ac8a4285ec307b97"
    },
    {
        "en": "I'm an optimist in the sense that I believe humans are noble and honorable, and some of them are really smart. I have a very optimistic view of individuals. As individuals, people are inherently good. I have a somewhat more pessimistic view of people in groups. And I remain extremely concerned when I see what's happening in our country, which is in many ways the luckiest place in the world. We don't seem to be excited about making our country a better place for our kids.",
        "vi": "Tôi là người lạc quan bởi tôi tin rằng con người cao quý và đáng kính trọng, và một số người thực sự thông minh. Tôi có cách nhìn rất lạc quan về cá nhân. Là một cá nhân, con người vốn đã tốt đẹp. Tôi có cách nhìn hơi bi quan về con người theo nhóm. Và tôi vẫn cực kỳ quan ngại khi tôi thấy những gì đang xảy ra ở đất nước chúng ta, nơi theo nhiều cách đúng là một nơi may mắn nhất trên thế giới. Chúng ta dường như không quan tâm nhiều tới việc biến đất nước của chúng ta thành một nơi tốt đẹp hơn cho con trẻ.",
        "id": "3a923196b9554410bd6680bec153186d"
    },
    {
        "en": "Sometimes when you innovate, you make mistakes. It is best to admit them quickly, and get on with improving your other innovations.",
        "vi": "Đôi lúc bạn phạm sai lầm khi đang đổi mới. Tốt nhất là hãy nhanh chóng chấp nhận nó và tiếp tục cải thiện các đổi mới khác của mình.",
        "id": "00286545c94c41d19392b05ccf5958a1"
    },
    {
        "en": "Innovation distinguishes between a leader and a follower.",
        "vi": "Đổi mới là điều tạo ra sự khác biệt giữa người lãnh đạo và kẻ phục tùng.",
        "id": "672f902ad51c45fa906fbc9562b1a16b"
    },
    {
        "en": "You can't just ask customers what they want and then try to give that to them. By the time you get it built, they'll want something new.",
        "vi": "Anh không thể chỉ hỏi khách hàng xem họ muốn gì và rồi cố đem nó cho họ. Tới lúc anh hoàn thiện nó, họ đã muốn thứ mới mẻ khác rồi.",
        "id": "fa325d0da1f14eae8aab683da0f657e8"
    },
    {
        "en": "Simple can be harder than complex: You have to work hard to get your thinking clean to make it simple. But it's worth it in the end because once you get there, you can move mountains.",
        "vi": "Đơn giản có thể khó khăn hơn là phức tạp: Bạn phải nỗ lực thật nhiều trong việc giữ suy nghĩ gọn gàng để đạt được tới sự đơn giản. Nhưng cuối cùng nỗ lực đó đáng giá bởi một khi bạn tới được đó, bạn có thể di chuyển được cả núi non.",
        "id": "1d067233e87b425f955a06a4232526e7"
    },
    {
        "en": "Being the richest man in the cemetery doesn't matter to me... Going to bed at night saying we've done something wonderful... that's what matters to me.",
        "vi": "Tôi không quan tâm tới việc trở thành người giàu có nhất trong nghĩa địa... Nói rằng chúng ta đã làm điều gì đó tuyệt vời trước khi đi ngủ vào mỗi buổi tối... đó là điều quan trọng đối với tôi.",
        "id": "ae520781ca4449f4b0d64118a13561a7"
    },
    {
        "en": "It's not about money. It's about the people you have, how you're led, and how much you get it.",
        "vi": "Vấn đề không phải là tiền bạc. Vấn đề nằm ở bài học làm người, cách bạn làm nhà lãnh đạo và những gì mà bạn thu nhận được.",
        "id": "649f999a433d43888e73a122d89e678a"
    },
    {
        "en": "Great things in business are never done by one person, they're done by a team of people.",
        "vi": "Những điều tuyệt vời trong kinh doanh không bao giờ được thực hiện bởi một người, chúng đến từ cả một tập thể.",
        "id": "aa8008da461f4201b6902543f41e2ec8"
    },
    {
        "en": "Some people are worth melting for.",
        "vi": "Có những người đáng để chúng ta tan chảy vì họ.",
        "id": "b0ce7d20c3b64803bd094f80e8b128bc"
    },
    {
        "en": "You will never age for me, nor fade, nor die.",
        "vi": "Em sẽ không bao giờ có tuổi trong mắt anh, không phai tàn, mà là bất tử.",
        "id": "eaaa7244ce4c4b7293acdc561cd03d5f"
    },
    {
        "en": "In my opinion, the best thing you can do is find someone who loves you for exactly what you are. Good mood, bad mood, ugly, pretty, handsome, what have you.",
        "vi": "Tôi nghĩ, điều tuyệt nhất bạn có thể làm là tìm thấy một người yêu bạn bằng chính con người bạn. Lúc vui, lúc buồn, dù xấu, dù xinh, yêu những gì làm nên bạn.",
        "id": "e7afe9e588904e42931219d3f4e94e59"
    },
    {
        "en": "But the you who you are tonight is the same you I was in love with yesterday, the you I'll be in love with tomorrow.",
        "vi": "Em tối nay giống như em mà tôi yêu ngày hôm qua, và là người mà ngày mai thức dậy tôi vẫn sẽ yêu.",
        "id": "668c2ebb10594987a0e0b28fd3b83963"
    },
    {
        "en": "Love is like the wind, you can't see it but you can feel it.",
        "vi": "Tình yêu giống như một cơn gió, không thể thấy nhưng lại có thể cảm nhận được.",
        "id": "67f844cda40f444692427aa8747e7172"
    },
    {
        "en": "Love means never having to say you're sorry.",
        "vi": "Yêu là không bao giờ phải nói lời xin lỗi.\"",
        "id": "695306b2e0464553ab14a5d43fd203d9"
    },
    {
        "en": "Finding someone you love and who loves you back is a wonderful, wonderful feeling. But finding a true soul mate is an even better feeling. A soul mate is someone who understands you like no other, loves you like no other, will be there for you forever, no matter what. They say that nothing lasts forever, but I am a firm believer in the fact that for some, love lives on eve after we're gone.",
        "vi": "Tìm được một người bạn yêu và yêu lại bạn là một điều tuyệt vời, một cảm giác tuyệt vời. Nhưng tìm được một người tri kỷ là một cảm giác còn tuyệt diệu hơn thế. Người tri kỷ là người hiểu bạn hơn ai hết, yêu bạn hơn ai hết, sẽ ở bên bạn mãi mãi dù bất kể có chuyện gì xảy ra. Người ta nói không có gì là mãi mãi, nhưng tôi tin rằng đối với một số người, tình yêu bất diệt ngay cả khi họ đã ra đi.",
        "id": "07cbb4545d874adca1a6d2476376c7bc"
    },
    {
        "en": "Without you, today's emotions would be the scurf of yesterday's.",
        "vi": "Không có anh, cảm xúc của ngày hôm nay sẽ chỉ là tàn vết của cảm xúc ngày hôm qua.",
        "id": "7c09273a72e4444cb62dfbb7b5ea36fb"
    },
    {
        "en": "But the heart's not like a box that gets filled up. It expands in size the more you love.",
        "vi": "Trái tim không như một chiếc hộp bị lấp đầy dần. Anh càng yêu nhiều hơn, thì nó càng mở rộng ra.",
        "id": "fbed146d8813411d80c676e315e96302"
    },
    {
        "en": "You meet thousands of people and none of them really touch you. And then you meet one person, and your life is changed, forever.",
        "vi": "Bạn gặp hàng trăm người và không một trong số họ có thể làm bạn xao xuyến. Và rồi khi bạn gặp một người, cuộc sống của bạn đã hoàn toàn thay đổi, mãi mãi.",
        "id": "21b4d4165a0d43bd88fe5bc5d1c9552a"
    },
    {
        "en": "Nobody can make you feel inferior without your permission.",
        "vi": "Không người đàn ông nào được phép khiến em cảm thấy mình kém cỏi, trừ phi em cho phép họ làm điều đó.",
        "id": "3b30dddf679b4edbb87fdd0ce0b41fd1"
    },
    {
        "en": "If you want something said, ask a man; if you want something done, ask a woman.",
        "vi": "Nếu bạn chỉ muốn những lời nói suông, hãy tìm đến một người đàn ông; nếu bạn thật sự cần hành động, hãy tìm đến một người phụ nữ.",
        "id": "2bad470d490647f080945fa16d904fdb"
    },
    {
        "en": "Men who treat women as helpless and charming playthings, deserve women who treat men as delightful and generous bank accounts.",
        "vi": "Những người đàn ông đối xử với phụ nữ như những món đồ chơi quyến rũ và vô dụng tất xứng đáng với những người phụ nữ coi đàn ông chẳng khác nào một tài khoản ngân hàng thú vị và hào phóng.",
        "id": "02bdb0b60f9542e3872901da4d7fbc65"
    },
    {
        "en": "By and large, mothers and housewives are the only workers who do not have regular time off. They are the great vacation-less class.",
        "vi": "Nhìn chung, những người mẹ và những người vợ là những người công nhân hầu như chẳng có thời gian nghỉ ngơi. Họ là những người ít được hưởng ngày lễ nhất.",
        "id": "ded0265665a04d5aba2496dbd1d3b943"
    },
    {
        "en": "A charming woman doesn't follow the crowd. She is herself.",
        "vi": "Một người phụ nữ quyến rũ là người không bao giờ chạy theo số đông. Cô ấy luôn là chính mình.",
        "id": "a132a27d07ad42bd8534538aa7c715fb"
    },
    {
        "en": "The fastest way to change society is to mobilize the women of the world.",
        "vi": "Cách nhanh nhất để thay đổi thế giới chính là thông qua những người phụ nữ.",
        "id": "c1196495d3a94499b3e3235bb2819b94"
    },
    {
        "en": "Women are the real architects of society.",
        "vi": "Phụ nữ là những kiến trúc sư tuyệt vời nhất của cuộc sống.",
        "id": "7743a23cf8d44b85a8f0b4af24cf8b31"
    },
    {
        "en": "They say as long as at least one person cares for you, life isn't a waste. So when things go terribly wrong, and you feel like giving up, please remember you still got me.",
        "vi": "Người ta nói rằng, nếu có ít nhất một người quan tâm đến mình, thì cuộc đời vẫn đáng sống. Vì thế, khi nào mà gặp rắc rối hay em muốn bỏ cuộc, hãy nhớ rằng còn có anh em nhé!",
        "id": "197bb1c427c94001b4140f20ab48e559"
    },
    {
        "en": "All the wealth of the world could not buy you a friend, not pay you for the loss of one.",
        "vi": "Tất cả của cải trên thế gian này không mua nổi một người bạn cũng như không thể trả lại cho bạn những gì đã mất.",
        "id": "0b559349868c4e56a1ac7df9220adcff"
    },
    {
        "en": "A man falls in love through his eyes, a woman through her ears.",
        "vi": "Con gái yêu bằng tai, con trai yêu bằng mắt.",
        "id": "096d6815301541959af32e1c9dab36ee"
    },
    {
        "en": "A cute guy can open up my eyes, a smart guy can open up a nice guy can open up my heart.",
        "vi": "Một thằng khờ có thể mở mắt, một gã thông minh có thể mở mang trí óc, nhưng chỉ có chàng trai tốt mới có thể mới có thể mở lối vào trái tim.",
        "id": "565e2dc8917548b58b227d189a1ae866"
    },
    {
        "en": "Don't stop giving love even if you don't receive it. Smile and have patience.",
        "vi": "Đừng từ bỏ tình yêu cho dù bạn không nhận được nó. Hãy mỉm cười và kiên nhẫn.",
        "id": "0fa0701934674e1bb0dedd90801939c8"
    },
    {
        "en": "Love is blind.",
        "vi": "Tình yêu là mù quáng.",
        "id": "59b1c1787e9a4f5ca98994006d675ba7"
    },
    {
        "en": "Friendship often ends in love, but love in friendship never.",
        "vi": "Tình bạn có thể đi đến tình yêu, và không có điều ngược lại.",
        "id": "939630c51b7d4af0858e6f5d6856420d"
    },
    {
        "en": "How can you love another if you don't love yourself?",
        "vi": "Làm sao có thể yêu người khác. Nếu bạn không yêu chính mình.",
        "id": "ef687142656544068413ca4ddc4bfa31"
    },
    {
        "en": "A great lover is not one who lover many, but one who loves one woman for life.",
        "vi": "Tình yêu lớn không phải yêu nhiều người mà là yêu một người và suốt đời.",
        "id": "a16c2a06e34f41b086ac00bdfb32186a"
    },
    {
        "en": "Believe in the sprit of love... it can heal all things.",
        "vi": "Tìn vào sự bất tử của tình yêu điều đó có thể hàn gắn mọi thứ.",
        "id": "a2835e604de54ef0af787fe0a753a38b"
    },
    {
        "en": "You know when you love someone when you want them to be happy event if their happiness means that you're not part of it.",
        "vi": "Yêu là tìm hạnh phúc của mình trong hạnh phúc của người mình yêu.",
        "id": "9c02f9da96b74506b57b63cb641b4f9d"
    },
    {
        "en": "Hate has a reason for everything but love is unreasonable.",
        "vi": "Ghét ai có thể nêu được lý do, nhưng yêu ai thì không thể.",
        "id": "e093c3606478498fbe2dc7c9710bb316"
    },
    {
        "en": "I'd give up my life if I could command one smile of your eyes, one touch of your hand.",
        "vi": "Anh sẽ cho em tất cả cuộc đời này để đổi lại được nhìn em cười, được nắm tay em.",
        "id": "0ec0a6a3520c4ebc94d711987b80ee4e"
    },
    {
        "en": "I would rather be poor and in love with you, than being rich and not having anyone.",
        "vi": "Thà nghèo mà yêu còn hơn giàu có mà cô độc",
        "id": "de22753df057432e933af05be51c49f4"
    },
    {
        "en": "I looked at your face, my heart jumped all over the place.",
        "vi": "Khi nhìn em, anh cảm giác tim anh như loạn nhịp.",
        "id": "5792fff60e3a4f4e8461d5c023a79d7c"
    },
    {
        "en": "In lover's sky, all stars are eclipsed by the eyes of the one you love.",
        "vi": "Dưới bầu trời tình yêu, tất cả những ngôi sao đều bị che khuất bởi con mắt của người bạn yêu.",
        "id": "04ec3964c3194effb5c8370c27aa343c"
    },
    {
        "en": "How come we don't always know when love begins, but we always know when it ends?",
        "vi": "Tại sao chúng ta không bao giờ nhận được tình yêu bắt đầu từ khi nào nhưng chúng ta luôn nhận ra khi tình yêu kết thúc?",
        "id": "e3f43df1c404445a97ac8258f519a4fb"
    },
    {
        "en": "The only feeling of read loss is when you love someone more than you love yourself.",
        "vi": "Cảm giác mất mát duy nhất mà bạn thật sự cảm nhận được là khi bạn yêu một ai đó hơn cả chính bản thân mình.",
        "id": "f784d0fef2e340148b5e61ee5d370b94"
    },
    {
        "en": "When you love someone and you love them with your heart, it never disappears when you're apart.and when you love someone more and you've done all you can do, you set them free, and is that love was true, when you love someone, it will all come back to you.",
        "vi": "Khi bạn yêu một ai đó với tất cả trái tim mình, tình yêu đó sẽ không bao giờ mất đi ngay cả khi bạn phải chia xa. Khi bạn yêu một ai đó và dù bạn đã làm cho tất cả mà vẫn không được đáp lại thì hãy để họ ra đi. Vì nếu tình yêu đó là chân thật thì chắc chắn rằng nó sẽ trở về với bạn.",
        "id": "66cb41ee5d2a4fb5a0757cdedc6b68f8"
    },
    {
        "en": "If I die or go somewhere far, I'll write your name on every star so people looking up can see just how much u mean to me.",
        "vi": "Một ngày nào đó khi anh chết đi hoặc đi đâu đó thật xa. Anh sẽ viết tên em lên tất cả những vì sao, để người người có thể ngước lên và hiểu rằng em có nghĩa với anh nhường nào.",
        "id": "1c84d9b0bea94b00bebad3fff55130bb"
    },
    {
        "en": "Everyday, when God Opens the door of Heaven, he saw me and asked: \"What is your wish for today?!\" I said: Lord Please take care of the one reading this message!",
        "vi": "Mỗi ngày, khi Chúa mở cánh cửa thiên đàng, ngài nhìn anh và hỏi: \"Đìêu ước hôm nay của con là gì?\" anh trả lời: \"Xin người hãy bảo vệ cho người đang đọc tin nhắn này!\"",
        "id": "edfc247593f64a6b8bb7e4669dc818e3"
    },
    {
        "en": "I love you like my life, do you know why? Because you are my life.",
        "vi": "Anh yêu em như yêu cuộc sống của chính mình, em biết tại sao ko? Vì em chính là cuộc sống của anh.",
        "id": "6ab8c0d3493f4ed1bd9ca0547c565478"
    },
    {
        "en": "If water were kisses, I'd send you the sea\nIf leaves were hugs, I'd send you a tree\nIf nite was love, I'd send you the stars\nBut I can't send u my heart cause that where you are",
        "vi": "Nếu giọt nước là những nụ hôn, anh sẽ trao em biển cả.\nNếu lá là những ôm ấp vuốt ve, anh sẽ tặng em cả rừng cây...\nNếu đêm dài là tình yêu, anh muốn gửi em cả trời sao lấp lánh.\nNhưng trái tim anh ko thể dành tặng em vì nơi đó đã thuộc về em.",
        "id": "97e0dba0927948a78c37f76f5916fa22"
    },
    {
        "en": "Love is not getting, but giving.",
        "vi": "Tình yêu không phải là điều ta nhận đuợc mà là những gì ta cho đi.",
        "id": "6808c3ae2cf740b58ed33463067e9cab"
    },
    {
        "en": "Love is to endure for others.",
        "vi": "Tình yêu là vì người khác mà hy sinh, chịu đựng.",
        "id": "99fdab8caff249f6bb1aa95e084bf8c3"
    },
    {
        "en": "Love consists in desiring to give what is our own to another and feeling his delight as our own.",
        "vi": "Tình yêu là niềm khát khao đuợc dâng hiến bản thân và cảm nhận niềm vui của người khác như của chính mình.",
        "id": "8b1ff675bcb84663a442f8a184867e0c"
    },
    {
        "en": "Love in your hear wasn't put there to stay. Love isn't love till you give it away.",
        "vi": "Tình yêu đích thực là tình yêu đuợc dâng hiến.",
        "id": "e0c192b36dc846309fee3b456dcba5ca"
    },
    {
        "en": "Oh. Tell me the truth about love.",
        "vi": "Ôi. Hãy nói cho tôi sự thật về tình yêu.",
        "id": "cfdbfb4a2ef84ceb843adf485c35ec85"
    },
    {
        "en": "Love is the joy of the good, the wonder of the wise, the amazement of the Gods.",
        "vi": "Tình yêu là niềm vui của lòng tốt, là điều kỳ diệu của trí tuệ, là nỗi kinh ngạc của các Thánh thần.",
        "id": "8d1c20ad136242689a31ec3694673019"
    },
    {
        "en": "Bried is life but love is long.",
        "vi": "Cuộc đời ngắn nhưng tình yêu thì trường cửu.",
        "id": "82252f3393734b80b05dc5d7548b5770"
    },
    {
        "en": "Love makes the world go around.",
        "vi": "Tình yêu làm thế giới rộng mở.",
        "id": "5fa00230d0914c62b3fbb0567f0fd93e"
    },
    {
        "en": "One can not love and be wise.",
        "vi": "Người ta không thể sáng suốt khi đang yêu.",
        "id": "0cfad813505246678b5f19ab2418abc5"
    },
    {
        "en": "In this life we can no do great things. We can only do small things with great love.",
        "vi": "Trong cuộc đời này nếu không thể thực hiện những điều lớn lao thì chúng ta vẫn có thể làm những việc nhỏ với một tình yêu lớn.",
        "id": "d05678f075cf4cb5b67f9f7c02ba3dc7"
    },
    {
        "en": "My religion is loving - Kindness.",
        "vi": "Tôn giáo của tôi là lòng nhân ái.",
        "id": "5125fd90683f4be596e31d0addb75800"
    },
    {
        "en": "Deep as first love, and wild with all regret.",
        "vi": "Thẳm sâu như mối tình đầu, và điên cuồng với bao nhiêu nuối tiếc.",
        "id": "850604706ac64c3282c49bcfd7cde203"
    },
    {
        "en": "Love begets love.",
        "vi": "Tình yêu sản sinh ra tình yêu.",
        "id": "dfb0daddc35c442a9bc7c50e948cf9e3"
    },
    {
        "en": "Love and a cough can not be hid.",
        "vi": "Tình yêu cũng như cơn ho không thể dấu kín được.",
        "id": "e89de322d77746688a5462482401d62a"
    },
    {
        "en": "Love will find a way.",
        "vi": "Tình yêu sẽ mở lối.",
        "id": "72ccd91ffe21449eb8ead893138431c2"
    },
    {
        "en": "Love is an act of endless forgiveness a tender look which becomes a habit.",
        "vi": "Tình yêu là một hành động vị tha vô bờ bến và là nét dịu dàng đã trở nên thân thuộc.",
        "id": "6ae325d62ee8489e940456a701f0b648"
    },
    {
        "en": "You may only be one person to the world but you may be the world to one person.",
        "vi": "Đối với thế giới này bạn chỉ là một người nhưng đối với ai đó bạn là cả một thế giới.",
        "id": "0cd1e0f9ce1c41e8925eda8ddd5ebfd1"
    },
    {
        "en": "I love you not because of who you are, but because of who I am when I am with you",
        "vi": "Tôi yêu em không phải vì em là ai, mà là vì tôi sẽ là người thế nào khi ở bên em",
        "id": "6eb9aa1c58cf40f392f4e5a0029b4d51"
    },
    {
        "en": "No man or woman is worth your tears, and the one who is, won't make you cry",
        "vi": "Không có ai xứng đáng với những giọt nước mắt của bạn, người xứng đáng với chúng thì chắc chắn không để bạn phải khóc",
        "id": "7361713e843942f08381eb3c9d0ba763"
    },
    {
        "en": "Just because someone doesn't love you the way you want them to, doesn't mean they don't love you with all they have",
        "vi": "Nếu một ai đó không yêu bạn được như bạn mong muốn, điều đó không có nghĩa là người đó không yêu bạn bằng cả trái tim và cuộc sống của họ",
        "id": "3bd5dc49f6644ab2a5152782ccf8e39f"
    },
    {
        "en": "A true friend is someone who reaches for your hand and touches your heart",
        "vi": "Người bạn tốt nhất là người ở bên bạn khi bạn buồn cũng như lúc bạn vui",
        "id": "ce24953e7a5247ad83408eb09289f9ae"
    },
    {
        "en": "Never frown, even when you are sad, because you never know who is falling in love with your smile",
        "vi": "Đừng bao giờ tiết kiệm nụ cười ngay cả khi bạn buồn, vì không bao giờ bạn biết được có thể có ai đó sẽ yêu bạn vì nụ cười đó",
        "id": "52fc0e6ea9bd40a2a704b7b55e1fc5d1"
    },
    {
        "en": "Don't waste your time on a man/woman, who isn't willing to waste their time on you",
        "vi": "Đừng lãng phí thời gian với những người không có thời gian dành cho bạn",
        "id": "8a337c9858274ef7902142a64140c829"
    },
    {
        "en": "Maybe God wants us to meet a few wrong people before meeting the right one, so that when we finally meet the person, we will know how to be grateful",
        "vi": "Có thể Thượng Đế muốn bạn phải gặp nhiều kẻ xấu trước khi gặp người tốt, để bạn có thể nhận ra họ khi họ xuất hiện",
        "id": "bb0941b8c87a428dbeaaed342b8c102d"
    },
    {
        "en": "Don't try so hard, the best things come when you least expect them to.",
        "vi": "Đừng vội vã đi qua cuộc đời vì những điều tốt đẹp nhất sẽ đến với bạn đúng vào lúc mà bạn ít ngờ tới nhất",
        "id": "f2da8332854441caa542769627e01428"
    },
    {
        "en": "You know you love someone when you cannot put into words how they make you feel.",
        "vi": "Khi yêu ai ta không thể diễn tả được cảm giác khi ở bên cô ta thì mới gọi là yêu.",
        "id": "89b698e51516462882d1382577c3bb04"
    },
    {
        "en": "It only takes a second to say I love you, but it will take a lifetime to show you how much.",
        "vi": "Tôi chỉ mất 1 giây để nói tôi yêu bạn nhưng phải mất cả cuộc đời để chứng tỏ điều đó.",
        "id": "9d1149e861a4405183289023cf4960fa"
    },
    {
        "en": "If you be with the one you love, love the one you are with.",
        "vi": "Yêu người yêu mình hơn yêu người mình yêu",
        "id": "f3dd6897ea7e49e1a935addf698aa352"
    },
    {
        "en": "I have you! If you hate me, shoot me with an arrow, but please not on the heart coz that's were you are!",
        "vi": "Anh đã có được em! Nếu em ghét anh, hãy dùng mũi tên bắn anh, nhưng đừng bắn vào trái tim anh em nhé vì em ở đó đấy.",
        "id": "4aaf3d0a5b3a4654901fd6fdac0a81bc"
    },
    {
        "en": "An angel asked me a reason why I care for you so much. I told her I care for you so much coz there's no reason not to.",
        "vi": "Một thiên thần hỏi anh tại sao anh lại yêu em nhiều đến thế, anh đã nói rằng anh rất yêu em bởi vì chả có lí do nào để không làm như thế cả.",
        "id": "2bef741b8a8142bb811e3c4ff145b97b"
    },
    {
        "en": "I will walk with you side by side for only one condition: hide your wings every time we walk together because the whole world might know that you're my angel!",
        "vi": "Anh sẽ luôn đi bên cạnh em chỉ với 1 điều kiện: em hãy giấu đôi cánh của em mỗi lần chúng ta đi cùng nhau nếu không cả thế giới sẽ biết em là thiên thần của anh mất.",
        "id": "048fa634b6ab4c8bb6d73a8389f69651"
    },
    {
        "en": "A day may start or end without a message from me, but believe me it won't start or end without me thinking of you.",
        "vi": "Một ngày anh có thể không gọi điện và nhắn tin cho em lúc thức dậy và trước khi đi ngủ, nhưng hãy tin rằng không ngày nào là không mở đầu và kết thúc với ý nghĩ về em.",
        "id": "8f979c336167473b96fd2a3a7fad1c59"
    },
    {
        "en": "Because even if the whole world was throwing rocks at you, if you had your mother at your back, you'd be okay. Some deep-rooted part of you would know you were loved. That you deserved to be loved.",
        "vi": "Bởi vì ngay cả nếu cả thế giới quay lưng và chỉ trích bạn, nếu bạn có mẹ ủng hộ, bạn sẽ ổn thôi. Phần sâu thẳm nhất trong bạn biết rằng bạn được yêu thương. Rằng bạn xứng đáng được yêu thương.",
        "id": "481c04c07476449195d61d9e86f3da55"
    },
    {
        "en": "No one worries about you like your mother, and when she is gone, the world seems unsafe, things that happen unwieldy. You cannot turn to her anymore, and it changes your life forever. There is no one on earth who knew you from the day you were born; who knew why you cried, or when you'd had enough food; who knew exactly what to say when you were hurting; and who encouraged you to grow a good heart. When that layer goes, whatever is left of your childhood goes with her.",
        "vi": "Không ai lo lắng cho bạn nhiều như mẹ của bạn; và khi mẹ ra đi, thế giới dường như trở nên bất an, mọi thứ xảy ra ngoài vùng kiểm soát. Bạn không thể dựa vào bà nữa, và điều đó thay đổi cuộc sống của bạn mãi mãi. Không có ai biết bạn từ lúc bạn sinh ra; biết tại sao bạn khóc, hay khi bạn đã ăn no, người biết chính xác điều nên nói khi bạn tổn thương; và là người luôn cổ vũ bạn trưởng thành với một trái tim nhân hậu. Khi người đó đi, tất cả những ký ức tuổi thơ cũng đi cùng người ấy.\"",
        "id": "1794b915d9674b3caaa2513d44f99af6"
    },
    {
        "en": "Mothers were the only ones you could depend on to tell the whole, unvarnished truth.",
        "vi": "Mẹ là người duy nhất bạn có thể dựa dẫm và kể cho họ nghe toàn bộ sự thật không chút che đậy hay giấu giếm.",
        "id": "dd69034c8e9f45a988592a7ada8761fc"
    },
    {
        "en": "A mother is a person who, seeing there are only four pieces of pie for five people, promptly announces she never did care for pie.",
        "vi": "Mẹ là người mà nếu nhìn thấy có bốn miếng bánh cho năm người, sẽ đột nhiên thông báo rằng bà chưa bao giờ thích bánh cả.",
        "id": "37641f5282d646bbaa99514f80d3f130"
    },
    {
        "en": "God could not be everywhere, and therefore he made mothers.",
        "vi": "Chúa không thể ở khắp mọi nơi, vì thế họ tạo ra những người mẹ.",
        "id": "0b6699043dca4d7281bf88dc73c0486e"
    },
    {
        "en": "The best place to cry is on a mother's arms.",
        "vi": "Nơi tốt nhất để khóc đó là trong vòng tay của mẹ.",
        "id": "fc3d50a5a306473a8bfc6d773cee9fc9"
    },
    {
        "en": "It's fine to celebrate success but it is more important to heed the lessons of failures.",
        "vi": "Ca tụng thành công là điều tốt, nhưng lưu tâm thất bại mới là điều quan trọng hơn.",
        "id": "35c497a16269401889f22389ac764d7a"
    },
    {
        "en": "A person who never made a mistake never tried anything new.",
        "vi": "Người chưa bao giờ mắc lỗi là người chưa bao giờ dám thử điều gì mới.",
        "id": "c472aeb1592c49cc806f3fc41f04fd46"
    },
    {
        "en": "The best way to predict the future is to create it.",
        "vi": "Cách tốt nhất để dự đoán tương lai là tự tạo ra nó.",
        "id": "55929a5663a1469cbf8a727027f23970"
    },
    {
        "en": "Failure defeats losers, failure inspires winners.",
        "vi": "Thất bại hạ gục kẻ chịu thua, thúc giục kẻ chiến thắng.",
        "id": "47db45ef18d040e0920bb647b30a2878"
    },
    {
        "en": "Passion is energy. Feel the power that comes from focusing on what excites you.",
        "vi": "Đam mê là năng lượng. Hãy cảm nhận sức mạnh đến từ việc tập trung vào thứ khiến bạn phấn khích.",
        "id": "bc3906dc34834e49b3f3fcbc8c59a57e"
    },
    {
        "en": "You're never a loser until you quit trying.",
        "vi": "Bạn không bao giờ là kẻ thua cuộc cho đến khi bạn bỏ cuộc.",
        "id": "943dcee4a3744049823aa08f513682d3"
    },
    {
        "en": "Honesty is a very expensive gift. Do not expect it from cheap people.",
        "vi": "Trung thực là một món quà đắt đỏ, đừng mong chờ nó từ những kẻ rẻ tiền.",
        "id": "4a024805c53d4f4bafe4fab58d0bf166"
    },
    {
        "en": "Not all of us can do great things. But we can do small things with great love.",
        "vi": "Không phải ai cũng có thể làm những điều vĩ đại. Nhưng chúng ta có thể làm những điều nhỏ nhặt với tình yêu vĩ đại.",
        "id": "8bb53f54383445208ad0c6ee0acbc034"
    },
    {
        "en": "You can't use up creativity. The more you use, the more you have.",
        "vi": "Bạn sẽ không bao giờ cạn kiệt sự sáng tạo. Đó là thứ mà càng sử dụng bạn càng có nhiều thêm.",
        "id": "4faf06221b564b909215bc55f6bc4f56"
    },
    {
        "en": "Only two things are infinite, the universe and human stupidity, and I'm not sure about the former.",
        "vi": "Chỉ có hai điều là vô hạn: vũ trụ và sự ngu xuẩn của con người, và tôi không chắc lắm về điều đầu tiên.",
        "id": "562cb37e189845c498bef22c55733e02"
    },
    {
        "en": "The distinction between the past, present and future is only a stubbornly persistent illusion.",
        "vi": "Sự khác biệt giữa quá khứ, hiện tại và tương lai chỉ là một ảo tưởng dai dẳng đến ngoan cố.",
        "id": "68e0f9d6863e4691a3ede20237b77c11"
    },
    {
        "en": "It's not that I'm so smart, it's just that I stay with problems longer.",
        "vi": "Không phải là tôi quá thông minh, chỉ là tôi chịu bỏ nhiều thời gian hơn với rắc rối.",
        "id": "31c1e3e8cfa74b3c81c80b023ff6c0ce"
    },
    {
        "en": "Learn from yesterday, live for today, hope for tomorrow. The important thing is not to stop questioning.",
        "vi": "Học từ ngày hôm qua, sống ngày hôm nay, hi vọng cho ngày mai. Điều quan trọng nhất là không ngừng đặt câu hỏi.",
        "id": "271bcf915b7e455ca582fb759da5c2ce"
    },
    {
        "en": "The monotony and solitude of a quiet life stimulates the creative mind.",
        "vi": "Sự đơn điệu và cô độc của một cuộc sống yên lặng kích thích trí sáng tạo.",
        "id": "076cb107722b40edb8691d941206eadc"
    },
    {
        "en": "A question that sometimes drives me hazy: am I or are the others crazy?",
        "vi": "Có một câu hỏi đôi khi khiến tôi thấy mơ hồ: Tôi điên hay người khác điên?",
        "id": "c5cce898cefb48abb4f202b51cd24f36"
    },
    {
        "en": "Strive not to be a success, but rather to be of value.",
        "vi": "Đừng phấn đấu để thành công mà hãy phấn đấu để mình có ích.",
        "id": "30ea234df4d64512901c70179318c63a"
    },
    {
        "en": "Any fool can make things bigger, more complex, and more violent. It takes a touch of genius – and a lot of courage – to move in the opposite direction.",
        "vi": "Kẻ ngu xuẩn nào cũng có thể khiến mọi thứ trở nên to hơn, phức tạp hơn và bạo lực hơn. Chỉ bàn tay của thiên tài – và thật nhiều dũng khí – để biến chuyển ngược lại.",
        "id": "ac70d9abed9843c188b29b0066c3295b"
    },
    {
        "en": "Any man who reads too much and uses his own brain too little falls into lazy habits of thinking.",
        "vi": "Người đọc quá nhiều và dùng tới bộ óc quá ít sẽ rơi vào thói quen suy nghĩ lười biếng.",
        "id": "30b976dd6bb846f99530db8252ae71ea"
    },
    {
        "en": "God always takes the simplest way.",
        "vi": "Chúa luôn chọn cách đơn giản nhất.",
        "id": "1e9dbb3d548d4e0db37a9aa7cb2da8d9"
    },
    {
        "en": "Logic will get you from A to B. Imagination will take you everywhere.",
        "vi": "Logic sẽ đưa anh từ điểm A tới điểm B. Trí tưởng tượng sẽ đưa anh tới mọi nơi.",
        "id": "dfec72623b63461ab49fe22336f5de33"
    },
    {
        "en": "The difference between stupidity and genius is that genius has its limits.",
        "vi": "Sự khác biệt giữa thiên tài và kẻ ngu dốt là ở chỗ thiên tài luôn có giới hạn.",
        "id": "a241b3e3fbcd4fe99e8d068749a99aed"
    },
    {
        "en": "I know not with what weapons World War III will be fought, but World War IV will be fought with sticks and stones.",
        "vi": "Tôi không biết chiến tranh thế giới thứ 3 sẽ sử dụng vũ khí nào nhưng tôi biết rằng chiến tranh thế giới thứ 4 sẽ sử dụng gậy gộc và đá!",
        "id": "4edc160403204d55b1a931cb9f04dc58"
    },
    {
        "en": "I think and think for months and years. Ninety-nine times, the conclusion is false. The hundredth time I am right.",
        "vi": "Tôi nghĩ và nghĩ hàng năm hàng tháng. Chín mươi chín lần tôi đi tới kết luận sai lầm. Lần thứ một trăm tôi đúng.",
        "id": "48b664e7f19744069ced317627791a7f"
    },
    {
        "en": "I live in that solitude which is painful in youth, but delicious in the years of maturity.",
        "vi": "Tôi sống với sự cô đơn đau đớn trong tuổi trẻ nhưng lại ngọt ngào trong những năm tháng trưởng thành.",
        "id": "b2cdc0f2ce2d400e8cedb1dd6a58250a"
    },
    {
        "en": "Some people just can't give up, like us.",
        "vi": "Một vài người không thể cứ thế mà bỏ cuộc, như chúng ta vậy.",
        "id": "8ae65d6da0004145aed53078566a2205"
    },
    {
        "en": "Look, you're not who you were and neither am I. I don't know if I believe in God anymore or heaven, but if I'm going to hell, I'm making damn sure I'm holding it off as long as I can.",
        "vi": "Nhìn lại cậu đi, cậu còn không còn là mình trước kia nữa và tôi cũng vậy. Tôi cũng không rằng tôi còn tin vào chúa không nữa và cả thiên đường, nhưng nếu tôi phải xuống địa ngục, tôi chắc chắn tôi sẽ tự mình cầm cự ở đó lâu nhất tôi có thể.",
        "id": "aca360921d6e4aa4bf4cb3d5846562b6"
    },
    {
        "en": "If you want to live, you have become strong.",
        "vi": "Nếu muốn tồn tại, bạn phải trở nên mạnh mẽ.",
        "id": "52049a7021b647798e0a68c31d3f95fa"
    },
    {
        "en": "I didn't think I could be strong. I didn't know I could, but I already was.",
        "vi": "Tôi không nghĩ rằng mình có thể trở nên mạnh mẽ hơn. Tôi không biết rằng tôi có thể nhưng rõ ràng tôi đã làm được.",
        "id": "6e23c0b94faa47dda6bd81abdc7e95e0"
    },
    {
        "en": "You fight. You fight it. And you don't give up. And then one day, you just change. We all change.",
        "vi": "Bạn chống trả. Bạn chiến đấu chống lại chúng. Và bạn không bỏ cuộc. Và rồi một ngày nào đó, bạn đơn giản là đã thay đổi. Tất cả chúng ta đều thay đổi.",
        "id": "f0fded84514648ba8d9c11cf53cdd3f0"
    },
    {
        "en": "I got beat up, life went on and I kept praying for something to happen, but I didn't do anything, not a damn thing.",
        "vi": "Tôi bị đánh, mọi thứ cứ tiếp diễn và tôi cứ tiếp tục cầu nguyện cho những điều sắp tới, nhưng tôi chẳng hề làm bất cứ điều gì để chống trả, không làm bất cứ điều gì.",
        "id": "552fa46c60b94db59ed040f0ac166497"
    },
    {
        "en": "Anger make you stupid and stupid make you killed.",
        "vi": "Sự giận dữ khiến bạn trở nên ngu ngốc và chính sự ngu ngốc đó nó khiến bạn bị loại bỏ.",
        "id": "0dd1a8d5434443d792182d6cf4b6e614"
    },
    {
        "en": "These people are my family and if what you're hiding somehow hurts them in any way. I will kill you.",
        "vi": "Những người này, họ là gia đình của tao và nếu những điều mày đang giấu diếm sẽ làm hại họ bằng cách nào đó. Mày chắc chắn sẽ không có kết cục tốt đẹp.",
        "id": "a5bef43637434a5b9747b621922a6a30"
    },
    {
        "en": "It's us and the dead, we survive this by pulling together, not apart.",
        "vi": "Chỉ có chúng ta và cái chết, chúng ta tồn tại bằng cách cùng nhau vượt qua không phải chia nhỏ theo từng nhóm.",
        "id": "ea59a0b870fd4bf2b665230da9150f92"
    },
    {
        "en": "Life is always a test.",
        "vi": "Cuộc sống này, nó luôn luôn là bài kiểm tra.",
        "id": "0c71b0f229044b3ba76ef3818fff79c6"
    },
    {
        "en": "We can still have joy. We can still take strength from each other.",
        "vi": "Chúng ta vẫn có thể vui mừng. Chúng ta vẫn còn có thể nhận sự giúp đỡ lẫn nhau.",
        "id": "bebefa05a4a646528d95799461e8e794"
    },
    {
        "en": "We keep going for them. We can't turn back because we're afraid.",
        "vi": "Chúng ta sẽ đuổi theo chúng. Chúng ta không thể chỉ đơn giản là bỏ đi bởi vì chúng ta cảm thấy sợ hãi.",
        "id": "1ab9cdff7a69485281833c1db76d9b3e"
    },
    {
        "en": "We've all done the worst kinds of things just to stay alive but we can still come back. We're not too far gone.",
        "vi": "Tất cả chúng ta đều đã làm những điều tồi tệ chỉ để sống sót tuy nhiên tất cả chúng ta đều có thể trở lại làm người. Chúng ta vẫn chưa đi quá xa.",
        "id": "6ae73ef8030d437fa9d6f982ec12d8e9"
    },
    {
        "en": "The world we know is gone, but keeping our humanity? That's a choice.",
        "vi": "Thế giới mà chúng ta biết nay đã không còn tuy nhiên giữ lại tính người? Đó thực sự là 1 sự lựa chọn.",
        "id": "2a0e8d66b8144a57b01ca1b02f0bcfc6"
    },
    {
        "en": "Once I’m with you, nobody else matters.",
        "vi": "Khi em bên anh, những người khác không còn quan trọng nữa.",
        "id": "c6fed865ee1342c78046ff0df2f64b4c"
    },
    {
        "en": "It’s said that nothing lasts forever. Will you be my nothing?",
        "vi": "Người ta vẫn nói chẳng có gì là mãi mãi. Em có thể trở thành “chẳng có gì” của anh không?",
        "id": "0926e96edf9e46b69794f29e874c833e"
    },
    {
        "en": "If I could change the alphabet, I would put U and I together.",
        "vi": "Nếu có thể thay đổi bảng chữ cái, em muốn để U và I cạnh nhau.",
        "id": "e1120ca53e334082a370d2bc37d0ae17"
    },
    {
        "en": "I bet not even all the fireworks in the world can light up my world like you do.",
        "vi": "Anh cá là tất cả pháo hoa trên thế giới này cũng không thể thắp sáng thế giới của anh như em.",
        "id": "9ddb10b7bd2d430eb2662010a5712f1f"
    },
    {
        "en": "I used to think that dreams do not come true, but this quickly changed the moment I laid my eyes on you.",
        "vi": "Em từng nghĩ chẳng có giấc mơ nào thành sự thật, nhưng điều đó đã thay đổi ngay khi em nhìn thấy anh.",
        "id": "b27bcda847b2470e9f1aa0be523c2a0d"
    },
    {
        "en": "There are many ways to be happy, but the fastest way is seeing you.",
        "vi": "Có rất nhiều cách để trở nên hạnh phúc, nhưng cách nhanh nhất là nhìn thấy em.",
        "id": "31479a9d80e54fc6b0c6fb6c2fc42ce1"
    },
    {
        "en": "To the world you may be one person, but to one person you may be the world.",
        "vi": "Đối với thế giới bạn có thể chỉ là một ai đó, nhưng đối với ai đó bạn là cả thế giới.",
        "id": "00b9cfab8788473f9a83949cc8394eab"
    },
    {
        "en": "I love you not because of who you are, but because of who I am when I am with you.",
        "vi": "Anh yêu em không phải bởi vì em là ai, mà bởi vì anh là ai khi ở bên em.",
        "id": "df3bf40508a34f47a1c4aa74a3a2b482"
    },
    {
        "en": "I love you without knowing how, why or even from where.",
        "vi": "Anh yêu em mà không biết như thế nào, tại sao và từ đâu mà ra.",
        "id": "3843a851a5ff46a69a988d07111a96dd"
    },
    {
        "en": "I’m no organ donor, but I’d be happy to give you my heart.",
        "vi": "Em không định hiến tạng, nhưng em rất vui lòng giao trái tim mình cho anh.",
        "id": "573ff2f589c64882be8ffbe82a1ef37c"
    },
    {
        "en": "Are you tired of keeping going in my mind?",
        "vi": "Anh có mệt không khi cứ quanh quẩn trong tâm trí em như thế?",
        "id": "a1472797db424cadb673653b344f6c77"
    },
    {
        "en": "You remind me of my next girlfriend.",
        "vi": "Em khiến anh nhớ đến bạn gái tương lai của mình.",
        "id": "3e7ac758c19d4c749b38cca34eb833e2"
    },
    {
        "en": "Did you hurt yourself… when you fell from the heavens?",
        "vi": "Em có đau không…. lúc rơi từ thiên đường xuống ấy?",
        "id": "7e91d7c2cd0f472397fb5aa27f879c50"
    },
    {
        "en": "I’m not good at anything… except loving you.",
        "vi": "Anh không giỏi làm gì cả… trừ việc yêu em.",
        "id": "0c2c965061344dcaa206f5961520268c"
    },
    {
        "en": "Ask me why I’m so happy and I’ll give you a mirror.",
        "vi": "Hỏi anh điều gì khiến anh hạnh phúc đến thế rồi anh sẽ đưa em một tấm gương.",
        "id": "37691265df764e71ade12e3e36b17605"
    },
    {
        "en": "I’m this fat because I have you in my heart.",
        "vi": "Em béo thế này là vì có anh trong tim đấy.",
        "id": "651fb75fde854345b4a6ce609d40ba1b"
    },
    {
        "en": "Do you know which side of my heart? It’s beside you!",
        "vi": "Anh có biết tim nằm ở bên nào không? Chính là ở bên anh đấy!",
        "id": "35f72426e6494bfc80add0701d9be1f3"
    },
    {
        "en": "Are you a thief? Cause you stole my heart!!!",
        "vi": "Có phải em là một tên trộm? Vì em vừa đánh cắp trái tim anh!!!",
        "id": "fb0dbd0b602b45b89d3ce45acc5b4363"
    },
    {
        "en": "I don’t know what my future holds, but I’m hoping you are in it.",
        "vi": "Anh không biết tương lai sẽ ra sao, nhưng anh hy vọng sẽ có em ở đó.",
        "id": "841f555384304ac181113434aee1d010"
    },
    {
        "en": "Being deeply loved by someone gives you strength, while loving someone deeply gives you courage.",
        "vi": "Được ai đó yêu sâu đậm sẽ cho bạn sức mạnh, còn yêu ai đó sâu đậm sẽ khiến bạn có thêm dũng khí.",
        "id": "34634be7a9cc43699caef02199a8ef8b"
    },
    {
        "en": "Love is like a beautiful flower which I may not touch, but whose fragrance makes the garden a place of delight just the same.",
        "vi": "Tình yêu giống như một bông hoa đẹp mà tôi không thể chạm vào, nhưng hương thơm của nó vẫn khiến cả khu vườn trở nên hạnh phúc.",
        "id": "acfdeb35168b4aa79c09ee7c471fd322"
    },
    {
        "en": "Love is friendship that has caught fire.It settles for less than perfection and makes allowances for human weaknesses.",
        "vi": "Tình yêu là tình bạn bén lửa mà thành. Nó không hoàn hảo và chấp nhận cho những điểm yếu của con người.",
        "id": "16aa9b04b9d94926a71819825fbb775c"
    },
    {
        "en": "Love makes your soul crawl out from its hiding place.",
        "vi": "Tình yêu khiến tâm hồn bạn chui ra khỏi nơi ẩn náu của nó.",
        "id": "dcfde3e8ab7f448f85bf14be735f47a3"
    },
    {
        "en": "True love is eternal, infinite, and always like itself.",
        "vi": "Tình yêu đích thực luôn vĩnh cửu, vô tận và đúng như bản chất của nó.",
        "id": "3a3843a46fd146b4b30c9e5106cfc82e"
    },
    {
        "en": "You can’t blame gravity for falling in love.",
        "vi": "Bạn không thể trách luật hấp dẫn khi bạn “đổ” ai đó được.",
        "id": "bd93d85218904e36be24318e5fa88a8c"
    },
    {
        "en": "I look at you and see the rest of my life in front of my eyes.",
        "vi": "Anh nhìn em và anh thấy cả phần đời còn lại của mình ngay trước mắt.",
        "id": "fe7022faec32431785a69dda13db149b"
    },
    {
        "en": "Love is when the other person’s happiness is more important than your own.",
        "vi": "Tình yêu là khi hạnh phúc của một ai đó khác quan trọng hơn hạnh phúc của chính bạn.",
        "id": "c17eb19c37ad48fcbf40508957810e74"
    },
    {
        "en": "Sometimes the heart sees what is invisible to the eye.",
        "vi": "Đôi khi trái tim nhìn thấy điều mà đôi mắt không thấy.",
        "id": "ad37461ffe4e4444bf8faaf94af74fc2"
    },
    {
        "en": "We are born of love; Love is our mother.",
        "vi": "Chúng ta được sinh ra từ tình yêu. Tình yêu chính là mẹ của chúng ta.",
        "id": "6330da6bcdc24570a9a1d678609fed32"
    },
    {
        "en": "Life is the flower for which love is the honey.",
        "vi": "Cuộc sống là một bông hoa mà tình yêu chính là mật ngọt.",
        "id": "a72ad0337f1d47a19c588aca74239bbb"
    },
    {
        "en": "Love is when he gives you a piece of your soul, that you never knew was missing.",
        "vi": "Tình yêu là khi anh ấy trao cho bạn một mảnh tâm hồn mà bạn chưa bao giờ nghĩ rằng mình bị thiếu.",
        "id": "36e98fc12cb64485bdf30603ef3b7710"
    },
    {
        "en": "Let us always meet each other with smile, for the smile is the beginning of love.",
        "vi": "Chúng ta hãy luôn mỉm cười khi gặp nhau, vì nụ cười là khởi đầu của tình yêu.",
        "id": "4a39455a716a4f04af7b4adad6c46178"
    },
    {
        "en": "Love’s greatest gift is its ability to make everything it touches sacred.",
        "vi": "Món quà tuyệt vời nhất của tình yêu là khả năng biến mọi thứ trở nên thiêng liêng.",
        "id": "c7cd04cf03fe4b9eac28ce76764f5620"
    },
    {
        "en": "Love is the crowning grace of humanity, the holiest right of the soul, the golden link which binds us.",
        "vi": "Tình yêu là ân sủng cao cả nhất của nhân loại, là quyền thiêng liêng nhất của con người và là sợi dây bằng vàng liên kết chúng ta.",
        "id": "d2760c1fc48143f985c816fc97f07cd6"
    },
    {
        "en": "To love and be loved is to feel the sun from both sides.",
        "vi": "Yêu và được yêu là được cảm nhận ánh nắng từ cả hai phía.",
        "id": "fedc22cf7eeb47c384f73225c5ff9786"
    },
    {
        "en": "Immature love says: ‘I love you because I need you.’ Mature love says ‘I need you because I love you.",
        "vi": "Tình yêu chưa trưởng thành nói: “Anh yêu em vì anh cần em.” Tình yêu trưởng thành sẽ nói “Anh cần em vì anh yêu em”.",
        "id": "0b9176a34c82451d997385cad94a335a"
    },
    {
        "en": "It was love at first sight, at last sight, at ever and ever sight.",
        "vi": "Đó là tình yêu sét đánh từ cái nhìn đầu tiên, từ cái nhìn cuối cùng, và từ cái nhìn mãi mãi.",
        "id": "955f858936864b87a781b71d0171cb05"
    },
    {
        "en": "A flower cannot blossom without sunshine, and man cannot live without love.",
        "vi": "Một bông hoa không thể nở nếu thiếu ánh nắng mặt trời, cũng như con người không thể sống nếu không có tình yêu.",
        "id": "86e219544ac74fa79f4660ca95cb1c18"
    },
    {
        "en": "Love isn’t something you find. Love is something that finds you.",
        "vi": "Tình yêu không phải thứ để bạn đi tìm. Tình yêu sẽ tìm thấy bạn.",
        "id": "e4d14a5fdca0430da3f01c74f24026b7"
    },
    {
        "en": "There is nothing permanent except change.",
        "vi": "Không có gì là vĩnh viễn ngoại trừ sự thay đổi.",
        "id": "664189dcceb142d8930629c2dd8d399f"
    },
    {
        "en": "Everything has beauty, but not everyone sees it.",
        "vi": "Mọi thứ đều có vẻ đẹp nhưng không phải ai cũng nhìn thấy điều đó. (Bản thân mình thích câu châm ngôn này nhất, hãy mở lòng, bạn sẽ thấy cuộc sống tốt đẹp hơn)",
        "id": "74fa2f882eab4385b1453f6daae7309c"
    },
    {
        "en": "The best and most beautiful things in the world cannot be seen or even touched – they must be felt with the heart.",
        "vi": "Những điều tuyệt vời nhất trên thế giới không thể nhìn được thấy hay thậm chí chạm vào – chúng phải được cảm nhận bằng trái tim.",
        "id": "6308adb67fef4bbdb686a4ec7c6f36e0"
    },
    {
        "en": "Always remember that you are absolutely unique. Just like everyone else.",
        "vi": "Luôn luôn nhớ rằng bạn hoàn toàn là duy nhất. Cũng giống như mọi người khác.",
        "id": "f7b7282cc242497186d0f2da47566f46"
    },
    {
        "en": "Honesty is the first chapter in the book of wisdom.",
        "vi": "Trung thực là chương đầu tiên trong cuốn sách khôn ngoan. (Câu này khá giống với câu “khôn ngoan là ở thái độ”)",
        "id": "71f765610c5948e592451a6715c19abb"
    },
    {
        "en": "The only thing necessary for the triumph of evil is for good men to do nothing.",
        "vi": "Điều cần thiết duy nhất để cái ác chiến thắng chính là khi những người tốt không làm gì cả.",
        "id": "2a166e639a19400f9d69ac56878671aa"
    },
    {
        "en": "Education is the most powerful weapon which you can use to change the world.",
        "vi": "Giáo dục là thứ vũ khí mạnh nhất mà bạn có thể sử dụng để thay đổi thế giới.",
        "id": "1db20da10ea5462fae7c7c0558e0a017"
    },
    {
        "en": "You don’t choose your family. They are God’s gift to you, as you are to",
        "vi": "Bạn không thể chọn lựa gia đình. Họ là món quà mà Chúa ban cho, cũng giống như bạn vậy. (Câu mình cảm thấy có ý nghĩa nhất)",
        "id": "5db683f3fecc4ba085eee76a3992f8bc"
    },
    {
        "en": "It’s not what you look at that matters, it’s what you see.",
        "vi": "Những gì bạn nhìn thấy không phải là bản chất vấn đề, đó chỉ là những gì bạn nhìn thấy.",
        "id": "cac318c2137247a0b1ee4158f587471e"
    },
    {
        "en": "The World is my country, all mankind are my brethren, and to do good is my religion.",
        "vi": "Thế giới là đất nước của tôi, tất cả nhân loại là anh em của tôi, và làm những điều tốt là tôn giáo của tôi.",
        "id": "5e6d9aaa96d6405caae33df14168f681"
    },
    {
        "en": "A leader is one who knows the way, goes the way, and shows the way.",
        "vi": "Một nhà lãnh đạo là một người biết đường, đi đường và chỉ đường.",
        "id": "e3500778ebe1423aa2cae36d915c09b8"
    },
    {
        "en": "Life is a succession of lessons which must be lived to be understood.",
        "vi": "Cuộc sống là một chuỗi bài học mà bạn cần phải sống mới hiểu được.",
        "id": "857ce9ed78de4e9e8577da673466b483"
    },
    {
        "en": "Sadness flies away on the wings of time.",
        "vi": "Nỗi buồn bay đi trên đôi cánh của thời gian.",
        "id": "aa89d0a18b5e47a0a491b736b182bde5"
    },
    {
        "en": "Life is trying things to see if they work.",
        "vi": "Cuộc sống là thử làm mọi việc để xem nó có cho kết quả không.",
        "id": "3282530809284bd0acc393e2b8020f2e"
    },
    {
        "en": "The measure of life is not its duration, but its donation.",
        "vi": "Thước đo của cuộc đời không phải là một thời gian mà là sự cống hiến.",
        "id": "eca1c090db364be7b1d2a705d3917d12"
    },
    {
        "en": "Do all things with love.",
        "vi": "Hãy làm tất cả mọi thứ bằng tình yêu. (Và thành công sẽ đến với bạn)",
        "id": "5232d4664aaf4db5b0a393e5fd5ebeae"
    },
    {
        "en": "Change your thoughts and you change your world.",
        "vi": "Thay đổi suy nghĩ của bạn và bạn sẽ thay đổi thế giới. (Hãy nghĩ khác đi, biết đâu mọi vấn đề sẽ được giải quyết)",
        "id": "7b508fa499ea47b595937482ab9d6ce2"
    },
    {
        "en": "It is during our darkest moments that we must focus to see the light.",
        "vi": "Chính trong những thời khắc đen tối nhất của cuộc đời, chúng ta cần tập trung để tìm thấy ánh sáng.",
        "id": "6f16eae9eefc4fbba13c52f16b3bf890"
    },
    {
        "en": "Don’t judge each day by the harvest you reap but by the seeds that you plant.",
        "vi": "Đừng đánh giá mỗi ngày qua những gì bạn thu được, mà hãy nhìn vào những hạt giống bạn gieo trồng.",
        "id": "8538d376e0764b95a33fb6d7662b2b5e"
    },
    {
        "en": "Do not dwell in the past, do not dream of the future, concentrate the mind on the present moment.",
        "vi": "Đừng sống trong quá khứ, đừng mơ về tương lai, hãy tập trung tâm trí vào giây phút hiện tại.",
        "id": "8e2f2e31ab874f8b993c7e43107feb20"
    },
    {
        "en": "Success is not final, failure is not fatal: they are the courage to continue that counts.",
        "vi": "Thành công không phải là cuối cùng, thất bại không dẫn đến cái chết: chúng tiếp thêm cho ta dũng khí để tiếp tục.",
        "id": "5ec8fec9bbc84024ae74ab33cbb5cd3c"
    },
    {
        "en": "Today you are you! That is truer than true! There is no one alive who is you-er than you!",
        "vi": "Hôm nay bạn là chính mình, đó là một điều không ai có thể chối cãi. Chẳng ai có khả năng biến thành người như bạn mà giỏi hơn bản thân bạn đâu.",
        "id": "7ea69fd13a41478eaa38a0336355e3f9"
    },
    {
        "en": "The pessimist complains about the wind; the optimist expects it to change; the realist adjusts the sails.",
        "vi": "Người bi quan phàn nàn về gió; người lạc quan hy vọng gió sẽ thay đổi; còn người sống thực tế thì sẽ đi điều chỉnh những cánh buồm.",
        "id": "68bd812d9f3542328755f64d61d2706a"
    },
    {
        "en": "The only true wisdom is in knowing you know nothing.",
        "vi": "Sự khôn ngoan thực sự là hiểu được rằng bạn đang không biết gì. (Đừng tỏ ra cái gì cũng biết, không khôn ngoan tý nào đâu)",
        "id": "9a518994d71145389417dfcefb4d9d97"
    },
    {
        "en": "Problems are not stop signs, they are guidelines.",
        "vi": "Những vấn đề nảy sinh không phải là dấu hiệu dừng lại, chúng là hướng dẫn để đi tiếp.",
        "id": "ecce129c8b9c43c4bc95a1f9de1f1450"
    },
    {
        "en": "When we are no longer able to change a situation – we are challenged to change ourselves.",
        "vi": "Khi chúng ta không thể thay đổi một tình thế – chúng ta được thử thách để thay đổi chính mình.",
        "id": "a64f1ebbb4f64a0984ae1ac54c0b90a2"
    },
    {
        "en": "Let us be grateful to people who make us happy, they are the charming gardeners who make our souls blossom.",
        "vi": "Chúng ta hãy biết ơn những người làm cho ta hạnh phúc, họ là những người làm vườn quyến rũ để khiến cho tâm hồn chúng ta nở hoa.",
        "id": "e83bacdc86b147219827962a4acb93e8"
    },
    {
        "en": "I have not failed. I’ve just found 10,000 ways that won’t work.",
        "vi": "Tôi đã không hề thất bại. Bởi tôi vừa tìm ra 10.000 cách không hiệu quả.",
        "id": "31157d4991d64cc58dc067dd75c42674"
    },
    {
        "en": "Coming together is a beginning; keeping together is progress; working together is success.",
        "vi": "Đến với nhau là một sự khởi đầu; gắn bó nhau là sự phát triển; và làm việc cùng nhau chính là sự thành công.",
        "id": "e1cdfcaf2c7542e3b9c73258726995ef"
    },
    {
        "en": "Do not mind anything that anyone tells you about anyone else. Judge everyone and everything for yourself.",
        "vi": "Đừng bận tâm bất cứ điều gì mà người khác nói với bạn về ai đó. Hãy nhìn nhận tất cả mọi người và mọi thứ theo cách của bạn.",
        "id": "ab998985d11f4873a482a1fb700edd37"
    },
    {
        "en": "You’ve gotta dance like there’s nobody watching, Love like you’ll never be hurt, Sing like there’s nobody listening, And live like it’s heaven on earth.",
        "vi": "Bạn hãy nhảy như không ai nhìn thấy bạn, Hãy yêu như bạn không bao giờ bị tổn thương, Hát như không ai nghe thấy, Và sống như thể thiên đường ở trên trái đất.",
        "id": "44399cceed034e64a5a543f5fc9622f1"
    },
    {
        "en": "It’s better to be hated for what you are, than loved for what you’re not.",
        "vi": "Chẳng thà bị ghét vì những gì thuộc về chính con người ta còn hơn là được yêu thương từ kiếp vay mượn.",
        "id": "d017a2a18c714c11a342eaad0ef44853"
    },
    {
        "en": "Everyone thinks of changing the world but no one thinks of changing himself.",
        "vi": "Ai cũng nghĩ về việc thay đổi cả thế giới, nhưng lại chẳng ai nghĩ đến việc thay đổi bản thân mình cả.",
        "id": "f8f19c1bb09249ed9620b53de2f44018"
    },
    {
        "en": "You may find the worst enemy or best friend in yourself.",
        "vi": "Bạn có thể tìm thấy kẻ thù đáng sợ nhất hoặc là người bạn thân nhất trong chính con người bạn.",
        "id": "453ec4f341b74748b5077db534983179"
    },
    {
        "en": "You’re given this life because you’re strong enough to live it.",
        "vi": "Bạn được ban cho cuộc sống này vì bạn đủ mạnh mẽ để sống nó.",
        "id": "a4f17465782b415b972921bdadda3c13"
    },
    {
        "en": "Life has no remote. Get up and change it yourself.",
        "vi": "Cuộc sống không có điều khiển từ xa. Hãy tự đứng dậy và thay đổi nó.",
        "id": "faa3dc9aa65d468db06e45968a1a4648"
    },
    {
        "en": "Learn from yesterday. Live for today. Hope for tomorrow.",
        "vi": "Học từ hôm qua. Sống cho hôm nay. Hi vọng cho ngày mai.",
        "id": "4a5f5553c7ee45d394f58f6d786bfb52"
    },
    {
        "en": "If you sleep on life, all you will have are dreams.",
        "vi": "Nếu bạn ngủ quên trong cuộc sống, tất cả những gì bạn có là những giấc mơ.",
        "id": "5c41bc9d295046879b3057ddba83a393"
    },
    {
        "en": "The best preparation for tomorrow is doing your best today.",
        "vi": "Sự chuẩn bị tốt nhất cho ngày mai là hãy làm tốt nhất trong ngày hôm nay.",
        "id": "858246a142af4240b82aaa3c9a532c1f"
    },
    {
        "en": "If you cannot do great things, do small things in a great way.",
        "vi": "Nếu bạn không thể làm những điều vĩ đại, hãy làm những việc nhỏ theo cách vĩ đại.",
        "id": "c481b9781a5042d4add0188e2f1ad11f"
    },
    {
        "en": "Nothing is impossible, the word itself says ‘I’m possible’!",
        "vi": "Không gì là không thể, bởi bản thân nó đã nói lên ‘I’m possible’ (Tôi có thể).",
        "id": "d01a14793a1c4ba49e0c05b8bc4c52a3"
    },
    {
        "en": "Do not go where the path may lead, go instead where there is no path and leave a trail.",
        "vi": "Đừng đi những nơi đã có đường dẫn lối, thay vào đó hãy đi nơi chưa có lối và để lại dấu vết.",
        "id": "f2fbc3f242754371a102d91383186c08"
    },
    {
        "en": "All our dreams can come true, if we have the courage to pursue them.",
        "vi": "Tất cả ước mơ của chúng ta có thể trở thành hiện thực, nếu chúng ta có can đảm để theo đuổi chúng.",
        "id": "cb0e58ffbc9c466ea68c331659c58fe9"
    },
    {
        "en": "The secret of success is getting started.",
        "vi": "Bí mật của sự thành công là hãy bắt tay vào làm ngay.",
        "id": "162bc9b17bd946d7acacae5c0e7bc73b"
    },
    {
        "en": "If opportunity doesn’t knock, build a door.",
        "vi": "Nếu cơ hội không tới gõ cửa, hãy xây một cánh cửa.",
        "id": "a291c6230aa94952815b428cd0808390"
    },
    {
        "en": "The journey of a thousand miles begins with one step.",
        "vi": "Cuộc hành trình của một ngàn dặm cũng bắt đầu bằng một bước nhỏ nhoi.",
        "id": "c1fec0a5bcbf411494da8b3a6916ef72"
    },
    {
        "en": "Keep your face always toward the sunshine – and shadows will fall behind you.",
        "vi": "Hãy luôn hướng về ánh mặt trời – và bóng tối sẽ lùi về phía sau bạn.",
        "id": "6f1d46c14777491583010af0a3b995d3"
    },
    {
        "en": "There is no elevator to success. You have to take the stairs.",
        "vi": "Không có chiếc thang máy nào đưa bạn đến thành công, bạn phải leo thang thôi.",
        "id": "4a765def9c1d4ca2925fb52b8ef18b38"
    },
    {
        "en": "Ambition is the path to success. Persistence is the vehicle you arrive in.",
        "vi": "Tham vọng là con đường dẫn bạn đến thành công. Sự kiên trì là chiếc xe chở bạn trên con đường đó.",
        "id": "4589ee47c81b4f6f92caa985f5bda6d1"
    },
    {
        "en": "Nurture your mind with great thoughts. To believe in the heroic makes heroes.",
        "vi": "Hãy nuôi dưỡng tâm hồn bạn với những ý nghĩ lớn lao. Hãy tin rằng những ý tưởng lớn lao sẽ tạo nên những con ngươi lớn lao.",
        "id": "351efd2a42f04a2ebc1a280dd8234882"
    },
    {
        "en": "You can’t start the next chapter of your life if you keep re-reading the last one.",
        "vi": "Bạn không thể bắt đầu chương mới của cuộc đời nếu bạn cứ đọc đi đọc lại mãi chương trước đó.",
        "id": "09cb5ecdfa5d43cdaac2edf841afdb29"
    },
    {
        "en": "Life always offers you a second chance. It’s called tomorrow.",
        "vi": "Cuộc sống luôn cho bạn một cơ hội thứ hai. Nó được gọi là ngày mai.",
        "id": "374d911443644b34a38c28e789e43095"
    },
    {
        "en": "Life is like a camera lens. Focus only on what’s important and you can capture it perfectly.",
        "vi": "Cuộc sống giống như một cái ống kính máy ảnh. Tập trung vào điều quan trọng nhất và bạn sẽ nắm bắt được nó một cách hoàn hảo.",
        "id": "576f859665d24943b0cc442f524f95fe"
    },
    {
        "en": "Friends show their love in times of trouble, not in happiness.",
        "vi": "Bạn bè thể hiện tình cảm của họ trong những lúc khó khăn, không phải trong lúc hạnh phúc.",
        "id": "6d3f5d46d03745b5b6002aefdef7dc9b"
    },
    {
        "en": "A single rose can be my garden… a single friend, my world.",
        "vi": "Một bông hồng duy nhất có thể là cả khu vườn của tôi… một người bạn duy nhất có thể là cả thế giới đối với tôi.",
        "id": "0775037201ef422aa31eacf8b147efca"
    },
    {
        "en": "There is nothing on this earth more to be prized than true friendship.",
        "vi": "Không có gì trên trái đất này cao quý hơn tình bạn thực sự.",
        "id": "7645d67a2b9b4b05b243f571f348d30e"
    },
    {
        "en": "It is a good thing to be rich and a good thing to be strong but It is a better thing to be loved of many friends.",
        "vi": "Giàu có, khỏe mạnh là điều tốt nhưng điều tốt hơn là được bạn bè yêu thương.",
        "id": "9e640a060e0d456e9972003c7a17049a"
    },
    {
        "en": "Friends are like stars,they always seem to shine when the night is as its darkest.",
        "vi": "Tình bạn như những ngôi sao, chúng luôn luôn chiếu sáng vào những đêm tối nhất.",
        "id": "6dd74556b55541ec8a80fd3920f11397"
    },
    {
        "en": "No man is whole of himself, his friends are the rest of him.",
        "vi": "Không ai toàn diện được, bạn bè là phần mà ta còn thiếu.",
        "id": "e868667b5df04f18be36bc922cbbd18b"
    },
    {
        "en": "Best friends make the bad times good and the good times unforgettable.",
        "vi": "Bạn tốt sẽ biến những khoảnh khắc tồi tệ thành khoảnh khắc ý nghĩa và khiến những khoảnh khắc ý nghĩa trở nên khó quên.",
        "id": "05c90dd05b4f4973b3e3b6e5307c9f7e"
    },
    {
        "en": "Don’t walk in front of me, I may not follow. Don’t walk behind me, I may not lead. Just walk beside me and be my friend.",
        "vi": "Đừng đi phía trước tôi, tôi có thể không đi theo sau. Đừng đi phía sau tôi, tôi có thể không dẫn lối. Hãy đi bên cạnh tôi và trở thành bạn của tôi.",
        "id": "6fc46e0df32f46349e4d2e8abeb2c2b5"
    },
    {
        "en": "Good friends are hard to find, harder to leave, and impossible to forget.",
        "vi": "Những người bạn tốt thật khó để tìm thấy, càng khó để rời bỏ, và không thể quên lãng.",
        "id": "a54df2ba98ff4c47b639d39e93f817e7"
    },
    {
        "en": "Prosperity makes friends and adversity tries them.",
        "vi": "Sự giàu sang tạo nên bạn bè và sự khốn khó thử thách lòng họ.",
        "id": "d1ddf04bcdf44b4bb9b9f201aa9f6d12"
    },
    {
        "en": "To preserve a friend, three things are necessary: to honor him present, praise him absent, and assist him in his necessities.",
        "vi": "Để giữ gìn tình bạn, cần làm ba điều sau: Kính bạn khi bạn có mặt, khen bạn khi bạn vắng mặt, và giúp bạn khi bạn cần.",
        "id": "d0298491d2aa47889e27f7508f28a560"
    },
    {
        "en": "Sometimes I want to shout to the whole world how lucky I am to have you as my friend but sometimes I want to hush, afraid that somebody might take you away from me.",
        "vi": "Đôi khi tôi muốn hét to với cả thế giới rằng tôi mới may mắn làm sao khi tôi có bạn là bạn của tôi, nhưng đôi khi tôi muốn im lặng, sợ rằng ai đó sẽ cướp bạn đi mất.",
        "id": "caa742ffc2bc491f829c68f7f3415b16"
    },
    {
        "en": "A friend is one who believes in you when you have ceased to believe in yourself.",
        "vi": "Bạn là người tin vào ta khi ta đã hết tin vào bản thân mình.",
        "id": "008965e6ecf9471798540b21b509f28e"
    },
    {
        "en": "Love has no age, no limit; and no death.",
        "vi": "Tình yêu không có tuổi tác, không có giới hạn; và không bao giờ lụi tàn.",
        "id": "0067fc3b79de47b9aca80d09b1b5a4c4"
    },
    {
        "en": "Where there is love there is life.",
        "vi": "Nơi nào có tình yêu, nơi đó có sự sống.",
        "id": "7f19541e33d842b8b4dcd18c795c0ed6"
    },
    {
        "en": "Life without love is like a tree without blossoms or fruit.",
        "vi": "Cuộc sống mà thiếu tình yêu cũng giống như một cái cây không có hoa hay quả vậy. (Châm ngôn ngôn tình kaka)",
        "id": "a5d1644ce8b54fb290d264d3386dda5f"
    },
    {
        "en": "Keep love in your heart. A life without it is like a sunless garden when the flowers are dead.",
        "vi": "Hãy giữ tình yêu trong trái tim bạn. Cuộc sống nếu thiếu nó sẽ giống như một khu vườn không có ánh nắng mặt trời cùng những bông hoa đã tàn.",
        "id": "8349a131228b4623b8f1dea45cbad647"
    },
    {
        "en": "Try to be a rainbow in someone’s cloud.",
        "vi": "Hãy cố gắng để trở thành cầu vồng trong trời mây của ai đó.",
        "id": "507a5486d1f34886a1bcf46590c6ffee"
    },
    {
        "en": "Love is composed of a single soul inhabiting two bodies.",
        "vi": "Tình yêu là một linh hồn duy nhất cư ngụ trong hai cơ thể.",
        "id": "b39ae0de737f433d85d67f124434a6c9"
    },
    {
        "en": "Happiness resides not in possessions, and not in gold, happiness dwells in the soul.",
        "vi": "Hạnh phúc không ở trong tài sản, và cũng không phải trong vàng bạc, mà hạnh phúc ngự trị ở trong tâm hồn.",
        "id": "3b0b6710f2b3412aaf8dd641c8b67fd4"
    },
    {
        "en": "If you live to be a hundred, I want to live to be a hundred minus one day so I never have to live without you.",
        "vi": "Nếu bạn sống đến 100 tuổi, thì tôi sẽ muốn sống tới 100 tuổi trừ đi một ngày để tôi không bao giờ phải sống thiếu bạn.",
        "id": "5b14ae64034f48f493bfc0b0be519e5c"
    },
    {
        "en": "For it was not into my ear you whispered, but into my heart. It was not my lips you kissed, but my soul.",
        "vi": "Những điều bạn thì thầm không lọt vào tai, nhưng lọt vào trái tim tôi. Đó không phải là đôi môi tôi hôn bạn, mà là tâm hồn tôi.",
        "id": "d98a305047174520a56fe95f90a23920"
    },
    {
        "en": "A kiss is a lovely trick designed by nature to stop speech when words become superfluous.",
        "vi": "Một nụ hôn là một điều đáng yêu được thiết kế bởi tự nhiên để dừng câu chuyện khi ngôn từ trở nên thừa thãi.",
        "id": "270ecc2c0f0a4826b938a27f6663f56f"
    },
    {
        "en": "There is only one happiness in this life, to love and be loved.",
        "vi": "Chỉ có một niềm hạnh phúc trong cuộc đời này, đó là yêu và được yêu.",
        "id": "5184c54a0cf341b4a0ef273b7f42ceb1"
    },
    {
        "en": "No man or woman is worth your tears, and the one who is, won’t make you cry.",
        "vi": "Không có ai xứng đáng với những giọt nước mắt của bạn, người xứng đáng với chúng thì chắc chắn không để bạn phải khóc.",
        "id": "086564cfb3b843578aed9f138d253ba0"
    },
    {
        "en": "How can you love another if you don’t love yourself?",
        "vi": "Làm sao có thể yêu người khác. Nếu bạn không yêu chính mình.",
        "id": "e4a3d28848124993b8002997008a7ff3"
    },
    {
        "en": "The world is full of abundance and opportunity, but far too many people come to the fountain of like with a sieve instead of a tank car… a teaspoon instead of a steam shovel. They expect little and as a result they get little.",
        "vi": "Thế giới đầy rẫy sự dư dả và cơ hội, nhưng có quá nhiều người đến với suối nguồn của cuộc sống mà chỉ mang theo một chiếc rây thay vì một chiếc xe bồn… một thìa uống trà thay vì một chiếc máy xúc. Họ mong đợi ít và kết quả là họ nhận được ít.",
        "id": "a61df811492c4d309dc873a0db2984e2"
    },
    {
        "en": "What you get by achieving your goals, is not as important as, what you become by achieving your goals.",
        "vi": "Điều bạn gặt hái được bằng việc đạt được mục tiêu không quan trọng bằng con người bạn trở thành khi đạt được mục tiêu.",
        "id": "b8e9a58305674324a6f791f58ffbdbe9"
    },
    {
        "en": "I have learned more from my failures than from my success.",
        "vi": "Tôi đã học được nhiều điều từ thất bại của tôi hơn là từ thành công của tôi.",
        "id": "b694f22a47424053b566247b8b168dec"
    },
    {
        "en": "If you live to be a hundred, I want to live to be a hundred minus one day. So that I’ll never have to live without you.",
        "vi": "Nếu bạn sống đến một trăm tuổi, tôi muốn sống đến một trăm tuổi từ đi một ngày để tôi sẽ không bao giờ phải sống thiếu vắng bạn.",
        "id": "27f7c277c5484e3ab68b6775d89f4708"
    },
    {
        "en": "We are all travelers in the wilderness of the world, and the best we can find in our travels is an honest friend.",
        "vi": "Chúng ta đều là những kẻ lữ hành trong thế giới hoang vu, và điều tốt đẹp nhất mà chúng ta có thể tìm được trong hành trình của mình là một người bạn chân chính.",
        "id": "352821d6b1114e859c527ffe7cbcc0e8"
    },
    {
        "en": "Learn to be happy with what you have while you pursue all that you dream.",
        "vi": "Hãy học cách hạnh phúc với những gì bạn có trong khi bạn đang theo đuổi tất cả những gì mình mơ ước.",
        "id": "c125a4cac2a142f09de6c856c67c4f9d"
    },
    {
        "en": "It is a good thing to be rich, and a good thing to be strong; but it is a better thing to be loved of many friends.",
        "vi": "Giàu có là một điều tốt, khỏe mạnh cũng là một điều tốt; nhưng điều tốt hơn nữa là được bạn bè yêu thương.",
        "id": "53eda6f6fd3a41ec970bf9010339f9b2"
    },
    {
        "en": "Many people dream of success. Success can only be achieved through repeated failure and introspection. In fact, success represents the 1% of your work that results from 99% that is called failure.",
        "vi": "Nhiều người ước mơ được thành công. Thành công chỉ có thể đạt được qua thất bại và sự nội quan liên tục. Thật ra, thành công thể hiện 1% công việc ta làm kết quả có được từ 99% cái gọi là thất bại.",
        "id": "a3ebdd76ef6c4337a986628cb91b4629"
    },
    {
        "en": "I may not be there yet, but I’m closer than I was yesterday.",
        "vi": "- Tôi có thể chưa đến được nơi đó, nhưng tôi đã đến gần hơn so với vị trí của tôi ngày hôm qua.",
        "id": "c08df44441ec4afcb2dd4b20ac697ab5"
    },
    {
        "en": "Friends are like stars, they always seem to shine when the night is at its darkest.",
        "vi": "Bạn hữu giống như những vì sao, luôn luôn chiếu sáng vào những đêm tối trời nhất.",
        "id": "c7e22034835c4b28a267a6e3de248545"
    },
    {
        "en": "When a winner makes a mistake, he says, “I was wrong”. When a loser makes a mistake, he say, “It wasn’t my fault”.",
        "vi": "Một người thắng cuộc khi phạm lỗi nói: “Tôi đã sai”. Còn một người thua cuộc khi phạm sai lầm nói: “Đó không phải là lỗi của tôi”",
        "id": "77baec898fc544d09de680b1e9f78d03"
    },
    {
        "en": "In the confrontation between the stream and the rock, the stream always wins, not through strength but by perseverance.",
        "vi": "Trong sự đương đầu giữa dòng suối và hòn đá, dòng suối luôn luôn thắng, không phải qua sức mạnh mà bằng sự bền bỉ.",
        "id": "de8a4353e3404619a80e03d5592dedc0"
    },
    {
        "en": "My father always used to say that when you die, if you’ve got five real friends, you’ve had a great life.",
        "vi": "Cha tôi thường bảo rằng nếu khi con qua đời, con có được năm người bạn thật sự thì con đã có một cuộc đời tuyệt vời.",
        "id": "fd99afc2c4b64f7795a17e9dd27f2427"
    },
    {
        "en": "It’s how you deal with failure that determines how you achieve success.",
        "vi": "Chính cách bạn xử trí thất bại quyết định cách bạn đạt được thành công.",
        "id": "5ce5b066cf0f46f99c5143f97dd48308"
    },
    {
        "en": "There are no real successes without rejection. The more rejection you get, the better you are, the more you learned, the closer you are to your outcome.",
        "vi": "Không có thành công thực sự nào mà không bị phản đối, bạn càng tiến bộ hơn, học hỏi được nhiều hơn, và càng tiến gần hơn đến thành quả của mình.",
        "id": "f37c26006ff041b59fd759b7063b4d48"
    },
    {
        "en": "Success is the ability to go from one failure to another with no loss of enthusiasm.",
        "vi": "Thành công là khả năng đi từ thất bại này đến thất bại khác mà không mất đi nhiệt huyết",
        "id": "82c0fb6cd61a4442a4bd83ef96f624c2"
    },
    {
        "en": "Each friend represents a world in us, a world possibly not born until they arrive, and it is only by this meeting that a new world is born.",
        "vi": "Mỗi người bạn thể hiện một thế giới trong chúng ta, một thế giới chưa thể được sinh ra cho đến khi họ tới, và chỉ bằng những cuộc gặp gỡ này mà một thế giới mới đã được sinh ra.",
        "id": "6459a1c2fb784b69b66e563299126aa3"
    },
    {
        "en": "The greatest danger for most of us is not that our aim is too high and we miss it, but that it is too low and we reach it.",
        "vi": "Mối nguy lớn nhất đối với hầu hết chúng ta không phải là cái đích chúng ta nhắm tới quá cao và chúng ta không đạt tới, mà là cái đích chúng ta nhắm tới quá thấp và chúng ta đạt được nó.",
        "id": "bcc849762a1147d2aa9983c9565860ff"
    },
    {
        "en": "Believe in the sprit of love… it can heal all things.",
        "vi": "Tìn vào sự bất tử của tình yêu điều đó có thể hàn gắn mọi thứ.",
        "id": "c39c8b442e1f4e2c8c69521de070c425"
    },
    {
        "en": "Don’t stop giving love even if you don’t receive it. Smile and have patience.",
        "vi": "Đừng từ bỏ tình yêu cho dù bạn không nhận được nó. Hãy mỉm cười và kiên nhẫn.",
        "id": "84ece46193d643758fdd52b5dcc3ee28"
    },
    {
        "en": "You know when you love someone when you want them to be happy event if their happiness means that you’re not part of it.",
        "vi": "Yêu là tìm hạnh phúc của mình trong hạnh phúc của người mình yêu.",
        "id": "e7ebd535aae848dca14f57ecd350a0dd"
    },
    {
        "en": "Friendship often ends in love, but love in friendship-never",
        "vi": "Tình bạn có thể đi đến tình yêu, và không có điều ngược lại.",
        "id": "62ae62f90235463f8dea86724b904edf"
    },
    {
        "en": "Hate has a reason for everything bot love is unreasonable.",
        "vi": "Ghét ai có thể nêu được lý do, nhưng yêu ai thì không thể.",
        "id": "eaad8c594d1a4d3d8fdba7bb43389771"
    },
    {
        "en": "I’d give up my life if I could command one smile of your eyes, one touch of your hand.",
        "vi": "Anh sẽ cho em tất cả cuộc đời này để đổi lại được nhìn em cười, được nắm tay em.",
        "id": "f2ee40e9d1474eea9c979a39facbd261"
    },
    {
        "en": "I looked at your face… my heart jumped all over the place.",
        "vi": "Khi nhìn em, anh cảm giác tim anh như loạn nhịp.",
        "id": "723a2c18c0894865b6ae256bfec0209b"
    },
    {
        "en": "In lover’s sky, all stars are eclipsed by the eyes of the one you love.",
        "vi": "Dưới bầu trời tình yêu, tất cả những ngôi sao đều bị che khuất bởi con mắt của người bạn yêu.",
        "id": "549615c0cd294d74a8daccbb55568866"
    },
    {
        "en": "I love you with know how, why ,or even from where...",
        "vi": "anh yêu em mà không biết tại sao, bằng cách nào và thậm chí từ đâu.",
        "id": "a1f7fe6d5c504474b80b89881ea14b1e"
    },
    {
        "en": "How come we don't always know when love begins, but we always know when it ends ?",
        "vi": "Tại sao chúng ta không bao giờ nhận được tình yêu bắt đầu từ khi nào nhưng chúng ta luôn nhận ra khi tình yêu kết thúc?",
        "id": "eae2f66e822e43e7b57eb727c90bc4fc"
    },
    {
        "en": "The only feeling of read loss is when you love someone more than you love yourself",
        "vi": "Cảm giác mất mát duy nhất mà bạn thật sự cảm nhận được là khi bạn yêu một ai đó hơn cả chính bản thân mình.",
        "id": "ad92cb5412684fd2a943a4e5ea17bf93"
    },
    {
        "en": "When you love someone and you love them with your heart, it never disappears when you're apart.and when you love someone more and you've done all you can do, you set them free. and is that love was true, when you love someone, it will all come back to you.",
        "vi": "Khi bạn yêu một ai đó với tất cả trái tim mình, tình yêu đó sẽ không bao giờ mất đi ngay cả khi bạn phải chia xa.Khi bạn yêu một ai đó và dù bạn đã làm cho tất cả mà vẫn không được đáp lại thì hãy để họ ra đi.vì nếu tình yêu đó là chân thật thì chắc chắn rằng nó sẽ trở về với bạn.",
        "id": "52d624f3da8b487ea043cd7417fb7b12"
    },
    {
        "en": "If I die or go somewhere far, I’ll write your name on every star so people looking up can see just how much u mean to me.",
        "vi": "Một ngày nào đó khi anh chết đi hoặc đi đâu đó thật xa. Anh sẽ viết tên em lên tất cả những vì sao, để người người có thể ngước lên và hiểu rằng em có nghĩa với anh nhường nào",
        "id": "573b9ea9f7154edaba58f9bef61e3ba1"
    },
    {
        "en": "Everyday, when God Opens the door of Heaven, he saw me and asked: “What is your wish for today?!” I said: Lord Please take care of the one reading this message!",
        "vi": "Mỗi ngày, khi Chúa mở cánh cửa thiên đàng, ngài nhìn anh và hỏi: “Đìêu ước hôm nay của con là gì ?” anh trả lời: “Xin người hãy bảo vệ cho người đang đọc tin nhắn này!",
        "id": "fb094bf66f1a4e98b99350c6a99e38d7"
    },
    {
        "en": "I love you like my life,do you know why? because you are my life. . .",
        "vi": "Anh yêu em như yêu cuộc sống của chính mình, em biết tại sao ko? Vì em chính là cuộc sống của anh.",
        "id": "48a85d635eba427e94cd35691d27f55a"
    },
    {
        "en": "Trust in God but lock your car",
        "vi": "hãy tin vào chúa nhưng hãy khóa cái ôtô của bạn lại",
        "id": "b2e2817ea1e1499197ed00466733f766"
    },
    {
        "en": "Never laugh at anyone ‘s dream",
        "vi": "Đừng bao giờ cười nhạo giấc mơ của bất cứ ai.",
        "id": "b1fd29960074466fa4508bc7fa5832d6"
    },
    {
        "en": "Talk slowly but think quickly",
        "vi": "có thể nói chậm nhưng hãy suy nghĩ thật nhanh.",
        "id": "5b642c2d715848b09ab845eca516d8e4"
    },
    {
        "en": "When someone asks you a question that you don’t want to answer, smile and ask :” why do you want to know that”",
        "vi": "Khi ai đó hỏi bạn một câu hỏi mà bạn không muốn trả lời thì hãy cười và nói:\" tại sao bạn lại muốn biết điều đó\".",
        "id": "cab8ee8c497f44a58e1327332a68ab28"
    },
    {
        "en": "Remember that great love and great achievements involve great risk.",
        "vi": "Một tình yêu tuyệt vời và một thành tựu vĩ đại luôn bao gồm cả sự mạo hiểm.",
        "id": "e2175233092b417b8bcd932c6688325f"
    },
    {
        "en": "Remember the 3 re’s : respect for self , respect for others and responsibility for your actions",
        "vi": "Hãy nhớ 3 điều: kính trọng chính mình, kính trọng những người khác và hãy có trách nhiệm với những việc làm của mình.",
        "id": "e056cdf8e460414d96a468ced0500bfd"
    },
    {
        "en": "No anything older than succeeds of yesterday",
        "vi": "Không có gì có thể làm mờ đi những thành công của ngày hôm qua.",
        "id": "cf74396525ca400782ababe9a71822c1"
    },
    {
        "en": "Hope the best thing but prepare it wait any worst thing",
        "vi": "Hy vọng về những điều tốt đẹp nhưng đáp lại sự chờ đợi đó là điều thật tồi tệ",
        "id": "2f86a1e8a3f547d89973cdcd9499e303"
    },
    {
        "en": "Dream is happy , wait is life",
        "vi": "Giấc mơ về một hạnh phúc đón chờ một tương lai.",
        "id": "fbf76a2e81264dbf94cdfd97b7af469a"
    },
    {
        "en": "Give somebody more than they hope and do it cheerfully",
        "vi": "cho họ nhiều hơn những gì họ hy vọng, đó là niềm vui",
        "id": "c50f71b5eab04387b58c9b080e342c9c"
    },
    {
        "en": "Don't believe all you hear, spend all you have or sleep all you want.",
        "vi": "Đừng nên tin tất cả những gì bạn nghe đc, sử dụng những gì bạn có hoặc rũ bỏ tất cả nếu bạn muốn.",
        "id": "298dc0882d1a4a4298f069363d3dde6e"
    },
    {
        "en": "When you say \"I'm sorry\" look at person in the eye.",
        "vi": "Khi bạn nói lời xin lỗi với ai thì hãy nhìn vào mắt họ.",
        "id": "16d3fee733654bb78e8142eb052a127b"
    },
    {
        "en": "The sweetest joy and the wildest we is the love.",
        "vi": "Vui sướng ngọt ngào xen lẫn sự lo âu đau khổ đó là tình yêu.",
        "id": "2c52c58c7f2e4bffbeeb0fc93bb9a573"
    },
    {
        "en": "There's only one kind of love but there are thousand imitations.",
        "vi": "Duy nhất chỉ là tình yêu nhưng có hàng ngàn sự mô phỏng.",
        "id": "87a1d6422d574c32b96630e1b82cd3c2"
    },
    {
        "en": "Life is a story, make yours the best seller.",
        "vi": "Cuộc sống là một cuốn truyện, hãy làm sao cho cuốn của bạn bán chạy nhất.",
        "id": "5084e492544c498b8b84209db5a1c971"
    },
    {
        "en": "When life changes to be harder, change yourself to be stronger.",
        "vi": "Khi cuộc sống trở nên khó khăn hơn, hãy thay đổi bản thân để trở nên mạnh mẽ hơn.",
        "id": "a9e3e005ccbd425aa061c27e248b604b"
    },
    {
        "en": "One of the simplest way to stay happy is to let go all of the things that make you sad.",
        "vi": "Cách đơn giản nhất để luôn hạnh phúc là bỏ qua tất cả những thứ làm bạn buồn.",
        "id": "0beb362919024073bfd18d70e74fb860"
    },
    {
        "en": "When life gives you a hundred reasons to cry, show life that you have a thousand reasons to smile",
        "vi": "Khi cuộc đời cho bạn trăm lý do để khóc, hãy chỉ cho cuộc đời thấy bạn có ngàn lý do để cười",
        "id": "86e9827077fc471193d4ced1841ec071"
    },
    {
        "en": "Don’t let schooling interfere with your education.",
        "vi": "Đừng để trường lớp cản con đường giáo dục của bạn.",
        "id": "2034bf0d73294647a78517606d1a9039"
    },
    {
        "en": "Life is not fair, get used to it.",
        "vi": "Cuộc sống không công bằng, hãy làm quen với nó",
        "id": "578e4ca47c13459296b13b5d4e85b837"
    },
    {
        "en": "The value of life is not its duration, but it’s donation.",
        "vi": "Thước đo của cuộc đời không phải thời gian, mà là cống hiến.",
        "id": "f6ff174aa3d8491bb5b51d889a49c1d3"
    },
    {
        "en": "Life becomes harder for us when we live for others, but it also becomes richer and happier.",
        "vi": "Cuộc sống trở nên khó khăn hơn khi chúng ta sống vì người khác, nhưng nếu ta sống vì người khác, cuộc đời cũng đẹp đẽ và hạnh phúc hơn.",
        "id": "53219c5462934ec982e4850eaa5280d3"
    },
    {
        "en": "You’ll never be brave if you don’t get hurt. You’ll never learn if you don’t make mistakes. You’ll never be successful if you don’t encounter failure.",
        "vi": "Bạn sẽ không bao giờ mạnh mẽ nếu bạn không bị gục ngã. Bạn sẽ không bao giờ học hỏi được gì nếu như không mắc lỗi. Bạn sẽ không bao giờ thành công nếu bạn không đối mặt với thất bại.",
        "id": "eae099c3be61465489e12534ac67c3b7"
    },
    {
        "en": "Life is a dream for the wise, a game for the fool, a comedy for the rich, a strategy for the poor.",
        "vi": "Cuộc sống như một giấc mơ của những người khôn, một trò chơi của những gã ngốc, một câu chuyện hài của những người giàu, một chiến lược của những người nghèo.",
        "id": "13ee544cf3bf448ca1c75e57ab7603a9"
    },
    {
        "en": "Do not pray for an easy life, pray for the strength to endure a difficult one .",
        "vi": "Đừng cầu mong một cuộc sống dễ dàng, hãy cầu mong sức mạnh để tồn tại được qua những khó khăn (Quote by Bruce Lee).",
        "id": "abbfc4af2bc34bf588b3cbac86539c85"
    },
    {
        "en": "Life is the greatest journey you will ever be on.",
        "vi": "Cuộc sống là chuyến hành trình tuyệt vời nhất mà bạn từng trải qua.",
        "id": "d0ac6b31fd3f4db8834e7ccedb0440f4"
    },
    {
        "en": "Enjoy the little things in life for one day, you’ll look back and realize they were the big things.",
        "vi": "Hãy tận hưởng những điều nhỏ nhất của cuộc sống trong một ngày, để rồi khi ngẫm lại, bạn sẽ nhận ra đó lại là những điều lớn lao.",
        "id": "92642b0067c34a589579b1cf18605131"
    },
    {
        "en": "Trying and Doing are two different things. When you try, you hope. When you do, you succeed.",
        "vi": "Cố gắng và hành động là hai chuyện khác nhau. Nếu bạn cố gắng, bạn có hy vọng. Nếu bạn hành động, bạn sẽ gặt hái được thành công.",
        "id": "c4c2441f562b46cfa2c925dac3fe7e4c"
    },
    {
        "en": "Love your parents. We are so busy growing up, we often forget they are also growing old",
        "vi": "Hãy yêu thương cha mẹ của mình, bởi khi chúng ta bận rộn lớn lên thì thường hay quên mất rằng họ cũng đang già đi từng ngày.",
        "id": "3b700b9f2a824e3d9d2d0606526fc7c7"
    },
    {
        "en": "Life’s under no obligation to give us what we expect.",
        "vi": "Cuộc sống không có nghĩa vụ trao cho chúng ta những điều mà chúng ta mong đợi.",
        "id": "4eceb5f6296649f4a82ed124f9e3323b"
    },
    {
        "en": "Every man has his secret sorrows which the world knows not; and often times we call a man cold when he is only sad.",
        "vi": "Mọi người đều có những nỗi buồn bí mật mà thế giới chẳng hay biết; và thường người ta nói người đàn ông lạnh lùng khi anh ta chỉ đơn giản là đang buồn.",
        "id": "b233bb167c974befb497729507c5735d"
    },
    {
        "en": "Don’t cry because it’s over, smile because it happened. ― Dr. Seuss",
        "vi": "Đừng khóc vì nó kết thúc, hãy cười vì nó đã xảy ra.",
        "id": "74049ee7435d4d8abf95c0b21153e6af"
    },
    {
        "en": "You’ve gotta dance like there’s nobody watching.",
        "vi": "Love like you’ll never be hurt,",
        "id": "38a8c5cc210149cd9f8459083204d4eb"
    },
    {
        "en": "Sing like there’s nobody listening,",
        "vi": "And live like it’s heaven on earth. ― William W. Purkey",
        "id": "baed71dfb7374b9487cc12d95444fde0"
    },
    {
        "en": "Bạn hãy nhảy như không ai nhìn thấy bạn,",
        "vi": "Hãy yêu như bạn không bao giờ bị tổn thương,",
        "id": "cddf4e65224a4e81b84957ac89909319"
    },
    {
        "en": "Hát như không ai nghe thấy,",
        "vi": "Và sống như thể thiên đường ở trên trái đất.",
        "id": "d3fa59c6389d4a948aada5e333509ff5"
    },
    {
        "en": "If you were born into poverty, it is not your fault\nBut if you die in poverty, it is your fault - Bill Gates",
        "vi": "Nếu bạn sinh ra trong nghèo khó, đó không phải là lỗi của bạn.\nNhưng nếu bạn chết trong nghèo khó, thì đó là lỗi của bạn.",
        "id": "900d70e959294bed8faced953c7227a7"
    },
    {
        "en": "There are only two ways to live your life. One is as though nothing is a miracle. The other is as though everything is a miracle. ― Albert Einstein",
        "vi": "Chỉ có duy nhất 2 cách để bạn sống cuộc đời của mình. Một là sống như thể không gì là phép màu cả. Điều còn lại là sống như thể phép màu là tất cả mọi thứ.",
        "id": "bb8c77f9e98b4aa7b9435297f9f5f83e"
    },
    {
        "en": "It does not do to dwell on dreams and forget to live. ― J.K. Rowling, Harry Potter and the Sorcerer’s Stone",
        "vi": "Đừng bám lấy những giấc mơ mà quên mất cuộc sống hiện tại.",
        "id": "f32a5fdfb06547c7ad34b0634c814f41"
    },
    {
        "en": "Good friends, good books, and a sleepy conscience: this is the ideal life. ― Mark Twain",
        "vi": "Bạn tốt, sách hay và một lương tâm thanh thản: đó chính là cuộc đời lý tưởng.",
        "id": "1ca3db7c4f234c589fa6248bfe19e2fa"
    },
    {
        "en": "Sometimes the questions are complicated and the answers are simple. ― Dr. Seuss",
        "vi": "Đôi khi câu hỏi thường phức tạp thì câu trả lời sẽ rất đơn giản.",
        "id": "ab68cc640c734a78a5f73d48fc3219e4"
    },
    {
        "en": "Today you are You, that is truer than true. There is no one alive who is Youer than You. ― Dr. Seuss",
        "vi": "Hôm nay bạn là chính mình, đó là một điều không ai có thể chối cãi. Chẳng ai có khả năng biến thành bạn giỏi hơn bản thân bạn đâu.",
        "id": "4da05a0375094c198e0092cc11cde894"
    },
    {
        "en": "Life isn’t about finding yourself. Life is about creating yourself. ― George Bernard Shaw",
        "vi": "Cuộc sống không phải là đi tìm chính bạn mà cuộc sống là tạo ra con người bạn.",
        "id": "6e3b78420bc54fefabbe1b1354bdb8e6"
    },
    {
        "en": "Life is like riding a bicycle. To keep your balance, you must keep moving. ― Albert Einstein",
        "vi": "Cuộc sống như thể việc đạp một chiếc xe. Để giữ thăng bằng, bạn phải đi tiếp.",
        "id": "1e145b2225da42cb9d95b556bb80c16e"
    },
    {
        "en": "You should learn from your competitor, but never copy. Copy and you die. – Jack Ma",
        "vi": "Bạn nên học từ đối thủ, nhưng đừng bao giờ sao chép. Sao chép và bạn sẽ chết.",
        "id": "22d8de694cbf44ab930a42505799c0fa"
    },
    {
        "en": "When someone loves you, the way they talk about you is different. You feel safe and comfortable. ― Jess C. Scott, The Intern",
        "vi": "Khi ai đó yêu bạn thì cái cách họ nói về bạn rất khác biệt. Bạn sẽ cảm thấy an toàn và thoải mái.",
        "id": "4e5b5d73c0f14cad84290ae1d6ec36f5"
    },
    {
        "en": "We are all in the gutter, but some of us are looking at the stars. ― Oscar Wilde",
        "vi": "Tất cả chúng ta đều bước đi trên cống rãnh, nhưng chỉ một số người vẫn ngắm các vì sao.",
        "id": "280520c280ab43dea1add70da0f9099f"
    },
    {
        "en": "Be who you are and say what you mean, because those who mind don’t matter and those who matter don’t mind. ― Dr. Seuss",
        "vi": "Hãy là chính mình và nói điều bạn muốn nói. Bởi những người thấy phiền vì hành động của bạn sẽ chẳng có nghĩa lý gì, còn những người có ý nghĩa với bạn thì sẽ chẳng bao giờ thấy phiền lòng.",
        "id": "5b0fc21d615d42d193eba2fab6de82a5"
    },
    {
        "en": "Keep your eyes on the stars and your feet on the ground. —Theodore Roosevelt",
        "vi": "Hướng đôi mắt về phía những vì sao, và chạm đôi chân trên mặt đất.",
        "id": "39655ae78d9445e48393bac1fb94d5a8"
    },
    {
        "en": "Never be bullied into silence. Never allow yourself to be made a victim. Accept no one’s definition of your life; define yourself. —Harvey Fierstein",
        "vi": "Đừng bao giờ để bị ngược đãi bởi sự im lặng. Đừng bao giờ cho phép bản thân trở thành nạn nhân. Đừng để ai định nghĩa cuộc sống của bạn; hãy tự định nghĩa bản thân mình.",
        "id": "14c6f618e6784defb594c1ac936d04bd"
    },
    {
        "en": "Faith is the art of holding on to things your reason has once accepted, in spite of your changing moods. —C.S. Lewis",
        "vi": "Niềm tin là nghệ thuật níu giữ những điều mà bạn có lý do chấp nhận nó, dù cho bạn có thay đổi tâm trạng như thế nào.",
        "id": "032a54047d194960b3fa354621f88d8c"
    },
    {
        "en": "A man who flies from his fear may find that he has only taken a shortcut to meet it. —Sador, Children of Húrin",
        "vi": "Người mà thoát được ra khỏi nỗi sợ của họ sẽ hiểu rằng họ chỉ đi 1 đoạn đường tắt đến gặp nó mà thôi.",
        "id": "0525ebbc8e1b421593de8b1b7c486c65"
    },
    {
        "en": "The woman who follows the crowd will usually go no further than the crowd. The woman who walks alone is likely to find herself in places no one has been before. —Albert Einstein",
        "vi": "Người phụ nữ mà đi theo đám đông sẽ luôn không thể đi xa hơn đám đông, người phụ nữ mà đi một mình thì thường tìm thấy cô ấy ở những nơi mà chưa ai từng đến trước đó.",
        "id": "2a2609b1cf864bfc9c570079be767ae9"
    },
    {
        "en": "It’s not about how hard you can hit; it’s about how hard you can get hit and keep moving forward. —Rocky Balboa, Rocky",
        "vi": "Bạn đấm mạnh thế nào không thành vấn đề bằng việc bạn bị đánh mạnh thế nào và vẫn tiếp tục tiến về phía trước.",
        "id": "bb7f3be31cc549b0af1a9b0034d37d25"
    },
    {
        "en": "If you want to go fast, go alone. If you want to go far, go together. —African proverb",
        "vi": "Nếu bạn muốn đi nhanh, hãy đi một mình. Nếu bạn muốn đi xa, hãy đi cùng đồng đội.",
        "id": "c4a6a6bded8c4b40a49da7eb750f80db"
    },
    {
        "en": "I can be changed by what happens to me but I refuse to be reduced by it. —Maya Angelou",
        "vi": "Tôi có thể bị thay đổi bởi những điều xảy ra với mình nhưng tôi từ chối loại bỏ chúng.",
        "id": "0d1d193467be4bc88e45ab382f2a10ef"
    },
    {
        "en": "Nothing in life is to be feared; it is only to be understood. Now is the time to understand more so that we may fear less. —Marie Curie",
        "vi": "Không có gì trên cuộc đời này là đáng sợ, chỉ cần nó được thấu hiểu. Đây chính là thời điểm để hiểu nhiều hơn vì thế mà chúng ta có thể lo sợ ít hơn.",
        "id": "8f35633a79e345b3ab2fe79390d5c0be"
    },
    {
        "en": "There is no elevator to success — you have to take the stairs. —Anonymous",
        "vi": "Không có chiếc thang máy nào đưa bạn đến thành công, bạn phải leo thang thôi.",
        "id": "12d3b77651fa4bd2b928ea627e2205fa"
    },
    {
        "en": "There is nothing permanent except change",
        "vi": "Không có gì là vĩnh viễn ngoại trừ sự thay đổi.",
        "id": "33e7f651126f4fb393d1acb77296d1f0"
    },
    {
        "en": "It does not do to dwell on dreams and forget to live",
        "vi": "Đừng bám lấy những giấc mơ mà quên mất cuộc sống hiện tại.",
        "id": "74ae1ee519924638a1350c5fd8f8388d"
    },
    {
        "en": "Education is the most powerful weapon which you can use to change the world",
        "vi": "Giáo dục là thứ vũ khí mạnh nhất mà bạn có thể sử dụng để thay đổi thế giới.",
        "id": "661b8f1fe9724510a5349f2ab0cde3b3"
    },
    {
        "en": "An intelligent person is like a river, the deeper the less noise",
        "vi": "Một người thông minh sẽ như một dòng sông, càng sâu càng ít ồn ào.",
        "id": "8b637bb782c044a5bdbc21bea3400463"
    },
    {
        "en": "Believe you can and you’re halfway there",
        "vi": "Hãy tin rằng bạn có thể và bạn đã đang ở nửa chặng đường rồi.",
        "id": "247af3110e2e4391adb8324463355790"
    },
    {
        "en": "An unclearly relationship just like an empty petrol vehicle. You can sit on it as long as you like, but it will not take you anywhere",
        "vi": "Một mối quan hệ không rõ ràng cũng giống như một chiếc xe cạn xăng. Bạn có thể ngồi trên đó bao lâu bạn thích, nhưng nó sẽ không đưa bạn đi đến đâu cả.",
        "id": "bf6549148af54562b7cd499a62c1a61c"
    },
    {
        "en": "Life is not fair – get used to it",
        "vi": "Cuộc sống vốn không công bằng, hãy học cách thích nghi với chúng.",
        "id": "0e21da1bdf3d4199aa0baa7ea4559e11"
    },
    {
        "en": "Light travels faster than sound. This is why some people appear bright until you hear them speak",
        "vi": "Ánh sáng có tốc độ nhanh hơn âm thanh. Vì thế mà một vài người sẽ xuất hiện sáng bừng cho tới khi bạn nghe được giọng của họ.",
        "id": "a882a3fcee7243f0bc50110cb7861df4"
    },
    {
        "en": "Do all things with love",
        "vi": "Hãy làm tất cả mọi thứ bằng tình yêu.",
        "id": "b77d0b03951c4d31b08eb043edd33d89"
    },
    {
        "en": "If you want to go fast, go alone. If you want to go far, go together",
        "vi": "Nếu bạn muốn đi nhanh, hãy đi một mình. Nếu bạn muốn đi xa, hãy đi cùng nhau.",
        "id": "5e5d7bebddb5415fa0f94db63fe5cfe7"
    },
    {
        "en": "One of the most beautiful qualities of true friendship is to understand and to be understood",
        "vi": "Một trong những nét đẹp nhất của tình bạn chân chính đó là hiểu và được hiểu.",
        "id": "51d8f981df454ea782de3a7bc078ab9c"
    },
    {
        "en": "I never make the same mistake twice. I make it like five or six times, you know, just to be sure",
        "vi": "Tôi không bao giờ sai lầm đến lần hai. Tôi thường sai lầm lần thứ năm hoặc sáu để thấy chắc chắn.",
        "id": "c39f3ad5c0a8406482d1402c81c8178a"
    },
    {
        "en": "It’s better to know and be disappointed, than to never know and always wonder",
        "vi": "Thà biết rồi thất vọng còn hơn không bao giờ biết và luôn băn khoăn.",
        "id": "ebedcd93e29542018365b8275a70bcde"
    },
    {
        "en": "Life is like riding a bicycle. To keep your balance you must keep moving",
        "vi": "Cuộc sống giống như việc lái một chiếc xe đạp. Để giữ được thăng bằng, bạn phải tiếp tục di chuyển.",
        "id": "292db6be39994f2284a8341dfdd28f95"
    },
    {
        "en": "Change your thoughts and you change your world",
        "vi": "Thay đổi suy nghĩ của bạn và bạn sẽ thay đổi thế giới. (Hãy nghĩ khác đi, biết đâu mọi vấn đề sẽ được giải quyết)",
        "id": "a3fe09b208584b56826f7c0321a3e31e"
    },
    {
        "en": "Everything has beauty, but not everyone sees it",
        "vi": "Mọi thứ đều có vẻ đẹp nhưng không phải ai cũng nhìn thấy điều đó.",
        "id": "7e5f203a4c374a92953225b0a8fc37e1"
    },
    {
        "en": "The best preparation for tomorrow is doing your best today",
        "vi": "Sự chuẩn bị tốt nhất cho ngày mai là hãy làm tốt nhất trong ngày hôm nay.",
        "id": "710a4f4f9ba54317946110cf3dd70261"
    },
    {
        "en": "If you cannot do great things, do small things in a great way",
        "vi": "Nếu bạn không thể làm những điều vĩ đại, hãy làm những việc nhỏ theo cách vĩ đại.",
        "id": "87ac4ec4e15941d38022d2dda63f534c"
    },
    {
        "en": "Always remember that you are absolutely unique. Just like everyone else",
        "vi": "Luôn luôn nhớ rằng bạn hoàn toàn là duy nhất. Cũng giống như mọi người khác.",
        "id": "a014cabc200c4bb285740846e7e6a706"
    },
    {
        "en": "Life is a story. Make yours the best seller",
        "vi": "Cuộc đời là một câu chuyện. Hãy biến câu chuyện cuộc đời của bạn thành tác phẩm bán chạy nhất.",
        "id": "a2ccbee557bb4003bbce312af50f520f"
    },
    {
        "en": "I am thankful to all who said no to me. It is because of them that I’m doing it myself",
        "vi": "Tôi rất biết ơn những người đã nói không với tôi. Chính nhờ họ mà tôi đang làm việc bằng chính sức mình.",
        "id": "260aa27b2b7f4a3d85b2f71383246151"
    },
    {
        "en": "There are days like that, quietly, not sad, not happy, slowly drift … the end of a day",
        "vi": "Có những ngày như thế, lặng lẽ, không buồn, không vui, chầm chậm trôi ….. Qua hết một ngày.",
        "id": "9d01f2165f0b492b8d4cf318cad1dfdc"
    },
    {
        "en": "The woman who follows the crowd will usually go no further than the crowd. The woman who walks alone is likely to find herself in places no one has been before",
        "vi": "Người phụ nữ mà đi theo đám đông sẽ luôn không thể đi xa hơn đám đông, người phụ nữ mà đi một mình thì thường tìm thấy cô ấy ở những nơi mà chưa ai từng đến trước đó.",
        "id": "20f54abac1f34726bcffc4137c5a19fc"
    },
    {
        "en": "Friends show their love in times of trouble, not in happiness",
        "vi": "Bạn bè thể hiện tình cảm của họ trong những lúc khó khăn, không phải trong lúc hạnh phúc.",
        "id": "4fb143464b134456bb6d3a67b85cad89"
    },
    {
        "en": "Honesty is the first chapter in the book of wisdom",
        "vi": "Trung thực là chương đầu tiên trong cuốn sách khôn ngoan. (Câu này khá tương đồng với câu “khôn ngoan là ở thái độ”)",
        "id": "84c80ebec013480e9a27cdf931da6545"
    },
    {
        "en": "The best and most beautiful things in the world cannot be seen or even touched – they must be felt with the heart",
        "vi": "Những điều tuyệt vời nhất trên thế giới không thể nhìn được thấy hay thậm chí chạm vào – chúng phải được cảm nhận bằng trái tim.",
        "id": "f04ef1d62c134c8ab24e0c67cd1c8634"
    },
    {
        "en": "If happiness could be brought, few of us could pay the price",
        "vi": "Nếu hạnh phúc có thể mua, cái giá của nó chẳng mấy ai trả được.",
        "id": "423e29c8fde143bda901e5b53e312ebe"
    },
    {
        "en": "It is during our darkest moments that we must focus to see the light",
        "vi": "Chính trong những thời khắc đen tối nhất của cuộc đời, chúng ta cần tập trung để tìm thấy ánh sáng.",
        "id": "cdce4fb07829494bac4098079a954b4f"
    },
    {
        "en": "Nothing is impossible, the word itself says ‘I’m possible’",
        "vi": "Không gì là không thể, bởi bản thân nó đã nói lên ‘I’m possible’ (Tôi có thể).",
        "id": "30d349944de14b60890b7422b5abee91"
    },
    {
        "en": "Don’t cry because it’s over, smile because it happened",
        "vi": "Đừng khóc vì nó kết thúc, hãy cười vì nó đã xảy ra.",
        "id": "7491236cd49346d182ef58574080a3c7"
    },
    {
        "en": "I’m the one that’s got to die when it’s time for me to die, so let me live my life the way I want to",
        "vi": "Tôi sẽ chết khi mà tôi cần phải chết. Vì thế hãy để tôi sống cuộc sống theo cách tôi muốn.",
        "id": "674f8e5ab8f94109aa317ad9f1305c48"
    },
    {
        "en": "Smile, even if it’s a sad smile because sadder than a sad smile is a sadness of not knowing how to smile",
        "vi": "Hãy cười, thậm chí dù đó là nụ cười buồn bã, bởi còn đáng buồn hơn nụ cười buồn bã là sự bi thảm vì không biết phải cười thế nào.",
        "id": "8a854aa3b8964a4f98445829e2dca92b"
    },
    {
        "en": "Insanity is doing the same thing, over and over again, but expecting different results",
        "vi": "Sự điên rồ là làm một việc giống nhau, lặp đi lặp lại, nhưng mong chờ những kết quả khác nhau.",
        "id": "18bcdd8975754c62a86fdf94dfe4d664"
    },
    {
        "en": "Don’t judge each day by the harvest you reap but by the seeds that you plant",
        "vi": "Đừng đánh giá mỗi ngày qua những gì bạn thu được, mà hãy nhìn vào những hạt giống bạn gieo trồng.",
        "id": "af916ce0d3fb4b55834c5389d338b96b"
    },
    {
        "en": "Never be afraid of change. You may lose something good, but you may gain something even better",
        "vi": "Đừng sợ thay đổi. Bạn có thể đánh mất đi một vài điều tốt đẹp, nhưng bạn có thể đạt được những điều còn tốt đẹp hơn.",
        "id": "9366342cbd024cb298cd2d00ef857b4b"
    },
    {
        "en": "Never say all you know. And never believe all you hear",
        "vi": "Đừng bao giờ nói tất cả những gì bạn biết. Và đừng bao giờ tin tất cả những gì bạn nghe.",
        "id": "c3e233e598904705a7e75ed9766a7182"
    },
    {
        "en": "Do not dwell in the past, do not dream of the future, concentrate the mind on the present moment",
        "vi": "Đừng sống trong quá khứ, đừng mơ về tương lai, hãy tập trung tâm trí vào giây phút hiện tại.",
        "id": "933d61b89f2046d6a2046dc00a828e3b"
    },
    {
        "en": "The only thing necessary for the triumph of evil is for good men to do nothing",
        "vi": "Điều cần thiết duy nhất để cái ác chiến thắng chính là khi những người tốt không làm gì cả.",
        "id": "e008795aa128475b8ea5cb30d01260f7"
    },
    {
        "en": "You can’t always control who walks into your life… but you can control which window you throw them out of",
        "vi": "Bạn không thể điều khiển việc ai sẽ bước vào cuộc sống của mình nhưng bạn có thể quyết định bạn có thể ném họ ra khỏi chiếc cửa sổ nào.",
        "id": "0d10227fa66d4fee8d2c3b8e248e3529"
    },
    {
        "en": "You should learn from your competitor, but never copy. Copy and you die",
        "vi": "Bạn nên học từ đối thủ, nhưng đừng bao giờ sao chép. Sao chép thì bạn sẽ chết.",
        "id": "3045f10643144c68a39b367aa51ef812"
    },
    {
        "en": "Do not go where the path may lead, go instead where there is no path and leave a trail",
        "vi": "Đừng đi những nơi đã có đường dẫn lối, thay vào đó hãy đi nơi chưa có lối và để lại dấu vết. (Ý câu này muốn khuyên đừng bắt chước theo ai cả, hãy đi theo con đường riêng của bản thân)",
        "id": "e0d6baa133d1492f9e9b54237bfe0aa6"
    },
    {
        "en": "Every new day is another chance to change your life",
        "vi": "Mỗi ngày mới là một cơ hội để thay đổi cuộc sống.",
        "id": "ffae6274bf7c45958afeee6ed0af7abb"
    },
    {
        "en": "Life is really simple, but we insist on making it complicated",
        "vi": "Cuộc sống vốn đơn giản, nhưng chúng ta luôn làm cho nó phức tạp lên.",
        "id": "5ed12a9e3cb9439fadd8ba2012fb99ac"
    },
    {
        "en": "Smiling is the best way to face any problem, to crush every fear and to hide every pain",
        "vi": "Mỉm cười là cách tốt nhất để đối mặt với mọi vấn đề. Để đè bẹp mọi nỗi sợ hãi, và khỏa lấp mọi nỗi đau.",
        "id": "c38d026ebd8f44a6a7ccf4284f926c90"
    },
    {
        "en": "Everybody laughs in the same language",
        "vi": "Ngôn ngữ của tiếng cười với ai cũng giống nhau.",
        "id": "05bfdea21e6b473cabea4a6a19169829"
    },
    {
        "en": "A laugh, to be joyous, must flow from a joyous heart, for without kindness, there can be no true joy",
        "vi": "Để một tiếng cười trở nên tràn đầy niềm hạnh phúc, cần phải xuất phát từ một trái tim vui sướng, bởi không có lòng tử tế, không thể có niềm vui thực sự.",
        "id": "9fbaf45043b04631b800307b6d49a483"
    },
    {
        "en": "Learn from yesterday, live for today, hope for tomorrow. The important is to not stop questioning",
        "vi": "Học hỏi từ quá khứ, sống cho hiện tại, hy vọng cho tương lai. Điều quan trọng là đừng bao giờ ngừng đặt câu hỏi.",
        "id": "c1671204400248b498e3227c4a9eb06e"
    },
    {
        "en": "Mistakes made in life are our lessons in disguise. And sometimes, the best lessons learned, came from the worst mistakes made",
        "vi": "Những bài học của chúng ta được ngụy trang bởi những sai lầm trong cuộc sống. Và đôi khi, bài học hay nhất mà chúng ta được học, đến từ những sai lầm tồi tệ nhất. Thật ra quan trọng là sau những sai lầm ấy ta rút ra được điều gì.",
        "id": "ab242c02326f4ad8ac9b9c69ed13604a"
    },
    {
        "en": "Don’t gain the world and lose your soul, wisdom is better than silver or gold",
        "vi": "Đừng đuổi theo quyền lực mà đánh mất đạo đức, cũng như trí tuệ đem đến cho bạn hạnh phúc chứ không phải là tiền bạc và vật chất.",
        "id": "cb4ff886eb244524bc1124de95d6bf77"
    },
    {
        "en": "We could never learn to be brave and patient, if there were only joy in the world",
        "vi": "Chúng ta không bao giờ có thể học được sự can đảm và kiên nhẫn nếu chỉ có niềm vui trên thế gian này.",
        "id": "1c32524e297241f3be6dfd67d13e01bf"
    },
    {
        "en": "People say nothing is impossible, but I do nothing everyday",
        "vi": "Mọi người nói không gì là không thể nhưng tôi lại không làm gì mỗi ngày.",
        "id": "5deda596d3d144299c295900a07ffe3e"
    },
    {
        "en": "There is a truth that never changes",
        "vi": "The sun of yesterday can not dry clothes today. Do not regret the past.",
        "id": "a1b3f44c88e04e3fbcf0c29db26cf24a"
    },
    {
        "en": "You only live once, but if you do it right, once is enough",
        "vi": "Bạn chỉ sống một lần duy nhất, nhưng nếu bạn làm đúng thì một lần là đủ.",
        "id": "5216401270c444b2b50f7be7eec1b1fe"
    },
    {
        "en": "There is enough in this world for everybodys’ need, but not enough for certain peoples’ greed",
        "vi": "Thế giới có đủ cho nhu cầu của tất cả mọi người, nhưng không đủ cho lòng tham của con người.",
        "id": "146e416a490f403a970314dd3534ad05"
    },
    {
        "en": "Peace does not mean the one where no noise, no trouble, and no toil. When we are in a storm, we still feel the calm of mind. That is the real meaning of peace!",
        "vi": "Bình yên không có nghĩa là 1 nơi không có tiếng ồn ào, không khó khăn, cực nhọc. Bình yên là ngay chính khi ta đang ở trong phong ba bão táp, ta vẫn cảm thấy sự an nhiên trong tâm hồn. Đó mới chính là ý nghĩa thực sự của sự bình yên!",
        "id": "95c800bc587f4077a8e3d896b1185dc2"
    },
    {
        "en": "Men marry women with the hope they will never change. Women marry men with the hope they will change. Invariably they are both disappointed",
        "vi": "Người đàn ông cưới phụ nữ với hy vọng họ sẽ không bao giờ thay đổi. Phụ nữ cưới đàn ông với hy vọng họ sẽ thay đổi. Chỉ có điều không thay đổi đó là họ đều cùng thất vọng.",
        "id": "acca67015c9840ae9022a5aeefbe20fe"
    },
    {
        "en": "The world is not what it seems",
        "vi": "Cuộc đời vốn không như những gì bạn thấy.",
        "id": "b2f49cf2144342d09915a28fd7df7efc"
    },
    {
        "en": "Smile, even if it’s a sad smile, because sadder than a sad smile is the sadness of not knowing how to smile",
        "vi": "Hãy cười, thậm chí dù đó là nụ cười buồn bã, bởi còn đáng buồn hơn nụ cười buồn bã là sự bi thảm vì không biết phải cười thế nào.",
        "id": "fab0be3f45d84034a6d4674d83834dfe"
    },
    {
        "en": "Be strong enough to let go, and patient enough to wait for what you deserve",
        "vi": "Đủ mạnh mẽ để cho đi, và đủ kiên nhẫn để chờ đợi những gì bạn xứng đáng nhận.",
        "id": "42a52d12f87d48fcaa74841d4d7276ae"
    },
    {
        "en": "Do not just look at the results that hasty evaluate efforts of others",
        "vi": "Đừng chỉ nhìn vào kết quả mà vội vàng đánh giá sự cố gắng của người khác.",
        "id": "a3c9ba053a3b41d5a96dffe1810c0f81"
    },
    {
        "en": "Learn to earn, not to save",
        "vi": "Hãy học cách kiếm tiền thay vì học cách tiết kiệm.",
        "id": "73362eda7e7843ca985be7e5b34f2344"
    },
    {
        "en": "But better to get hurt by the truth than comforted with a lie",
        "vi": "Thà bị tổn thương bởi sự thật còn hơn là được xoa dịu bởi lời nói dối.",
        "id": "f5081a3c5a2b41b6b040664781b6fa8b"
    },
    {
        "en": "To laugh with others is one of life’s great pleasures. To be laughed at by others is one of life’s great hurts",
        "vi": "Cười với người khác là một trong những niềm vui thú của cuộc đời. Bị người khác cười là một trong những sự tổn thương lớn của cuộc đời.",
        "id": "5ebd79e8b59943319ba4607192b441fe"
    },
    {
        "en": "Difficult roads often lead to beautiful destinations",
        "vi": "Những con đường khó khăn luôn luôn dẫn đến những đích đến tươi đẹp.",
        "id": "ce8ccce0ad9a401aa4f4944b471f9313"
    },
    {
        "en": "Life is short. Smile while you still have teeth",
        "vi": "Cuộc sống vốn rất ngắn. Hãy mỉm cười khi bạn vẫn còn có thể.",
        "id": "6048fc27a07449c7b0fdca377b23ce14"
    },
    {
        "en": "Don’t mix bad words with a bad mood. You’ll have many opportunities to change a mood, but you won’t be able to replace words you spoke",
        "vi": "Đừng nói những điều tồi tệ khi tâm trạng không tốt. Tâm trạng của bạn có thể thay đổi, nhưng những điều đã nói ra, không thể rút lại được đâu.",
        "id": "07b2f236823c40dda4d949238373ac3f"
    },
    {
        "en": "Sadness flies away on the wings of time",
        "vi": "Nỗi buồn bay đi trên đôi cánh của thời gian.",
        "id": "872cb6d25ecc467ebcc8d623119901d7"
    },
    {
        "en": "Believe that life is worth living and your belief will help create the fact",
        "vi": "Hãy tin tưởng rằng cuộc sống này xứng đáng để sống và niềm tin đó của bạn sẽ tạo nên sự thật.",
        "id": "e75ad9a8b3fa4434aa011c1299db8fb9"
    },
    {
        "en": "Life is the greatest journey you will be ever on",
        "vi": "Cuộc sống là hành trình vĩ đại nhất mà bạn từng trải qua.",
        "id": "e292549c128245e3a016920668d3d092"
    },
    {
        "en": "Silence is the most powerful scream",
        "vi": "Im lặng là tiếng thét mạnh mẽ nhất.",
        "id": "79c65e6e301841c0b653340769796d98"
    },
    {
        "en": "The busy have no time for tears",
        "vi": "Người bận rộn không còn thời gian để khóc.",
        "id": "c17d09f250da44c29d6a0de699b9be9e"
    },
    {
        "en": "Be where your feet are",
        "vi": "Hãy sống vui với hiện tại.",
        "id": "ded5df3d2e284f8db1e8235faa7a11d2"
    },
    {
        "en": "Don’t judge someone for their choices when you don’t understand their reasons",
        "vi": "Đừng bao giờ phán xét sự lựa chọn của một ai, vì bạn không hề biết lý do của họ.",
        "id": "273004c5d38b4066b501097a47229d9a"
    },
    {
        "en": "Do not argue with an idiot. He will drag you down to his level and beat you with experience",
        "vi": "Đừng tranh cãi với kẻ ngốc. Anh ta sẽ kéo bạn xuống trình độ của mình và đánh bại bạn với kinh nghiệm.",
        "id": "ceabbe09bb41484faf9ba789f0335ae9"
    },
    {
        "en": "Don’t sweat the petty things and don’t pet the sweaty things",
        "vi": "Đừng đổ mồ hôi cho những thứ nhỏ nhặt và đừng cưng nựng những thứ khiến bạn tốn mồ hôi.",
        "id": "01ba74b683a0417c91e262d812195101"
    },
    {
        "en": "I’m selfish, impatient and a little insecure. I make mistakes, I am out of control and at times hard to handle. But if you can’t handle me at my worst, then you sure as hell don’t deserve me at my best",
        "vi": "Tôi là kẻ ích kỷ, thiếu kiên nhẫn và dễ dao động. Tôi thường sai lầm, mất kiểm soát và có những thời điểm tôi khó mà điều khiển được. Nhưng nếu bạn không thể đối đãi với tôi trong những lúc tôi tệ nhất, thì bạn chắc chắn không xứng đáng với những gì tốt nhất mà tôi có.",
        "id": "8fea178b27ae4d67968329650185261a"
    },
    {
        "en": "If you want to live a happy life, tie it to a goal, not to people or things",
        "vi": "Nếu bạn muốn sống một cuộc sống hạnh phúc, hãy trói nó vào một mục tiêu chứ đừng trói nó vào vật nào hay người nào.",
        "id": "844701f6ce014d7fb8bac0a719cd565c"
    },
    {
        "en": "I’m not lazy. I’m just on my energy saving mode",
        "vi": "Tôi không lười, tôi chỉ đang ở chế độ tiết kiệm năng lượng thôi.",
        "id": "78f938857f75487e8ddb63e744d4345e"
    },
    {
        "en": "If you born poor it’s not your mistake, but you die poor it’s your mistake",
        "vi": "Nếu bạn sinh ra nghèo khó, đó không phải lỗi của bạn, nhưng nếu bạn chết trong nghèo khó thì đó là lỗi của bạn.",
        "id": "93e3a49649e048a3bb493b5506910bc7"
    },
    {
        "en": "Keep your eyes on the stars and your feet on the ground",
        "vi": "Hướng đôi mắt về phía những vì sao, và chạm đôi chân trên mặt đất.",
        "id": "8d678033c82740f7b3774bc389f7ca2b"
    },
    {
        "en": "Money won’t buy happiness, but it will pay the salaries of a large research staff to study the problem",
        "vi": "Tiền không mua được hạnh phúc nhưng nó sẽ trả được lương cho lượng lớn nhân viên để nghiên cứu vấn đề.",
        "id": "34b8087db8d147fb81c5bfc9f33a56ee"
    },
    {
        "en": "Never ignore a person who cares for you Because one day you may realize you’ve lost the moon while counting the stars",
        "vi": "Đừng bao giờ bỏ lỡ những người quan tâm bạn thật lòng. Vì một ngày nào đó bạn nhận ra rằng mình đã đánh mất mặt trăng chỉ vì mải mê đếm những vì sao.",
        "id": "9446a6b650f643abb0f906de1ba80b9a"
    },
    {
        "en": "No matter how good or bad you think life is, wake up each day and be thankful for life. Someone somewhere else is fighting to survive",
        "vi": "Bất luận bạn nghĩ cuộc sống này tươi đẹp hay xấu xa. Thức dậy mỗi ngày và hãy cảm ơn cuộc sống vì đâu đó trên thế giới này, có người phải đấu tranh để tồn tại.",
        "id": "9203712dd6d742d6b2aaca9da25be4e3"
    },
    {
        "en": "Never give up. Today is hard, tomorrow will be worse, but the day after tomorrow will be sunshine",
        "vi": "Đừng bao giờ từ bỏ. Hôm nay khó khăn, ngày mai còn khó khăn hơn nhưng ngày kia sẽ là ngày tuyệt vời.",
        "id": "c7905d8d8bb14e84b8814095224eecf6"
    },
    {
        "en": "Plant your garden and decorate your own soul, instead of waiting for someone to bring you flowers",
        "vi": "Hãy tự trồng vườn và trang trí cho tâm hồn bạn, thay vì chờ đợi ai đó mang hoa đến cho bạn.",
        "id": "0d8610f066d54f6a95868f95074ad9c9"
    },
    {
        "en": "Sometimes the questions are complicated and the answers are simple",
        "vi": "Đôi khi câu hỏi thường phức tạp thì câu trả lời sẽ rất đơn giản.",
        "id": "104500f772324ed2ae77a4fba8dd18c3"
    },
    {
        "en": "To live is the rarest thing in the world. Most people exist, that is all",
        "vi": "Sống là điều hiếm có nhất nhất trên thế giới này, phần lớn mọi người chỉ tồn tại, đó là tất cả.",
        "id": "b340f158a35a487cad8d435c77b0e9c1"
    },
    {
        "en": "There is no elevator to success — you have to take the stairs",
        "vi": "Không có chiếc thang máy nào đưa bạn đến thành công, bạn phải leo thang thôi.",
        "id": "34918bebe5494b9aa42a178760d0e2c4"
    },
    {
        "en": "There are only two ways to live your life. One is as though nothing is a miracle. The other is as though everything is a miracle",
        "vi": "Chỉ có duy nhất 2 cách để bạn sống cuộc đời của mình. Một là sống như thể không gì là phép màu cả. Điều còn lại là sống như thể phép màu là tất cả mọi thứ.",
        "id": "aefba1388c384e779f5d5ad768c7814a"
    },
    {
        "en": "When someone loves you, the way they talk about you is different. You feel safe and comfortable",
        "vi": "Khi ai đó yêu bạn thì cái cách họ nói về bạn rất khác biệt. Bạn sẽ cảm thấy an toàn và thoải mái.",
        "id": "88e3faf5770e474f92a5184721ee7650"
    },
    {
        "en": "What hurts you today, makes you stronger tomorrow",
        "vi": "Những gì làm tổn thương bạn hôm nay, ngày mai sẽ cho bạn sức mạnh.",
        "id": "cc275d7fdc5e488a980c4bd9f869a0ae"
    },
    {
        "en": "You never know what you have until… you clean your room",
        "vi": "Bạn sẽ không bao giờ biết mình có gì cho đến khi… bạn dọn phòng mình.",
        "id": "898eb2c68a3148c99ea55dd7bd79304b"
    },
    {
        "en": "You have two ears and one mouth. Follow that ratio. Listen more, talk less",
        "vi": "Bạn có 2 cái tai và 1 cái miệng. Cứ vậy đi, nghe nhiều và nói ít thôi.",
        "id": "61b82d79f0d54236af282af885334b6b"
    },
    {
        "en": "The only person you should try to be better than is the person you were yesterday. —Anonymous",
        "vi": "Người mà bạn nên cố gắng để trở nên tốt đẹp hơn chính là bạn của ngày hôm qua.",
        "id": "4fb46d9d5ab547038e7b0ccf68188510"
    },
    {
        "en": "The difference between stupidity and genius is that genius has its limits",
        "vi": "Sự khác biệt giữa ngu dốt và thiên tài là thiên tài thì có giới hạn.",
        "id": "ca4eeb4e256d466ea23c2e10f4727508"
    },
    {
        "en": "I love u not because I need you. I need you because I love U",
        "vi": "Tôi yêu bạn không phải vì tôi cần bạn. Tôi cần bạn vì tôi yêu bạn",
        "id": "94332b6c6e71470292da2074927fd798"
    },
    {
        "en": "An intelligent person is like a river,the deeper the less noise",
        "vi": "Một người thông minh sẽ như một dòng sông, càng sâu càng ít ồn ào.",
        "id": "8203bc22655045e0bc3c206ce6bc4a14"
    },
    {
        "en": "I always dream of being a millionaire like my friend! He’s dreaming too",
        "vi": "Tôi luôn mơ ước trở thành một triệu phú như bạn tôi! Anh ấy cũng đang mơ.",
        "id": "a690cde8dc834be3b119ca0af71264f1"
    },
    {
        "en": "If you want to see a rainbow, you must go through the rain",
        "vi": "Muốn thấy cầu vồng, bạn phải đi qua những cơn mưa.",
        "id": "0d4eb53b87b44f66bb20536abcad09c7"
    },
    {
        "en": "If you want to make your dreams come true, the first thing you have to do is wake up",
        "vi": "Nếu bạn muốn biến ước mơ của mình thành hiện thực, điều đầu tiên bạn cần làm là thức dậy.",
        "id": "2dd7d65a14154118aa48538f78e9909b"
    },
    {
        "en": "Better to remain silent and be thought a fool, than to speak and remove all doubt",
        "vi": "Tốt nhất là giữ im lặng và được cho là một kẻ ngốc, còn hơn là nói ra và xóa đi hết sự nghi ngờ.",
        "id": "8d499006527d4a7e98196811b1d56d5b"
    },
    {
        "en": "Let your love be like the misty rains, coming softly, but flooding the river",
        "vi": "Hãy để tình yêu của bạn như những cơn mưa mù sương, đến nhẹ nhàng nhưng làm lụt cả dòng sông.",
        "id": "dcb55f12848b4995aa54f02767e43d21"
    },
    {
        "en": "Sometimes what you want isn’t what you get, but what you get in the end is so much better than what you wanted",
        "vi": "Đôi khi những gì bạn muốn không phải là những gì bạn nhận được, nhưng những gì bạn nhận được cuối cùng tốt hơn rất nhiều so với những gì bạn muốn.",
        "id": "c66aa3a705ff4d43b88e51e4973834e6"
    },
    {
        "en": "Life is short. Time is fast. No reply. No rewind. So enjoy every moment as it comes",
        "vi": "Cuộc sống rất ngắn ngủi. Thời gian trôi rất nhanh. Không hồi đáp. Không quay lại. Vì thế hãy tận hưởng từng khoảnh khắc diễn ra…",
        "id": "eb81e2cd275a4709824be3702639ee4e"
    },
    {
        "en": "When life puts you in tough situations, don’t say, why me? Just say, try me",
        "vi": "Khi cuộc sống đặt bạn vào những tình huống khó khăn, đừng thắc mắc, tại sao lại là tôi? Chỉ cần nói, hãy thử thách tôi đi!",
        "id": "52e0b235defa413ca732ba78787abe3b"
    },
    {
        "en": "Life is very short, so break your silly egos, forgive quickly, believe slowly, love truly, laugh loudly and never avoid anything that makes you smile",
        "vi": "Cuộc sống rất ngắn ngủi, vì thế hãy gỡ bỏ cái tôi ngớ ngẩn của mình, nhanh chóng tha thứ, từ từ tin tưởng, yêu thật lòng, cười thật lớn và đừng bao giờ lảng tránh những thứ có thể làm bạn cười.",
        "id": "71f158dcf8ee4f25a20a1d6e2c934b18"
    },
    {
        "en": "When life changes to be more difficult, you must change to be even stronger",
        "vi": "Khi cuộc sống trở nên khó khăn hơn, bạn phải thay đổi để mạnh mẽ hơn.",
        "id": "e05f3406f24149559f018c9b191d9f95"
    },
    {
        "en": "I’m not lazy, I’m on energy saving mode",
        "vi": "Tôi không lười. Chỉ là tôi đang bật chế độ tiết kiệm năng lượng mà thôi.",
        "id": "5b5eead3060d44cbbb76a47878e06e1a"
    },
    {
        "en": "When inspiration doesn’t come to me, I go halfway to meet it",
        "vi": "Khi cảm hứng không đến với tôi, tôi sẽ đi nửa chừng để gặp nó.",
        "id": "a493e4e52ab34b2d8bb7cf029e9d4ff7"
    },
    {
        "en": "The richer you get, the more expensive happiness becomes",
        "vi": "Bạn càng giàu thì cái giá của hạnh phúc càng lớn.",
        "id": "08c7b303934043b382a5df2fa9ec13dd"
    },
    {
        "en": "You can never buy love… but still you have to pay for it",
        "vi": "Bạn không bao giờ có thể mua được tình yêu … nhưng bạn vẫn phải trả tiền cho nó.",
        "id": "033cb4fcf3c6422bad72433189f83eac"
    },
    {
        "en": "If you don’t succeed at first, hide all evidence that you tried",
        "vi": "Nếu bạn không thành công ở lần đầu tiên, hãy giấu tất cả những gì bạn đã làm.",
        "id": "f4cde926b2d347edaf942988f22fbff4"
    },
    {
        "en": "Some people choose to stay single simply because they are tired of giving everything and ending up with nothing",
        "vi": "Một số người chọn sống độc thân đơn giản vì họ quá mệt mỏi với việc cho đi tất cả mọi thứ và rốt cuộc chẳng được gì.",
        "id": "c143f81f056344a78288efda78d041a3"
    },
    {
        "en": "You may only be one person to the world but you may be the world to one person",
        "vi": "Đối với thế giới này bạn chỉ là một người, nhưng đối với ai đó bạn là cả thế giới.",
        "id": "e249b1a364664556b8b05a14f0418b75"
    },
    {
        "en": "I’m not afraid to fall in LOVE, i am afraid to fall for a wrong person again",
        "vi": "Tôi không sợ đắm chìm vào TÌNH YÊU, tôi chỉ sợ lại nhầm người.",
        "id": "fd6995eb560d4976aefa3f7bedf1a91e"
    },
    {
        "en": "The space between your fingers are meant to be filled with mine",
        "vi": "Khoảng cách giữa các ngón tay của bạn có nghĩa là cần được se khít bởi tôi.",
        "id": "0ba8357f2cd44f1c9706111a4ba4c12e"
    },
    {
        "en": "Believe there should be a better way to start each day instead of waking up every morning",
        "vi": "Tôi tin rằng nên có một cách tốt hơn để bắt đầu mỗi ngày thay vì thức dậy mỗi buổi sáng.",
        "id": "ccd264d0f2ac45b7abf2606bb4e2f6c1"
    },
    {
        "en": "My one hand is enough to fight against the world. If you hold the other one",
        "vi": "Một tay của tôi đủ để chiến đấu chống lại cả thế giới. Nếu bạn nắm bàn tay còn lại.",
        "id": "c6eebc2528444c959a2b5ea4a0aaf3d3"
    },
    {
        "en": "A great lover is not one who lover many, but one who loves one woman for life",
        "vi": "Tình yêu lớn không phải yêu nhiều người mà là yêu một người và suốt đời.",
        "id": "91cdab5c6f4740a2bd537bb39b6bd72c"
    },
    {
        "en": "I am single because god is busy writing to best love story for me",
        "vi": "Tôi độc thân vì chúa đang bận viết câu chuyện tình yêu hay nhất cho tôi.",
        "id": "61a0e25284d645cb9ce78295d0688f51"
    },
    {
        "en": "Phones are better than girlfriends, At least we can switch off",
        "vi": "Điện thoại tốt hơn bạn gái, Ít nhất chúng ta có thể tắt đi!",
        "id": "9c856b29a0db44fd900eee1fe37c36c8"
    },
    {
        "en": "In my house I’m the boss, my wife is just the decision maker",
        "vi": "Trong nhà tôi là ông chủ, vợ tôi chỉ là người ra quyết định.",
        "id": "e59e95670d544776bcea1680f4284984"
    },
    {
        "en": "I want my Girlfriend like Google, She will understand me better",
        "vi": "Tôi muốn bạn gái của tôi như Google, Cô ấy sẽ hiểu tôi nhiều hơn.",
        "id": "6bd5d1cdb0a54433a04215b34753ba52"
    },
    {
        "en": "When it hurts to look back … and you are scared to look ahead … look beside you, I’ll always be there for you",
        "vi": "Khi nhìn lại một điều đau khổ … và em sợ nhìn về phía trước … Em hãy nhìn sang bên cạnh nơi mà anh luôn ở đó đợi em.",
        "id": "54d49b0427604deeb8e3271223f4668b"
    },
    {
        "en": "Every problem comes with solution, but my GF don’t have",
        "vi": "Mỗi vấn đề đều đi kèm với giải pháp, nhưng bạn gái của tôi thì không.",
        "id": "fbd3abf59b3f4a12941711dab7c71d65"
    },
    {
        "en": "Life’s under no obligation to give us what we expect",
        "vi": "Cuộc sống không có nghĩa vụ trao cho chúng ta những điều mà chúng ta mong đợi.",
        "id": "7558b8f78dd74b8f83c8bd15f0e37c51"
    },
    {
        "en": "I’m selfish, impatient and a little insecure. I make mistakes, I am out of control and at times hard to handle. But if you can’t handle me at my worst, then you sure as hell don’t deserve me at my best. ― Marilyn Monroe",
        "vi": "Tôi là kẻ ích kỷ, thiếu kiên nhẫn và dễ dao động. Tôi thường sai lầm, mất kiểm soát và có những thời điểm tôi khó mà điều khiển được. Nhưng nếu bạn không thể đối đãi với tôi trong những lúc tôi tệ nhất, thì bạn chắc chắn không xứng đáng với những gì tốt nhất mà tôi có.",
        "id": "2e7d61ba655f4bd89a21e339958188bf"
    },
    {
        "en": "Enjoy the little things in life for one day, you’ll look back and realize they were the big things",
        "vi": "Hãy tận hưởng những điều nhỏ nhất của cuộc sống trong một ngày, để rồi khi ngẫm lại, bạn sẽ nhận ra đó lại là những điều lớn lao.",
        "id": "34ccbc47080d4be9ba757b43c9640bfe"
    },
    {
        "en": "Do not pray for an easy life, pray for the strength to endure a difficult one",
        "vi": "Đừng cầu mong một cuộc sống dễ dàng, hãy cầu mong sức mạnh để tồn tại được qua những khó khăn (Quote by Bruce Lee).",
        "id": "6e6796eeaf114e418ffa4cc6a1b2d05e"
    },
    {
        "en": "You only live once, but if you do it right, once is enough. ― Mae West",
        "vi": "Bạn chỉ sống một lần duy nhất, nhưng nếu bạn làm đúng thì một lần là đủ.",
        "id": "2fe6aa7077ea410f855f9446f1a043d1"
    },
    {
        "en": "Life becomes harder for us when we live for others, but it also becomes richer and happier",
        "vi": "Cuộc sống trở nên khó khăn hơn khi chúng ta sống vì người khác, nhưng nếu ta sống vì người khác, cuộc đời cũng đẹp đẽ và hạnh phúc hơn.",
        "id": "8e4fc9cf2e844be1a591f2bc55dcbe87"
    },
    {
        "en": "Insanity is doing the same thing, over and over again, but expecting different results. ― Narcotics Anonymous",
        "vi": "Sự điên rồ là làm một việc giống nhau, lặp đi lặp lại, nhưng mong chờ những kết quả khác nhau.",
        "id": "bfd4cf7cac964466a85af1c9cfcc1ad7"
    },
    {
        "en": "To live is the rarest thing in the world. Most people exist, that is all. ― Oscar Wilde",
        "vi": "Sống là điều hiếm có nhất nhất trên thế giới này, phần lớn mọi người chỉ tồn tại, đó là tất cả.",
        "id": "46dca26731d74e708642aebebcbeb720"
    },
    {
        "en": "I may not have gone where I intended to go, but I think I have ended up where I needed to be. ― Douglas Adams, The Long Dark Tea-Time of the Soul",
        "vi": "Tôi có thể đã không đến nơi tôi định đi nhưng tôi nghĩ mình đã đến được nơi tôi cần đến.",
        "id": "a5c60a54fa694024b32116c009c1bc83"
    },
    {
        "en": "Life is what happens to us while we are making other plans. ― Allen Saunders",
        "vi": "Cuộc sống là những điều xảy ra với chúng ta khi mình đang tạo nên những kế hoạch khác.",
        "id": "ef3681ba4dfe479f95be2fc1c356a78e"
    },
    {
        "en": "You’ll never be brave if you don’t get hurt. You’ll never learn if you don’t make mistakes. You’ll never be successful if you don’t encounter failure",
        "vi": "Bạn sẽ không bao giờ mạnh mẽ nếu bạn không bị gục ngã. Bạn sẽ không bao giờ học hỏi được gì nếu như không mắc lỗi. Bạn sẽ không bao giờ thành công nếu bạn không đối mặt với thất bại.",
        "id": "e626cd21ec64485992c61973a7686126"
    },
    {
        "en": "Today you are You, that is truer than true. There is no one alive who is Youer than You. ― Dr. Seuss, Happy Birthday to You!",
        "vi": "Hôm nay bạn là chính mình, đó là một điều không ai có thể chối cãi. Chẳng ai có khả năng biến thành bạn giỏi hơn bản thân bạn đâu.",
        "id": "da50ff9571ce4384817b20b1e5b19e7b"
    },
    {
        "en": "I’m not afraid of death; I just don’t want to be there when it happens. ― Woody Allen",
        "vi": "Tôi không sợ cái chết; tôi chỉ không muốn ở đó khi điều này xảy ra.",
        "id": "3b47caa762094d2b9874a78ca7e766a7"
    },
    {
        "en": "Life is not fair, get used to it",
        "vi": "Cuộc sống không công bằng, hãy làm quen với nó.",
        "id": "399aceda90424679b9e1c307c36ff00c"
    },
    {
        "en": "Life is the greatest journey you will ever be on",
        "vi": "Cuộc sống là chuyến hành trình tuyệt vời nhất mà bạn từng trải qua.",
        "id": "803fdb88a71b4419b135ddd443e0f8b1"
    },
    {
        "en": "Trying and Doing are two different things. When you try, you hope. When you do, you succeed",
        "vi": "Cố gắng và hành động là hai chuyện khác nhau. Nếu bạn cố gắng, bạn có hy vọng. Nếu bạn hành động, bạn sẽ gặt hái được thành công.",
        "id": "71b47394774a43bc8e0ed0cc23488e60"
    },
    {
        "en": "Every man has his secret sorrows which the world knows not; and often times we call a man cold when he is only sad",
        "vi": "Mọi người đều có những nỗi buồn bí mật mà thế giới chẳng hay biết; và thường người ta nói người đàn ông lạnh lùng khi anh ta chỉ đơn giản là đang buồn.",
        "id": "af8b43286ddf4bf6889c963b3403ff54"
    },
    {
        "en": "Reality continues to ruin my life. ― Bill Watterson, The Complete Calvin and Hobbes",
        "vi": "Thực tế tiếp tục hủy hoại cuộc sống của tôi.",
        "id": "d61c0a4a8c8f44299c3cf55640a3f39b"
    },
    {
        "en": "Life is a dream for the wise, a game for the fool, a comedy for the rich, a strategy for the poor",
        "vi": "Cuộc sống như một giấc mơ của những người khôn, một trò chơi của những gã ngốc, một câu chuyện hài của những người giàu, một chiến lược của những người nghèo.",
        "id": "87af2fa636ba4cac9a88b0b4c59a9fa6"
    },
    {
        "en": "Things change. And friends leave. Life doesn’t stop for anybody. ― Stephen Chbosky, The Perks of Being a Wallflower",
        "vi": "Mọi thứ thay đổi, và bạn bè rời đi. Cuộc sống không dừng lại cho bất kỳ ai.",
        "id": "bbb55c3a41cf47c5abd9b261475c9ecd"
    },
    {
        "en": "Don’t let schooling interfere with your education",
        "vi": "Đừng để trường lớp cản con đường giáo dục của bạn.",
        "id": "54609088d41d434881e99f284a095160"
    },
    {
        "en": "The value of life is not its duration, but it’s donation",
        "vi": "Thước đo của cuộc đời không phải thời gian, mà là cống hiến.",
        "id": "3a174b99f1814b81a979279afc5f5f7f"
    },
    {
        "en": "But better to get hurt by the truth than comforted with a lie. ― Khaled Hosseini",
        "vi": "Thà bị tổn thương bởi sự thật còn hơn là được xoa dịu bởi lời nói dối.",
        "id": "b07a974c65484ecdaf09d88d77dc844d"
    },
    {
        "en": "Ambition is the path to success. Persistence is the vehicle you arrive in",
        "vi": "Tham vọng là con đường dẫn bạn đến thành công. Sự kiên trì là chiếc xe chở bạn trên con đường đó.",
        "id": "24303a634434414ca34fbb0b779305aa"
    },
    {
        "en": "One of the simplest way to stay happy is to let go all of the things that make you sad",
        "vi": "Cách đơn giản nhất để luôn hạnh phúc là bỏ qua tất cả những thứ làm bạn buồn.",
        "id": "b5488b349c7c424f879ea135477eb73f"
    },
    {
        "en": "Life is like a camera lens. Focus only on what’s important and you can capture it perfectly",
        "vi": "Cuộc sống giống như một cái ống kính máy ảnh. Tập trung vào điều quan trọng nhất và bạn sẽ nắm bắt được nó một cách hoàn hảo.",
        "id": "f2720ba56afb4ae593561dad0f3c87a7"
    },
    {
        "en": "This too, shall pass. —Anonymous",
        "vi": "Rồi mọi chuyện sẽ qua.",
        "id": "81f1aed52e8b440d94ae4b23fc45d748"
    },
    {
        "en": "Life always offers you a second chance. It’s called tomorrow",
        "vi": "Cuộc sống luôn cho bạn một cơ hội thứ hai. Nó được gọi là ngày mai.",
        "id": "630b6cd6fe10484f9301ebdd2c0234fd"
    },
    {
        "en": "Life has no remote. Get up and change it yourself",
        "vi": "Cuộc sống không có điều khiển từ xa. Hãy tự đứng dậy và thay đổi nó.",
        "id": "80c9e79892fb4190b8630f8b37af334c"
    },
    {
        "en": "Life is a succession of lessons which must be lived to be understood",
        "vi": "Cuộc sống là một chuỗi liên tiếp những bài học mà bạn cần phải sống mới hiểu được.",
        "id": "2ff2affc46b74502808afeec47ee0406"
    },
    {
        "en": "When life changes to be harder, change yourself to be stronger",
        "vi": "Khi cuộc sống trở nên khó khăn hơn, hãy thay đổi bản thân để trở nên mạnh mẽ hơn.",
        "id": "6eee6c25e26c4e0da1303231a115b7ae"
    },
    {
        "en": "You never know what worse luck your bad luck has saved you from — Cormac McCarthy",
        "vi": "Bạn sẽ không bao giờ biết được những điều thực sự tồi tệ nào mà được cứu bởi những điều tồi tệ khác của bạn đâu.",
        "id": "3b16194bc0d64975ad192b6fcec71454"
    },
    {
        "en": "You can’t start the next chapter of your life if you keep re-reading the last one",
        "vi": "Bạn không thể bắt đầu chương mới của cuộc đời nếu bạn cứ đọc đi đọc lại mãi chương trước đó.",
        "id": "1403a9c737594353916aa4cb6c76491b"
    },
    {
        "en": "A man who flies from his fear may find that he has only taken a shortcut to meet it. —Sador, Children of Hurin",
        "vi": "Người mà thoát được ra khỏi nỗi sợ của họ sẽ hiểu rằng họ chỉ đi 1 đoạn đường tắt đến gặp nó mà thôi.",
        "id": "3bc4ac0dd6384ee7865dfe612f914cac"
    },
    {
        "en": "Life is a story, make yours the best seller",
        "vi": "Cuộc sống là một cuốn truyện, hãy làm sao cho cuốn của bạn bán chạy nhất.",
        "id": "aef513d9834746f5ba1d85d2a7916765"
    },
    {
        "en": "Everything you can imagine is real. ― Pablo Picasso",
        "vi": "Mọi điều bạn có thể tưởng tượng được đều là thật.",
        "id": "ed60e30b5cd14728bfb4fa66d918ec96"
    },
    {
        "en": "Life is short, Smile while you still have teeth!",
        "vi": "Cuộc sống vốn rất ngắn. Hãy mỉm cười khi bạn vẫn còn có thể!",
        "id": "3ec22f708ef04e6388cc4229b76e64ca"
    },
    {
        "en": "No one can make you feel inferior without your consent. —Eleanor Roosevelt",
        "vi": "Không ai có thể làm bạn cảm thấy kém cỏi nếu không có sự bằng lòng của bạn.",
        "id": "7ff3aa3f02ad4abfbb8ae45a2016f8ff"
    },
    {
        "en": "Life’s too mysterious to take too serious. —Mary Engelbreit",
        "vi": "Cuộc sống này quá bí ẩn để coi nó quá nghiêm trọng.",
        "id": "0282018a082842978353599458a204d6"
    },
    {
        "en": "You can’t go around building a better world for people. Only people can build a better world for people. Otherwise it’s just a cage. —Terry Pratchett, Witches Abroad",
        "vi": "Bạn không thể đi vòng quanh và xây dựng một thế giới đẹp hơn cho mọi người được. Chỉ có tất cả con người mới có thể xây dựng một thế giới đẹp hơn cho con người thôi. Nếu không thì nó chỉ là một cái lồng sắt.",
        "id": "d4b3b671678b44dc8d199882ebb0c3a6"
    },
    {
        "en": "There isn’t a way things should be. There’s just what happens, and what we do. — Terry Pratchett, A Hat Full of Sky",
        "vi": "Không có cách nào khiến mọi việc nên thế này hay thế khác. Sẽ chỉ có điều gì đang diễn ra và chúng ta làm gì mà thôi.",
        "id": "5b824efc3ac645ec975c72a7af4696eb"
    },
    {
        "en": "Be where your feet are — Anonymous",
        "vi": "Hãy sống với hiện tại.",
        "id": "010abc061d2940a19ac118c650e463c3"
    },
    {
        "en": "The trick in life is learning how to deal with it. —Helen Mirren",
        "vi": "Bí kíp cuộc đời chính là việc học được cách giải quyết nó thế nào.",
        "id": "c5fda3f8a88d409abc9d257073fb7932"
    },
    {
        "en": "It is just a chapter in the past, but don’t close the book, just turn the page",
        "vi": "Hãy tiếp tục bước đi. Đó chỉ là một phần nhỏ trong quá khứ. Đừng đóng cả quyển sách lại, hãy chỉ lật sang trang mới!",
        "id": "f7c659629bbf4ce692efc00c36d10055"
    },
    {
        "en": "I will always choose a lazy person to do a difficult job. Because, he will find an easy way to do it",
        "vi": "Tôi luôn chọn một người lười biếng để làm một công việc khó. Bởi vì anh ta sẽ luôn tìm ra cách dễ dàng để thực hiện nó. (BILL GATE)",
        "id": "b6bf28573057441dbadff749cc31340c"
    },
    {
        "en": "It’s OK to not be OK, as long as you don’t stay that way. —Anonymous",
        "vi": "Hoàn toàn OK nếu bạn không ổn, miễn là bạn đừng mãi dừng lại ở đó.",
        "id": "aa38b8f3e28941dd8948e3b3fe19322b"
    },
    {
        "en": "Believe you can and you’re halfway there. —T. Roosevelt",
        "vi": "Hãy tin rằng bạn có thể và bạn đã đang ở nửa chặng đường rồi.",
        "id": "4440d03c118848f5be3b17634e690cd6"
    },
    {
        "en": "Defeat is simply a signal to press onward. —Helen Keller",
        "vi": "Sự thất bại chỉ đơn giản là một tín hiệu để tiến lên phía trước.",
        "id": "6fa170d4858e4c2f8c073c591c811a59"
    },
    {
        "en": "Plant your garden and decorate your own soul, instead of waiting for someone to bring you flowers. —Jose Luis Borges",
        "vi": "Hãy tự trồng vườn và trang trí cho tâm hồn bạn, thay vì chờ đợi ai đó mang hoa đến cho bạn.",
        "id": "e9035bd1f9fd419aa75aaa2d125e7fc1"
    },
    {
        "en": "Don’t sweat the petty things and don’t pet the sweaty things. —George Carlin",
        "vi": "Đừng đổ mồ hôi cho những thứ nhỏ nhặt và đừng cưng nựng những thứ khiến bạn tốn mồ hôi.",
        "id": "c3188a1049d64792a4e3ad7aecf8811a"
    },
    {
        "en": "Do not set yourself on fire in order to keep others warm. –Anonymous",
        "vi": "Đừng đặt mình vào lửa để giữ ấm cho những người khác.",
        "id": "eeb64d9d738b4729bddf8a1d5f688515"
    },
    {
        "en": "When I die, I want my tombstone to offer free WiFi, just so people will visit more often",
        "vi": "Khi tôi chết, tôi muốn mộ của mình có wifi và mọi người sẽ ghé thăm thường xuyên hơn.",
        "id": "827b8b954d494581a1ab3b7587e726a6"
    },
    {
        "en": "The brain is a wonderful organ; it starts working in the moment you get up in the morning, and does not stop until you get into the office. — Robert Frost",
        "vi": "Não bộ là một cơ quan diệu kỳ, nó bắt đầu hoạt động vào thời điểm bạn thức dậy buổi sáng và không dừng lại cho đến khi bạn vào văn phòng.",
        "id": "29aa03b07d974919ad5ead637b9cccbe"
    },
    {
        "en": "I wish I were a unicorn so I could stab idiots with my head",
        "vi": "Tôi ước gì mình là một chú kỳ lân để tôi có thể đâm những kẻ ngốc bằng đầu mình.",
        "id": "b09e15c99847454584b50db839ebd776"
    },
    {
        "en": "“If you want to see a rainbow, you must go through the rain.”",
        "vi": "Nếu muốn nhìn thấy cầu vồng bạn phải đi qua những cơn mưa.",
        "id": "eada237a6eb7437c91e82fd66e3faa57"
    },
    {
        "en": "Light travels faster than sound. This is why some people appear bright until you hear them speak . — Alan Dundes",
        "vi": "Ánh sáng có tốc độ nhanh hơn âm thanh. Vì thế mà một vài người lúc xuất hiện thì sáng bừng cho tới khi bạn nghe được giọng của họ.",
        "id": "0a62826ddcce4a509d30aa5cabe5a6ed"
    },
    {
        "en": "“Silence is the most powerful scream.”",
        "vi": "Im lặng là tiếng gào thét mạnh mẽ nhất.",
        "id": "d606544fe29248669030233780f5fc61"
    },
    {
        "en": "Facebook just sounds like a drag, in my day seeing pictures of peoples vacations was considered a punishment. — Betty White",
        "vi": "Facebook giống như một cái lưỡi rê vậy, nhìn ảnh mọi người đi nghỉ mát cứ như thể một hình phạt.",
        "id": "6bb4e3f8f31d41e49e33ab3b5e77bce4"
    },
    {
        "en": "“A laugh, to be joyous, must flow from a joyous heart, for without kindness, there can be no true joy.”",
        "vi": "Một tiếng cười trở nên vui sướng chỉ khi nó xuất phát từ một trái tim vui sướng, bởi không có sự tử tế thì không thể có niềm vui thực sự.",
        "id": "c2b21c92cada41c4bb7739fc5caea099"
    },
    {
        "en": "Money won’t buy happiness, but it will pay the salaries of a large research staff to study the problem. — Bill Vaughan",
        "vi": "Tiền không mua được hạnh phúc nhưng nó sẽ trả được lương cho lượng lớn nhân viên để nghiên cứu về vấn đề.",
        "id": "b5ba57178ea84dab9b154e3bbe2c6267"
    },
    {
        "en": "“An unclear relationship just like an empty petrol vehicle. You can sit on it as long as you like, but it will not take you anywhere.”",
        "vi": "Một mối quan hệ không rõ ràng cũng giống như một chiếc xe cạn xăng. Bạn có thể ngồi trên đó bao lâu bạn thích, nhưng nó sẽ không đưa bạn đi đến đâu cả.",
        "id": "be9a65ea59c545e5870afcd60f61a26c"
    },
    {
        "en": "I’m going to stand outside. So If anyone asks, I am outstanding",
        "vi": "Tôi sẽ đứng ở ngoài thôi và nếu có ai hỏi thì tôi nói là tôi nổi bật đấy.",
        "id": "b0491285a4a3423daf7582a72a611b96"
    },
    {
        "en": "“Sometimes what you want isn’t what you get, but what you get in the end is so much better than what you wanted.”",
        "vi": "Đôi khi những gì bạn muốn không phải là những gì bạn nhận được, nhưng những gì bạn nhận được cuối cùng tốt hơn rất nhiều so với những gì bạn muốn.",
        "id": "76b00cbda01a4890bce18e40aff1af79"
    },
    {
        "en": "“In fact, in this world no one is stupid or smart, but people are honest or sly.”",
        "vi": "Có một sự thật rằng trên đời này không người ngu ngốc hay kẻ thông minh, chỉ có người thật thà và kẻ ranh mãnh.",
        "id": "d5ca6294a1b64116b6a9a8c4d40e6c45"
    },
    {
        "en": "Behind every successful man stands a surprised mother-in-law. — Hubert Humphrey",
        "vi": "Đằng sau mỗi người đàn ông thành công thường là một người mẹ vợ đáng kinh ngạc.",
        "id": "905ddc3d88b5464b8dac71766b736908"
    },
    {
        "en": "“We could never learn to be brave and patient, if there were only joy in the world.”",
        "vi": "Chúng ta không bao giờ có thể học được sự can đảm và kiên nhẫn nếu thế gian này chỉ có những niềm vui.",
        "id": "11d874e7265049668e0b29e14989b0fb"
    },
    {
        "en": "The man who can smile when things go wrong has thought of someone else he can blame it on —Robert Bloch",
        "vi": "Người đàn ông mà có thể mỉm cười khi mọi việc trở nên tồi tệ là vì anh ta đã nghĩ đến người mà anh ta có thể đổ lỗi lên họ.",
        "id": "435597c1efcc458bb09d0d8e71562ada"
    },
    {
        "en": "“Patience is not the ability to wait , but the ability to keep a good attitude while waiting.”",
        "vi": "Kiên nhẫn không chỉ là khả năng bạn đợi được trong bao lâu, mà là khả năng giữ được thái độ bình tâm trong lúc chờ đợi.",
        "id": "1baaeab2257b46108a35919b9b6f0ce2"
    },
    {
        "en": "“When life gives you a hundred reasons to cry, show life that you have a thousand reasons to smile.”",
        "vi": "Khi cuộc đời cho bạn cả trăm lý do để khóc, hãy cho đời thấy bạn có cả ngàn lý do để cười.",
        "id": "2b1b64c808924229835f3b39c0f089bc"
    },
    {
        "en": "Men are like bank accounts. Without a lot of money they don’t generate a lot of interest. —Anonymous",
        "vi": "Đàn ông như thể những tài khoản ngân hàng. Nếu không có nhiều tiền thì họ sẽ không tạo ra được nhiều mối quan tâm.",
        "id": "ce0f4b5aa97e4b6094a639321958cd51"
    },
    {
        "en": "“Smile, even if it’s a sad smile, because sadder than a sad smile is the sadness of not knowing how to smile.”",
        "vi": "Hãy cười, thậm chí dù đó là nụ cười buồn bã, bởi còn đáng buồn hơn nụ cười buồn bã là sự bi thảm vì không biết phải cười thế nào.",
        "id": "e068a834f38d4a77928f74f8efd43d9b"
    },
    {
        "en": "Men marry women with the hope they will never change. Women marry men with the hope they will change. Invariably they are both disappointed. ― Albert Einstein",
        "vi": "Người đàn ông cưới phụ nữ với hy vọng họ sẽ không bao giờ thay đổi. Phụ nữ cưới đàn ông với hy vọng họ sẽ thay đổi. Và luôn luôn là vậy, cả hai bên đều cùng thất vọng.",
        "id": "3cd4ea177f2e4f0188d59f79225edb11"
    },
    {
        "en": "“An intelligent person is like a river, the deeper the less noise.”",
        "vi": "Người thông minh giống như một dòng sông, càng sâu càng lặng lẽ.",
        "id": "58e7ece3817248599a3e819a2b7a1f72"
    },
    {
        "en": "Do not argue with an idiot. He will drag you down to his level and beat you with experience. ― Anonymous",
        "vi": "Đừng tranh cãi với kẻ ngốc. Anh ta sẽ kéo bạn xuống trình độ của mình và đánh bại bạn với kinh nghiệm.",
        "id": "eb07d6a096644a35a429d03b63acb92b"
    },
    {
        "en": "“Never say all you know. And never believe all you hear.”",
        "vi": "Đừng bao giờ nói tất cả những gì bạn biết. Và đừng bao giờ tin tất cả những gì bạn nghe.",
        "id": "a5e308c9698e4855b60fabb4033d80e2"
    },
    {
        "en": "Death is life’s way of telling you you’ve been fired. ― R. Geis",
        "vi": "Cái chết là cách mà cuộc sống nói với bạn rằng bạn đã bị sa thải.",
        "id": "94cc4d7b956e41ddaa2bc8ca70b9c163"
    },
    {
        "en": "“Life is the greatest journey you will be ever on.”",
        "vi": "Cuộc sống là hành trình vĩ đại nhất mà bạn từng trải qua.",
        "id": "f63ec9e57ea646f4964d586169a39829"
    },
    {
        "en": "People often say that motivation doesn’t last. Well, neither does bathing – that’s why we recommend it daily. —Zig Ziglar",
        "vi": "Mọi người thường nói rằng động lực không tồn tại mãi. Việc tắm rửa cũng vậy, vì thế mà chúng ta mới gợi ý là nó phải được làm hàng ngày.",
        "id": "109975b1d0364b7e9656e0158983af70"
    },
    {
        "en": "“It’s better to know and be disappointed, than to never know and always wonder.!”",
        "vi": "Thà biết rồi thất vọng còn hơn không bao giờ biết và luôn băn khoăn.",
        "id": "ef0431274a364dc3ac64e94d0be21c86"
    },
    {
        "en": "Don’t worry about the world coming to an end today. It’s already tomorrow in Australia. — Charles Schulz",
        "vi": "Đừng lo lắng về việc thế giới sẽ kết thúc hôm nay. Bởi nó đã là ngày mai ở Úc rồi.",
        "id": "0cc271e478c24db1a4713e91d2a1bbe0"
    },
    {
        "en": "“Sadness flies away on the wings of time.”",
        "vi": "Nỗi buồn bay đi trên đôi cánh của thời gian.",
        "id": "7c08ba69c9a04af885cd80f1a2db22b8"
    },
    {
        "en": "Whoever said, “It’s not whether you win or lose that counts”, probably lost. — Martina Navratilova",
        "vi": "Bất kỳ ai nói rằng thắng bại không quan trọng thì chắc chắn đã thất bại.",
        "id": "6bc46363fa3540cf972d76716d5df1eb"
    },
    {
        "en": "“Don’t let your dreams just be dreams”",
        "vi": "Đừng để những giấc mơ của bạn chỉ là những giấc mơ!",
        "id": "e62aba8b1215437e9fcb00e9e3c5b4a0"
    },
    {
        "en": "Even if you are on the right track, you’ll get run over if you just sit there. — Will Rogers",
        "vi": "Kể cả khi bạn đi đúng hướng rồi thì bạn sẽ phải làm lại nếu bạn vẫn chỉ ngồi đó.",
        "id": "5209aabcf80c42c89689bc439a38179a"
    },
    {
        "en": "“Peace does not mean the one where no noise, no trouble, and no toil. When we are in a storm, we still feel the calm of mind. That is the real meaning of peace.!”",
        "vi": "Bình yên không có nghĩa là nơi không có những ồn ào, chăng có khó khăn hay cực nhọc. Bình yên là khi ta đang ở trong phong ba bão táp, vẫn cảm thấy sự an nhiên trong tâm hồn. Đó mới chính là ý nghĩa thực sự của sự bình yên.!",
        "id": "c18b55fdf527458d8a9d7c773201650c"
    },
    {
        "en": "I wake up every morning at nine and grab for the morning paper. Then I look at the obituary page. If my name is not on it, I get up. — Benjamin Franklin",
        "vi": "Tôi thức dậy mỗi sáng vào lúc 9h và cầm lấy tờ báo. Sau đó tôi nhìn vào trang cáo phó. Nếu tên tôi không ở trên đó thì tôi dậy.",
        "id": "fa6988a636f44879b4d1f6e92b4e1e27"
    },
    {
        "en": "Life is short, smile while you still have teeth",
        "vi": "Cuộc đời ngắn lắm, hãy cười khi bạn vẫn còn răng.",
        "id": "63fb8044198842cbab210d924aaa65b0"
    },
    {
        "en": "A man falls in love through his eyes, a woman through her ears",
        "vi": "Con gái yêu bằng tai, con trai yêu bằng mắt",
        "id": "e162e95319434c42bbbc69c6df7fd9d6"
    },
    {
        "en": "You know when you love someone when you want them to be happy event if their happiness means that you’re not part of it",
        "vi": "Yêu là tìm thấy hạnh phúc của mình trong hạnh phúc của người mình yêu",
        "id": "96cf81b750b6426184b7b29fa5b9a161"
    },
    {
        "en": "How can you love another if you don’t love yourself",
        "vi": "Làm sao bạn có thể yêu người khác nếu bạn không yêu chính mình?",
        "id": "74b0101bf5a245c699afc4d8a0118506"
    },
    {
        "en": "Hate has a reason for everything but love is unreasonable",
        "vi": "Ghét ai thì có thể nêu lý do nhưng yêu ai thì không thể",
        "id": "bdb42ab0263341ce93337dc8fe4142d1"
    },
    {
        "en": "A great love is not one who loves many, but one who loves one woman for life",
        "vi": "Tình yêu lớn không phải là yêu nhiều người mà yêu một người suốt cả cuộc đời",
        "id": "84ae88d404784a59b7c15f48ed213837"
    },
    {
        "en": "Can I say I love you today? If not, can I ask you again tomorrow? And the day after tomorrow? And the day after that? Coz I’ll be loving you every single day of my life?",
        "vi": "Hôm nay anh có thể nói yêu em chứ? Nếu không, anh có thể hỏi em một lần nữa vào ngày mai? Ngày kia? Ngày kìa? Bởi vì anh yêu em mỗi ngày trong đời",
        "id": "84d73c147b324eeaa5cda3962998af05"
    },
    {
        "en": "Love means you never have to say you’re sorry",
        "vi": "Yêu nghĩa là không bao giờ phải nói rất tiếc",
        "id": "055d5f1461a0492293998ac3dd4b6861"
    },
    {
        "en": "I would rather be poor and in love with you, than being rich and not having anyone",
        "vi": "Thà nghèo mà có tình yêu còn hơn giàu có mà đơn độc",
        "id": "da0ff80b9cc6470eb40e71e09b04edfb"
    },
    {
        "en": "No man or woman is worth you tears, and the one who is, won’t make you cry",
        "vi": "Không có ai xứng đáng với những giọt nước mắt của bạn vì người xứng đáng sẽ không làm bạn phải khóc",
        "id": "380219cf7a2c4ab2b78cd087721796e1"
    },
    {
        "en": "To the world you may be one person, but to one person you may be the world",
        "vi": "Đối với thế giới bạn chỉ là một con người nhỏ bé, nhưng đối với ai đó bạn là cả thế giới của họ",
        "id": "495aa9727bb749b28277c517858b5bc7"
    },
    {
        "en": "Friendship often ends in love, but love in friendship never",
        "vi": "Tình bạn có thể đi đến tình yêu, nhưng không có điều ngược lại",
        "id": "79320734f75a465ab9506fa3155e12bb"
    },
    {
        "en": "Don’t stop giving love even if you don’t receive it. Smile and have patience",
        "vi": "Đừng từ bỏ tình yêu cho dù bạn không nhận được nó. Hãy mỉm cười và kiên nhẫn",
        "id": "c82f03b6288b4910917da0841d55504f"
    },
    {
        "en": "I’d give up my life if I could command one smile of your eyes, one touch of your hand",
        "vi": "Anh sẽ cho em tất cả cuộc đời này để được nhìn em cười, được nắm bàn tay em",
        "id": "a35d2d1a77a243f88599b06f17e03dd7"
    },
    {
        "en": "It only takes a second to say I love you, but it will take a lifetime to show you how much",
        "vi": "Chỉ mất vài giây để nói anh yêu em nhưng mất cả đời để chứng tỏ điều đó",
        "id": "8a2e4eeb29294ef6a1aa40222ad99bfa"
    },
    {
        "en": "Don’t waste your time on a man/woman, who isn’t willing to waste their time on you",
        "vi": "Đừng lãng phí thời gian với người không sẵn lòng dành thời gian cho bạn",
        "id": "5ed6d36299c6451284748d58d83dabf0"
    },
    {
        "en": "I love you with know how, why ,or even from where…",
        "vi": "Anh yêu em mà không biết tại sao, bằng cách nào và thậm chí từ đâu.",
        "id": "18980c08a5044400852550c8f7f7e67c"
    },
    {
        "en": "Nothing in life is to be feared, it’s to be understood. Now is the time to understand more, so that we may fear less. – Marie Curie",
        "vi": "Cuộc sống không phải để sợ, mà là để hiểu. Đây chính là lúc chúng ta cần phải tìm hiểu nhiều hơn về cuộc sống để làm vơi bớt mọi nỗi sợ hãi",
        "id": "26c7eec53ed747c6a3c4c88bf716ee57"
    },
    {
        "en": "How wonderful life is, now you are in the world.",
        "vi": "Điều tuyệt vời nhất trong cuộc sống là bạn đã có mặt trên thế giới này.",
        "id": "a7a705b55a1146738519ab7e91ca32fa"
    },
    {
        "en": "What we think determines what happens to us, so if we want to change our lives, we need to stretch our minds – Wayne Dyer",
        "vi": "Những điều chúng ta nghĩ quyết định những điều sẽ xảy ra với chúng ta, và vì thế nếu chúng ta muốn thay đổi cuộc sống, chúng ta cần phải thay đổi từ cách suy nghĩ của chúng ta.",
        "id": "c91ff0f8de7e4cd2bc27ed6cca860d23"
    },
    {
        "en": "Life is a dream for the wise, a game for the fool, a comedy for the rich, a tragedy for the poor.",
        "vi": "Cuộc sống là 1 giấc mơ cho những người khôn ngoan, là trò chơi cho những kẻ ngốc, là 1 vở hài kịch cho người giàu, là 1 bi kịch cho người nghèo.",
        "id": "0c954cd05ec644438f523169498862e7"
    },
    {
        "en": "Not everyone is meant to be in your future. Some people are just passing through to teach you lessons in life.",
        "vi": "Không phải ai cũng là tương lai của bạn. Một vài người chỉ lướt qua cuộc đời bạn để mang lại cho bạn một số bài học của cuộc sống.",
        "id": "1797eebe7c194792b9f3bcf189b4f154"
    },
    {
        "en": "You’ll never be brave if you don’t get hurt You’ll never learn if you don’t make mistakes You’ll never be successful if you don’t encounter failure.",
        "vi": "Bạn sẽ không bao giờ có dũng cảm nếu bạn không bị tổn thương. Bạn sẽ không bao giờ học hỏi được điều gì nếu bạn không mắc sai lầm. Bạn sẽ không bao giờ thành công nếu như bạn không gặp thất bại.",
        "id": "8fb62ec53b774b788015587390e14fd5"
    },
    {
        "en": "Life is short. Don’t be lazy.",
        "vi": "Cuộc sống ngắn lắm, vì thế đừng lười biếng.",
        "id": "48c2c29579954acdae6d5cdee641b59e"
    },
    {
        "en": "I have a simple philosophy: Fill what’s empty. Empty what’s full. Scratch where it itches. – Alice Roosevelt",
        "vi": "Tôi có một triết lý đơn giản đó là: lấp đầy những khoảng trống, làm trống những khoảng đầy và gãi những chỗ ngứa.",
        "id": "c0c8ceaab02345bcac3a23db1ca14766"
    },
    {
        "en": "Don’t wait for the perfect moment, take the moment and make it perfect.",
        "vi": "Đừng chờ đợi những khoảnh khắc tuyệt vời, hãy tự mình biến mọi khoảnh khắc trở nên tuyệt vời.",
        "id": "e746ddd2d0004860a2ac7d3d2cd1c2e9"
    },
    {
        "en": "Life is 10% what happens to you and 90% how you respond to it. – Lou Holtz",
        "vi": "Cuộc sống có 10% là những gì xảy đến với chúng ta và 90% là cách chúng ta đáp lại những điều đó.",
        "id": "883761d702a14e5c83eb6c48a11a14cb"
    },
    {
        "en": "Life is a story make yours the best seller.",
        "vi": "Cuộc đời là một câu chuyên bán chạy nhất",
        "id": "c07b0ed52f224804acf68d82d94d36e5"
    },
    {
        "en": "Love conquers all. – Virgil",
        "vi": "Tình yêu sẽ chiến thắng tất cả.",
        "id": "39823ab5ca764290985ab8eb6e6a6142"
    },
    {
        "en": "Don’t cry over the past, it’s gone. Don’t stress about the future, it hasn’t arrived. Live in the present and make it beautiful.",
        "vi": "Đừng khóc tiếc nuối cho những gì đã xảy ra trong quá khứ. Đừng căng thẳng cho những việc chưa xảy ra trong tương lai. Hãy sống trọn vẹn ở thời điểm hiện tại và làm nó thật tươi đẹp.",
        "id": "534303280920450d92166559425e8249"
    },
    {
        "en": "Enjoy the little things in life, for one day you may look back and realize they were the big things. – Robert Brault",
        "vi": "Hãy tận hưởng những điều nhỏ nhặt trong cuộc sống bởi vì một ngày bạn sẽ nhìn lại và nhận ra chúng là những điều thật sự lớn lao.",
        "id": "e3942bd052c0456aa2d6b319e7ccabe6"
    },
    {
        "en": "People have different reasons for the way they live their life. You cannot put everyone’s reasons in the same box. – Kevin Spacey",
        "vi": "Mỗi người có thể có những lý do khác nhau để sống cuộc sống của chính họ. Bạn không thể quy chụp rằng tất cả những lý do đó đều giống nhau",
        "id": "db7636297c94475081e4a54e32067fb6"
    },
    {
        "en": "Learn from yesterday, live for today, hope for tomorrow. The important is to not stop questioning. – Albert Einstein",
        "vi": "Học hỏi từ quá khứ, sống cho hiện tại, hy vọng về tương lai. Điều quan trọng là đừng bao giờ ngừng đặt câu hỏi.",
        "id": "484273cfdc5e44ea878eeb0bdcdab5dc"
    },
    {
        "en": "It’s better to cross the line and suffer the consequences than to just stare at the line for the rest of your life.",
        "vi": "Thà dám thử và chấp nhận hậu quả còn hơn là đứng ngó mà không dám làm gì trong suốt quãng đời còn lại.",
        "id": "e7a15afe2c104df9934b703c9bca65d5"
    },
    {
        "en": "Life is not about waiting for the storm to pass, it’s about learning to dance in the rain.",
        "vi": "Cuộc sống không phải là chờ đợi cơn bão qua, mà là học cách nhảy trong vũ bão.",
        "id": "52a2d2c62c7448ecab9079c16bb54ca8"
    },
    {
        "en": "If you don’t do wild things while you’re young, you will have nothing to smile about when you’re old.",
        "vi": "Nếu bạn không thử làm vài thứ táo bạo ở tuổi thanh xuân, bạn sẽ chẳng có gì để nhớ đến và mỉm cười vào tuổi xế chiều",
        "id": "1485be86babf472b943e11934d7ecc59"
    },
    {
        "en": "Every struggle in your life has shaped you into the person you are today. Be thankful for the hard times, they can only make you stronger.",
        "vi": "Mỗi cuộc đấu tranh trong cuộc sống đã hình thành nên bạn của ngày hôm nay. Hãy cảm ơn những lúc khó khăn, vì chúng khiến bạn trở nên mạnh mẽ hơn.",
        "id": "45346587d0b04a9abf300f0337b3aad1"
    },
    {
        "en": "There is enough in this world for everybody’s need, but not enough for certain people’s greed.",
        "vi": "Thế giới có đủ cho nhu cầu của tất cả mọi người, nhưng không đủ cho lòng tham của một số người.",
        "id": "cdb502fae11e4b65ac4df1144ae30907"
    },
    {
        "en": "Enjoy the little things in life for one day you’ll look back and realize they were the big things.",
        "vi": "Hãy tận hưởng những điều nhỏ nhặt trong cuộc sống bởi vì một ngày bạn sẽ nhìn lại và nhận ra họ là những điều thật sự lớn lao",
        "id": "fa9521c73d214cb69d8c3e99818bb4c8"
    },
    {
        "en": "Life is not about waitng for the storm to pass, it’s about learning to dance in the rain.",
        "vi": "Cuộc sống không phải là chờ đợi những khó khăn đi qua để vượt qua, mà là cách bạn học được những cách vượt qua nó.",
        "id": "4128e4dc8a9c47388890f355004a1710"
    },
    {
        "en": "It’s really amazing when two stranges become the best of friends, but it’s really sad when the best of friends become two strangers.",
        "vi": "Thật tuyệt diệu khi hai người lạ trở thành bạn tốt của nhau, nhưng thật buồn khi hai người bạn tốt trở thành hai người lạ.",
        "id": "9a35e73b48d845119ac89edece7a2cc6"
    },
    {
        "en": "Friendship… is not something you learn in school. But if you haven’t learned the meaning of friendship, you really haven’t learned anything.",
        "vi": "Tình bạn … không phải là cái gì đó bạn học được ở trường học. Thế nhưng nếu bạn không biết được ý nghĩa của nó thì thực sự bạn không học được gì cả",
        "id": "e66e91da9e00407798382a37f888d692"
    },
    {
        "en": "Don’t walk behind me; I may not lead. Don’t walk in front of me; I may not follow. Just walk beside me and be my friend.",
        "vi": "Đừng đi theo sau tôi, tôi không phải người dẫn đường. Đừng đi trước tôi, tôi không thể đi theo. Chỉ cần bên cạnh tôi và là bạn của tôi",
        "id": "29b4ab2657084dd58b8aa01cef326ba7"
    },
    {
        "en": "Love is the only force capable of transforming an enemy into friend.",
        "vi": "Tình yêu là một thế lực duy nhất có thể biến kẻ thù thành tình bạn.",
        "id": "a85da42b7fed4a90863e2a329745153b"
    },
    {
        "en": "Two persons cannot long be friends if they cannot forgive each other’s little failings.",
        "vi": "Hai người không thể trở thành bạn lâu dài nếu như họ không thể tha thứ cho những thiếu sót nhỏ của nhau.",
        "id": "d45ec4b385d941a38ff365ea61e96b35"
    },
    {
        "en": "Count your age by friends, not years Count your life by smiles, not tears.",
        "vi": "Hãy đếm tuổi của bạn bằng số bạn bè chứ không phải số năm. Hãy đếm cuộc đời bạn bằng nụ cười chứ không phải bằng nước mắt.",
        "id": "a227eee140df470ebfa8b827409f258d"
    },
    {
        "en": "Don’t be dismayed at goodbyes, a farewell is necessary before you can meet again and meeting again, after moments or lifetimes, is certain for those who are friends – Richard Bach",
        "vi": "Đừng âu sầu khi nói lời tạm biệt, lời tạm biệt là cần thiết trước khi ta có thể gặp lại nhau, và gặp lại nhau, cho dù sau khoảng thời gian ngắn ngủi hay sau cả một đời, là điều chắc chắn sẽ xảy ra với những người bạn hữu.",
        "id": "e668b6ae822c478a81b4e11f3dbaf8af"
    },
    {
        "en": "If all my friends jumped off a bridge, I wouldn’t follow, I’d be the one at the bottom to catch them when they fall.",
        "vi": "Nếu tất cả bạn bè tôi nhảy khỏi cây cầu, tôi sẽ không theo đâu, tôi sẽ là người ở bên dưới để đón họ khi họ rơi xuống.",
        "id": "f9a469d50a7d4d72bebafd9f82ce1dd3"
    },
    {
        "en": "A friendship can weather most things and thrive in thin soil; but it needs a little mulch of letters and phone calls and small, silly presents every so often – just to save it from drying out completely.",
        "vi": "Tình bạn có thể vượt qua hầu hết mọi thứ và phát triển trên mảnh đất cằn cỗi; nhưng nó cần thỉnh thoảng bồi phủ một chút với thư từ và các cuộc điện thoại và những món quà nhỏ bé ngớ ngẩn để nó không chết khô.",
        "id": "e69a88fae0d14568a2906b62d9ab34d6"
    },
    {
        "en": "Much of the vitality in a friendship lies in the honouring of differences, not simply in the enjoyment of similarities.",
        "vi": "Phần lớn sức sống của tình bạn nằm trong việc tôn trọng sự khác biệt, không chỉ đơn giản là thưởng thức sự tương đồng.",
        "id": "aaca3ddc88764ea9a9db3d097b49c80d"
    },
    {
        "en": "A friend is one with whom you are comfortable, to whom you are loyal, through whom you are blessed, and for whom you are grateful. – William Arthur Ward",
        "vi": "Bạn là người ta cảm thấy thoải mái khi ở cùng, ta sẵn lòng trung thành, đem lại cho ta lời chúc phúc và ta cảm thấy biết ơn vì có họ trong đời.",
        "id": "360b1840f45e4dc69f55afbbd97bcdce"
    },
    {
        "en": "True friendship continues to grow even over the longest distance. Same goes for true love.",
        "vi": "Tình bạn thật sự vẫn tiếp tục phát triển, dù qua khoảng cách xa nhất . Tình yêu thật sự cũng thế",
        "id": "33c86f4b152147a084413cb4752317b1"
    },
    {
        "en": "If you never had Friends, you never lived life",
        "vi": "Nếu bạn không có bạn bè thì bạn chưa bao giờ sống thực sự trên cuộc đời này",
        "id": "1ba48fc3feda41acb004ed83484fbc8f"
    },
    {
        "en": "“Best friends are the people in your life that make you laugh louder, smile brighter and live better”",
        "vi": "Những người bạn tốt nhất trong cuộc đời là những người khiến chúng ta cười lớn hơn, cười tươi hơn và sống tốt hơn",
        "id": "5e91b20aaff24ab582aefc3b2897206d"
    },
    {
        "en": "Friendship starts with a smile, grows with talking and hang around, ends with a death.",
        "vi": "Tình bạn bắt đầu bằng nụ cười, tiến triển bằng những câu chuyện và kết thúc khi chúng ta không còn sống",
        "id": "9af2b8f53a4c4d94889860621c824d92"
    },
    {
        "en": "Best friends make the bad times good and the good times unforgettable”",
        "vi": "Bạn tốt sẽ biến những khoảnh khắc tồi tệ thành khoảnh khắc ý nghĩa và khoảnh khắc ý nghĩa thành không bao giờ có thể quên",
        "id": "4668a8cff3a649ab8909be65e90f6a90"
    },
    {
        "en": "A sweet friendship refreshes the soul",
        "vi": "Những tình bạn ngọt ngào luôn làm mới tâm hồn bạn",
        "id": "391e7b08f8e64725b84bf7896dd6be68"
    },
    {
        "en": "To like and dislike the same things, that is indeed true friendship .",
        "vi": "Yêu và ghét cùng một thứ, đó mới chính là tình bạn thật sự",
        "id": "db8e6418e59b48e0828373d12c0d6078"
    },
    {
        "en": "Happy is the home that shelters a friend! It might well be built, like a festal bower or arch to entertain him a single day.",
        "vi": "Hạnh phúc thay cho mái nhà nào che chở một người bạn. Nếu được thì cũng đáng xây nên một lâu đài tráng lệ để tiếp đón bạn dù chỉ trong một ngày",
        "id": "35b81239b76c4bdcbf906fac728d61f0"
    },
    {
        "en": "Be slow in choosing a friend but slower in changing him.",
        "vi": "Hãy từ từ chọn bạn, khi thay bạn cũng phải từ từ hơn",
        "id": "5a39e9f8faa740978f6a2c28b163a312"
    },
    {
        "en": "Walking with a friend in the dark is better than walking alone in the light.",
        "vi": "Cùng bước với một người bạn trong bóng tối tốt hơn là bước một mình trong ánh sáng",
        "id": "fe01d47c255d4b27ad068e2aa74c7916"
    },
    {
        "en": "It’s really amazing when two strangers become the best of friends, but it’s really sad when the best of friends become two strangers.",
        "vi": "Thật tuyệt diệu khi hai người lạ trở thành bạn tốt của nhau, nhưng thật buồn khi hai người bạn tốt trở thành hai người lạ.",
        "id": "eb260ad3edbb40ec8385e325ba1fc53d"
    }
]