[
    {
        "id": "f81b4d9191224302af90979bd535321e",
        "word": "congratulation",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/kənˌɡrætʃəˈleɪʃn/",
            "us": "/kənˌɡrætʃəˈleɪʃn/"
        },
        "nearby": [
            {
                "word": "congrats",
                "pos": "noun"
            },
            {
                "word": "congratulate",
                "pos": "verb"
            },
            {
                "word": "congratulation",
                "pos": "noun"
            },
            {
                "word": "congratulatory",
                "pos": "adjective"
            },
            {
                "word": "congregant",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a message congratulating somebody (= saying that you are happy about their good luck or success)",
                    "vi": "một tin nhắn chúc mừng ai đó (= nói rằng bạn rất vui về sự may mắn hoặc thành công của họ)"
                },
                "examples": [
                    {
                        "en": "to offer/send your congratulations to somebody",
                        "vi": "để cung cấp / gửi lời chúc mừng của bạn đến ai đó"
                    }
                ]
            },
            {
                "define": {
                    "en": "used when you want to congratulate somebody",
                    "vi": "được sử dụng khi bạn muốn chúc mừng ai đó"
                },
                "examples": [
                    {
                        "en": "‘We're getting married!’ ‘Congratulations!’",
                        "vi": "Chúng ta sẽ làm đám cưới!' 'Xin chúc mừng!'"
                    },
                    {
                        "en": "Congratulations on your exam results!",
                        "vi": "Xin chúc mừng kết quả kỳ thi của bạn!"
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of congratulating somebody",
                    "vi": "hành động chúc mừng ai đó"
                },
                "examples": [
                    {
                        "en": "a letter of congratulation",
                        "vi": "một lá thư chúc mừng"
                    }
                ]
            }
        ]
    },
    {
        "id": "162bba50e6b54b22b0617c8314317ff6",
        "word": "respect",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/rɪˈspekt/",
            "us": "/rɪˈspekt/"
        },
        "nearby": [
            {
                "word": "resourcefulness",
                "pos": "noun"
            },
            {
                "word": "respawn",
                "pos": "verb"
            },
            {
                "word": "respect",
                "pos": "noun"
            },
            {
                "word": "respect",
                "pos": "verb"
            },
            {
                "word": "Respect",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a strong feeling of approval of somebody/something because of their good qualities or achievements",
                    "vi": "cảm giác tán thành mạnh mẽ của ai đó / điều gì đó vì những phẩm chất tốt hoặc thành tích của họ"
                },
                "examples": [
                    {
                        "en": "I have the utmost respect for her and her work.",
                        "vi": "Tôi dành sự tôn trọng tối đa cho cô ấy và công việc của cô ấy."
                    },
                    {
                        "en": "They feel a deep and mutual respect for each other.",
                        "vi": "Họ cảm thấy sâu sắc và tôn trọng lẫn nhau."
                    },
                    {
                        "en": "It was a noble effort that deserves respect.",
                        "vi": "Đó là một nỗ lực cao quý đáng được trân trọng."
                    },
                    {
                        "en": "She soon earned the respect of her colleagues.",
                        "vi": "Cô sớm nhận được sự kính trọng của đồng nghiệp."
                    },
                    {
                        "en": "You did a great job. Respect! (= used to praise somebody)",
                        "vi": "Bạn đã làm một công việc tuyệt vời. Kính trọng! (= dùng để khen ai đó)"
                    }
                ]
            },
            {
                "define": {
                    "en": "polite behaviour towards or care for somebody/something that you think is important",
                    "vi": "cư xử lịch sự đối với hoặc quan tâm đến ai đó / điều gì đó mà bạn nghĩ là quan trọng"
                },
                "examples": [
                    {
                        "en": "respect for somebody/something to show a lack of respect for authority",
                        "vi": "tôn trọng ai đó / cái gì đó để thể hiện sự thiếu tôn trọng đối với thẩm quyền"
                    },
                    {
                        "en": "They have a deep respect for the natural world.",
                        "vi": "Họ có một sự tôn trọng sâu sắc đối với thế giới tự nhiên."
                    },
                    {
                        "en": "He has no respect for her feelings.",
                        "vi": "Anh không tôn trọng cảm xúc của cô."
                    },
                    {
                        "en": "Everyone has a right to be treated with respect.",
                        "vi": "Mọi người đều có quyền được đối xử tôn trọng."
                    },
                    {
                        "en": "A two-minute silence was held as a mark of respect.",
                        "vi": "Hai phút im lặng được tổ chức như một dấu hiệu của sự tôn trọng."
                    },
                    {
                        "en": "out of respect (for somebody/something) Out of respect for my friend, I didn't say anything.",
                        "vi": "hết tôn trọng (đối với ai đó / cái gì đó) Vì tôn trọng bạn tôi, tôi đã không nói gì cả."
                    }
                ]
            },
            {
                "define": {
                    "en": "a particular aspect or detail of something",
                    "vi": "một khía cạnh hoặc chi tiết cụ thể của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "In this respect we are very fortunate.",
                        "vi": "Về mặt này, chúng tôi rất may mắn."
                    },
                    {
                        "en": "This has been a difficult year in many respects.",
                        "vi": "Đây là một năm khó khăn về nhiều mặt."
                    },
                    {
                        "en": "There was one respect, however, in which they differed.",
                        "vi": "Tuy nhiên, có một sự tôn trọng mà chúng khác nhau."
                    }
                ]
            },
            {
                "define": {
                    "en": "about; relating to",
                    "vi": "xung quanh; liên quan đến"
                },
                "examples": [
                    {
                        "en": "A writ was served on the firm in respect of their unpaid bill.",
                        "vi": "Một công văn đã được đưa ra công ty liên quan đến hóa đơn chưa thanh toán của họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "in payment for something",
                    "vi": "thanh toán cho một cái gì đó"
                },
                "examples": [
                    {
                        "en": "money received in respect of overtime worked",
                        "vi": "tiền nhận được liên quan đến làm thêm giờ"
                    }
                ]
            },
            {
                "define": {
                    "en": "to visit somebody or to send a message of good wishes as a sign of respect for them",
                    "vi": "đến thăm ai đó hoặc gửi một tin nhắn chúc tốt đẹp như một dấu hiệu của sự tôn trọng dành cho họ"
                },
                "examples": [
                    {
                        "en": "Many came to pay their last respects (= by attending somebody's funeral).",
                        "vi": "Nhiều người đến để bày tỏ lòng kính trọng lần cuối (= bằng cách tham dự đám tang của ai đó)."
                    }
                ]
            },
            {
                "define": {
                    "en": "used when you are going to disagree, usually quite strongly, with somebody",
                    "vi": "được sử dụng khi bạn sẽ không đồng ý, thường là khá mạnh mẽ, với ai đó"
                },
                "examples": [
                    {
                        "en": "With all due respect, the figures simply do not support you on this.",
                        "vi": "Với tất cả sự tôn trọng, các số liệu chỉ đơn giản là không hỗ trợ bạn về điều này."
                    },
                    {
                        "en": "With all due respect, I think you've misunderstood what he said.",
                        "vi": "Với tất cả sự tôn trọng, tôi nghĩ bạn đã hiểu sai những gì anh ấy nói."
                    }
                ]
            },
            {
                "define": {
                    "en": "in connection with",
                    "vi": "kết nối với"
                },
                "examples": [
                    {
                        "en": "The two groups were similar with respect to income and status.",
                        "vi": "Hai nhóm tương tự nhau về thu nhập và địa vị."
                    }
                ]
            }
        ]
    },
    {
        "id": "ffdd1f7ebdd84c568012720b0961ef47",
        "word": "respect",
        "pos": "verb",
        "level": "b1",
        "phonetic": {
            "uk": "/rɪˈspekt/",
            "us": "/rɪˈspekt/"
        },
        "nearby": [
            {
                "word": "respawn",
                "pos": "verb"
            },
            {
                "word": "respect",
                "pos": "noun"
            },
            {
                "word": "respect",
                "pos": "verb"
            },
            {
                "word": "Respect",
                "pos": ""
            },
            {
                "word": "respectability",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to have a very good opinion of somebody/something; to admire somebody/something",
                    "vi": "để có một ý kiến rất tốt về ai đó / cái gì đó; ngưỡng mộ ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "I respect Jack's opinion on most subjects.",
                        "vi": "Tôi tôn trọng ý kiến của Jack về hầu hết các chủ đề."
                    },
                    {
                        "en": "She was a much loved and highly respected teacher.",
                        "vi": "Cô là một giáo viên được nhiều người yêu mến và kính trọng."
                    },
                    {
                        "en": "respect somebody/something for something She had always been honest with me, and I respect her for that.",
                        "vi": "tôn trọng ai đó / điều gì đó vì điều gì đó Cô ấy đã luôn thành thật với tôi và tôi tôn trọng cô ấy vì điều đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be careful about something; to make sure you do not do something that might be considered wrong",
                    "vi": "phải cẩn thận về một cái gì đó; để đảm bảo rằng bạn không làm điều gì đó có thể bị coi là sai"
                },
                "examples": [
                    {
                        "en": "Employers must respect employees' privacy.",
                        "vi": "Người sử dụng lao động phải tôn trọng quyền riêng tư của người lao động."
                    },
                    {
                        "en": "to respect other people’s property",
                        "vi": "tôn trọng tài sản của người khác"
                    },
                    {
                        "en": "I respect your right to disagree.",
                        "vi": "Tôi tôn trọng quyền không đồng ý của bạn."
                    },
                    {
                        "en": "She promised to respect our wishes.",
                        "vi": "Cô ấy hứa sẽ tôn trọng mong muốn của chúng tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to agree not to break a law, principle, etc.",
                    "vi": "đồng ý không vi phạm luật lệ, nguyên tắc, v.v."
                },
                "examples": [
                    {
                        "en": "The new leader has promised to respect the constitution.",
                        "vi": "Nhà lãnh đạo mới đã hứa sẽ tôn trọng hiến pháp."
                    },
                    {
                        "en": "The government has promised to respect human rights.",
                        "vi": "Chính phủ đã hứa sẽ tôn trọng nhân quyền."
                    }
                ]
            }
        ]
    },
    {
        "id": "86694dc3f1c341f9870b139dd466126b",
        "word": "certificate",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/səˈtɪfɪkət/",
            "us": "/sərˈtɪfɪkət/"
        },
        "nearby": [
            {
                "word": "certifiable",
                "pos": "adjective"
            },
            {
                "word": "certifiably",
                "pos": "adverb"
            },
            {
                "word": "certificate",
                "pos": "noun"
            },
            {
                "word": "certificate",
                "pos": "verb"
            },
            {
                "word": "certificated",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an official document that may be used to prove that the facts it states are true",
                    "vi": "một tài liệu chính thức có thể được sử dụng để chứng minh rằng các sự kiện nó nêu là đúng sự thật"
                },
                "examples": [
                    {
                        "en": "a birth/marriage/death certificate",
                        "vi": "giấy khai sinh / kết hôn / khai tử"
                    },
                    {
                        "en": "certificate of something a certificate of motor insurance",
                        "vi": "giấy chứng nhận của một cái gì đó một giấy chứng nhận bảo hiểm xe máy"
                    }
                ]
            },
            {
                "define": {
                    "en": "an official document proving that you have completed a course of study or passed an exam; a qualification obtained after a course of study or an exam",
                    "vi": "một tài liệu chính thức chứng minh rằng bạn đã hoàn thành một khóa học hoặc vượt qua một kỳ thi; một bằng cấp đạt được sau một khóa học hoặc một kỳ thi"
                },
                "examples": [
                    {
                        "en": "a Postgraduate Certificate in Education (= a British qualification for teachers)",
                        "vi": "Chứng chỉ Sau đại học về Giáo dục (= chứng chỉ của Anh dành cho giáo viên)"
                    },
                    {
                        "en": "certificate of something A certificate of completion will be issued to all who complete the course.",
                        "vi": "chứng chỉ về điều gì đó Chứng chỉ hoàn thành sẽ được cấp cho tất cả những ai hoàn thành khóa học."
                    }
                ]
            }
        ]
    },
    {
        "id": "3f407dc3b5c743699a6d1ab3374f0310",
        "word": "certificate",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/səˈtɪfɪkeɪt/",
            "us": "/sərˈtɪfɪkeɪt/"
        },
        "nearby": [
            {
                "word": "certifiably",
                "pos": "adverb"
            },
            {
                "word": "certificate",
                "pos": "noun"
            },
            {
                "word": "certificate",
                "pos": "verb"
            },
            {
                "word": "certificated",
                "pos": "adjective"
            },
            {
                "word": "certification",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to give somebody an official document proving that they have successfully completed a training course, especially for a particular profession",
                    "vi": "cung cấp cho ai đó một tài liệu chính thức chứng minh rằng họ đã hoàn thành thành công một khóa đào tạo, đặc biệt là đối với một nghề cụ thể"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "6f8f208b18f34c59a5108c11c52ee3e5",
        "word": "satisfaction",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˌsætɪsˈfækʃn/",
            "us": "/ˌsætɪsˈfækʃn/"
        },
        "nearby": [
            {
                "word": "satirist",
                "pos": "noun"
            },
            {
                "word": "satirize",
                "pos": "verb"
            },
            {
                "word": "satisfaction",
                "pos": "noun"
            },
            {
                "word": "satisfactorily",
                "pos": "adverb"
            },
            {
                "word": "satisfactory",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the good feeling that you have when you have achieved something or when something that you wanted to happen does happen; something that gives you this feeling",
                    "vi": "cảm giác tốt mà bạn có khi bạn đạt được điều gì đó hoặc khi điều gì đó bạn muốn xảy ra lại xảy ra; một cái gì đó mang lại cho bạn cảm giác này"
                },
                "examples": [
                    {
                        "en": "to gain/get/derive satisfaction from something",
                        "vi": "đạt được / có được / đạt được sự hài lòng từ một cái gì đó"
                    },
                    {
                        "en": "a look/smile of satisfaction",
                        "vi": "một cái nhìn / nụ cười hài lòng"
                    },
                    {
                        "en": "with satisfaction She looked back on her career with great satisfaction.",
                        "vi": "với sự hài lòng Cô ấy đã rất hài lòng nhìn lại sự nghiệp của mình."
                    },
                    {
                        "en": "He had the satisfaction of seeing his book become a bestseller.",
                        "vi": "Anh ấy hài lòng khi thấy cuốn sách của mình trở thành một cuốn sách bán chạy nhất."
                    },
                    {
                        "en": "She didn't want to give him the satisfaction of seeing her cry.",
                        "vi": "Cô không muốn cho anh ta sự thỏa mãn khi nhìn thấy cô khóc."
                    },
                    {
                        "en": "The company is trying to improve customer satisfaction.",
                        "vi": "Công ty đang cố gắng nâng cao sự hài lòng của khách hàng."
                    },
                    {
                        "en": "He was enjoying all the satisfactions of being a parent.",
                        "vi": "Anh ấy đang tận hưởng tất cả những gì thỏa mãn khi được làm cha mẹ."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of fulfilling a need or desire",
                    "vi": "hành động đáp ứng một nhu cầu hoặc mong muốn"
                },
                "examples": [
                    {
                        "en": "the satisfaction of sexual desires",
                        "vi": "sự thỏa mãn của ham muốn tình dục"
                    },
                    {
                        "en": "the satisfaction of your ambitions",
                        "vi": "sự hài lòng của những tham vọng của bạn"
                    }
                ]
            },
            {
                "define": {
                    "en": "an acceptable way of dealing with a complaint, a debt, an injury, etc.",
                    "vi": "một cách có thể chấp nhận được để giải quyết khiếu nại, nợ nần, thương tật, v.v."
                },
                "examples": [
                    {
                        "en": "I complained to the manager but I didn't get any satisfaction.",
                        "vi": "Tôi đã phàn nàn với người quản lý nhưng tôi không nhận được bất kỳ sự hài lòng nào."
                    },
                    {
                        "en": "They agreed on a payment of £200 in full satisfaction of the debt.",
                        "vi": "Họ đã đồng ý về một khoản thanh toán 200 bảng Anh với đầy đủ các khoản nợ."
                    }
                ]
            },
            {
                "define": {
                    "en": "if you do something to somebody’s satisfaction, they are pleased with it",
                    "vi": "nếu bạn làm điều gì đó cho sự hài lòng của ai đó, họ hài lòng với điều đó"
                },
                "examples": [
                    {
                        "en": "The affair was settled to the complete satisfaction of the client.",
                        "vi": "Sự việc đã được giải quyết để hoàn toàn hài lòng của khách hàng."
                    },
                    {
                        "en": "The matter was resolved to our general satisfaction.",
                        "vi": "Vấn đề đã được giải quyết cho sự hài lòng chung của chúng tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "if you prove something to somebody’s satisfaction, they believe or accept it",
                    "vi": "nếu bạn chứng minh điều gì đó để làm hài lòng ai đó, họ tin hoặc chấp nhận nó"
                },
                "examples": [
                    {
                        "en": "Can you demonstrate to our satisfaction that your story is true?",
                        "vi": "Bạn có thể chứng minh cho chúng tôi hài lòng rằng câu chuyện của bạn là sự thật không?"
                    }
                ]
            }
        ]
    },
    {
        "id": "10844d8d0cbc4cdbab66d8c53aa7d977",
        "word": "satisfied",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈsætɪsfaɪd/",
            "us": "/ˈsætɪsfaɪd/"
        },
        "nearby": [
            {
                "word": "satisfactorily",
                "pos": "adverb"
            },
            {
                "word": "satisfactory",
                "pos": "adjective"
            },
            {
                "word": "satisfied",
                "pos": "adjective"
            },
            {
                "word": "satisfy",
                "pos": "verb"
            },
            {
                "word": "satisfying",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "pleased because you have achieved something or because something that you wanted to happen has happened",
                    "vi": "hài lòng vì bạn đã đạt được điều gì đó hoặc vì điều gì đó bạn muốn xảy ra đã xảy ra"
                },
                "examples": [
                    {
                        "en": "a satisfied customer",
                        "vi": "một khách hàng hài lòng"
                    },
                    {
                        "en": "a satisfied smile",
                        "vi": "một nụ cười hài lòng"
                    },
                    {
                        "en": "satisfied with somebody/something She's never satisfied with what she's got.",
                        "vi": "hài lòng với ai đó / điều gì đó Cô ấy không bao giờ hài lòng với những gì cô ấy có."
                    },
                    {
                        "en": "The Olympic athlete was satisfied with her performance.",
                        "vi": "Vận động viên Olympic hài lòng với màn trình diễn của cô."
                    },
                    {
                        "en": "They were not satisfied with the outcome of the talks.",
                        "vi": "Họ không hài lòng với kết quả của cuộc đàm phán."
                    }
                ]
            },
            {
                "define": {
                    "en": "believing or accepting that something is true",
                    "vi": "tin tưởng hoặc chấp nhận rằng điều gì đó là sự thật"
                },
                "examples": [
                    {
                        "en": "satisfied (that)… I'm satisfied that they are telling the truth.",
                        "vi": "hài lòng (điều đó)… Tôi hài lòng vì họ đang nói sự thật."
                    },
                    {
                        "en": "Police were satisfied that the death was accidental.",
                        "vi": "Cảnh sát hài lòng rằng cái chết là tình cờ."
                    },
                    {
                        "en": "I am quite satisfied he will return to France.",
                        "vi": "Tôi khá hài lòng khi anh ấy sẽ trở lại Pháp."
                    },
                    {
                        "en": "satisfied with something She seemed satisfied with my explanation.",
                        "vi": "hài lòng với điều gì đó Cô ấy có vẻ hài lòng với lời giải thích của tôi."
                    },
                    {
                        "en": "The police are not satisfied with the answers they have received.",
                        "vi": "Cảnh sát không hài lòng với câu trả lời mà họ đã nhận được."
                    },
                    {
                        "en": "We are still not entirely satisfied with the explanation offered.",
                        "vi": "Chúng tôi vẫn chưa hoàn toàn hài lòng với lời giải thích được đưa ra."
                    },
                    {
                        "en": "satisfied of something (formal) You need to be satisfied of all the facts.",
                        "vi": "hài lòng về điều gì đó (chính thức) Bạn cần phải hài lòng về tất cả các sự kiện."
                    }
                ]
            }
        ]
    },
    {
        "id": "987a5ab0a4434250aadf9244f337b981",
        "word": "boast",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/bəʊst/",
            "us": "/bəʊst/"
        },
        "nearby": [
            {
                "word": "board up",
                "pos": "phrasal verb"
            },
            {
                "word": "boardwalk",
                "pos": "noun"
            },
            {
                "word": "boast",
                "pos": "verb"
            },
            {
                "word": "boast",
                "pos": "noun"
            },
            {
                "word": "boastful",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to talk in a way that shows you are too proud of something that you have or can do",
                    "vi": "nói theo cách thể hiện rằng bạn quá tự hào về điều gì đó mà bạn có hoặc có thể làm"
                },
                "examples": [
                    {
                        "en": "I don't want to boast, but I can actually speak six languages.",
                        "vi": "Tôi không muốn khoe khoang, nhưng tôi thực sự có thể nói sáu thứ tiếng."
                    },
                    {
                        "en": "boast about something She is always boasting about how wonderful her children are.",
                        "vi": "khoe khoang về điều gì đó Cô ấy luôn khoe khoang về những đứa con của cô ấy tuyệt vời như thế nào."
                    },
                    {
                        "en": "boast of something He openly boasted of his skill as a burglar.",
                        "vi": "khoe khoang điều gì đó Anh ấy công khai khoe khoang kỹ năng làm trộm của mình."
                    },
                    {
                        "en": "boast that… Sam boasted that she could beat anyone at poker.",
                        "vi": "khoe khoang điều đó… Sam khoe rằng cô ấy có thể đánh bại bất kỳ ai trong trò chơi poker."
                    },
                    {
                        "en": "Hay's booksellers justifiably boast that they cater for all tastes.",
                        "vi": "Những người bán sách của Hay tự hào một cách chính đáng rằng họ phục vụ cho mọi sở thích."
                    },
                    {
                        "en": "+ speech ‘I won!’ she boasted.",
                        "vi": "Err:509"
                    }
                ]
            },
            {
                "define": {
                    "en": "to have something that is impressive",
                    "vi": "để có một cái gì đó thật ấn tượng"
                },
                "examples": [
                    {
                        "en": "The hotel also boasts two swimming pools and a golf course.",
                        "vi": "Khách sạn cũng có hai hồ bơi và một sân gôn."
                    },
                    {
                        "en": "Rhodes boasts 300 days of sunshine a year.",
                        "vi": "Rhodes tự hào có 300 ngày nắng mỗi năm."
                    },
                    {
                        "en": "This is a region which proudly boasts its own distinct culture.",
                        "vi": "Đây là một khu vực tự hào có nền văn hóa riêng biệt của mình."
                    }
                ]
            }
        ]
    },
    {
        "id": "f84c8aba92954599bed45e4229dd0438",
        "word": "congratulate",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/kənˈɡrætʃəleɪt/",
            "us": "/kənˈɡrætʃəleɪt/"
        },
        "nearby": [
            {
                "word": "Congolese",
                "pos": "noun, adjective"
            },
            {
                "word": "congrats",
                "pos": "noun"
            },
            {
                "word": "congratulate",
                "pos": "verb"
            },
            {
                "word": "congratulation",
                "pos": "noun"
            },
            {
                "word": "congratulatory",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to tell somebody that you are pleased about their success or achievements",
                    "vi": "nói với ai đó rằng bạn hài lòng về thành công hoặc thành tích của họ"
                },
                "examples": [
                    {
                        "en": "I congratulated them all on their results.",
                        "vi": "Tôi chúc mừng tất cả họ về kết quả của họ."
                    },
                    {
                        "en": "The authors are to be congratulated on producing such a clear and authoritative work.",
                        "vi": "Các tác giả được chúc mừng vì đã tạo ra một tác phẩm rõ ràng và có thẩm quyền như vậy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to feel pleased and proud because you have achieved something or been successful at something",
                    "vi": "cảm thấy hài lòng và tự hào vì bạn đã đạt được điều gì đó hoặc thành công ở một điều gì đó"
                },
                "examples": [
                    {
                        "en": "You can congratulate yourself on having done an excellent job.",
                        "vi": "Bạn có thể tự chúc mừng vì đã hoàn thành xuất sắc công việc."
                    },
                    {
                        "en": "The organizers are congratulating themselves on attracting record numbers to the event.",
                        "vi": "Ban tổ chức đang tự chúc mừng vì đã thu hút được con số kỷ lục đến với sự kiện."
                    }
                ]
            }
        ]
    },
    {
        "id": "fd42b40894b144359e287ff3d39727cc",
        "word": "fulfilled",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/fʊlˈfɪld/",
            "us": "/fʊlˈfɪld/"
        },
        "nearby": [
            {
                "word": "fulcrum",
                "pos": "noun"
            },
            {
                "word": "fulfil",
                "pos": "verb"
            },
            {
                "word": "fulfilled",
                "pos": "adjective"
            },
            {
                "word": "fulfilling",
                "pos": "adjective"
            },
            {
                "word": "fulfilment",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "feeling happy and satisfied that you are doing something useful with your life",
                    "vi": "cảm thấy hạnh phúc và hài lòng rằng bạn đang làm điều gì đó có ích cho cuộc sống của bạn"
                },
                "examples": [
                    {
                        "en": "He doesn't feel fulfilled in his present job.",
                        "vi": "Anh ấy không cảm thấy hoàn thành công việc hiện tại của mình."
                    },
                    {
                        "en": "a happy and fulfilled old age",
                        "vi": "một tuổi già hạnh phúc và viên mãn"
                    }
                ]
            }
        ]
    },
    {
        "id": "05eb837d1b2546cba907baf5c1ab9531",
        "word": "recognize",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈrekəɡnaɪz/",
            "us": "/ˈrekəɡnaɪz/"
        },
        "nearby": [
            {
                "word": "recognizably",
                "pos": "adverb"
            },
            {
                "word": "recognizance",
                "pos": "noun"
            },
            {
                "word": "recognize",
                "pos": "verb"
            },
            {
                "word": "recoil",
                "pos": "verb"
            },
            {
                "word": "recoil",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to know who somebody is or what something is when you see or hear them or it, because you have seen or heard them or it before",
                    "vi": "để biết ai đó là ai hoặc điều gì đó là gì khi bạn nhìn thấy hoặc nghe thấy họ hoặc điều đó, bởi vì bạn đã từng nhìn thấy hoặc nghe thấy họ hoặc điều đó trước đây"
                },
                "examples": [
                    {
                        "en": "recognize somebody/something I recognized him as soon as he came in the room.",
                        "vi": "nhận ra ai đó / cái gì đó Tôi đã nhận ra anh ta ngay khi anh ta bước vào phòng."
                    },
                    {
                        "en": "Do you recognize this tune?",
                        "vi": "Bạn có nhận ra giai điệu này?"
                    },
                    {
                        "en": "You might not recognize the name but you'll know her face.",
                        "vi": "Bạn có thể không nhận ra tên nhưng bạn sẽ biết khuôn mặt của cô ấy."
                    },
                    {
                        "en": "I recognized the voice immediately.",
                        "vi": "Tôi nhận ra giọng nói ngay lập tức."
                    },
                    {
                        "en": "recognize somebody/something by something I recognized her by her red hair.",
                        "vi": "nhận ra ai đó / cái gì đó bởi một cái gì đó Tôi đã nhận ra cô ấy bởi mái tóc đỏ của cô ấy."
                    },
                    {
                        "en": "recognize somebody/something from something I recognized him from the photo in the paper.",
                        "vi": "nhận ra ai đó / cái gì đó từ một cái gì đó Tôi đã nhận ra anh ta từ bức ảnh trên báo."
                    },
                    {
                        "en": "recognize somebody/something as something He recognized the man as one of the police officers.",
                        "vi": "nhận ra ai đó / cái gì đó như một cái gì đó Anh ta nhận ra người đàn ông là một trong những cảnh sát."
                    }
                ]
            },
            {
                "define": {
                    "en": "to admit or to be aware that something exists or is true",
                    "vi": "thừa nhận hoặc nhận thức rằng một cái gì đó tồn tại hoặc là sự thật"
                },
                "examples": [
                    {
                        "en": "recognize something They recognized the need to take the problem seriously.",
                        "vi": "nhận ra điều gì đó Họ nhận ra sự cần thiết phải xem xét vấn đề một cách nghiêm túc."
                    },
                    {
                        "en": "Most of us recognize the importance of diet.",
                        "vi": "Hầu hết chúng ta đều nhận ra tầm quan trọng của chế độ ăn uống."
                    },
                    {
                        "en": "The government does recognize the value of the arts in this country.",
                        "vi": "Chính phủ công nhận giá trị của nghệ thuật ở đất nước này."
                    },
                    {
                        "en": "You must recognize the fact that the situation has changed.",
                        "vi": "Bạn phải nhận ra thực tế là tình hình đã thay đổi."
                    },
                    {
                        "en": "recognize something as something Drugs were not recognized as a problem then.",
                        "vi": "nhận ra một cái gì đó như một cái gì đó Ma túy không được coi là một vấn đề sau đó."
                    },
                    {
                        "en": "recognize somebody/something to be/have something Drugs were not recognized to be a problem then.",
                        "vi": "nhận ra ai đó / một cái gì đó là / có một cái gì đó Ma túy không được công nhận là một vấn đề khi đó."
                    },
                    {
                        "en": "recognize how, what, etc… Nobody recognized how urgent the situation was.",
                        "vi": "nhận ra bằng cách nào, cái gì, vv… Không ai nhận ra tình hình khẩn cấp như thế nào."
                    },
                    {
                        "en": "recognize that… We recognized that the task was not straightforward.",
                        "vi": "nhận ra rằng… Chúng tôi nhận ra rằng nhiệm vụ không đơn giản."
                    },
                    {
                        "en": "it is recognized that… It is widely recognized that driver fatigue is a problem on motorways.",
                        "vi": "nó được công nhận rằng… Người ta công nhận rộng rãi rằng sự mệt mỏi của người lái xe là một vấn đề trên đường cao tốc."
                    },
                    {
                        "en": "It was recognized that this solution could only be temporary.",
                        "vi": "Người ta nhận ra rằng giải pháp này chỉ có thể là tạm thời."
                    }
                ]
            },
            {
                "define": {
                    "en": "to accept and approve of somebody/something officially",
                    "vi": "chấp nhận và chấp thuận ai đó / điều gì đó một cách chính thức"
                },
                "examples": [
                    {
                        "en": "recognize somebody/something The UK has refused to recognize the new regime.",
                        "vi": "công nhận ai đó / điều gì đó Vương quốc Anh đã từ chối công nhận chế độ mới."
                    },
                    {
                        "en": "These qualifications are recognized throughout the EU.",
                        "vi": "Những bằng cấp này được công nhận trên toàn EU."
                    },
                    {
                        "en": "internationally recognized human rights",
                        "vi": "quyền con người được quốc tế công nhận"
                    },
                    {
                        "en": "The court explicitly recognized the group's right to exist.",
                        "vi": "Tòa án đã công nhận rõ ràng quyền tồn tại của nhóm."
                    },
                    {
                        "en": "be recognized as somebody/something The organization has not been officially recognized as a trade union.",
                        "vi": "được công nhận là ai đó / cái gì đó Tổ chức chưa được chính thức công nhận là tổ chức công đoàn."
                    },
                    {
                        "en": "Such crimes are recognized by international law as crimes against humanity.",
                        "vi": "Những tội ác đó được luật pháp quốc tế thừa nhận là tội ác chống lại loài người."
                    },
                    {
                        "en": "be recognized to be/have something He is recognized to be their natural leader.",
                        "vi": "được công nhận là / có điều gì đó Anh ấy được công nhận là nhà lãnh đạo tự nhiên của họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be thought of as very good or important by people in general",
                    "vi": "được mọi người nói chung coi là rất tốt hoặc quan trọng"
                },
                "examples": [
                    {
                        "en": "The book is now recognized as a classic.",
                        "vi": "Cuốn sách hiện đã được công nhận là một tác phẩm kinh điển."
                    },
                    {
                        "en": "She's a recognized authority on the subject.",
                        "vi": "Cô ấy là một người có thẩm quyền được công nhận về chủ đề này."
                    }
                ]
            },
            {
                "define": {
                    "en": "to give somebody official thanks for something that they have done or achieved",
                    "vi": "để gửi lời cảm ơn chính thức đến ai đó về điều gì đó mà họ đã làm hoặc đạt được"
                },
                "examples": [
                    {
                        "en": "His services to the state were recognized with the award of a knighthood.",
                        "vi": "Những phục vụ của ông cho nhà nước đã được công nhận với giải thưởng phong tước hiệp sĩ."
                    }
                ]
            }
        ]
    },
    {
        "id": "8c92f77bef85411c885075d67a454078",
        "word": "Academy Award™",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/əˌkædəmi əˈwɔːd/",
            "us": "/əˌkædəmi əˈwɔːrd/"
        },
        "nearby": [
            {
                "word": "academic year",
                "pos": "noun"
            },
            {
                "word": "academy",
                "pos": "noun"
            },
            {
                "word": "Academy Award",
                "pos": "noun"
            },
            {
                "word": "the Academy of Motion Picture Arts and Sciences",
                "pos": ""
            },
            {
                "word": "the Academy of St Martin in the Fields",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "one of the awards given every year by the US Academy of Motion Picture Arts and Sciences for achievement in the making of films",
                    "vi": "một trong những giải thưởng được trao hàng năm bởi Viện Hàn lâm Khoa học và Nghệ thuật Điện ảnh Hoa Kỳ cho thành tựu sản xuất phim"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "2e49dd640f294bb8ade138827c16f543",
        "word": "acclaim",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/əˈkleɪm/",
            "us": "/əˈkleɪm/"
        },
        "nearby": [
            {
                "word": "accident and emergency",
                "pos": "noun"
            },
            {
                "word": "accident-prone",
                "pos": "adjective"
            },
            {
                "word": "acclaim",
                "pos": "verb"
            },
            {
                "word": "acclaim",
                "pos": "noun"
            },
            {
                "word": "acclamation",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to praise or welcome somebody/something publicly",
                    "vi": "để khen ngợi hoặc chào đón ai đó / điều gì đó một cách công khai"
                },
                "examples": [
                    {
                        "en": "be acclaimed (as something) The work was acclaimed as a masterpiece.",
                        "vi": "được ca ngợi (như một cái gì đó) Tác phẩm đã được ca ngợi như một kiệt tác."
                    },
                    {
                        "en": "This book has been widely acclaimed as a modern classic.",
                        "vi": "Cuốn sách này đã được hoan nghênh rộng rãi như một tác phẩm kinh điển hiện đại."
                    },
                    {
                        "en": "a highly/widely acclaimed performance",
                        "vi": "một hiệu suất được đánh giá cao / được hoan nghênh rộng rãi"
                    },
                    {
                        "en": "Mario Vargas Llosa, the internationally acclaimed novelist",
                        "vi": "Mario Vargas Llosa, tiểu thuyết gia được quốc tế ca ngợi"
                    }
                ]
            }
        ]
    },
    {
        "id": "185a21bae0e1447086a80fc1336222ac",
        "word": "acclaim",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/əˈkleɪm/",
            "us": "/əˈkleɪm/"
        },
        "nearby": [
            {
                "word": "accident-prone",
                "pos": "adjective"
            },
            {
                "word": "acclaim",
                "pos": "verb"
            },
            {
                "word": "acclaim",
                "pos": "noun"
            },
            {
                "word": "acclamation",
                "pos": "noun"
            },
            {
                "word": "acclimate",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "praise and approval for somebody/something, especially an artistic achievement",
                    "vi": "khen ngợi và tán thành ai đó / điều gì đó, đặc biệt là một thành tựu nghệ thuật"
                },
                "examples": [
                    {
                        "en": "international/popular/critical acclaim",
                        "vi": "ca ngợi quốc tế / phổ biến / phê bình"
                    }
                ]
            }
        ]
    },
    {
        "id": "6a293d9c6ba74512885372c0d96fa546",
        "word": "accolade",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈækəleɪd/",
            "us": "/ˈækəleɪd/"
        },
        "nearby": [
            {
                "word": "acclimatization",
                "pos": "noun"
            },
            {
                "word": "acclimatize",
                "pos": "verb"
            },
            {
                "word": "accolade",
                "pos": "noun"
            },
            {
                "word": "accommodate",
                "pos": "verb"
            },
            {
                "word": "accommodating",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "praise or an award for an achievement that people admire",
                    "vi": "khen ngợi hoặc một giải thưởng cho một thành tích mà mọi người ngưỡng mộ"
                },
                "examples": [
                    {
                        "en": "Four restaurants have been awarded the highest accolade of a three-star rating.",
                        "vi": "Bốn nhà hàng đã được trao giải thưởng cao nhất xếp hạng ba sao."
                    },
                    {
                        "en": "a long list of industry accolades",
                        "vi": "một danh sách dài các giải thưởng trong ngành"
                    },
                    {
                        "en": "He was finally awarded the ultimate accolade —British Hairdresser of the Year—in 2007.",
                        "vi": "Cuối cùng anh ấy đã được trao giải thưởng cuối cùng — Thợ làm tóc người Anh của năm — vào năm 2007."
                    }
                ]
            }
        ]
    },
    {
        "id": "3ce983fc42d440f4a4ad814e69cda61b",
        "word": "accredit",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/əˈkredɪt/",
            "us": "/əˈkredɪt/"
        },
        "nearby": [
            {
                "word": "accoutred",
                "pos": "adjective"
            },
            {
                "word": "accoutrements",
                "pos": "noun"
            },
            {
                "word": "accredit",
                "pos": "verb"
            },
            {
                "word": "accreditation",
                "pos": "noun"
            },
            {
                "word": "Accreditation UK",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to believe that somebody is responsible for doing or saying something",
                    "vi": "tin rằng ai đó có trách nhiệm làm hoặc nói điều gì đó"
                },
                "examples": [
                    {
                        "en": "be accredited to somebody The discovery of distillation is usually accredited to the Arabs of the 11th century.",
                        "vi": "được công nhận cho ai đó Việc phát hiện ra quá trình chưng cất thường được công nhận cho người Ả Rập vào thế kỷ 11."
                    },
                    {
                        "en": "be accredited with something The Arabs are usually accredited with the discovery of distillation.",
                        "vi": "được công nhận với một cái gì đó Người Ả Rập thường được công nhận với việc khám phá ra quá trình chưng cất."
                    },
                    {
                        "en": "She is accredited with having first introduced the word into the language.",
                        "vi": "Cô ấy được công nhận là người đầu tiên đưa từ này vào ngôn ngữ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to choose somebody for an official position, especially as an ambassador",
                    "vi": "để chọn ai đó cho một vị trí chính thức, đặc biệt là với tư cách là một đại sứ"
                },
                "examples": [
                    {
                        "en": "be accredited to… He was accredited to Madrid.",
                        "vi": "được công nhận để… Anh ấy đã được công nhận đến Madrid."
                    }
                ]
            },
            {
                "define": {
                    "en": "to officially approve something/somebody as being of an accepted quality or standard",
                    "vi": "để chính thức phê duyệt một cái gì đó / ai đó có chất lượng hoặc tiêu chuẩn được chấp nhận"
                },
                "examples": [
                    {
                        "en": "Institutions that do not meet the standards will not be accredited for teacher training.",
                        "vi": "Những cơ sở không đạt tiêu chuẩn sẽ không được công nhận để đào tạo giáo viên."
                    }
                ]
            }
        ]
    },
    {
        "id": "b68fed4e690c45adb84cff1766241833",
        "word": "accreditation",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/əˌkredɪˈteɪʃn/",
            "us": "/əˌkredɪˈteɪʃn/"
        },
        "nearby": [
            {
                "word": "accoutrements",
                "pos": "noun"
            },
            {
                "word": "accredit",
                "pos": "verb"
            },
            {
                "word": "accreditation",
                "pos": "noun"
            },
            {
                "word": "Accreditation UK",
                "pos": ""
            },
            {
                "word": "accredited",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "official approval given by an organization stating that somebody/something has achieved a required standard",
                    "vi": "sự chấp thuận chính thức do một tổ chức đưa ra tuyên bố rằng ai đó / điều gì đó đã đạt được tiêu chuẩn bắt buộc"
                },
                "examples": [
                    {
                        "en": "a letter of accreditation",
                        "vi": "một lá thư công nhận"
                    },
                    {
                        "en": "The Accreditation of Prior Learning scheme allows work experience to be added towards qualifications.",
                        "vi": "Chương trình Chứng nhận Học tập Trước cho phép bổ sung kinh nghiệm làm việc đối với các bằng cấp."
                    }
                ]
            }
        ]
    },
    {
        "id": "ff63923db4b5421ea75dd4ba8c134d97",
        "word": "accredited",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/əˈkredɪtɪd/",
            "us": "/əˈkredɪtɪd/"
        },
        "nearby": [
            {
                "word": "accreditation",
                "pos": "noun"
            },
            {
                "word": "Accreditation UK",
                "pos": ""
            },
            {
                "word": "accredited",
                "pos": "adjective"
            },
            {
                "word": "accretion",
                "pos": "noun"
            },
            {
                "word": "accrual",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "officially recognized as something; with official permission to be something",
                    "vi": "chính thức được công nhận là một cái gì đó; với sự cho phép chính thức để trở thành một cái gì đó"
                },
                "examples": [
                    {
                        "en": "our accredited representative",
                        "vi": "đại diện được công nhận của chúng tôi"
                    },
                    {
                        "en": "Only accredited journalists were allowed entry.",
                        "vi": "Chỉ những nhà báo được công nhận mới được phép vào."
                    }
                ]
            },
            {
                "define": {
                    "en": "officially approved as being of an accepted quality or standard",
                    "vi": "được chính thức phê duyệt là có chất lượng hoặc tiêu chuẩn được chấp nhận"
                },
                "examples": [
                    {
                        "en": "a fully accredited school/university/course",
                        "vi": "một trường học / trường đại học / khóa học được công nhận hoàn toàn"
                    },
                    {
                        "en": "The former business school is now a fully accredited British university.",
                        "vi": "Trường kinh doanh trước đây hiện là một trường đại học được công nhận hoàn toàn của Anh."
                    }
                ]
            }
        ]
    },
    {
        "id": "3c99a3d96d5a4de4ac7205305c40f54b",
        "word": "blow your own trumpet",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/bləʊ/",
            "us": "/bləʊ/"
        },
        "nearby": [
            {
                "word": "blouson",
                "pos": "noun"
            },
            {
                "word": "bloviate",
                "pos": "verb"
            },
            {
                "word": "blow",
                "pos": "verb"
            },
            {
                "word": "blow",
                "pos": "noun"
            },
            {
                "word": "blow",
                "pos": "exclamation"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to send out air from the mouth",
                    "vi": "gửi không khí ra khỏi miệng"
                },
                "examples": [
                    {
                        "en": "+ adv./prep. You're not blowing hard enough!",
                        "vi": "Err:509"
                    },
                    {
                        "en": "The policeman asked me to blow into the breathalyser.",
                        "vi": "Người cảnh sát yêu cầu tôi thổi vào ống thở."
                    },
                    {
                        "en": "blow something + adv./prep. He drew on his cigarette and blew out a stream of smoke.",
                        "vi": "thổi cái gì đó + adv./prep. Anh ta rút điếu thuốc và thổi ra một luồng khói."
                    }
                ]
            },
            {
                "define": {
                    "en": "when the wind or a current of air blows, it is moving; when it blows, the wind is blowing",
                    "vi": "khi gió hoặc luồng không khí thổi, nó đang chuyển động; khi nó thổi, gió đang thổi"
                },
                "examples": [
                    {
                        "en": "The birds were singing and a warm wind was blowing.",
                        "vi": "Những chú chim đang hót và một cơn gió ấm đang thổi qua."
                    },
                    {
                        "en": "+ adv./prep. A cold wind blew from the east.",
                        "vi": "Err:509"
                    },
                    {
                        "en": "It was blowing hard.",
                        "vi": "Nó đang thổi mạnh."
                    },
                    {
                        "en": "It was blowing a gale (= there was a strong wind).",
                        "vi": "Nó đang thổi một cơn gió giật mạnh (= có một cơn gió mạnh)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be moved by the wind, somebody’s breath, etc.; to move something in this way",
                    "vi": "được chuyển động bởi gió, hơi thở của ai đó, v.v.; để di chuyển một cái gì đó theo cách này"
                },
                "examples": [
                    {
                        "en": "+ adv./prep. My hat blew off.",
                        "vi": "Err:509"
                    },
                    {
                        "en": "+ adj. The door blew open.",
                        "vi": "Err:509"
                    },
                    {
                        "en": "blow somebody/something + adv./prep. I was almost blown over by the wind.",
                        "vi": "thổi ai đó / cái gì đó + adv./prep. Tôi gần như bị gió thổi qua."
                    },
                    {
                        "en": "She blew the dust off the book.",
                        "vi": "Cô ấy thổi bụi khỏi cuốn sách."
                    },
                    {
                        "en": "The ship was blown onto the rocks.",
                        "vi": "Con tàu bị nổ tung trên đá."
                    },
                    {
                        "en": "The bomb blast blew two passers-by across the street.",
                        "vi": "Vụ nổ bom đã thổi bay hai người qua đường."
                    },
                    {
                        "en": "blow something + adj. The wind blew the door shut.",
                        "vi": "thổi cái gì đó + adj. Gió thổi làm cánh cửa đóng sập lại."
                    }
                ]
            },
            {
                "define": {
                    "en": "if you blow a whistle, musical instrument, etc. or if a whistle, etc. blows, you produce a sound by blowing into the whistle, etc.",
                    "vi": "Nếu bạn thổi còi, nhạc cụ, v.v. hoặc nếu còi, v.v. thổi, bạn tạo ra âm thanh bằng cách thổi vào còi, v.v."
                },
                "examples": [
                    {
                        "en": "the sound of trumpets blowing",
                        "vi": "tiếng kèn thổi"
                    },
                    {
                        "en": "blow something The referee blew his whistle.",
                        "vi": "thổi cái gì đó Trọng tài thổi còi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to clear your nose by blowing strongly through it into a tissue or handkerchief",
                    "vi": "để thông mũi bằng cách thổi mạnh qua nó vào khăn giấy hoặc khăn tay"
                },
                "examples": [
                    {
                        "en": "She grabbed a tissue and loudly blew her nose.",
                        "vi": "Cô ấy lấy khăn giấy và lớn tiếng xì mũi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to kiss your hand and then pretend to blow the kiss towards somebody",
                    "vi": "hôn tay bạn và sau đó giả vờ thổi nụ hôn về phía ai đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to make or shape something by blowing",
                    "vi": "để tạo ra hoặc tạo hình thứ gì đó bằng cách thổi"
                },
                "examples": [
                    {
                        "en": "to blow smoke rings",
                        "vi": "thổi vòng khói"
                    },
                    {
                        "en": "to blow bubbles (= for example, by blowing onto a thin layer of water mixed with soap)",
                        "vi": "để thổi bong bóng (= ví dụ: bằng cách thổi vào một lớp nước mỏng trộn với xà phòng)"
                    },
                    {
                        "en": "to blow glass (= to send a current of air into melted glass to shape it)",
                        "vi": "thổi thủy tinh (= truyền một luồng không khí vào thủy tinh nóng chảy để tạo hình nó)"
                    }
                ]
            },
            {
                "define": {
                    "en": "if a fuse blows or you blow a fuse, the electricity stops flowing suddenly because the fuse (= a thin wire) has melted because the current was too strong",
                    "vi": "Nếu cầu chì nổ hoặc bạn thổi cầu chì, dòng điện ngừng chảy đột ngột vì cầu chì (= một dây mỏng) đã nóng chảy vì dòng điện quá mạnh."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to break open or apart, especially because of pressure from inside; to make a tyre break in this way",
                    "vi": "để mở hoặc tách ra, đặc biệt là do áp lực từ bên trong; để làm cho một chiếc lốp xe bị thủng theo cách này"
                },
                "examples": [
                    {
                        "en": "The car spun out of control when a tyre blew.",
                        "vi": "Chiếc xe mất kiểm soát khi bị nổ lốp."
                    },
                    {
                        "en": "The truck blew a tyre and lurched off the road.",
                        "vi": "Chiếc xe tải nổ lốp nằm chỏng chơ bên đường."
                    }
                ]
            },
            {
                "define": {
                    "en": "to break something open with explosives",
                    "vi": "để phá vỡ thứ gì đó đang mở bằng thuốc nổ"
                },
                "examples": [
                    {
                        "en": "The safe had been blown by the thieves.",
                        "vi": "Két sắt đã bị kẻ trộm thổi tung."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make known something that was secret",
                    "vi": "để biết điều gì đó bí mật"
                },
                "examples": [
                    {
                        "en": "One mistake could blow your cover (= make your real name, job, intentions, etc. known).",
                        "vi": "Một sai lầm có thể thổi bay vỏ bọc của bạn (= làm cho tên thật, công việc, ý định, v.v. của bạn được biết đến)."
                    },
                    {
                        "en": "We’re going to blow his operation wide open.",
                        "vi": "Chúng tôi sẽ mở rộng hoạt động của anh ta."
                    }
                ]
            },
            {
                "define": {
                    "en": "to spend or waste a lot of money on something",
                    "vi": "chi tiêu hoặc lãng phí nhiều tiền vào một thứ gì đó"
                },
                "examples": [
                    {
                        "en": "He inherited over a million dollars and blew it all on drink and gambling.",
                        "vi": "Anh ta thừa kế hơn một triệu đô la và tiêu hết vào rượu chè và cờ bạc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to waste an opportunity",
                    "vi": "lãng phí một cơ hội"
                },
                "examples": [
                    {
                        "en": "She blew her chances by arriving late for the interview.",
                        "vi": "Cô ấy đã thổi bay cơ hội của mình bằng cách đến trễ buổi phỏng vấn."
                    },
                    {
                        "en": "You had your chance and you blew it.",
                        "vi": "Bạn đã có cơ hội của mình và bạn đã thổi bay nó."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to show that you are annoyed, surprised or do not care about something",
                    "vi": "được sử dụng để cho thấy rằng bạn đang khó chịu, ngạc nhiên hoặc không quan tâm đến điều gì đó"
                },
                "examples": [
                    {
                        "en": "Blow it! We've missed the bus.",
                        "vi": "Hãy thổi nó đi! Chúng tôi đã bỏ lỡ chuyến xe buýt."
                    },
                    {
                        "en": "Well, blow me down! I never thought I'd see you again.",
                        "vi": "Chà, hạ gục tôi! Tôi chưa bao giờ nghĩ rằng tôi sẽ gặp lại bạn."
                    },
                    {
                        "en": "I'm blowed if I'm going to (= I certainly will not) let him treat you like that.",
                        "vi": "Tôi sẽ thất vọng nếu tôi (= Tôi chắc chắn sẽ không) để anh ta đối xử với bạn như vậy."
                    },
                    {
                        "en": "Let's take a taxi and blow (= never mind) the expense.",
                        "vi": "Hãy bắt taxi và thổi (= đừng bận tâm) chi phí."
                    }
                ]
            },
            {
                "define": {
                    "en": "to leave a place suddenly",
                    "vi": "rời khỏi một nơi đột ngột"
                },
                "examples": [
                    {
                        "en": "Let's blow this joint.",
                        "vi": "Hãy thổi khớp này."
                    }
                ]
            },
            {
                "define": {
                    "en": "to kill yourself/somebody by shooting yourself/them in the head",
                    "vi": "tự giết mình / ai đó bằng cách bắn vào đầu mình / họ"
                },
                "examples": [
                    {
                        "en": "He put a gun to his head and threatened to blow his brains out.",
                        "vi": "Anh ta dí súng vào đầu và dọa nổ não."
                    },
                    {
                        "en": "While cleaning his shotgun he had accidentally blown his own brains out.",
                        "vi": "Trong khi lau khẩu súng ngắn của mình, anh ta đã vô tình làm nổ não của chính mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to vomit",
                    "vi": "nôn mửa"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to help somebody have a fresh, lively state of mind again",
                    "vi": "để giúp ai đó có một trạng thái tinh thần tươi mới, sống động trở lại"
                },
                "examples": [
                    {
                        "en": "A brisk walk should blow the cobwebs away.",
                        "vi": "Đi bộ nhanh sẽ thổi bay mạng nhện."
                    }
                ]
            },
            {
                "define": {
                    "en": "to get very angry",
                    "vi": "rất tức giận"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to tell something secret, especially by mistake",
                    "vi": "để nói điều gì đó bí mật, đặc biệt là do nhầm lẫn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to change your opinion about something often",
                    "vi": "thay đổi quan điểm của bạn về điều gì đó thường xuyên"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to produce a very strong feeling of pleasure or shock",
                    "vi": "để tạo ra một cảm giác rất mạnh của niềm vui hoặc sự sốc"
                },
                "examples": [
                    {
                        "en": "Wait till you hear this. It'll blow your mind.",
                        "vi": "Chờ cho đến khi bạn nghe thấy điều này. Nó sẽ thổi bay tâm trí của bạn."
                    },
                    {
                        "en": "a collection of photographs that will blow your mind",
                        "vi": "một bộ sưu tập những bức ảnh sẽ thổi hồn bạn"
                    }
                ]
            },
            {
                "define": {
                    "en": "to get rid of your energy, anger or strong emotions by doing something active or noisy",
                    "vi": "để loại bỏ năng lượng, sự tức giận hoặc cảm xúc mạnh mẽ của bạn bằng cách làm điều gì đó tích cực hoặc ồn ào"
                },
                "examples": [
                    {
                        "en": "I went for a long walk to let off steam.",
                        "vi": "Tôi đã đi bộ một quãng dài để xả hơi."
                    },
                    {
                        "en": "I like blowing off steam and I like saying things that shock people.",
                        "vi": "Tôi thích thổi bay hơi nước và tôi thích nói những điều gây sốc cho mọi người."
                    }
                ]
            },
            {
                "define": {
                    "en": "to destroy somebody/something completely",
                    "vi": "để tiêu diệt ai đó / cái gì đó hoàn toàn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to show that somebody/something is not good by being very much better than it/them",
                    "vi": "thể hiện rằng ai đó / điều gì đó không tốt bằng cách tốt hơn rất nhiều so với nó / họ"
                },
                "examples": [
                    {
                        "en": "I like my old phone, but this new model blows it out of the water.",
                        "vi": "Tôi thích chiếc điện thoại cũ của mình, nhưng mẫu điện thoại mới này đã khiến nó không còn nước."
                    }
                ]
            },
            {
                "define": {
                    "en": "to praise your own abilities and achievements",
                    "vi": "khen ngợi khả năng và thành tích của chính bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to try to trick somebody or lie to somebody, particularly by saying something is better than it really is",
                    "vi": "cố gắng lừa ai đó hoặc nói dối ai đó, đặc biệt bằng cách nói điều gì đó tốt hơn thực tế"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to surprise or impress somebody very much",
                    "vi": "gây ngạc nhiên hoặc gây ấn tượng với ai đó rất nhiều"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used by somebody who does not want to do something because it involves too much effort",
                    "vi": "được sử dụng bởi một người nào đó không muốn làm điều gì đó vì nó đòi hỏi quá nhiều nỗ lực"
                },
                "examples": [
                    {
                        "en": "Sod that for a lark! I'm not doing any more tonight.",
                        "vi": "Sod đó cho một con chim! Tối nay tôi sẽ không làm gì nữa."
                    }
                ]
            },
            {
                "define": {
                    "en": "to use bombs or other weapons to destroy somebody/something completely",
                    "vi": "sử dụng bom hoặc vũ khí khác để tiêu diệt hoàn toàn ai đó / thứ gì đó"
                },
                "examples": [
                    {
                        "en": "The plane was blown to pieces when the bomb exploded.",
                        "vi": "Chiếc máy bay bị nổ tung khi quả bom phát nổ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to completely destroy somebody/something with an explosion",
                    "vi": "để tiêu diệt hoàn toàn ai đó / thứ gì đó bằng một vụ nổ"
                },
                "examples": [
                    {
                        "en": "The truck was blown to kingdom come.",
                        "vi": "Chiếc xe tải đã được thổi đến vương quốc đến."
                    }
                ]
            },
            {
                "define": {
                    "en": "to get very angry",
                    "vi": "rất tức giận"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "if a plan, etc. blows up in your face, it goes badly wrong in a way that causes you damage or makes you feel embarrassed",
                    "vi": "nếu một kế hoạch, v.v. thổi vào mặt bạn, nó sẽ trở nên sai lầm nghiêm trọng theo hướng khiến bạn thiệt hại hoặc khiến bạn cảm thấy xấu hổ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to tell somebody in authority about something wrong or illegal that somebody is doing",
                    "vi": "nói với ai đó có thẩm quyền về điều gì đó sai trái hoặc bất hợp pháp mà ai đó đang làm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "no problem is so bad that it does not bring some advantage to somebody",
                    "vi": "không có vấn đề gì là tệ đến nỗi nó không mang lại lợi thế cho ai đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to tell people unpleasant facts about something",
                    "vi": "để nói với mọi người những sự thật khó chịu về một cái gì đó"
                },
                "examples": [
                    {
                        "en": "Her article lifts the lid on bullying in the workplace.",
                        "vi": "Bài báo của cô ấy đã lật tẩy tình trạng bắt nạt ở nơi làm việc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to breathe quickly and loudly through your mouth after physical effort",
                    "vi": "thở nhanh và to bằng miệng sau khi gắng sức"
                },
                "examples": [
                    {
                        "en": "Eventually, puffing and blowing, he arrived at the gate.",
                        "vi": "Cuối cùng, phập phồng và thổi phồng, anh ta cũng đến cổng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to get an idea of what is likely to happen before deciding what to do",
                    "vi": "để có ý tưởng về những gì có thể xảy ra trước khi quyết định phải làm gì"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "65a6f12281bf4ec281b833116b46c357",
        "word": "boast",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/bəʊst/",
            "us": "/bəʊst/"
        },
        "nearby": [
            {
                "word": "boardwalk",
                "pos": "noun"
            },
            {
                "word": "boast",
                "pos": "verb"
            },
            {
                "word": "boast",
                "pos": "noun"
            },
            {
                "word": "boastful",
                "pos": "adjective"
            },
            {
                "word": "boat",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "something that a person talks about in a very proud way, often to seem more important or clever",
                    "vi": "điều gì đó mà một người nói về một cách rất tự hào, thường có vẻ quan trọng hơn hoặc thông minh hơn"
                },
                "examples": [
                    {
                        "en": "Despite his boasts that his children were brilliant, neither of them went to college.",
                        "vi": "Mặc dù ông tự hào rằng các con của ông đều rất giỏi giang, nhưng cả hai đều không vào đại học."
                    },
                    {
                        "en": "It was her proud boast that she had never missed a day's work because of illness.",
                        "vi": "Đó là lời tự hào của cô ấy rằng cô ấy chưa bao giờ bỏ lỡ một ngày làm việc vì bệnh tật."
                    },
                    {
                        "en": "Her claim that she could beat us all was clearly no idle/empty boast (= it was true).",
                        "vi": "Tuyên bố của cô ấy rằng cô ấy có thể đánh bại tất cả chúng tôi rõ ràng không phải là một lời khoe khoang vu vơ / trống rỗng (= đó là sự thật)."
                    }
                ]
            }
        ]
    },
    {
        "id": "9ec8369cb8d14b48b96cc61349c41606",
        "word": "CBE",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌsiː biː ˈiː/",
            "us": "/ˌsiː biː ˈiː/"
        },
        "nearby": [
            {
                "word": "CB",
                "pos": "noun"
            },
            {
                "word": "CBD",
                "pos": "noun"
            },
            {
                "word": "CBE",
                "pos": "noun"
            },
            {
                "word": "CBI",
                "pos": "abbreviation"
            },
            {
                "word": "CBO",
                "pos": "abbreviation"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an award given in the UK to some people for a special achievement; a person who has received this award (the abbreviation for ‘Commander (of the Order) of the British Empire’)",
                    "vi": "một giải thưởng được trao ở Vương quốc Anh cho một số người vì một thành tích đặc biệt; một người đã nhận được giải thưởng này (tên viết tắt của 'Chỉ huy (của Lệnh) của Đế chế Anh')"
                },
                "examples": [
                    {
                        "en": "He was made a CBE in 2019.",
                        "vi": "Anh ấy đã được làm CBE vào năm 2019."
                    },
                    {
                        "en": "Shami Chakrabarti CBE",
                        "vi": "Shami Chakrabarti CBE"
                    }
                ]
            }
        ]
    },
    {
        "id": "dc351c9ca2024b64a85ea7227ac8d2a9",
        "word": "credit",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkredɪt/",
            "us": "/ˈkredɪt/"
        },
        "nearby": [
            {
                "word": "credible",
                "pos": "adjective"
            },
            {
                "word": "credibly",
                "pos": "adverb"
            },
            {
                "word": "credit",
                "pos": "noun"
            },
            {
                "word": "credit",
                "pos": "verb"
            },
            {
                "word": "creditable",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an arrangement that you make, with a shop for example, to pay later for something you buy",
                    "vi": "một thỏa thuận mà bạn thực hiện, với một cửa hàng chẳng hạn, để thanh toán sau cho một thứ bạn mua"
                },
                "examples": [
                    {
                        "en": "to get credit",
                        "vi": "để nhận được tín dụng"
                    },
                    {
                        "en": "on credit We bought the dishwasher on credit.",
                        "vi": "bằng tín dụng Chúng tôi đã mua máy rửa bát theo hình thức tín dụng."
                    },
                    {
                        "en": "to offer interest-free credit (= allow somebody to pay later, without any extra charge)",
                        "vi": "cung cấp tín dụng không tính lãi (= cho phép ai đó thanh toán sau mà không tính thêm phí)"
                    },
                    {
                        "en": "Someone with a bad credit history is less likely to be lent money.",
                        "vi": "Những người có lịch sử tín dụng xấu ít có khả năng được cho vay tiền hơn."
                    },
                    {
                        "en": "a credit agreement",
                        "vi": "một hợp đồng tín dụng"
                    },
                    {
                        "en": "a credit facility",
                        "vi": "một khoản tín dụng"
                    },
                    {
                        "en": "Your credit limit is now £2 000.",
                        "vi": "Hạn mức tín dụng của bạn hiện là £ 2 000."
                    },
                    {
                        "en": "He's a bad credit risk (= he is unlikely to pay the money later).",
                        "vi": "Anh ta là một rủi ro tín dụng xấu (= anh ta không có khả năng trả tiền sau này)."
                    },
                    {
                        "en": "The credit crisis is far from over.",
                        "vi": "Cuộc khủng hoảng tín dụng còn lâu mới kết thúc."
                    }
                ]
            },
            {
                "define": {
                    "en": "money that you borrow from a bank; a loan",
                    "vi": "tiền bạn vay từ ngân hàng; một khoản vay"
                },
                "examples": [
                    {
                        "en": "The bank refused further credit to the company.",
                        "vi": "Ngân hàng đã từ chối cấp thêm tín dụng cho công ty."
                    },
                    {
                        "en": "Local lenders are more likely to extend credit (= lend money) to smaller, more marginal borrowers.",
                        "vi": "Những người cho vay trong nước có nhiều khả năng mở rộng tín dụng (= cho vay tiền) cho những người đi vay nhỏ hơn, cận biên hơn."
                    }
                ]
            },
            {
                "define": {
                    "en": "the status of being trusted to pay back money to somebody who lends it to you",
                    "vi": "tình trạng được tin cậy để trả lại tiền cho ai đó cho bạn vay"
                },
                "examples": [
                    {
                        "en": "Her credit isn't good anywhere now.",
                        "vi": "Tín dụng của cô ấy không tốt ở bất cứ đâu bây giờ."
                    }
                ]
            },
            {
                "define": {
                    "en": "money that you have in your bank account; if you or your bank account are in credit, there is money in the account",
                    "vi": "tiền mà bạn có trong tài khoản ngân hàng của mình; nếu bạn hoặc tài khoản ngân hàng của bạn có tín dụng, có tiền trong tài khoản"
                },
                "examples": [
                    {
                        "en": "You have a credit balance of £250.",
                        "vi": "Bạn có số dư tín dụng là £ 250."
                    },
                    {
                        "en": "My account is in credit.",
                        "vi": "Tài khoản của tôi đang ở trong tình trạng tín dụng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a sum of money paid into a bank account; a record of the payment",
                    "vi": "một khoản tiền được trả vào tài khoản ngân hàng; hồ sơ thanh toán"
                },
                "examples": [
                    {
                        "en": "a credit of £50",
                        "vi": "một khoản tín dụng £ 50"
                    },
                    {
                        "en": "You'll be paid by direct credit into your bank account.",
                        "vi": "Bạn sẽ được thanh toán bằng tín dụng trực tiếp vào tài khoản ngân hàng của mình."
                    },
                    {
                        "en": "I have three credits on my bank statement.",
                        "vi": "Tôi có ba khoản tín dụng trên bảng sao kê ngân hàng của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "the right to use a service up to a certain limit, paid for in advance",
                    "vi": "quyền sử dụng một dịch vụ đến một giới hạn nhất định, được trả trước"
                },
                "examples": [
                    {
                        "en": "My phone's run out of credit.",
                        "vi": "Điện thoại của tôi đã hết tín dụng."
                    },
                    {
                        "en": "to add credit to your phone",
                        "vi": "để thêm tín dụng vào điện thoại của bạn"
                    }
                ]
            },
            {
                "define": {
                    "en": "a payment that somebody has a right to for a particular reason",
                    "vi": "một khoản thanh toán mà ai đó có quyền vì một lý do cụ thể"
                },
                "examples": [
                    {
                        "en": "The child tax credit is subject to strict income limitations.",
                        "vi": "Khoản tín dụng thuế trẻ em có giới hạn thu nhập nghiêm ngặt."
                    },
                    {
                        "en": "Export credits are granted to firms in developing countries to give them a breathing space to pay for goods exported to them.",
                        "vi": "Các khoản tín dụng xuất khẩu được cấp cho các công ty ở các nước đang phát triển để họ có không gian thanh toán cho hàng hóa xuất khẩu sang họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "praise or approval because you are responsible for something good that has happened",
                    "vi": "khen ngợi hoặc tán thành bởi vì bạn chịu trách nhiệm về một điều gì đó tốt đẹp đã xảy ra"
                },
                "examples": [
                    {
                        "en": "to get/deserve/receive/take/claim the credit",
                        "vi": "để có được / xứng đáng / nhận / lấy / yêu cầu tín dụng"
                    },
                    {
                        "en": "He's a player who rarely seems to get the credit he deserves.",
                        "vi": "Anh ấy là một cầu thủ hiếm khi nhận được sự tín nhiệm xứng đáng."
                    },
                    {
                        "en": "We did all the work and she gets all the credit!",
                        "vi": "Chúng tôi đã làm tất cả công việc và cô ấy nhận được tất cả công lao!"
                    },
                    {
                        "en": "credit for (doing) something I can't take all the credit for the show's success—it was a team effort.",
                        "vi": "ghi công cho (đang làm) điều gì đó mà tôi không thể lấy hết công lao cho thành công của buổi biểu diễn — đó là một nỗ lực của cả nhóm."
                    },
                    {
                        "en": "At least give him credit for trying (= praise him because he tried, even if he did not succeed)",
                        "vi": "Ít nhất hãy ghi công cho anh ta vì đã cố gắng (= khen anh ta vì anh ta đã cố gắng, ngay cả khi anh ta không thành công)"
                    },
                    {
                        "en": "Credit will be given in the exam for good spelling and grammar.",
                        "vi": "Tín chỉ sẽ được cung cấp trong kỳ thi kiểm tra chính tả và ngữ pháp tốt."
                    },
                    {
                        "en": "His courage brought great credit to his regiment.",
                        "vi": "Sự dũng cảm của anh đã mang lại công lao to lớn cho trung đoàn của anh."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person or thing whose qualities or achievements are praised and who therefore earns respect for somebody/something else",
                    "vi": "một người hoặc một vật có phẩm chất hoặc thành tích được ca ngợi và do đó người đó nhận được sự tôn trọng đối với ai đó / điều gì đó khác"
                },
                "examples": [
                    {
                        "en": "She is a credit to the school.",
                        "vi": "Cô ấy là một tín dụng cho trường."
                    },
                    {
                        "en": "Your children are a great credit to you.",
                        "vi": "Con cái của bạn là một tín dụng lớn đối với bạn."
                    },
                    {
                        "en": "He's a great credit to the school.",
                        "vi": "Anh ấy là người có công lớn đối với trường."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of mentioning somebody who worked on a project such as a film or a television programme",
                    "vi": "hành động đề cập đến ai đó đã làm việc trong một dự án chẳng hạn như một bộ phim hoặc một chương trình truyền hình"
                },
                "examples": [
                    {
                        "en": "She was given a programme credit for her work on the costumes for the play.",
                        "vi": "Cô ấy đã nhận được tín dụng của chương trình cho công việc của cô ấy về trang phục cho vở kịch."
                    },
                    {
                        "en": "The credits (= the list of all the people involved) seemed to last almost as long as the film!",
                        "vi": "Các khoản tín dụng (= danh sách tất cả những người có liên quan) dường như kéo dài gần như kéo dài cả bộ phim!"
                    },
                    {
                        "en": "From the opening credits, the movie is non-stop action.",
                        "vi": "Từ đoạn mở đầu, bộ phim là những pha hành động không ngừng nghỉ."
                    },
                    {
                        "en": "The end credits came as a welcome relief.",
                        "vi": "Các khoản tín dụng kết thúc đến như một sự cứu trợ chào đón."
                    },
                    {
                        "en": "We left before the final credits began to roll.",
                        "vi": "Chúng tôi rời đi trước khi các khoản tín dụng cuối cùng bắt đầu được tung ra."
                    }
                ]
            },
            {
                "define": {
                    "en": "a film, play, television programme, etc. that somebody has worked on",
                    "vi": "một bộ phim, vở kịch, chương trình truyền hình, v.v. mà ai đó đã làm việc"
                },
                "examples": [
                    {
                        "en": "His film credits included ‘The Witches’ and ‘Halloween III’.",
                        "vi": "Các khoản tín dụng phim của anh ấy bao gồm 'The Witches' và 'Halloween III'."
                    }
                ]
            },
            {
                "define": {
                    "en": "a unit of study at a college or university (in the US, also at a school); the fact of having successfully completed a unit of study",
                    "vi": "một đơn vị học tập tại một trường cao đẳng hoặc đại học (ở Mỹ, cũng tại một trường học); thực tế là đã hoàn thành xuất sắc một đơn vị nghiên cứu"
                },
                "examples": [
                    {
                        "en": "My math class is worth three credits.",
                        "vi": "Lớp toán của tôi có giá trị ba tín chỉ."
                    }
                ]
            },
            {
                "define": {
                    "en": "if something does credit to a person or an organization, they deserve to be praised for it",
                    "vi": "nếu điều gì đó có công với một người hoặc một tổ chức, họ xứng đáng được khen ngợi về điều đó"
                },
                "examples": [
                    {
                        "en": "Your honesty does you great credit.",
                        "vi": "Sự trung thực của bạn làm cho bạn tín dụng lớn."
                    },
                    {
                        "en": "Your concern does you credit.",
                        "vi": "Mối quan tâm của bạn có tín dụng không."
                    }
                ]
            },
            {
                "define": {
                    "en": "to give somebody the praise they deserve, even if you do not really want to",
                    "vi": "để dành cho ai đó những lời khen ngợi mà họ xứng đáng được nhận, ngay cả khi bạn không thực sự muốn"
                },
                "examples": [
                    {
                        "en": "Give credit where credit is due—what the man does, he does well.",
                        "vi": "Cung cấp tín dụng khi tín dụng đến hạn — những gì người đàn ông làm, anh ta làm tốt."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have achieved something",
                    "vi": "để đạt được một cái gì đó"
                },
                "examples": [
                    {
                        "en": "He's only 30, and he already has four novels to his credit.",
                        "vi": "Anh ấy mới 30 tuổi và đã có 4 cuốn tiểu thuyết."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to introduce the good points about somebody/something, especially after the bad points have been mentioned",
                    "vi": "được sử dụng để giới thiệu những điểm tốt về ai đó / điều gì đó, đặc biệt là sau khi những điểm xấu đã được đề cập"
                },
                "examples": [
                    {
                        "en": "On the credit side, she’s always willing to work very late.",
                        "vi": "Về mặt tín dụng, cô ấy luôn sẵn sàng làm việc rất muộn."
                    }
                ]
            },
            {
                "define": {
                    "en": "making somebody deserve praise or respect",
                    "vi": "làm cho ai đó xứng đáng được khen ngợi hoặc tôn trọng"
                },
                "examples": [
                    {
                        "en": "To his credit, Jack never told anyone exactly what had happened.",
                        "vi": "Đối với tín nhiệm của mình, Jack không bao giờ nói cho ai biết chính xác những gì đã xảy ra."
                    },
                    {
                        "en": "It was to her credit that she managed to stay calm.",
                        "vi": "Đó là công lao của cô ấy rằng cô ấy đã giữ được bình tĩnh."
                    }
                ]
            }
        ]
    },
    {
        "id": "96f9f695b453426ba14dadbf124900ed",
        "word": "crow",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/krəʊ/",
            "us": "/krəʊ/"
        },
        "nearby": [
            {
                "word": "crouton",
                "pos": "noun"
            },
            {
                "word": "crow",
                "pos": "noun"
            },
            {
                "word": "crow",
                "pos": "verb"
            },
            {
                "word": "Crow",
                "pos": "noun"
            },
            {
                "word": "crowbar",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to make repeated loud high sounds, especially early in the morning",
                    "vi": "để tạo ra âm thanh lớn lặp đi lặp lại, đặc biệt là vào sáng sớm"
                },
                "examples": [
                    {
                        "en": "A cock began to crow.",
                        "vi": "Một con gà trống đã bắt đầu gáy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to talk too proudly about something you have achieved, especially when somebody else has been unsuccessful",
                    "vi": "nói quá tự hào về điều gì đó bạn đã đạt được, đặc biệt là khi người khác đã không thành công"
                },
                "examples": [
                    {
                        "en": "crow (about/over something) He won't stop crowing about his victory.",
                        "vi": "gáy (về / về điều gì đó) Anh ấy sẽ không ngừng gáy về chiến thắng của mình."
                    },
                    {
                        "en": "+ speech ‘I've won, I've won!’ she crowed.",
                        "vi": "Err:509"
                    },
                    {
                        "en": "crow that… He crowed that they had sold out in one day.",
                        "vi": "Quạ rằng ... Ông gáy rằng họ đã bán hết trong một ngày."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make happy sounds",
                    "vi": "để tạo ra âm thanh vui vẻ"
                },
                "examples": [
                    {
                        "en": "She gave the purse to Ruby, who crowed with delight.",
                        "vi": "Cô ấy đưa chiếc ví cho Ruby, cô ấy đang reo lên thích thú."
                    }
                ]
            }
        ]
    },
    {
        "id": "935d00730fc34230a64d4f69194980cd",
        "word": "Emmy",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈemi/",
            "us": "/ˈemi/"
        },
        "nearby": [
            {
                "word": "Emmental",
                "pos": "noun"
            },
            {
                "word": "Emmerdale",
                "pos": ""
            },
            {
                "word": "Emmy",
                "pos": "noun"
            },
            {
                "word": "emo",
                "pos": "noun"
            },
            {
                "word": "emoji",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "one of the awards given every year in the US for achievement in the making of television programmes",
                    "vi": "một trong những giải thưởng được trao hàng năm tại Hoa Kỳ cho thành tích tạo ra các chương trình truyền hình"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "d3d36f0d64014d0cb4f5cf414ee37781",
        "word": "fist pump",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈfɪst pʌmp/",
            "us": "/ˈfɪst pʌmp/"
        },
        "nearby": [
            {
                "word": "fistful",
                "pos": "noun"
            },
            {
                "word": "fisticuffs",
                "pos": "noun"
            },
            {
                "word": "fist pump",
                "pos": "noun"
            },
            {
                "word": "fist-pump",
                "pos": "verb"
            },
            {
                "word": "fist-pumping",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an action to celebrate success or victory, or to show support, in which you raise your bent arm with your hand tightly closed and then move it quickly and strongly down towards your body",
                    "vi": "một hành động để ăn mừng thành công hoặc chiến thắng hoặc để thể hiện sự ủng hộ, trong đó bạn nâng cánh tay cong của mình lên với bàn tay khép chặt và sau đó di chuyển nhanh và mạnh xuống về phía cơ thể"
                },
                "examples": [
                    {
                        "en": "When I saw the final score, I gave a fist pump and shouted out ‘YES!’",
                        "vi": "Khi tôi nhìn thấy điểm số cuối cùng, tôi đã nắm đấm và hét lên 'CÓ!'"
                    }
                ]
            }
        ]
    },
    {
        "id": "742500e691954c969d0ea7aea807f817",
        "word": "fist-pump",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈfɪst pʌmp/",
            "us": "/ˈfɪst pʌmp/"
        },
        "nearby": [
            {
                "word": "fisticuffs",
                "pos": "noun"
            },
            {
                "word": "fist pump",
                "pos": "noun"
            },
            {
                "word": "fist-pump",
                "pos": "verb"
            },
            {
                "word": "fist-pumping",
                "pos": "noun"
            },
            {
                "word": "fistula",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to move your arm and hand in a fist pump in order to celebrate success or victory, or to show support",
                    "vi": "cử động cánh tay và bàn tay của bạn trong một cái bơm nắm tay để ăn mừng thành công hoặc chiến thắng hoặc để thể hiện sự ủng hộ"
                },
                "examples": [
                    {
                        "en": "They sang, they fist-pumped and they cheered the speakers.",
                        "vi": "Họ hát, họ đấm đá và cổ vũ những người phát biểu."
                    }
                ]
            }
        ]
    },
    {
        "id": "61c193a09c224b079b57b5e4e99b3451",
        "word": "fist-pumping",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈfɪst pʌmpɪŋ/",
            "us": "/ˈfɪst pʌmpɪŋ/"
        },
        "nearby": [
            {
                "word": "fist pump",
                "pos": "noun"
            },
            {
                "word": "fist-pump",
                "pos": "verb"
            },
            {
                "word": "fist-pumping",
                "pos": "noun"
            },
            {
                "word": "fistula",
                "pos": "noun"
            },
            {
                "word": "fit",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the action of moving your arm and hand in a fist pump in order to celebrate success or victory, or to show support",
                    "vi": "hành động di chuyển cánh tay và bàn tay của bạn trong một quả đấm để ăn mừng thành công hoặc chiến thắng hoặc để thể hiện sự ủng hộ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "2e5e9dacd7394974af89f3f194e70cb5",
        "word": "gloat",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ɡləʊt/",
            "us": "/ɡləʊt/"
        },
        "nearby": [
            {
                "word": "glitzy",
                "pos": "adjective"
            },
            {
                "word": "the gloaming",
                "pos": "noun"
            },
            {
                "word": "gloat",
                "pos": "verb"
            },
            {
                "word": "gloating",
                "pos": "adjective"
            },
            {
                "word": "glob",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to show that you are happy about your own success or somebody else’s failure, in an unpleasant way",
                    "vi": "để thể hiện rằng bạn hài lòng về thành công của chính mình hoặc thất bại của người khác, một cách khó chịu"
                },
                "examples": [
                    {
                        "en": "She was still gloating over her rival's disappointment.",
                        "vi": "Cô vẫn hả hê trước sự thất vọng của đối thủ."
                    },
                    {
                        "en": "Having lost a large percentage of the vote, they were in no position to gloat.",
                        "vi": "Bị mất một tỷ lệ lớn phiếu bầu, họ không có tư cách gì để hả hê."
                    },
                    {
                        "en": "I hope you haven’t just come here to gloat.",
                        "vi": "Tôi hy vọng bạn không chỉ đến đây để hả hê."
                    },
                    {
                        "en": "He didn't want to hear her gloating at his misfortune.",
                        "vi": "Anh không muốn nghe cô hả hê trước bất hạnh của mình."
                    }
                ]
            }
        ]
    },
    {
        "id": "ebaaec3ddec54d93b8a91be14cc916e1",
        "word": "gloating",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɡləʊtɪŋ/",
            "us": "/ˈɡləʊtɪŋ/"
        },
        "nearby": [
            {
                "word": "the gloaming",
                "pos": "noun"
            },
            {
                "word": "gloat",
                "pos": "verb"
            },
            {
                "word": "gloating",
                "pos": "adjective"
            },
            {
                "word": "glob",
                "pos": "noun"
            },
            {
                "word": "global",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "showing that you are happy about your own success or somebody else's failure, in an unpleasant way",
                    "vi": "cho thấy rằng bạn hạnh phúc về thành công của chính mình hoặc thất bại của người khác, một cách khó chịu"
                },
                "examples": [
                    {
                        "en": "a gloating look",
                        "vi": "một cái nhìn hả hê"
                    }
                ]
            }
        ]
    },
    {
        "id": "f4c90e5f8bc44bbf9d8938adac5479c4",
        "word": "Grammy",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɡræmi/",
            "us": "/ˈɡræmi/"
        },
        "nearby": [
            {
                "word": "grammatically",
                "pos": "adverb"
            },
            {
                "word": "gramme",
                "pos": "noun"
            },
            {
                "word": "Grammy",
                "pos": "noun"
            },
            {
                "word": "gramophone",
                "pos": "noun"
            },
            {
                "word": "the Grampians",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "one of the awards for achievement in the music industry given every year by the US National Academy of Recording Arts and Sciences",
                    "vi": "một trong những giải thưởng về thành tựu trong ngành công nghiệp âm nhạc do Viện Hàn lâm Khoa học và Nghệ thuật Thu âm Quốc gia Hoa Kỳ trao tặng hàng năm"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "1107e86f31504685a24e7692a2882bc8",
        "word": "high",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/haɪ/",
            "us": "/haɪ/"
        },
        "nearby": [
            {
                "word": "high",
                "pos": "adjective"
            },
            {
                "word": "high",
                "pos": "adverb"
            },
            {
                "word": "high",
                "pos": "noun"
            },
            {
                "word": "high and tight",
                "pos": "noun"
            },
            {
                "word": "highball",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the highest level or number",
                    "vi": "mức hoặc số cao nhất"
                },
                "examples": [
                    {
                        "en": "to hit/reach a high",
                        "vi": "đạt / đạt đến mức cao"
                    },
                    {
                        "en": "Exports are currently at record highs.",
                        "vi": "Xuất khẩu hiện đang ở mức cao kỷ lục."
                    },
                    {
                        "en": "Profits reached an all-time high last year.",
                        "vi": "Lợi nhuận đạt mức cao nhất mọi thời đại vào năm ngoái."
                    }
                ]
            },
            {
                "define": {
                    "en": "an area of high air pressure; an anticyclone",
                    "vi": "khu vực có áp suất không khí cao; thuốc chống co thắt"
                },
                "examples": [
                    {
                        "en": "A high over southern Europe is bringing fine, sunny weather to all parts.",
                        "vi": "Một vùng cao phía nam châu Âu đang mang lại thời tiết nắng đẹp cho tất cả các vùng."
                    }
                ]
            },
            {
                "define": {
                    "en": "the highest temperature reached during a particular day, week, etc.",
                    "vi": "nhiệt độ cao nhất đạt được trong một ngày, tuần cụ thể, v.v."
                },
                "examples": [
                    {
                        "en": "Highs today will be in the region of 25°C.",
                        "vi": "Nhiệt độ cao nhất trong ngày hôm nay sẽ là trong khu vực 25 ° C."
                    }
                ]
            },
            {
                "define": {
                    "en": "the feeling of extreme pleasure and excitement that somebody gets after taking some types of drugs",
                    "vi": "cảm giác sung sướng và phấn khích tột độ mà ai đó có được sau khi dùng một số loại ma túy"
                },
                "examples": [
                    {
                        "en": "The high lasted all night.",
                        "vi": "Cơn cao kéo dài suốt đêm."
                    }
                ]
            },
            {
                "define": {
                    "en": "the feeling of extreme pleasure and excitement that somebody gets from doing something fun or being successful at something",
                    "vi": "cảm giác cực kỳ vui vẻ và phấn khích mà ai đó có được khi làm một điều gì đó thú vị hoặc thành công ở một điều gì đó"
                },
                "examples": [
                    {
                        "en": "He was on a real high after winning the competition.",
                        "vi": "Anh ấy đang ở một đỉnh cao thực sự sau khi chiến thắng cuộc thi."
                    },
                    {
                        "en": "the highs and lows of her acting career",
                        "vi": "thăng trầm trong sự nghiệp diễn xuất của cô ấy"
                    }
                ]
            },
            {
                "define": {
                    "en": "used in the name of a high school",
                    "vi": "được sử dụng trong tên của một trường trung học"
                },
                "examples": [
                    {
                        "en": "He graduated from Little Rock High in 2012.",
                        "vi": "Anh tốt nghiệp trường Little Rock High năm 2012."
                    }
                ]
            },
            {
                "define": {
                    "en": "in a high place",
                    "vi": "ở một nơi cao"
                },
                "examples": [
                    {
                        "en": "We gazed down into the valley from on high.",
                        "vi": "Chúng tôi nhìn xuống thung lũng từ trên cao."
                    }
                ]
            },
            {
                "define": {
                    "en": "the people in senior positions in an organization",
                    "vi": "những người ở vị trí cấp cao trong một tổ chức"
                },
                "examples": [
                    {
                        "en": "An order came down from on high that lunchbreaks were to be half an hour and no longer.",
                        "vi": "Một mệnh lệnh từ trên cao xuống rằng giờ nghỉ trưa sẽ kéo dài nửa giờ và không còn nữa."
                    }
                ]
            },
            {
                "define": {
                    "en": "in heaven",
                    "vi": "ở trên thiên đường"
                },
                "examples": [
                    {
                        "en": "The disaster was seen as a judgement from on high.",
                        "vi": "Thảm họa được coi như một bản án từ trên cao."
                    }
                ]
            }
        ]
    },
    {
        "id": "4747a67230f6445ea50fcd69c8019bb3",
        "word": "Jai",
        "pos": "exclamation",
        "level": "c2",
        "phonetic": {
            "uk": "/dʒaɪ/",
            "us": "/dʒaɪ/"
        },
        "nearby": [
            {
                "word": "jaguar",
                "pos": "noun"
            },
            {
                "word": "Jaguar",
                "pos": ""
            },
            {
                "word": "Jai",
                "pos": "exclamation"
            },
            {
                "word": "jai alai",
                "pos": "noun"
            },
            {
                "word": "jail",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "used to show that you support or admire a leader, a nation, etc., or that you are pleased that they have been successful; an expression of worship to a god",
                    "vi": "được sử dụng để thể hiện rằng bạn ủng hộ hoặc ngưỡng mộ một nhà lãnh đạo, một quốc gia, v.v., hoặc bạn hài lòng vì họ đã thành công; một biểu hiện của sự tôn thờ đối với một vị thần"
                },
                "examples": [
                    {
                        "en": "The whole crowd shouted ‘Jai Mahatma!’",
                        "vi": "Cả đám đông hét lên 'Jai Mahatma!'"
                    }
                ]
            }
        ]
    },
    {
        "id": "9e631ce54b8a4802aafc35b43c7d0955",
        "word": "jubilant",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈdʒuːbɪlənt/",
            "us": "/ˈdʒuːbɪlənt/"
        },
        "nearby": [
            {
                "word": "JSC",
                "pos": ""
            },
            {
                "word": "juakali",
                "pos": "noun"
            },
            {
                "word": "jubilant",
                "pos": "adjective"
            },
            {
                "word": "jubilantly",
                "pos": "adverb"
            },
            {
                "word": "jubilation",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "feeling or showing great happiness because of a success",
                    "vi": "cảm thấy hoặc thể hiện niềm hạnh phúc tuyệt vời vì một thành công"
                },
                "examples": [
                    {
                        "en": "The fans were in jubilant mood after the victory.",
                        "vi": "Các cổ động viên có tâm trạng tưng bừng sau chiến thắng."
                    }
                ]
            }
        ]
    },
    {
        "id": "f50ac248796f46ce998581a638adbdeb",
        "word": "jubilation",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌdʒuːbɪˈleɪʃn/",
            "us": "/ˌdʒuːbɪˈleɪʃn/"
        },
        "nearby": [
            {
                "word": "jubilant",
                "pos": "adjective"
            },
            {
                "word": "jubilantly",
                "pos": "adverb"
            },
            {
                "word": "jubilation",
                "pos": "noun"
            },
            {
                "word": "jubilee",
                "pos": "noun"
            },
            {
                "word": "Judaic",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a feeling of great happiness because of a success",
                    "vi": "cảm giác vô cùng hạnh phúc vì thành công"
                },
                "examples": [
                    {
                        "en": "There were scenes of jubilation among her supporters.",
                        "vi": "Có những cảnh tượng vui mừng giữa những người ủng hộ cô."
                    },
                    {
                        "en": "her jubilation at reaching the final",
                        "vi": "sự hân hoan của cô ấy khi lọt vào trận chung kết"
                    }
                ]
            }
        ]
    },
    {
        "id": "7562af36dd454ca9a57cf14563d16221",
        "word": "kudos",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkjuːdɒs/",
            "us": "/ˈkuːdɑːs/"
        },
        "nearby": [
            {
                "word": "Kubla Khan",
                "pos": ""
            },
            {
                "word": "Stanley Kubrick",
                "pos": ""
            },
            {
                "word": "kudos",
                "pos": "noun"
            },
            {
                "word": "kudu",
                "pos": "noun"
            },
            {
                "word": "kudzu",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the praise and honour that goes with a particular achievement or position",
                    "vi": "sự khen ngợi và tôn vinh đi kèm với một thành tích hoặc vị trí cụ thể"
                },
                "examples": [
                    {
                        "en": "the kudos of playing for such a famous team",
                        "vi": "kudo khi chơi cho một đội nổi tiếng như vậy"
                    }
                ]
            },
            {
                "define": {
                    "en": "special praise to somebody for something they have done",
                    "vi": "đặc biệt khen ngợi ai đó vì điều gì đó họ đã làm"
                },
                "examples": [
                    {
                        "en": "Kudos to Bill for fixing that problem.",
                        "vi": "Kudos cho Bill vì đã khắc phục sự cố đó."
                    },
                    {
                        "en": "Special kudos goes to Patrick Stewart for his role as the captain.",
                        "vi": "Patrick Stewart được khen ngợi bởi vai trò là đội trưởng."
                    },
                    {
                        "en": "You have to give her kudos for keeping it secret.",
                        "vi": "Bạn phải cho cô ấy kudo vì đã giữ bí mật."
                    }
                ]
            }
        ]
    },
    {
        "id": "e7b0f52c11cd4bf786f44d8bfa6e64f0",
        "word": "laudable",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈlɔːdəbl/",
            "us": "/ˈlɔːdəbl/"
        },
        "nearby": [
            {
                "word": "Latvian",
                "pos": "noun, adjective"
            },
            {
                "word": "laud",
                "pos": "verb"
            },
            {
                "word": "laudable",
                "pos": "adjective"
            },
            {
                "word": "laudably",
                "pos": "adverb"
            },
            {
                "word": "laudanum",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "deserving to be praised or admired, even if not really successful",
                    "vi": "đáng được khen ngợi hoặc ngưỡng mộ, ngay cả khi không thực sự thành công"
                },
                "examples": [
                    {
                        "en": "a laudable aim/attempt",
                        "vi": "một mục tiêu / nỗ lực đáng khen ngợi"
                    },
                    {
                        "en": "It was a laudable attempt to end the stalemate in the talks.",
                        "vi": "Đó là một nỗ lực đáng khen ngợi để chấm dứt sự bế tắc trong các cuộc đàm phán."
                    },
                    {
                        "en": "Laudable though these aims are, they are not likely to succeed.",
                        "vi": "Mặc dù những mục tiêu này là đáng khen ngợi, nhưng chúng không có khả năng thành công."
                    }
                ]
            }
        ]
    },
    {
        "id": "368b9a63d54147e8872f49c054c53577",
        "word": "laugh",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/lɑːf/",
            "us": "/læf/"
        },
        "nearby": [
            {
                "word": "Estée Lauder",
                "pos": ""
            },
            {
                "word": "Harry Lauder",
                "pos": ""
            },
            {
                "word": "laugh",
                "pos": "verb"
            },
            {
                "word": "laugh",
                "pos": "noun"
            },
            {
                "word": "laughable",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to make the sounds and movements of your face that show you think something is funny or silly",
                    "vi": "để tạo ra âm thanh và chuyển động của khuôn mặt cho thấy bạn nghĩ rằng điều gì đó thật buồn cười hoặc ngớ ngẩn"
                },
                "examples": [
                    {
                        "en": "to laugh out loud",
                        "vi": "cười thành tiếng"
                    },
                    {
                        "en": "to laugh loudly/aloud/heartily",
                        "vi": "cười to / to / chân thành"
                    },
                    {
                        "en": "When I heard her excuse, I just laughed.",
                        "vi": "Khi nghe cô ấy bào chữa, tôi chỉ biết cười trừ."
                    },
                    {
                        "en": "I was laughing so hard that I had tears running down my cheeks.",
                        "vi": "Tôi đã cười đến mức nước mắt chảy dài trên má."
                    },
                    {
                        "en": "The show was hilarious—I couldn't stop laughing.",
                        "vi": "Chương trình rất vui nhộn - tôi không thể ngừng cười."
                    },
                    {
                        "en": "laugh at something You never laugh at my jokes!",
                        "vi": "cười vào cái gì đó Bạn không bao giờ cười trước những câu chuyện cười của tôi!"
                    },
                    {
                        "en": "laugh about something She was laughing hysterically about something he had said.",
                        "vi": "cười về điều gì đó Cô ấy đang cười một cách cuồng loạn về điều gì đó anh đã nói."
                    },
                    {
                        "en": "She always makes me laugh.",
                        "vi": "Cô ấy luôn làm tôi cười."
                    },
                    {
                        "en": "He burst out laughing (= suddenly started laughing).",
                        "vi": "Anh ấy phá lên cười (= đột nhiên bắt đầu cười)."
                    },
                    {
                        "en": "She laughed to cover her nervousness.",
                        "vi": "Cô ấy cười để che đi sự lo lắng của mình."
                    },
                    {
                        "en": "I told him I was worried but he laughed scornfully.",
                        "vi": "Tôi nói với anh ấy rằng tôi lo lắng nhưng anh ấy cười khinh bỉ."
                    },
                    {
                        "en": "She laughed and said, ‘You silly man!’",
                        "vi": "Cô ấy cười và nói, 'Đồ ngốc!'"
                    },
                    {
                        "en": "+ speech ‘You're crazy!’ she laughed.",
                        "vi": "Err:509"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that you are in a very good position, especially because you have done something successfully",
                    "vi": "thường nói rằng bạn đang ở một vị trí rất tốt, đặc biệt là vì bạn đã làm một điều gì đó thành công"
                },
                "examples": [
                    {
                        "en": "If we win the next game we'll be laughing.",
                        "vi": "Nếu chúng tôi thắng trận tiếp theo, chúng tôi sẽ cười."
                    }
                ]
            },
            {
                "define": {
                    "en": "to find something extremely funny",
                    "vi": "để tìm một cái gì đó cực kỳ vui nhộn"
                },
                "examples": [
                    {
                        "en": "I nearly died laughing when she said that.",
                        "vi": "Tôi gần chết cười khi cô ấy nói vậy."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to show that you think what somebody has just said is impossible or stupid",
                    "vi": "được sử dụng để cho thấy rằng bạn nghĩ những gì ai đó vừa nói là không thể hoặc ngu ngốc"
                },
                "examples": [
                    {
                        "en": "‘Will your dad lend you the money?’ ‘Don't make me laugh!’",
                        "vi": "Bố của bạn sẽ cho bạn vay tiền chứ?' 'Đừng chọc tôi cười!'"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to tell somebody not to be too proud of their present success; in the end another person may be more successful",
                    "vi": "từng nói với ai đó rằng đừng quá tự hào về thành công hiện tại của họ; cuối cùng một người khác có thể thành công hơn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to laugh a lot",
                    "vi": "cười nhiều"
                },
                "examples": [
                    {
                        "en": "He was killing himself laughing.",
                        "vi": "Anh ta đang tự giết mình khi cười."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make a lot of money easily and feel very pleased about it",
                    "vi": "để kiếm được nhiều tiền một cách dễ dàng và cảm thấy rất hài lòng về điều đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to laugh very loudly and for a long time",
                    "vi": "cười rất lớn và trong một thời gian dài"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to show in a very obvious way that you have no respect for somebody",
                    "vi": "thể hiện một cách rất rõ ràng rằng bạn không tôn trọng ai đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to laugh very loudly",
                    "vi": "cười rất to"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be forced to change from feeling pleased or satisfied to feeling disappointed or annoyed",
                    "vi": "buộc phải thay đổi từ cảm thấy hài lòng hoặc hài lòng sang cảm thấy thất vọng hoặc khó chịu"
                },
                "examples": [
                    {
                        "en": "He’ll be laughing on the other side of his face when he reads my letter.",
                        "vi": "Anh ấy sẽ cười trên khuôn mặt khác khi đọc bức thư của tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to completely reject an idea, a story, etc. that you think is not worth taking seriously at all",
                    "vi": "bác bỏ hoàn toàn một ý tưởng, một câu chuyện, v.v. mà bạn cho rằng không đáng để thực hiện một cách nghiêm túc"
                },
                "examples": [
                    {
                        "en": "All his attempts at explanation were simply laughed out of court.",
                        "vi": "Tất cả những nỗ lực giải thích của anh ấy chỉ đơn giản là bị cười trừ trước tòa."
                    }
                ]
            },
            {
                "define": {
                    "en": "to laugh so long and hard that there are tears in your eyes",
                    "vi": "cười thật lâu và thật nhiều nước mắt"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to secretly think that something is funny",
                    "vi": "thầm nghĩ rằng điều gì đó thật vui nhộn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be unable to decide how to react to a bad situation",
                    "vi": "không thể quyết định cách phản ứng với một tình huống xấu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to laugh very hard",
                    "vi": "cười rất tươi"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to laugh a lot at somebody/something",
                    "vi": "cười thật nhiều vào ai đó / cái gì đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to say that you think there is a funny side to a situation",
                    "vi": "được sử dụng để nói rằng bạn nghĩ rằng có một mặt hài hước trong một tình huống"
                },
                "examples": [
                    {
                        "en": "Well, I'm sorry you've lost your shoes, but you've got to laugh, haven't you?",
                        "vi": "Tôi xin lỗi vì bạn đã làm mất đôi giày của mình, nhưng bạn phải cười, phải không?"
                    }
                ]
            }
        ]
    },
    {
        "id": "2afdd0e460ea4a0d88a325c6ea24a9af",
        "word": "laurel",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈlɒrəl/",
            "us": "/ˈlɔːrəl/"
        },
        "nearby": [
            {
                "word": "Laurasia",
                "pos": "noun"
            },
            {
                "word": "laureate",
                "pos": "noun"
            },
            {
                "word": "laurel",
                "pos": "noun"
            },
            {
                "word": "Laurel and Hardy",
                "pos": ""
            },
            {
                "word": "laurel wreath",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a bush or tree with dark, smooth, shiny leaves that remain on the bush and stay green through the year",
                    "vi": "một bụi hoặc cây có lá sẫm, nhẵn, bóng, vẫn còn trên bụi và xanh tốt qua năm"
                },
                "examples": [
                    {
                        "en": "a laurel hedge",
                        "vi": "hàng rào nguyệt quế"
                    }
                ]
            },
            {
                "define": {
                    "en": "honour and praise given to somebody because of something that they have achieved",
                    "vi": "danh dự và lời khen ngợi dành cho ai đó vì điều gì đó mà họ đã đạt được"
                },
                "examples": [
                    {
                        "en": "She won laurels for her first novel.",
                        "vi": "Cô đã giành được vòng nguyệt quế cho cuốn tiểu thuyết đầu tay của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be careful that you do not lose the success or advantage that you have over other people",
                    "vi": "hãy cẩn thận để bạn không đánh mất thành công hoặc lợi thế mà bạn có so với những người khác"
                },
                "examples": [
                    {
                        "en": "With so many good new actors around the older ones are having to look to their laurels.",
                        "vi": "Với rất nhiều diễn viên mới giỏi xung quanh những diễn viên cũ đang phải tìm kiếm vòng nguyệt quế của họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to feel so satisfied with what you have already achieved that you do not try to do any more",
                    "vi": "cảm thấy rất hài lòng với những gì bạn đã đạt được mà bạn không cố gắng làm thêm nữa"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "41140cfa9c67481eab07185a7c5bbecc",
        "word": "MBE",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌem biː ˈiː/",
            "us": "/ˌem biː ˈiː/"
        },
        "nearby": [
            {
                "word": "Mb",
                "pos": "abbreviation"
            },
            {
                "word": "MBA",
                "pos": "noun"
            },
            {
                "word": "MBE",
                "pos": "noun"
            },
            {
                "word": "mbira",
                "pos": "noun"
            },
            {
                "word": "MC",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an award given to some people in the UK for a special achievement; a person who has received this award (the abbreviation for ‘Member (of the Order) of the British Empire’)",
                    "vi": "một giải thưởng được trao cho một số người ở Vương quốc Anh vì một thành tích đặc biệt; một người đã nhận được giải thưởng này (tên viết tắt của 'Thành viên (của Trật tự) của Đế quốc Anh')"
                },
                "examples": [
                    {
                        "en": "She was made an MBE in 2007.",
                        "vi": "Cô ấy đã được làm MBE vào năm 2007."
                    },
                    {
                        "en": "Jim Cronin MBE",
                        "vi": "Jim Cronin MBE"
                    }
                ]
            }
        ]
    },
    {
        "id": "d5b7e0a13aab4dc48d4db2f56f19cc43",
        "word": "mission accomplished",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmɪʃn/",
            "us": "/ˈmɪʃn/"
        },
        "nearby": [
            {
                "word": "missing link",
                "pos": "noun"
            },
            {
                "word": "missing person",
                "pos": "noun"
            },
            {
                "word": "mission",
                "pos": "noun"
            },
            {
                "word": "missionary",
                "pos": "noun"
            },
            {
                "word": "the missionary position",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an important official job that a person or group of people is given to do, especially when they are sent to another country",
                    "vi": "một công việc chính thức quan trọng mà một người hoặc một nhóm người được giao làm, đặc biệt là khi họ được cử đến một quốc gia khác"
                },
                "examples": [
                    {
                        "en": "She led a recent trade mission to China.",
                        "vi": "Cô ấy đã dẫn đầu một phái đoàn thương mại gần đây đến Trung Quốc."
                    },
                    {
                        "en": "Thomas More toured Antwerp on a diplomatic mission for the king.",
                        "vi": "Thomas More đã đi thăm Antwerp trong một sứ mệnh ngoại giao cho nhà vua."
                    },
                    {
                        "en": "It was too late to launch a rescue mission.",
                        "vi": "Đã quá muộn để thực hiện một nhiệm vụ giải cứu."
                    },
                    {
                        "en": "They undertook a fact-finding mission in the region.",
                        "vi": "Họ đã thực hiện một nhiệm vụ tìm hiểu thực tế trong khu vực."
                    },
                    {
                        "en": "a mercy mission to aid homeless refugees",
                        "vi": "một sứ mệnh nhân từ để hỗ trợ những người tị nạn vô gia cư"
                    }
                ]
            },
            {
                "define": {
                    "en": "a group of people doing such a job; the place where they work",
                    "vi": "một nhóm người đang làm một công việc như vậy; nơi họ làm việc"
                },
                "examples": [
                    {
                        "en": "He is the head of the British mission in Berlin.",
                        "vi": "Ông là người đứng đầu phái bộ của Anh tại Berlin."
                    }
                ]
            },
            {
                "define": {
                    "en": "the work of teaching people about Christianity, especially in a foreign country; a group of people doing such work",
                    "vi": "công việc giảng dạy cho mọi người về Cơ đốc giáo, đặc biệt là ở nước ngoài; một nhóm người làm công việc như vậy"
                },
                "examples": [
                    {
                        "en": "Gandhi’s attitude to mission and conversion",
                        "vi": "Thái độ của Gandhi đối với sứ mệnh và sự cải đạo"
                    },
                    {
                        "en": "a Catholic mission in Africa",
                        "vi": "một sứ mệnh Công giáo ở Châu Phi"
                    },
                    {
                        "en": "She took up a position as a school teacher at St Peter's mission in Montana.",
                        "vi": "Cô đã nhận một vị trí như một giáo viên trường học tại giáo khu St Peter ở Montana."
                    }
                ]
            },
            {
                "define": {
                    "en": "a building or group of buildings used by a Christian mission",
                    "vi": "một tòa nhà hoặc một nhóm tòa nhà được sử dụng bởi một cơ quan truyền giáo Cơ đốc"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "particular work that you feel it is your duty to do",
                    "vi": "công việc cụ thể mà bạn cảm thấy đó là nhiệm vụ của bạn"
                },
                "examples": [
                    {
                        "en": "Her mission in life was to work with the homeless.",
                        "vi": "Nhiệm vụ của cô trong cuộc đời là làm việc với những người vô gia cư."
                    },
                    {
                        "en": "We are committed to the mission of helping students realize their full potential.",
                        "vi": "Chúng tôi cam kết thực hiện sứ mệnh giúp sinh viên phát huy hết tiềm năng của mình."
                    },
                    {
                        "en": "You can tell by the determined way he talks that he is a man with a mission.",
                        "vi": "Bạn có thể biết qua cách nói chuyện kiên quyết của anh ấy rằng anh ấy là một người đàn ông có sứ mệnh."
                    }
                ]
            },
            {
                "define": {
                    "en": "an important job that is done by a soldier, group of soldiers, etc.",
                    "vi": "một công việc quan trọng được thực hiện bởi một người lính, một nhóm binh lính, v.v."
                },
                "examples": [
                    {
                        "en": "The squadron flew on a reconnaissance mission.",
                        "vi": "Phi đội bay làm nhiệm vụ trinh sát."
                    },
                    {
                        "en": "The military are fulfilling an important peacekeeping mission.",
                        "vi": "Quân đội đang hoàn thành sứ mệnh gìn giữ hòa bình quan trọng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a flight into space",
                    "vi": "một chuyến bay vào vũ trụ"
                },
                "examples": [
                    {
                        "en": "a US space mission",
                        "vi": "một sứ mệnh không gian của Hoa Kỳ"
                    },
                    {
                        "en": "He's been on several shuttle missions over the last decade.",
                        "vi": "Anh ấy đã thực hiện một số nhiệm vụ tàu con thoi trong thập kỷ qua."
                    }
                ]
            },
            {
                "define": {
                    "en": "a task or journey that is very difficult and takes a long time to complete",
                    "vi": "một nhiệm vụ hoặc hành trình rất khó khăn và mất nhiều thời gian để hoàn thành"
                },
                "examples": [
                    {
                        "en": "It's a mission to get there.",
                        "vi": "Đó là một nhiệm vụ để đến đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "used when you have successfully completed what you have had to do",
                    "vi": "được sử dụng khi bạn đã hoàn thành thành công những gì bạn phải làm"
                },
                "examples": [
                    {
                        "en": "Mission accomplished, we headed for home.",
                        "vi": "Nhiệm vụ hoàn thành, chúng tôi về nhà."
                    }
                ]
            },
            {
                "define": {
                    "en": "a difficult or impossible task",
                    "vi": "một nhiệm vụ khó khăn hoặc bất khả thi"
                },
                "examples": [
                    {
                        "en": "Many regard this task as mission impossible.",
                        "vi": "Nhiều người coi nhiệm vụ này là nhiệm vụ bất khả thi."
                    }
                ]
            }
        ]
    },
    {
        "id": "bb2a572f5bf040d48ea0cb10b1f9ec39",
        "word": "nice work if you can get it",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/naɪs/",
            "us": "/naɪs/"
        },
        "nearby": [
            {
                "word": "Nicaragua",
                "pos": "noun"
            },
            {
                "word": "Nicaraguan",
                "pos": "noun, adjective"
            },
            {
                "word": "nice",
                "pos": "adjective"
            },
            {
                "word": "nice-looking",
                "pos": "adjective"
            },
            {
                "word": "nicely",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "pleasant or attractive",
                    "vi": "dễ chịu hoặc hấp dẫn"
                },
                "examples": [
                    {
                        "en": "a nice day/smile/place",
                        "vi": "một ngày tốt lành / nụ cười / địa điểm"
                    },
                    {
                        "en": "nice weather",
                        "vi": "thời tiết đẹp"
                    },
                    {
                        "en": "Did you have a nice time?",
                        "vi": "Bạn có khoảng thời gian tuyệt chứ?"
                    },
                    {
                        "en": "You look very nice.",
                        "vi": "Trông bạn tuyệt quá."
                    },
                    {
                        "en": "We all had the flu last week—it wasn't very nice.",
                        "vi": "Tất cả chúng tôi đều bị cúm tuần trước — nó không tốt lắm."
                    },
                    {
                        "en": "‘Do you want to come, too?’ ‘Yes, that would be nice.’",
                        "vi": "Bạn có muốn đến không?' 'Vâng, thật tốt quá.'"
                    },
                    {
                        "en": "The nicest thing about her is that she never criticizes us.",
                        "vi": "Điều tuyệt vời nhất ở cô ấy là cô ấy không bao giờ chỉ trích chúng tôi."
                    },
                    {
                        "en": "It was a nice touch to end the film as it started.",
                        "vi": "Đó là một liên lạc tốt đẹp để kết thúc bộ phim khi nó bắt đầu."
                    },
                    {
                        "en": "it is nice to do something It's nice to know that somebody appreciates what I do.",
                        "vi": "thật tuyệt khi làm điều gì đó Thật tuyệt khi biết rằng ai đó đánh giá cao những gì tôi làm."
                    },
                    {
                        "en": "Nice to meet you! (= a friendly greeting when you meet somebody for the first time)",
                        "vi": "Hân hạnh được biết bạn! (= một lời chào thân thiện khi bạn gặp ai đó lần đầu tiên)"
                    },
                    {
                        "en": "It is nice doing something It's been nice meeting you.",
                        "vi": "Thật là vui khi được làm điều gì đó. Rất vui được gặp bạn."
                    },
                    {
                        "en": "it is nice that… It's nice that you can come with us.",
                        "vi": "thật tuyệt khi… Thật vui khi bạn có thể đi cùng chúng tôi."
                    },
                    {
                        "en": "it would be nice if… It would be nice if he moved to London.",
                        "vi": "thật tuyệt nếu… Thật tuyệt nếu anh ấy chuyển đến London."
                    }
                ]
            },
            {
                "define": {
                    "en": "used before adjectives or adverbs to emphasize how pleasant something is",
                    "vi": "được sử dụng trước tính từ hoặc trạng từ để nhấn mạnh điều gì đó dễ chịu như thế nào"
                },
                "examples": [
                    {
                        "en": "a nice hot bath",
                        "vi": "một bồn tắm nước nóng tuyệt vời"
                    },
                    {
                        "en": "a nice long walk",
                        "vi": "một chuyến đi bộ dài"
                    },
                    {
                        "en": "It's a nice little place you have here.",
                        "vi": "Đó là một nơi nhỏ tốt đẹp mà bạn có ở đây."
                    },
                    {
                        "en": "nice and… He seemed nice and friendly.",
                        "vi": "tốt và… Anh ấy có vẻ dễ mến và thân thiện."
                    },
                    {
                        "en": "It was nice and warm yesterday.",
                        "vi": "Hôm qua thật đẹp và ấm áp."
                    },
                    {
                        "en": "Everyone arrived nice and early.",
                        "vi": "Mọi người đến sớm và tốt đẹp."
                    },
                    {
                        "en": "I felt nice and cosy.",
                        "vi": "Tôi cảm thấy tốt đẹp và ấm cúng."
                    }
                ]
            },
            {
                "define": {
                    "en": "kind; friendly",
                    "vi": "Tốt bụng; thân thiện"
                },
                "examples": [
                    {
                        "en": "Our new neighbours are very nice.",
                        "vi": "Những người hàng xóm mới của chúng tôi rất tốt."
                    },
                    {
                        "en": "He's a really nice guy.",
                        "vi": "Anh ấy là một chàng trai thực sự tốt."
                    },
                    {
                        "en": "She's one of the nicest people you'll ever meet.",
                        "vi": "Cô ấy là một trong những người đẹp nhất mà bạn từng gặp."
                    },
                    {
                        "en": "nice to somebody Be nice to me. I'm not feeling well.",
                        "vi": "tốt với ai đó Hãy tốt với tôi. Tôi không được khỏe."
                    },
                    {
                        "en": "nice of somebody (to do something) It was nice of them to invite us.",
                        "vi": "tốt của ai đó (để làm điều gì đó) Thật tuyệt khi họ mời chúng tôi."
                    },
                    {
                        "en": "nice about something I complained to the manager and he was very nice about it.",
                        "vi": "tốt về điều gì đó tôi đã phàn nàn với người quản lý và anh ấy rất hài lòng về điều đó."
                    },
                    {
                        "en": "I asked him in the nicest possible way to put his cigarette out.",
                        "vi": "Tôi hỏi anh ấy bằng cách nào tốt nhất có thể để bỏ điếu thuốc của anh ấy ra."
                    }
                ]
            },
            {
                "define": {
                    "en": "bad or unpleasant",
                    "vi": "xấu hoặc khó chịu"
                },
                "examples": [
                    {
                        "en": "That's a nice thing to say!",
                        "vi": "Đó là một điều tốt đẹp để nói!"
                    },
                    {
                        "en": "That's a nice way to speak to your mother!",
                        "vi": "Đó là một cách tốt để nói chuyện với mẹ của bạn!"
                    }
                ]
            },
            {
                "define": {
                    "en": "involving a very small detail or difference",
                    "vi": "liên quan đến một chi tiết rất nhỏ hoặc sự khác biệt"
                },
                "examples": [
                    {
                        "en": "a nice point of law (= one that is difficult to decide)",
                        "vi": "một điểm tốt của luật (= một điểm rất khó quyết định)"
                    }
                ]
            },
            {
                "define": {
                    "en": "very kind and friendly, especially when you are not expecting it",
                    "vi": "rất tốt bụng và thân thiện, đặc biệt là khi bạn không mong đợi điều đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a friendly way of saying goodbye, especially to customers",
                    "vi": "một cách chào tạm biệt thân thiện, đặc biệt là với khách hàng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be pleasant or polite to somebody, especially when you do not really want to",
                    "vi": "tỏ ra dễ chịu hoặc lịch sự với ai đó, đặc biệt là khi bạn không thực sự muốn"
                },
                "examples": [
                    {
                        "en": "He tried to make nice with his ex, even though he was still angry with her.",
                        "vi": "Anh ấy cố gắng làm lành với người yêu cũ, mặc dù anh ấy vẫn còn giận cô ấy."
                    },
                    {
                        "en": "Cole and his opponent made nice for the cameras at the press event.",
                        "vi": "Cole và đối thủ tạo dáng đẹp trước ống kính tại sự kiện họp báo."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to show you are pleased when something good has happened or somebody has said something funny",
                    "vi": "được sử dụng để cho thấy bạn hài lòng khi điều gì đó tốt đẹp đã xảy ra hoặc ai đó đã nói điều gì đó vui nhộn"
                },
                "examples": [
                    {
                        "en": "You got the job? Nice one!",
                        "vi": "Bạn nhận được công việc? Đẹp quá!"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to show you are pleased when somebody has done something well",
                    "vi": "được sử dụng để cho thấy bạn hài lòng khi ai đó đã làm tốt điều gì đó"
                },
                "examples": [
                    {
                        "en": "You did a good job today. Nice work, James!",
                        "vi": "Bạn đã làm một công việc tốt ngày hôm nay. Làm tốt lắm, James!"
                    }
                ]
            },
            {
                "define": {
                    "en": "used when you wish that you had somebody’s success or good luck and think they have achieved it with little effort",
                    "vi": "được sử dụng khi bạn ước rằng bạn có được ai đó thành công hoặc may mắn và nghĩ rằng họ đã đạt được điều đó mà không cần nỗ lực"
                },
                "examples": [
                    {
                        "en": "He was paid £200 for a ten-minute speech? Nice work if you can get it.",
                        "vi": "Anh ta được trả 200 bảng cho một bài phát biểu dài mười phút? Làm tốt lắm nếu bạn có thể nhận được nó."
                    }
                ]
            }
        ]
    },
    {
        "id": "3e51f6b436df4e9fa4548767ac75bc9f",
        "word": "notch",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/nɒtʃ/",
            "us": "/nɑːtʃ/"
        },
        "nearby": [
            {
                "word": "notation",
                "pos": "noun"
            },
            {
                "word": "not care for",
                "pos": "phrasal verb"
            },
            {
                "word": "notch",
                "pos": "noun"
            },
            {
                "word": "notch",
                "pos": "verb"
            },
            {
                "word": "note",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a level on a scale, often marking quality or achievement",
                    "vi": "một cấp độ trên thang điểm, thường đánh dấu chất lượng hoặc thành tích"
                },
                "examples": [
                    {
                        "en": "The quality of the food here has dropped a notch recently.",
                        "vi": "Chất lượng đồ ăn ở đây đã giảm một bậc trong thời gian gần đây."
                    },
                    {
                        "en": "My spirits lifted a few notches when I heard the news.",
                        "vi": "Tinh thần tôi phấn chấn khi nghe tin này."
                    },
                    {
                        "en": "They've dropped their prices a notch or two.",
                        "vi": "Họ đã giảm giá một hoặc hai bậc."
                    }
                ]
            },
            {
                "define": {
                    "en": "a V-shape or a circle cut in an edge or a surface, sometimes used to keep a record of something",
                    "vi": "hình chữ V hoặc hình tròn được cắt theo một cạnh hoặc một bề mặt, đôi khi được sử dụng để ghi lại một cái gì đó"
                },
                "examples": [
                    {
                        "en": "For each day he spent on the island, he cut a new notch in his stick.",
                        "vi": "Đối với mỗi ngày trên đảo, anh ta cắt một vết khía mới trên cây gậy của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "each of a series of holes, for example in a belt",
                    "vi": "mỗi một loạt các lỗ, ví dụ như trong một vành đai"
                },
                "examples": [
                    {
                        "en": "She tightened her belt an extra notch.",
                        "vi": "Cô thắt chặt thắt lưng thêm một rãnh."
                    }
                ]
            }
        ]
    },
    {
        "id": "71e2bfa9459d41148f4a97710eebd2df",
        "word": "OBE",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌəʊ biː ˈiː/",
            "us": "/ˌəʊ biː ˈiː/"
        },
        "nearby": [
            {
                "word": "obdurate",
                "pos": "adjective"
            },
            {
                "word": "obdurately",
                "pos": "adverb"
            },
            {
                "word": "OBE",
                "pos": "noun"
            },
            {
                "word": "obedience",
                "pos": "noun"
            },
            {
                "word": "obedient",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an award given in the UK for a special achievement; a person who has received this award (the abbreviation for ‘Officer of the Order of the British Empire’)",
                    "vi": "một giải thưởng được trao tại Vương quốc Anh cho một thành tích đặc biệt; một người đã nhận được giải thưởng này (chữ viết tắt của 'Sĩ quan của Đế chế Anh')"
                },
                "examples": [
                    {
                        "en": "She was made an OBE.",
                        "vi": "Cô ấy đã được phong làm OBE."
                    },
                    {
                        "en": "Matthew Silk OBE",
                        "vi": "Matthew Silk OBE"
                    }
                ]
            }
        ]
    },
    {
        "id": "5fe35815298149fd9757759013e42e8e",
        "word": "propose a toast (to somebody)",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/prəˈpəʊz/",
            "us": "/prəˈpəʊz/"
        },
        "nearby": [
            {
                "word": "proportioned",
                "pos": "adjective"
            },
            {
                "word": "proposal",
                "pos": "noun"
            },
            {
                "word": "propose",
                "pos": "verb"
            },
            {
                "word": "proposer",
                "pos": "noun"
            },
            {
                "word": "proposition",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to suggest a plan, an idea, etc. for people to think about and decide on",
                    "vi": "đề xuất một kế hoạch, một ý tưởng, v.v. để mọi người suy nghĩ và quyết định"
                },
                "examples": [
                    {
                        "en": "propose something The government proposed changes to the voting system.",
                        "vi": "đề xuất điều gì đó Chính phủ đề xuất những thay đổi đối với hệ thống bỏ phiếu."
                    },
                    {
                        "en": "The Board of Directors is proposing an amendment to Article I.",
                        "vi": "Hội đồng quản trị đang đề xuất sửa đổi Điều I."
                    },
                    {
                        "en": "The three countries had proposed a plan for him to hand over power to a chosen successor.",
                        "vi": "Ba quốc gia đã đề xuất một kế hoạch để ông giao quyền lực cho một người kế vị đã được lựa chọn."
                    },
                    {
                        "en": "What would you propose?",
                        "vi": "Bạn sẽ đề xuất điều gì?"
                    },
                    {
                        "en": "Other services will not be affected by the proposed legislation.",
                        "vi": "Các dịch vụ khác sẽ không bị ảnh hưởng bởi luật đề xuất."
                    },
                    {
                        "en": "It is one of several proposed hospital developments around town.",
                        "vi": "Đây là một trong những dự án phát triển bệnh viện được đề xuất xung quanh thị trấn."
                    },
                    {
                        "en": "Since the idea was first proposed, no action has been taken.",
                        "vi": "Kể từ khi ý tưởng lần đầu tiên được đề xuất, không có hành động nào được thực hiện."
                    },
                    {
                        "en": "a proposed reform/rule/law/project",
                        "vi": "một đề xuất cải cách / quy tắc / luật / dự án"
                    },
                    {
                        "en": "This year we propose a tax increase of 3.9 percent.",
                        "vi": "Năm nay, chúng tôi đề xuất tăng thuế 3,9%."
                    },
                    {
                        "en": "propose that… She proposed that the book be banned.",
                        "vi": "đề xuất rằng… Cô ấy đề xuất rằng cuốn sách bị cấm."
                    },
                    {
                        "en": "(British English also) She proposed that the book should be banned.",
                        "vi": "(Anh Anh cũng vậy) Cô ấy đề xuất rằng cuốn sách nên bị cấm."
                    },
                    {
                        "en": "it is proposed that… It was proposed that the president be elected for a period of two years.",
                        "vi": "nó được đề xuất rằng… Người ta đề xuất rằng tổng thống được bầu trong thời hạn hai năm."
                    },
                    {
                        "en": "propose doing something He proposed changing the name of the company.",
                        "vi": "đề xuất làm điều gì đó Anh ấy đề xuất thay đổi tên của công ty."
                    },
                    {
                        "en": "it is proposed to do something It was proposed to pay the money from public funds.",
                        "vi": "nó được đề xuất để làm một cái gì đó Nó đã được đề xuất để trả tiền từ công quỹ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to intend to do something",
                    "vi": "dự định làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "propose to do something What do you propose to do now?",
                        "vi": "đề xuất làm điều gì đó Bạn đề xuất làm gì bây giờ?"
                    },
                    {
                        "en": "propose doing something How do you propose getting home?",
                        "vi": "đề xuất làm điều gì đó Làm thế nào để bạn đề xuất về nhà?"
                    },
                    {
                        "en": "We do not propose to take any further action in the matter.",
                        "vi": "Chúng tôi không đề xuất thực hiện thêm bất kỳ hành động nào trong vấn đề này."
                    }
                ]
            },
            {
                "define": {
                    "en": "to ask somebody to marry you",
                    "vi": "để hỏi ai đó kết hôn với bạn"
                },
                "examples": [
                    {
                        "en": "He was afraid that if he proposed she might refuse.",
                        "vi": "Anh sợ rằng nếu anh cầu hôn cô có thể sẽ từ chối."
                    },
                    {
                        "en": "propose to somebody She proposed to me!",
                        "vi": "cầu hôn ai đó Cô ấy đã cầu hôn tôi!"
                    },
                    {
                        "en": "propose something (to somebody) to propose marriage",
                        "vi": "cầu hôn một cái gì đó (với ai đó)"
                    }
                ]
            },
            {
                "define": {
                    "en": "to suggest something at a formal meeting and ask people to vote on it",
                    "vi": "đề xuất điều gì đó tại một cuộc họp chính thức và yêu cầu mọi người bỏ phiếu về nó"
                },
                "examples": [
                    {
                        "en": "propose somebody (for/as something) I propose Tom Ellis for chairman.",
                        "vi": "đề xuất ai đó (cho / như một cái gì đó) Tôi đề xuất Tom Ellis cho vị trí chủ tịch."
                    },
                    {
                        "en": "He was proposed for the job of treasurer.",
                        "vi": "Ông đã được đề xuất cho công việc của thủ quỹ."
                    },
                    {
                        "en": "propose something to propose a motion (= to be the main speaker in support of an idea at a formal debate)",
                        "vi": "đề xuất điều gì đó để đề xuất một chuyển động (= trở thành người nói chính ủng hộ một ý tưởng tại một cuộc tranh luận chính thức)"
                    }
                ]
            },
            {
                "define": {
                    "en": "to suggest an explanation of something for people to consider",
                    "vi": "để gợi ý giải thích về điều gì đó để mọi người xem xét"
                },
                "examples": [
                    {
                        "en": "She proposed a possible solution to the mystery.",
                        "vi": "Cô ấy đề xuất một giải pháp khả thi cho bí ẩn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to ask people to wish somebody health, happiness and success by raising their glasses and drinking",
                    "vi": "để yêu cầu mọi người chúc ai đó sức khỏe, hạnh phúc và thành công bằng cách nâng ly của họ và uống"
                },
                "examples": [
                    {
                        "en": "I'd like to propose a toast to the bride and groom.",
                        "vi": "Tôi muốn nâng cốc chúc mừng cô dâu và chú rể."
                    }
                ]
            }
        ]
    },
    {
        "id": "585a10ad68df405780429a8995cca36d",
        "word": "rest/sit on your laurels",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈlɒrəl/",
            "us": "/ˈlɔːrəl/"
        },
        "nearby": [
            {
                "word": "Laurasia",
                "pos": "noun"
            },
            {
                "word": "laureate",
                "pos": "noun"
            },
            {
                "word": "laurel",
                "pos": "noun"
            },
            {
                "word": "Laurel and Hardy",
                "pos": ""
            },
            {
                "word": "laurel wreath",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a bush or tree with dark, smooth, shiny leaves that remain on the bush and stay green through the year",
                    "vi": "một bụi hoặc cây có lá sẫm, nhẵn, bóng, vẫn còn trên bụi và xanh tốt qua năm"
                },
                "examples": [
                    {
                        "en": "a laurel hedge",
                        "vi": "hàng rào nguyệt quế"
                    }
                ]
            },
            {
                "define": {
                    "en": "honour and praise given to somebody because of something that they have achieved",
                    "vi": "danh dự và lời khen ngợi dành cho ai đó vì điều gì đó mà họ đã đạt được"
                },
                "examples": [
                    {
                        "en": "She won laurels for her first novel.",
                        "vi": "Cô đã giành được vòng nguyệt quế cho cuốn tiểu thuyết đầu tay của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be careful that you do not lose the success or advantage that you have over other people",
                    "vi": "hãy cẩn thận để bạn không đánh mất thành công hoặc lợi thế mà bạn có so với những người khác"
                },
                "examples": [
                    {
                        "en": "With so many good new actors around the older ones are having to look to their laurels.",
                        "vi": "Với rất nhiều diễn viên mới giỏi xung quanh những diễn viên cũ đang phải tìm kiếm vòng nguyệt quế của họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to feel so satisfied with what you have already achieved that you do not try to do any more",
                    "vi": "cảm thấy rất hài lòng với những gì bạn đã đạt được mà bạn không cố gắng làm thêm nữa"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "dd992db2b3e3439598dd5bfcafbe18de",
        "word": "self-satisfaction",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌself sætɪsˈfækʃn/",
            "us": "/ˌself sætɪsˈfækʃn/"
        },
        "nearby": [
            {
                "word": "self-sacrificing",
                "pos": "adjective"
            },
            {
                "word": "selfsame",
                "pos": "adjective"
            },
            {
                "word": "self-satisfaction",
                "pos": "noun"
            },
            {
                "word": "self-satisfied",
                "pos": "adjective"
            },
            {
                "word": "self-seeking",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the fact of being too pleased with yourself or your own achievements",
                    "vi": "thực tế là quá hài lòng với bản thân hoặc thành tích của riêng bạn"
                },
                "examples": [
                    {
                        "en": "a look of self-satisfaction",
                        "vi": "một cái nhìn của sự hài lòng về bản thân"
                    }
                ]
            }
        ]
    },
    {
        "id": "ebbc13de953b4801a49b102256a9b705",
        "word": "self-satisfied",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌself ˈsætɪsfaɪd/",
            "us": "/ˌself ˈsætɪsfaɪd/"
        },
        "nearby": [
            {
                "word": "selfsame",
                "pos": "adjective"
            },
            {
                "word": "self-satisfaction",
                "pos": "noun"
            },
            {
                "word": "self-satisfied",
                "pos": "adjective"
            },
            {
                "word": "self-seeking",
                "pos": "adjective"
            },
            {
                "word": "self-seeking",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "too pleased with yourself or your own achievements",
                    "vi": "quá hài lòng với bản thân hoặc thành tích của chính mình"
                },
                "examples": [
                    {
                        "en": "He had a self-satisfied smirk on his face.",
                        "vi": "Anh nở một nụ cười tự mãn trên khuôn mặt."
                    },
                    {
                        "en": "She was so sure of herself, so self-satisfied.",
                        "vi": "Cô quá chắc chắn về bản thân, rất tự mãn."
                    }
                ]
            }
        ]
    },
    {
        "id": "e58409c93f044e10bb9d89423c4c5c5e",
        "word": "smug",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/smʌɡ/",
            "us": "/smʌɡ/"
        },
        "nearby": [
            {
                "word": "smudge",
                "pos": "verb"
            },
            {
                "word": "smudgy",
                "pos": "adjective"
            },
            {
                "word": "smug",
                "pos": "adjective"
            },
            {
                "word": "smuggle",
                "pos": "verb"
            },
            {
                "word": "smuggler",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "looking or feeling too pleased about something you have done or achieved",
                    "vi": "nhìn hoặc cảm thấy quá hài lòng về điều gì đó bạn đã làm hoặc đạt được"
                },
                "examples": [
                    {
                        "en": "a smug expression/smile/face, etc.",
                        "vi": "biểu cảm / nụ cười / khuôn mặt tự mãn, v.v."
                    },
                    {
                        "en": "What are you looking so smug about?",
                        "vi": "Bạn đang trông tự mãn về điều gì vậy?"
                    }
                ]
            }
        ]
    },
    {
        "id": "3c9c0f6c08a04e96a3600c4823558b8b",
        "word": "smugly",
        "pos": "adverb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsmʌɡli/",
            "us": "/ˈsmʌɡli/"
        },
        "nearby": [
            {
                "word": "smuggler",
                "pos": "noun"
            },
            {
                "word": "smuggling",
                "pos": "noun"
            },
            {
                "word": "smugly",
                "pos": "adverb"
            },
            {
                "word": "smugness",
                "pos": "noun"
            },
            {
                "word": "smut",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "in a way that shows you feel too pleased about something you have done or achieved",
                    "vi": "theo cách cho thấy bạn cảm thấy quá hài lòng về điều gì đó bạn đã làm hoặc đạt được"
                },
                "examples": [
                    {
                        "en": "He smiled smugly as the results were announced.",
                        "vi": "Anh mỉm cười tự mãn khi kết quả được công bố."
                    }
                ]
            }
        ]
    },
    {
        "id": "b0be880bc4c1486f8ed5041ae1e0bd21",
        "word": "stature",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈstætʃə(r)/",
            "us": "/ˈstætʃər/"
        },
        "nearby": [
            {
                "word": "statuesque",
                "pos": "adjective"
            },
            {
                "word": "statuette",
                "pos": "noun"
            },
            {
                "word": "stature",
                "pos": "noun"
            },
            {
                "word": "status",
                "pos": "noun"
            },
            {
                "word": "status bar",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the importance and respect that a person has because of their ability and achievements",
                    "vi": "tầm quan trọng và sự tôn trọng mà một người có được vì khả năng và thành tích của họ"
                },
                "examples": [
                    {
                        "en": "She was an actress of considerable stature.",
                        "vi": "Cô ấy là một nữ diễn viên có tầm vóc đáng kể."
                    },
                    {
                        "en": "The orchestra has grown in stature.",
                        "vi": "Dàn nhạc đã phát triển về tầm vóc."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person’s height",
                    "vi": "chiều cao của một người"
                },
                "examples": [
                    {
                        "en": "a woman of short stature",
                        "vi": "một người phụ nữ có vóc dáng thấp bé"
                    },
                    {
                        "en": "He is small in stature.",
                        "vi": "Anh ta có vóc dáng nhỏ bé."
                    }
                ]
            }
        ]
    },
    {
        "id": "df22b32daaff45d89108959d2e096847",
        "word": "the sweet smell of success",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/swiːt/",
            "us": "/swiːt/"
        },
        "nearby": [
            {
                "word": "sweepstake",
                "pos": "noun"
            },
            {
                "word": "sweep up",
                "pos": "phrasal verb"
            },
            {
                "word": "sweet",
                "pos": "adjective"
            },
            {
                "word": "sweet",
                "pos": "noun"
            },
            {
                "word": "sweet-and-sour",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "containing, or tasting as if it contains, a lot of sugar",
                    "vi": "chứa, hoặc nếm như thể nó chứa, rất nhiều đường"
                },
                "examples": [
                    {
                        "en": "a cup of hot sweet tea",
                        "vi": "một tách trà ngọt nóng"
                    },
                    {
                        "en": "sweet food",
                        "vi": "thức ăn ngọt"
                    },
                    {
                        "en": "I had a craving for something sweet.",
                        "vi": "Tôi thèm một thứ gì đó ngọt ngào."
                    },
                    {
                        "en": "roast duck with a sweet and sour sauce",
                        "vi": "vịt quay sốt chua ngọt"
                    },
                    {
                        "en": "sweet sherry",
                        "vi": "trái sơ ri ngọt"
                    },
                    {
                        "en": "This wine is too sweet for me.",
                        "vi": "Rượu này quá ngọt đối với tôi."
                    },
                    {
                        "en": "I found the dessert a bit sweet for my taste.",
                        "vi": "Tôi thấy món tráng miệng hơi ngọt đối với khẩu vị của tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "having a pleasant smell",
                    "vi": "có mùi dễ chịu"
                },
                "examples": [
                    {
                        "en": "a sweet-smelling rose",
                        "vi": "một bông hồng thơm"
                    },
                    {
                        "en": "The air was sweet with incense.",
                        "vi": "Không khí ngào ngạt hương."
                    }
                ]
            },
            {
                "define": {
                    "en": "having a pleasant sound",
                    "vi": "có một âm thanh vui vẻ"
                },
                "examples": [
                    {
                        "en": "a sweet voice",
                        "vi": "một giọng nói ngọt ngào"
                    }
                ]
            },
            {
                "define": {
                    "en": "pleasant and not containing any harmful substances",
                    "vi": "dễ chịu và không chứa bất kỳ chất độc hại nào"
                },
                "examples": [
                    {
                        "en": "the sweet air of a mountain village",
                        "vi": "không khí ngọt ngào của một ngôi làng miền núi"
                    }
                ]
            },
            {
                "define": {
                    "en": "making you feel happy and/or satisfied",
                    "vi": "làm cho bạn cảm thấy hạnh phúc và / hoặc hài lòng"
                },
                "examples": [
                    {
                        "en": "Goodnight. Sweet dreams.",
                        "vi": "Chúc ngủ ngon. Những giấc mơ ngọt ngào."
                    },
                    {
                        "en": "I can't tell you how sweet this victory is.",
                        "vi": "Tôi không thể nói với bạn rằng chiến thắng này ngọt ngào như thế nào."
                    },
                    {
                        "en": "He played a sweet shot onto the final green (= in golf).",
                        "vi": "Anh ấy đã chơi một cú đánh ngọt ngào vào green cuối cùng (= trong gôn)."
                    },
                    {
                        "en": "an act of sweet revenge",
                        "vi": "một hành động trả thù ngọt ngào"
                    }
                ]
            },
            {
                "define": {
                    "en": "attractive",
                    "vi": "hấp dẫn"
                },
                "examples": [
                    {
                        "en": "His sister's a sweet young thing.",
                        "vi": "Em gái của anh ấy là một điều trẻ trung ngọt ngào."
                    },
                    {
                        "en": "You look sweet in this photograph.",
                        "vi": "Bạn trông thật ngọt ngào trong bức ảnh này."
                    },
                    {
                        "en": "We stayed in a sweet little hotel on the seafront.",
                        "vi": "Chúng tôi ở trong một khách sạn nhỏ ngọt ngào trên bờ biển."
                    }
                ]
            },
            {
                "define": {
                    "en": "having or showing a kind character",
                    "vi": "có hoặc thể hiện một nhân vật tốt bụng"
                },
                "examples": [
                    {
                        "en": "She gave him her sweetest smile.",
                        "vi": "Cô đã trao cho anh nụ cười ngọt ngào nhất của mình."
                    },
                    {
                        "en": "He's one of the sweetest people I know.",
                        "vi": "Anh ấy là một trong những người ngọt ngào nhất mà tôi biết."
                    },
                    {
                        "en": "it is sweet of somebody to do something It was sweet of them to offer to help.",
                        "vi": "Ai đó làm được điều gì đó thật tuyệt vời Họ đề nghị giúp đỡ."
                    },
                    {
                        "en": "He’s not what you’d call sweet-tempered!",
                        "vi": "Anh ấy không phải là những gì bạn gọi là nóng tính!"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to show that you approve of something",
                    "vi": "được sử dụng để cho thấy rằng bạn chấp thuận một cái gì đó"
                },
                "examples": [
                    {
                        "en": "Free tickets? Sweet!",
                        "vi": "Vé miễn phí? Kẹo!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to like somebody very much in a romantic way",
                    "vi": "thích ai đó rất nhiều theo cách lãng mạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to like food that contains a lot of sugar",
                    "vi": "thích thức ăn có nhiều đường"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to say how pleasant your home is (especially when you really mean that it is not pleasant at all)",
                    "vi": "được sử dụng để nói ngôi nhà của bạn dễ chịu như thế nào (đặc biệt là khi bạn thực sự muốn nói rằng nó không dễ chịu chút nào)"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "how and when you want to, even though this might annoy other people",
                    "vi": "làm thế nào và khi nào bạn muốn, mặc dù điều này có thể làm phiền người khác"
                },
                "examples": [
                    {
                        "en": "He always does the work, but in his own sweet time.",
                        "vi": "Anh ấy luôn luôn làm công việc, nhưng trong thời gian ngọt ngào của riêng mình."
                    },
                    {
                        "en": "She just ignores all the criticism and continues on her own sweet way.",
                        "vi": "Cô ấy bỏ qua tất cả những lời chỉ trích và tiếp tục con đường ngọt ngào của riêng mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to say or do pleasant things in order to keep somebody in a good mood so that they will agree to do something for you",
                    "vi": "nói hoặc làm những điều thú vị để giữ cho ai đó có tâm trạng tốt để họ đồng ý làm điều gì đó cho bạn"
                },
                "examples": [
                    {
                        "en": "You’d better keep her sweet if you want her to lend you the money.",
                        "vi": "Tốt hơn bạn nên giữ cô ấy ngọt ngào nếu bạn muốn cô ấy cho bạn vay tiền."
                    }
                ]
            },
            {
                "define": {
                    "en": "what is important is what people or things are, not what they are called",
                    "vi": "điều quan trọng là con người hoặc sự vật là gì, chứ không phải chúng được gọi là gì"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "everything is all right",
                    "vi": "mọi thứ đều ổn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "pleasant but not lasting a long time",
                    "vi": "dễ chịu nhưng không kéo dài trong thời gian dài"
                },
                "examples": [
                    {
                        "en": "We haven't much time so I'll keep it short and sweet.",
                        "vi": "Chúng ta không có nhiều thời gian nên tôi sẽ nói ngắn gọn và thú vị."
                    }
                ]
            },
            {
                "define": {
                    "en": "nothing at all. People say ‘sweet FA’ to avoid saying ‘fuck all’.",
                    "vi": "không có gì đâu. Người ta nói 'FA ngọt ngào' tránh nói 'đéo biết gì hết'."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "romantic words",
                    "vi": "lời yêu thương"
                },
                "examples": [
                    {
                        "en": "to whisper sweet nothings in somebody’s ear",
                        "vi": "thì thầm những điều ngọt ngào vào tai ai đó"
                    }
                ]
            },
            {
                "define": {
                    "en": "the pleasant feeling of being successful",
                    "vi": "cảm giác dễ chịu khi thành công"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "177979e602524e69af9fe698860b8548",
        "word": "tall poppy syndrome",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌtɔːl ˈpɒpi sɪndrəʊm/",
            "us": "/ˌtɔːl ˈpɑːpi sɪndrəʊm/"
        },
        "nearby": [
            {
                "word": "tallness",
                "pos": "noun"
            },
            {
                "word": "tallow",
                "pos": "noun"
            },
            {
                "word": "tall poppy syndrome",
                "pos": "noun"
            },
            {
                "word": "tall story",
                "pos": "noun"
            },
            {
                "word": "tally",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the fact of criticizing people who are richer or more successful than others",
                    "vi": "thực tế là chỉ trích những người giàu hơn hoặc thành công hơn những người khác"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "9b157f6f66b5476983cf4f9ac025207e",
        "word": "toast",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/təʊst/",
            "us": "/təʊst/"
        },
        "nearby": [
            {
                "word": "toady",
                "pos": "verb"
            },
            {
                "word": "To a Skylark",
                "pos": ""
            },
            {
                "word": "toast",
                "pos": "noun"
            },
            {
                "word": "toast",
                "pos": "verb"
            },
            {
                "word": "toaster",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "slices of bread that have been made brown and dry by heating them on both sides in a toaster or under a grill",
                    "vi": "những lát bánh mì đã được tạo màu nâu và khô bằng cách làm nóng cả hai mặt trong lò nướng bánh mì hoặc dưới lò nướng"
                },
                "examples": [
                    {
                        "en": "cheese on toast",
                        "vi": "bánh mì nướng phết bơ"
                    },
                    {
                        "en": "a piece of toast",
                        "vi": "một mẩu bánh mì nướng"
                    },
                    {
                        "en": "two slices/rounds of toast",
                        "vi": "hai lát / vòng bánh mì nướng"
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of a group of people wishing somebody happiness, success, etc. by drinking a glass of something, especially alcohol, at the same time",
                    "vi": "Hành động của một nhóm người chúc ai đó hạnh phúc, thành công, v.v. bằng cách uống một ly thứ gì đó, đặc biệt là rượu, cùng một lúc"
                },
                "examples": [
                    {
                        "en": "I'd like to propose a toast to the bride and groom.",
                        "vi": "Tôi muốn nâng cốc chúc mừng cô dâu và chú rể."
                    },
                    {
                        "en": "He raised his glass as if to make a toast.",
                        "vi": "Anh nâng ly như để nâng ly."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who is praised by a lot of people in a particular place because of something that they have done well",
                    "vi": "một người được rất nhiều người ở một nơi cụ thể khen ngợi vì họ đã làm tốt một việc gì đó"
                },
                "examples": [
                    {
                        "en": "The performance made her the toast of the festival.",
                        "vi": "Màn trình diễn đã khiến cô ấy trở thành người nâng ly chúc mừng lễ hội."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be likely to die or be destroyed; to be in serious trouble",
                    "vi": "có khả năng chết hoặc bị phá hủy; gặp rắc rối nghiêm trọng"
                },
                "examples": [
                    {
                        "en": "One mistake and you're toast.",
                        "vi": "Một sai lầm và bạn đang nâng ly."
                    }
                ]
            },
            {
                "define": {
                    "en": "to wish somebody good luck, health or success as you lift your glass and then drink from it",
                    "vi": "để chúc ai đó may mắn, sức khỏe hoặc thành công khi bạn nâng ly của mình và sau đó uống cạn"
                },
                "examples": [
                    {
                        "en": "Let's all drink a toast to the bride and groom.",
                        "vi": "Tất cả chúng ta hãy nâng ly chúc mừng cô dâu và chú rể."
                    },
                    {
                        "en": "We drank a toast to the company and its future success.",
                        "vi": "Chúng tôi đã nâng ly chúc mừng công ty và sự thành công trong tương lai của công ty."
                    }
                ]
            }
        ]
    },
    {
        "id": "d2f690b716344ddc9868f2f13cb87395",
        "word": "toast",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/təʊst/",
            "us": "/təʊst/"
        },
        "nearby": [
            {
                "word": "To a Skylark",
                "pos": ""
            },
            {
                "word": "toast",
                "pos": "noun"
            },
            {
                "word": "toast",
                "pos": "verb"
            },
            {
                "word": "toaster",
                "pos": "noun"
            },
            {
                "word": "toastie",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to lift a glass of wine, etc. in the air and drink it at the same time as other people in order to wish somebody/something success, happiness, etc.",
                    "vi": "nâng ly rượu, v.v. trong không khí và uống cùng lúc với người khác để cầu chúc ai đó / điều gì đó thành công, hạnh phúc, v.v."
                },
                "examples": [
                    {
                        "en": "The happy couple were toasted in champagne.",
                        "vi": "Cặp đôi hạnh phúc được nâng ly rượu sâm panh."
                    },
                    {
                        "en": "We toasted the success of the new company.",
                        "vi": "Chúng tôi chúc mừng thành công của công ty mới."
                    },
                    {
                        "en": "He raised his glass, silently toasting his absent son.",
                        "vi": "Anh nâng ly, lặng lẽ nâng ly chúc mừng đứa con trai vắng mặt."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make something, especially bread, turn brown by heating it in a toaster or close to heat; to turn brown in this way",
                    "vi": "để làm cho một cái gì đó, đặc biệt là bánh mì, chuyển sang màu nâu bằng cách đun nóng trong lò nướng bánh mì hoặc để gần nhiệt; chuyển sang màu nâu theo cách này"
                },
                "examples": [
                    {
                        "en": "Toast the bread lightly on both sides.",
                        "vi": "Nướng bánh mì nhẹ cả hai mặt."
                    },
                    {
                        "en": "The buns should be served lightly toasted.",
                        "vi": "Bánh nên được nướng nhẹ."
                    },
                    {
                        "en": "a toasted sandwich",
                        "vi": "một chiếc bánh mì nướng"
                    },
                    {
                        "en": "Place under a hot grill until the nuts have toasted.",
                        "vi": "Đặt dưới một vỉ nướng nóng cho đến khi các loại hạt đã nướng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to warm a part of your body by placing it near a fire",
                    "vi": "để làm ấm một bộ phận của cơ thể bạn bằng cách đặt nó gần lửa"
                },
                "examples": [
                    {
                        "en": "He sat toasting his feet in front of the fire.",
                        "vi": "Anh ngồi nướng chân trước đống lửa."
                    }
                ]
            }
        ]
    },
    {
        "id": "b24d3bcffd184de08c11ce3521938b89",
        "word": "Tony",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈtəʊni/",
            "us": "/ˈtəʊni/"
        },
        "nearby": [
            {
                "word": "Tonto",
                "pos": ""
            },
            {
                "word": "tony",
                "pos": "adjective"
            },
            {
                "word": "Tony",
                "pos": "noun"
            },
            {
                "word": "too",
                "pos": "adverb"
            },
            {
                "word": "took",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an award given in the US for achievement in the theatre",
                    "vi": "một giải thưởng được trao ở Hoa Kỳ cho thành tích trong nhà hát"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a first name for boys, short for Anthony",
                    "vi": "tên đầu tiên dành cho con trai, viết tắt của Anthony"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "ac717dced77e4bfe9d416105d7ea0b21",
        "word": "triumphal",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/traɪˈʌmfl/",
            "us": "/traɪˈʌmfl/"
        },
        "nearby": [
            {
                "word": "triumph",
                "pos": "verb"
            },
            {
                "word": "Triumph",
                "pos": ""
            },
            {
                "word": "triumphal",
                "pos": "adjective"
            },
            {
                "word": "triumphalism",
                "pos": "noun"
            },
            {
                "word": "triumphalist",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "done or made in order to celebrate a great success or victory",
                    "vi": "thực hiện hoặc thực hiện để ăn mừng một thành công lớn hoặc chiến thắng"
                },
                "examples": [
                    {
                        "en": "a triumphal parade",
                        "vi": "một cuộc diễu hành chiến thắng"
                    },
                    {
                        "en": "a Roman triumphal arch",
                        "vi": "khải hoàn môn La Mã"
                    }
                ]
            }
        ]
    },
    {
        "id": "7a4b8f29fca84fffad05585a5e670f28",
        "word": "triumphalism",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/traɪˈʌmfəlɪzəm/",
            "us": "/traɪˈʌmfəlɪzəm/"
        },
        "nearby": [
            {
                "word": "Triumph",
                "pos": ""
            },
            {
                "word": "triumphal",
                "pos": "adjective"
            },
            {
                "word": "triumphalism",
                "pos": "noun"
            },
            {
                "word": "triumphalist",
                "pos": "adjective"
            },
            {
                "word": "triumphant",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "behaviour that celebrates a victory or success in a way that is too proud and intended to upset the people you have defeated",
                    "vi": "hành vi ăn mừng chiến thắng hoặc thành công theo cách quá tự hào và có ý định làm buồn lòng những người bạn đã đánh bại"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "634121c4401545bfb789ec8bc084e70f",
        "word": "triumphalist",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/traɪˈʌmfəlɪst/",
            "us": "/traɪˈʌmfəlɪst/"
        },
        "nearby": [
            {
                "word": "triumphal",
                "pos": "adjective"
            },
            {
                "word": "triumphalism",
                "pos": "noun"
            },
            {
                "word": "triumphalist",
                "pos": "adjective"
            },
            {
                "word": "triumphant",
                "pos": "adjective"
            },
            {
                "word": "triumphantly",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "celebrating a victory or success in a way that is too proud and is intended to upset the people you have defeated",
                    "vi": "ăn mừng chiến thắng hoặc thành công theo cách quá tự hào và có ý định làm buồn lòng những người bạn đã đánh bại"
                },
                "examples": [
                    {
                        "en": "He warned that a triumphalist parade would be insensitive to the local people.",
                        "vi": "Ông cảnh báo rằng một cuộc diễu hành của người chiến thắng sẽ không nhạy cảm với người dân địa phương."
                    }
                ]
            }
        ]
    },
    {
        "id": "c4ec07916903450093cfc973517ecf16",
        "word": "triumphantly",
        "pos": "adverb",
        "level": "c2",
        "phonetic": {
            "uk": "/traɪˈʌmfəntli/",
            "us": "/traɪˈʌmfəntli/"
        },
        "nearby": [
            {
                "word": "triumphalist",
                "pos": "adjective"
            },
            {
                "word": "triumphant",
                "pos": "adjective"
            },
            {
                "word": "triumphantly",
                "pos": "adverb"
            },
            {
                "word": "triumvirate",
                "pos": "noun"
            },
            {
                "word": "trivet",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "in a way that shows great pleasure or joy about a victory or success",
                    "vi": "theo cách thể hiện niềm vui hoặc niềm vui lớn về chiến thắng hoặc thành công"
                },
                "examples": [
                    {
                        "en": "‘I was right,’ he said triumphantly.",
                        "vi": "“Tôi đã đúng,” anh nói một cách đắc thắng."
                    }
                ]
            }
        ]
    },
    {
        "id": "6f49a4a5c2fd4f3aa3c4eac29f2d1b3e",
        "word": "the uncrowned king/queen (of something)",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌʌnˈkraʊnd/",
            "us": "/ˌʌnˈkraʊnd/"
        },
        "nearby": [
            {
                "word": "uncritically",
                "pos": "adverb"
            },
            {
                "word": "uncrowded",
                "pos": "adjective"
            },
            {
                "word": "uncrowned",
                "pos": "adjective"
            },
            {
                "word": "unction",
                "pos": "noun"
            },
            {
                "word": "unctuous",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "not yet crowned (= had a crown officially placed on their head as a sign of royal power)",
                    "vi": "chưa đăng quang (= đã chính thức đội vương miện trên đầu họ như một dấu hiệu của quyền lực hoàng gia)"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the person considered to be the best, most famous or successful in a particular place or area of activity",
                    "vi": "người được coi là giỏi nhất, nổi tiếng nhất hoặc thành công ở một địa điểm hoặc lĩnh vực hoạt động cụ thể"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "9f300217a0d7409da58ce42456b91e6f",
        "word": "vainglorious",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌveɪnˈɡlɔːriəs/",
            "us": "/ˌveɪnˈɡlɔːriəs/"
        },
        "nearby": [
            {
                "word": "Vail",
                "pos": ""
            },
            {
                "word": "vain",
                "pos": "adjective"
            },
            {
                "word": "vainglorious",
                "pos": "adjective"
            },
            {
                "word": "vainglory",
                "pos": "noun"
            },
            {
                "word": "vainly",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "too proud of your own abilities or achievements",
                    "vi": "quá tự hào về khả năng hoặc thành tích của bản thân"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "6d44d4d31b304d99b6a9725c336c697f",
        "word": "vainglory",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌveɪnˈɡlɔːri/",
            "us": "/ˈveɪnɡlɔːri/"
        },
        "nearby": [
            {
                "word": "vain",
                "pos": "adjective"
            },
            {
                "word": "vainglorious",
                "pos": "adjective"
            },
            {
                "word": "vainglory",
                "pos": "noun"
            },
            {
                "word": "vainly",
                "pos": "adverb"
            },
            {
                "word": "Val",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the fact of being too proud of your own abilities or achievements",
                    "vi": "thực tế là quá tự hào về khả năng hoặc thành tích của bản thân"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "349016df75ae4f14872d5d5a21392262",
        "word": "vanity",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈvænəti/",
            "us": "/ˈvænəti/"
        },
        "nearby": [
            {
                "word": "vanish",
                "pos": "verb"
            },
            {
                "word": "vanishing point",
                "pos": "noun"
            },
            {
                "word": "vanity",
                "pos": "noun"
            },
            {
                "word": "vanity case",
                "pos": "noun"
            },
            {
                "word": "Vanity Fair",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the fact of being too proud of your own appearance, abilities or achievements",
                    "vi": "thực tế là quá tự hào về ngoại hình, khả năng hoặc thành tích của bản thân"
                },
                "examples": [
                    {
                        "en": "She had no personal vanity (= about her appearance).",
                        "vi": "Cô ấy không có sự phù phiếm cá nhân (= về ngoại hình của cô ấy)."
                    },
                    {
                        "en": "The invitation to head the committee flattered his vanity and he agreed.",
                        "vi": "Lời mời đứng đầu ủy ban đã tâng bốc sự phù phiếm của anh ta và anh ta đồng ý."
                    },
                    {
                        "en": "No doubt the idea appealed to his vanity.",
                        "vi": "Không nghi ngờ gì nữa, ý tưởng này đã thu hút sự phù phiếm của anh ta."
                    }
                ]
            },
            {
                "define": {
                    "en": "the fact of being unimportant, especially compared with other things that are important",
                    "vi": "thực tế là không quan trọng, đặc biệt là so với những thứ quan trọng khác"
                },
                "examples": [
                    {
                        "en": "the vanity of human ambition in the face of death",
                        "vi": "tham vọng hư vô của con người khi đối mặt với cái chết"
                    }
                ]
            },
            {
                "define": {
                    "en": "behaviour or attitudes that show people’s vanity",
                    "vi": "hành vi hoặc thái độ thể hiện sự phù phiếm của mọi người"
                },
                "examples": [
                    {
                        "en": "Politics is too often concerned only with the personal vanities of politicians.",
                        "vi": "Chính trị thường chỉ quan tâm đến sự phù phiếm cá nhân của các chính trị gia."
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of bedroom furniture like a table with drawers (= parts like boxes in it with handles on the front for pulling them open) and a mirror on top",
                    "vi": "một món đồ nội thất phòng ngủ như bàn có ngăn kéo (= các bộ phận như hộp trong đó có tay cầm ở mặt trước để kéo chúng ra) và gương ở phía trên"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "e81b4e5e64be4f389f98b36c25ec3ff4",
        "word": "victoriously",
        "pos": "adverb",
        "level": "c2",
        "phonetic": {
            "uk": "/vɪkˈtɔːriəsli/",
            "us": "/vɪkˈtɔːriəsli/"
        },
        "nearby": [
            {
                "word": "Victoria sponge",
                "pos": "noun"
            },
            {
                "word": "victorious",
                "pos": "adjective"
            },
            {
                "word": "victoriously",
                "pos": "adverb"
            },
            {
                "word": "victory",
                "pos": "noun"
            },
            {
                "word": "the Victory",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "in a way that shows somebody has won a victory",
                    "vi": "theo cách cho thấy ai đó đã giành được chiến thắng"
                },
                "examples": [
                    {
                        "en": "She raised her arms victoriously.",
                        "vi": "Cô ấy giơ tay chiến thắng."
                    }
                ]
            },
            {
                "define": {
                    "en": "having won something; in a way that ends in victory",
                    "vi": "đã giành được một cái gì đó; theo cách kết thúc trong chiến thắng"
                },
                "examples": [
                    {
                        "en": "He returned victoriously from his expedition.",
                        "vi": "Anh ta đã chiến thắng trở về sau chuyến thám hiểm của mình."
                    }
                ]
            }
        ]
    },
    {
        "id": "06e63dbaa0984fdab053470771c099ff",
        "word": "your/somebody’s luck is in",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/lʌk/",
            "us": "/lʌk/"
        },
        "nearby": [
            {
                "word": "Lucifer",
                "pos": "noun"
            },
            {
                "word": "Lucinda",
                "pos": ""
            },
            {
                "word": "luck",
                "pos": "noun"
            },
            {
                "word": "luck",
                "pos": "verb"
            },
            {
                "word": "luckily",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "good things that happen to you by chance, not because of your own efforts or abilities",
                    "vi": "những điều tốt đẹp đến với bạn một cách tình cờ, không phải do nỗ lực hay khả năng của chính bạn"
                },
                "examples": [
                    {
                        "en": "with (any) luck With any luck, we'll be home before dark.",
                        "vi": "với (bất kỳ) may mắn Với bất kỳ may mắn nào, chúng ta sẽ về nhà trước khi trời tối."
                    },
                    {
                        "en": "(British English) With a bit of luck, we'll finish on time.",
                        "vi": "(Anh Anh) Với một chút may mắn, chúng ta sẽ hoàn thành đúng giờ."
                    },
                    {
                        "en": "luck with doing something So far I have had no luck with finding a job.",
                        "vi": "may mắn khi làm điều gì đó Cho đến nay tôi không gặp may mắn khi tìm được việc làm."
                    },
                    {
                        "en": "luck with something I'm not having much luck with buses.",
                        "vi": "may mắn với một cái gì đó Tôi không gặp nhiều may mắn với xe buýt."
                    },
                    {
                        "en": "luck with somebody I never had much luck (= had a successful relationship) with women.",
                        "vi": "may mắn với ai đó Tôi chưa bao giờ gặp nhiều may mắn (= có một mối quan hệ thành công) với phụ nữ."
                    },
                    {
                        "en": "I could hardly believe my luck when he said yes.",
                        "vi": "Tôi khó tin vào vận may của mình khi anh ấy nói có."
                    },
                    {
                        "en": "It was a stroke of luck that we found you.",
                        "vi": "Thật may mắn khi chúng tôi tìm thấy bạn."
                    },
                    {
                        "en": "by luck By sheer luck nobody was hurt in the explosion.",
                        "vi": "may mắn là hoàn toàn may mắn không ai bị thương trong vụ nổ."
                    },
                    {
                        "en": "The only goal of the match came more by luck than judgement.",
                        "vi": "Bàn thắng duy nhất của trận đấu đến nhờ may mắn hơn là phán đoán."
                    },
                    {
                        "en": "We wish her luck in her new career.",
                        "vi": "Chúng tôi chúc cô ấy may mắn trong sự nghiệp mới của mình."
                    },
                    {
                        "en": "She wears a red bracelet to bring her luck.",
                        "vi": "Cô đeo một chiếc vòng màu đỏ để mang lại may mắn cho mình."
                    },
                    {
                        "en": "in luck You're in luck (= lucky)—there's one ticket left.",
                        "vi": "trong may mắn Bạn đang gặp may (= lucky) —còn một vé."
                    },
                    {
                        "en": "out of luck You're out of luck. She's not here.",
                        "vi": "không may mắn Bạn không gặp may. Cô ấy không ở đây."
                    },
                    {
                        "en": "What a piece of luck!",
                        "vi": "Thật là một phần may mắn!"
                    },
                    {
                        "en": "Finally my luck ran out and they caught me trying to climb the outer wall.",
                        "vi": "Cuối cùng thì vận may của tôi cũng cạn kiệt và họ bắt gặp tôi đang cố gắng trèo lên bức tường bên ngoài."
                    }
                ]
            },
            {
                "define": {
                    "en": "chance; the force that causes good or bad things to happen to people",
                    "vi": "cơ hội; lực lượng gây ra những điều tốt hoặc xấu xảy ra cho con người"
                },
                "examples": [
                    {
                        "en": "to have good/bad luck",
                        "vi": "gặp may mắn / tốt"
                    },
                    {
                        "en": "I put the loss of the money down to pure bad luck.",
                        "vi": "Tôi đặt sự mất mát của số tiền xuống để hoàn toàn không may mắn."
                    },
                    {
                        "en": "luck with something We had horrible luck with the weather.",
                        "vi": "may mắn với một cái gì đó Chúng tôi đã gặp may mắn kinh khủng với thời tiết."
                    },
                    {
                        "en": "Chinese people believe that boys bring good luck and money to the family.",
                        "vi": "Người Trung Quốc tin rằng con trai mang lại may mắn và tiền tài cho gia đình."
                    },
                    {
                        "en": "myths based on the idea that owls bring bad luck",
                        "vi": "huyền thoại dựa trên ý tưởng rằng cú mang lại xui xẻo"
                    },
                    {
                        "en": "She dared not trust to luck that nobody would see her.",
                        "vi": "Cô không dám tin tưởng vào may mắn rằng sẽ không ai nhìn thấy cô."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to ask somebody if they have been successful with something",
                    "vi": "đã từng hỏi ai đó rằng liệu họ có thành công với điều gì đó không"
                },
                "examples": [
                    {
                        "en": "‘Any luck?’ ‘No, they're all too busy to help.’",
                        "vi": "Bất kỳ may mắn?' \"Không, tất cả họ đều quá bận để giúp đỡ.\""
                    }
                ]
            },
            {
                "define": {
                    "en": "in the way that chance decides what will happen",
                    "vi": "theo cách mà cơ hội quyết định điều gì sẽ xảy ra"
                },
                "examples": [
                    {
                        "en": "As luck would have it, the train was late.",
                        "vi": "Như may có nó, chuyến tàu đã đến muộn."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to express sympathy for somebody",
                    "vi": "được sử dụng để bày tỏ sự đồng cảm với ai đó"
                },
                "examples": [
                    {
                        "en": "Bad luck, Helen, you played very well.",
                        "vi": "Hên xui, Helen, bạn đã chơi rất tốt."
                    },
                    {
                        "en": "It's hard luck on him that he wasn't chosen.",
                        "vi": "Thật khó cho anh ấy là anh ấy đã không được chọn."
                    },
                    {
                        "en": "What rotten luck it had to happen now!",
                        "vi": "Thật là may rủi đã xảy ra bây giờ!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to have no money because of a period of bad luck",
                    "vi": "không có tiền vì một khoảng thời gian kém may mắn"
                },
                "examples": [
                    {
                        "en": "In the movie they play two jazz musicians who are down on their luck.",
                        "vi": "Trong phim, họ đóng vai hai nhạc sĩ nhạc jazz đang thất vọng với vận may của họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to wish somebody success with something",
                    "vi": "từng chúc ai đó thành công với một điều gì đó"
                },
                "examples": [
                    {
                        "en": "The best of luck with your exams.",
                        "vi": "Chúc may mắn với kỳ thi của bạn."
                    },
                    {
                        "en": "Good luck! I hope it goes well.",
                        "vi": "Chúc may mắn! Tôi hy vọng nó cũng đi."
                    },
                    {
                        "en": "(ironic) ‘I'm going to try giving up social media for a year.’ ‘Good luck with that (= I don't think you will succeed).’",
                        "vi": "(mỉa mai) 'Tôi sẽ thử từ bỏ mạng xã hội trong một năm.' 'Chúc may mắn với điều đó (= Tôi không nghĩ bạn sẽ thành công).'"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to encourage somebody who has not been successful at something",
                    "vi": "được sử dụng để khuyến khích ai đó đã không thành công trong một cái gì đó"
                },
                "examples": [
                    {
                        "en": "Never mind— better luck next time.",
                        "vi": "Đừng bận tâm - chúc bạn may mắn lần sau."
                    },
                    {
                        "en": "If you didn't win a prize, better luck next time.",
                        "vi": "Nếu bạn không giành được giải thưởng, chúc bạn may mắn lần sau."
                    }
                ]
            },
            {
                "define": {
                    "en": "because you believe it will bring you good luck, or because this is a traditional belief",
                    "vi": "bởi vì bạn tin rằng nó sẽ mang lại may mắn cho bạn, hoặc bởi vì đây là một tín ngưỡng truyền thống"
                },
                "examples": [
                    {
                        "en": "Take something blue. It's for luck.",
                        "vi": "Lấy một cái gì đó màu xanh lam. Đó là sự may mắn."
                    },
                    {
                        "en": "I always carry it with me, just for luck.",
                        "vi": "Tôi luôn mang nó bên mình, chỉ vì may mắn."
                    }
                ]
            },
            {
                "define": {
                    "en": "for no particular reason",
                    "vi": "không vì lý do cụ thể"
                },
                "examples": [
                    {
                        "en": "I gave the mixture one more stir for luck.",
                        "vi": "Tôi đã khuấy hỗn hợp thêm một lần nữa để cầu may."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that you do not mind what somebody does as it does not affect you, but you hope they will be successful",
                    "vi": "từng nói rằng bạn không bận tâm về những gì ai đó làm vì nó không ảnh hưởng đến bạn, nhưng bạn hy vọng họ sẽ thành công"
                },
                "examples": [
                    {
                        "en": "It's not something I would care to try myself but if she wants to, good luck to her.",
                        "vi": "Tôi không quan tâm đến việc tự mình thử sức mình nhưng nếu cô ấy muốn, chúc cô ấy may mắn."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to tell somebody that you feel sorry for them",
                    "vi": "từng nói với ai đó rằng bạn cảm thấy tiếc cho họ"
                },
                "examples": [
                    {
                        "en": "‘Failed again, I'm afraid.’ ‘Oh, hard luck.’",
                        "vi": "Tôi lại thất bại, tôi sợ.' 'Ôi, may quá.'"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to show you are not surprised something bad has happened to you, because you are not often lucky",
                    "vi": "được sử dụng để cho thấy bạn không ngạc nhiên về một điều gì đó tồi tệ đã xảy ra với bạn, bởi vì bạn không thường gặp may mắn"
                },
                "examples": [
                    {
                        "en": "Just my luck to arrive after they had left.",
                        "vi": "Chỉ là may mắn của tôi đến sau khi họ rời đi."
                    },
                    {
                        "en": "Just my luck to get the broken chair!",
                        "vi": "Chỉ là may mắn của tôi để có được chiếc ghế bị hỏng!"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that somebody has been lucky or successful",
                    "vi": "thường nói rằng ai đó đã may mắn hoặc thành công"
                },
                "examples": [
                    {
                        "en": "On a Sunday I didn’t expect to find him at his desk but my luck was in.",
                        "vi": "Vào một ngày chủ nhật, tôi không mong đợi để tìm thấy anh ấy ở bàn làm việc của anh ấy nhưng may mắn của tôi đã đến."
                    }
                ]
            },
            {
                "define": {
                    "en": "the fact that chance decides something, in a way that you cannot control",
                    "vi": "thực tế là cơ hội quyết định điều gì đó, theo cách mà bạn không thể kiểm soát"
                },
                "examples": [
                    {
                        "en": "To a large extent the life you have depends on who your parents were; it’s just the luck of the biological draw.",
                        "vi": "Ở một mức độ lớn, cuộc sống bạn có phụ thuộc vào cha mẹ bạn là ai; nó chỉ là may mắn của cuộc rút thăm sinh học."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to show that you are disappointed because something you were hoping for did not happen",
                    "vi": "được sử dụng để cho thấy rằng bạn thất vọng vì điều gì đó bạn hy vọng đã không xảy ra"
                },
                "examples": [
                    {
                        "en": "‘Were you chosen for the team?’ ‘No such luck!’",
                        "vi": "Bạn có được chọn vào đội không?' 'Không có may mắn như vậy!'"
                    }
                ]
            },
            {
                "define": {
                    "en": "when you take pot luck, you choose something or go somewhere without knowing very much about it, but hope that it will be good, pleasant, etc.",
                    "vi": "khi bạn lấy may mắn, bạn chọn một cái gì đó hoặc đi đâu đó mà không biết nhiều về nó, nhưng hy vọng rằng nó sẽ tốt, vừa ý, v.v."
                },
                "examples": [
                    {
                        "en": "It's pot luck whether you get good advice or not.",
                        "vi": "Thật may mắn cho dù bạn có nhận được lời khuyên tốt hay không."
                    },
                    {
                        "en": "You're welcome to stay to supper, but you'll have to take pot luck (= eat whatever is available).",
                        "vi": "Bạn có thể ở lại để ăn tối, nhưng bạn sẽ phải mất một chút may mắn (= ăn bất cứ thứ gì có sẵn)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to take a risk because you have successfully avoided problems in the past",
                    "vi": "chấp nhận rủi ro vì bạn đã thành công trong việc tránh các vấn đề trong quá khứ"
                },
                "examples": [
                    {
                        "en": "You didn't get caught last time, but don't push your luck!",
                        "vi": "Bạn đã không bị bắt lần trước, nhưng đừng đẩy vận may của bạn!"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to show sympathy for somebody that something bad that has happened to",
                    "vi": "được sử dụng để bày tỏ sự thông cảm cho ai đó rằng điều gì đó tồi tệ đã xảy ra với"
                },
                "examples": [
                    {
                        "en": "‘I failed by one point.’ ‘That's tough luck.’",
                        "vi": "Tôi đã thất bại một điểm.' \"Đó là may mắn khó khăn.\""
                    }
                ]
            },
            {
                "define": {
                    "en": "used to show that you do not feel sorry for somebody who has a problem",
                    "vi": "được sử dụng để cho thấy rằng bạn không cảm thấy tiếc cho ai đó gặp khó khăn"
                },
                "examples": [
                    {
                        "en": "‘If you take the car, I won't be able to go out.’ ‘Tough luck!’",
                        "vi": "Nếu bạn bắt xe, tôi sẽ không thể ra ngoài.' 'May mắn lớn!'"
                    }
                ]
            },
            {
                "define": {
                    "en": "to do something that involves risk or luck, hoping to succeed",
                    "vi": "để làm điều gì đó liên quan đến rủi ro hoặc may mắn, hy vọng thành công"
                },
                "examples": [
                    {
                        "en": "My grandparents emigrated to Canada to try their luck there.",
                        "vi": "Ông bà của tôi đã di cư đến Canada để thử vận may của họ ở đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to show that you are disappointed about something",
                    "vi": "được sử dụng để cho thấy rằng bạn thất vọng về điều gì đó"
                },
                "examples": [
                    {
                        "en": "I shall have to miss the party, worse luck!",
                        "vi": "Tôi sẽ phải bỏ lỡ bữa tiệc, xui xẻo hơn!"
                    }
                ]
            }
        ]
    }
]