[
    {
        "id": "730290af3e8c45b78365168f4e0ae5c3",
        "word": "smile",
        "pos": "verb",
        "level": "a2",
        "phonetic": {
            "uk": "/smaɪl/",
            "us": "/smaɪl/"
        },
        "nearby": [
            {
                "word": "smelter",
                "pos": "noun"
            },
            {
                "word": "smidgen",
                "pos": "noun"
            },
            {
                "word": "smile",
                "pos": "verb"
            },
            {
                "word": "smile",
                "pos": "noun"
            },
            {
                "word": "smile on",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to make a smile appear on your face",
                    "vi": "để làm cho một nụ cười xuất hiện trên khuôn mặt của bạn"
                },
                "examples": [
                    {
                        "en": "to smile slightly/broadly",
                        "vi": "mỉm cười nhẹ / rộng"
                    },
                    {
                        "en": "to smile sweetly/warmly/brightly",
                        "vi": "cười ngọt ngào / ấm áp / rạng rỡ"
                    },
                    {
                        "en": "to smile weakly/faintlysoftly/sadly",
                        "vi": "cười yếu ớt / yếu ớt / buồn bã"
                    },
                    {
                        "en": "He never seems to smile.",
                        "vi": "Anh ấy dường như không bao giờ cười."
                    },
                    {
                        "en": "‘That's easy,’ Elizabeth said, smiling.",
                        "vi": "Thật dễ dàng, Elizabeth nói, mỉm cười."
                    },
                    {
                        "en": "Looking up from my book, I saw Monica's smiling face.",
                        "vi": "Nhìn lên từ cuốn sách của mình, tôi thấy khuôn mặt tươi cười của Monica."
                    },
                    {
                        "en": "He smiled to think how naive he used to be.",
                        "vi": "Anh mỉm cười nghĩ mình đã từng ngây thơ như thế nào."
                    },
                    {
                        "en": "smile at somebody/something She smiled at him and he smiled back.",
                        "vi": "cười với ai đó / cái gì đó Cô ấy cười với anh ấy và anh ấy cũng cười đáp lại."
                    },
                    {
                        "en": "She smiled at the thought of finally being able to see him again.",
                        "vi": "Cô mỉm cười với ý nghĩ cuối cùng cũng có thể gặp lại anh."
                    },
                    {
                        "en": "I had to smile at (= was amused by) his optimism.",
                        "vi": "Tôi đã phải mỉm cười trước (= thích thú với) sự lạc quan của anh ấy."
                    },
                    {
                        "en": "Her eyes smiled up at him.",
                        "vi": "Đôi mắt cô ấy cười lên nhìn anh."
                    },
                    {
                        "en": "smile with/in something He smiled with relief.",
                        "vi": "mỉm cười với / trong một cái gì đó Anh mỉm cười nhẹ nhõm."
                    },
                    {
                        "en": "She smiled in satisfaction.",
                        "vi": "Cô mỉm cười hài lòng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to say or express something with a smile",
                    "vi": "nói hoặc thể hiện điều gì đó với một nụ cười"
                },
                "examples": [
                    {
                        "en": "smile something She smiled her thanks.",
                        "vi": "cười cái gì đó Cô ấy mỉm cười cảm ơn cô ấy."
                    },
                    {
                        "en": "+ speech ‘Perfect,’ he smiled.",
                        "vi": "Err:509"
                    }
                ]
            },
            {
                "define": {
                    "en": "to give a smile of a particular type",
                    "vi": "để nở một nụ cười của một kiểu cụ thể"
                },
                "examples": [
                    {
                        "en": "to smile a small smile",
                        "vi": "cười một nụ cười nhỏ"
                    },
                    {
                        "en": "She smiled a smile of dry amusement.",
                        "vi": "Cô ấy cười một nụ cười thích thú khô khan."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be smiling, etc. a lot because you are very pleased about something",
                    "vi": "mỉm cười, v.v. rất nhiều vì bạn rất hài lòng về điều gì đó"
                },
                "examples": [
                    {
                        "en": "He was beaming from ear to ear.",
                        "vi": "Anh ấy cười rạng rỡ từ tai này sang tai khác."
                    }
                ]
            }
        ]
    },
    {
        "id": "e9ada93b9ffa411b8d87c28e691b8c13",
        "word": "smile",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/smaɪl/",
            "us": "/smaɪl/"
        },
        "nearby": [
            {
                "word": "smidgen",
                "pos": "noun"
            },
            {
                "word": "smile",
                "pos": "verb"
            },
            {
                "word": "smile",
                "pos": "noun"
            },
            {
                "word": "smile on",
                "pos": "phrasal verb"
            },
            {
                "word": "Samuel Smiles",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the expression that you have on your face when you are happy or you think something is funny, in which the corners of your mouth turn upwards",
                    "vi": "biểu hiện của bạn trên khuôn mặt của bạn khi bạn hạnh phúc hoặc bạn nghĩ điều gì đó vui nhộn, trong đó khóe miệng của bạn hướng lên trên"
                },
                "examples": [
                    {
                        "en": "a broad/warm/bright/slight smile",
                        "vi": "một nụ cười rộng / ấm áp / tươi sáng / nhẹ"
                    },
                    {
                        "en": "with a smile ‘Oh, hello,’ he said, with a smile.",
                        "vi": "với một nụ cười \"Ồ, xin chào,\" anh ta nói, với một nụ cười."
                    },
                    {
                        "en": "‘Well, that's life,’ she said with a wry smile.",
                        "vi": "Chà, đó là cuộc sống, cô ấy nói với một nụ cười gượng gạo."
                    },
                    {
                        "en": "He greeted me with a big smile.",
                        "vi": "Anh ấy chào tôi với một nụ cười thật tươi."
                    },
                    {
                        "en": "He gave a weak smile as she approached.",
                        "vi": "Anh nở một nụ cười yếu ớt khi cô đến gần."
                    },
                    {
                        "en": "He had a huge smile on his face.",
                        "vi": "Anh ấy có một nụ cười rất tươi trên khuôn mặt của mình."
                    },
                    {
                        "en": "The thought brought a smile to her face.",
                        "vi": "Ý nghĩ đó mang lại một nụ cười trên khuôn mặt cô."
                    },
                    {
                        "en": "Here's a story that is guaranteed to put a smile on your face.",
                        "vi": "Đây là một câu chuyện được đảm bảo sẽ mang lại nụ cười trên khuôn mặt của bạn."
                    },
                    {
                        "en": "I'm going to wipe that smile off your face (= make you stop thinking this is funny).",
                        "vi": "Tôi sẽ lau nụ cười đó khỏi khuôn mặt của bạn (= khiến bạn ngừng nghĩ điều này thật buồn cười)."
                    },
                    {
                        "en": "Her face broke into a smile.",
                        "vi": "Khuôn mặt cô ấy nở một nụ cười."
                    },
                    {
                        "en": "Her welcoming smile at the sight of him was a good sign.",
                        "vi": "Nụ cười chào đón của cô khi nhìn thấy anh là một dấu hiệu tốt."
                    },
                    {
                        "en": "He allowed himself a small smile of satisfaction.",
                        "vi": "Anh tự cho phép mình nở một nụ cười hài lòng nho nhỏ."
                    }
                ]
            },
            {
                "define": {
                    "en": "looking very happy, especially soon after you have been looking worried or sad",
                    "vi": "trông rất hạnh phúc, đặc biệt là ngay sau khi bạn trông lo lắng hoặc buồn bã"
                },
                "examples": [
                    {
                        "en": "Twelve hours later she was all smiles again.",
                        "vi": "Mười hai giờ sau, tất cả cô ấy đã mỉm cười trở lại."
                    }
                ]
            },
            {
                "define": {
                    "en": "to stop smiling, especially because somebody else is annoyed and does not think the situation is funny",
                    "vi": "ngừng cười, đặc biệt là vì ai đó khác đang khó chịu và không nghĩ rằng tình huống này là hài hước"
                },
                "examples": [
                    {
                        "en": "Wipe that grin off your face and get back to work.",
                        "vi": "Lau sạch nụ cười toe toét trên khuôn mặt của bạn và quay trở lại làm việc."
                    },
                    {
                        "en": "Wipe that stupid smile off your face.",
                        "vi": "Lau nụ cười ngu ngốc đó khỏi khuôn mặt của bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to stop smiling, especially because somebody else is annoyed does not think the situation is funny",
                    "vi": "ngừng cười, đặc biệt là vì ai đó khác đang khó chịu và không nghĩ rằng tình huống này là hài hước"
                },
                "examples": [
                    {
                        "en": "Wipe that smile off your face and get back to work.",
                        "vi": "Lau nụ cười đó trên khuôn mặt của bạn và quay lại làm việc."
                    }
                ]
            }
        ]
    },
    {
        "id": "dc9eec4dda1d4b59aa6f3c92df361580",
        "word": "expression",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ɪkˈspreʃn/",
            "us": "/ɪkˈspreʃn/"
        },
        "nearby": [
            {
                "word": "express",
                "pos": "noun"
            },
            {
                "word": "the Express",
                "pos": ""
            },
            {
                "word": "expression",
                "pos": "noun"
            },
            {
                "word": "expressionism",
                "pos": "noun"
            },
            {
                "word": "expressionist",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a word or phrase",
                    "vi": "một từ hoặc cụm từ"
                },
                "examples": [
                    {
                        "en": "What's the meaning of the expression ‘on cloud nine’?",
                        "vi": "Ý nghĩa của cụm từ 'trên chín tầng mây' là gì?"
                    },
                    {
                        "en": "She uses a lot of slang expressions that I've never heard before.",
                        "vi": "Cô ấy sử dụng rất nhiều cách diễn đạt tiếng lóng mà tôi chưa từng nghe bao giờ."
                    },
                    {
                        "en": "Keep a list of useful words and expressions.",
                        "vi": "Giữ một danh sách các từ và cách diễn đạt hữu ích."
                    },
                    {
                        "en": "(informal) He's a pain in the butt, if you'll pardon the expression.",
                        "vi": "(thân mật) Anh ấy bị đau ở mông, nếu bạn tha thứ cho biểu hiện này."
                    }
                ]
            },
            {
                "define": {
                    "en": "things that people say, write or do in order to show their feelings, opinions and ideas",
                    "vi": "những điều mọi người nói, viết hoặc làm để thể hiện cảm xúc, quan điểm và ý tưởng của họ"
                },
                "examples": [
                    {
                        "en": "Freedom of expression (= freedom to say what you think) is a basic human right.",
                        "vi": "Tự do ngôn luận (= tự do nói những gì bạn nghĩ) là một quyền cơ bản của con người."
                    },
                    {
                        "en": "(formal) The poet's anger finds expression in (= is shown in) the last verse of the poem.",
                        "vi": "(trang trọng) Sự tức giận của nhà thơ được thể hiện trong (= được thể hiện trong) câu thơ cuối cùng của bài thơ."
                    },
                    {
                        "en": "Only in his dreams does he give expression to his fears.",
                        "vi": "Chỉ trong những giấc mơ, anh ta mới bộc lộ nỗi sợ hãi của mình."
                    },
                    {
                        "en": "He describes drawing as a very personal form of artistic expression.",
                        "vi": "Ông mô tả vẽ là một hình thức biểu đạt nghệ thuật rất cá nhân."
                    },
                    {
                        "en": "Words, as a means of expression, can be limiting.",
                        "vi": "Từ ngữ, như một phương tiện biểu đạt, có thể bị hạn chế."
                    },
                    {
                        "en": "expression of something the expression of emotion/feelings",
                        "vi": "biểu hiện của một cái gì đó biểu hiện của cảm xúc / cảm xúc"
                    },
                    {
                        "en": "expressions of concern/sympathy/support",
                        "vi": "biểu hiện quan tâm / thông cảm / hỗ trợ"
                    },
                    {
                        "en": "We are calling for expressions of interest from people wanting to take part in the project.",
                        "vi": "Chúng tôi đang kêu gọi sự quan tâm của những người muốn tham gia vào dự án."
                    },
                    {
                        "en": "laws which aim to restrict free expression of opinion",
                        "vi": "luật nhằm hạn chế quyền tự do bày tỏ quan điểm"
                    }
                ]
            },
            {
                "define": {
                    "en": "a look on a person’s face that shows their thoughts or feelings",
                    "vi": "một cái nhìn trên khuôn mặt của một người thể hiện suy nghĩ hoặc cảm xúc của họ"
                },
                "examples": [
                    {
                        "en": "The actors' gestures and facial expressions are perfect.",
                        "vi": "Cử chỉ và nét mặt của các diễn viên đều rất hoàn hảo."
                    },
                    {
                        "en": "He had a pained expression on his face.",
                        "vi": "Anh ta có một biểu hiện đau đớn trên khuôn mặt của mình."
                    },
                    {
                        "en": "The blank expression in her eyes showed that she hadn't understood.",
                        "vi": "Biểu cảm trống rỗng trong mắt cô ấy cho thấy rằng cô ấy không hiểu."
                    },
                    {
                        "en": "He looked down at the tiny child and his expression softened.",
                        "vi": "Anh nhìn xuống đứa trẻ nhỏ xíu và nét mặt dịu lại."
                    },
                    {
                        "en": "His expression changed from surprise to one of amusement.",
                        "vi": "Biểu cảm của anh ta chuyển từ ngạc nhiên sang thích thú."
                    },
                    {
                        "en": "Her expression betrayed nothing of her thoughts.",
                        "vi": "Vẻ mặt của cô ấy không phản ánh suy nghĩ của cô ấy."
                    },
                    {
                        "en": "expression of something She wore an expression of anger.",
                        "vi": "biểu hiện của một cái gì đó Cô ấy mang một biểu hiện của sự tức giận."
                    }
                ]
            },
            {
                "define": {
                    "en": "a strong show of feeling when you are playing music, speaking, acting, etc.",
                    "vi": "một cảm giác mạnh mẽ khi bạn chơi nhạc, diễn thuyết, diễn xuất, v.v."
                },
                "examples": [
                    {
                        "en": "Try to put a little more expression into it!",
                        "vi": "Cố gắng thể hiện thêm một chút vào đó!"
                    },
                    {
                        "en": "She plays the violin with great expression.",
                        "vi": "Cô ấy chơi vĩ cầm với một biểu cảm tuyệt vời."
                    }
                ]
            },
            {
                "define": {
                    "en": "a group of signs that represent an idea or a quantity",
                    "vi": "một nhóm các dấu hiệu đại diện cho một ý tưởng hoặc một số lượng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "20d78caeef8b4fadbed637eb2cc0e3d0",
        "word": "blush",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/blʌʃ/",
            "us": "/blʌʃ/"
        },
        "nearby": [
            {
                "word": "blurry",
                "pos": "adjective"
            },
            {
                "word": "blurt",
                "pos": "verb"
            },
            {
                "word": "blush",
                "pos": "verb"
            },
            {
                "word": "blush",
                "pos": "noun"
            },
            {
                "word": "blusher",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to become red in the face because you are embarrassed or ashamed",
                    "vi": "mặt đỏ bừng vì xấu hổ hoặc xấu hổ"
                },
                "examples": [
                    {
                        "en": "blush (with something) (at something) to blush with embarrassment/shame",
                        "vi": "đỏ mặt (với một cái gì đó) (tại một cái gì đó) để đỏ mặt vì xấu hổ / xấu hổ"
                    },
                    {
                        "en": "She blushed furiously at the memory of the conversation.",
                        "vi": "Cô đỏ mặt giận dữ khi nhớ lại cuộc trò chuyện."
                    },
                    {
                        "en": "He looked away, blushing.",
                        "vi": "Anh ấy nhìn sang chỗ khác, đỏ mặt."
                    },
                    {
                        "en": "+ adj./noun He blushed scarlet at the thought.",
                        "vi": "Err:509"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be ashamed or embarrassed about something",
                    "vi": "xấu hổ hoặc xấu hổ về điều gì đó"
                },
                "examples": [
                    {
                        "en": "I blush to admit it, but I quite like her music.",
                        "vi": "Tôi đỏ mặt thừa nhận điều đó, nhưng tôi khá thích âm nhạc của cô ấy."
                    },
                    {
                        "en": "I blush to think of how I behaved the last time we met.",
                        "vi": "Tôi đỏ mặt khi nghĩ đến cách cư xử của mình trong lần cuối cùng chúng tôi gặp nhau."
                    }
                ]
            }
        ]
    },
    {
        "id": "70caab81ce7c41b6a12a7fd7fdcc7e1b",
        "word": "blush",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/blʌʃ/",
            "us": "/blʌʃ/"
        },
        "nearby": [
            {
                "word": "blurt",
                "pos": "verb"
            },
            {
                "word": "blush",
                "pos": "verb"
            },
            {
                "word": "blush",
                "pos": "noun"
            },
            {
                "word": "blusher",
                "pos": "noun"
            },
            {
                "word": "blush wine",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the red colour that spreads over your face when you are embarrassed or ashamed",
                    "vi": "màu đỏ lan ra trên khuôn mặt của bạn khi bạn xấu hổ hoặc xấu hổ"
                },
                "examples": [
                    {
                        "en": "She felt a warm blush rise to her cheeks.",
                        "vi": "Cô cảm thấy má mình ửng hồng ấm áp."
                    },
                    {
                        "en": "He turned away to hide his blushes.",
                        "vi": "Anh quay đi để che đi sự đỏ mặt của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "a coloured cream or powder that some people put on their cheeks (= on their faces below the eyes) to give them more colour",
                    "vi": "kem hoặc bột có màu mà một số người bôi lên má (= trên khuôn mặt của họ bên dưới mắt) để giúp họ có thêm màu sắc"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to save somebody from an embarrassing situation",
                    "vi": "để cứu ai đó khỏi một tình huống xấu hổ"
                },
                "examples": [
                    {
                        "en": "A last minute goal spared their blushes.",
                        "vi": "Một bàn thắng ở phút cuối cùng đã giúp họ không bị đỏ mặt."
                    }
                ]
            }
        ]
    },
    {
        "id": "c8cd727552904bfcb79f29dc94688945",
        "word": "frown",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/fraʊn/",
            "us": "/fraʊn/"
        },
        "nearby": [
            {
                "word": "froth",
                "pos": "verb"
            },
            {
                "word": "frothy",
                "pos": "adjective"
            },
            {
                "word": "frown",
                "pos": "verb"
            },
            {
                "word": "frown",
                "pos": "noun"
            },
            {
                "word": "frown on",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to make a serious, angry or worried expression by bringing your eyebrows closer together so that lines appear on your forehead",
                    "vi": "biểu hiện nghiêm túc, tức giận hoặc lo lắng bằng cách kéo lông mày lại gần nhau để các đường nét xuất hiện trên trán của bạn"
                },
                "examples": [
                    {
                        "en": "frown (at somebody/something) What are you frowning at me for?",
                        "vi": "cau mày (với ai đó / cái gì đó) Bạn đang cau mày với tôi để làm gì?"
                    },
                    {
                        "en": "She frowned with concentration.",
                        "vi": "Cô cau mày với sự tập trung."
                    },
                    {
                        "en": "+ speech ‘I don't understand,’ she frowned.",
                        "vi": "Err:509"
                    }
                ]
            }
        ]
    },
    {
        "id": "cc4097d6ac3d48b2958f6811f8c48cd3",
        "word": "frown",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/fraʊn/",
            "us": "/fraʊn/"
        },
        "nearby": [
            {
                "word": "frothy",
                "pos": "adjective"
            },
            {
                "word": "frown",
                "pos": "verb"
            },
            {
                "word": "frown",
                "pos": "noun"
            },
            {
                "word": "frown on",
                "pos": "phrasal verb"
            },
            {
                "word": "frown upon",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a serious, angry or worried expression on a person’s face that causes lines on their forehead",
                    "vi": "một biểu hiện nghiêm túc, tức giận hoặc lo lắng trên khuôn mặt của một người gây ra các nếp nhăn trên trán của họ"
                },
                "examples": [
                    {
                        "en": "A small frown creased her forehead.",
                        "vi": "Một cái cau mày nhăn trán."
                    },
                    {
                        "en": "She looked up with a puzzled frown on her face.",
                        "vi": "Cô ấy nhìn lên với vẻ mặt cau có khó hiểu."
                    },
                    {
                        "en": "a slight frown of disapproval/concentration, etc.",
                        "vi": "một chút cau mày của sự không tán thành / tập trung, v.v."
                    }
                ]
            }
        ]
    },
    {
        "id": "4693951dfda149f398c7a9895a03f720",
        "word": "grin",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/ɡrɪn/",
            "us": "/ɡrɪn/"
        },
        "nearby": [
            {
                "word": "the Grim Reaper",
                "pos": "noun"
            },
            {
                "word": "grimy",
                "pos": "adjective"
            },
            {
                "word": "grin",
                "pos": "verb"
            },
            {
                "word": "grin",
                "pos": "noun"
            },
            {
                "word": "grind",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to smile widely",
                    "vi": "cười thật tươi"
                },
                "examples": [
                    {
                        "en": "They grinned with delight when they heard our news.",
                        "vi": "Họ cười toe toét thích thú khi biết tin của chúng tôi."
                    },
                    {
                        "en": "Stop grinning and tell me what happened!",
                        "vi": "Đừng cười toe toét và kể cho tôi nghe chuyện gì đã xảy ra!"
                    },
                    {
                        "en": "grin at somebody She grinned amiably at us.",
                        "vi": "cười toe toét với ai đó Cô ấy cười toe toét với chúng tôi."
                    },
                    {
                        "en": "grin something He grinned a wide grin.",
                        "vi": "cười toe toét cái gì đó Anh ấy cười toe toét."
                    }
                ]
            },
            {
                "define": {
                    "en": "to accept pain or bad luck without complaining",
                    "vi": "chấp nhận đau đớn hoặc xui xẻo mà không phàn nàn"
                },
                "examples": [
                    {
                        "en": "There's nothing we can do about it. We'll just have to grin and bear it.",
                        "vi": "Chúng ta không thể làm gì được. Chúng tôi sẽ chỉ phải cười toe toét và chịu đựng điều đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be smiling, etc. a lot because you are very pleased about something",
                    "vi": "mỉm cười, v.v. rất nhiều vì bạn rất hài lòng về điều gì đó"
                },
                "examples": [
                    {
                        "en": "He was beaming from ear to ear.",
                        "vi": "Anh ấy cười rạng rỡ từ tai này sang tai khác."
                    }
                ]
            }
        ]
    },
    {
        "id": "c1e8e8008fe64b63aafb0974a79be896",
        "word": "grin",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ɡrɪn/",
            "us": "/ɡrɪn/"
        },
        "nearby": [
            {
                "word": "grimy",
                "pos": "adjective"
            },
            {
                "word": "grin",
                "pos": "verb"
            },
            {
                "word": "grin",
                "pos": "noun"
            },
            {
                "word": "grind",
                "pos": "verb"
            },
            {
                "word": "grind",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a wide smile",
                    "vi": "một nụ cười rộng"
                },
                "examples": [
                    {
                        "en": "She gave a broad grin.",
                        "vi": "Cô ấy nở một nụ cười toe toét."
                    },
                    {
                        "en": "a wry/sheepish grin",
                        "vi": "một nụ cười nhăn nhở / ngượng ngùng"
                    },
                    {
                        "en": "with a grin ‘No,’ he said with a grin.",
                        "vi": "với một nụ cười \"Không,\" anh ta nói với một nụ cười."
                    }
                ]
            },
            {
                "define": {
                    "en": "to stop smiling, especially because somebody else is annoyed and does not think the situation is funny",
                    "vi": "ngừng cười, đặc biệt là vì ai đó khác đang khó chịu và không nghĩ rằng tình huống này là hài hước"
                },
                "examples": [
                    {
                        "en": "Wipe that grin off your face and get back to work.",
                        "vi": "Lau sạch nụ cười toe toét trên khuôn mặt của bạn và quay trở lại làm việc."
                    },
                    {
                        "en": "Wipe that stupid smile off your face.",
                        "vi": "Lau nụ cười ngu ngốc đó khỏi khuôn mặt của bạn."
                    }
                ]
            }
        ]
    },
    {
        "id": "d0d5afc33836416bbe32ad1bc9263c3f",
        "word": "beam",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/biːm/",
            "us": "/biːm/"
        },
        "nearby": [
            {
                "word": "Beaker People",
                "pos": "noun"
            },
            {
                "word": "Beale Street",
                "pos": ""
            },
            {
                "word": "beam",
                "pos": "noun"
            },
            {
                "word": "beam",
                "pos": "verb"
            },
            {
                "word": "beam down",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a line of light, electromagnetic waves or particles",
                    "vi": "một dòng ánh sáng, sóng điện từ hoặc các hạt"
                },
                "examples": [
                    {
                        "en": "narrow beams of light/sunlight",
                        "vi": "chùm ánh sáng / ánh sáng mặt trời hẹp"
                    },
                    {
                        "en": "the beam of a torch/flashlight",
                        "vi": "chùm đuốc / đèn pin"
                    },
                    {
                        "en": "a laser/electron beam",
                        "vi": "một tia laze / điện tử"
                    },
                    {
                        "en": "(British English) The car's headlights were on full beam (= shining as brightly as possible and not directed downwards).",
                        "vi": "(Tiếng Anh Anh) Đèn pha của ô tô đã bật sáng đầy đủ (= sáng hết mức có thể và không chiếu thẳng xuống dưới)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a long piece of wood, metal, etc. used to support weight, especially as part of the roof in a building",
                    "vi": "một miếng gỗ dài, kim loại, v.v. được sử dụng để nâng đỡ trọng lượng, đặc biệt là một phần của mái nhà trong một tòa nhà"
                },
                "examples": [
                    {
                        "en": "The cottage had exposed oak beams.",
                        "vi": "Ngôi nhà có dầm gỗ sồi lộ ra ngoài."
                    }
                ]
            },
            {
                "define": {
                    "en": "a wooden bar that is used in the sport of gymnastics for people to move and balance on",
                    "vi": "một thanh gỗ được sử dụng trong thể dục thể thao để mọi người di chuyển và giữ thăng bằng"
                },
                "examples": [
                    {
                        "en": "The gymnast performed a somersault on the beam.",
                        "vi": "Vận động viên thể dục thực hiện động tác lộn nhào trên xà."
                    }
                ]
            },
            {
                "define": {
                    "en": "a wide and happy smile",
                    "vi": "một nụ cười rộng và hạnh phúc"
                },
                "examples": [
                    {
                        "en": "a beam of satisfaction",
                        "vi": "một tia hài lòng"
                    }
                ]
            },
            {
                "define": {
                    "en": "not correct; wrong",
                    "vi": "không chính xác; Sai lầm"
                },
                "examples": [
                    {
                        "en": "Your calculation is way off beam.",
                        "vi": "Tính toán của bạn rất sai lầm."
                    }
                ]
            }
        ]
    },
    {
        "id": "b0db11d510244ec18cf71501c3be3fcd",
        "word": "beam",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/biːm/",
            "us": "/biːm/"
        },
        "nearby": [
            {
                "word": "Beale Street",
                "pos": ""
            },
            {
                "word": "beam",
                "pos": "noun"
            },
            {
                "word": "beam",
                "pos": "verb"
            },
            {
                "word": "beam down",
                "pos": "phrasal verb"
            },
            {
                "word": "beamed",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to have a big happy smile on your face",
                    "vi": "nở một nụ cười hạnh phúc trên khuôn mặt của bạn"
                },
                "examples": [
                    {
                        "en": "beam (at somebody) He beamed at the journalists.",
                        "vi": "rạng rỡ (với ai đó) Anh ấy cười rạng rỡ với các nhà báo."
                    },
                    {
                        "en": "beam (with something) She was positively beaming with pleasure.",
                        "vi": "chùm (với một cái gì đó) Cô ấy đang rạng rỡ một cách tích cực với niềm vui."
                    },
                    {
                        "en": "beam something (at somebody) The barman beamed a warm smile at her.",
                        "vi": "cười rạng rỡ với ai đó (với ai đó) Người phục vụ nở một nụ cười ấm áp với cô."
                    },
                    {
                        "en": "His broad face beamed a hearty welcome.",
                        "vi": "Khuôn mặt rộng của anh ta rạng rỡ một sự chào đón nồng nhiệt."
                    },
                    {
                        "en": "+ speech ‘I'd love to come,’ she beamed (= said with a large smile).",
                        "vi": "Err:509"
                    }
                ]
            },
            {
                "define": {
                    "en": "to send radio or television signals over long distances using electronic equipment",
                    "vi": "để gửi tín hiệu vô tuyến hoặc truyền hình trên một khoảng cách xa bằng thiết bị điện tử"
                },
                "examples": [
                    {
                        "en": "Live pictures of the ceremony were beamed around the world.",
                        "vi": "Hình ảnh trực tiếp của buổi lễ đã được chiếu trên khắp thế giới."
                    }
                ]
            },
            {
                "define": {
                    "en": "to produce a stream of light and/or heat",
                    "vi": "để tạo ra một luồng ánh sáng và / hoặc nhiệt"
                },
                "examples": [
                    {
                        "en": "The morning sun beamed down on us.",
                        "vi": "Ánh nắng ban mai chiếu xuống chúng tôi."
                    },
                    {
                        "en": "Light beamed through a hole in the curtain.",
                        "vi": "Ánh sáng chiếu qua một lỗ trên bức màn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be smiling, etc. a lot because you are very pleased about something",
                    "vi": "mỉm cười, v.v. rất nhiều vì bạn rất hài lòng về điều gì đó"
                },
                "examples": [
                    {
                        "en": "He was beaming from ear to ear.",
                        "vi": "Anh ấy cười rạng rỡ từ tai này sang tai khác."
                    }
                ]
            }
        ]
    },
    {
        "id": "75eaf899d6bf4472be40f31a817f4756",
        "word": "countenance",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkaʊntənəns/",
            "us": "/ˈkaʊntənəns/"
        },
        "nearby": [
            {
                "word": "countdown",
                "pos": "noun"
            },
            {
                "word": "Countdown",
                "pos": ""
            },
            {
                "word": "countenance",
                "pos": "noun"
            },
            {
                "word": "countenance",
                "pos": "verb"
            },
            {
                "word": "counter-attack",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person’s face or their expression",
                    "vi": "khuôn mặt của một người hoặc biểu hiện của họ"
                },
                "examples": [
                    {
                        "en": "her calmly smiling countenance",
                        "vi": "vẻ mặt mỉm cười điềm tĩnh của cô ấy"
                    }
                ]
            }
        ]
    },
    {
        "id": "a62da49e210a42bbb041ae8ab4b5f7e0",
        "word": "downcast",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈdaʊnkɑːst/",
            "us": "/ˈdaʊnkæst/"
        },
        "nearby": [
            {
                "word": "down at heel",
                "pos": "adjective"
            },
            {
                "word": "downbeat",
                "pos": "adjective"
            },
            {
                "word": "downcast",
                "pos": "adjective"
            },
            {
                "word": "downdraught",
                "pos": "noun"
            },
            {
                "word": "downer",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "looking down",
                    "vi": "nhìn xuống"
                },
                "examples": [
                    {
                        "en": "Eyes downcast, she continued eating.",
                        "vi": "Đôi mắt u ám, cô tiếp tục ăn."
                    },
                    {
                        "en": "She kept her eyes slightly downcast to avoid looking into their faces.",
                        "vi": "Cô ấy giữ đôi mắt của mình hơi cụp xuống để tránh nhìn vào mặt họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "sad or depressed",
                    "vi": "buồn hoặc chán nản"
                },
                "examples": [
                    {
                        "en": "A group of downcast men stood waiting for food.",
                        "vi": "Một nhóm đàn ông ủ rũ đứng đợi thức ăn."
                    }
                ]
            }
        ]
    },
    {
        "id": "28a2ae7d32d4456f98e1090fb8df7e0d",
        "word": "girn",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ɡɜːn/",
            "us": "/ɡɜːrn/"
        },
        "nearby": [
            {
                "word": "girly",
                "pos": "adjective"
            },
            {
                "word": "girly",
                "pos": "noun"
            },
            {
                "word": "girn",
                "pos": "verb"
            },
            {
                "word": "giro",
                "pos": "noun"
            },
            {
                "word": "girth",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to deliberately pull your face into a silly or unpleasant shape",
                    "vi": "cố tình kéo khuôn mặt của bạn thành một hình dạng ngớ ngẩn hoặc khó chịu"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "883388a5d2cb41f3ad4306eedb5984ac",
        "word": "glazed",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ɡleɪzd/",
            "us": "/ɡleɪzd/"
        },
        "nearby": [
            {
                "word": "glaze",
                "pos": "verb"
            },
            {
                "word": "glaze",
                "pos": "noun"
            },
            {
                "word": "glazed",
                "pos": "adjective"
            },
            {
                "word": "glazier",
                "pos": "noun"
            },
            {
                "word": "the GLC",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "fitted with a sheets of glass",
                    "vi": "được trang bị một tấm kính"
                },
                "examples": [
                    {
                        "en": "a glazed door",
                        "vi": "một cánh cửa bằng kính"
                    }
                ]
            },
            {
                "define": {
                    "en": "covered with glaze to give a shiny surface",
                    "vi": "phủ men để tạo bề mặt sáng bóng"
                },
                "examples": [
                    {
                        "en": "glazed tiles/pottery",
                        "vi": "gạch tráng men / đồ gốm"
                    },
                    {
                        "en": "(North American English) a glazed doughnut",
                        "vi": "(Tiếng Anh Bắc Mỹ) một chiếc bánh rán tráng men"
                    }
                ]
            },
            {
                "define": {
                    "en": "showing no feeling or emotion; not bright",
                    "vi": "không biểu lộ cảm xúc hoặc cảm xúc; không sáng"
                },
                "examples": [
                    {
                        "en": "She had a glazed look in her eyes.",
                        "vi": "Cô ấy có một cái nhìn đờ đẫn trong đôi mắt của mình."
                    },
                    {
                        "en": "eyes glazed with boredom",
                        "vi": "mắt đờ đẫn vì chán nản"
                    },
                    {
                        "en": "Many of them wore a glazed look.",
                        "vi": "Nhiều người trong số họ mang một vẻ ngoài lấp lánh."
                    },
                    {
                        "en": "With glazed eyes he was staring into the middle distance.",
                        "vi": "Với đôi mắt đờ đẫn, anh ta đang nhìn chằm chằm vào khoảng không giữa."
                    }
                ]
            }
        ]
    },
    {
        "id": "a3fc9b4da0a949728ed87d09c8359ca3",
        "word": "glower",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɡlaʊə(r)/",
            "us": "/ˈɡlaʊər/"
        },
        "nearby": [
            {
                "word": "glow",
                "pos": "noun"
            },
            {
                "word": "glower",
                "pos": "noun"
            },
            {
                "word": "glower",
                "pos": "verb"
            },
            {
                "word": "glowing",
                "pos": "adjective"
            },
            {
                "word": "glowingly",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to look in an angry, aggressive way",
                    "vi": "nhìn một cách giận dữ, hung hăng"
                },
                "examples": [
                    {
                        "en": "She glowered across the table at me.",
                        "vi": "Cô ấy nhìn chằm chằm vào tôi trên bàn."
                    },
                    {
                        "en": "Nicola stared at Tom, who glowered back.",
                        "vi": "Nicola nhìn chằm chằm vào Tom, người rạng rỡ trở lại."
                    },
                    {
                        "en": "He stood behind her, eyes glowering.",
                        "vi": "Anh đứng sau lưng cô, đôi mắt sáng rực."
                    }
                ]
            }
        ]
    },
    {
        "id": "b549919b15fb417dba04cf457420e335",
        "word": "grimace",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɡrɪməs/",
            "us": "/ˈɡrɪməs/"
        },
        "nearby": [
            {
                "word": "grilse",
                "pos": "noun"
            },
            {
                "word": "grim",
                "pos": "adjective"
            },
            {
                "word": "grimace",
                "pos": "verb"
            },
            {
                "word": "grimace",
                "pos": "noun"
            },
            {
                "word": "Joseph Grimaldi",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to make an ugly expression with your face to show pain, dislike, etc.",
                    "vi": "biểu cảm xấu xí với khuôn mặt của bạn để thể hiện sự đau đớn, không thích, v.v."
                },
                "examples": [
                    {
                        "en": "He grimaced at the bitter taste.",
                        "vi": "Anh nhăn mặt vì vị đắng."
                    },
                    {
                        "en": "She grimaced as the needle went in.",
                        "vi": "Cô nhăn nhó khi mũi kim đâm vào."
                    }
                ]
            }
        ]
    },
    {
        "id": "af8e4f4a28254a02b68a358c776f46bc",
        "word": "grimace",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɡrɪməs/",
            "us": "/ˈɡrɪməs/"
        },
        "nearby": [
            {
                "word": "grim",
                "pos": "adjective"
            },
            {
                "word": "grimace",
                "pos": "verb"
            },
            {
                "word": "grimace",
                "pos": "noun"
            },
            {
                "word": "Joseph Grimaldi",
                "pos": ""
            },
            {
                "word": "grime",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an ugly expression made by twisting your face, used to show pain, dislike, etc. or to make somebody laugh",
                    "vi": "một biểu cảm xấu xí được tạo ra bằng cách xoay mặt của bạn, được sử dụng để thể hiện sự đau đớn, không thích, v.v. hoặc để chọc cười ai đó"
                },
                "examples": [
                    {
                        "en": "to make/give a grimace of pain",
                        "vi": "làm / nhăn mặt vì đau"
                    },
                    {
                        "en": "‘What's that?’ she asked with a grimace.",
                        "vi": "Đó là cái gì?' cô hỏi với một vẻ mặt nhăn nhó."
                    }
                ]
            }
        ]
    },
    {
        "id": "a02e53860d144999b2972508a36bb626",
        "word": "gurn",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ɡɜːn/",
            "us": "/ɡɜːrn/"
        },
        "nearby": [
            {
                "word": "gurgle",
                "pos": "noun"
            },
            {
                "word": "Gurkha",
                "pos": "noun"
            },
            {
                "word": "gurn",
                "pos": "verb"
            },
            {
                "word": "gurner",
                "pos": "noun"
            },
            {
                "word": "gurney",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to deliberately pull your face into a silly or unpleasant shape",
                    "vi": "cố tình kéo khuôn mặt của bạn thành một hình dạng ngớ ngẩn hoặc khó chịu"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "8ab57e66974f49599b9b4f8d736824d3",
        "word": "hangdog",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈhæŋdɒɡ/",
            "us": "/ˈhæŋdɔːɡ/"
        },
        "nearby": [
            {
                "word": "hang around with",
                "pos": "phrasal verb"
            },
            {
                "word": "hang back",
                "pos": "phrasal verb"
            },
            {
                "word": "hangdog",
                "pos": "adjective"
            },
            {
                "word": "hanger",
                "pos": "noun"
            },
            {
                "word": "hanger-on",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "if a person has a hangdog look, they look sad or ashamed",
                    "vi": "nếu một người có dáng vẻ giống chó săn, họ trông buồn bã hoặc xấu hổ"
                },
                "examples": [
                    {
                        "en": "his hangdog expression",
                        "vi": "biểu hiện của anh ấy"
                    }
                ]
            }
        ]
    },
    {
        "id": "6415fbb1f73c4abcbec5a7e38afe5a9d",
        "word": "leer",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/lɪə(r)/",
            "us": "/lɪr/"
        },
        "nearby": [
            {
                "word": "Lee-Enfield",
                "pos": "noun"
            },
            {
                "word": "leek",
                "pos": "noun"
            },
            {
                "word": "leer",
                "pos": "verb"
            },
            {
                "word": "leer",
                "pos": "noun"
            },
            {
                "word": "leery",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to look or smile at somebody in an unpleasant way that shows an evil or sexual interest in them",
                    "vi": "nhìn hoặc mỉm cười với ai đó theo cách khó chịu thể hiện sự quan tâm xấu xa hoặc tình dục đối với họ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "226f8a0a34e34c01aea0cab48ba7bc72",
        "word": "leer",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/lɪə(r)/",
            "us": "/lɪr/"
        },
        "nearby": [
            {
                "word": "leek",
                "pos": "noun"
            },
            {
                "word": "leer",
                "pos": "verb"
            },
            {
                "word": "leer",
                "pos": "noun"
            },
            {
                "word": "leery",
                "pos": "adjective"
            },
            {
                "word": "leet",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an unpleasant look or smile that shows somebody is interested in a person in an evil or sexual way",
                    "vi": "một cái nhìn hoặc nụ cười khó chịu cho thấy ai đó đang quan tâm đến một người theo cách xấu xa hoặc tình dục"
                },
                "examples": [
                    {
                        "en": "He looked at her with an evil leer.",
                        "vi": "Anh nhìn cô với ánh mắt ác độc."
                    }
                ]
            }
        ]
    },
    {
        "id": "6708fb3cbc9b44249be8f1d39bedf543",
        "word": "pull/make faces/a face (at somebody)",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/feɪs/",
            "us": "/feɪs/"
        },
        "nearby": [
            {
                "word": "fabulously",
                "pos": "adverb"
            },
            {
                "word": "facade",
                "pos": "noun"
            },
            {
                "word": "face",
                "pos": "noun"
            },
            {
                "word": "face",
                "pos": "verb"
            },
            {
                "word": "Facebook",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the front part of the head, where the eyes, nose and mouth are",
                    "vi": "phần trước của đầu, nơi có mắt, mũi và miệng"
                },
                "examples": [
                    {
                        "en": "a pretty/pale/round face",
                        "vi": "một khuôn mặt xinh xắn / nhợt nhạt / tròn trịa"
                    },
                    {
                        "en": "He buried his face in his hands.",
                        "vi": "Anh vùi mặt vào tay mình."
                    },
                    {
                        "en": "to hide/cover your face",
                        "vi": "để ẩn / che khuôn mặt của bạn"
                    },
                    {
                        "en": "on somebody's face You should have seen the look on her face when I told her!",
                        "vi": "trên khuôn mặt của ai đó Bạn nên nhìn thấy vẻ mặt của cô ấy khi tôi nói với cô ấy!"
                    },
                    {
                        "en": "The expression on his face never changed.",
                        "vi": "Biểu cảm trên mặt anh ta không hề thay đổi."
                    },
                    {
                        "en": "in the face She was red in the face with embarrassment.",
                        "vi": "vào mặt Cô ấy đỏ mặt vì xấu hổ."
                    },
                    {
                        "en": "At that time, her face was on the covers of all the magazines.",
                        "vi": "Vào thời điểm đó, gương mặt của cô ấy đã xuất hiện trên trang bìa của tất cả các tạp chí."
                    }
                ]
            },
            {
                "define": {
                    "en": "an expression that is shown on somebody’s face",
                    "vi": "một biểu cảm được thể hiện trên khuôn mặt của ai đó"
                },
                "examples": [
                    {
                        "en": "a smiling/happy/sad face",
                        "vi": "một khuôn mặt tươi cười / hạnh phúc / buồn bã"
                    },
                    {
                        "en": "Her face lit up (= showed happiness) when she spoke of the past.",
                        "vi": "Mặt cô ấy sáng lên (= thể hiện sự hạnh phúc) khi cô ấy nói về quá khứ."
                    },
                    {
                        "en": "His face fell (= showed disappointment, sadness, etc.) when he read the headlines.",
                        "vi": "Mặt anh ấy xịu xuống (= thể hiện sự thất vọng, buồn bã, v.v.) khi đọc các tiêu đề."
                    },
                    {
                        "en": "I could tell by his face it hadn't gone well.",
                        "vi": "Tôi có thể nhận ra bằng khuôn mặt của anh ấy rằng mọi chuyện đã không diễn ra tốt đẹp."
                    },
                    {
                        "en": "Sue's face was a picture (= she looked very surprised, angry, etc.) as she listened to her husband's speech.",
                        "vi": "Khuôn mặt của Sue như một bức tranh (= cô ấy trông rất ngạc nhiên, tức giận, v.v.) khi cô ấy lắng nghe bài phát biểu của chồng mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to refer to a person of the type mentioned",
                    "vi": "được sử dụng để chỉ một người thuộc loại được đề cập"
                },
                "examples": [
                    {
                        "en": "She looked around for a familiar face.",
                        "vi": "Cô nhìn xung quanh để tìm một khuôn mặt quen thuộc."
                    },
                    {
                        "en": "He's a fresh face (= somebody new) at the company.",
                        "vi": "Anh ấy là một gương mặt tươi tắn (= ai đó mới) ở công ty."
                    },
                    {
                        "en": "It's nice to see some new faces here this evening.",
                        "vi": "Thật vui khi thấy một số gương mặt mới ở đây vào tối nay."
                    },
                    {
                        "en": "The movie is full of famous faces.",
                        "vi": "Phim quy tụ đầy đủ các gương mặt nổi tiếng."
                    },
                    {
                        "en": "a well-known face on our television screens",
                        "vi": "một gương mặt nổi tiếng trên màn hình tivi của chúng ta"
                    },
                    {
                        "en": "I'm tired of seeing the same old faces every time we go out!",
                        "vi": "Tôi mệt mỏi khi nhìn thấy những khuôn mặt cũ giống nhau mỗi khi chúng tôi đi chơi!"
                    }
                ]
            },
            {
                "define": {
                    "en": "having the type of face or expression mentioned",
                    "vi": "có kiểu khuôn mặt hoặc biểu cảm được đề cập"
                },
                "examples": [
                    {
                        "en": "pale-faced",
                        "vi": "mặt tái mét"
                    },
                    {
                        "en": "a freckle-faced boy",
                        "vi": "một cậu bé mặt tàn nhang"
                    },
                    {
                        "en": "grim-faced",
                        "vi": "mặt dữ tợn"
                    },
                    {
                        "en": "a sad-faced woman",
                        "vi": "một người phụ nữ có khuôn mặt buồn"
                    }
                ]
            },
            {
                "define": {
                    "en": "a side or surface of something",
                    "vi": "một mặt hoặc bề mặt của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "the north face of the mountain",
                        "vi": "mặt phía bắc của ngọn núi"
                    },
                    {
                        "en": "the dark face of the moon",
                        "vi": "mặt trăng bóng tối"
                    },
                    {
                        "en": "A steep path zigzags down the cliff face.",
                        "vi": "Một con đường dốc ngoằn ngoèo xuống mặt vách đá."
                    },
                    {
                        "en": "We could see tiny figures climbing the rock face.",
                        "vi": "Chúng tôi có thể nhìn thấy những hình người nhỏ bé đang leo lên mặt đá."
                    },
                    {
                        "en": "Ivy covered the front face of the house.",
                        "vi": "Cây thường xuân che mặt trước của ngôi nhà."
                    },
                    {
                        "en": "A banner hung across the face of the building.",
                        "vi": "Một biểu ngữ được treo trên mặt của tòa nhà."
                    },
                    {
                        "en": "How many faces does a cube have?",
                        "vi": "Hình lập phương có bao nhiêu mặt?"
                    }
                ]
            },
            {
                "define": {
                    "en": "the front part of a clock or watch",
                    "vi": "phần trước của đồng hồ hoặc đồng hồ đeo tay"
                },
                "examples": [
                    {
                        "en": "a dial like the face of a clock",
                        "vi": "một mặt số giống như mặt đồng hồ"
                    }
                ]
            },
            {
                "define": {
                    "en": "the particular character of something",
                    "vi": "nhân vật cụ thể của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "face of something the changing face of Britain",
                        "vi": "đối mặt với một cái gì đó thay đổi bộ mặt của nước Anh"
                    },
                    {
                        "en": "This discovery changed the whole face of science.",
                        "vi": "Khám phá này đã thay đổi toàn bộ bộ mặt của khoa học."
                    },
                    {
                        "en": "with a… face bureaucracy with a human face",
                        "vi": "với một… bộ mặt quan liêu với một khuôn mặt của con người"
                    }
                ]
            },
            {
                "define": {
                    "en": "a particular aspect of something",
                    "vi": "một khía cạnh cụ thể của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "Social deprivation is the unacceptable face of capitalism.",
                        "vi": "Sự thiếu thốn về mặt xã hội là bộ mặt không thể chấp nhận được của chủ nghĩa tư bản."
                    },
                    {
                        "en": "He has become the public face of the company.",
                        "vi": "Anh ấy đã trở thành gương mặt đại diện cho công ty."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to describe something that you have failed to see, even though it was obvious and should have been easy to see",
                    "vi": "được sử dụng để mô tả một cái gì đó mà bạn không thể nhìn thấy, mặc dù nó rõ ràng và đáng lẽ phải dễ dàng nhìn thấy"
                },
                "examples": [
                    {
                        "en": "The answer was staring us in the face but we never saw it until it was too late.",
                        "vi": "Câu trả lời đang nhìn chằm chằm vào mặt chúng tôi nhưng chúng tôi không bao giờ nhìn thấy nó cho đến khi quá muộn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be certain to happen",
                    "vi": "chắc chắn sẽ xảy ra"
                },
                "examples": [
                    {
                        "en": "Defeat was staring them in the face.",
                        "vi": "Thất bại đang nhìn chằm chằm vào mặt họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be unable to avoid something",
                    "vi": "không thể tránh một cái gì đó"
                },
                "examples": [
                    {
                        "en": "They were staring defeat in the face.",
                        "vi": "Họ đang nhìn chằm chằm vào thất bại khi đối mặt."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be very obvious to other people from the expression on somebody’s face",
                    "vi": "rất rõ ràng đối với người khác từ biểu hiện trên khuôn mặt của ai đó"
                },
                "examples": [
                    {
                        "en": "Guilt was written all over his face.",
                        "vi": "Cảm giác tội lỗi hiện rõ trên khuôn mặt anh."
                    }
                ]
            },
            {
                "define": {
                    "en": "if a plan, etc. blows up in your face, it goes badly wrong in a way that causes you damage or makes you feel embarrassed",
                    "vi": "nếu một kế hoạch, v.v. thổi vào mặt bạn, nó sẽ trở nên sai lầm nghiêm trọng theo hướng khiến bạn thiệt hại hoặc khiến bạn cảm thấy xấu hổ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to do something when you are angry that is meant to harm somebody else but that also harms you",
                    "vi": "làm điều gì đó khi bạn tức giận có nghĩa là để làm hại người khác nhưng điều đó cũng gây hại cho bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to disappear completely",
                    "vi": "biến mất hoàn toàn"
                },
                "examples": [
                    {
                        "en": "Keep looking—they can't just have vanished off the face of the earth.",
                        "vi": "Hãy tiếp tục tìm kiếm — chúng không thể biến mất khỏi mặt đất."
                    }
                ]
            },
            {
                "define": {
                    "en": "to try to do something as hard and as long as you possibly can but without success",
                    "vi": "cố gắng làm điều gì đó khó và miễn là bạn có thể nhưng không thành công"
                },
                "examples": [
                    {
                        "en": "You can argue till you're blue in the face, but you won't change my mind.",
                        "vi": "Bạn có thể tranh luận cho đến khi bạn xanh mặt, nhưng bạn sẽ không thay đổi ý kiến của tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that somebody will/will not get a particular job or position because they have/do not have the appearance, personality, etc. that the employer wants, even when this should not be important",
                    "vi": "được sử dụng để nói rằng ai đó sẽ / sẽ không nhận được một công việc hoặc vị trí cụ thể bởi vì họ có / không có ngoại hình, tính cách, v.v. mà nhà tuyển dụng mong muốn, ngay cả khi điều này không quan trọng"
                },
                "examples": [
                    {
                        "en": "If your face fits, you'll get the job.",
                        "vi": "Nếu khuôn mặt của bạn phù hợp, bạn sẽ nhận được công việc."
                    },
                    {
                        "en": "It doesn't matter how well qualified you are; if your face doesn't fit, you don't stand a chance.",
                        "vi": "Không quan trọng là bạn có đủ điều kiện như thế nào; nếu khuôn mặt của bạn không phù hợp, bạn không có cơ hội."
                    }
                ]
            },
            {
                "define": {
                    "en": "somebody looks very angry",
                    "vi": "ai đó trông rất tức giận"
                },
                "examples": [
                    {
                        "en": "Mr Hibbs came in with a face like thunder.",
                        "vi": "Ông Hibbs bước vào với khuôn mặt như sấm sét."
                    }
                ]
            },
            {
                "define": {
                    "en": "close to and looking at somebody",
                    "vi": "gần và nhìn ai đó"
                },
                "examples": [
                    {
                        "en": "The two have never met face to face before.",
                        "vi": "Cả hai chưa bao giờ gặp mặt trực tiếp trước đây."
                    },
                    {
                        "en": "The room fell silent as she came face to face with the man who had tried to kill her.",
                        "vi": "Căn phòng im lặng khi cô đối mặt với kẻ đã cố giết cô."
                    }
                ]
            },
            {
                "define": {
                    "en": "in a situation where you have to accept that something is true and deal with it",
                    "vi": "trong một tình huống mà bạn phải chấp nhận rằng điều gì đó là đúng và đối phó với nó"
                },
                "examples": [
                    {
                        "en": "She was at an early age brought face to face with the horrors of war.",
                        "vi": "Khi còn nhỏ, cô đã phải đối mặt với sự khủng khiếp của chiến tranh."
                    }
                ]
            },
            {
                "define": {
                    "en": "with your face and stomach facing upwards/downwards",
                    "vi": "với mặt và bụng của bạn hướng lên trên / xuống dưới"
                },
                "examples": [
                    {
                        "en": "She lay face down on the bed.",
                        "vi": "Cô nằm úp mặt xuống giường."
                    }
                ]
            },
            {
                "define": {
                    "en": "with the front part or surface facing upwards/downwards",
                    "vi": "với phần trước hoặc bề mặt hướng lên trên / xuống dưới"
                },
                "examples": [
                    {
                        "en": "Place the card face up on the pile.",
                        "vi": "Đặt thẻ úp trên cọc."
                    },
                    {
                        "en": "She placed the cards face down on the table.",
                        "vi": "Cô đặt những tấm thẻ úp xuống bàn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to fall so that you are lying on your front",
                    "vi": "rơi xuống để bạn đang nằm trên mặt trước của bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to fail completely, usually in an embarrassing way",
                    "vi": "thất bại hoàn toàn, thường là một cách đáng xấu hổ"
                },
                "examples": [
                    {
                        "en": "His next television venture fell flat on its face.",
                        "vi": "Dự án truyền hình tiếp theo của anh ấy đã thất bại trên khuôn mặt của nó."
                    }
                ]
            },
            {
                "define": {
                    "en": "to eat a lot of food or too much food",
                    "vi": "ăn nhiều hoặc ăn quá nhiều"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to oppose or be the opposite of something that is usual or expected",
                    "vi": "phản đối hoặc đối lập với điều gì đó bình thường hoặc được mong đợi"
                },
                "examples": [
                    {
                        "en": "Such a proposal is flying in the face of common sense.",
                        "vi": "Một đề xuất như vậy đang bay theo lẽ thường."
                    }
                ]
            },
            {
                "define": {
                    "en": "to do something that other people think is rude or shows a lack of respect, without feeling embarrassed or ashamed",
                    "vi": "làm điều gì đó mà người khác cho là thô lỗ hoặc thể hiện sự thiếu tôn trọng mà không cảm thấy xấu hổ hoặc xấu hổ"
                },
                "examples": [
                    {
                        "en": "I don't know how you have the face to complain after everything they've done for you!",
                        "vi": "Tôi không biết bạn có khuôn mặt để phàn nàn như thế nào sau tất cả những gì họ đã làm cho bạn!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be made to look stupid",
                    "vi": "bị làm cho trông ngu ngốc"
                },
                "examples": [
                    {
                        "en": "They were left with egg on their faces when only ten people showed up.",
                        "vi": "Họ bị bỏ lại với quả trứng trên mặt khi chỉ có mười người xuất hiện."
                    }
                ]
            },
            {
                "define": {
                    "en": "annoying somebody by criticizing them or telling them what to do all the time",
                    "vi": "làm phiền ai đó bằng cách chỉ trích họ hoặc bảo họ phải làm gì mọi lúc"
                },
                "examples": [
                    {
                        "en": "Why are you always in my face?",
                        "vi": "Tại sao bạn luôn luôn đối mặt với tôi?"
                    }
                ]
            },
            {
                "define": {
                    "en": "despite problems, difficulties, etc.",
                    "vi": "bất chấp những vướng mắc, khó khăn, v.v."
                },
                "examples": [
                    {
                        "en": "She showed great courage in the face of danger.",
                        "vi": "Cô đã thể hiện sự dũng cảm khi đối mặt với nguy hiểm."
                    },
                    {
                        "en": "The campaign continued in the face of great opposition.",
                        "vi": "Chiến dịch tiếp tục vấp phải sự phản đối lớn."
                    }
                ]
            },
            {
                "define": {
                    "en": "as a result of something",
                    "vi": "kết quả của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "He was unable to deny the charges in the face of new evidence.",
                        "vi": "Anh không thể phủ nhận cáo buộc khi đối mặt với những bằng chứng mới."
                    }
                ]
            },
            {
                "define": {
                    "en": "to show in a very obvious way that you have no respect for somebody",
                    "vi": "thể hiện một cách rất rõ ràng rằng bạn không tôn trọng ai đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be forced to change from feeling pleased or satisfied to feeling disappointed or annoyed",
                    "vi": "buộc phải thay đổi từ cảm thấy hài lòng hoặc hài lòng sang cảm thấy thất vọng hoặc khó chịu"
                },
                "examples": [
                    {
                        "en": "He’ll be laughing on the other side of his face when he reads my letter.",
                        "vi": "Anh ấy sẽ cười trên khuôn mặt khác khi đọc bức thư của tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "(to have) an unhappy or disappointed expression",
                    "vi": "(có) một biểu hiện không vui hoặc thất vọng"
                },
                "examples": [
                    {
                        "en": "He took one look at her long face and said ‘What’s wrong?’",
                        "vi": "Anh nhìn vào khuôn mặt dài của cô và nói 'Có chuyện gì vậy?'"
                    },
                    {
                        "en": "The news for the company isn't good, judging from the long faces in the boardroom.",
                        "vi": "Tin tức cho công ty không tốt, xét từ những gương mặt dài trong phòng họp."
                    }
                ]
            },
            {
                "define": {
                    "en": "to look straight at somebody without feeling embarrassed or ashamed",
                    "vi": "nhìn thẳng vào ai đó mà không cảm thấy xấu hổ hay xấu hổ"
                },
                "examples": [
                    {
                        "en": "Can you look me in the eye and tell me you're not lying?",
                        "vi": "Bạn có thể nhìn vào mắt tôi và nói với tôi rằng bạn không nói dối?"
                    },
                    {
                        "en": "She looked her father straight in the eye and answered his question truthfully.",
                        "vi": "Cô nhìn thẳng vào mắt cha mình và trả lời thành thật câu hỏi của ông."
                    },
                    {
                        "en": "I'll never be able to look her in the face again!",
                        "vi": "Tôi sẽ không bao giờ có thể nhìn mặt cô ấy nữa!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be less respected or look stupid because of something you have done",
                    "vi": "ít được tôn trọng hoặc trông ngu ngốc vì điều gì đó bạn đã làm"
                },
                "examples": [
                    {
                        "en": "Many leaders don't want to lose face by admitting failures.",
                        "vi": "Nhiều nhà lãnh đạo không muốn bị mất mặt khi thừa nhận thất bại."
                    }
                ]
            },
            {
                "define": {
                    "en": "the state of being less respected by other people or looking stupid because of something you have done",
                    "vi": "trạng thái ít được người khác tôn trọng hoặc trông ngu ngốc vì điều gì đó bạn đã làm"
                },
                "examples": [
                    {
                        "en": "Failure to pass the exams means a massive loss of face for the students and their parents.",
                        "vi": "Không vượt qua được kỳ thi đồng nghĩa với việc học sinh và cha mẹ học sinh bị mất thể diện rất lớn."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to emphasize that you have particular skills or qualities",
                    "vi": "được sử dụng để nhấn mạnh rằng bạn có các kỹ năng hoặc phẩm chất cụ thể"
                },
                "examples": [
                    {
                        "en": "‘I didn't know you could play the piano.’ ‘I'm not just a pretty face, you know!’",
                        "vi": "Tôi không biết bạn có thể chơi piano.' 'Tôi không chỉ là một khuôn mặt xinh đẹp, bạn biết đấy!'"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that something seems to be good, true, etc. but that this opinion may need to be changed when you know more about it",
                    "vi": "được sử dụng để nói rằng điều gì đó có vẻ là tốt, đúng, v.v. nhưng ý kiến này có thể cần được thay đổi khi bạn biết thêm về nó"
                },
                "examples": [
                    {
                        "en": "On the face of it, it seems like a great deal.",
                        "vi": "Về mặt nó, nó có vẻ như là một việc lớn."
                    },
                    {
                        "en": "What may, on the face of it, seem obvious often turns out to be far more complicated.",
                        "vi": "Những gì có thể, trên mặt của nó, có vẻ rõ ràng thường trở nên phức tạp hơn nhiều."
                    }
                ]
            },
            {
                "define": {
                    "en": "very obvious",
                    "vi": "rất rõ ràng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to produce an expression on your face to show that you do not like somebody/something or in order to make somebody laugh",
                    "vi": "biểu hiện trên khuôn mặt của bạn để thể hiện rằng bạn không thích ai đó / điều gì đó hoặc để làm cho ai đó cười"
                },
                "examples": [
                    {
                        "en": "What are you pulling a face at now?",
                        "vi": "Bạn đang kéo một khuôn mặt vào lúc này?"
                    },
                    {
                        "en": "Do you think it’s funny to make faces behind my back?",
                        "vi": "Bạn có nghĩ thật buồn cười khi làm mặt sau lưng tôi không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to put on make-up",
                    "vi": "để trang điểm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to pretend that you feel confident and happy when you do not",
                    "vi": "giả vờ rằng bạn cảm thấy tự tin và hạnh phúc khi bạn không"
                },
                "examples": [
                    {
                        "en": "I had to put on a brave face and try to show him that I wasn’t worried.",
                        "vi": "Tôi phải tỏ ra dũng cảm và cố gắng cho anh ấy thấy rằng tôi không lo lắng."
                    },
                    {
                        "en": "She put a brave face on her illness.",
                        "vi": "Cô ấy dũng cảm đối mặt với bệnh tật của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to avoid or help somebody avoid being embarrassed",
                    "vi": "để tránh hoặc giúp ai đó khỏi xấu hổ"
                },
                "examples": [
                    {
                        "en": "She was fired, but she saved face by telling everyone she'd resigned.",
                        "vi": "Cô ấy đã bị sa thải, nhưng cô ấy đã cứu vãn thể diện bằng cách nói với mọi người rằng cô ấy sẽ từ chức."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be determined to oppose somebody/something",
                    "vi": "quyết tâm chống lại ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "Her father had set his face against the marriage.",
                        "vi": "Cha cô đã ra mặt phản đối cuộc hôn nhân."
                    }
                ]
            },
            {
                "define": {
                    "en": "to appear among your friends or in public",
                    "vi": "xuất hiện giữa bạn bè của bạn hoặc ở nơi công cộng"
                },
                "examples": [
                    {
                        "en": "She stayed at home, afraid to show her face.",
                        "vi": "Cô ở nhà sợ lộ mặt."
                    }
                ]
            },
            {
                "define": {
                    "en": "to shut a door hard when somebody is trying to come in",
                    "vi": "đóng chặt cửa khi ai đó đang cố gắng vào"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to refuse to talk to somebody or meet them, in a rude way",
                    "vi": "từ chối nói chuyện với ai đó hoặc gặp họ, một cách thô lỗ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a rude way of telling somebody to be quiet or stop talking",
                    "vi": "một cách thô lỗ để bảo ai đó im lặng hoặc ngừng nói"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "an action that seems to be intended as a deliberate way of offending and showing lack of respect for somebody",
                    "vi": "một hành động dường như là một cách cố ý xúc phạm và thể hiện sự thiếu tôn trọng đối với ai đó"
                },
                "examples": [
                    {
                        "en": "The closure of the school is a slap in the face to the local community.",
                        "vi": "Việc đóng cửa trường học là một cái tát vào mặt cộng đồng địa phương."
                    }
                ]
            },
            {
                "define": {
                    "en": "if you keep a straight face, you do not laugh or smile, although you find something funny",
                    "vi": "nếu bạn giữ một khuôn mặt thẳng thắn, bạn không cười hoặc không cười, mặc dù bạn thấy điều gì đó buồn cười"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "if you say something to somebody’s face, you say it to them directly rather than to other people",
                    "vi": "nếu bạn nói điều gì đó vào mặt ai đó, bạn nói điều đó trực tiếp với họ thay vì nói với người khác"
                },
                "examples": [
                    {
                        "en": "He’s a liar, and I’ve told him so to his face many times.",
                        "vi": "Anh ta là một kẻ nói dối, và tôi đã nói với anh ta như vậy trước mặt anh ta nhiều lần."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to refer to a person whose name you cannot remember",
                    "vi": "được sử dụng để chỉ một người mà bạn không thể nhớ tên"
                },
                "examples": [
                    {
                        "en": "Are you still working for what's her face?",
                        "vi": "Bạn vẫn đang làm việc cho khuôn mặt của cô ấy?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to destroy or remove somebody/something completely",
                    "vi": "để tiêu diệt hoặc loại bỏ ai đó / cái gì đó hoàn toàn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "6aea37bd12674095b06059a0b3ac21ca",
        "word": "scowl",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/skaʊl/",
            "us": "/skaʊl/"
        },
        "nearby": [
            {
                "word": "scoutmaster",
                "pos": "noun"
            },
            {
                "word": "scout out",
                "pos": "phrasal verb"
            },
            {
                "word": "scowl",
                "pos": "verb"
            },
            {
                "word": "scowl",
                "pos": "noun"
            },
            {
                "word": "SCQF",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to look at somebody/something in an angry or annoyed way",
                    "vi": "nhìn ai đó / cái gì đó một cách tức giận hoặc khó chịu"
                },
                "examples": [
                    {
                        "en": "The receptionist scowled at me.",
                        "vi": "Cô lễ tân cau có với tôi."
                    }
                ]
            }
        ]
    },
    {
        "id": "ee039c82e2d74e2bb3c775c67b08e78e",
        "word": "scowl",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/skaʊl/",
            "us": "/skaʊl/"
        },
        "nearby": [
            {
                "word": "scout out",
                "pos": "phrasal verb"
            },
            {
                "word": "scowl",
                "pos": "verb"
            },
            {
                "word": "scowl",
                "pos": "noun"
            },
            {
                "word": "SCQF",
                "pos": "noun"
            },
            {
                "word": "SCR",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an angry look or expression",
                    "vi": "một cái nhìn hoặc biểu hiện tức giận"
                },
                "examples": [
                    {
                        "en": "He looked up at me with a scowl.",
                        "vi": "Anh ta nhìn tôi với vẻ mặt cau có."
                    },
                    {
                        "en": "Her brows drew together in a scowl.",
                        "vi": "Lông mày cô cau lại với nhau."
                    },
                    {
                        "en": "His face was set in a permanent scowl.",
                        "vi": "Khuôn mặt anh luôn cau có."
                    }
                ]
            }
        ]
    },
    {
        "id": "5bf7547893f9472fadbadb9dddc8f8f3",
        "word": "smirk",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/smɜːk/",
            "us": "/smɜːrk/"
        },
        "nearby": [
            {
                "word": "smiley",
                "pos": "noun"
            },
            {
                "word": "smilingly",
                "pos": "adverb"
            },
            {
                "word": "smirk",
                "pos": "verb"
            },
            {
                "word": "smirk",
                "pos": "noun"
            },
            {
                "word": "smite",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to smile in a silly or unpleasant way that shows that you are pleased with yourself, know something that other people do not know, etc.",
                    "vi": "mỉm cười một cách ngớ ngẩn hoặc khó chịu cho thấy rằng bạn hài lòng với bản thân, biết điều gì đó mà người khác không biết, v.v."
                },
                "examples": [
                    {
                        "en": "It was hard not to smirk.",
                        "vi": "Thật khó để không nhếch mép."
                    },
                    {
                        "en": "He smirked unpleasantly when we told him the bad news.",
                        "vi": "Anh ta nhếch mép khó chịu khi chúng tôi cho anh ta biết tin xấu."
                    },
                    {
                        "en": "She smirked to herself as she walked away.",
                        "vi": "Cô tự cười một mình khi bước đi."
                    },
                    {
                        "en": "What are you smirking at?",
                        "vi": "Bạn đang cười cái gì vậy?"
                    }
                ]
            }
        ]
    },
    {
        "id": "e0980cc89d344e7985291e3bc7c5656c",
        "word": "smirk",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/smɜːk/",
            "us": "/smɜːrk/"
        },
        "nearby": [
            {
                "word": "smilingly",
                "pos": "adverb"
            },
            {
                "word": "smirk",
                "pos": "verb"
            },
            {
                "word": "smirk",
                "pos": "noun"
            },
            {
                "word": "smite",
                "pos": "verb"
            },
            {
                "word": "smith",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a silly and unpleasant smile that shows that you are pleased with yourself, know something that other people do not know, etc.",
                    "vi": "một nụ cười ngớ ngẩn và khó chịu cho thấy rằng bạn hài lòng với bản thân, biết điều gì đó mà người khác không biết, v.v."
                },
                "examples": [
                    {
                        "en": "She had a self-satisfied smirk on her face.",
                        "vi": "Cô ấy nở một nụ cười tự mãn trên khuôn mặt."
                    }
                ]
            }
        ]
    },
    {
        "id": "e76d0425956d4658bf7b22d22bbf0078",
        "word": "smize",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/smaɪz/",
            "us": "/smaɪz/"
        },
        "nearby": [
            {
                "word": "smitten",
                "pos": "adjective"
            },
            {
                "word": "smitten",
                "pos": "verb"
            },
            {
                "word": "smize",
                "pos": "verb"
            },
            {
                "word": "smize",
                "pos": "noun"
            },
            {
                "word": "SMO",
                "pos": "abbreviation"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to make a smiling expression with your eyes",
                    "vi": "để tạo biểu cảm mỉm cười với đôi mắt của bạn"
                },
                "examples": [
                    {
                        "en": "When we had to wear masks during the pandemic, many of us had to learn to smize.",
                        "vi": "Khi phải đeo mặt nạ trong đại dịch, nhiều người trong chúng ta phải học cách giảm thiểu."
                    }
                ]
            }
        ]
    },
    {
        "id": "6292841db38d4090910f57a8c3666990",
        "word": "smize",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/smaɪz/",
            "us": "/smaɪz/"
        },
        "nearby": [
            {
                "word": "smitten",
                "pos": "verb"
            },
            {
                "word": "smize",
                "pos": "verb"
            },
            {
                "word": "smize",
                "pos": "noun"
            },
            {
                "word": "SMO",
                "pos": "abbreviation"
            },
            {
                "word": "smock",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a smiling expression made with the eyes",
                    "vi": "biểu cảm mỉm cười với đôi mắt"
                },
                "examples": [
                    {
                        "en": "She's been practising her smize in front of the mirror.",
                        "vi": "Cô ấy đang thực hành thu nhỏ trước gương."
                    }
                ]
            }
        ]
    },
    {
        "id": "f1b0196675fb4189b5ae83e178e9f06e",
        "word": "sneer",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/snɪə(r)/",
            "us": "/snɪr/"
        },
        "nearby": [
            {
                "word": "sneak up",
                "pos": "phrasal verb"
            },
            {
                "word": "sneaky",
                "pos": "adjective"
            },
            {
                "word": "sneer",
                "pos": "verb"
            },
            {
                "word": "sneer",
                "pos": "noun"
            },
            {
                "word": "sneeringly",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to show that you have no respect for somebody by the expression on your face or by the way you speak",
                    "vi": "thể hiện rằng bạn không tôn trọng ai đó bằng biểu hiện trên khuôn mặt hoặc cách bạn nói"
                },
                "examples": [
                    {
                        "en": "sneer (at somebody/something) He sneered at people who liked pop music.",
                        "vi": "chế nhạo (với ai đó / cái gì đó) Anh ấy chế nhạo những người thích nhạc pop."
                    },
                    {
                        "en": "a sneering comment",
                        "vi": "một bình luận chế nhạo"
                    },
                    {
                        "en": "She gave a sneering laugh.",
                        "vi": "Cô ấy cười chế nhạo."
                    },
                    {
                        "en": "+ speech ‘You? A writer?’ she sneered.",
                        "vi": "Err:509"
                    }
                ]
            }
        ]
    },
    {
        "id": "4c9a012b83694ba49f3faf62f6136a7f",
        "word": "sneer",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/snɪə(r)/",
            "us": "/snɪr/"
        },
        "nearby": [
            {
                "word": "sneaky",
                "pos": "adjective"
            },
            {
                "word": "sneer",
                "pos": "verb"
            },
            {
                "word": "sneer",
                "pos": "noun"
            },
            {
                "word": "sneeringly",
                "pos": "adverb"
            },
            {
                "word": "sneeze",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an unpleasant look, smile or comment that shows you do not respect somebody/something",
                    "vi": "một cái nhìn khó chịu, nụ cười hoặc nhận xét cho thấy bạn không tôn trọng ai đó / điều gì đó"
                },
                "examples": [
                    {
                        "en": "‘And who are you, then?’ he asked with a sneer in his voice.",
                        "vi": "Vậy bạn là ai?' anh hỏi với giọng mỉa mai."
                    },
                    {
                        "en": "A faint sneer of satisfaction crossed her face.",
                        "vi": "Một nụ cười mãn nguyện thoáng qua khuôn mặt cô."
                    }
                ]
            }
        ]
    },
    {
        "id": "0a32922df70342c284611f34ffa5efe9",
        "word": "somebody’s face is like thunder",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/feɪs/",
            "us": "/feɪs/"
        },
        "nearby": [
            {
                "word": "fabulously",
                "pos": "adverb"
            },
            {
                "word": "facade",
                "pos": "noun"
            },
            {
                "word": "face",
                "pos": "noun"
            },
            {
                "word": "face",
                "pos": "verb"
            },
            {
                "word": "Facebook",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the front part of the head, where the eyes, nose and mouth are",
                    "vi": "phần trước của đầu, nơi có mắt, mũi và miệng"
                },
                "examples": [
                    {
                        "en": "a pretty/pale/round face",
                        "vi": "một khuôn mặt xinh xắn / nhợt nhạt / tròn trịa"
                    },
                    {
                        "en": "He buried his face in his hands.",
                        "vi": "Anh vùi mặt vào tay mình."
                    },
                    {
                        "en": "to hide/cover your face",
                        "vi": "để ẩn / che khuôn mặt của bạn"
                    },
                    {
                        "en": "on somebody's face You should have seen the look on her face when I told her!",
                        "vi": "trên khuôn mặt của ai đó Bạn nên nhìn thấy vẻ mặt của cô ấy khi tôi nói với cô ấy!"
                    },
                    {
                        "en": "The expression on his face never changed.",
                        "vi": "Biểu cảm trên mặt anh ta không hề thay đổi."
                    },
                    {
                        "en": "in the face She was red in the face with embarrassment.",
                        "vi": "vào mặt Cô ấy đỏ mặt vì xấu hổ."
                    },
                    {
                        "en": "At that time, her face was on the covers of all the magazines.",
                        "vi": "Vào thời điểm đó, gương mặt của cô ấy đã xuất hiện trên trang bìa của tất cả các tạp chí."
                    }
                ]
            },
            {
                "define": {
                    "en": "an expression that is shown on somebody’s face",
                    "vi": "một biểu cảm được thể hiện trên khuôn mặt của ai đó"
                },
                "examples": [
                    {
                        "en": "a smiling/happy/sad face",
                        "vi": "một khuôn mặt tươi cười / hạnh phúc / buồn bã"
                    },
                    {
                        "en": "Her face lit up (= showed happiness) when she spoke of the past.",
                        "vi": "Mặt cô ấy sáng lên (= thể hiện sự hạnh phúc) khi cô ấy nói về quá khứ."
                    },
                    {
                        "en": "His face fell (= showed disappointment, sadness, etc.) when he read the headlines.",
                        "vi": "Mặt anh ấy xịu xuống (= thể hiện sự thất vọng, buồn bã, v.v.) khi đọc các tiêu đề."
                    },
                    {
                        "en": "I could tell by his face it hadn't gone well.",
                        "vi": "Tôi có thể nhận ra bằng khuôn mặt của anh ấy rằng mọi chuyện đã không diễn ra tốt đẹp."
                    },
                    {
                        "en": "Sue's face was a picture (= she looked very surprised, angry, etc.) as she listened to her husband's speech.",
                        "vi": "Khuôn mặt của Sue như một bức tranh (= cô ấy trông rất ngạc nhiên, tức giận, v.v.) khi cô ấy lắng nghe bài phát biểu của chồng mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to refer to a person of the type mentioned",
                    "vi": "được sử dụng để chỉ một người thuộc loại được đề cập"
                },
                "examples": [
                    {
                        "en": "She looked around for a familiar face.",
                        "vi": "Cô nhìn xung quanh để tìm một khuôn mặt quen thuộc."
                    },
                    {
                        "en": "He's a fresh face (= somebody new) at the company.",
                        "vi": "Anh ấy là một gương mặt tươi tắn (= ai đó mới) ở công ty."
                    },
                    {
                        "en": "It's nice to see some new faces here this evening.",
                        "vi": "Thật vui khi thấy một số gương mặt mới ở đây vào tối nay."
                    },
                    {
                        "en": "The movie is full of famous faces.",
                        "vi": "Phim quy tụ đầy đủ các gương mặt nổi tiếng."
                    },
                    {
                        "en": "a well-known face on our television screens",
                        "vi": "một gương mặt nổi tiếng trên màn hình tivi của chúng ta"
                    },
                    {
                        "en": "I'm tired of seeing the same old faces every time we go out!",
                        "vi": "Tôi mệt mỏi khi nhìn thấy những khuôn mặt cũ giống nhau mỗi khi chúng tôi đi chơi!"
                    }
                ]
            },
            {
                "define": {
                    "en": "having the type of face or expression mentioned",
                    "vi": "có kiểu khuôn mặt hoặc biểu cảm được đề cập"
                },
                "examples": [
                    {
                        "en": "pale-faced",
                        "vi": "mặt tái mét"
                    },
                    {
                        "en": "a freckle-faced boy",
                        "vi": "một cậu bé mặt tàn nhang"
                    },
                    {
                        "en": "grim-faced",
                        "vi": "mặt dữ tợn"
                    },
                    {
                        "en": "a sad-faced woman",
                        "vi": "một người phụ nữ có khuôn mặt buồn"
                    }
                ]
            },
            {
                "define": {
                    "en": "a side or surface of something",
                    "vi": "một mặt hoặc bề mặt của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "the north face of the mountain",
                        "vi": "mặt phía bắc của ngọn núi"
                    },
                    {
                        "en": "the dark face of the moon",
                        "vi": "mặt trăng bóng tối"
                    },
                    {
                        "en": "A steep path zigzags down the cliff face.",
                        "vi": "Một con đường dốc ngoằn ngoèo xuống mặt vách đá."
                    },
                    {
                        "en": "We could see tiny figures climbing the rock face.",
                        "vi": "Chúng tôi có thể nhìn thấy những hình người nhỏ bé đang leo lên mặt đá."
                    },
                    {
                        "en": "Ivy covered the front face of the house.",
                        "vi": "Cây thường xuân che mặt trước của ngôi nhà."
                    },
                    {
                        "en": "A banner hung across the face of the building.",
                        "vi": "Một biểu ngữ được treo trên mặt của tòa nhà."
                    },
                    {
                        "en": "How many faces does a cube have?",
                        "vi": "Hình lập phương có bao nhiêu mặt?"
                    }
                ]
            },
            {
                "define": {
                    "en": "the front part of a clock or watch",
                    "vi": "phần trước của đồng hồ hoặc đồng hồ đeo tay"
                },
                "examples": [
                    {
                        "en": "a dial like the face of a clock",
                        "vi": "một mặt số giống như mặt đồng hồ"
                    }
                ]
            },
            {
                "define": {
                    "en": "the particular character of something",
                    "vi": "nhân vật cụ thể của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "face of something the changing face of Britain",
                        "vi": "đối mặt với một cái gì đó thay đổi bộ mặt của nước Anh"
                    },
                    {
                        "en": "This discovery changed the whole face of science.",
                        "vi": "Khám phá này đã thay đổi toàn bộ bộ mặt của khoa học."
                    },
                    {
                        "en": "with a… face bureaucracy with a human face",
                        "vi": "với một… bộ mặt quan liêu với một khuôn mặt của con người"
                    }
                ]
            },
            {
                "define": {
                    "en": "a particular aspect of something",
                    "vi": "một khía cạnh cụ thể của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "Social deprivation is the unacceptable face of capitalism.",
                        "vi": "Sự thiếu thốn về mặt xã hội là bộ mặt không thể chấp nhận được của chủ nghĩa tư bản."
                    },
                    {
                        "en": "He has become the public face of the company.",
                        "vi": "Anh ấy đã trở thành gương mặt đại diện cho công ty."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to describe something that you have failed to see, even though it was obvious and should have been easy to see",
                    "vi": "được sử dụng để mô tả một cái gì đó mà bạn không thể nhìn thấy, mặc dù nó rõ ràng và đáng lẽ phải dễ dàng nhìn thấy"
                },
                "examples": [
                    {
                        "en": "The answer was staring us in the face but we never saw it until it was too late.",
                        "vi": "Câu trả lời đang nhìn chằm chằm vào mặt chúng tôi nhưng chúng tôi không bao giờ nhìn thấy nó cho đến khi quá muộn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be certain to happen",
                    "vi": "chắc chắn sẽ xảy ra"
                },
                "examples": [
                    {
                        "en": "Defeat was staring them in the face.",
                        "vi": "Thất bại đang nhìn chằm chằm vào mặt họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be unable to avoid something",
                    "vi": "không thể tránh một cái gì đó"
                },
                "examples": [
                    {
                        "en": "They were staring defeat in the face.",
                        "vi": "Họ đang nhìn chằm chằm vào thất bại khi đối mặt."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be very obvious to other people from the expression on somebody’s face",
                    "vi": "rất rõ ràng đối với người khác từ biểu hiện trên khuôn mặt của ai đó"
                },
                "examples": [
                    {
                        "en": "Guilt was written all over his face.",
                        "vi": "Cảm giác tội lỗi hiện rõ trên khuôn mặt anh."
                    }
                ]
            },
            {
                "define": {
                    "en": "if a plan, etc. blows up in your face, it goes badly wrong in a way that causes you damage or makes you feel embarrassed",
                    "vi": "nếu một kế hoạch, v.v. thổi vào mặt bạn, nó sẽ trở nên sai lầm nghiêm trọng theo hướng khiến bạn thiệt hại hoặc khiến bạn cảm thấy xấu hổ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to do something when you are angry that is meant to harm somebody else but that also harms you",
                    "vi": "làm điều gì đó khi bạn tức giận có nghĩa là để làm hại người khác nhưng điều đó cũng gây hại cho bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to disappear completely",
                    "vi": "biến mất hoàn toàn"
                },
                "examples": [
                    {
                        "en": "Keep looking—they can't just have vanished off the face of the earth.",
                        "vi": "Hãy tiếp tục tìm kiếm — chúng không thể biến mất khỏi mặt đất."
                    }
                ]
            },
            {
                "define": {
                    "en": "to try to do something as hard and as long as you possibly can but without success",
                    "vi": "cố gắng làm điều gì đó khó và miễn là bạn có thể nhưng không thành công"
                },
                "examples": [
                    {
                        "en": "You can argue till you're blue in the face, but you won't change my mind.",
                        "vi": "Bạn có thể tranh luận cho đến khi bạn xanh mặt, nhưng bạn sẽ không thay đổi ý kiến của tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that somebody will/will not get a particular job or position because they have/do not have the appearance, personality, etc. that the employer wants, even when this should not be important",
                    "vi": "được sử dụng để nói rằng ai đó sẽ / sẽ không nhận được một công việc hoặc vị trí cụ thể bởi vì họ có / không có ngoại hình, tính cách, v.v. mà nhà tuyển dụng mong muốn, ngay cả khi điều này không quan trọng"
                },
                "examples": [
                    {
                        "en": "If your face fits, you'll get the job.",
                        "vi": "Nếu khuôn mặt của bạn phù hợp, bạn sẽ nhận được công việc."
                    },
                    {
                        "en": "It doesn't matter how well qualified you are; if your face doesn't fit, you don't stand a chance.",
                        "vi": "Không quan trọng là bạn có đủ điều kiện như thế nào; nếu khuôn mặt của bạn không phù hợp, bạn không có cơ hội."
                    }
                ]
            },
            {
                "define": {
                    "en": "somebody looks very angry",
                    "vi": "ai đó trông rất tức giận"
                },
                "examples": [
                    {
                        "en": "Mr Hibbs came in with a face like thunder.",
                        "vi": "Ông Hibbs bước vào với khuôn mặt như sấm sét."
                    }
                ]
            },
            {
                "define": {
                    "en": "close to and looking at somebody",
                    "vi": "gần và nhìn ai đó"
                },
                "examples": [
                    {
                        "en": "The two have never met face to face before.",
                        "vi": "Cả hai chưa bao giờ gặp mặt trực tiếp trước đây."
                    },
                    {
                        "en": "The room fell silent as she came face to face with the man who had tried to kill her.",
                        "vi": "Căn phòng im lặng khi cô đối mặt với kẻ đã cố giết cô."
                    }
                ]
            },
            {
                "define": {
                    "en": "in a situation where you have to accept that something is true and deal with it",
                    "vi": "trong một tình huống mà bạn phải chấp nhận rằng điều gì đó là đúng và đối phó với nó"
                },
                "examples": [
                    {
                        "en": "She was at an early age brought face to face with the horrors of war.",
                        "vi": "Khi còn nhỏ, cô đã phải đối mặt với sự khủng khiếp của chiến tranh."
                    }
                ]
            },
            {
                "define": {
                    "en": "with your face and stomach facing upwards/downwards",
                    "vi": "với mặt và bụng của bạn hướng lên trên / xuống dưới"
                },
                "examples": [
                    {
                        "en": "She lay face down on the bed.",
                        "vi": "Cô nằm úp mặt xuống giường."
                    }
                ]
            },
            {
                "define": {
                    "en": "with the front part or surface facing upwards/downwards",
                    "vi": "với phần trước hoặc bề mặt hướng lên trên / xuống dưới"
                },
                "examples": [
                    {
                        "en": "Place the card face up on the pile.",
                        "vi": "Đặt thẻ úp trên cọc."
                    },
                    {
                        "en": "She placed the cards face down on the table.",
                        "vi": "Cô đặt những tấm thẻ úp xuống bàn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to fall so that you are lying on your front",
                    "vi": "rơi xuống để bạn đang nằm trên mặt trước của bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to fail completely, usually in an embarrassing way",
                    "vi": "thất bại hoàn toàn, thường là một cách đáng xấu hổ"
                },
                "examples": [
                    {
                        "en": "His next television venture fell flat on its face.",
                        "vi": "Dự án truyền hình tiếp theo của anh ấy đã thất bại trên khuôn mặt của nó."
                    }
                ]
            },
            {
                "define": {
                    "en": "to eat a lot of food or too much food",
                    "vi": "ăn nhiều hoặc ăn quá nhiều"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to oppose or be the opposite of something that is usual or expected",
                    "vi": "phản đối hoặc đối lập với điều gì đó bình thường hoặc được mong đợi"
                },
                "examples": [
                    {
                        "en": "Such a proposal is flying in the face of common sense.",
                        "vi": "Một đề xuất như vậy đang bay theo lẽ thường."
                    }
                ]
            },
            {
                "define": {
                    "en": "to do something that other people think is rude or shows a lack of respect, without feeling embarrassed or ashamed",
                    "vi": "làm điều gì đó mà người khác cho là thô lỗ hoặc thể hiện sự thiếu tôn trọng mà không cảm thấy xấu hổ hoặc xấu hổ"
                },
                "examples": [
                    {
                        "en": "I don't know how you have the face to complain after everything they've done for you!",
                        "vi": "Tôi không biết bạn có khuôn mặt để phàn nàn như thế nào sau tất cả những gì họ đã làm cho bạn!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be made to look stupid",
                    "vi": "bị làm cho trông ngu ngốc"
                },
                "examples": [
                    {
                        "en": "They were left with egg on their faces when only ten people showed up.",
                        "vi": "Họ bị bỏ lại với quả trứng trên mặt khi chỉ có mười người xuất hiện."
                    }
                ]
            },
            {
                "define": {
                    "en": "annoying somebody by criticizing them or telling them what to do all the time",
                    "vi": "làm phiền ai đó bằng cách chỉ trích họ hoặc bảo họ phải làm gì mọi lúc"
                },
                "examples": [
                    {
                        "en": "Why are you always in my face?",
                        "vi": "Tại sao bạn luôn luôn đối mặt với tôi?"
                    }
                ]
            },
            {
                "define": {
                    "en": "despite problems, difficulties, etc.",
                    "vi": "bất chấp những vướng mắc, khó khăn, v.v."
                },
                "examples": [
                    {
                        "en": "She showed great courage in the face of danger.",
                        "vi": "Cô đã thể hiện sự dũng cảm khi đối mặt với nguy hiểm."
                    },
                    {
                        "en": "The campaign continued in the face of great opposition.",
                        "vi": "Chiến dịch tiếp tục vấp phải sự phản đối lớn."
                    }
                ]
            },
            {
                "define": {
                    "en": "as a result of something",
                    "vi": "kết quả của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "He was unable to deny the charges in the face of new evidence.",
                        "vi": "Anh không thể phủ nhận cáo buộc khi đối mặt với những bằng chứng mới."
                    }
                ]
            },
            {
                "define": {
                    "en": "to show in a very obvious way that you have no respect for somebody",
                    "vi": "thể hiện một cách rất rõ ràng rằng bạn không tôn trọng ai đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be forced to change from feeling pleased or satisfied to feeling disappointed or annoyed",
                    "vi": "buộc phải thay đổi từ cảm thấy hài lòng hoặc hài lòng sang cảm thấy thất vọng hoặc khó chịu"
                },
                "examples": [
                    {
                        "en": "He’ll be laughing on the other side of his face when he reads my letter.",
                        "vi": "Anh ấy sẽ cười trên khuôn mặt khác khi đọc bức thư của tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "(to have) an unhappy or disappointed expression",
                    "vi": "(có) một biểu hiện không vui hoặc thất vọng"
                },
                "examples": [
                    {
                        "en": "He took one look at her long face and said ‘What’s wrong?’",
                        "vi": "Anh nhìn vào khuôn mặt dài của cô và nói 'Có chuyện gì vậy?'"
                    },
                    {
                        "en": "The news for the company isn't good, judging from the long faces in the boardroom.",
                        "vi": "Tin tức cho công ty không tốt, xét từ những gương mặt dài trong phòng họp."
                    }
                ]
            },
            {
                "define": {
                    "en": "to look straight at somebody without feeling embarrassed or ashamed",
                    "vi": "nhìn thẳng vào ai đó mà không cảm thấy xấu hổ hay xấu hổ"
                },
                "examples": [
                    {
                        "en": "Can you look me in the eye and tell me you're not lying?",
                        "vi": "Bạn có thể nhìn vào mắt tôi và nói với tôi rằng bạn không nói dối?"
                    },
                    {
                        "en": "She looked her father straight in the eye and answered his question truthfully.",
                        "vi": "Cô nhìn thẳng vào mắt cha mình và trả lời thành thật câu hỏi của ông."
                    },
                    {
                        "en": "I'll never be able to look her in the face again!",
                        "vi": "Tôi sẽ không bao giờ có thể nhìn mặt cô ấy nữa!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be less respected or look stupid because of something you have done",
                    "vi": "ít được tôn trọng hoặc trông ngu ngốc vì điều gì đó bạn đã làm"
                },
                "examples": [
                    {
                        "en": "Many leaders don't want to lose face by admitting failures.",
                        "vi": "Nhiều nhà lãnh đạo không muốn bị mất mặt khi thừa nhận thất bại."
                    }
                ]
            },
            {
                "define": {
                    "en": "the state of being less respected by other people or looking stupid because of something you have done",
                    "vi": "trạng thái ít được người khác tôn trọng hoặc trông ngu ngốc vì điều gì đó bạn đã làm"
                },
                "examples": [
                    {
                        "en": "Failure to pass the exams means a massive loss of face for the students and their parents.",
                        "vi": "Không vượt qua được kỳ thi đồng nghĩa với việc học sinh và cha mẹ học sinh bị mất thể diện rất lớn."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to emphasize that you have particular skills or qualities",
                    "vi": "được sử dụng để nhấn mạnh rằng bạn có các kỹ năng hoặc phẩm chất cụ thể"
                },
                "examples": [
                    {
                        "en": "‘I didn't know you could play the piano.’ ‘I'm not just a pretty face, you know!’",
                        "vi": "Tôi không biết bạn có thể chơi piano.' 'Tôi không chỉ là một khuôn mặt xinh đẹp, bạn biết đấy!'"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that something seems to be good, true, etc. but that this opinion may need to be changed when you know more about it",
                    "vi": "được sử dụng để nói rằng điều gì đó có vẻ là tốt, đúng, v.v. nhưng ý kiến này có thể cần được thay đổi khi bạn biết thêm về nó"
                },
                "examples": [
                    {
                        "en": "On the face of it, it seems like a great deal.",
                        "vi": "Về mặt nó, nó có vẻ như là một việc lớn."
                    },
                    {
                        "en": "What may, on the face of it, seem obvious often turns out to be far more complicated.",
                        "vi": "Những gì có thể, trên mặt của nó, có vẻ rõ ràng thường trở nên phức tạp hơn nhiều."
                    }
                ]
            },
            {
                "define": {
                    "en": "very obvious",
                    "vi": "rất rõ ràng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to produce an expression on your face to show that you do not like somebody/something or in order to make somebody laugh",
                    "vi": "biểu hiện trên khuôn mặt của bạn để thể hiện rằng bạn không thích ai đó / điều gì đó hoặc để làm cho ai đó cười"
                },
                "examples": [
                    {
                        "en": "What are you pulling a face at now?",
                        "vi": "Bạn đang kéo một khuôn mặt vào lúc này?"
                    },
                    {
                        "en": "Do you think it’s funny to make faces behind my back?",
                        "vi": "Bạn có nghĩ thật buồn cười khi làm mặt sau lưng tôi không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to put on make-up",
                    "vi": "để trang điểm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to pretend that you feel confident and happy when you do not",
                    "vi": "giả vờ rằng bạn cảm thấy tự tin và hạnh phúc khi bạn không"
                },
                "examples": [
                    {
                        "en": "I had to put on a brave face and try to show him that I wasn’t worried.",
                        "vi": "Tôi phải tỏ ra dũng cảm và cố gắng cho anh ấy thấy rằng tôi không lo lắng."
                    },
                    {
                        "en": "She put a brave face on her illness.",
                        "vi": "Cô ấy dũng cảm đối mặt với bệnh tật của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to avoid or help somebody avoid being embarrassed",
                    "vi": "để tránh hoặc giúp ai đó khỏi xấu hổ"
                },
                "examples": [
                    {
                        "en": "She was fired, but she saved face by telling everyone she'd resigned.",
                        "vi": "Cô ấy đã bị sa thải, nhưng cô ấy đã cứu vãn thể diện bằng cách nói với mọi người rằng cô ấy sẽ từ chức."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be determined to oppose somebody/something",
                    "vi": "quyết tâm chống lại ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "Her father had set his face against the marriage.",
                        "vi": "Cha cô đã ra mặt phản đối cuộc hôn nhân."
                    }
                ]
            },
            {
                "define": {
                    "en": "to appear among your friends or in public",
                    "vi": "xuất hiện giữa bạn bè của bạn hoặc ở nơi công cộng"
                },
                "examples": [
                    {
                        "en": "She stayed at home, afraid to show her face.",
                        "vi": "Cô ở nhà sợ lộ mặt."
                    }
                ]
            },
            {
                "define": {
                    "en": "to shut a door hard when somebody is trying to come in",
                    "vi": "đóng chặt cửa khi ai đó đang cố gắng vào"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to refuse to talk to somebody or meet them, in a rude way",
                    "vi": "từ chối nói chuyện với ai đó hoặc gặp họ, một cách thô lỗ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a rude way of telling somebody to be quiet or stop talking",
                    "vi": "một cách thô lỗ để bảo ai đó im lặng hoặc ngừng nói"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "an action that seems to be intended as a deliberate way of offending and showing lack of respect for somebody",
                    "vi": "một hành động dường như là một cách cố ý xúc phạm và thể hiện sự thiếu tôn trọng đối với ai đó"
                },
                "examples": [
                    {
                        "en": "The closure of the school is a slap in the face to the local community.",
                        "vi": "Việc đóng cửa trường học là một cái tát vào mặt cộng đồng địa phương."
                    }
                ]
            },
            {
                "define": {
                    "en": "if you keep a straight face, you do not laugh or smile, although you find something funny",
                    "vi": "nếu bạn giữ một khuôn mặt thẳng thắn, bạn không cười hoặc không cười, mặc dù bạn thấy điều gì đó buồn cười"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "if you say something to somebody’s face, you say it to them directly rather than to other people",
                    "vi": "nếu bạn nói điều gì đó vào mặt ai đó, bạn nói điều đó trực tiếp với họ thay vì nói với người khác"
                },
                "examples": [
                    {
                        "en": "He’s a liar, and I’ve told him so to his face many times.",
                        "vi": "Anh ta là một kẻ nói dối, và tôi đã nói với anh ta như vậy trước mặt anh ta nhiều lần."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to refer to a person whose name you cannot remember",
                    "vi": "được sử dụng để chỉ một người mà bạn không thể nhớ tên"
                },
                "examples": [
                    {
                        "en": "Are you still working for what's her face?",
                        "vi": "Bạn vẫn đang làm việc cho khuôn mặt của cô ấy?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to destroy or remove somebody/something completely",
                    "vi": "để tiêu diệt hoặc loại bỏ ai đó / cái gì đó hoàn toàn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "6652842dd84748bab3413989f39be042",
        "word": "sour-faced",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsaʊə feɪst/",
            "us": "/ˈsaʊər feɪst/"
        },
        "nearby": [
            {
                "word": "sour cream",
                "pos": "noun"
            },
            {
                "word": "sourdough",
                "pos": "noun"
            },
            {
                "word": "sour-faced",
                "pos": "adjective"
            },
            {
                "word": "sourly",
                "pos": "adverb"
            },
            {
                "word": "sourness",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "having an unpleasant and unfriendly expression",
                    "vi": "có biểu hiện khó chịu và không thân thiện"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "1ad745c344324f80863ba36dc2433a70",
        "word": "squint",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/skwɪnt/",
            "us": "/skwɪnt/"
        },
        "nearby": [
            {
                "word": "squiggly",
                "pos": "adjective"
            },
            {
                "word": "squillion",
                "pos": "noun"
            },
            {
                "word": "squint",
                "pos": "verb"
            },
            {
                "word": "squint",
                "pos": "noun"
            },
            {
                "word": "squire",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to look at something with your eyes partly shut in order to keep out bright light or to see better",
                    "vi": "nhìn vật gì đó với đôi mắt nhắm lại để tránh ánh sáng chói hoặc để nhìn rõ hơn"
                },
                "examples": [
                    {
                        "en": "to squint into the sun",
                        "vi": "nheo mắt vào mặt trời"
                    },
                    {
                        "en": "She was squinting through the keyhole.",
                        "vi": "Cô ấy đang liếc qua lỗ khóa."
                    },
                    {
                        "en": "He squinted at the letter in his hand.",
                        "vi": "Anh nheo mắt nhìn lá thư trên tay."
                    },
                    {
                        "en": "The driver had to squint against the sun to see where he was going.",
                        "vi": "Người lái xe phải nheo mắt chống nắng để xem mình sẽ đi đâu."
                    },
                    {
                        "en": "squint something When he squinted his eyes, he could just make out a house in the distance.",
                        "vi": "nheo mắt cái gì đó Khi anh ta nheo mắt lại, anh ta có thể phát hiện ra một ngôi nhà ở đằng xa."
                    }
                ]
            },
            {
                "define": {
                    "en": "to look in a different direction from the other eye",
                    "vi": "nhìn theo hướng khác với con mắt khác"
                },
                "examples": [
                    {
                        "en": "His left eye squints a little.",
                        "vi": "Mắt trái anh ta hơi nheo lại."
                    },
                    {
                        "en": "A squinting eye can be corrected by surgery.",
                        "vi": "Mắt lé có thể được điều chỉnh bằng phẫu thuật."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have eyes that look in different directions",
                    "vi": "để có đôi mắt nhìn theo các hướng khác nhau"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "de0afc4a049143b09690e45d59e3d530",
        "word": "sullen",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsʌlən/",
            "us": "/ˈsʌlən/"
        },
        "nearby": [
            {
                "word": "sulkiness",
                "pos": "noun"
            },
            {
                "word": "sulky",
                "pos": "adjective"
            },
            {
                "word": "sullen",
                "pos": "adjective"
            },
            {
                "word": "sullenly",
                "pos": "adverb"
            },
            {
                "word": "sullenness",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "in a bad mood and not speaking, either on a particular occasion or because it is part of your character",
                    "vi": "trong tâm trạng tồi tệ và không nói, vào một dịp cụ thể hoặc bởi vì đó là một phần của tính cách của bạn"
                },
                "examples": [
                    {
                        "en": "Bob looked pale and sullen.",
                        "vi": "Bob trông xanh xao và ủ rũ."
                    },
                    {
                        "en": "She gave him a sullen glare.",
                        "vi": "Cô ấy nhìn anh một cái nhìn ủ rũ."
                    },
                    {
                        "en": "sullen teenagers",
                        "vi": "thanh thiếu niên ủ rũ"
                    },
                    {
                        "en": "He lapsed into a sullen silence.",
                        "vi": "Anh chìm vào im lặng ủ rũ."
                    }
                ]
            },
            {
                "define": {
                    "en": "dark and unpleasant",
                    "vi": "tối tăm và khó chịu"
                },
                "examples": [
                    {
                        "en": "a sullen grey sky",
                        "vi": "bầu trời xám xịt ủ rũ"
                    }
                ]
            }
        ]
    },
    {
        "id": "558a440fd7a2447bbbe5885d2f889ad5",
        "word": "wince",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/wɪns/",
            "us": "/wɪns/"
        },
        "nearby": [
            {
                "word": "win around",
                "pos": "phrasal verb"
            },
            {
                "word": "win back",
                "pos": "phrasal verb"
            },
            {
                "word": "wince",
                "pos": "noun"
            },
            {
                "word": "wince",
                "pos": "verb"
            },
            {
                "word": "winceyette",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an expression on your face that shows that you are embarrassed or feeling pain",
                    "vi": "một biểu hiện trên khuôn mặt của bạn cho thấy rằng bạn đang xấu hổ hoặc cảm thấy đau"
                },
                "examples": [
                    {
                        "en": "a wince of pain",
                        "vi": "một cơn đau"
                    }
                ]
            }
        ]
    },
    {
        "id": "aaada08cfc4643938c69de58c774269e",
        "word": "wince",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/wɪns/",
            "us": "/wɪns/"
        },
        "nearby": [
            {
                "word": "win back",
                "pos": "phrasal verb"
            },
            {
                "word": "wince",
                "pos": "noun"
            },
            {
                "word": "wince",
                "pos": "verb"
            },
            {
                "word": "winceyette",
                "pos": "noun"
            },
            {
                "word": "winch",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to suddenly make an expression with your face that shows that you are embarrassed or feeling pain",
                    "vi": "đột nhiên biểu hiện bằng khuôn mặt cho thấy bạn đang xấu hổ hoặc cảm thấy đau"
                },
                "examples": [
                    {
                        "en": "He winced as a sharp pain shot through his left leg.",
                        "vi": "Anh nhăn mặt khi một cơn đau buốt xuyên qua chân trái."
                    },
                    {
                        "en": "I still wince when I think about that stupid thing I said.",
                        "vi": "Tôi vẫn còn nhăn mặt khi nghĩ về điều ngu ngốc mà tôi đã nói."
                    },
                    {
                        "en": "He winced inwardly at her harsh tone.",
                        "vi": "Anh nhăn mặt trong lòng trước giọng điệu gay gắt của cô."
                    },
                    {
                        "en": "She switched on the light, wincing at the sudden brightness.",
                        "vi": "Cô bật đèn, nhăn mặt vì độ sáng đột ngột."
                    }
                ]
            }
        ]
    },
    {
        "id": "e369f5c288d34e6787732bcd3d3a8d11",
        "word": "wink",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/wɪŋk/",
            "us": "/wɪŋk/"
        },
        "nearby": [
            {
                "word": "wingtips",
                "pos": "noun"
            },
            {
                "word": "Winifred",
                "pos": ""
            },
            {
                "word": "wink",
                "pos": "verb"
            },
            {
                "word": "wink",
                "pos": "noun"
            },
            {
                "word": "wink at",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to close one eye and open it again quickly, especially as a private signal to somebody, or to show something is a joke",
                    "vi": "nhắm một mắt và mở lại nhanh chóng, đặc biệt là như một tín hiệu riêng tư cho ai đó hoặc cho thấy điều gì đó là một trò đùa"
                },
                "examples": [
                    {
                        "en": "He winked at her and she knew he was thinking the same thing that she was.",
                        "vi": "Anh nháy mắt với cô và cô biết anh cũng đang nghĩ như cô."
                    }
                ]
            },
            {
                "define": {
                    "en": "to shine with an unsteady light; to flash on and off",
                    "vi": "để chiếu sáng với một ánh sáng không ổn định; bật và tắt đèn flash"
                },
                "examples": [
                    {
                        "en": "We could see the lights of the ship winking in the distance.",
                        "vi": "Chúng tôi có thể nhìn thấy ánh sáng của con tàu đang nhấp nháy ở phía xa."
                    }
                ]
            }
        ]
    },
    {
        "id": "85d370a67fa64a128d40b3e40f3a268c",
        "word": "wink",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/wɪŋk/",
            "us": "/wɪŋk/"
        },
        "nearby": [
            {
                "word": "Winifred",
                "pos": ""
            },
            {
                "word": "wink",
                "pos": "verb"
            },
            {
                "word": "wink",
                "pos": "noun"
            },
            {
                "word": "wink at",
                "pos": "phrasal verb"
            },
            {
                "word": "winkle",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an act of winking, especially as a signal to somebody",
                    "vi": "một hành động nháy mắt, đặc biệt là như một tín hiệu cho ai đó"
                },
                "examples": [
                    {
                        "en": "He gave her a knowing wink.",
                        "vi": "Anh nháy mắt đầy hiểu biết cho cô."
                    },
                    {
                        "en": "He directed a conspiratorial wink at his son.",
                        "vi": "Ông ta hướng một cái nháy mắt đầy âm mưu vào con trai mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that a suggestion or a hint will be understood, without anything more being said",
                    "vi": "được sử dụng để nói rằng một gợi ý hoặc một gợi ý sẽ được hiểu, mà không cần nói gì thêm"
                },
                "examples": [
                    {
                        "en": "Everything could be done by a nod and a wink.",
                        "vi": "Mọi thứ có thể được thực hiện bằng một cái gật đầu và một cái nháy mắt."
                    }
                ]
            },
            {
                "define": {
                    "en": "to not be able to sleep",
                    "vi": "không thể ngủ được"
                },
                "examples": [
                    {
                        "en": "I didn't get a wink of sleep last night.",
                        "vi": "Đêm qua tôi không ngủ được."
                    },
                    {
                        "en": "I hardly slept a wink.",
                        "vi": "Tôi hầu như không ngủ một cái nháy mắt."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to suggest something to do with sex without actually saying it",
                    "vi": "được sử dụng để gợi ý điều gì đó liên quan đến tình dục mà không thực sự nói ra"
                },
                "examples": [
                    {
                        "en": "They've been spending a lot of time together, nudge nudge, wink wink.",
                        "vi": "Họ đã dành rất nhiều thời gian bên nhau, thúc đẩy, nháy mắt nháy mắt."
                    }
                ]
            },
            {
                "define": {
                    "en": "to give somebody secret information that they can use to gain an advantage for themselves",
                    "vi": "cung cấp cho ai đó thông tin bí mật mà họ có thể sử dụng để đạt được lợi thế cho mình"
                },
                "examples": [
                    {
                        "en": "There’s no way he would have bought those shares if someone in the company hadn’t tipped him the wink.",
                        "vi": "Sẽ không có chuyện anh ta mua số cổ phiếu đó nếu ai đó trong công ty không nháy mắt cho anh ta."
                    }
                ]
            }
        ]
    }
]