[
    {
        "id": "26e66f151e2c4aeb927bfa9b915f7cd3",
        "word": "fruit",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/fruːt/",
            "us": "/fruːt/"
        },
        "nearby": [
            {
                "word": "frugality",
                "pos": "noun"
            },
            {
                "word": "frugally",
                "pos": "adverb"
            },
            {
                "word": "fruit",
                "pos": "noun"
            },
            {
                "word": "fruit",
                "pos": "verb"
            },
            {
                "word": "Fruit and Nut",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the part of a plant that consists of one or more seeds and a soft inner part, can be eaten as food and usually tastes sweet",
                    "vi": "bộ phận của cây gồm một hoặc nhiều hạt và phần bên trong mềm, có thể dùng làm thực phẩm và thường có vị ngọt."
                },
                "examples": [
                    {
                        "en": "tropical fruits, such as bananas and pineapples",
                        "vi": "trái cây nhiệt đới, chẳng hạn như chuối và dứa"
                    },
                    {
                        "en": "citrus fruits, such as oranges and lemons",
                        "vi": "trái cây họ cam quýt, chẳng hạn như cam và chanh"
                    },
                    {
                        "en": "Eat plenty of fresh fruit and vegetables.",
                        "vi": "Ăn nhiều trái cây tươi và rau quả."
                    },
                    {
                        "en": "Eat five daily portions of fruit and vegetables.",
                        "vi": "Ăn năm phần trái cây và rau quả hàng ngày."
                    },
                    {
                        "en": "a piece of fruit (= an apple, an orange, etc.)",
                        "vi": "một miếng trái cây (= một quả táo, một quả cam, v.v.)"
                    },
                    {
                        "en": "The colour indicates when the fruit is ripe.",
                        "vi": "Màu sắc biểu thị khi quả chín."
                    },
                    {
                        "en": "Whole fruits contain more fibre than fruit juice.",
                        "vi": "Trái cây nguyên chất chứa nhiều chất xơ hơn nước trái cây."
                    },
                    {
                        "en": "The orchard has over 300 fruit trees.",
                        "vi": "Vườn cây ăn trái có hơn 300 cây ăn quả."
                    }
                ]
            },
            {
                "define": {
                    "en": "a part of a plant or tree that is formed after the flowers have died and in which seeds develop",
                    "vi": "một phần của cây hoặc cây được hình thành sau khi hoa tàn và trong đó hạt phát triển"
                },
                "examples": [
                    {
                        "en": "The crab apple bears a small, bitter fruit.",
                        "vi": "Táo cua mang một quả nhỏ, có vị đắng."
                    }
                ]
            },
            {
                "define": {
                    "en": "all the natural things that the earth produces",
                    "vi": "tất cả những thứ tự nhiên mà trái đất tạo ra"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "an offensive word for a gay man",
                    "vi": "một từ xúc phạm cho một người đồng tính nam"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to have a successful result",
                    "vi": "để có một kết quả thành công"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a thing that is not allowed and that therefore seems very attractive",
                    "vi": "một điều không được phép và do đó có vẻ rất hấp dẫn"
                },
                "examples": [
                    {
                        "en": "Well, you know what they say— forbidden fruit tastes sweetest.",
                        "vi": "Chà, bạn biết họ nói gì không - trái cấm có vị ngọt nhất."
                    }
                ]
            },
            {
                "define": {
                    "en": "the good results of an activity or a situation",
                    "vi": "kết quả tốt của một hoạt động hoặc một tình huống"
                },
                "examples": [
                    {
                        "en": "to enjoy the fruits of your labours (= the rewards for your hard work)",
                        "vi": "để tận hưởng thành quả lao động của bạn (= phần thưởng cho sự chăm chỉ của bạn)"
                    },
                    {
                        "en": "The book is the fruit of years of research.",
                        "vi": "Cuốn sách là thành quả của nhiều năm nghiên cứu."
                    }
                ]
            }
        ]
    },
    {
        "id": "48cd4f2deec8401a825e1750c26a6c81",
        "word": "grow",
        "pos": "verb",
        "level": "a1",
        "phonetic": {
            "uk": "/ɡrəʊ/",
            "us": "/ɡrəʊ/"
        },
        "nearby": [
            {
                "word": "grovel",
                "pos": "verb"
            },
            {
                "word": "grovelling",
                "pos": "adjective"
            },
            {
                "word": "grow",
                "pos": "verb"
            },
            {
                "word": "grow apart",
                "pos": "phrasal verb"
            },
            {
                "word": "grow away from",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to increase in size, number, strength or quality",
                    "vi": "để tăng kích thước, số lượng, sức mạnh hoặc chất lượng"
                },
                "examples": [
                    {
                        "en": "The sector is growing at a phenomenal rate.",
                        "vi": "Lĩnh vực này đang phát triển với tốc độ phi thường."
                    },
                    {
                        "en": "The performance improved as their confidence grew.",
                        "vi": "Hiệu suất được cải thiện khi sự tự tin của họ tăng lên."
                    },
                    {
                        "en": "Opposition to the latest proposals is growing steadily.",
                        "vi": "Sự phản đối các đề xuất mới nhất đang tăng lên một cách đều đặn."
                    },
                    {
                        "en": "The market is growing rapidly.",
                        "vi": "Thị trường đang phát triển nhanh chóng."
                    },
                    {
                        "en": "Sales are growing fast.",
                        "vi": "Doanh số bán hàng đang tăng nhanh."
                    },
                    {
                        "en": "The business has grown exponentially over the past ten years.",
                        "vi": "Việc kinh doanh đã phát triển theo cấp số nhân trong mười năm qua."
                    },
                    {
                        "en": "Fears are growing for the safety of a teenager who disappeared a week ago.",
                        "vi": "Nỗi sợ hãi ngày càng lớn đối với sự an toàn của một thiếu niên đã mất tích một tuần trước."
                    },
                    {
                        "en": "grow by something The economy is growing by roughly 2 per cent a year.",
                        "vi": "tăng trưởng bởi cái gì đó Nền kinh tế đang tăng trưởng khoảng 2% một năm."
                    },
                    {
                        "en": "The company profits grew by 5 per cent last year.",
                        "vi": "Lợi nhuận của công ty đã tăng 5% trong năm ngoái."
                    },
                    {
                        "en": "grow in something The family has grown in size recently.",
                        "vi": "phát triển trong một cái gì đó Gia đình đã phát triển về quy mô gần đây."
                    },
                    {
                        "en": "This approach is growing in popularity.",
                        "vi": "Cách tiếp cận này đang ngày càng phổ biến."
                    },
                    {
                        "en": "She is growing in confidence all the time.",
                        "vi": "Cô ấy ngày càng tự tin hơn mọi lúc."
                    },
                    {
                        "en": "grow from something Her media empire grew from quite small beginnings.",
                        "vi": "phát triển từ một cái gì đó Đế chế truyền thông của cô ấy phát triển từ những ngày đầu còn khá nhỏ."
                    },
                    {
                        "en": "grow to something That number will grow to two billion users in 2025.",
                        "vi": "phát triển thành một thứ gì đó Con số đó sẽ tăng lên hai tỷ người dùng vào năm 2025."
                    },
                    {
                        "en": "grow from something to something The city's population has grown from about 50 000 to over a million in 20 years.",
                        "vi": "phát triển từ thứ gì đó thành thứ gì đó Dân số của thành phố đã tăng từ khoảng 50.000 người lên hơn một triệu người trong 20 năm."
                    },
                    {
                        "en": "+ adj. to grow larger/stronger",
                        "vi": "Err:509"
                    },
                    {
                        "en": "The company is growing bigger all the time.",
                        "vi": "Công ty đang phát triển lớn mạnh hơn mọi lúc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to become bigger or taller and develop into an adult",
                    "vi": "trở nên lớn hơn hoặc cao hơn và phát triển thành người lớn"
                },
                "examples": [
                    {
                        "en": "You've grown since the last time I saw you!",
                        "vi": "Bạn đã trưởng thành kể từ lần cuối cùng tôi nhìn thấy bạn!"
                    },
                    {
                        "en": "The puppies grow quickly during the first six months.",
                        "vi": "Những chú chó con phát triển nhanh chóng trong sáu tháng đầu tiên."
                    },
                    {
                        "en": "+ noun Nick's grown almost an inch in the last month.",
                        "vi": "danh từ Nick đã tăng gần một inch trong tháng trước."
                    },
                    {
                        "en": "+ adj. to grow bigger/taller/older",
                        "vi": "Err:509"
                    }
                ]
            },
            {
                "define": {
                    "en": "to exist and develop in a particular place; to make plants grow",
                    "vi": "để tồn tại và phát triển ở một nơi cụ thể; để làm cho cây cối phát triển"
                },
                "examples": [
                    {
                        "en": "The region is too dry for plants to grow.",
                        "vi": "Khu vực này quá khô để thực vật phát triển."
                    },
                    {
                        "en": "Tomatoes grow best in direct sunlight.",
                        "vi": "Cà chua phát triển tốt nhất dưới ánh nắng trực tiếp."
                    },
                    {
                        "en": "grow to something These roses grow to a height of 6 feet.",
                        "vi": "phát triển đến một cái gì đó Những bông hồng này phát triển đến chiều cao 6 feet."
                    },
                    {
                        "en": "grow from something This is a tree that grows well from cuttings.",
                        "vi": "mọc từ cái gì Đây là cây phát triển tốt từ giâm cành."
                    },
                    {
                        "en": "grow something The land is used to grow crops.",
                        "vi": "trồng cái gì đó Đất được sử dụng để trồng trọt."
                    },
                    {
                        "en": "We need to grow our food more efficiently.",
                        "vi": "Chúng ta cần trồng thực phẩm hiệu quả hơn."
                    },
                    {
                        "en": "I didn't know they grew rice in France.",
                        "vi": "Tôi không biết họ trồng lúa ở Pháp."
                    },
                    {
                        "en": "The plants were grown in controlled conditions.",
                        "vi": "Các cây được trồng trong điều kiện có kiểm soát."
                    },
                    {
                        "en": "grow something from something I grew all these flowers from one packet of seeds.",
                        "vi": "trồng một cái gì đó từ một cái gì đó Tôi đã trồng tất cả những bông hoa này từ một gói hạt giống."
                    }
                ]
            },
            {
                "define": {
                    "en": "to become longer; to allow something to become longer by not cutting it",
                    "vi": "trở nên dài hơn; để cho phép một cái gì đó trở nên dài hơn bằng cách không cắt nó"
                },
                "examples": [
                    {
                        "en": "I've decided to let my hair grow.",
                        "vi": "Tôi đã quyết định để tóc của mình phát triển."
                    },
                    {
                        "en": "grow something I've decided to grow my hair.",
                        "vi": "phát triển một cái gì đó Tôi đã quyết định để phát triển tóc của tôi."
                    },
                    {
                        "en": "I didn't recognize him—he's grown a beard.",
                        "vi": "Tôi không nhận ra anh ta - anh ta mọc râu."
                    }
                ]
            },
            {
                "define": {
                    "en": "to begin to have a particular quality or feeling over a period of time",
                    "vi": "bắt đầu có chất lượng hoặc cảm giác cụ thể trong một khoảng thời gian"
                },
                "examples": [
                    {
                        "en": "He had grown old and fat.",
                        "vi": "Anh ấy đã già đi và béo lên."
                    },
                    {
                        "en": "They were growing tired of her unreasonable behaviour.",
                        "vi": "Họ ngày càng mệt mỏi vì hành vi vô lý của cô ấy."
                    },
                    {
                        "en": "My eyes soon grew accustomed to the darkness.",
                        "vi": "Đôi mắt của tôi đã sớm quen với bóng tối."
                    },
                    {
                        "en": "Mark and Jenny were growing closer every day.",
                        "vi": "Mark và Jenny ngày càng thân thiết hơn."
                    },
                    {
                        "en": "As time went on he grew more and more impatient.",
                        "vi": "Thời gian trôi qua anh ấy càng ngày càng mất kiên nhẫn."
                    },
                    {
                        "en": "The skies grew dark and it began to rain.",
                        "vi": "Bầu trời tối dần và trời bắt đầu mưa."
                    },
                    {
                        "en": "She grew braver with time.",
                        "vi": "Cô ấy trở nên dũng cảm hơn theo thời gian."
                    }
                ]
            },
            {
                "define": {
                    "en": "to gradually begin to do something",
                    "vi": "dần dần bắt đầu làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "I'm sure you'll grow to like her in time.",
                        "vi": "Tôi chắc rằng bạn sẽ thích cô ấy theo thời gian."
                    },
                    {
                        "en": "He grew to understand her reasons for leaving.",
                        "vi": "Anh càng ngày càng hiểu lý do ra đi của cô."
                    }
                ]
            },
            {
                "define": {
                    "en": "to develop and improve particular qualities or skills",
                    "vi": "để phát triển và cải thiện các phẩm chất hoặc kỹ năng cụ thể"
                },
                "examples": [
                    {
                        "en": "She continues to grow as an artist.",
                        "vi": "Cô ấy tiếp tục phát triển như một nghệ sĩ."
                    },
                    {
                        "en": "A secure background will help a child to grow emotionally.",
                        "vi": "Một nền tảng vững chắc sẽ giúp một đứa trẻ phát triển về mặt tình cảm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to increase the size, quality or number of something",
                    "vi": "để tăng kích thước, chất lượng hoặc số lượng thứ gì đó"
                },
                "examples": [
                    {
                        "en": "We are trying to grow the business.",
                        "vi": "Chúng tôi đang cố gắng phát triển doanh nghiệp."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that when you are away from somebody that you love, you love them even more",
                    "vi": "từng nói rằng khi bạn xa người mà bạn yêu thương, bạn thậm chí còn yêu họ nhiều hơn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "something large and successful often begins in a very small way",
                    "vi": "một cái gì đó lớn và thành công thường bắt đầu từ một cách rất nhỏ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to tell somebody not to use something or spend money carelessly because you do not have a lot of it",
                    "vi": "được sử dụng để nói với ai đó không sử dụng một cái gì đó hoặc tiêu tiền một cách bất cẩn bởi vì bạn không có nhiều tiền"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to not delay in getting things done",
                    "vi": "để không bị trì hoãn trong việc hoàn thành công việc"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "297d12a148ad4674a0349bba7c6d3245",
        "word": "rice",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/raɪs/",
            "us": "/raɪs/"
        },
        "nearby": [
            {
                "word": "rib-tickler",
                "pos": "noun"
            },
            {
                "word": "rib-tickling",
                "pos": "adjective"
            },
            {
                "word": "rice",
                "pos": "noun"
            },
            {
                "word": "Rice Krispies",
                "pos": "noun"
            },
            {
                "word": "rice paper",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "short, narrow white or brown grain grown on wet land in hot countries as food; the plant that produces this grain",
                    "vi": "hạt ngắn, hẹp màu trắng hoặc nâu, trồng trên đất ẩm ướt ở xứ nóng làm thực phẩm; cây tạo ra hạt này"
                },
                "examples": [
                    {
                        "en": "a grain of rice",
                        "vi": "Một hạt gạo"
                    },
                    {
                        "en": "boiled/steamed/fried rice",
                        "vi": "cơm luộc / hấp / chiên"
                    },
                    {
                        "en": "long-/short-grain rice",
                        "vi": "gạo hạt dài / ngắn"
                    },
                    {
                        "en": "sticky/basmati/wild rice",
                        "vi": "nếp / basmati / lúa hoang"
                    },
                    {
                        "en": "brown rice (= without its outer layer removed)",
                        "vi": "gạo lứt (= không bỏ lớp ngoài)"
                    },
                    {
                        "en": "rice paddies (= rice fields)",
                        "vi": "lúa (= ruộng lúa)"
                    },
                    {
                        "en": "a spicy rice dish",
                        "vi": "một món cơm cay"
                    },
                    {
                        "en": "rice flour/noodles/cakes",
                        "vi": "bột gạo / mì / bánh ngọt"
                    },
                    {
                        "en": "There is no need to keep the rice field flooded.",
                        "vi": "Không cần thiết phải giữ cho ruộng lúa bị ngập nước."
                    },
                    {
                        "en": "The dish is served with rice.",
                        "vi": "Món ăn được dùng với cơm."
                    }
                ]
            }
        ]
    },
    {
        "id": "413f418f746946399cf2c5980e4ace6a",
        "word": "vegetable",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/ˈvedʒtəbl/",
            "us": "/ˈvedʒtəbl/"
        },
        "nearby": [
            {
                "word": "Vegeburger",
                "pos": "noun"
            },
            {
                "word": "Vegemite",
                "pos": "noun"
            },
            {
                "word": "vegetable",
                "pos": "noun"
            },
            {
                "word": "vegetable oil",
                "pos": "noun"
            },
            {
                "word": "vegetal",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a plant or part of a plant that is eaten as food. Potatoes, beans and onions are all vegetables.",
                    "vi": "thực vật hoặc một phần của thực vật được dùng làm thực phẩm. Khoai tây, đậu và hành tây là tất cả các loại rau."
                },
                "examples": [
                    {
                        "en": "The children don't eat enough fresh vegetables.",
                        "vi": "Những đứa trẻ không ăn đủ rau tươi."
                    },
                    {
                        "en": "root vegetables (= for example carrots)",
                        "vi": "rau củ (= ví dụ cà rốt)"
                    },
                    {
                        "en": "a vegetable garden",
                        "vi": "một vườn rau"
                    },
                    {
                        "en": "We grow our own vegetables.",
                        "vi": "Chúng tôi tự trồng rau."
                    },
                    {
                        "en": "a salad of raw vegetables",
                        "vi": "salad rau sống"
                    },
                    {
                        "en": "organic vegetables",
                        "vi": "rau hữu cơ"
                    },
                    {
                        "en": "a vegetable patch/plot",
                        "vi": "một mảnh đất / mảnh rau"
                    },
                    {
                        "en": "vegetable soup",
                        "vi": "súp rau"
                    },
                    {
                        "en": "vegetable matter (= plants in general)",
                        "vi": "thực vật (= thực vật nói chung)"
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who is physically alive but not capable of much mental or physical activity, for example because of an accident or illness",
                    "vi": "một người còn sống về thể chất nhưng không có khả năng hoạt động trí óc hoặc thể chất nhiều, ví dụ như vì tai nạn hoặc bệnh tật"
                },
                "examples": [
                    {
                        "en": "Severe brain damage turned him into a vegetable.",
                        "vi": "Tổn thương não nghiêm trọng đã biến anh thành một người rau."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who has a boring life",
                    "vi": "một người có một cuộc sống nhàm chán"
                },
                "examples": [
                    {
                        "en": "Since losing my job I've been a vegetable.",
                        "vi": "Kể từ khi mất việc, tôi đã làm một người bán rau."
                    }
                ]
            }
        ]
    },
    {
        "id": "e6097dfab2d642ce836c69eec16bfceb",
        "word": "plant",
        "pos": "verb",
        "level": "a2",
        "phonetic": {
            "uk": "/plɑːnt/",
            "us": "/plænt/"
        },
        "nearby": [
            {
                "word": "plan out",
                "pos": "phrasal verb"
            },
            {
                "word": "plant",
                "pos": "noun"
            },
            {
                "word": "plant",
                "pos": "verb"
            },
            {
                "word": "Plantagenet",
                "pos": ""
            },
            {
                "word": "plantain",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to put plants, seeds, etc. in the ground to grow",
                    "vi": "để cây, hạt giống, v.v. xuống đất để phát triển"
                },
                "examples": [
                    {
                        "en": "to plant a tree/seed/crop",
                        "vi": "trồng cây / hạt giống / cây trồng"
                    },
                    {
                        "en": "to plant and harvest rice",
                        "vi": "trồng và thu hoạch lúa"
                    },
                    {
                        "en": "Plant the bulbs in pots for a spring display.",
                        "vi": "Trồng củ vào chậu để trưng bày vào mùa xuân."
                    }
                ]
            },
            {
                "define": {
                    "en": "to cover or supply a garden, area of land, etc. with plants",
                    "vi": "để che phủ hoặc cung cấp cho một khu vườn, diện tích đất, v.v. bằng các loại thực vật"
                },
                "examples": [
                    {
                        "en": "plant something The children are planting a garden next to the school.",
                        "vi": "trồng cây gì Các em nhỏ đang trồng một khu vườn bên cạnh trường học."
                    },
                    {
                        "en": "They have planted five acres of vines.",
                        "vi": "Họ đã trồng 5 mẫu cây nho."
                    },
                    {
                        "en": "a densely planted orange grove",
                        "vi": "một vườn cam trồng dày đặc"
                    },
                    {
                        "en": "be planted with something The field had been ploughed and planted with corn.",
                        "vi": "được trồng với một cái gì đó Cánh đồng đã được cày và được trồng bằng ngô."
                    }
                ]
            },
            {
                "define": {
                    "en": "to place something or yourself in a particular place or position",
                    "vi": "để đặt một cái gì đó hoặc chính bạn ở một vị trí hoặc vị trí cụ thể"
                },
                "examples": [
                    {
                        "en": "They planted a flag on the summit.",
                        "vi": "Họ đã cắm một lá cờ trên đỉnh núi."
                    },
                    {
                        "en": "He planted himself squarely in front of us.",
                        "vi": "Anh ấy đã gieo mình ngay trước mặt chúng tôi."
                    },
                    {
                        "en": "She was determined to keep both feet firmly planted on dry land.",
                        "vi": "Cô quyết tâm giữ vững cả hai chân trồng trên mảnh đất khô cằn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to hide something such as a bomb in a place where it will not be found",
                    "vi": "giấu thứ gì đó chẳng hạn như một quả bom ở một nơi mà nó sẽ không được tìm thấy"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to hide something, especially something illegal, in somebody’s clothing, possessions, etc. so that when it is found it will look as though they committed a crime",
                    "vi": "giấu thứ gì đó, đặc biệt là thứ gì đó bất hợp pháp, trong quần áo, tài sản của ai đó, v.v. để khi bị phát hiện sẽ trông như thể họ đã phạm tội"
                },
                "examples": [
                    {
                        "en": "He claims that the drugs were planted on him.",
                        "vi": "Anh ta tuyên bố rằng ma túy đã được gieo vào người anh ta."
                    }
                ]
            },
            {
                "define": {
                    "en": "to send somebody to join a group, etc., especially in order to make secret reports on its members",
                    "vi": "để cử ai đó tham gia nhóm, v.v., đặc biệt là để báo cáo bí mật về các thành viên của nhóm đó"
                },
                "examples": [
                    {
                        "en": "The police had planted an informer in the gang.",
                        "vi": "Cảnh sát đã đưa một người cung cấp thông tin trong băng nhóm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody think or believe something, especially without them realizing that you gave them the idea",
                    "vi": "để khiến ai đó nghĩ hoặc tin vào điều gì đó, đặc biệt là họ không nhận ra rằng bạn đã cho họ ý tưởng"
                },
                "examples": [
                    {
                        "en": "He planted the first seeds of doubt in my mind.",
                        "vi": "Anh ấy đã gieo những hạt giống nghi ngờ đầu tiên vào tâm trí tôi."
                    }
                ]
            }
        ]
    },
    {
        "id": "59ef6ea578904f528f2cfd09fd3f0a6e",
        "word": "produce",
        "pos": "verb",
        "level": "a2",
        "phonetic": {
            "uk": "/prəˈdjuːs/",
            "us": "/prəˈduːs/"
        },
        "nearby": [
            {
                "word": "prodigy",
                "pos": "noun"
            },
            {
                "word": "The Prodigy",
                "pos": ""
            },
            {
                "word": "produce",
                "pos": "verb"
            },
            {
                "word": "produce",
                "pos": "noun"
            },
            {
                "word": "producer",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to make things to be sold, especially in large quantities",
                    "vi": "để làm cho những thứ được bán, đặc biệt là với số lượng lớn"
                },
                "examples": [
                    {
                        "en": "Our company mainly produces goods for export.",
                        "vi": "Công ty chúng tôi chủ yếu sản xuất hàng hóa để xuất khẩu."
                    },
                    {
                        "en": "We pride ourselves on producing high-quality products.",
                        "vi": "Chúng tôi tự hào về việc sản xuất các sản phẩm chất lượng cao."
                    },
                    {
                        "en": "The local factory produces electronic components.",
                        "vi": "Nhà máy địa phương sản xuất các linh kiện điện tử."
                    }
                ]
            },
            {
                "define": {
                    "en": "to grow or make something as part of a natural process; to have a baby or young animal",
                    "vi": "để phát triển hoặc tạo ra thứ gì đó như một phần của quá trình tự nhiên; sinh con hoặc động vật non"
                },
                "examples": [
                    {
                        "en": "The region produces over 50 per cent of the country's wheat.",
                        "vi": "Khu vực này sản xuất hơn 50% lúa mì của cả nước."
                    },
                    {
                        "en": "I would like to find out more about how our food is produced.",
                        "vi": "Tôi muốn tìm hiểu thêm về cách thức sản xuất thực phẩm của chúng tôi."
                    },
                    {
                        "en": "All our meat is locally produced.",
                        "vi": "Tất cả thịt của chúng tôi đều được sản xuất tại địa phương."
                    },
                    {
                        "en": "These shrubs produce bright red berries.",
                        "vi": "Những cây bụi này tạo ra những quả mọng màu đỏ tươi."
                    },
                    {
                        "en": "Under stress, the body produces adrenalin.",
                        "vi": "Khi bị căng thẳng, cơ thể sản xuất adrenalin."
                    },
                    {
                        "en": "Our cat produced kittens last week.",
                        "vi": "Con mèo của chúng tôi đã sản xuất mèo con vào tuần trước."
                    },
                    {
                        "en": "Her duty was to produce an heir to the throne.",
                        "vi": "Nhiệm vụ của cô là tạo ra một người thừa kế ngai vàng."
                    },
                    {
                        "en": "produce something from something The wine is produced from Chardonnay grapes.",
                        "vi": "sản xuất một cái gì đó từ một cái gì đó Rượu được sản xuất từ nho Chardonnay."
                    }
                ]
            },
            {
                "define": {
                    "en": "to create something, especially when skill is needed",
                    "vi": "để tạo ra thứ gì đó, đặc biệt là khi cần có kỹ năng"
                },
                "examples": [
                    {
                        "en": "She produced a delicious meal out of a few leftovers.",
                        "vi": "Cô ấy đã tạo ra một bữa ăn ngon lành từ một ít thức ăn thừa."
                    },
                    {
                        "en": "By 1912 he was producing purely abstract works.",
                        "vi": "Đến năm 1912, ông đã sản xuất các tác phẩm hoàn toàn trừu tượng."
                    },
                    {
                        "en": "United produced their best performance of the season.",
                        "vi": "United đã tạo ra màn trình diễn tốt nhất của họ trong mùa giải."
                    },
                    {
                        "en": "He produces reports on economic and social trends for manufacturers and trade associations.",
                        "vi": "Ông đưa ra các báo cáo về xu hướng kinh tế và xã hội cho các nhà sản xuất và hiệp hội thương mại."
                    }
                ]
            },
            {
                "define": {
                    "en": "to cause a particular result or effect",
                    "vi": "để gây ra một kết quả hoặc hiệu ứng cụ thể"
                },
                "examples": [
                    {
                        "en": "A phone call to the manager produced the result she wanted.",
                        "vi": "Một cuộc điện thoại cho người quản lý đã tạo ra kết quả mà cô ấy mong muốn."
                    },
                    {
                        "en": "His words failed to produce the desired effect.",
                        "vi": "Lời nói của anh ta không tạo được hiệu quả như mong muốn."
                    },
                    {
                        "en": "These reforms will produce little change.",
                        "vi": "Những cải cách này sẽ tạo ra ít thay đổi."
                    },
                    {
                        "en": "The drug produces a feeling of excitement.",
                        "vi": "Thuốc tạo cảm giác hưng phấn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to show something or make something appear from somewhere",
                    "vi": "để hiển thị một cái gì đó hoặc làm cho một cái gì đó xuất hiện từ một nơi nào đó"
                },
                "examples": [
                    {
                        "en": "produce something from/out of something He produced a letter from his pocket.",
                        "vi": "sản xuất một cái gì đó từ / ra một cái gì đó Anh ấy đã sản xuất một bức thư từ trong túi của mình."
                    },
                    {
                        "en": "produce something She failed to produce any evidence to support these claims.",
                        "vi": "sản xuất một cái gì đó Cô ấy không đưa ra được bất kỳ bằng chứng nào để hỗ trợ những tuyên bố này."
                    },
                    {
                        "en": "At the meeting the finance director produced the figures for the previous year.",
                        "vi": "Tại cuộc họp, giám đốc tài chính đưa ra các số liệu của năm trước."
                    }
                ]
            },
            {
                "define": {
                    "en": "if a town, country, etc. produces somebody with a particular skill or quality, the person comes from that town, country, etc.",
                    "vi": "nếu một thị trấn, quốc gia, v.v. tạo ra một người nào đó có kỹ năng hoặc phẩm chất cụ thể, thì người đó đến từ thị trấn, quốc gia đó, v.v."
                },
                "examples": [
                    {
                        "en": "He is the greatest athlete this country has ever produced.",
                        "vi": "Anh ấy là vận động viên vĩ đại nhất mà đất nước này từng sản sinh ra."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be in charge of preparing a film, play, etc. for the public to see",
                    "vi": "chịu trách nhiệm chuẩn bị một bộ phim, vở kịch, v.v. cho công chúng xem"
                },
                "examples": [
                    {
                        "en": "She produced a TV series about adopted children.",
                        "vi": "Cô đã sản xuất một bộ phim truyền hình về những người con nuôi."
                    }
                ]
            }
        ]
    },
    {
        "id": "c612305e8a884da2be6b62d8c568a8ce",
        "word": "bean",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/biːn/",
            "us": "/biːn/"
        },
        "nearby": [
            {
                "word": "beamed",
                "pos": "adjective"
            },
            {
                "word": "beam up",
                "pos": "phrasal verb"
            },
            {
                "word": "bean",
                "pos": "noun"
            },
            {
                "word": "Judge Roy Bean",
                "pos": ""
            },
            {
                "word": "bean",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a seed, or pod containing seeds, of a climbing plant, eaten as a vegetable. There are several types of bean and the plants that they grow on are also called beans.",
                    "vi": "hạt, hoặc vỏ có chứa hạt, của một loại cây leo, được ăn như một loại rau. Có một số loại đậu và những cây mà chúng mọc trên đó còn được gọi là đậu."
                },
                "examples": [
                    {
                        "en": "green beans",
                        "vi": "đậu xanh"
                    },
                    {
                        "en": "runner beans",
                        "vi": "quả đậu tây"
                    },
                    {
                        "en": "beans (= baked beans) on toast",
                        "vi": "đậu (= đậu nướng) trên bánh mì nướng"
                    },
                    {
                        "en": "a can/tin of beans",
                        "vi": "một lon / hộp đậu"
                    },
                    {
                        "en": "She grows her own broad beans.",
                        "vi": "Cô ấy trồng đậu rộng của riêng mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "a seed from a coffee plant, or some other plants",
                    "vi": "một hạt từ cây cà phê, hoặc một số cây khác"
                },
                "examples": [
                    {
                        "en": "cocoa/coffee beans",
                        "vi": "hạt ca cao / cà phê"
                    }
                ]
            },
            {
                "define": {
                    "en": "having a lot of energy",
                    "vi": "có rất nhiều năng lượng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "something that is not worth much",
                    "vi": "một cái gì đó không có giá trị nhiều"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to have no money",
                    "vi": "không có tiền"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to know nothing about a subject",
                    "vi": "không biết gì về một chủ đề"
                },
                "examples": [
                    {
                        "en": "I don’t know beans about making movies.",
                        "vi": "Tôi không biết đậu về việc làm phim."
                    }
                ]
            },
            {
                "define": {
                    "en": "to tell somebody something that should be kept secret or private",
                    "vi": "nói với ai đó điều gì đó cần được giữ bí mật hoặc riêng tư"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "ce982a7f10d941b49f94ae6dc3a974bd",
        "word": "corn",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/kɔːn/",
            "us": "/kɔːrn/"
        },
        "nearby": [
            {
                "word": "corm",
                "pos": "noun"
            },
            {
                "word": "cormorant",
                "pos": "noun"
            },
            {
                "word": "corn",
                "pos": "noun"
            },
            {
                "word": "corn beef",
                "pos": "noun"
            },
            {
                "word": "the Corn Belt",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "any plant that is grown for its grain, such as wheat; the grain of these plants",
                    "vi": "bất kỳ loại cây nào được trồng để lấy hạt, chẳng hạn như lúa mì; hạt của những cây này"
                },
                "examples": [
                    {
                        "en": "a field of corn",
                        "vi": "một cánh đồng ngô"
                    },
                    {
                        "en": "ears/sheaves of corn",
                        "vi": "tai / bẹ ngô"
                    },
                    {
                        "en": "corn-fed chicken",
                        "vi": "gà ăn ngô"
                    },
                    {
                        "en": "The corn is still green.",
                        "vi": "Bắp còn xanh."
                    },
                    {
                        "en": "a field of standing corn",
                        "vi": "một cánh đồng ngô đứng"
                    }
                ]
            },
            {
                "define": {
                    "en": "a tall plant grown for its large yellow grains that are used for making flour or eaten as a vegetable; the grains of this plant",
                    "vi": "một loại cây cao được trồng để lấy hạt lớn màu vàng được dùng để làm bột hoặc ăn như một loại rau; hạt của cây này"
                },
                "examples": [
                    {
                        "en": "The major crops are wheat, barley and corn.",
                        "vi": "Các loại cây trồng chính là lúa mì, lúa mạch và ngô."
                    }
                ]
            },
            {
                "define": {
                    "en": "the yellow seeds of a type of corn (maize) plant, also called corn, which grow on thick stems and are cooked and eaten as a vegetable",
                    "vi": "hạt màu vàng của một loại cây ngô (ngô), còn được gọi là ngô, mọc trên thân dày và được nấu chín và ăn như một loại rau"
                },
                "examples": [
                    {
                        "en": "fresh corn and arugula salad",
                        "vi": "ngô tươi và salad rau arugula"
                    }
                ]
            },
            {
                "define": {
                    "en": "a small area of hard skin on the foot, especially the toe, that is sometimes painful",
                    "vi": "một vùng da cứng nhỏ trên bàn chân, đặc biệt là ngón chân, đôi khi bị đau"
                },
                "examples": [
                    {
                        "en": "See your doctor if you have foot pain or corns.",
                        "vi": "Đi khám bác sĩ nếu bạn bị đau chân hoặc bắp chân."
                    }
                ]
            }
        ]
    },
    {
        "id": "14edd11349464b2ebd235e3a70829ef1",
        "word": "cotton",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈkɒtn/",
            "us": "/ˈkɑːtn/"
        },
        "nearby": [
            {
                "word": "cottaging",
                "pos": "noun"
            },
            {
                "word": "cotter pin",
                "pos": "noun"
            },
            {
                "word": "cotton",
                "pos": "noun"
            },
            {
                "word": "cotton",
                "pos": "verb"
            },
            {
                "word": "the Cotton Belt",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a plant grown in warm countries for the soft white hairs around its seeds that are used to make cloth and thread",
                    "vi": "một loại cây được trồng ở các nước ấm áp cho những sợi lông trắng mềm xung quanh hạt của nó được sử dụng để làm vải và chỉ"
                },
                "examples": [
                    {
                        "en": "From the age of six she worked in the fields, picking cotton.",
                        "vi": "Từ năm sáu tuổi bà đã làm ruộng, hái bông."
                    },
                    {
                        "en": "bales of cotton",
                        "vi": "kiện bông"
                    },
                    {
                        "en": "cotton fields/plantations/plants",
                        "vi": "cánh đồng bông / đồn điền / cây trồng"
                    }
                ]
            },
            {
                "define": {
                    "en": "the cloth made from the cotton plant",
                    "vi": "vải làm từ cây bông vải"
                },
                "examples": [
                    {
                        "en": "The sheets are 100 per cent pure cotton.",
                        "vi": "Các tấm trải giường là 100% bông tinh khiết."
                    },
                    {
                        "en": "a cotton shirt/skirt",
                        "vi": "áo sơ mi / váy cotton"
                    },
                    {
                        "en": "printed cotton cloth",
                        "vi": "vải cotton in"
                    },
                    {
                        "en": "the cotton industry",
                        "vi": "ngành công nghiệp bông"
                    },
                    {
                        "en": "a cotton mill",
                        "vi": "một nhà máy bông"
                    },
                    {
                        "en": "a pure cotton T-shirt",
                        "vi": "một chiếc áo phông cotton tinh khiết"
                    },
                    {
                        "en": "shivering in her thin cotton nightdress",
                        "vi": "rùng mình trong chiếc váy ngủ bằng vải cotton mỏng của cô ấy"
                    }
                ]
            },
            {
                "define": {
                    "en": "thread that is used for sewing",
                    "vi": "chỉ được sử dụng để may"
                },
                "examples": [
                    {
                        "en": "sewing cotton",
                        "vi": "bông may"
                    },
                    {
                        "en": "a cotton reel",
                        "vi": "một cuộn bông"
                    }
                ]
            },
            {
                "define": {
                    "en": "a soft mass of white material that is used for cleaning the skin or a wound",
                    "vi": "một khối vật liệu trắng mềm được sử dụng để làm sạch da hoặc vết thương"
                },
                "examples": [
                    {
                        "en": "Use a cotton ball to apply the lotion.",
                        "vi": "Sử dụng một miếng bông để thoa kem dưỡng da."
                    }
                ]
            }
        ]
    },
    {
        "id": "40f843171860452da082565d78d1e595",
        "word": "earth",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ɜːθ/",
            "us": "/ɜːrθ/"
        },
        "nearby": [
            {
                "word": "ear-splitting",
                "pos": "adjective"
            },
            {
                "word": "Earth, Wind and Fire",
                "pos": ""
            },
            {
                "word": "earth",
                "pos": "noun"
            },
            {
                "word": "earth",
                "pos": "verb"
            },
            {
                "word": "earthbound",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the world; the planet that we live on",
                    "vi": "thế giới; hành tinh mà chúng ta đang sống"
                },
                "examples": [
                    {
                        "en": "the planet Earth",
                        "vi": "hành tinh trái đất"
                    },
                    {
                        "en": "The earth revolves around the sun.",
                        "vi": "Trái đất xoay quanh mặt trời."
                    },
                    {
                        "en": "a satellite orbiting the earth",
                        "vi": "một vệ tinh quay quanh trái đất"
                    },
                    {
                        "en": "the earth's surface/crust",
                        "vi": "bề mặt / vỏ trái đất"
                    },
                    {
                        "en": "on earth the history of life on earth",
                        "vi": "trên trái đất lịch sử sự sống trên trái đất"
                    },
                    {
                        "en": "I must be the happiest person on earth!",
                        "vi": "Tôi phải là người hạnh phúc nhất trên trái đất!"
                    }
                ]
            },
            {
                "define": {
                    "en": "land; the hard surface of the world that is not the sea or the sky; the ground",
                    "vi": "đất; bề mặt cứng của thế giới không phải là biển hay bầu trời; mặt đất"
                },
                "examples": [
                    {
                        "en": "After a week at sea, it was good to feel the earth beneath our feet again.",
                        "vi": "Sau một tuần lênh đênh trên biển, thật tuyệt khi cảm thấy trái đất dưới chân mình trở lại."
                    },
                    {
                        "en": "above the earth fifty feet above the earth",
                        "vi": "trên mặt đất cách mặt đất 50 feet"
                    },
                    {
                        "en": "under/below/beneath the earth in mines deep under the earth",
                        "vi": "bên dưới / bên dưới / bên dưới trái đất trong các mỏ sâu dưới lòng đất"
                    },
                    {
                        "en": "You could feel the earth shake as the truck came closer.",
                        "vi": "Bạn có thể cảm thấy mặt đất rung chuyển khi chiếc xe tải đến gần hơn."
                    }
                ]
            },
            {
                "define": {
                    "en": "the substance that plants grow in",
                    "vi": "chất mà thực vật phát triển"
                },
                "examples": [
                    {
                        "en": "a clod/mound of earth",
                        "vi": "một cục đất / gò đất"
                    },
                    {
                        "en": "I cleaned off the earth clinging to my boots.",
                        "vi": "Tôi đã làm sạch đất bám vào ủng của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "the hole under the ground where an animal, especially a fox, lives",
                    "vi": "cái hố dưới mặt đất nơi một con vật, đặc biệt là cáo, sống"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a wire that connects an electric circuit with the ground and makes it safe",
                    "vi": "dây nối mạch điện với đất và làm cho nó an toàn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be, feel, look, taste, etc. very bad",
                    "vi": "trở nên, cảm nhận, nhìn, nếm, v.v. rất tệ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to charge, etc. a lot of money",
                    "vi": "để tính phí, v.v. rất nhiều tiền"
                },
                "examples": [
                    {
                        "en": "I'd love that dress, but it costs the earth.",
                        "vi": "Tôi thích chiếc váy đó, nhưng nó đắt giá trên trái đất."
                    },
                    {
                        "en": "If you want a house in London, you’ll have to pay the earth for it.",
                        "vi": "Nếu bạn muốn có một ngôi nhà ở London, bạn sẽ phải trả tiền cho nó."
                    }
                ]
            },
            {
                "define": {
                    "en": "to return, or to make somebody return, to a normal way of thinking or behaving after a time when you/they have been very excited, not very practical, etc.",
                    "vi": "để quay trở lại, hoặc khiến ai đó quay trở lại cách suy nghĩ hoặc hành vi bình thường sau khoảng thời gian mà bạn / họ rất hào hứng, không thực tế lắm, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to disappear completely",
                    "vi": "biến mất hoàn toàn"
                },
                "examples": [
                    {
                        "en": "Keep looking—they can't just have vanished off the face of the earth.",
                        "vi": "Hãy tiếp tục tìm kiếm — chúng không thể biến mất khỏi mặt đất."
                    }
                ]
            },
            {
                "define": {
                    "en": "to hide, especially to escape from somebody",
                    "vi": "trốn, đặc biệt là trốn khỏi ai đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to do everything possible, even if it is difficult, in order to get or achieve something",
                    "vi": "để làm mọi thứ có thể, ngay cả khi khó khăn, để đạt được hoặc đạt được điều gì đó"
                },
                "examples": [
                    {
                        "en": "I'd go to the ends of the earth to see her again.",
                        "vi": "Tôi muốn đi đến tận cùng trái đất để gặp lại cô ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to emphasize the question you are asking when you are surprised or angry or cannot think of an obvious answer",
                    "vi": "được sử dụng để nhấn mạnh câu hỏi bạn đang hỏi khi bạn ngạc nhiên hoặc tức giận hoặc không thể nghĩ ra một câu trả lời rõ ràng"
                },
                "examples": [
                    {
                        "en": "What on earth are you doing?",
                        "vi": "Bạn đang làm cái quái gì vậy?"
                    },
                    {
                        "en": "How on earth can she afford that?",
                        "vi": "Làm thế quái nào mà cô ấy có thể mua được?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to do everything you possibly can in order to achieve something",
                    "vi": "làm mọi thứ bạn có thể để đạt được điều gì đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used after negative nouns or pronouns to emphasize what you are saying",
                    "vi": "được sử dụng sau danh từ hoặc đại từ phủ định để nhấn mạnh những gì bạn đang nói"
                },
                "examples": [
                    {
                        "en": "Nothing on earth would persuade me to go with him.",
                        "vi": "Không có gì trên trái đất có thể thuyết phục tôi đi với anh ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make promises that will be impossible to keep",
                    "vi": "hứa sẽ không thể giữ được"
                },
                "examples": [
                    {
                        "en": "Politicians promise the earth before an election, but things are different afterwards.",
                        "vi": "Các chính trị gia hứa với trái đất trước một cuộc bầu cử, nhưng mọi thứ đã khác sau đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "to find somebody/something after looking hard for a long time",
                    "vi": "để tìm ai đó / điều gì đó sau khi chăm chỉ tìm kiếm trong một thời gian dài"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a very good and honest person that you can always depend on",
                    "vi": "một người rất tốt và trung thực mà bạn luôn có thể dựa vào"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to destroy or remove somebody/something completely",
                    "vi": "để tiêu diệt hoặc loại bỏ ai đó / cái gì đó hoàn toàn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "521a71f044f74fb9a2dae55a32bb685a",
        "word": "grain",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ɡreɪn/",
            "us": "/ɡreɪn/"
        },
        "nearby": [
            {
                "word": "Kenneth Grahame",
                "pos": ""
            },
            {
                "word": "grail",
                "pos": "noun"
            },
            {
                "word": "grain",
                "pos": "noun"
            },
            {
                "word": "grained",
                "pos": "adjective"
            },
            {
                "word": "grain elevator",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the small hard seeds of food plants such as wheat, rice, etc.; a single seed of such a plant",
                    "vi": "hạt cứng nhỏ của cây lương thực như lúa mì, gạo, v.v ...; một hạt giống của một loại cây như vậy"
                },
                "examples": [
                    {
                        "en": "Russia sold 12 million tons of grain abroad last year.",
                        "vi": "Nga đã bán 12 triệu tấn ngũ cốc ra nước ngoài vào năm ngoái."
                    },
                    {
                        "en": "America’s grain exports",
                        "vi": "Xuất khẩu ngũ cốc của Mỹ"
                    },
                    {
                        "en": "The journal reports that eating whole grains protects against diabetes.",
                        "vi": "Tạp chí báo cáo rằng ăn ngũ cốc nguyên hạt bảo vệ chống lại bệnh tiểu đường."
                    },
                    {
                        "en": "grain of something a few grains of rice",
                        "vi": "một vài hạt gạo"
                    }
                ]
            },
            {
                "define": {
                    "en": "a small hard piece of particular substances",
                    "vi": "một mảnh nhỏ cứng của các chất cụ thể"
                },
                "examples": [
                    {
                        "en": "a grain of salt/sand/sugar",
                        "vi": "một hạt muối / cát / đường"
                    },
                    {
                        "en": "I got a grain of sand in my eye.",
                        "vi": "Tôi bị một hạt cát trong mắt."
                    }
                ]
            },
            {
                "define": {
                    "en": "a very small amount",
                    "vi": "một số lượng rất nhỏ"
                },
                "examples": [
                    {
                        "en": "There isn't a grain of truth in those rumours.",
                        "vi": "Không có một chút sự thật nào trong những tin đồn đó."
                    },
                    {
                        "en": "If he had a grain of sensitivity he wouldn't have asked her about her divorce.",
                        "vi": "Nếu anh nhạy cảm, anh đã không hỏi cô về việc ly hôn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a small unit of weight, equal to 0.00143 of a pound or 0.0648 of a gram, used for example for weighing medicines",
                    "vi": "một đơn vị trọng lượng nhỏ, bằng 0,00143 pound hoặc 0,0648 gram, được sử dụng để cân thuốc"
                },
                "examples": [
                    {
                        "en": "The analysis showed a few grains of arsenic in the solution.",
                        "vi": "Phân tích cho thấy một vài hạt arsen trong dung dịch."
                    }
                ]
            },
            {
                "define": {
                    "en": "the natural direction of lines in wood, cloth, etc. or of layers of rock; the pattern of lines that you can see",
                    "vi": "hướng tự nhiên của các đường trong gỗ, vải, v.v. hoặc của các lớp đá; mô hình của các đường mà bạn có thể nhìn thấy"
                },
                "examples": [
                    {
                        "en": "along/across the grain to cut a piece of wood along/across the grain",
                        "vi": "dọc theo / ngang thớ để cắt một miếng gỗ dọc theo / ngang thớ"
                    },
                    {
                        "en": "This wood has a beautiful natural grain.",
                        "vi": "Loại gỗ này có vân đẹp tự nhiên."
                    }
                ]
            },
            {
                "define": {
                    "en": "how rough or smooth a surface feels",
                    "vi": "bề mặt nhám hay mịn như thế nào"
                },
                "examples": [
                    {
                        "en": "wood of coarse/fine grain",
                        "vi": "gỗ thô / thớ mịn"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be or do something different from what is normal or natural",
                    "vi": "trở thành hoặc làm điều gì đó khác với những gì bình thường hoặc tự nhiên"
                },
                "examples": [
                    {
                        "en": "It really goes against the grain to have to work on a Sunday.",
                        "vi": "Nó thực sự đi ngược lại với ngũ cốc khi phải làm việc vào Chủ nhật."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to warn somebody not to believe something completely",
                    "vi": "được sử dụng để cảnh báo ai đó không nên tin hoàn toàn vào điều gì đó"
                },
                "examples": [
                    {
                        "en": "If I were you, I'd take everything he says with a grain of salt.",
                        "vi": "Nếu tôi là bạn, tôi sẽ hiểu tất cả những gì anh ấy nói với một hạt muối."
                    }
                ]
            }
        ]
    },
    {
        "id": "43cab3babe4348419a65eac9beabcb45",
        "word": "pick",
        "pos": "verb",
        "level": "b1",
        "phonetic": {
            "uk": "/pɪk/",
            "us": "/pɪk/"
        },
        "nearby": [
            {
                "word": "piccaninny",
                "pos": "noun"
            },
            {
                "word": "piccolo",
                "pos": "noun"
            },
            {
                "word": "pick",
                "pos": "verb"
            },
            {
                "word": "pick",
                "pos": "noun"
            },
            {
                "word": "pick-and-mix",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to choose somebody/something from a group of people or things",
                    "vi": "để chọn ai đó / điều gì đó từ một nhóm người hoặc sự vật"
                },
                "examples": [
                    {
                        "en": "pick somebody/something Pick a number from one to twenty.",
                        "vi": "chọn ai đó / cái gì đó Chọn một số từ một đến hai mươi."
                    },
                    {
                        "en": "They are picking the final team this weekend.",
                        "vi": "Họ sẽ chọn đội cuối cùng vào cuối tuần này."
                    },
                    {
                        "en": "It's time to pick a side (= decide who you support).",
                        "vi": "Đã đến lúc chọn một bên (= quyết định xem bạn ủng hộ ai)."
                    },
                    {
                        "en": "He picked his words carefully.",
                        "vi": "Anh cẩn thận lựa lời."
                    },
                    {
                        "en": "At the beach we picked a spot to sit down.",
                        "vi": "Tại bãi biển, chúng tôi chọn một chỗ để ngồi xuống."
                    },
                    {
                        "en": "pick somebody/something to do something He has been picked to play in this week's game.",
                        "vi": "pick somebody / something to do something Anh ấy đã được chọn để chơi trong trò chơi tuần này."
                    },
                    {
                        "en": "pick somebody/something for something Have you been picked for the team?",
                        "vi": "pick somebody / something for something Bạn đã được chọn vào đội chưa?"
                    },
                    {
                        "en": "pick somebody/something as something It was picked as the best film in the competition.",
                        "vi": "pick somebody / something as something Phim được chọn là phim hay nhất trong cuộc thi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to take flowers, fruit, etc. from the plant or the tree where they are growing",
                    "vi": "lấy hoa, quả, v.v. từ cây hoặc cây nơi chúng đang phát triển"
                },
                "examples": [
                    {
                        "en": "to pick grapes/strawberries/cotton",
                        "vi": "hái nho / dâu tây / bông"
                    },
                    {
                        "en": "flowers freshly picked from the garden",
                        "vi": "hoa mới hái từ vườn"
                    },
                    {
                        "en": "The common was a great place to go blackberry picking.",
                        "vi": "Điểm chung là một nơi tuyệt vời để đi hái dâu đen."
                    }
                ]
            },
            {
                "define": {
                    "en": "to pull or remove something or small pieces of something from something else, especially with your fingers",
                    "vi": "để kéo hoặc loại bỏ một thứ gì đó hoặc những mảnh nhỏ của thứ gì đó từ thứ khác, đặc biệt là bằng các ngón tay của bạn"
                },
                "examples": [
                    {
                        "en": "pick something + adv./prep. She picked bits of fluff from his sweater.",
                        "vi": "chọn cái gì đó + adv./prep. Cô nhặt những sợi lông tơ từ chiếc áo len của anh."
                    },
                    {
                        "en": "He picked the nuts off the top of the cake.",
                        "vi": "Anh ta nhặt những quả hạch ở trên cùng của chiếc bánh."
                    },
                    {
                        "en": "Names were picked at random out of a hat.",
                        "vi": "Những cái tên được chọn ngẫu nhiên từ một chiếc mũ."
                    },
                    {
                        "en": "pick something to pick your nose (= put your finger inside your nose to remove dried mucus)",
                        "vi": "lấy thứ gì đó để ngoáy mũi (= đưa ngón tay vào trong mũi để loại bỏ chất nhầy khô)"
                    },
                    {
                        "en": "to pick your teeth (= use a small sharp piece of wood or plastice to remove pieces of food from your teeth)",
                        "vi": "ngoáy răng (= dùng một mảnh gỗ nhỏ sắc nhọn hoặc miếng nhựa để loại bỏ các mảnh thức ăn trên răng của bạn)"
                    },
                    {
                        "en": "pick something + adj. The dogs picked the bones clean (= ate all the meat from the bones).",
                        "vi": "chọn cái gì đó + adj. Những con chó nhặt sạch xương (= ăn hết thịt từ xương)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to play a musical instrument, especially a guitar, by pulling the strings with your fingers",
                    "vi": "để chơi một nhạc cụ, đặc biệt là guitar, bằng cách dùng ngón tay kéo dây"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be angry with somebody about something and want to discuss it with them",
                    "vi": "tức giận với ai đó về điều gì đó và muốn thảo luận với họ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to choose only those things that you like or want very much",
                    "vi": "chỉ chọn những thứ mà bạn thích hoặc rất muốn"
                },
                "examples": [
                    {
                        "en": "You have to take any job you can get—you can't pick and choose.",
                        "vi": "Bạn phải nhận bất kỳ công việc nào mà bạn có thể nhận được — bạn không thể chọn và chọn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to ask somebody a lot of questions about something because they know more about the subject than you do",
                    "vi": "để hỏi ai đó rất nhiều câu hỏi về điều gì đó bởi vì họ biết nhiều hơn về chủ đề này hơn bạn"
                },
                "examples": [
                    {
                        "en": "I need to pick your brains: what can you tell me about credit unions?",
                        "vi": "Tôi cần phải chọn bộ não của bạn: bạn có thể cho tôi biết điều gì về các công đoàn tín dụng?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to deliberately start a fight or an argument with somebody",
                    "vi": "cố tình bắt đầu một cuộc chiến hoặc một cuộc tranh cãi với ai đó"
                },
                "examples": [
                    {
                        "en": "He had drunk too much and was ready to pick a fight with anyone who crossed his path.",
                        "vi": "Anh ta đã uống quá nhiều và sẵn sàng gây gổ với bất cứ ai băng qua đường của mình."
                    },
                    {
                        "en": "She tried to pick a quarrel with me.",
                        "vi": "Cô ấy cố cãi nhau với tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to find the weak points in something such as a plan, suggestion, etc.",
                    "vi": "để tìm ra những điểm yếu trong một cái gì đó chẳng hạn như một kế hoạch, gợi ý, v.v."
                },
                "examples": [
                    {
                        "en": "It was easy to pick holes in his arguments.",
                        "vi": "Thật dễ dàng để tìm ra lỗ hổng trong các lập luận của anh ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to open a lock without a key, using something such as a piece of wire",
                    "vi": "để mở một ổ khóa mà không cần chìa khóa, sử dụng một cái gì đó chẳng hạn như một đoạn dây"
                },
                "examples": [
                    {
                        "en": "The burglars must have picked the lock on the back door.",
                        "vi": "Những tên trộm chắc chắn đã cạy khóa cửa sau."
                    }
                ]
            },
            {
                "define": {
                    "en": "to steal something from somebody’s pocket without them noticing",
                    "vi": "ăn trộm thứ gì đó từ túi của ai đó mà họ không nhận ra"
                },
                "examples": [
                    {
                        "en": "The back pocket on a pair of jeans is the easiest one to pick.",
                        "vi": "Túi sau của quần jean là túi dễ chọn nhất."
                    }
                ]
            },
            {
                "define": {
                    "en": "to criticize somebody, or their work or ideas, very severely",
                    "vi": "chỉ trích ai đó, hoặc công việc hoặc ý tưởng của họ, rất nghiêm khắc"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to criticize somebody, or their work or ideas, very severely",
                    "vi": "chỉ trích ai đó, hoặc công việc hoặc ý tưởng của họ, rất nghiêm khắc"
                },
                "examples": [
                    {
                        "en": "Their case was torn to shreds by the defence lawyer.",
                        "vi": "Vụ án của họ đã bị luật sư bào chữa xé thành từng mảnh nhỏ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to pay for something",
                    "vi": "để trả tiền cho một cái gì đó"
                },
                "examples": [
                    {
                        "en": "The company picked up the tab for his hotel room.",
                        "vi": "Công ty đã chọn tab cho phòng khách sạn của anh ấy."
                    },
                    {
                        "en": "The government will continue to pick up college fees for some students.",
                        "vi": "Chính phủ sẽ tiếp tục thu học phí đại học đối với một số sinh viên."
                    }
                ]
            },
            {
                "define": {
                    "en": "to return or to help somebody return to a normal situation, particularly after a shock or a disaster",
                    "vi": "để trở lại hoặc để giúp ai đó trở lại tình trạng bình thường, đặc biệt là sau một cú sốc hoặc thảm họa"
                },
                "examples": [
                    {
                        "en": "You cannot live your children's lives for them; you can only be there to pick up the pieces when things go wrong.",
                        "vi": "Bạn không thể sống cuộc sống của con cái bạn cho chúng; bạn chỉ có thể ở đó để nhặt từng mảnh khi mọi thứ diễn ra không như ý muốn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to go faster",
                    "vi": "đi nhanh hơn"
                },
                "examples": [
                    {
                        "en": "The train began to pick up speed.",
                        "vi": "Tàu bắt đầu tăng tốc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to return to an earlier situation or way of life after a period doing something else",
                    "vi": "trở lại hoàn cảnh hoặc lối sống trước đó sau một thời gian làm việc khác"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to walk carefully, choosing the safest, driest, etc. place to put your feet",
                    "vi": "bước đi cẩn thận, chọn nơi an toàn nhất, khô ráo nhất, v.v. để đặt chân"
                },
                "examples": [
                    {
                        "en": "She picked her way delicately over the rough ground.",
                        "vi": "Cô ấy chọn đường một cách tế nhị trên mặt đất gồ ghề."
                    },
                    {
                        "en": "We picked our way carefully over the jagged rocks.",
                        "vi": "Chúng tôi chọn đường cẩn thận qua những tảng đá lởm chởm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to choose a horse, etc. that you think is most likely to win a race",
                    "vi": "để chọn một con ngựa, v.v. mà bạn cho rằng có nhiều khả năng thắng cuộc đua"
                },
                "examples": [
                    {
                        "en": "He's very good at picking winners.",
                        "vi": "Anh ấy rất giỏi trong việc chọn người chiến thắng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make a very good choice",
                    "vi": "để đưa ra một lựa chọn rất tốt"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "offering somebody an ideal opportunity to gain an advantage",
                    "vi": "cung cấp cho ai đó một cơ hội lý tưởng để đạt được lợi thế"
                },
                "examples": [
                    {
                        "en": "This is an opportunity ripe for the picking.",
                        "vi": "Đây là thời cơ chín muồi để hái."
                    },
                    {
                        "en": "The Raiders' defense is ripe for the picking.",
                        "vi": "Hàng phòng thủ của Raiders đã chín muồi."
                    }
                ]
            }
        ]
    },
    {
        "id": "638397bed71548d3b6adb973ca02cc5f",
        "word": "seed",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/siːd/",
            "us": "/siːd/"
        },
        "nearby": [
            {
                "word": "see",
                "pos": "noun"
            },
            {
                "word": "see about",
                "pos": "phrasal verb"
            },
            {
                "word": "seed",
                "pos": "noun"
            },
            {
                "word": "seed",
                "pos": "verb"
            },
            {
                "word": "seedbed",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the small hard part produced by a plant, from which a new plant can grow",
                    "vi": "phần cứng nhỏ do cây tạo ra, từ đó cây mới có thể phát triển"
                },
                "examples": [
                    {
                        "en": "a packet of wild flower seeds",
                        "vi": "một gói hạt giống hoa dại"
                    },
                    {
                        "en": "sesame seeds",
                        "vi": "Hạt mè"
                    },
                    {
                        "en": "Sow the seeds outdoors in spring.",
                        "vi": "Gieo hạt ngoài trời vào mùa xuân."
                    },
                    {
                        "en": "Plant the seeds 10cm apart.",
                        "vi": "Trồng các hạt cách nhau 10cm."
                    },
                    {
                        "en": "These vegetables can be grown from seed.",
                        "vi": "Những loại rau này có thể được trồng từ hạt giống."
                    },
                    {
                        "en": "seed potatoes (= used for planting)",
                        "vi": "khoai tây hạt (= dùng để trồng)"
                    }
                ]
            },
            {
                "define": {
                    "en": "the small hard seed that is found in some types of fruit",
                    "vi": "hạt cứng nhỏ được tìm thấy trong một số loại trái cây"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the beginning of a feeling or development that continues to grow",
                    "vi": "sự khởi đầu của một cảm giác hoặc sự phát triển tiếp tục phát triển"
                },
                "examples": [
                    {
                        "en": "the seeds of rebellion",
                        "vi": "mầm mống của sự nổi loạn"
                    },
                    {
                        "en": "This planted the seeds of doubt in my mind.",
                        "vi": "Điều này đã gieo mầm nghi ngờ trong tâm trí tôi."
                    },
                    {
                        "en": "He argued that capitalism contained the seeds of its own destruction.",
                        "vi": "Ông cho rằng chủ nghĩa tư bản chứa đựng mầm mống của sự hủy diệt của chính nó."
                    }
                ]
            },
            {
                "define": {
                    "en": "one of the best players in a competition. The seeds are given a position in a list to try and make sure that they do not play each other in the early parts of the competition.",
                    "vi": "một trong những người chơi giỏi nhất trong một cuộc thi. Các hạt giống được đưa ra một vị trí trong danh sách để thử và đảm bảo rằng chúng không chơi lẫn nhau trong những phần đầu của cuộc thi."
                },
                "examples": [
                    {
                        "en": "The top seed won comfortably.",
                        "vi": "Hạt giống hàng đầu chiến thắng một cách thoải mái."
                    },
                    {
                        "en": "the number one seed",
                        "vi": "hạt giống số một"
                    },
                    {
                        "en": "She was the top seed at the US Open this year.",
                        "vi": "Cô là hạt giống hàng đầu tại US Open năm nay."
                    }
                ]
            },
            {
                "define": {
                    "en": "semen",
                    "vi": "tinh dịch"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "all the people who are the children, grandchildren, etc. of one man",
                    "vi": "tất cả những người là con, cháu, v.v. của một người"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to produce flowers and seeds as well as leaves",
                    "vi": "để tạo ra hoa và hạt cũng như lá"
                },
                "examples": [
                    {
                        "en": "The lettuces had all run to seed.",
                        "vi": "Tất cả các lettuces đã chạy để gieo hạt."
                    },
                    {
                        "en": "Cutting weeds before they go to seed will greatly reduce future weed problems.",
                        "vi": "Cắt cỏ dại trước khi gieo hạt sẽ làm giảm đáng kể các vấn đề về cỏ dại trong tương lai."
                    }
                ]
            },
            {
                "define": {
                    "en": "to become much less attractive or good because of lack of attention",
                    "vi": "trở nên kém hấp dẫn hoặc kém hấp dẫn hơn nhiều vì thiếu sự chú ý"
                },
                "examples": [
                    {
                        "en": "After his divorce, he let himself go to seed.",
                        "vi": "Sau khi ly hôn, anh ta thả mình đi gieo hạt."
                    }
                ]
            },
            {
                "define": {
                    "en": "to start the process that leads to a particular situation or result",
                    "vi": "để bắt đầu quá trình dẫn đến một tình huống hoặc kết quả cụ thể"
                },
                "examples": [
                    {
                        "en": "In this way he sowed the seeds of his own success.",
                        "vi": "Bằng cách này, anh đã gieo những hạt giống thành công của chính mình."
                    }
                ]
            }
        ]
    },
    {
        "id": "8d14964d01e844058d79d1e01a47e6d7",
        "word": "soil",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/sɔɪl/",
            "us": "/sɔɪl/"
        },
        "nearby": [
            {
                "word": "soi-disant",
                "pos": "adjective"
            },
            {
                "word": "soignée",
                "pos": "adjective"
            },
            {
                "word": "soil",
                "pos": "noun"
            },
            {
                "word": "soil",
                "pos": "verb"
            },
            {
                "word": "the Soil Association",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the top layer of the earth in which plants, trees, etc. grow",
                    "vi": "lớp trên cùng của trái đất, nơi thực vật, cây cối, v.v. phát triển"
                },
                "examples": [
                    {
                        "en": "instruments for measuring soil moisture",
                        "vi": "dụng cụ đo độ ẩm của đất"
                    },
                    {
                        "en": "soil erosion",
                        "vi": "xói mòn đất"
                    },
                    {
                        "en": "the study of rocks and soils",
                        "vi": "nghiên cứu về đá và đất"
                    },
                    {
                        "en": "sandy/fertile soil",
                        "vi": "đất cát / màu mỡ"
                    },
                    {
                        "en": "rich/poor/dry/wet soil",
                        "vi": "đất giàu / nghèo / khô / ướt"
                    },
                    {
                        "en": "acid/alkaline soil",
                        "vi": "đất chua / kiềm"
                    },
                    {
                        "en": "clay soil",
                        "vi": "đất sét"
                    },
                    {
                        "en": "moisture in the soil",
                        "vi": "độ ẩm trong đất"
                    },
                    {
                        "en": "She dug the compost into the soil.",
                        "vi": "Cô đào phân trộn vào đất."
                    }
                ]
            },
            {
                "define": {
                    "en": "a country; an area of land",
                    "vi": "một đất nước; một khu đất"
                },
                "examples": [
                    {
                        "en": "It was the first time I had set foot on African soil.",
                        "vi": "Đó là lần đầu tiên tôi đặt chân lên đất Châu Phi."
                    },
                    {
                        "en": "protests over the siting of nuclear weapons on British soil",
                        "vi": "biểu tình phản đối việc bố trí vũ khí hạt nhân trên đất Anh"
                    },
                    {
                        "en": "He was the first Canadian to win on home/native soil (= in Canada).",
                        "vi": "Anh ấy là người Canada đầu tiên giành chiến thắng trên sân nhà / đất bản địa (= ở Canada)."
                    }
                ]
            }
        ]
    },
    {
        "id": "0ce0a3db3be84554862ef82edcabfe4d",
        "word": "water",
        "pos": "verb",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈwɔːtə(r)/",
            "us": "/ˈwɔːtər/"
        },
        "nearby": [
            {
                "word": "watchword",
                "pos": "noun"
            },
            {
                "word": "water",
                "pos": "noun"
            },
            {
                "word": "water",
                "pos": "verb"
            },
            {
                "word": "The Water-Babies",
                "pos": ""
            },
            {
                "word": "the Water Bearer",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to pour water on plants, etc.",
                    "vi": "đổ nước lên cây, v.v."
                },
                "examples": [
                    {
                        "en": "to water the plants/garden",
                        "vi": "tưới cây / vườn"
                    }
                ]
            },
            {
                "define": {
                    "en": "to become full of tears",
                    "vi": "trở nên đầy nước mắt"
                },
                "examples": [
                    {
                        "en": "The smoke made my eyes water.",
                        "vi": "Làn khói làm mắt tôi ngấn nước."
                    }
                ]
            },
            {
                "define": {
                    "en": "to produce saliva",
                    "vi": "tiết ra nước bọt"
                },
                "examples": [
                    {
                        "en": "The smells from the kitchen made our mouths water.",
                        "vi": "Mùi từ nhà bếp làm cho miệng chúng tôi chảy nước."
                    },
                    {
                        "en": "The smell of the meat made her mouth water.",
                        "vi": "Mùi thịt khiến miệng cô ứa nước."
                    }
                ]
            },
            {
                "define": {
                    "en": "to give water to an animal to drink",
                    "vi": "cho một con vật uống nước"
                },
                "examples": [
                    {
                        "en": "to water the horses",
                        "vi": "tưới nước cho ngựa"
                    },
                    {
                        "en": "(humorous) After a tour of the grounds, the guests were fed and watered.",
                        "vi": "(hài hước) Sau khi tham quan khu đất, các vị khách đã được cho ăn và uống nước."
                    }
                ]
            },
            {
                "define": {
                    "en": "to provide an area of land with water",
                    "vi": "cung cấp nước cho một khu vực đất"
                },
                "examples": [
                    {
                        "en": "be watered by something The valley is watered by a stream.",
                        "vi": "được tưới bởi một cái gì đó Thung lũng được tưới bởi một dòng suối."
                    }
                ]
            },
            {
                "define": {
                    "en": "to add water to an alcoholic drink",
                    "vi": "thêm nước vào đồ uống có cồn"
                },
                "examples": [
                    {
                        "en": "watered wine",
                        "vi": "rượu nước"
                    }
                ]
            }
        ]
    },
    {
        "id": "6d72a6c59b70492abc4d593b6cfdaa07",
        "word": "agriculture",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈæɡrɪkʌltʃə(r)/",
            "us": "/ˈæɡrɪkʌltʃər/"
        },
        "nearby": [
            {
                "word": "the Agricultural Development and Advisory Service",
                "pos": ""
            },
            {
                "word": "agriculturalist",
                "pos": "noun"
            },
            {
                "word": "agriculture",
                "pos": "noun"
            },
            {
                "word": "agritourism",
                "pos": "noun"
            },
            {
                "word": "agro-",
                "pos": "combining form"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the science or practice of farming",
                    "vi": "khoa học hoặc thực hành nông nghiệp"
                },
                "examples": [
                    {
                        "en": "The number of people employed in agriculture has fallen in the last decade.",
                        "vi": "Số người làm việc trong lĩnh vực nông nghiệp đã giảm trong thập kỷ qua."
                    },
                    {
                        "en": "50% of the country’s population depends on agriculture.",
                        "vi": "50% dân số cả nước phụ thuộc vào nông nghiệp."
                    }
                ]
            }
        ]
    },
    {
        "id": "2ca15f34d41646849b8a6bc70164672d",
        "word": "cereal",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈsɪəriəl/",
            "us": "/ˈsɪriəl/"
        },
        "nearby": [
            {
                "word": "ceramic",
                "pos": "noun"
            },
            {
                "word": "ceramic",
                "pos": "adjective"
            },
            {
                "word": "cereal",
                "pos": "noun"
            },
            {
                "word": "cerebellum",
                "pos": "noun"
            },
            {
                "word": "cerebral",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "one of various types of grass that produce grains that can be eaten or are used to make flour or bread. wheat, barley and rye are all cereals.",
                    "vi": "một trong những loại cỏ khác nhau tạo ra ngũ cốc có thể ăn được hoặc được sử dụng để làm bột mì hoặc bánh mì. lúa mì, lúa mạch và lúa mạch đen đều là ngũ cốc."
                },
                "examples": [
                    {
                        "en": "cereal crops",
                        "vi": "cây ngũ cốc"
                    }
                ]
            },
            {
                "define": {
                    "en": "the grain produced by cereal crops",
                    "vi": "ngũ cốc tạo ra từ cây ngũ cốc"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "food made from the grain of cereals, often eaten for breakfast with milk",
                    "vi": "thực phẩm làm từ hạt ngũ cốc, thường được ăn vào bữa sáng với sữa"
                },
                "examples": [
                    {
                        "en": "breakfast cereals",
                        "vi": "ngũ cốc ăn sáng"
                    },
                    {
                        "en": "a bowl of cereal",
                        "vi": "một bát ngũ cốc"
                    }
                ]
            }
        ]
    },
    {
        "id": "f093ae59df0f4ce78ed20f80e5755c05",
        "word": "crop",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/krɒp/",
            "us": "/krɑːp/"
        },
        "nearby": [
            {
                "word": "croon",
                "pos": "verb"
            },
            {
                "word": "crooner",
                "pos": "noun"
            },
            {
                "word": "crop",
                "pos": "noun"
            },
            {
                "word": "crop",
                "pos": "verb"
            },
            {
                "word": "crop circle",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a plant that is grown in large quantities, especially as food",
                    "vi": "một loại cây được trồng với số lượng lớn, đặc biệt là làm thực phẩm"
                },
                "examples": [
                    {
                        "en": "Sugar is an important crop on the island.",
                        "vi": "Đường là một loại cây trồng quan trọng trên đảo."
                    },
                    {
                        "en": "What are the benefits of growing GM crops?",
                        "vi": "Lợi ích của việc trồng cây biến đổi gen là gì?"
                    },
                    {
                        "en": "food crops",
                        "vi": "cây lương thực"
                    },
                    {
                        "en": "crop yield/production",
                        "vi": "năng suất / sản lượng cây trồng"
                    },
                    {
                        "en": "to grow/plant/harvest crops",
                        "vi": "trồng / trồng / thu hoạch cây trồng"
                    },
                    {
                        "en": "The crops are regularly sprayed with pesticides.",
                        "vi": "Các loại cây trồng thường xuyên được phun thuốc trừ sâu."
                    }
                ]
            },
            {
                "define": {
                    "en": "the amount of grain, fruit, etc. that is grown in one season",
                    "vi": "số lượng ngũ cốc, trái cây, v.v. được trồng trong một mùa"
                },
                "examples": [
                    {
                        "en": "a fall in this year’s coffee crop",
                        "vi": "vụ cà phê năm nay rớt giá"
                    },
                    {
                        "en": "Australia's wheat crop is likely to be lower than forecast this year.",
                        "vi": "Vụ lúa mì của Australia có thể sẽ thấp hơn dự báo trong năm nay."
                    },
                    {
                        "en": "We are looking forward to a bumper crop (= a very large one).",
                        "vi": "Chúng tôi đang mong đợi một vụ mùa bội thu (= một vụ mùa rất lớn)."
                    },
                    {
                        "en": "We had a very good crop of apples last year.",
                        "vi": "Chúng tôi đã có một vụ táo rất tốt vào năm ngoái."
                    }
                ]
            },
            {
                "define": {
                    "en": "a group of people who do something at the same time; a number of things that happen at the same time",
                    "vi": "một nhóm người làm việc gì đó cùng một lúc; một số điều xảy ra cùng một lúc"
                },
                "examples": [
                    {
                        "en": "the current crop of trainees",
                        "vi": "vụ mùa hiện tại của các học viên"
                    },
                    {
                        "en": "She is really the cream of the crop (= the best in her group).",
                        "vi": "Cô ấy thực sự là kem của mùa vụ (= tốt nhất trong nhóm của cô ấy)."
                    },
                    {
                        "en": "a crop of disasters/injuries",
                        "vi": "một vụ thiên tai / thương tích"
                    }
                ]
            },
            {
                "define": {
                    "en": "a short whip used by horse riders",
                    "vi": "một chiếc roi ngắn được sử dụng bởi những người cưỡi ngựa"
                },
                "examples": [
                    {
                        "en": "a riding crop",
                        "vi": "một cây trồng cưỡi"
                    }
                ]
            },
            {
                "define": {
                    "en": "a very short hairstyle",
                    "vi": "một kiểu tóc rất ngắn"
                },
                "examples": [
                    {
                        "en": "She has her hair cut in a short crop.",
                        "vi": "Cô ấy cắt tóc ngắn."
                    }
                ]
            },
            {
                "define": {
                    "en": "hair that is short and thick",
                    "vi": "tóc ngắn và dày"
                },
                "examples": [
                    {
                        "en": "He had a thick crop of black curly hair.",
                        "vi": "Anh ta có một mái tóc xoăn đen dày."
                    }
                ]
            },
            {
                "define": {
                    "en": "a part of a bird’s throat that has the shape of a bag where food is stored before it passes into the stomach",
                    "vi": "một phần cổ họng của chim có hình dạng như một cái túi, nơi chứa thức ăn trước khi đi vào dạ dày"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "15c97232741b4722977bbad78201ccea",
        "word": "genetically modified",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/dʒəˌnetɪkli ˈmɒdɪfaɪd/",
            "us": "/dʒəˌnetɪkli ˈmɑːdɪfaɪd/"
        },
        "nearby": [
            {
                "word": "genetic",
                "pos": "adjective"
            },
            {
                "word": "genetically",
                "pos": "adverb"
            },
            {
                "word": "genetically modified",
                "pos": "adjective"
            },
            {
                "word": "genetic code",
                "pos": "noun"
            },
            {
                "word": "genetic engineering",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "(of a plant, etc.) having had its genetic structure changed artificially, so that it will, for example, produce more fruit or not be affected by disease",
                    "vi": "(của thực vật, v.v.) đã bị thay đổi cấu trúc di truyền của nó một cách nhân tạo, để chẳng hạn, nó sẽ tạo ra nhiều quả hơn hoặc không bị ảnh hưởng bởi bệnh tật"
                },
                "examples": [
                    {
                        "en": "genetically modified foods (= made from plants that have been changed in this way)",
                        "vi": "thực phẩm biến đổi gen (= được làm từ thực vật đã được thay đổi theo cách này)"
                    },
                    {
                        "en": "genetically modified organisms",
                        "vi": "vật biến đổi gen"
                    }
                ]
            }
        ]
    },
    {
        "id": "6a93bb3420604f77b51c9430b3a0eefe",
        "word": "GM",
        "pos": "abbreviation",
        "level": "b2",
        "phonetic": {
            "uk": "/ˌdʒiː ˈem/",
            "us": "/ˌdʒiː ˈem/"
        },
        "nearby": [
            {
                "word": "glyph",
                "pos": "noun"
            },
            {
                "word": "gm",
                "pos": "abbreviation"
            },
            {
                "word": "GM",
                "pos": "abbreviation"
            },
            {
                "word": "G-man",
                "pos": "noun"
            },
            {
                "word": "GMAT",
                "pos": "abbreviation"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "genetically modified (of a plant), having had its genetic structure changed artificially, so that it will, for example, produce more fruit or not be affected by disease",
                    "vi": "biến đổi gen (của một loại thực vật), đã bị thay đổi cấu trúc gen của nó một cách nhân tạo, để chẳng hạn, nó sẽ tạo ra nhiều quả hơn hoặc không bị ảnh hưởng bởi bệnh tật"
                },
                "examples": [
                    {
                        "en": "GM foods or ‘Frankenstein foods’ as they are popularly called",
                        "vi": "Thực phẩm biến đổi gen hoặc 'thực phẩm Frankenstein' như chúng được gọi phổ biến"
                    }
                ]
            },
            {
                "define": {
                    "en": "grant-maintained (used in England and Wales to describe schools that received money from central, not local, government during the 1990s)",
                    "vi": "trợ cấp duy trì (được sử dụng ở Anh và xứ Wales để mô tả các trường nhận tiền từ chính phủ trung ương, không phải địa phương, trong những năm 1990)"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "b342a40abfc04c488b4c5dafc56e448c",
        "word": "greenhouse",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈɡriːnhaʊs/",
            "us": "/ˈɡriːnhaʊs/"
        },
        "nearby": [
            {
                "word": "Greenham Common",
                "pos": ""
            },
            {
                "word": "greenhorn",
                "pos": "noun"
            },
            {
                "word": "greenhouse",
                "pos": "noun"
            },
            {
                "word": "the greenhouse effect",
                "pos": "noun"
            },
            {
                "word": "greenhouse gas",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a building with glass sides and a glass roof for growing plants in",
                    "vi": "một tòa nhà với các mặt kính và một mái kính để trồng cây trong"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "e9452e3545c94b28b308ed25067b4e30",
        "word": "growing season",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈɡrəʊɪŋ siːzn/",
            "us": "/ˈɡrəʊɪŋ siːzn/"
        },
        "nearby": [
            {
                "word": "growing",
                "pos": "adjective"
            },
            {
                "word": "growing pains",
                "pos": "noun"
            },
            {
                "word": "growing season",
                "pos": "noun"
            },
            {
                "word": "grow into",
                "pos": "phrasal verb"
            },
            {
                "word": "growl",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the period of the year during which the weather conditions are right for plants to grow",
                    "vi": "Khoảng thời gian trong năm mà điều kiện thời tiết thích hợp cho cây cối phát triển"
                },
                "examples": [
                    {
                        "en": "a part of the world with a long growing season",
                        "vi": "một phần của thế giới có mùa trồng trọt kéo dài"
                    }
                ]
            }
        ]
    },
    {
        "id": "382f43e790274e199f7fcc243d34b149",
        "word": "organic",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/ɔːˈɡænɪk/",
            "us": "/ɔːrˈɡænɪk/"
        },
        "nearby": [
            {
                "word": "organdie",
                "pos": "noun"
            },
            {
                "word": "organ grinder",
                "pos": "noun"
            },
            {
                "word": "organic",
                "pos": "adjective"
            },
            {
                "word": "organically",
                "pos": "adverb"
            },
            {
                "word": "organic chemistry",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "produced or practised without using artificial chemicals",
                    "vi": "được sản xuất hoặc thực hành không sử dụng hóa chất nhân tạo"
                },
                "examples": [
                    {
                        "en": "organic cheese/vegetables/wine, etc.",
                        "vi": "pho mát hữu cơ / rau / rượu vang, v.v."
                    },
                    {
                        "en": "an organic farmer/gardener",
                        "vi": "một nông dân / người làm vườn hữu cơ"
                    },
                    {
                        "en": "organic farming/horticulture",
                        "vi": "nông nghiệp hữu cơ / làm vườn"
                    },
                    {
                        "en": "The farm went fully organic in 1996.",
                        "vi": "Trang trại hoàn toàn hữu cơ vào năm 1996."
                    }
                ]
            },
            {
                "define": {
                    "en": "produced by or from living things",
                    "vi": "được sản xuất bởi hoặc từ các sinh vật sống"
                },
                "examples": [
                    {
                        "en": "Improve the soil by adding organic matter.",
                        "vi": "Cải tạo đất bằng cách bổ sung chất hữu cơ."
                    }
                ]
            },
            {
                "define": {
                    "en": "relating to chemical compounds that contain carbon and mainly or ultimately come from living things",
                    "vi": "liên quan đến các hợp chất hóa học có chứa cacbon và chủ yếu hoặc cuối cùng đến từ các sinh vật sống"
                },
                "examples": [
                    {
                        "en": "organic compounds",
                        "vi": "hợp chất hữu cơ"
                    }
                ]
            },
            {
                "define": {
                    "en": "connected with the organs of the body",
                    "vi": "kết nối với các cơ quan của cơ thể"
                },
                "examples": [
                    {
                        "en": "organic disease",
                        "vi": "bệnh hữu cơ"
                    }
                ]
            },
            {
                "define": {
                    "en": "consisting of different parts that are all connected to each other",
                    "vi": "bao gồm các bộ phận khác nhau được kết nối với nhau"
                },
                "examples": [
                    {
                        "en": "the view of society as an organic whole",
                        "vi": "cái nhìn của xã hội như một chỉnh thể hữu cơ"
                    }
                ]
            },
            {
                "define": {
                    "en": "happening in a slow and natural way, rather than suddenly",
                    "vi": "diễn ra một cách chậm rãi và tự nhiên, thay vì đột ngột"
                },
                "examples": [
                    {
                        "en": "the organic growth of foreign markets",
                        "vi": "sự tăng trưởng hữu cơ của thị trường nước ngoài"
                    }
                ]
            }
        ]
    },
    {
        "id": "36f36096a9564743b89d515141cf2b10",
        "word": "pesticide",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈpestɪsaɪd/",
            "us": "/ˈpestɪsaɪd/"
        },
        "nearby": [
            {
                "word": "pester",
                "pos": "verb"
            },
            {
                "word": "pester power",
                "pos": "noun"
            },
            {
                "word": "pesticide",
                "pos": "noun"
            },
            {
                "word": "pestilence",
                "pos": "noun"
            },
            {
                "word": "pestilential",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a chemical used for killing pests, especially insects",
                    "vi": "một loại hóa chất được sử dụng để diệt sâu bọ, đặc biệt là côn trùng"
                },
                "examples": [
                    {
                        "en": "vegetables grown without the use of pesticides",
                        "vi": "rau được trồng không sử dụng thuốc trừ sâu"
                    },
                    {
                        "en": "crops sprayed with pesticide",
                        "vi": "cây trồng bị phun thuốc trừ sâu"
                    }
                ]
            }
        ]
    },
    {
        "id": "bb92facb95a548c38f5adddd2176cb35",
        "word": "produce",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈprɒdjuːs/",
            "us": "/ˈprəʊduːs/"
        },
        "nearby": [
            {
                "word": "The Prodigy",
                "pos": ""
            },
            {
                "word": "produce",
                "pos": "verb"
            },
            {
                "word": "produce",
                "pos": "noun"
            },
            {
                "word": "producer",
                "pos": "noun"
            },
            {
                "word": "product",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "things that have been made or grown, especially things connected with farming",
                    "vi": "những thứ đã được tạo ra hoặc trồng trọt, đặc biệt là những thứ liên quan đến nông nghiệp"
                },
                "examples": [
                    {
                        "en": "The market is full of farm produce.",
                        "vi": "Chợ có đầy đủ các loại nông sản."
                    },
                    {
                        "en": "The shop sells only fresh local produce.",
                        "vi": "Cửa hàng chỉ bán các sản phẩm tươi sống của địa phương."
                    },
                    {
                        "en": "It says on the label ‘Produce of France’.",
                        "vi": "Nó ghi trên nhãn 'Sản xuất của Pháp'."
                    }
                ]
            }
        ]
    },
    {
        "id": "1aacad03c7624da08cb388a741e10131",
        "word": "straw",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/strɔː/",
            "us": "/strɔː/"
        },
        "nearby": [
            {
                "word": "stravaig",
                "pos": "verb"
            },
            {
                "word": "Igor Stravinsky",
                "pos": ""
            },
            {
                "word": "straw",
                "pos": "noun"
            },
            {
                "word": "strawberry",
                "pos": "noun"
            },
            {
                "word": "strawberry blonde",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "stems of wheat or other grain plants that have been cut and dried. Straw is used for making mats, hats, etc., for packing things to protect them, and as food for animals or for them to sleep on.",
                    "vi": "thân cây lúa mì hoặc các loại cây ngũ cốc khác đã được cắt và sấy khô. Rơm được dùng làm chiếu, mũ, ... để đóng gói bảo vệ chúng, làm thức ăn cho động vật hoặc cho chúng ngủ."
                },
                "examples": [
                    {
                        "en": "a mattress filled with straw",
                        "vi": "một tấm nệm đầy rơm"
                    },
                    {
                        "en": "a straw hat",
                        "vi": "một chiếc mũ rơm"
                    }
                ]
            },
            {
                "define": {
                    "en": "a single stem or piece of straw",
                    "vi": "một thân cây hoặc một mảnh rơm"
                },
                "examples": [
                    {
                        "en": "He was leaning over the gate chewing on a straw.",
                        "vi": "Anh ta đang nhoài người ra cổng nhai rơm."
                    }
                ]
            },
            {
                "define": {
                    "en": "a thin tube of plastic or paper that you drink a liquid through",
                    "vi": "một ống nhựa hoặc giấy mỏng mà bạn uống chất lỏng qua"
                },
                "examples": [
                    {
                        "en": "She drank her milkshake through a straw.",
                        "vi": "Cô uống sữa lắc qua ống hút."
                    }
                ]
            },
            {
                "define": {
                    "en": "to try all possible means to find a solution or some hope in a difficult or unpleasant situation, even though this seems very unlikely",
                    "vi": "cố gắng bằng mọi cách có thể để tìm ra giải pháp hoặc một số hy vọng trong một tình huống khó khăn hoặc khó chịu, mặc dù điều này dường như rất khó xảy ra"
                },
                "examples": [
                    {
                        "en": "I know I’m just clutching at straws here, but is it possible that the doctors are wrong?",
                        "vi": "Tôi biết tôi chỉ đang ôm chặt ống hút ở đây, nhưng có thể là các bác sĩ đã nhầm?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be the person in a group who is chosen or forced to perform an unpleasant duty or task",
                    "vi": "trở thành người trong nhóm được chọn hoặc buộc phải thực hiện một nhiệm vụ hoặc nhiệm vụ khó chịu"
                },
                "examples": [
                    {
                        "en": "I drew the short straw and had to clean the toilets.",
                        "vi": "Tôi đã rút ống hút ngắn và phải dọn dẹp nhà vệ sinh."
                    }
                ]
            },
            {
                "define": {
                    "en": "to use a method of choosing somebody to do or have something in which each person takes a piece of paper, etc. from a container and the one whose paper has a special mark is chosen",
                    "vi": "sử dụng phương pháp chọn ai đó làm hoặc làm một việc gì đó, trong đó mỗi người lấy một tờ giấy, v.v. từ hộp đựng và người có tờ giấy có dấu đặc biệt sẽ được chọn"
                },
                "examples": [
                    {
                        "en": "We drew straws for who went first.",
                        "vi": "Chúng tôi đã vẽ ống hút cho ai đi trước."
                    }
                ]
            },
            {
                "define": {
                    "en": "the last in a series of bad events, etc. that makes it impossible for you to accept a situation any longer",
                    "vi": "sự kiện cuối cùng trong một chuỗi các sự kiện tồi tệ, v.v. khiến bạn không thể chấp nhận một tình huống nào nữa"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to try to work without the necessary material, money, information, etc.",
                    "vi": "cố gắng làm việc mà không có vật chất, tiền bạc, thông tin cần thiết, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a small sign of what might happen in the future",
                    "vi": "một dấu hiệu nhỏ về những gì có thể xảy ra trong tương lai"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c6ec555e6b104eb29d4d9d0ffcadfe66",
        "word": "sunflower",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈsʌnflaʊə(r)/",
            "us": "/ˈsʌnflaʊər/"
        },
        "nearby": [
            {
                "word": "sundries",
                "pos": "noun"
            },
            {
                "word": "sundry",
                "pos": "adjective"
            },
            {
                "word": "sunflower",
                "pos": "noun"
            },
            {
                "word": "sung",
                "pos": "verb"
            },
            {
                "word": "sunglasses",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a very tall plant with large yellow flowers, grown in gardens or for its seeds and their oil that are used in cooking",
                    "vi": "một loại cây rất cao với hoa lớn màu vàng, được trồng trong vườn hoặc lấy hạt và dầu của chúng được sử dụng trong nấu ăn"
                },
                "examples": [
                    {
                        "en": "sunflower oil",
                        "vi": "dầu hướng dương"
                    }
                ]
            }
        ]
    },
    {
        "id": "32adea50ac794659b7c0b49c1162b6d2",
        "word": "wheat",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/wiːt/",
            "us": "/wiːt/"
        },
        "nearby": [
            {
                "word": "whatsoever",
                "pos": "adverb"
            },
            {
                "word": "What the Papers Say",
                "pos": ""
            },
            {
                "word": "wheat",
                "pos": "noun"
            },
            {
                "word": "the Wheat Belt",
                "pos": "noun"
            },
            {
                "word": "wheatgerm",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a plant grown for its grain that is used to produce the flour for bread, cakes, pasta, etc.; the grain of this plant",
                    "vi": "một loại cây được trồng để lấy hạt được sử dụng để sản xuất bột làm bánh mì, bánh ngọt, mì ống, v.v.; hạt của cây này"
                },
                "examples": [
                    {
                        "en": "wheat flour",
                        "vi": "bột mì"
                    }
                ]
            },
            {
                "define": {
                    "en": "to recognize the difference between useful or valuable people or things and those that are not useful or have no value",
                    "vi": "để nhận ra sự khác biệt giữa những người hoặc những thứ hữu ích và có giá trị và những người không hữu ích hoặc không có giá trị"
                },
                "examples": [
                    {
                        "en": "We sifted through the application forms to separate the wheat from the chaff.",
                        "vi": "Chúng tôi đã sàng lọc các mẫu đơn để tách lúa mì ra khỏi vỏ trấu."
                    }
                ]
            }
        ]
    },
    {
        "id": "dafb247486784864be1270436f3d9adc",
        "word": "agricultural",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌæɡrɪˈkʌltʃərəl/",
            "us": "/ˌæɡrɪˈkʌltʃərəl/"
        },
        "nearby": [
            {
                "word": "agribusiness",
                "pos": "noun"
            },
            {
                "word": "agric",
                "pos": "adjective"
            },
            {
                "word": "agricultural",
                "pos": "adjective"
            },
            {
                "word": "the Agricultural Development and Advisory Service",
                "pos": ""
            },
            {
                "word": "agriculturalist",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "connected with the science or practice of farming",
                    "vi": "kết nối với khoa học hoặc thực hành nông nghiệp"
                },
                "examples": [
                    {
                        "en": "agricultural policy/land/production/development",
                        "vi": "chính sách nông nghiệp / đất đai / sản xuất / phát triển"
                    }
                ]
            }
        ]
    },
    {
        "id": "b0aeac1a023b4b248e9c144c99bc39d3",
        "word": "barley",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈbɑːli/",
            "us": "/ˈbɑːrli/"
        },
        "nearby": [
            {
                "word": "Ronnie Barker",
                "pos": ""
            },
            {
                "word": "barking mad",
                "pos": "adjective"
            },
            {
                "word": "barley",
                "pos": "noun"
            },
            {
                "word": "barley sugar",
                "pos": "noun"
            },
            {
                "word": "barley water",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a plant grown for its grain that is used for making food, beer and whisky; the grains of this plant",
                    "vi": "một loại cây được trồng để lấy hạt được sử dụng để làm thực phẩm, bia và rượu whisky; hạt của cây này"
                },
                "examples": [
                    {
                        "en": "Feed barley prices are set to rise.",
                        "vi": "Giá lúa mạch thức ăn sẽ tăng."
                    },
                    {
                        "en": "Malt whisky is made from malted barley.",
                        "vi": "Malt whisky được làm từ lúa mạch mạch nha."
                    }
                ]
            }
        ]
    },
    {
        "id": "485a6411dadc4f3faed8dfd52716df4f",
        "word": "cash crop",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈkæʃ krɒp/",
            "us": "/ˈkæʃ krɑːp/"
        },
        "nearby": [
            {
                "word": "cash card",
                "pos": "noun"
            },
            {
                "word": "cash cow",
                "pos": "noun"
            },
            {
                "word": "cash crop",
                "pos": "noun"
            },
            {
                "word": "cash desk",
                "pos": "noun"
            },
            {
                "word": "cash dispenser",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a crop grown for selling, rather than for use by the person who grows it",
                    "vi": "một loại cây trồng để bán chứ không phải để sử dụng cho người trồng nó"
                },
                "examples": [
                    {
                        "en": "Most farmers now produce cash crops such as coffee and tobacco for the export market.",
                        "vi": "Hầu hết nông dân hiện nay sản xuất các loại cây công nghiệp như cà phê và thuốc lá cho thị trường xuất khẩu."
                    },
                    {
                        "en": "the replacement of traditional crops with cash crops for export",
                        "vi": "việc thay thế cây trồng truyền thống bằng cây trồng xuất khẩu"
                    }
                ]
            }
        ]
    },
    {
        "id": "76aa6bb169dd4ce18f203dd8c40800ab",
        "word": "cultivate",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈkʌltɪveɪt/",
            "us": "/ˈkʌltɪveɪt/"
        },
        "nearby": [
            {
                "word": "cultivable",
                "pos": "adjective"
            },
            {
                "word": "cultivar",
                "pos": "noun"
            },
            {
                "word": "cultivate",
                "pos": "verb"
            },
            {
                "word": "cultivated",
                "pos": "adjective"
            },
            {
                "word": "cultivation",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to prepare and use land for growing plants or crops",
                    "vi": "chuẩn bị và sử dụng đất để trồng cây hoặc hoa màu"
                },
                "examples": [
                    {
                        "en": "The land around here has never been cultivated.",
                        "vi": "Đất quanh đây chưa từng được canh tác."
                    },
                    {
                        "en": "The land here has been intensively cultivated for generations.",
                        "vi": "Đất đai ở đây đã được thâm canh từ bao đời nay."
                    }
                ]
            },
            {
                "define": {
                    "en": "to grow plants or crops",
                    "vi": "để trồng cây hoặc hoa màu"
                },
                "examples": [
                    {
                        "en": "The people cultivate mainly rice and beans.",
                        "vi": "Người dân chủ yếu trồng lúa và đậu."
                    },
                    {
                        "en": "Olives have been cultivated successfully in southern Australia.",
                        "vi": "Ô liu đã được trồng thành công ở miền nam nước Úc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to try to get somebody’s friendship or support",
                    "vi": "để cố gắng có được tình bạn hoặc sự ủng hộ của ai đó"
                },
                "examples": [
                    {
                        "en": "He purposely tried to cultivate good relations with the press.",
                        "vi": "Anh cố tình vun đắp mối quan hệ tốt đẹp với báo giới."
                    },
                    {
                        "en": "It helps if you go out of your way to cultivate the local people.",
                        "vi": "Nó sẽ giúp ích nếu bạn đi ra khỏi con đường của bạn để trồng trọt người dân địa phương."
                    }
                ]
            },
            {
                "define": {
                    "en": "to develop an attitude, a way of talking or behaving, etc.",
                    "vi": "để phát triển một thái độ, một cách nói chuyện hoặc cư xử, v.v."
                },
                "examples": [
                    {
                        "en": "She cultivated an air of sophistication.",
                        "vi": "Cô ấy đã trau dồi một khí chất tinh tế."
                    },
                    {
                        "en": "This modern image is actively cultivated by the company.",
                        "vi": "Hình ảnh hiện đại này được công ty tích cực trau dồi."
                    }
                ]
            }
        ]
    },
    {
        "id": "1677d713777e4bea876a78b4fb4648fd",
        "word": "cultivation",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌkʌltɪˈveɪʃn/",
            "us": "/ˌkʌltɪˈveɪʃn/"
        },
        "nearby": [
            {
                "word": "cultivate",
                "pos": "verb"
            },
            {
                "word": "cultivated",
                "pos": "adjective"
            },
            {
                "word": "cultivation",
                "pos": "noun"
            },
            {
                "word": "cultivator",
                "pos": "noun"
            },
            {
                "word": "cult of personality",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the preparation and use of land for growing plants or crops",
                    "vi": "chuẩn bị và sử dụng đất để trồng cây hoặc hoa màu"
                },
                "examples": [
                    {
                        "en": "under cultivation fertile land that is under cultivation (= being cultivated)",
                        "vi": "dưới đất màu mỡ đang được canh tác (= đang được canh tác)"
                    },
                    {
                        "en": "rice/wheat cultivation",
                        "vi": "trồng lúa / lúa mì"
                    }
                ]
            },
            {
                "define": {
                    "en": "the deliberate development of a particular relationship, quality or skill",
                    "vi": "sự phát triển có chủ ý của một mối quan hệ, phẩm chất hoặc kỹ năng cụ thể"
                },
                "examples": [
                    {
                        "en": "the cultivation of a good relationship with local firms",
                        "vi": "xây dựng mối quan hệ tốt với các công ty địa phương"
                    }
                ]
            }
        ]
    },
    {
        "id": "f9daac1e2e65479db98723fb8db844ca",
        "word": "fertile",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈfɜːtaɪl/",
            "us": "/ˈfɜːrtl/"
        },
        "nearby": [
            {
                "word": "ferry boat",
                "pos": "noun"
            },
            {
                "word": "ferryman",
                "pos": "noun"
            },
            {
                "word": "fertile",
                "pos": "adjective"
            },
            {
                "word": "fertility",
                "pos": "noun"
            },
            {
                "word": "fertilization",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "that plants grow well in",
                    "vi": "rằng cây cối phát triển tốt trong"
                },
                "examples": [
                    {
                        "en": "a fertile region/valley",
                        "vi": "một vùng / thung lũng màu mỡ"
                    }
                ]
            },
            {
                "define": {
                    "en": "that can produce babies, young animals, fruit or new plants",
                    "vi": "có thể tạo ra trẻ sơ sinh, động vật non, trái cây hoặc cây mới"
                },
                "examples": [
                    {
                        "en": "The treatment has been tested on healthy fertile women under the age of 35.",
                        "vi": "Phương pháp điều trị đã được thử nghiệm trên những phụ nữ có khả năng sinh sản khỏe mạnh dưới 35 tuổi."
                    },
                    {
                        "en": "women who proved particularly fertile",
                        "vi": "những phụ nữ tỏ ra đặc biệt dễ thụ thai"
                    }
                ]
            },
            {
                "define": {
                    "en": "that produces good results; that encourages activity",
                    "vi": "điều đó tạo ra kết quả tốt; khuyến khích hoạt động"
                },
                "examples": [
                    {
                        "en": "a fertile partnership",
                        "vi": "một quan hệ đối tác màu mỡ"
                    },
                    {
                        "en": "The region at the time was fertile ground for revolutionary movements (= there were the necessary conditions for them to develop easily).",
                        "vi": "Khu vực này vào thời điểm đó là mảnh đất màu mỡ cho các phong trào cách mạng (= có những điều kiện cần thiết để họ phát triển dễ dàng)."
                    },
                    {
                        "en": "a fertile source of argument/dispute",
                        "vi": "một nguồn tranh luận / tranh chấp màu mỡ"
                    },
                    {
                        "en": "The fall of the old regime provided fertile ground for opportunism.",
                        "vi": "Sự sụp đổ của chế độ cũ đã tạo ra mảnh đất màu mỡ cho chủ nghĩa cơ hội."
                    }
                ]
            },
            {
                "define": {
                    "en": "that produces a lot of new ideas",
                    "vi": "tạo ra rất nhiều ý tưởng mới"
                },
                "examples": [
                    {
                        "en": "the product of a fertile imagination",
                        "vi": "sản phẩm của trí tưởng tượng phong phú"
                    },
                    {
                        "en": "the product of a fertile brain/mind",
                        "vi": "sản phẩm của một bộ não / trí óc phì nhiêu"
                    }
                ]
            }
        ]
    },
    {
        "id": "d9cdd6640b8145b5932dfadf53345e37",
        "word": "fertilization",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌfɜːtəlaɪˈzeɪʃn/",
            "us": "/ˌfɜːrtələˈzeɪʃn/"
        },
        "nearby": [
            {
                "word": "fertile",
                "pos": "adjective"
            },
            {
                "word": "fertility",
                "pos": "noun"
            },
            {
                "word": "fertilization",
                "pos": "noun"
            },
            {
                "word": "fertilize",
                "pos": "verb"
            },
            {
                "word": "fertilizer",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the process of fertilizing a plant or egg; the process of a plant or egg becoming fertilized",
                    "vi": "quá trình thụ tinh thực vật hoặc trứng; quá trình cây hoặc trứng được thụ tinh"
                },
                "examples": [
                    {
                        "en": "Immediately after fertilization, the cells of the egg divide.",
                        "vi": "Ngay sau khi thụ tinh, các tế bào của trứng phân chia."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of adding a substance to soil to make plants grow more successfully",
                    "vi": "hành động bổ sung một chất vào đất để làm cho cây phát triển thành công hơn"
                },
                "examples": [
                    {
                        "en": "the fertilization of soil with artificial chemicals",
                        "vi": "bón phân cho đất bằng các chất hóa học nhân tạo"
                    }
                ]
            }
        ]
    },
    {
        "id": "daad982f0ea548d1995ac8e7daa06704",
        "word": "fertilize",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈfɜːtəlaɪz/",
            "us": "/ˈfɜːrtəlaɪz/"
        },
        "nearby": [
            {
                "word": "fertility",
                "pos": "noun"
            },
            {
                "word": "fertilization",
                "pos": "noun"
            },
            {
                "word": "fertilize",
                "pos": "verb"
            },
            {
                "word": "fertilizer",
                "pos": "noun"
            },
            {
                "word": "fervent",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to put pollen into a plant so that a seed develops; to join sperm with an egg so that a baby or young animal develops",
                    "vi": "đưa phấn hoa vào cây để hạt phát triển; kết hợp tinh trùng với trứng để con non hoặc con non phát triển"
                },
                "examples": [
                    {
                        "en": "Flowers are often fertilized by bees as they gather nectar.",
                        "vi": "Hoa thường được ong bón phân khi chúng thu thập mật hoa."
                    },
                    {
                        "en": "a fertilized egg",
                        "vi": "một quả trứng được thụ tinh"
                    }
                ]
            },
            {
                "define": {
                    "en": "to add a substance to soil to make plants grow more successfully",
                    "vi": "bổ sung chất vào đất để cây phát triển thành công hơn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "5d3a7d80c87d4e58ba2ac20e45bc4fdb",
        "word": "fertilizer",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈfɜːtəlaɪzə(r)/",
            "us": "/ˈfɜːrtəlaɪzər/"
        },
        "nearby": [
            {
                "word": "fertilization",
                "pos": "noun"
            },
            {
                "word": "fertilize",
                "pos": "verb"
            },
            {
                "word": "fertilizer",
                "pos": "noun"
            },
            {
                "word": "fervent",
                "pos": "adjective"
            },
            {
                "word": "fervently",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a substance added to soil to make plants grow more successfully",
                    "vi": "một chất được thêm vào đất để làm cho cây phát triển thành công hơn"
                },
                "examples": [
                    {
                        "en": "artificial/chemical fertilizers",
                        "vi": "phân bón nhân tạo / hóa học"
                    },
                    {
                        "en": "liquid fertilizer",
                        "vi": "phân bón lỏng"
                    },
                    {
                        "en": "a bag of fertilizer",
                        "vi": "một bao phân bón"
                    },
                    {
                        "en": "He spread fertilizer on the field with a rake.",
                        "vi": "Anh rải phân trên ruộng bằng một cái cào."
                    }
                ]
            }
        ]
    },
    {
        "id": "d8887011c3e848afaaf00900ddf6e4fe",
        "word": "harvest",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈhɑːvɪst/",
            "us": "/ˈhɑːrvɪst/"
        },
        "nearby": [
            {
                "word": "the Harvard classics",
                "pos": "noun"
            },
            {
                "word": "Harvard University",
                "pos": ""
            },
            {
                "word": "harvest",
                "pos": "noun"
            },
            {
                "word": "harvest",
                "pos": "verb"
            },
            {
                "word": "harvester",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the time of year when the crops are gathered in on a farm, etc.; the act of cutting and gathering crops",
                    "vi": "thời gian trong năm khi cây trồng được tập trung trong một trang trại, v.v ...; hành động chặt và thu lượm cây trồng"
                },
                "examples": [
                    {
                        "en": "harvest time",
                        "vi": "mùa thu hoach"
                    },
                    {
                        "en": "Farmers are extremely busy during the harvest.",
                        "vi": "Người nông dân vô cùng bận rộn trong vụ thu hoạch."
                    }
                ]
            },
            {
                "define": {
                    "en": "the crops, or the amount of crops, cut and gathered",
                    "vi": "cây trồng, hoặc số lượng cây trồng, cắt và thu gom"
                },
                "examples": [
                    {
                        "en": "the grain harvest",
                        "vi": "thu hoạch ngũ cốc"
                    },
                    {
                        "en": "a good/bad harvest (= a lot of crops or few crops)",
                        "vi": "một vụ thu hoạch tốt / xấu (= nhiều vụ mùa hoặc ít vụ mùa)"
                    },
                    {
                        "en": "(figurative) The appeal produced a rich harvest of blankets, medicines and clothing.",
                        "vi": "(nghĩa bóng) Lời kêu gọi đã tạo ra một vụ thu hoạch dồi dào từ chăn màn, thuốc men và quần áo."
                    },
                    {
                        "en": "Plum growers say they are expecting a bumper harvest (= a large amount of produce) this year.",
                        "vi": "Những người trồng mận cho biết họ đang mong đợi một vụ thu hoạch bội thu (= một lượng lớn sản lượng) trong năm nay."
                    }
                ]
            },
            {
                "define": {
                    "en": "to benefit or suffer as a direct result of something that you have done",
                    "vi": "được hưởng lợi hoặc bị thiệt hại do kết quả trực tiếp của việc bạn đã làm"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "6aa9f521af0445898b000e7611b58dfe",
        "word": "harvest",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈhɑːvɪst/",
            "us": "/ˈhɑːrvɪst/"
        },
        "nearby": [
            {
                "word": "Harvard University",
                "pos": ""
            },
            {
                "word": "harvest",
                "pos": "noun"
            },
            {
                "word": "harvest",
                "pos": "verb"
            },
            {
                "word": "harvester",
                "pos": "noun"
            },
            {
                "word": "harvest festival",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to cut and gather a crop; to catch a number of animals or fish to eat",
                    "vi": "để cắt và thu thập một loại cây trồng; bắt một số động vật hoặc cá để ăn"
                },
                "examples": [
                    {
                        "en": "The nuts are ready to harvest in September.",
                        "vi": "Các loại hạt đã sẵn sàng để thu hoạch vào tháng Chín."
                    },
                    {
                        "en": "In the US, more than 130 000 tons of live oysters are harvested each year.",
                        "vi": "Ở Mỹ, hơn 130 000 tấn hàu sống được thu hoạch mỗi năm."
                    },
                    {
                        "en": "Winter wheat is harvested in late July and early August.",
                        "vi": "Lúa mì mùa đông được thu hoạch vào cuối tháng Bảy và đầu tháng Tám."
                    }
                ]
            },
            {
                "define": {
                    "en": "to collect cells or tissue from somebody’s body for use in medical experiments or operations",
                    "vi": "để thu thập các tế bào hoặc mô từ cơ thể của ai đó để sử dụng trong các thí nghiệm hoặc hoạt động y tế"
                },
                "examples": [
                    {
                        "en": "She had her eggs harvested and frozen for her own future use.",
                        "vi": "Cô đã thu hoạch trứng và đông lạnh để sử dụng trong tương lai."
                    }
                ]
            }
        ]
    },
    {
        "id": "760b0bf68ffa4bf8956120395e6e55d0",
        "word": "hay",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/heɪ/",
            "us": "/heɪ/"
        },
        "nearby": [
            {
                "word": "hawthorn",
                "pos": "noun"
            },
            {
                "word": "Nathaniel Hawthorne",
                "pos": ""
            },
            {
                "word": "hay",
                "pos": "noun"
            },
            {
                "word": "Hay diet",
                "pos": "noun"
            },
            {
                "word": "Joseph Haydn",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "grass that has been cut and dried and is used as food for animals",
                    "vi": "cỏ đã được cắt và phơi khô dùng làm thức ăn cho động vật"
                },
                "examples": [
                    {
                        "en": "a bale of hay",
                        "vi": "một kiện cỏ khô"
                    }
                ]
            },
            {
                "define": {
                    "en": "a small amount of money",
                    "vi": "một số tiền nhỏ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to go to bed",
                    "vi": "để đi ngủ"
                },
                "examples": [
                    {
                        "en": "I decided to hit the sack and have an early night.",
                        "vi": "Tôi quyết định đánh bao tải và có một đêm sớm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make good use of opportunities, good conditions, etc. while they last",
                    "vi": "để tận dụng tốt các cơ hội, điều kiện tốt, v.v. trong khi chúng kéo dài"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "an act of having sex with somebody",
                    "vi": "một hành động quan hệ tình dục với ai đó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "7f0c338d1f6644dd8d566591be86ef2d",
        "word": "insecticide",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ɪnˈsektɪsaɪd/",
            "us": "/ɪnˈsektɪsaɪd/"
        },
        "nearby": [
            {
                "word": "insect",
                "pos": "noun"
            },
            {
                "word": "insecticidal",
                "pos": "adjective"
            },
            {
                "word": "insecticide",
                "pos": "noun"
            },
            {
                "word": "insectivore",
                "pos": "noun"
            },
            {
                "word": "insectivorous",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a chemical used for killing insects",
                    "vi": "một loại hóa chất dùng để diệt côn trùng"
                },
                "examples": [
                    {
                        "en": "crops sprayed with insecticides",
                        "vi": "cây trồng bị phun thuốc trừ sâu"
                    }
                ]
            }
        ]
    },
    {
        "id": "0cc987f117ee4a488b19fa0601c7a2d0",
        "word": "maize",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/meɪz/",
            "us": "/meɪz/"
        },
        "nearby": [
            {
                "word": "maisonette",
                "pos": "noun"
            },
            {
                "word": "maître d'",
                "pos": "noun"
            },
            {
                "word": "maize",
                "pos": "noun"
            },
            {
                "word": "Maj.",
                "pos": "abbreviation"
            },
            {
                "word": "majestic",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a tall plant grown for its large yellow grains that are used for making flour or eaten as a vegetable; the grains of this plant",
                    "vi": "một loại cây cao được trồng để lấy hạt lớn màu vàng được dùng để làm bột hoặc ăn như một loại rau; hạt của cây này"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a type of corn (maize) with large brown and yellow grains, not usually eaten but sometimes used to make decorations, for example at Thanksgiving",
                    "vi": "một loại ngô (ngô) có hạt lớn màu nâu và vàng, thường không được ăn nhưng đôi khi được dùng để làm đồ trang trí, ví dụ như trong Lễ tạ ơn."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "e7f6d6b9b9f84ae5bb65aa35bf4bbc31",
        "word": "pest",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/pest/",
            "us": "/pest/"
        },
        "nearby": [
            {
                "word": "pessimistic",
                "pos": "adjective"
            },
            {
                "word": "pessimistically",
                "pos": "adverb"
            },
            {
                "word": "pest",
                "pos": "noun"
            },
            {
                "word": "PEST analysis",
                "pos": "noun"
            },
            {
                "word": "pester",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an insect or animal that destroys plants, food, etc.",
                    "vi": "côn trùng hoặc động vật phá hoại thực vật, thực phẩm, v.v."
                },
                "examples": [
                    {
                        "en": "insect/plant/garden pests",
                        "vi": "côn trùng / cây / vườn gây hại"
                    },
                    {
                        "en": "a pest control officer",
                        "vi": "một nhân viên kiểm soát dịch hại"
                    },
                    {
                        "en": "These birds provide a useful function in controlling insect pests.",
                        "vi": "Những con chim này cung cấp một chức năng hữu ích trong việc kiểm soát côn trùng gây hại."
                    }
                ]
            },
            {
                "define": {
                    "en": "an annoying person or thing",
                    "vi": "một người hay một thứ khó chịu"
                },
                "examples": [
                    {
                        "en": "That child is being a real pest.",
                        "vi": "Đứa trẻ đó là một sinh vật gây hại thực sự."
                    },
                    {
                        "en": "Ex-colleagues describe him as a sex pest.",
                        "vi": "Các đồng nghiệp cũ mô tả anh ta như một kẻ gây hại tình dục."
                    }
                ]
            }
        ]
    },
    {
        "id": "6ccebd264b3c446a9a0bd83ad1212a08",
        "word": "planter",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈplɑːntə(r)/",
            "us": "/ˈplæntər/"
        },
        "nearby": [
            {
                "word": "plantation",
                "pos": "noun"
            },
            {
                "word": "plant-based",
                "pos": "adjective"
            },
            {
                "word": "planter",
                "pos": "noun"
            },
            {
                "word": "planter's punch",
                "pos": "noun"
            },
            {
                "word": "planting",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an attractive container to grow a plant in",
                    "vi": "một thùng chứa hấp dẫn để trồng cây trong"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a person who owns or manages a plantation in a tropical country",
                    "vi": "một người sở hữu hoặc quản lý một đồn điền ở một nước nhiệt đới"
                },
                "examples": [
                    {
                        "en": "a tea planter",
                        "vi": "một người trồng chè"
                    }
                ]
            },
            {
                "define": {
                    "en": "a machine that plants seeds, etc.",
                    "vi": "máy gieo hạt, v.v."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "941d6b6e5cf646518e03cd1490d4b383",
        "word": "productive",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/prəˈdʌktɪv/",
            "us": "/prəˈdʌktɪv/"
        },
        "nearby": [
            {
                "word": "production number",
                "pos": "noun"
            },
            {
                "word": "production values",
                "pos": "noun"
            },
            {
                "word": "productive",
                "pos": "adjective"
            },
            {
                "word": "productively",
                "pos": "adverb"
            },
            {
                "word": "productivity",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "making goods or growing crops, especially in large quantities",
                    "vi": "làm hàng hóa hoặc trồng trọt, đặc biệt là với số lượng lớn"
                },
                "examples": [
                    {
                        "en": "highly productive farming land",
                        "vi": "đất canh tác năng suất cao"
                    },
                    {
                        "en": "productive workers",
                        "vi": "lao động sản xuất"
                    },
                    {
                        "en": "The aim was to maximize the machine’s productive capacity.",
                        "vi": "Mục đích là để tối đa hóa công suất sản xuất của máy."
                    },
                    {
                        "en": "The bush must be pruned to remain productive.",
                        "vi": "Cây bụi phải được cắt tỉa để duy trì năng suất."
                    }
                ]
            },
            {
                "define": {
                    "en": "doing or achieving a lot",
                    "vi": "làm hoặc đạt được rất nhiều"
                },
                "examples": [
                    {
                        "en": "a productive meeting",
                        "vi": "một cuộc họp hiệu quả"
                    },
                    {
                        "en": "My time spent in the library was very productive.",
                        "vi": "Thời gian của tôi trong thư viện rất hiệu quả."
                    }
                ]
            },
            {
                "define": {
                    "en": "resulting in something or causing something",
                    "vi": "dẫn đến một cái gì đó hoặc gây ra một cái gì đó"
                },
                "examples": [
                    {
                        "en": "a play productive of the strongest emotions",
                        "vi": "một vở kịch mang lại những cảm xúc mạnh mẽ nhất"
                    }
                ]
            }
        ]
    },
    {
        "id": "0acfe2915aa7427d90525ded59dc8c62",
        "word": "reap",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/riːp/",
            "us": "/riːp/"
        },
        "nearby": [
            {
                "word": "ream out",
                "pos": "phrasal verb"
            },
            {
                "word": "reanimate",
                "pos": "verb"
            },
            {
                "word": "reap",
                "pos": "verb"
            },
            {
                "word": "reaper",
                "pos": "noun"
            },
            {
                "word": "reappear",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to obtain something, especially something good, as a direct result of something that you have done",
                    "vi": "để đạt được một cái gì đó, đặc biệt là một cái gì đó tốt, là kết quả trực tiếp của một cái gì đó mà bạn đã làm"
                },
                "examples": [
                    {
                        "en": "They are now reaping the rewards of all their hard work.",
                        "vi": "Bây giờ họ đang gặt hái được thành quả cho tất cả công việc khó khăn của họ."
                    },
                    {
                        "en": "The company reaped rich dividends with its new strategy for packaging holidays.",
                        "vi": "Công ty đã thu được lợi tức dồi dào với chiến lược mới về đóng gói các ngày lễ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to cut and collect a crop, especially wheat, from a field",
                    "vi": "cắt và thu hái một loại cây trồng, đặc biệt là lúa mì, từ một cánh đồng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to benefit or suffer as a direct result of something that you have done",
                    "vi": "được hưởng lợi hoặc bị thiệt hại do kết quả trực tiếp của việc bạn đã làm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "you have to deal with the bad effects or results of something that you originally started",
                    "vi": "bạn phải đối phó với những tác động xấu hoặc kết quả của điều gì đó mà bạn đã bắt đầu"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "0c3c83cc57624fc399d254a8a5dceb5f",
        "word": "ripe",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/raɪp/",
            "us": "/raɪp/"
        },
        "nearby": [
            {
                "word": "ripcord",
                "pos": "noun"
            },
            {
                "word": "rip current",
                "pos": "noun"
            },
            {
                "word": "ripe",
                "pos": "adjective"
            },
            {
                "word": "ripen",
                "pos": "verb"
            },
            {
                "word": "ripeness",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "fully grown and ready to be eaten",
                    "vi": "phát triển hoàn toàn và sẵn sàng để ăn"
                },
                "examples": [
                    {
                        "en": "Pick the tomatoes before they get too ripe.",
                        "vi": "Chọn cà chua trước khi chúng quá chín."
                    }
                ]
            },
            {
                "define": {
                    "en": "having a taste that has fully developed",
                    "vi": "có một hương vị đã phát triển đầy đủ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "strong and unpleasant",
                    "vi": "mạnh mẽ và khó chịu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "ready or suitable for something to happen",
                    "vi": "sẵn sàng hoặc thích hợp cho điều gì đó xảy ra"
                },
                "examples": [
                    {
                        "en": "This land is ripe for development.",
                        "vi": "Vùng đất này đã chín muồi để phát triển."
                    },
                    {
                        "en": "The conditions were ripe for social change.",
                        "vi": "Các điều kiện đã chín muồi cho sự thay đổi xã hội."
                    },
                    {
                        "en": "Reforms were promised when the time was ripe.",
                        "vi": "Những cải cách đã được hứa hẹn khi thời cơ chín muồi."
                    }
                ]
            },
            {
                "define": {
                    "en": "offering somebody an ideal opportunity to gain an advantage",
                    "vi": "cung cấp cho ai đó một cơ hội lý tưởng để đạt được lợi thế"
                },
                "examples": [
                    {
                        "en": "This is an opportunity ripe for the picking.",
                        "vi": "Đây là thời cơ chín muồi để hái."
                    },
                    {
                        "en": "The Raiders' defense is ripe for the picking.",
                        "vi": "Hàng phòng thủ của Raiders đã chín muồi."
                    }
                ]
            },
            {
                "define": {
                    "en": "an age that is considered to be very old",
                    "vi": "tuổi được coi là rất già"
                },
                "examples": [
                    {
                        "en": "He lived to the ripe old age of 91.",
                        "vi": "Ông sống đến 91 tuổi."
                    }
                ]
            }
        ]
    },
    {
        "id": "b7a3bfac86aa4d50834264a810496945",
        "word": "rotation",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/rəʊˈteɪʃn/",
            "us": "/rəʊˈteɪʃn/"
        },
        "nearby": [
            {
                "word": "rotate",
                "pos": "verb"
            },
            {
                "word": "rotating",
                "pos": "adjective"
            },
            {
                "word": "rotation",
                "pos": "noun"
            },
            {
                "word": "rotational",
                "pos": "adjective"
            },
            {
                "word": "Rotavator",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the action of an object moving in a circle around a central fixed point",
                    "vi": "hành động của một đối tượng chuyển động trong một đường tròn xung quanh một điểm cố định ở giữa"
                },
                "examples": [
                    {
                        "en": "the daily rotation of the earth on its axis",
                        "vi": "sự quay hàng ngày của trái đất trên trục của nó"
                    },
                    {
                        "en": "the earth's rotation around the sun",
                        "vi": "vòng quay của trái đất quanh mặt trời"
                    }
                ]
            },
            {
                "define": {
                    "en": "one complete movement in a circle around a fixed point",
                    "vi": "một chuyển động hoàn chỉnh trong một vòng tròn xung quanh một điểm cố định"
                },
                "examples": [
                    {
                        "en": "This switch controls the number of rotations per minute.",
                        "vi": "Công tắc này kiểm soát số vòng quay mỗi phút."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of regularly changing the thing that is being used in a particular situation, or of changing the person who does a particular job",
                    "vi": "hành động thường xuyên thay đổi thứ đang được sử dụng trong một tình huống cụ thể hoặc thay đổi người thực hiện một công việc cụ thể"
                },
                "examples": [
                    {
                        "en": "crop rotation/the rotation of crops (= changing the crop that is grown on an area of land in order to protect the soil)",
                        "vi": "luân canh / luân canh cây trồng (= thay đổi cây trồng được trồng trên một diện tích đất để bảo vệ đất)"
                    },
                    {
                        "en": "job rotation (= the practice of regularly changing the job that a particular person does so that they become experienced in different areas)",
                        "vi": "luân chuyển công việc (= việc thường xuyên thay đổi công việc mà một người cụ thể làm để họ trở nên có kinh nghiệm trong các lĩnh vực khác nhau)"
                    },
                    {
                        "en": "in rotation Wheat, maize and sugar beet are planted in rotation.",
                        "vi": "luân canh Lúa mì, ngô và củ cải đường được trồng luân canh."
                    },
                    {
                        "en": "The committee is chaired by all the members in rotation.",
                        "vi": "Ủy ban do tất cả các thành viên luân phiên làm chủ tịch."
                    }
                ]
            }
        ]
    },
    {
        "id": "57d7556cacf74cc2adb55e4e1bfcf28b",
        "word": "soya",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈsɔɪə/",
            "us": "/ˈsɔɪə/"
        },
        "nearby": [
            {
                "word": "sow2",
                "pos": "noun"
            },
            {
                "word": "sower",
                "pos": "noun"
            },
            {
                "word": "soya",
                "pos": "noun"
            },
            {
                "word": "soya bean",
                "pos": "noun"
            },
            {
                "word": "soya milk",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the plant on which soya beans grow; the food obtained from soya beans",
                    "vi": "cây đậu nành mọc trên đó; thức ăn thu được từ đậu nành"
                },
                "examples": [
                    {
                        "en": "a soya crop",
                        "vi": "một cây trồng đậu nành"
                    },
                    {
                        "en": "soya flour",
                        "vi": "bột đậu nành"
                    }
                ]
            }
        ]
    },
    {
        "id": "091df602d6a0447c86eb6527c7a4df68",
        "word": "spray",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/spreɪ/",
            "us": "/spreɪ/"
        },
        "nearby": [
            {
                "word": "sprawling",
                "pos": "adjective"
            },
            {
                "word": "spray",
                "pos": "noun"
            },
            {
                "word": "spray",
                "pos": "verb"
            },
            {
                "word": "spray can",
                "pos": "noun"
            },
            {
                "word": "sprayer",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to cover somebody/something with very small drops of a liquid that are forced out of a container or sent through the air",
                    "vi": "để che ai đó / cái gì đó bằng những giọt chất lỏng rất nhỏ bị đẩy ra khỏi thùng chứa hoặc bay qua không khí"
                },
                "examples": [
                    {
                        "en": "spray (something) (on/onto/over somebody/something) Spray the conditioner onto your wet hair.",
                        "vi": "xịt (cái gì đó) (trên / lên / trên ai đó / cái gì đó) Xịt dầu dưỡng lên tóc ướt của bạn."
                    },
                    {
                        "en": "Champagne sprayed everywhere.",
                        "vi": "Sâm panh phun khắp nơi."
                    },
                    {
                        "en": "spray somebody/something (with something) The crops are regularly sprayed with pesticide.",
                        "vi": "phun ai đó / cái gì đó (với cái gì đó) Các loại cây trồng thường xuyên được phun thuốc trừ sâu."
                    },
                    {
                        "en": "spray something + adj. She's had the car sprayed blue.",
                        "vi": "xịt cái gì đó + adj. Cô ấy đã xịt cái xe màu xanh lam."
                    }
                ]
            },
            {
                "define": {
                    "en": "to cover somebody/something with a lot of small things with a lot of force",
                    "vi": "để che ai đó / cái gì đó bằng rất nhiều thứ nhỏ với rất nhiều lực"
                },
                "examples": [
                    {
                        "en": "spray somebody/something with something The gunman sprayed the building with bullets.",
                        "vi": "xịt ai đó / cái gì đó bằng thứ gì đó Tay súng đã xịt đạn vào tòa nhà."
                    },
                    {
                        "en": "+ adv./prep. Pieces of glass sprayed all over the room.",
                        "vi": "Err:509"
                    }
                ]
            },
            {
                "define": {
                    "en": "to leave small amounts of urine to mark its own area",
                    "vi": "để lại một lượng nhỏ nước tiểu để đánh dấu khu vực riêng của nó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c4761c6542b94207bb7bc7ebc5bcbe36",
        "word": "sugar cane",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈʃʊɡə keɪn/",
            "us": "/ˈʃʊɡər keɪn/"
        },
        "nearby": [
            {
                "word": "sugar",
                "pos": "exclamation"
            },
            {
                "word": "sugar beet",
                "pos": "noun"
            },
            {
                "word": "sugar cane",
                "pos": "noun"
            },
            {
                "word": "sugar-coat",
                "pos": "verb"
            },
            {
                "word": "sugar-coated",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a tall tropical plant with thick stems from which sugar is made",
                    "vi": "một loại cây nhiệt đới cao với thân dày làm đường"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "6288504504604b35892e46e91a8ab781",
        "word": "topsoil",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈtɒpsɔɪl/",
            "us": "/ˈtɑːpsɔɪl/"
        },
        "nearby": [
            {
                "word": "Topshop",
                "pos": ""
            },
            {
                "word": "topside",
                "pos": "noun"
            },
            {
                "word": "topsoil",
                "pos": "noun"
            },
            {
                "word": "topspin",
                "pos": "noun"
            },
            {
                "word": "Topsy",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the layer of soil nearest the surface of the ground",
                    "vi": "lớp đất gần nhất với bề mặt của mặt đất"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "6a0d50b399c04accb23db97d0f47a04a",
        "word": "vineyard",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈvɪnjəd/",
            "us": "/ˈvɪnjərd/"
        },
        "nearby": [
            {
                "word": "vinegar",
                "pos": "noun"
            },
            {
                "word": "vinegary",
                "pos": "adjective"
            },
            {
                "word": "vineyard",
                "pos": "noun"
            },
            {
                "word": "viniculture",
                "pos": "noun"
            },
            {
                "word": "Vinland",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a piece of land where grapes are grown in order to produce wine; a business that produces wine from the grapes it grows in a vineyard",
                    "vi": "một mảnh đất trồng nho để sản xuất rượu vang; một doanh nghiệp sản xuất rượu vang từ nho mà nó trồng trong một vườn nho"
                },
                "examples": [
                    {
                        "en": "Dutch settlers planted the first vineyard when they arrived in 1652.",
                        "vi": "Những người định cư Hà Lan đã trồng vườn nho đầu tiên khi họ đến vào năm 1652."
                    }
                ]
            }
        ]
    },
    {
        "id": "2ddcf5b7fb77409e8e7ad8dce90b0620",
        "word": "yield",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/jiːld/",
            "us": "/jiːld/"
        },
        "nearby": [
            {
                "word": "Yiddish",
                "pos": "adjective"
            },
            {
                "word": "Yiddish",
                "pos": "noun"
            },
            {
                "word": "yield",
                "pos": "noun"
            },
            {
                "word": "yield",
                "pos": "verb"
            },
            {
                "word": "yielding",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the total amount of crops, profits, etc. that are produced",
                    "vi": "tổng số lượng cây trồng, lợi nhuận, v.v. được sản xuất"
                },
                "examples": [
                    {
                        "en": "a high crop yield",
                        "vi": "năng suất cây trồng cao"
                    },
                    {
                        "en": "a reduction in milk yield",
                        "vi": "giảm sản lượng sữa"
                    },
                    {
                        "en": "This will give a yield of 10% on your investment.",
                        "vi": "Điều này sẽ mang lại lợi nhuận 10% cho khoản đầu tư của bạn."
                    }
                ]
            }
        ]
    },
    {
        "id": "0ec6cd237b5b4d958aad6703fd99e2fc",
        "word": "yield",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/jiːld/",
            "us": "/jiːld/"
        },
        "nearby": [
            {
                "word": "Yiddish",
                "pos": "noun"
            },
            {
                "word": "yield",
                "pos": "noun"
            },
            {
                "word": "yield",
                "pos": "verb"
            },
            {
                "word": "yielding",
                "pos": "adjective"
            },
            {
                "word": "yield to",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to produce or provide something, for example a profit, result or crop",
                    "vi": "để sản xuất hoặc cung cấp thứ gì đó, ví dụ như lợi nhuận, kết quả hoặc vụ mùa"
                },
                "examples": [
                    {
                        "en": "Higher-rate deposit accounts yield good returns.",
                        "vi": "Các tài khoản tiền gửi có lãi suất cao hơn sẽ mang lại lợi nhuận tốt."
                    },
                    {
                        "en": "The research has yielded useful information.",
                        "vi": "Nghiên cứu đã mang lại thông tin hữu ích."
                    },
                    {
                        "en": "These trees no longer yield fruit.",
                        "vi": "Những cây này không còn kết trái."
                    },
                    {
                        "en": "The project is expected to yield good returns in future.",
                        "vi": "Dự án được kỳ vọng sẽ mang lại lợi nhuận tốt trong tương lai."
                    }
                ]
            },
            {
                "define": {
                    "en": "to stop resisting something/somebody; to agree to do something that you do not want to do",
                    "vi": "để ngừng chống lại cái gì đó / ai đó; đồng ý làm điều gì đó mà bạn không muốn làm"
                },
                "examples": [
                    {
                        "en": "After a long siege, the town was forced to yield.",
                        "vi": "Sau một thời gian dài bị bao vây, thị trấn buộc phải nhượng bộ."
                    },
                    {
                        "en": "yield to something/somebody He reluctantly yielded to their demands.",
                        "vi": "nhượng bộ cái gì đó / ai đó Anh ấy miễn cưỡng nhượng bộ những yêu cầu của họ."
                    },
                    {
                        "en": "I yielded to temptation and had a chocolate bar.",
                        "vi": "Tôi đầu hàng trước sự cám dỗ và có một thanh sô cô la."
                    }
                ]
            },
            {
                "define": {
                    "en": "to allow somebody to win, have or take control of something that has been yours until now",
                    "vi": "để cho phép ai đó giành được, có hoặc kiểm soát thứ gì đó đã từng là của bạn cho đến bây giờ"
                },
                "examples": [
                    {
                        "en": "He refused to yield up his gun.",
                        "vi": "Anh ta không chịu đầu hàng súng của mình."
                    },
                    {
                        "en": "(figurative) The universe is slowly yielding up its secrets.",
                        "vi": "(nghĩa bóng) Vũ trụ đang dần tiết lộ những bí mật của nó."
                    },
                    {
                        "en": "archaeological remains which are yielding up secrets from long ago",
                        "vi": "di tích khảo cổ học tiết lộ bí mật từ lâu"
                    }
                ]
            },
            {
                "define": {
                    "en": "to move, bend or break because of pressure",
                    "vi": "di chuyển, uốn cong hoặc gãy vì áp lực"
                },
                "examples": [
                    {
                        "en": "Despite our attempts to break it, the lock would not yield.",
                        "vi": "Bất chấp những nỗ lực của chúng tôi để phá nó, chiếc khóa vẫn không thành công."
                    }
                ]
            },
            {
                "define": {
                    "en": "to allow vehicles on a bigger road to go first",
                    "vi": "để cho phép các phương tiện trên đường lớn hơn đi trước"
                },
                "examples": [
                    {
                        "en": "Yield to oncoming traffic.",
                        "vi": "Nhường đường cho phương tiện giao thông đang tới."
                    },
                    {
                        "en": "a yield sign",
                        "vi": "một dấu hiệu năng suất"
                    }
                ]
            }
        ]
    },
    {
        "id": "206f404641d44674b203777348758012",
        "word": "arable",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈærəbl/",
            "us": "/ˈærəbl/"
        },
        "nearby": [
            {
                "word": "arabica",
                "pos": "noun"
            },
            {
                "word": "Arabic numeral",
                "pos": "noun"
            },
            {
                "word": "arable",
                "pos": "adjective"
            },
            {
                "word": "arachnid",
                "pos": "noun"
            },
            {
                "word": "arachnophobia",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "connected with growing crops such as wheat",
                    "vi": "kết nối với các loại cây trồng như lúa mì"
                },
                "examples": [
                    {
                        "en": "arable farming/farms/crops",
                        "vi": "canh tác / trang trại / cây trồng"
                    },
                    {
                        "en": "arable land/fields (= used or suitable for growing crops)",
                        "vi": "đất canh tác / ruộng (= được sử dụng hoặc thích hợp để trồng trọt)"
                    }
                ]
            }
        ]
    },
    {
        "id": "4a566412821f457ba7c7e6b72614b38b",
        "word": "bale",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/beɪl/",
            "us": "/beɪl/"
        },
        "nearby": [
            {
                "word": "Stanley Baldwin",
                "pos": ""
            },
            {
                "word": "baldy",
                "pos": "noun"
            },
            {
                "word": "bale",
                "pos": "noun"
            },
            {
                "word": "bale",
                "pos": "verb"
            },
            {
                "word": "baleful",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a large amount of a light material pressed tightly together and tied up",
                    "vi": "một lượng lớn vật liệu nhẹ được ép chặt vào nhau và buộc lại"
                },
                "examples": [
                    {
                        "en": "bales of hay/straw/cotton/wool",
                        "vi": "kiện cỏ khô / rơm / bông / len"
                    }
                ]
            }
        ]
    },
    {
        "id": "2525b1cabd4f4b67b838213c9b87037e",
        "word": "beet",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/biːt/",
            "us": "/biːt/"
        },
        "nearby": [
            {
                "word": "beery",
                "pos": "adjective"
            },
            {
                "word": "beeswax",
                "pos": "noun"
            },
            {
                "word": "beet",
                "pos": "noun"
            },
            {
                "word": "beetle",
                "pos": "noun"
            },
            {
                "word": "beetle",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a plant with a root that is used as a vegetable, especially for feeding animals or making sugar",
                    "vi": "một loại cây có rễ được dùng làm rau, đặc biệt để cho gia súc ăn hoặc làm đường"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a plant with a round dark red root that is cooked and eaten as a vegetable",
                    "vi": "một loại cây có củ tròn màu đỏ sẫm được nấu chín và ăn như một loại rau"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "378a4c4d38634ffd8bdabd688b027106",
        "word": "blight",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/blaɪt/",
            "us": "/blaɪt/"
        },
        "nearby": [
            {
                "word": "Captain William Bligh",
                "pos": ""
            },
            {
                "word": "blight",
                "pos": "verb"
            },
            {
                "word": "blight",
                "pos": "noun"
            },
            {
                "word": "blighter",
                "pos": "noun"
            },
            {
                "word": "Blighty",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "any disease that kills plants, especially crops",
                    "vi": "bất kỳ bệnh nào làm chết cây trồng, đặc biệt là cây trồng"
                },
                "examples": [
                    {
                        "en": "potato blight",
                        "vi": "bệnh cháy lá khoai tây"
                    },
                    {
                        "en": "Many areas have been devastated by blights which destroyed cereal crops and vines.",
                        "vi": "Nhiều khu vực đã bị tàn phá bởi bệnh cháy lá phá hủy cây ngũ cốc và cây nho."
                    }
                ]
            },
            {
                "define": {
                    "en": "something that has a bad effect on a situation, a person’s life or the environment",
                    "vi": "thứ gì đó có ảnh hưởng xấu đến hoàn cảnh, cuộc sống của con người hoặc môi trường"
                },
                "examples": [
                    {
                        "en": "His death cast a blight on the whole of that year.",
                        "vi": "Cái chết của anh ấy đã làm tiêu tan cả năm đó."
                    },
                    {
                        "en": "urban blight (= areas in a city that are ugly or not cared for well)",
                        "vi": "bạc màu đô thị (= các khu vực trong thành phố xấu hoặc không được chăm sóc tốt)"
                    },
                    {
                        "en": "Her divorce was a great blight on her life.",
                        "vi": "Cuộc ly hôn của cô là một dấu ấn lớn trong cuộc đời cô."
                    }
                ]
            }
        ]
    },
    {
        "id": "6c521d62bfc643bb98cfda0c2e0bbd3c",
        "word": "buckwheat",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbʌkwiːt/",
            "us": "/ˈbʌkwiːt/"
        },
        "nearby": [
            {
                "word": "buck-toothed",
                "pos": "adjective"
            },
            {
                "word": "buck up",
                "pos": "phrasal verb"
            },
            {
                "word": "buckwheat",
                "pos": "noun"
            },
            {
                "word": "buckyballs",
                "pos": "noun"
            },
            {
                "word": "bucolic",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "small dark seed that is grown as food for animals and for making flour",
                    "vi": "hạt nhỏ sẫm màu được trồng làm thức ăn cho động vật và làm bột mì"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "6d74905ba100428e9360f38bf9b56792",
        "word": "canola",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/kəˈnəʊlə/",
            "us": "/kəˈnəʊlə/"
        },
        "nearby": [
            {
                "word": "canoeing",
                "pos": "noun"
            },
            {
                "word": "canoeist",
                "pos": "noun"
            },
            {
                "word": "canola",
                "pos": "noun"
            },
            {
                "word": "canon",
                "pos": "noun"
            },
            {
                "word": "canonic",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a variety of rapeseed that was developed in Canada and is grown widely in North America and is used to make cooking oil, also called canola",
                    "vi": "nhiều loại hạt cải dầu được phát triển ở Canada và được trồng rộng rãi ở Bắc Mỹ và được sử dụng để làm dầu ăn, còn được gọi là canola"
                },
                "examples": [
                    {
                        "en": "Canola oil is low in saturated fats.",
                        "vi": "Dầu hạt cải có ít chất béo bão hòa."
                    }
                ]
            }
        ]
    },
    {
        "id": "c87567917d8a48c899022eee7e302071",
        "word": "chaff",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/tʃæf/",
            "us": "/tʃæf/"
        },
        "nearby": [
            {
                "word": "chador",
                "pos": "noun"
            },
            {
                "word": "chafe",
                "pos": "verb"
            },
            {
                "word": "chaff",
                "pos": "noun"
            },
            {
                "word": "chaff",
                "pos": "verb"
            },
            {
                "word": "chaffinch",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the outer layer of the seeds of grain such as wheat, which is separated from the grain before it is eaten",
                    "vi": "lớp ngoài của hạt như lúa mì, được tách ra khỏi hạt trước khi ăn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "straw (= dried stems of wheat) and hay (= dried grass) cut up as food for cows",
                    "vi": "rơm (= thân lúa mì khô) và cỏ khô (= cỏ khô) cắt nhỏ làm thức ăn cho bò"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to recognize the difference between useful or valuable people or things and those that are not useful or have no value",
                    "vi": "để nhận ra sự khác biệt giữa những người hoặc những thứ hữu ích và có giá trị và những người không hữu ích hoặc không có giá trị"
                },
                "examples": [
                    {
                        "en": "We sifted through the application forms to separate the wheat from the chaff.",
                        "vi": "Chúng tôi đã sàng lọc các mẫu đơn để tách lúa mì ra khỏi vỏ trấu."
                    }
                ]
            }
        ]
    },
    {
        "id": "7a941c1086604af586d6e66a5cd686c8",
        "word": "combine",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkɒmbaɪn/",
            "us": "/ˈkɑːmbaɪn/"
        },
        "nearby": [
            {
                "word": "combination lock",
                "pos": "noun"
            },
            {
                "word": "combine",
                "pos": "verb"
            },
            {
                "word": "combine",
                "pos": "noun"
            },
            {
                "word": "combined",
                "pos": "adjective"
            },
            {
                "word": "combining form",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a large farm machine that both cuts a crop and also separates the grains from the rest of the plant",
                    "vi": "một máy nông nghiệp lớn vừa cắt cây trồng vừa tách hạt khỏi phần còn lại của cây"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a group of people or organizations acting together in business",
                    "vi": "một nhóm người hoặc tổ chức cùng hoạt động trong kinh doanh"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "4ca8747718c84b60a27b5b148ca13738",
        "word": "crofting",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkrɒftɪŋ/",
            "us": "/ˈkrɔːftɪŋ/"
        },
        "nearby": [
            {
                "word": "croft",
                "pos": "noun"
            },
            {
                "word": "crofter",
                "pos": "noun"
            },
            {
                "word": "crofting",
                "pos": "noun"
            },
            {
                "word": "Crohn's disease",
                "pos": "noun"
            },
            {
                "word": "croissant",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a system of farming on a small scale in Scotland",
                    "vi": "hệ thống canh tác quy mô nhỏ ở Scotland"
                },
                "examples": [
                    {
                        "en": "In the Scottish Highlands people struggled to make a living from crofting.",
                        "vi": "Ở Cao nguyên Scotland, người dân phải vật lộn để kiếm sống bằng nghề trồng trọt."
                    },
                    {
                        "en": "The traditional crofting way of life is under threat in Scotland's Western Isles.",
                        "vi": "Lối sống canh tác truyền thống đang bị đe dọa ở Western Isles của Scotland."
                    }
                ]
            }
        ]
    },
    {
        "id": "60fd775f271c4383933248623866fd02",
        "word": "crop",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/krɒp/",
            "us": "/krɑːp/"
        },
        "nearby": [
            {
                "word": "crooner",
                "pos": "noun"
            },
            {
                "word": "crop",
                "pos": "noun"
            },
            {
                "word": "crop",
                "pos": "verb"
            },
            {
                "word": "crop circle",
                "pos": "noun"
            },
            {
                "word": "crop dusting",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to cut somebody’s hair very short",
                    "vi": "cắt tóc của ai đó thật ngắn"
                },
                "examples": [
                    {
                        "en": "closely cropped hair",
                        "vi": "tóc cắt sát"
                    },
                    {
                        "en": "His hair had been cropped short and he looked different.",
                        "vi": "Tóc anh ấy đã được cắt ngắn và anh ấy trông khác hẳn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to cut off part of a photograph, picture or image",
                    "vi": "cắt bỏ một phần của bức ảnh, hình ảnh hoặc hình ảnh"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to bite off and eat the tops of plants, especially grass",
                    "vi": "cắn và ăn ngọn cây, đặc biệt là cỏ"
                },
                "examples": [
                    {
                        "en": "The horses were quietly cropping the grass.",
                        "vi": "Những con ngựa đang lặng lẽ xén cỏ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to produce a crop",
                    "vi": "để sản xuất một loại cây trồng"
                },
                "examples": [
                    {
                        "en": "The potatoes cropped well this year.",
                        "vi": "Năm nay khoai tây được mùa tốt."
                    }
                ]
            },
            {
                "define": {
                    "en": "to use land to grow crops",
                    "vi": "sử dụng đất để trồng hoa màu"
                },
                "examples": [
                    {
                        "en": "The river valley is intensively cropped.",
                        "vi": "Thung lũng sông bị chặt phá."
                    }
                ]
            }
        ]
    },
    {
        "id": "5d255ae2599f45a38aff070fcaa167dd",
        "word": "crop dusting",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkrɒp dʌstɪŋ/",
            "us": "/ˈkrɑːp dʌstɪŋ/"
        },
        "nearby": [
            {
                "word": "crop",
                "pos": "verb"
            },
            {
                "word": "crop circle",
                "pos": "noun"
            },
            {
                "word": "crop dusting",
                "pos": "noun"
            },
            {
                "word": "cropper",
                "pos": "noun"
            },
            {
                "word": "crop top",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the practice of spraying crops with chemicals such as pesticides from a plane",
                    "vi": "thực hành phun cây trồng bằng hóa chất như thuốc trừ sâu từ máy bay"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "4a15dc6a1c9140f7a915fef274954610",
        "word": "dryland farming",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈdraɪlənd fɑːmɪŋ/",
            "us": "/ˈdraɪlənd fɑːrmɪŋ/"
        },
        "nearby": [
            {
                "word": "dry ice",
                "pos": "noun"
            },
            {
                "word": "dry land",
                "pos": "noun"
            },
            {
                "word": "dryland farming",
                "pos": "noun"
            },
            {
                "word": "dryly",
                "pos": "adverb"
            },
            {
                "word": "dry milk",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a method of farming in areas where there is very little rain, which involves growing crops that do not need much water",
                    "vi": "một phương pháp canh tác ở những nơi có rất ít mưa, bao gồm việc trồng các loại cây trồng không cần nhiều nước"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a7f299f7bf644f719a0013b43b44d6e9",
        "word": "ear",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ɪə(r)/",
            "us": "/ɪr/"
        },
        "nearby": [
            {
                "word": "EAP",
                "pos": "abbreviation"
            },
            {
                "word": "ear-piercing",
                "pos": "noun"
            },
            {
                "word": "ear",
                "pos": "noun"
            },
            {
                "word": "earache",
                "pos": "noun"
            },
            {
                "word": "earbashing",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "either of the organs on the sides of the head that you hear with",
                    "vi": "một trong các cơ quan ở hai bên đầu mà bạn nghe thấy"
                },
                "examples": [
                    {
                        "en": "the left/right ear",
                        "vi": "tai trái / phải"
                    },
                    {
                        "en": "He put his hands over his ears.",
                        "vi": "Anh đưa tay bịt tai."
                    },
                    {
                        "en": "She's had her ears pierced.",
                        "vi": "Cô ấy đã bị xỏ lỗ tai."
                    },
                    {
                        "en": "The elephant flapped its ears.",
                        "vi": "Con voi vỗ tai."
                    },
                    {
                        "en": "in somebody's ear She whispered something in his ear.",
                        "vi": "vào tai ai đó Cô thì thầm điều gì đó vào tai anh."
                    },
                    {
                        "en": "He was now screaming in my ear.",
                        "vi": "Anh ấy bây giờ đang hét vào tai tôi."
                    },
                    {
                        "en": "He was always there with a sympathetic ear (= was always willing to listen to people).",
                        "vi": "Anh ấy luôn ở đó với một đôi tai thông cảm (= luôn sẵn lòng lắng nghe mọi người)."
                    },
                    {
                        "en": "an ear infection",
                        "vi": "nhiễm trùng tai"
                    }
                ]
            },
            {
                "define": {
                    "en": "having the type of ears mentioned",
                    "vi": "có kiểu tai được đề cập"
                },
                "examples": [
                    {
                        "en": "a long-eared owl",
                        "vi": "một con cú tai dài"
                    }
                ]
            },
            {
                "define": {
                    "en": "an ability to recognize and copy sounds well",
                    "vi": "khả năng nhận biết và sao chép âm thanh tốt"
                },
                "examples": [
                    {
                        "en": "She has always had an ear for languages.",
                        "vi": "Cô ấy đã luôn luôn có một tai cho các ngôn ngữ."
                    },
                    {
                        "en": "You need a good ear to master the piano.",
                        "vi": "Bạn cần có một đôi tai tốt để làm chủ piano."
                    }
                ]
            },
            {
                "define": {
                    "en": "the top part of a grain plant, such as wheat, that contains the seeds",
                    "vi": "phần trên cùng của cây ngũ cốc, chẳng hạn như lúa mì, có chứa hạt"
                },
                "examples": [
                    {
                        "en": "ears of corn",
                        "vi": "bắp ngô"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be waiting with interest to hear what somebody has to say",
                    "vi": "đang chờ đợi với sự quan tâm để nghe những gì ai đó phải nói"
                },
                "examples": [
                    {
                        "en": "‘Do you know what he said?’ ‘Go on—I'm all ears.’",
                        "vi": "Bạn có biết anh ấy nói gì không?' \"Tiếp tục đi - tôi là đôi tai.\""
                    }
                ]
            },
            {
                "define": {
                    "en": "to talk to somebody a lot about something, especially about a problem that you have",
                    "vi": "để nói chuyện với ai đó rất nhiều về điều gì đó, đặc biệt là về một vấn đề mà bạn gặp phải"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be forced to leave (a job, etc.)",
                    "vi": "buộc phải rời đi (một công việc, v.v.)"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to have a lot of something to deal with",
                    "vi": "có rất nhiều thứ để giải quyết"
                },
                "examples": [
                    {
                        "en": "We're up to our ears in work.",
                        "vi": "Chúng tôi luôn cố gắng trong công việc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to hit somebody with your hand on the side of their head as a punishment",
                    "vi": "đánh ai đó bằng bàn tay của bạn trên đầu của họ như một hình phạt"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to look at or listen to something/somebody carefully and with a lot of attention",
                    "vi": "nhìn hoặc lắng nghe điều gì đó / ai đó một cách cẩn thận và chú ý"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "somebody hears about something, especially when other people already know about it",
                    "vi": "ai đó nghe về điều gì đó, đặc biệt là khi người khác đã biết về điều đó"
                },
                "examples": [
                    {
                        "en": "News of his affair eventually reached her ears.",
                        "vi": "Tin tức về việc anh ngoại tình cuối cùng cũng đến tai cô."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person thinks that other people are talking about them, especially in an unkind way",
                    "vi": "một người nghĩ rằng người khác đang nói về họ, đặc biệt là theo một cách không đẹp"
                },
                "examples": [
                    {
                        "en": "‘I bumped into your ex-wife last night.’ ‘I thought I could feel my ears burning!’",
                        "vi": "Tôi tình cờ gặp vợ cũ của anh đêm qua.' 'Tôi nghĩ tôi có thể cảm thấy tai mình bỏng rát!'"
                    }
                ]
            },
            {
                "define": {
                    "en": "a person is trying to listen to somebody else’s conversation",
                    "vi": "một người đang cố gắng lắng nghe cuộc trò chuyện của người khác"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "pleasant to listen to",
                    "vi": "rất vui khi nghe"
                },
                "examples": [
                    {
                        "en": "Their music is all very easy on the ear.",
                        "vi": "Âm nhạc của họ đều rất dễ nghe."
                    }
                ]
            },
            {
                "define": {
                    "en": "pleasant to listen to or look at",
                    "vi": "dễ chịu khi nghe hoặc nhìn"
                },
                "examples": [
                    {
                        "en": "The room was painted in soft pastels that were easy on the eye.",
                        "vi": "Căn phòng được sơn bằng màu phấn nhẹ nhàng dễ bắt mắt."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be ignored or not noticed by other people",
                    "vi": "bị người khác phớt lờ hoặc không chú ý"
                },
                "examples": [
                    {
                        "en": "Her advice fell on deaf ears.",
                        "vi": "Lời khuyên của cô rơi vào tai điếc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to hit somebody/be hit on the head as a punishment",
                    "vi": "đánh ai đó / bị đánh vào đầu như một hình phạt"
                },
                "examples": [
                    {
                        "en": "You’ll get a thick ear if you’re not careful!",
                        "vi": "Bạn sẽ bị dày tai nếu không cẩn thận!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be forgotten quickly",
                    "vi": "bị lãng quên nhanh chóng"
                },
                "examples": [
                    {
                        "en": "Everything I tell them just goes in one ear and out the other.",
                        "vi": "Tất cả mọi thứ tôi nói với họ chỉ đi vào tai này và tai kia."
                    },
                    {
                        "en": "I knew that my words were going in one ear and out the other.",
                        "vi": "Tôi biết rằng lời nói của tôi đang đi vào tai này và tai kia."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have a lot of something, especially more than you need",
                    "vi": "để có nhiều thứ, đặc biệt là nhiều hơn những gì bạn cần"
                },
                "examples": [
                    {
                        "en": "That man has money coming out of his ears.",
                        "vi": "Người đàn ông đó có tiền ra khỏi tai của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be able to give somebody advice, influence them, etc. because they trust you",
                    "vi": "để có thể đưa ra lời khuyên cho ai đó, ảnh hưởng đến họ, v.v. bởi vì họ tin tưởng bạn"
                },
                "examples": [
                    {
                        "en": "He had the ear of the monarch.",
                        "vi": "Anh đã có tai của bậc quân vương."
                    },
                    {
                        "en": "This was the woman who had the ear of the President.",
                        "vi": "Đây là người phụ nữ đã lọt tai Tổng thống."
                    }
                ]
            },
            {
                "define": {
                    "en": "to speak to somebody privately about something",
                    "vi": "nói chuyện riêng với ai đó về điều gì đó"
                },
                "examples": [
                    {
                        "en": "Can I have a word in your ear about tomorrow's presentation?",
                        "vi": "Tôi có thể nói nhỏ với bạn về buổi thuyết trình ngày mai được không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to listen out for somebody/something that you might hear",
                    "vi": "để lắng nghe ai đó / điều gì đó mà bạn có thể nghe thấy"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to listen or look out for somebody/something that you might hear or see",
                    "vi": "để lắng nghe hoặc tìm kiếm ai đó / điều gì đó mà bạn có thể nghe thấy hoặc nhìn thấy"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to make sure that you always find out about the most recent developments in a particular situation",
                    "vi": "để đảm bảo rằng bạn luôn tìm hiểu về những phát triển gần đây nhất trong một tình huống cụ thể"
                },
                "examples": [
                    {
                        "en": "The agent had no suitable properties on his books but promised to keep an ear to the ground for us.",
                        "vi": "Người đại diện không có tài sản nào phù hợp trên sổ sách của mình nhưng hứa sẽ quan tâm đến chúng tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to listen in a patient and kind way to somebody",
                    "vi": "lắng nghe một cách kiên nhẫn và tử tế với ai đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to do something badly; to make a mess of something",
                    "vi": "làm điều gì đó tồi tệ; làm một cái gì đó lộn xộn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "(you won't) succeed in making something good out of material that does not seem very good at all",
                    "vi": "(bạn sẽ không) thành công trong việc tạo ra một thứ gì đó tốt từ những thứ có vẻ không tốt chút nào"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "news or information that you are very pleased to hear",
                    "vi": "tin tức hoặc thông tin mà bạn rất vui khi biết"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be very surprised at something you hear",
                    "vi": "rất ngạc nhiên về điều gì đó bạn nghe thấy"
                },
                "examples": [
                    {
                        "en": "I couldn't believe my ears when I heard the news.",
                        "vi": "Tôi không thể tin vào tai mình khi biết tin."
                    },
                    {
                        "en": "She actually apologized. I couldn't believe my ears!",
                        "vi": "Cô ấy thực sự đã xin lỗi. Tôi không thể tin vào tai mình!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be very surprised at something you hear/see",
                    "vi": "rất ngạc nhiên về điều gì đó bạn nghe / thấy"
                },
                "examples": [
                    {
                        "en": "I couldn't believe my eyes when she walked in.",
                        "vi": "Tôi không thể tin vào mắt mình khi cô ấy bước vào."
                    }
                ]
            },
            {
                "define": {
                    "en": "to play music by remembering how it sounds rather than by reading it",
                    "vi": "chơi nhạc bằng cách ghi nhớ âm thanh của nó thay vì đọc nó"
                },
                "examples": [
                    {
                        "en": "She usually plays the guitar by ear, rather than reading the music.",
                        "vi": "Cô ấy thường chơi guitar bằng tai hơn là đọc nhạc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to decide how to deal with a situation as it develops rather than by having a plan to follow",
                    "vi": "quyết định cách đối phó với một tình huống khi nó phát triển thay vì lập kế hoạch để làm theo"
                },
                "examples": [
                    {
                        "en": "I’m not sure how many people are expected—we’ll just have to play it by ear.",
                        "vi": "Tôi không chắc có bao nhiêu người được mong đợi — chúng tôi sẽ chỉ chơi nó bằng tai."
                    }
                ]
            },
            {
                "define": {
                    "en": "to raise the ears",
                    "vi": "nâng cao tai"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to listen carefully because you have just heard something interesting; to listen out for something you might hear",
                    "vi": "để lắng nghe một cách cẩn thận bởi vì bạn vừa nghe thấy một cái gì đó thú vị; để lắng nghe điều gì đó bạn có thể nghe thấy"
                },
                "examples": [
                    {
                        "en": "Her ears pricked up at the sound of his name.",
                        "vi": "Tai cô vểnh lên khi nghe tên anh."
                    },
                    {
                        "en": "I walked along, ears pricked for the slightest noise.",
                        "vi": "Tôi đi dọc, tai vểnh lên vì tiếng động nhỏ nhất."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make you feel that you can still hear something",
                    "vi": "để làm cho bạn cảm thấy rằng bạn vẫn có thể nghe thấy điều gì đó"
                },
                "examples": [
                    {
                        "en": "His warning was still ringing in my ears.",
                        "vi": "Lời cảnh báo của anh ấy vẫn còn văng vẳng bên tai tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to refuse to listen to something",
                    "vi": "từ chối nghe một cái gì đó"
                },
                "examples": [
                    {
                        "en": "She decided to shut her ears to all the rumours.",
                        "vi": "Cô quyết định bịt tai trước mọi tin đồn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be smiling, etc. a lot because you are very pleased about something",
                    "vi": "mỉm cười, v.v. rất nhiều vì bạn rất hài lòng về điều gì đó"
                },
                "examples": [
                    {
                        "en": "He was beaming from ear to ear.",
                        "vi": "Anh ấy cười rạng rỡ từ tai này sang tai khác."
                    }
                ]
            },
            {
                "define": {
                    "en": "to ignore or refuse to listen to somebody/something",
                    "vi": "phớt lờ hoặc từ chối lắng nghe ai đó / điều gì đó"
                },
                "examples": [
                    {
                        "en": "He turned a deaf ear to the rumours.",
                        "vi": "Anh ta bỏ ngoài tai trước những tin đồn."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to warn people to be careful what they say because other people may be listening",
                    "vi": "được sử dụng để cảnh báo mọi người hãy cẩn thận với những gì họ nói vì người khác có thể đang nghe"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "young and without much experience",
                    "vi": "trẻ và không có nhiều kinh nghiệm"
                },
                "examples": [
                    {
                        "en": "He was still wet behind the ears, politically.",
                        "vi": "Anh vẫn còn ướt sau tai, về mặt chính trị."
                    }
                ]
            },
            {
                "define": {
                    "en": "if somebody sends a person away with a flea in their ear, they tell them angrily to go away",
                    "vi": "nếu ai đó đuổi một người đi với một con bọ chét trong tai của họ, họ giận dữ bảo họ hãy biến đi"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "without giving your full attention to what is being said, etc.",
                    "vi": "mà không chú ý hoàn toàn vào những gì đang được nói, v.v."
                },
                "examples": [
                    {
                        "en": "He listened to her with only half an ear as he watched TV.",
                        "vi": "Anh chỉ nghe cô bằng nửa tai khi xem TV."
                    }
                ]
            }
        ]
    },
    {
        "id": "976e4d97f63a40c19452005aca7d168b",
        "word": "elevator",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈelɪveɪtə(r)/",
            "us": "/ˈelɪveɪtər/"
        },
        "nearby": [
            {
                "word": "elevating",
                "pos": "adjective"
            },
            {
                "word": "elevation",
                "pos": "noun"
            },
            {
                "word": "elevator",
                "pos": "noun"
            },
            {
                "word": "eleven",
                "pos": ""
            },
            {
                "word": "eleven-plus",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a machine that carries people or goods up and down to different levels in a building or a mine",
                    "vi": "máy vận chuyển người hoặc hàng hóa lên và xuống các tầng khác nhau trong tòa nhà hoặc hầm mỏ"
                },
                "examples": [
                    {
                        "en": "It's on the fifth floor, so we'd better take the elevator.",
                        "vi": "Nó ở tầng năm, vì vậy tốt hơn chúng ta nên đi thang máy."
                    }
                ]
            },
            {
                "define": {
                    "en": "a tall building used to store grain and that contains equipment to move it",
                    "vi": "một tòa nhà cao được sử dụng để lưu trữ ngũ cốc và có thiết bị để di chuyển nó"
                },
                "examples": [
                    {
                        "en": "In the harbour a giant elevator stores prairie grain.",
                        "vi": "Trong bến cảng, một chiếc thang máy khổng lồ lưu trữ ngũ cốc thảo nguyên."
                    }
                ]
            },
            {
                "define": {
                    "en": "a part in the tail of an aircraft that is moved to make it go up and down",
                    "vi": "một bộ phận ở đuôi của máy bay được di chuyển để làm cho nó đi lên và đi xuống"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a059510e7a674cc4adcbb01ea6f1200b",
        "word": "fallow",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈfæləʊ/",
            "us": "/ˈfæləʊ/"
        },
        "nearby": [
            {
                "word": "fall over",
                "pos": "phrasal verb"
            },
            {
                "word": "fall over yourself to do",
                "pos": "phrasal verb"
            },
            {
                "word": "fallow",
                "pos": "adjective"
            },
            {
                "word": "fallow deer",
                "pos": "noun"
            },
            {
                "word": "the Falls Road",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "not used for growing crops, especially so that the quality of the land will improve",
                    "vi": "không được sử dụng để trồng hoa màu, đặc biệt để chất lượng đất được cải thiện"
                },
                "examples": [
                    {
                        "en": "Farmers are now paid to let their land lie fallow.",
                        "vi": "Nông dân bây giờ được trả tiền để để đất đai của họ bị bỏ hoang."
                    }
                ]
            },
            {
                "define": {
                    "en": "when nothing is created or produced; not successful",
                    "vi": "khi không có gì được tạo ra hoặc sản xuất; không thành công"
                },
                "examples": [
                    {
                        "en": "Contemporary dance is coming onto the arts scene again after a long fallow period.",
                        "vi": "Múa đương đại đang trở lại sân khấu nghệ thuật sau một thời gian dài bị bỏ hoang."
                    }
                ]
            }
        ]
    },
    {
        "id": "723ae8db8bde4be3a20743eb373d9248",
        "word": "field corn",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈfiːld kɔːn/",
            "us": "/ˈfiːld kɔːrn/"
        },
        "nearby": [
            {
                "word": "The Field",
                "pos": ""
            },
            {
                "word": "field",
                "pos": "verb"
            },
            {
                "word": "field corn",
                "pos": "noun"
            },
            {
                "word": "fieldcraft",
                "pos": "noun"
            },
            {
                "word": "field day",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "corn (maize) that is grown to feed animals",
                    "vi": "ngô (ngô) được trồng để làm thức ăn cho động vật"
                },
                "examples": [
                    {
                        "en": "They grew field corn and soybeans, and raised a few cows.",
                        "vi": "Họ trồng ngô đồng và đậu tương, và nuôi một vài con bò."
                    }
                ]
            }
        ]
    },
    {
        "id": "06d4dc72efa24bcd9d822d466e8da6c6",
        "word": "furrow",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈfʌrəʊ/",
            "us": "/ˈfɜːrəʊ/"
        },
        "nearby": [
            {
                "word": "furred",
                "pos": "adjective"
            },
            {
                "word": "furrier",
                "pos": "noun"
            },
            {
                "word": "furrow",
                "pos": "noun"
            },
            {
                "word": "furrow",
                "pos": "verb"
            },
            {
                "word": "furrowed",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a long narrow cut in the ground, especially one made by a plough for planting seeds in",
                    "vi": "một vết cắt dài và hẹp trên mặt đất, đặc biệt là vết cắt do máy cày tạo ra để gieo hạt ở"
                },
                "examples": [
                    {
                        "en": "dark ploughed earth, with white chalk in the furrows",
                        "vi": "đất cày xới sẫm màu, có phấn trắng trong rãnh"
                    },
                    {
                        "en": "Truck wheels had dug furrows in the track.",
                        "vi": "Bánh xe tải đã đào rãnh trên đường ray."
                    },
                    {
                        "en": "Water lay in the furrows of the ploughed fields.",
                        "vi": "Nước đọng thành rãnh trên ruộng cày."
                    }
                ]
            },
            {
                "define": {
                    "en": "a deep line in the skin of the face",
                    "vi": "một đường sâu trên da mặt"
                },
                "examples": [
                    {
                        "en": "Suddenly he looked tired and there were deep furrows in his brow.",
                        "vi": "Đột nhiên anh ta trông mệt mỏi và có những nếp nhăn sâu trên lông mày."
                    }
                ]
            },
            {
                "define": {
                    "en": "to do things that other people do not do, or be interested in things that other people are not interested in",
                    "vi": "làm những điều mà người khác không làm hoặc quan tâm đến những điều mà người khác không quan tâm"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "b047c00acf5f4be3b331d6a17b3db5af",
        "word": "glasshouse",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɡlɑːshaʊs/",
            "us": "/ˈɡlæshaʊs/"
        },
        "nearby": [
            {
                "word": "glass fibre",
                "pos": "noun"
            },
            {
                "word": "glassful",
                "pos": "noun"
            },
            {
                "word": "glasshouse",
                "pos": "noun"
            },
            {
                "word": "glass in",
                "pos": "phrasal verb"
            },
            {
                "word": "glass over",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a building with glass sides and a glass roof, for growing plants in; a type of large greenhouse",
                    "vi": "một tòa nhà với các mặt bằng kính và mái bằng kính, để trồng cây trong; một loại nhà kính lớn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a military prison",
                    "vi": "một nhà tù quân sự"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "4cb3446232214c91999de954c0e18829",
        "word": "grain elevator",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɡreɪn elɪveɪtə(r)/",
            "us": "/ˈɡreɪn elɪveɪtər/"
        },
        "nearby": [
            {
                "word": "grain",
                "pos": "noun"
            },
            {
                "word": "grained",
                "pos": "adjective"
            },
            {
                "word": "grain elevator",
                "pos": "noun"
            },
            {
                "word": "Percy Grainger",
                "pos": ""
            },
            {
                "word": "grainy",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a tall building used to store grain and that contains equipment to move it",
                    "vi": "một tòa nhà cao được sử dụng để lưu trữ ngũ cốc và có thiết bị để di chuyển nó"
                },
                "examples": [
                    {
                        "en": "Industries along the river include a sugar refinery, grain elevators and an oil refinery.",
                        "vi": "Các ngành công nghiệp dọc sông bao gồm nhà máy lọc đường, thang máy ngũ cốc và nhà máy lọc dầu."
                    }
                ]
            }
        ]
    },
    {
        "id": "acc0184f7dd14a5aa8990ca3ed2510d6",
        "word": "irrigate",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɪrɪɡeɪt/",
            "us": "/ˈɪrɪɡeɪt/"
        },
        "nearby": [
            {
                "word": "irrevocable",
                "pos": "adjective"
            },
            {
                "word": "irrevocably",
                "pos": "adverb"
            },
            {
                "word": "irrigate",
                "pos": "verb"
            },
            {
                "word": "irrigation",
                "pos": "noun"
            },
            {
                "word": "irritability",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to supply water to an area of land, typically through pipes or channels, so that crops will grow",
                    "vi": "cung cấp nước cho một khu vực đất, thường thông qua các đường ống hoặc kênh, để cây trồng sẽ phát triển"
                },
                "examples": [
                    {
                        "en": "irrigated land/crops",
                        "vi": "đất tưới tiêu / cây trồng"
                    },
                    {
                        "en": "The waters in these three rivers irrigate the plains of Punjab.",
                        "vi": "Nước trong ba con sông này tưới tiêu vùng đồng bằng Punjab."
                    }
                ]
            },
            {
                "define": {
                    "en": "to wash out a wound or part of the body with a flow of water or liquid",
                    "vi": "để rửa vết thương hoặc bộ phận của cơ thể bằng dòng nước hoặc chất lỏng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "6f930e1a8f9b44558f4c632061bd2190",
        "word": "legume",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈleɡjuːm/",
            "us": "/ˈleɡjuːm/"
        },
        "nearby": [
            {
                "word": "leg-pull",
                "pos": "noun"
            },
            {
                "word": "legroom",
                "pos": "noun"
            },
            {
                "word": "legume",
                "pos": "noun"
            },
            {
                "word": "leguminous",
                "pos": "adjective"
            },
            {
                "word": "leg-up",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "any plant that has seeds in long pods. Peas and beans are legumes.",
                    "vi": "bất kỳ cây nào có hạt trong vỏ quả dài. Đậu Hà Lan là cây họ đậu."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "33bfb0e696d24dd9994a66b06ffa012a",
        "word": "lime",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/laɪm/",
            "us": "/laɪm/"
        },
        "nearby": [
            {
                "word": "limbic system",
                "pos": "noun"
            },
            {
                "word": "limbo",
                "pos": "noun"
            },
            {
                "word": "lime",
                "pos": "noun"
            },
            {
                "word": "lime",
                "pos": "verb"
            },
            {
                "word": "limeade",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a white substance obtained by heating limestone, used in building materials and to help plants grow",
                    "vi": "một chất màu trắng thu được bằng cách nung đá vôi, được sử dụng trong vật liệu xây dựng và giúp cây cối phát triển"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a small green fruit, like a lemon, with juice that has a bitter, sharp taste, used in cooking and in drinks; the juice of this fruit",
                    "vi": "một loại quả nhỏ màu xanh, giống như quả chanh, lấy nước cốt có vị đắng, sắc, dùng trong nấu ăn và làm đồ uống; nước trái cây này"
                },
                "examples": [
                    {
                        "en": "lime juice",
                        "vi": "nước ép chanh"
                    },
                    {
                        "en": "slices of lime",
                        "vi": "lát chanh"
                    },
                    {
                        "en": "Serve the dish garnished with wedges of lime.",
                        "vi": "Phục vụ món ăn được trang trí với chanh."
                    }
                ]
            },
            {
                "define": {
                    "en": "a tree on which limes grow",
                    "vi": "cây mà trên đó cây chanh mọc"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a large tree with light-green, heart-shaped leaves and yellow flowers",
                    "vi": "một cái cây lớn với những chiếc lá màu xanh nhạt, hình trái tim và những bông hoa màu vàng"
                },
                "examples": [
                    {
                        "en": "an avenue of limes",
                        "vi": "một đại lộ của những cây lim"
                    }
                ]
            },
            {
                "define": {
                    "en": "a bright yellow-green colour",
                    "vi": "một màu vàng xanh tươi sáng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "245471342af5487dacfa83eb7a4f4670",
        "word": "loam",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ləʊm/",
            "us": "/ləʊm/"
        },
        "nearby": [
            {
                "word": "loaf",
                "pos": "verb"
            },
            {
                "word": "loafer",
                "pos": "noun"
            },
            {
                "word": "loam",
                "pos": "noun"
            },
            {
                "word": "loamy",
                "pos": "adjective"
            },
            {
                "word": "loan",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "good quality soil containing sand, clay and decayed vegetable matter",
                    "vi": "đất chất lượng tốt có chứa cát, đất sét và rau mục nát"
                },
                "examples": [
                    {
                        "en": "A moist loam is ideal for growing currant bushes.",
                        "vi": "Đất mùn ẩm là lý tưởng để phát triển các bụi nho."
                    },
                    {
                        "en": "Mix equal parts of clay and loam.",
                        "vi": "Trộn các phần đất sét và đất mùn bằng nhau."
                    }
                ]
            }
        ]
    },
    {
        "id": "7fce79db5e334ab3a7f9998f57c3c4f1",
        "word": "manure",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/məˈnjʊə(r)/",
            "us": "/məˈnʊr/"
        },
        "nearby": [
            {
                "word": "manumission",
                "pos": "noun"
            },
            {
                "word": "man up",
                "pos": "phrasal verb"
            },
            {
                "word": "manure",
                "pos": "noun"
            },
            {
                "word": "manure",
                "pos": "verb"
            },
            {
                "word": "manuscript",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the waste matter from animals that is spread over or mixed with the soil to help plants and crops grow",
                    "vi": "chất thải từ động vật được rải hoặc trộn với đất để giúp cây cối và hoa màu phát triển"
                },
                "examples": [
                    {
                        "en": "Dig plenty of well-rotted manure into the soil.",
                        "vi": "Đào nhiều phân chuồng hoai mục vào đất."
                    },
                    {
                        "en": "the best time to spread manure on the fields",
                        "vi": "thời điểm tốt nhất để rải phân trên ruộng"
                    }
                ]
            }
        ]
    },
    {
        "id": "3397b005bcf74969bf2aa47b2b115521",
        "word": "manure",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/məˈnjʊə(r)/",
            "us": "/məˈnʊr/"
        },
        "nearby": [
            {
                "word": "man up",
                "pos": "phrasal verb"
            },
            {
                "word": "manure",
                "pos": "noun"
            },
            {
                "word": "manure",
                "pos": "verb"
            },
            {
                "word": "manuscript",
                "pos": "noun"
            },
            {
                "word": "manuscript paper",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to put manure on or in soil to help plants grow",
                    "vi": "bỏ phân vào hoặc trong đất để giúp cây phát triển"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "da86267d6126496f990443b62776657b",
        "word": "marginal",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmɑːdʒɪnl/",
            "us": "/ˈmɑːrdʒɪnl/"
        },
        "nearby": [
            {
                "word": "Margery",
                "pos": ""
            },
            {
                "word": "margin",
                "pos": "noun"
            },
            {
                "word": "marginal",
                "pos": "adjective"
            },
            {
                "word": "marginal",
                "pos": "noun"
            },
            {
                "word": "marginalia",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "small and not important",
                    "vi": "nhỏ và không quan trọng"
                },
                "examples": [
                    {
                        "en": "a marginal improvement in weather conditions",
                        "vi": "một sự cải thiện nhỏ trong điều kiện thời tiết"
                    },
                    {
                        "en": "The story will only be of marginal interest to our readers.",
                        "vi": "Câu chuyện sẽ chỉ được các độc giả của chúng tôi quan tâm ngoài lề."
                    },
                    {
                        "en": "The difference between the two estimates is marginal.",
                        "vi": "Sự khác biệt giữa hai ước tính là cận biên."
                    }
                ]
            },
            {
                "define": {
                    "en": "relating to or resulting from small changes",
                    "vi": "liên quan đến hoặc kết quả từ những thay đổi nhỏ"
                },
                "examples": [
                    {
                        "en": "All three companies reported marginal revenue growth.",
                        "vi": "Cả ba công ty đều báo cáo tăng trưởng doanh thu cận biên."
                    }
                ]
            },
            {
                "define": {
                    "en": "not part of a main or important group or situation",
                    "vi": "không phải là một phần của một nhóm hoặc tình huống chính hoặc quan trọng"
                },
                "examples": [
                    {
                        "en": "marginal groups in society",
                        "vi": "các nhóm bên lề trong xã hội"
                    },
                    {
                        "en": "Welsh was considered a marginal language.",
                        "vi": "Tiếng Wales được coi là một ngôn ngữ biên."
                    }
                ]
            },
            {
                "define": {
                    "en": "won or lost by a very small number of votes and therefore very important or interesting as evidence of public opinion",
                    "vi": "thắng hay thua bởi một số lượng rất nhỏ phiếu bầu và do đó rất quan trọng hoặc thú vị như là bằng chứng của dư luận"
                },
                "examples": [
                    {
                        "en": "a marginal seat/constituency",
                        "vi": "một chỗ ngồi / khu vực bầu cử bên lề"
                    }
                ]
            },
            {
                "define": {
                    "en": "written in the margin of a page",
                    "vi": "được viết ở lề của một trang"
                },
                "examples": [
                    {
                        "en": "marginal notes/comments",
                        "vi": "ghi chú / nhận xét bên lề"
                    }
                ]
            },
            {
                "define": {
                    "en": "that cannot produce enough good crops to make a profit",
                    "vi": "không thể sản xuất đủ cây trồng tốt để tạo ra lợi nhuận"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "e50e741862794b2098c2f655f57ba2e2",
        "word": "monoculture",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmɒnəkʌltʃə(r)/",
            "us": "/ˈmɑːnəkʌltʃər/"
        },
        "nearby": [
            {
                "word": "monocle",
                "pos": "noun"
            },
            {
                "word": "monocotyledon",
                "pos": "noun"
            },
            {
                "word": "monoculture",
                "pos": "noun"
            },
            {
                "word": "monocyte",
                "pos": "noun"
            },
            {
                "word": "monodrama",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the practice of growing only one type of crop on a certain area of land",
                    "vi": "tập quán chỉ trồng một loại cây trồng trên một diện tích đất nhất định"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a set of shared beliefs and ways of behaving that is the same in every part of a society, organization, etc.; a society or organization that is like this",
                    "vi": "một tập hợp các niềm tin chung và cách hành xử giống nhau trong mọi thành phần của xã hội, tổ chức, v.v.; một xã hội hoặc tổ chức giống như thế này"
                },
                "examples": [
                    {
                        "en": "a global economic monoculture",
                        "vi": "độc canh kinh tế toàn cầu"
                    },
                    {
                        "en": "He decries what he sees as academia's progressive monoculture.",
                        "vi": "Anh ta chê bai những gì anh ta coi là độc canh tiến bộ của học viện."
                    }
                ]
            }
        ]
    },
    {
        "id": "cbb3f2a010a84fb8bbc3de5847122c80",
        "word": "muck",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/mʌk/",
            "us": "/mʌk/"
        },
        "nearby": [
            {
                "word": "Much Ado About Nothing",
                "pos": ""
            },
            {
                "word": "muchness",
                "pos": "noun"
            },
            {
                "word": "muck",
                "pos": "noun"
            },
            {
                "word": "muck",
                "pos": "verb"
            },
            {
                "word": "muck about",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "waste matter from farm animals",
                    "vi": "chất thải từ động vật trang trại"
                },
                "examples": [
                    {
                        "en": "to spread muck on the fields",
                        "vi": "rải rác trên cánh đồng"
                    },
                    {
                        "en": "The tractors are out spreading muck.",
                        "vi": "Máy kéo đang rải rác."
                    }
                ]
            },
            {
                "define": {
                    "en": "dirt or mud",
                    "vi": "bùn đất"
                },
                "examples": [
                    {
                        "en": "Can you wipe the muck off the windows?",
                        "vi": "Bạn có thể lau sạch các cửa sổ bị lỗi không?"
                    },
                    {
                        "en": "My face and hands were covered in muck.",
                        "vi": "Mặt và tay của tôi đầy mồ hôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "something very unpleasant",
                    "vi": "một cái gì đó rất khó chịu"
                },
                "examples": [
                    {
                        "en": "I can't eat this muck!",
                        "vi": "Tôi không thể ăn cái thứ này!"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that a business activity that is unpleasant or dirty can bring in a lot of money",
                    "vi": "được sử dụng để nói rằng một hoạt động kinh doanh khó chịu hoặc bẩn thỉu có thể mang lại rất nhiều tiền"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "3b867b43ab534e9590dbeff2f07ac731",
        "word": "nitrate",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈnaɪtreɪt/",
            "us": "/ˈnaɪtreɪt/"
        },
        "nearby": [
            {
                "word": "nitpicking",
                "pos": "noun"
            },
            {
                "word": "nitpicking",
                "pos": "adjective"
            },
            {
                "word": "nitrate",
                "pos": "noun"
            },
            {
                "word": "nitric acid",
                "pos": "noun"
            },
            {
                "word": "nitrify",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a compound containing nitrogen and oxygen. There are several different nitrates and they are used especially to make soil better for growing crops.",
                    "vi": "một hợp chất chứa nitơ và oxy. Có một số nitrat khác nhau và chúng được sử dụng đặc biệt để làm đất tốt hơn cho cây trồng phát triển."
                },
                "examples": [
                    {
                        "en": "We need to cut nitrate levels in water.",
                        "vi": "Chúng ta cần cắt giảm lượng nitrat trong nước."
                    }
                ]
            }
        ]
    },
    {
        "id": "f21fbdddd2144f958a8057eb6da3444b",
        "word": "oats",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/əʊts/",
            "us": "/əʊts/"
        },
        "nearby": [
            {
                "word": "oatmeal",
                "pos": "adjective"
            },
            {
                "word": "oatmeal",
                "pos": "noun"
            },
            {
                "word": "oats",
                "pos": "noun"
            },
            {
                "word": "obbligato",
                "pos": "noun"
            },
            {
                "word": "obduracy",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "grain grown in cool countries as food for animals and for making flour, porridge, etc.",
                    "vi": "ngũ cốc trồng ở xứ mát làm thức ăn cho gia súc và làm bột, cháo, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to go through a period of wild behaviour while young, especially having a lot of romantic or sexual relationships",
                    "vi": "trải qua thời kỳ có những hành vi hoang dã khi còn trẻ, đặc biệt là có nhiều mối quan hệ lãng mạn hoặc tình dục"
                },
                "examples": [
                    {
                        "en": "He wants to leave home, sow his wild oats and learn about life.",
                        "vi": "Anh ấy muốn rời khỏi nhà, gieo những tổ yến hoang dã của mình và tìm hiểu về cuộc sống."
                    }
                ]
            }
        ]
    },
    {
        "id": "ede1b3766edf43a3bf8154704b8a6a52",
        "word": "oilseed rape",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌɔɪlsiːd ˈreɪp/",
            "us": "/ˌɔɪlsiːd ˈreɪp/"
        },
        "nearby": [
            {
                "word": "oil pan",
                "pos": "noun"
            },
            {
                "word": "oil rig",
                "pos": "noun"
            },
            {
                "word": "oilseed rape",
                "pos": "noun"
            },
            {
                "word": "oilskin",
                "pos": "noun"
            },
            {
                "word": "oil slick",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a plant with bright yellow flowers, grown as food for farm animals and for its seeds that are used to make oil",
                    "vi": "một loại cây có hoa màu vàng tươi, được trồng làm thức ăn cho động vật trang trại và lấy hạt của nó được sử dụng để làm dầu"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "dd8890d9b6064d39b8935023ad0efbf9",
        "word": "permaculture",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpɜːməkʌltʃə(r)/",
            "us": "/ˈpɜːrməkʌltʃər/"
        },
        "nearby": [
            {
                "word": "perm",
                "pos": "noun"
            },
            {
                "word": "perm",
                "pos": "verb"
            },
            {
                "word": "permaculture",
                "pos": "noun"
            },
            {
                "word": "permafrost",
                "pos": "noun"
            },
            {
                "word": "permalink",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an approach to life and growing food that copies the way things happen in nature in order to create ways for people to live without damaging the environment",
                    "vi": "một cách tiếp cận cuộc sống và trồng trọt thực phẩm sao chép cách mọi thứ diễn ra trong tự nhiên để tạo ra những cách sống cho con người mà không làm tổn hại đến môi trường"
                },
                "examples": [
                    {
                        "en": "The garden utilizes organic and permaculture gardening principles.",
                        "vi": "Khu vườn sử dụng các nguyên tắc làm vườn hữu cơ và nuôi trồng lâu dài."
                    },
                    {
                        "en": "I'm interested in permaculture and implementing sustainable design.",
                        "vi": "Tôi quan tâm đến việc nuôi trồng và triển khai thiết kế bền vững."
                    }
                ]
            }
        ]
    },
    {
        "id": "f5e56e65021b47e2a0d0bd31c80574f2",
        "word": "plough",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/plaʊ/",
            "us": "/plaʊ/"
        },
        "nearby": [
            {
                "word": "plot hole",
                "pos": "noun"
            },
            {
                "word": "plotter",
                "pos": "noun"
            },
            {
                "word": "plough",
                "pos": "noun"
            },
            {
                "word": "plough",
                "pos": "verb"
            },
            {
                "word": "plough back",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a large piece of farming equipment with one or several curved blades (= metal cutting parts), pulled by a tractor or by animals. It is used for digging and turning over soil, especially before seeds are planted.",
                    "vi": "một thiết bị nông nghiệp lớn có một hoặc nhiều lưỡi cong (= các bộ phận cắt bằng kim loại), được kéo bằng máy kéo hoặc động vật. Nó được dùng để đào và xới đất, đặc biệt là trước khi gieo hạt."
                },
                "examples": [
                    {
                        "en": "Oxen were used to pull ploughs.",
                        "vi": "Oxen được sử dụng để kéo máy cày."
                    }
                ]
            },
            {
                "define": {
                    "en": "a group of seven bright stars that can only be seen from the northern half of the world",
                    "vi": "một nhóm bảy ngôi sao sáng chỉ có thể nhìn thấy từ nửa phía bắc của thế giới"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used for growing crops, not for keeping animals on",
                    "vi": "được sử dụng để trồng trọt, không phải để nuôi gia súc"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "9313d00e5b704a478b9e963941a5b302",
        "word": "plough",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/plaʊ/",
            "us": "/plaʊ/"
        },
        "nearby": [
            {
                "word": "plotter",
                "pos": "noun"
            },
            {
                "word": "plough",
                "pos": "noun"
            },
            {
                "word": "plough",
                "pos": "verb"
            },
            {
                "word": "plough back",
                "pos": "phrasal verb"
            },
            {
                "word": "plough back in",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to dig and turn over a field or other area of land with a plough",
                    "vi": "để đào và lật ruộng hoặc diện tích đất khác bằng máy cày"
                },
                "examples": [
                    {
                        "en": "ploughed fields",
                        "vi": "ruộng cày"
                    }
                ]
            },
            {
                "define": {
                    "en": "to do things that other people do not do, or be interested in things that other people are not interested in",
                    "vi": "làm những điều mà người khác không làm hoặc quan tâm đến những điều mà người khác không quan tâm"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "56f458e9f0f34992be3b6939fdaaaec4",
        "word": "plough back",
        "pos": "phrasal verb",
        "level": "c2",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "plough",
                "pos": "noun"
            },
            {
                "word": "plough",
                "pos": "verb"
            },
            {
                "word": "plough back",
                "pos": "phrasal verb"
            },
            {
                "word": "plough back in",
                "pos": "phrasal verb"
            },
            {
                "word": "plough into",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to turn over growing crops, grass, etc. with a plough and mix them into the soil to improve its quality",
                    "vi": "cày xới đất trồng hoa màu, cỏ, v.v. và trộn chúng vào đất để cải thiện chất lượng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to put money made as profit back into a business in order to improve it",
                    "vi": "đưa số tiền kiếm được dưới dạng lợi nhuận trở lại vào một công việc kinh doanh để cải thiện nó"
                },
                "examples": [
                    {
                        "en": "The money was all ploughed back into the company.",
                        "vi": "Toàn bộ số tiền đều được dồn vào công ty."
                    }
                ]
            }
        ]
    },
    {
        "id": "02a2f8258ed0463682e1ff4bfce05d59",
        "word": "plough back in",
        "pos": "phrasal verb",
        "level": "c2",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "plough",
                "pos": "verb"
            },
            {
                "word": "plough back",
                "pos": "phrasal verb"
            },
            {
                "word": "plough back in",
                "pos": "phrasal verb"
            },
            {
                "word": "plough into",
                "pos": "phrasal verb"
            },
            {
                "word": "ploughman",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to turn over growing crops, grass, etc. with a plough and mix them into the soil to improve its quality",
                    "vi": "cày xới đất trồng hoa màu, cỏ, v.v. và trộn chúng vào đất để cải thiện chất lượng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to put money made as profit back into a business in order to improve it",
                    "vi": "đưa số tiền kiếm được dưới dạng lợi nhuận trở lại vào một công việc kinh doanh để cải thiện nó"
                },
                "examples": [
                    {
                        "en": "The money was all ploughed back into the company.",
                        "vi": "Toàn bộ số tiền đều được dồn vào công ty."
                    }
                ]
            }
        ]
    },
    {
        "id": "29b5a86da3044770af79f1fa1b479d74",
        "word": "plough up",
        "pos": "phrasal verb",
        "level": "c2",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "ploughshare",
                "pos": "noun"
            },
            {
                "word": "plough through",
                "pos": "phrasal verb"
            },
            {
                "word": "plough up",
                "pos": "phrasal verb"
            },
            {
                "word": "plover",
                "pos": "noun"
            },
            {
                "word": "plow",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to turn over a field or other area of land with a plough to change it from grass, for example, to land for growing crops",
                    "vi": "chuyển ruộng hoặc diện tích đất khác bằng máy cày để chuyển từ cỏ sang đất trồng hoa màu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to break up the surface of the ground by walking or driving across it again and again",
                    "vi": "phá vỡ bề mặt của mặt đất bằng cách đi bộ hoặc lái xe qua nó nhiều lần"
                },
                "examples": [
                    {
                        "en": "The paths get all ploughed up by motorbikes.",
                        "vi": "Các lối đi đều bị xe máy cày xới."
                    },
                    {
                        "en": "Heavy traffic had ploughed up the surface of the track.",
                        "vi": "Xe cộ đông đúc đã cày nát bề mặt đường đua."
                    }
                ]
            }
        ]
    },
    {
        "id": "e831e5d6c86e45739f85c100afefd60c",
        "word": "plow",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/plaʊ/",
            "us": "/plaʊ/"
        },
        "nearby": [
            {
                "word": "plough up",
                "pos": "phrasal verb"
            },
            {
                "word": "plover",
                "pos": "noun"
            },
            {
                "word": "plow",
                "pos": "noun"
            },
            {
                "word": "plow",
                "pos": "verb"
            },
            {
                "word": "plow back",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a large piece of farming equipment with one or several curved blades, (= metal cutting parts) pulled by a tractor or by animals. It is used for digging and turning over soil, especially before seeds are planted.",
                    "vi": "một thiết bị nông nghiệp lớn có một hoặc nhiều lưỡi cong, (= các bộ phận cắt bằng kim loại) được kéo bởi máy kéo hoặc động vật. Nó được dùng để đào và xới đất, đặc biệt là trước khi gieo hạt."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a4509ec0fe0c4b9195f105c9cc2ab011",
        "word": "plow",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/plaʊ/",
            "us": "/plaʊ/"
        },
        "nearby": [
            {
                "word": "plover",
                "pos": "noun"
            },
            {
                "word": "plow",
                "pos": "noun"
            },
            {
                "word": "plow",
                "pos": "verb"
            },
            {
                "word": "plow back",
                "pos": "phrasal verb"
            },
            {
                "word": "plow back in",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to dig and turn over a field or other area of land with a plow",
                    "vi": "để đào và lật ruộng hoặc diện tích đất khác bằng máy cày"
                },
                "examples": [
                    {
                        "en": "plowed fields",
                        "vi": "ruộng cày"
                    }
                ]
            },
            {
                "define": {
                    "en": "to do things that other people do not do, or be interested in things that other people are not interested in",
                    "vi": "làm những điều mà người khác không làm hoặc quan tâm đến những điều mà người khác không quan tâm"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "2ba91337e44d40e280f90d96c4246ffc",
        "word": "polytunnel",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpɒlitʌnl/",
            "us": "/ˈpɑːlitʌnl/"
        },
        "nearby": [
            {
                "word": "polytheistic",
                "pos": "adjective"
            },
            {
                "word": "polythene",
                "pos": "noun"
            },
            {
                "word": "polytunnel",
                "pos": "noun"
            },
            {
                "word": "polyunsaturated fat",
                "pos": "noun"
            },
            {
                "word": "polyunsaturates",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a long low structure covered with plastic, used for growing seeds or young plants outdoors",
                    "vi": "một cấu trúc dài thấp được bao phủ bởi nhựa, được sử dụng để trồng hạt giống hoặc cây non ngoài trời"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "59b0eaa100eb44f681b0b7fb0565ce02",
        "word": "pulse",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/pʌls/",
            "us": "/pʌls/"
        },
        "nearby": [
            {
                "word": "pulsate",
                "pos": "verb"
            },
            {
                "word": "pulsation",
                "pos": "noun"
            },
            {
                "word": "pulse",
                "pos": "noun"
            },
            {
                "word": "pulse",
                "pos": "verb"
            },
            {
                "word": "pulverize",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the regular beat of the heart as it sends blood around the body, that can be felt in different places, especially on the inside part of the wrist; the number of times the heart beats in a minute",
                    "vi": "nhịp đập đều đặn của trái tim khi nó đưa máu đi khắp cơ thể, có thể được cảm nhận ở những nơi khác nhau, đặc biệt là ở phần bên trong của cổ tay; số lần tim đập trong một phút"
                },
                "examples": [
                    {
                        "en": "a strong/weak pulse",
                        "vi": "một mạch mạnh / yếu"
                    },
                    {
                        "en": "an abnormally high pulse rate",
                        "vi": "nhịp tim cao bất thường"
                    },
                    {
                        "en": "The doctor took/felt my pulse.",
                        "vi": "Bác sĩ đã lấy / sờ mạch của tôi."
                    },
                    {
                        "en": "Fear sent her pulse racing (= made it beat very quickly).",
                        "vi": "Nỗi sợ hãi khiến nhịp đập của cô ấy đập nhanh (= khiến nó đập rất nhanh)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a strong regular beat in music",
                    "vi": "nhịp điệu mạnh mẽ thường xuyên trong âm nhạc"
                },
                "examples": [
                    {
                        "en": "the throbbing pulse of the drums",
                        "vi": "nhịp đập rộn ràng của trống"
                    }
                ]
            },
            {
                "define": {
                    "en": "a single short increase in the amount of light, sound or electricity produced by a machine, etc.",
                    "vi": "một sự gia tăng trong thời gian ngắn về lượng ánh sáng, âm thanh hoặc điện năng do máy tạo ra, v.v."
                },
                "examples": [
                    {
                        "en": "pulse waves",
                        "vi": "sóng xung"
                    },
                    {
                        "en": "sound pulses",
                        "vi": "xung âm thanh"
                    }
                ]
            },
            {
                "define": {
                    "en": "the seeds of some plants that are eaten as food, such as peas and lentils",
                    "vi": "hạt của một số cây được dùng làm thực phẩm, chẳng hạn như đậu Hà Lan và đậu lăng"
                },
                "examples": [
                    {
                        "en": "Pulses are a good source of protein.",
                        "vi": "Đậu là một nguồn protein tốt."
                    }
                ]
            },
            {
                "define": {
                    "en": "to always be aware of the most recent developments in a particular situation",
                    "vi": "luôn nhận thức được những phát triển gần đây nhất trong một tình huống cụ thể"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "2c00bfe493ba4dadb19358096f809047",
        "word": "rape",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/reɪp/",
            "us": "/reɪp/"
        },
        "nearby": [
            {
                "word": "rapaciously",
                "pos": "adverb"
            },
            {
                "word": "rapacity",
                "pos": "noun"
            },
            {
                "word": "rape",
                "pos": "noun"
            },
            {
                "word": "rape",
                "pos": "verb"
            },
            {
                "word": "The Rape of the Lock",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the crime of forcing somebody to have sex when they do not want it or are not able to agree to it",
                    "vi": "tội ép buộc ai đó quan hệ tình dục khi họ không muốn hoặc không thể đồng ý"
                },
                "examples": [
                    {
                        "en": "He was charged with rape.",
                        "vi": "Anh ta bị buộc tội hiếp dâm."
                    },
                    {
                        "en": "a rape charge",
                        "vi": "tội hiếp dâm"
                    },
                    {
                        "en": "an increase in the number of reported rapes",
                        "vi": "sự gia tăng số vụ cưỡng hiếp được báo cáo"
                    },
                    {
                        "en": "Rape has often been used as a weapon of war.",
                        "vi": "Hiếp dâm thường được sử dụng như một vũ khí chiến tranh."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of destroying an area or damaging its beauty in a way that seems unnecessary",
                    "vi": "hành động phá hủy một khu vực hoặc làm hỏng vẻ đẹp của nó theo cách có vẻ không cần thiết"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a plant with bright yellow flowers, grown as food for farm animals and for its seeds that are used to make oil",
                    "vi": "một loại cây có hoa màu vàng tươi, được trồng làm thức ăn cho động vật trang trại và lấy hạt của nó được sử dụng để làm dầu"
                },
                "examples": [
                    {
                        "en": "a field of rape",
                        "vi": "một lĩnh vực hiếp dâm"
                    },
                    {
                        "en": "refined rape oil",
                        "vi": "dầu cải dầu tinh luyện"
                    }
                ]
            }
        ]
    },
    {
        "id": "bf62b6d6ec6b44e69c0b983943451fc1",
        "word": "rapeseed",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈreɪpsiːd/",
            "us": "/ˈreɪpsiːd/"
        },
        "nearby": [
            {
                "word": "rape",
                "pos": "verb"
            },
            {
                "word": "The Rape of the Lock",
                "pos": ""
            },
            {
                "word": "rapeseed",
                "pos": "noun"
            },
            {
                "word": "rapid",
                "pos": "adjective"
            },
            {
                "word": "Rapid City",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "seeds of the rape plant, used mainly for cooking oil",
                    "vi": "hạt của cây cải dầu, được dùng chủ yếu để làm dầu ăn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "4c8fe3009f4749098cd152603e6659c6",
        "word": "rye",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/raɪ/",
            "us": "/raɪ/"
        },
        "nearby": [
            {
                "word": "Sue Ryder",
                "pos": ""
            },
            {
                "word": "the Ryder Cup",
                "pos": ""
            },
            {
                "word": "rye",
                "pos": "noun"
            },
            {
                "word": "ryegrass",
                "pos": "noun"
            },
            {
                "word": "Martin Ryle",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a plant that looks like barley but that produces larger grain, grown as food for animals and for making flour and whisky; the grain of this plant",
                    "vi": "một loại cây trông giống lúa mạch nhưng tạo ra hạt lớn hơn, được trồng làm thức ăn cho động vật và để làm bột mì và rượu whisky; hạt của cây này"
                },
                "examples": [
                    {
                        "en": "rye bread",
                        "vi": "bánh mì lúa mạch đen"
                    },
                    {
                        "en": "rye whisky",
                        "vi": "Rye Whisky"
                    }
                ]
            }
        ]
    },
    {
        "id": "d38a7cc6a66543b1828f214aaa09519a",
        "word": "scarecrow",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈskeəkrəʊ/",
            "us": "/ˈskerkrəʊ/"
        },
        "nearby": [
            {
                "word": "scare",
                "pos": "noun"
            },
            {
                "word": "scare away",
                "pos": "phrasal verb"
            },
            {
                "word": "scarecrow",
                "pos": "noun"
            },
            {
                "word": "scared",
                "pos": "adjective"
            },
            {
                "word": "scaredy-cat",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a figure made to look like a person, that is dressed in old clothes and put in a field to frighten birds away",
                    "vi": "một nhân vật được tạo ra để trông giống như một người, mặc quần áo cũ và đặt trên cánh đồng để làm chim sợ hãi"
                },
                "examples": []
            }
        ]
    }
]