[
    {
        "id": "f99899612187479694608dece41980c6",
        "word": "bag",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/bæɡ/",
            "us": "/bæɡ/"
        },
        "nearby": [
            {
                "word": "BAFTA",
                "pos": "abbreviation"
            },
            {
                "word": "BAFTA",
                "pos": "noun"
            },
            {
                "word": "bag",
                "pos": "noun"
            },
            {
                "word": "bag",
                "pos": "verb"
            },
            {
                "word": "bagatelle",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a container made of cloth, leather, plastic or paper, used to carry things in, especially when shopping or travelling",
                    "vi": "hộp đựng bằng vải, da, nhựa hoặc giấy, được sử dụng để đựng đồ đạc, đặc biệt là khi đi mua sắm hoặc đi du lịch"
                },
                "examples": [
                    {
                        "en": "He was carrying a heavy bag of groceries.",
                        "vi": "Anh ta đang mang một túi hàng tạp hóa nặng."
                    },
                    {
                        "en": "It was wrapped in a brown paper bag.",
                        "vi": "Nó được gói trong một túi giấy màu nâu."
                    },
                    {
                        "en": "Put it in a black plastic garbage bag.",
                        "vi": "Bỏ nó vào một túi nhựa đen đựng rác."
                    },
                    {
                        "en": "a make-up bag",
                        "vi": "một túi trang điểm"
                    },
                    {
                        "en": "a baby changing bag",
                        "vi": "túi thay đồ cho em bé"
                    },
                    {
                        "en": "She tipped out the contents of her bag (= handbag).",
                        "vi": "Cô ấy lật đồ trong túi ra (= túi xách)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a bag or case that you take when you are travelling; a piece of luggage",
                    "vi": "túi hoặc hộp đựng mà bạn mang theo khi đi du lịch; một kiện hành lý"
                },
                "examples": [
                    {
                        "en": "I packed my bags and left for the airport.",
                        "vi": "Tôi thu dọn hành lý và ra sân bay."
                    },
                    {
                        "en": "He's upstairs unpacking his bags.",
                        "vi": "Anh ấy đang ở trên lầu mở túi xách của mình."
                    },
                    {
                        "en": "Each passenger is allowed one carry-on bag.",
                        "vi": "Mỗi hành khách được phép mang một hành lý xách tay."
                    },
                    {
                        "en": "He was carrying a leather travelling bag.",
                        "vi": "Anh ta đang mang một chiếc túi du lịch bằng da."
                    },
                    {
                        "en": "You can check bags of up to 23kg for free.",
                        "vi": "Bạn có thể kiểm tra miễn phí các túi có trọng lượng lên đến 23kg."
                    }
                ]
            },
            {
                "define": {
                    "en": "the amount contained in a bag",
                    "vi": "số lượng chứa trong một túi"
                },
                "examples": [
                    {
                        "en": "She ate a bag of chips.",
                        "vi": "Cô ấy đã ăn một túi khoai tây chiên."
                    }
                ]
            },
            {
                "define": {
                    "en": "a large amount or a large number of something",
                    "vi": "một số lượng lớn hoặc một số lượng lớn thứ gì đó"
                },
                "examples": [
                    {
                        "en": "Get in! There's bags of room.",
                        "vi": "Đi vào! Có nhiều túi phòng."
                    }
                ]
            },
            {
                "define": {
                    "en": "dark circles or loose folds of skin under the eyes, as a result of getting old or lack of sleep",
                    "vi": "quầng thâm hoặc nếp nhăn lỏng lẻo của da dưới mắt, do già hoặc thiếu ngủ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "an offensive word for an unpleasant or angry older woman",
                    "vi": "một từ xúc phạm đối với một người phụ nữ lớn tuổi khó chịu hoặc tức giận"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "all the birds, animals, etc. shot or caught on one occasion",
                    "vi": "tất cả các loài chim, động vật, v.v. bị bắn hoặc bắt vào một dịp"
                },
                "examples": [
                    {
                        "en": "We got a good bag today.",
                        "vi": "Hôm nay chúng tôi có một chiếc túi tốt."
                    }
                ]
            },
            {
                "define": {
                    "en": "(not) something that you are interested in or good at",
                    "vi": "(không phải) điều gì đó mà bạn quan tâm hoặc giỏi"
                },
                "examples": [
                    {
                        "en": "Poetry isn't really my bag.",
                        "vi": "Thơ không thực sự là túi của tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "with all your possessions, especially secretly or suddenly",
                    "vi": "với tất cả tài sản của bạn, đặc biệt là bí mật hoặc đột ngột"
                },
                "examples": [
                    {
                        "en": "He threw her out onto the street, bag and baggage.",
                        "vi": "Anh ném cô ra đường, túi xách và hành lý."
                    }
                ]
            },
            {
                "define": {
                    "en": "a very thin person or animal",
                    "vi": "một người hoặc động vật rất gầy"
                },
                "examples": [
                    {
                        "en": "The cat hadn’t been fed for weeks and was just a bag of bones.",
                        "vi": "Con mèo đã không được cho ăn trong nhiều tuần và chỉ là một cái túi xương."
                    }
                ]
            },
            {
                "define": {
                    "en": "a set of methods or equipment that somebody can use",
                    "vi": "một tập hợp các phương pháp hoặc thiết bị mà ai đó có thể sử dụng"
                },
                "examples": [
                    {
                        "en": "Hotel managers are using a whole new bag of tricks to attract their guests.",
                        "vi": "Các nhà quản lý khách sạn đang sử dụng nhiều chiêu trò hoàn toàn mới để thu hút khách của họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be very nervous",
                    "vi": "rất lo lắng"
                },
                "examples": [
                    {
                        "en": "By the time of the interview, I was a bundle of nerves.",
                        "vi": "Vào thời điểm phỏng vấn, tôi đã bó tay."
                    }
                ]
            },
            {
                "define": {
                    "en": "if something is in the bag, it is almost certain to be won or achieved",
                    "vi": "nếu có thứ gì đó trong túi, nó gần như chắc chắn sẽ giành được hoặc đạt được"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to suddenly make somebody responsible for something important, such as finishing a difficult job, that is really your responsibility",
                    "vi": "đột nhiên bắt ai đó phải chịu trách nhiệm về một việc quan trọng, chẳng hạn như hoàn thành một công việc khó khăn, đó thực sự là trách nhiệm của bạn"
                },
                "examples": [
                    {
                        "en": "You two were going to fly off and leave me holding the bag.",
                        "vi": "Hai người định bay đi và để lại tôi cầm cái túi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to tell a secret carelessly or by mistake",
                    "vi": "nói một bí mật một cách bất cẩn hoặc do nhầm lẫn"
                },
                "examples": [
                    {
                        "en": "I wanted it to be a surprise, but my sister let the cat out of the bag.",
                        "vi": "Tôi muốn nó là một bất ngờ, nhưng em gái tôi đã để con mèo ra khỏi túi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to leave a person or place permanently, especially after an argument",
                    "vi": "rời khỏi một người hoặc một nơi vĩnh viễn, đặc biệt là sau một cuộc tranh cãi"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to succeed in doing something difficult by making an extra effort or doing something clever or surprising",
                    "vi": "để thành công khi làm điều gì đó khó khăn bằng cách nỗ lực thêm hoặc làm điều gì đó thông minh hoặc đáng ngạc nhiên"
                },
                "examples": [
                    {
                        "en": "We managed to pull it out of the bag despite not being at our best for most of the game.",
                        "vi": "Chúng tôi đã cố gắng rút nó ra khỏi túi mặc dù không ở trạng thái tốt nhất trong phần lớn thời gian của trận đấu."
                    }
                ]
            }
        ]
    },
    {
        "id": "0621c1f2ce47470cb8ae07d27bd206ad",
        "word": "glass",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/ɡlɑːs/",
            "us": "/ɡlæs/"
        },
        "nearby": [
            {
                "word": "the Glasgow School",
                "pos": ""
            },
            {
                "word": "glasnost",
                "pos": "noun"
            },
            {
                "word": "glass",
                "pos": "noun"
            },
            {
                "word": "glass",
                "pos": "verb"
            },
            {
                "word": "glass-blower",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a hard, usually clear, substance used, for example, for making windows and bottles",
                    "vi": "Ví dụ, một chất cứng, thường trong suốt, được sử dụng để làm cửa sổ và chai"
                },
                "examples": [
                    {
                        "en": "a sheet/pane of glass",
                        "vi": "một tấm / tấm kính"
                    },
                    {
                        "en": "I cut myself on a piece of broken glass.",
                        "vi": "Tôi tự cắt mình trên một mảnh kính vỡ."
                    },
                    {
                        "en": "frosted/toughened glass",
                        "vi": "kính mờ / kính cường lực"
                    },
                    {
                        "en": "a glass bottle/jar",
                        "vi": "một chai / lọ thủy tinh"
                    },
                    {
                        "en": "sliding glass doors",
                        "vi": "cửa kính trượt"
                    },
                    {
                        "en": "a glass roof/dome/panel",
                        "vi": "mái che / mái vòm / bảng điều khiển bằng kính"
                    },
                    {
                        "en": "under glass The vegetables are grown under glass (= in a greenhouse).",
                        "vi": "dưới kính Các loại rau được trồng dưới kính (= trong nhà kính)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a container made of glass, used for drinking out of",
                    "vi": "một hộp đựng bằng thủy tinh, được sử dụng để uống"
                },
                "examples": [
                    {
                        "en": "He poured orange juice into a glass.",
                        "vi": "Anh rót nước cam vào ly."
                    },
                    {
                        "en": "a champagne/beer glass",
                        "vi": "một ly sâm panh / bia"
                    },
                    {
                        "en": "a shot glass",
                        "vi": "một ly bắn"
                    },
                    {
                        "en": "a pint glass",
                        "vi": "một ly rượu"
                    }
                ]
            },
            {
                "define": {
                    "en": "the contents of a glass",
                    "vi": "nội dung của một cái ly"
                },
                "examples": [
                    {
                        "en": "He drank three whole glasses.",
                        "vi": "Anh ta uống hết ba ly."
                    },
                    {
                        "en": "glass of something a glass of wine/water",
                        "vi": "ly gì đó ly rượu / nước"
                    }
                ]
            },
            {
                "define": {
                    "en": "two lenses in a frame that rests on the nose and ears. People wear glasses in order to be able to see better or to protect their eyes from bright light.",
                    "vi": "hai thấu kính trong một khung đặt trên mũi và tai. Người ta đeo kính để có thể nhìn rõ hơn hoặc để bảo vệ mắt khỏi ánh sáng chói."
                },
                "examples": [
                    {
                        "en": "a pair of glasses",
                        "vi": "một cặp kính"
                    },
                    {
                        "en": "reading glasses",
                        "vi": "kính đọc"
                    },
                    {
                        "en": "I wear glasses for driving.",
                        "vi": "Tôi đeo kính để lái xe."
                    }
                ]
            },
            {
                "define": {
                    "en": "objects made of glass",
                    "vi": "đồ vật làm bằng thủy tinh"
                },
                "examples": [
                    {
                        "en": "We keep all our glass and china in this cupboard.",
                        "vi": "Chúng tôi giữ tất cả thủy tinh và đồ sành sứ của chúng tôi trong tủ này."
                    },
                    {
                        "en": "She has a fine collection of Bohemian glass.",
                        "vi": "Cô ấy có một bộ sưu tập thủy tinh Bohemian tốt."
                    }
                ]
            },
            {
                "define": {
                    "en": "a protecting cover made of glass on a watch, picture or photograph frame, fire alarm, etc.",
                    "vi": "một lớp bảo vệ làm bằng kính trên khung đồng hồ, tranh ảnh, báo cháy, v.v."
                },
                "examples": [
                    {
                        "en": "In case of emergency, break the glass and press the button.",
                        "vi": "Trong trường hợp khẩn cấp, hãy đập vỡ kính và bấm nút."
                    }
                ]
            },
            {
                "define": {
                    "en": "a mirror",
                    "vi": "một cái gương"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a barometer",
                    "vi": "một phong vũ biểu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "you should not criticize other people, because they will easily find ways of criticizing you",
                    "vi": "bạn không nên chỉ trích người khác, vì họ sẽ dễ dàng tìm cách chỉ trích bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to hold up your glass and wish somebody happiness, good luck, etc. before you drink",
                    "vi": "nâng ly và chúc ai đó hạnh phúc, may mắn, v.v. trước khi uống"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "1fdf2e1dc83242c5bdad70d00e3c4a54",
        "word": "specs",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/speks/",
            "us": "/speks/"
        },
        "nearby": [
            {
                "word": "speckled",
                "pos": "adjective"
            },
            {
                "word": "specky",
                "pos": "adjective"
            },
            {
                "word": "specs",
                "pos": "noun"
            },
            {
                "word": "spectacle",
                "pos": "noun"
            },
            {
                "word": "spectacular",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "two lenses in a frame that rests on the nose and ears. People wear glasses in order to be able to see better or to protect their eyes from bright light.",
                    "vi": "hai thấu kính trong một khung đặt trên mũi và tai. Người ta đeo kính để có thể nhìn rõ hơn hoặc để bảo vệ mắt khỏi ánh sáng chói."
                },
                "examples": [
                    {
                        "en": "I need a new pair of specs.",
                        "vi": "Tôi cần một cặp thông số kỹ thuật mới."
                    }
                ]
            },
            {
                "define": {
                    "en": "a detailed description of something, especially the design and materials needed to produce something",
                    "vi": "mô tả chi tiết về thứ gì đó, đặc biệt là thiết kế và vật liệu cần thiết để sản xuất thứ gì đó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "356488adc2914e21ac514c1e8dfe2d25",
        "word": "watch",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/wɒtʃ/",
            "us": "/wɑːtʃ/"
        },
        "nearby": [
            {
                "word": "wastrel",
                "pos": "noun"
            },
            {
                "word": "watch",
                "pos": "verb"
            },
            {
                "word": "watch",
                "pos": "noun"
            },
            {
                "word": "watchable",
                "pos": "adjective"
            },
            {
                "word": "watchband",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a type of small clock that you wear on your wrist, or (in the past) carried in your pocket",
                    "vi": "một loại đồng hồ nhỏ mà bạn đeo trên cổ tay hoặc (trước đây) bỏ trong túi"
                },
                "examples": [
                    {
                        "en": "She kept looking anxiously at her watch.",
                        "vi": "Cô ấy cứ lo lắng nhìn đồng hồ đeo tay."
                    },
                    {
                        "en": "He paced nervously, checking his watch.",
                        "vi": "Anh lo lắng đi đi lại lại, kiểm tra đồng hồ."
                    },
                    {
                        "en": "My watch is fast/slow.",
                        "vi": "Đồng hồ của tôi là nhanh / chậm."
                    },
                    {
                        "en": "Sorry I'm late—my watch has stopped.",
                        "vi": "Xin lỗi, tôi đến muộn — đồng hồ của tôi đã dừng."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of watching somebody/something carefully in case of possible danger or problems",
                    "vi": "hành động quan sát ai đó / cái gì đó cẩn thận trong trường hợp nguy hiểm hoặc vấn đề có thể xảy ra"
                },
                "examples": [
                    {
                        "en": "The police have mounted a watch outside the hotel.",
                        "vi": "Cảnh sát đã gắn một chiếc đồng hồ bên ngoài khách sạn."
                    },
                    {
                        "en": "I'll keep watch while you go through his papers (= watch and warn you if somebody is coming).",
                        "vi": "Tôi sẽ theo dõi trong khi bạn xem xét giấy tờ của anh ta (= theo dõi và cảnh báo bạn nếu có ai đó đến)."
                    },
                    {
                        "en": "The government is keeping a close watch on how the situation develops.",
                        "vi": "Chính phủ đang theo dõi chặt chẽ tình hình phát triển như thế nào."
                    }
                ]
            },
            {
                "define": {
                    "en": "a fixed period of time, usually while other people are asleep, during which somebody watches for any danger so that they can warn others, for example on a ship; the person or people who do this",
                    "vi": "một khoảng thời gian cố định, thường là khi những người khác đang ngủ, trong thời gian đó ai đó quan sát mọi nguy hiểm để họ có thể cảnh báo những người khác, chẳng hạn như trên tàu; người hoặc những người làm điều này"
                },
                "examples": [
                    {
                        "en": "on watch I go on watch in an hour.",
                        "vi": "trên đồng hồ, tôi tiếp tục xem trong một giờ nữa."
                    },
                    {
                        "en": "I'm on first watch.",
                        "vi": "Tôi đến xem đầu tiên."
                    }
                ]
            },
            {
                "define": {
                    "en": "a notice or an announcement that warns the public that there may be severe weather conditions very soon",
                    "vi": "một thông báo hoặc một thông báo cảnh báo công chúng rằng có thể có các điều kiện thời tiết khắc nghiệt rất sớm"
                },
                "examples": [
                    {
                        "en": "They're in charge of issuing the tornado watches.",
                        "vi": "Họ phụ trách phát hành đồng hồ lốc xoáy."
                    },
                    {
                        "en": "We have tornado watches in effect for a lot of Florida.",
                        "vi": "Chúng tôi có đồng hồ lốc xoáy có hiệu lực ở nhiều bang Florida."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be looking carefully for somebody/something that you expect to see, especially in order to avoid possible danger",
                    "vi": "đang tìm kiếm một người / điều gì đó mà bạn mong đợi được nhìn thấy một cách cẩn thận, đặc biệt là để tránh nguy hiểm có thể xảy ra"
                },
                "examples": [
                    {
                        "en": "Be on the watch for thieves.",
                        "vi": "Hãy đề phòng kẻ trộm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to watch somebody/something carefully",
                    "vi": "để xem ai đó / cái gì đó cẩn thận"
                },
                "examples": [
                    {
                        "en": "Over the next few months we will keep a close watch on sales.",
                        "vi": "Trong vài tháng tới, chúng tôi sẽ theo dõi chặt chẽ doanh số bán hàng."
                    }
                ]
            }
        ]
    },
    {
        "id": "b42ef95fe0854b10a7d51b0f7e3c298b",
        "word": "belt",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/belt/",
            "us": "/belt/"
        },
        "nearby": [
            {
                "word": "below",
                "pos": "preposition"
            },
            {
                "word": "below-the-fold",
                "pos": "adjective"
            },
            {
                "word": "belt",
                "pos": "noun"
            },
            {
                "word": "belt",
                "pos": "verb"
            },
            {
                "word": "belt drive",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a long narrow piece of leather, cloth, etc. that you wear around the middle part of your body",
                    "vi": "một mảnh da, vải, v.v., dài hẹp mà bạn đeo quanh phần giữa của cơ thể"
                },
                "examples": [
                    {
                        "en": "to do up/fasten/tighten a belt",
                        "vi": "sửa chữa / thắt chặt / thắt chặt một vành đai"
                    },
                    {
                        "en": "a belt buckle",
                        "vi": "một khóa thắt lưng"
                    },
                    {
                        "en": "a studded leather belt",
                        "vi": "thắt lưng da nạm"
                    },
                    {
                        "en": "Around his waist he wore a belt.",
                        "vi": "Quanh eo anh ta đeo một chiếc thắt lưng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a continuous band of material that moves round and is used to carry things along or to drive a machine",
                    "vi": "một dải vật liệu liên tục chuyển động tròn và được sử dụng để chở đồ vật hoặc để điều khiển máy móc"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a narrow area or an area around the edge of something that has particular characteristics",
                    "vi": "một khu vực hẹp hoặc một khu vực xung quanh rìa của thứ gì đó có đặc điểm cụ thể"
                },
                "examples": [
                    {
                        "en": "the country’s corn/industrial belt",
                        "vi": "ngô / vành đai công nghiệp của đất nước"
                    },
                    {
                        "en": "We live in the commuter belt.",
                        "vi": "Chúng tôi sống trong vành đai đi lại."
                    },
                    {
                        "en": "a narrow belt of trees",
                        "vi": "một vành đai hẹp của cây"
                    },
                    {
                        "en": "a belt of rain moving across the country",
                        "vi": "một vành đai mưa di chuyển trên khắp đất nước"
                    },
                    {
                        "en": "Towns in the country's industrial belt were particularly affected by the recession.",
                        "vi": "Các thị trấn trong vành đai công nghiệp của đất nước bị ảnh hưởng đặc biệt bởi suy thoái kinh tế."
                    }
                ]
            },
            {
                "define": {
                    "en": "an act of hitting something/somebody hard",
                    "vi": "một hành động đánh một cái gì đó / ai đó cứng"
                },
                "examples": [
                    {
                        "en": "She gave the ball a terrific belt.",
                        "vi": "Cô ấy đã cho quả bóng một chiếc đai tuyệt vời."
                    }
                ]
            },
            {
                "define": {
                    "en": "unfair or cruel",
                    "vi": "không công bằng hoặc độc ác"
                },
                "examples": [
                    {
                        "en": "That was distinctly below the belt!",
                        "vi": "Đó là rõ ràng bên dưới thắt lưng!"
                    }
                ]
            },
            {
                "define": {
                    "en": "taking more actions than are really necessary to make sure that something succeeds or works as it should",
                    "vi": "thực hiện nhiều hành động hơn mức thực sự cần thiết để đảm bảo rằng điều gì đó thành công hoặc hoạt động như bình thường"
                },
                "examples": [
                    {
                        "en": "a belt-and-braces policy",
                        "vi": "chính sách thắt lưng và buộc dây"
                    }
                ]
            },
            {
                "define": {
                    "en": "to have already achieved or obtained something",
                    "vi": "đã đạt được hoặc đã đạt được điều gì đó"
                },
                "examples": [
                    {
                        "en": "She already has a couple of good wins under her belt.",
                        "vi": "Cô ấy đã có một vài trận thắng tốt dưới đai của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to spend less money because there is less available",
                    "vi": "chi tiêu ít tiền hơn bởi vì có ít hơn"
                },
                "examples": [
                    {
                        "en": "With price increases on most goods, everyone is having to tighten their belt.",
                        "vi": "Với sự tăng giá của hầu hết các mặt hàng, mọi người đang phải thắt lưng buộc bụng."
                    },
                    {
                        "en": "There is a need for further belt-tightening.",
                        "vi": "Cần phải thắt chặt thêm dây đai."
                    }
                ]
            }
        ]
    },
    {
        "id": "3464311a91174a808e15432d5e40b765",
        "word": "handbag",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈhændbæɡ/",
            "us": "/ˈhændbæɡ/"
        },
        "nearby": [
            {
                "word": "hand around",
                "pos": "phrasal verb"
            },
            {
                "word": "hand back",
                "pos": "phrasal verb"
            },
            {
                "word": "handbag",
                "pos": "noun"
            },
            {
                "word": "hand baggage",
                "pos": "noun"
            },
            {
                "word": "handball",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small bag for money, keys, etc., especially one carried by a woman",
                    "vi": "một chiếc túi nhỏ đựng tiền, chìa khóa, v.v., đặc biệt là một chiếc do phụ nữ mang"
                },
                "examples": [
                    {
                        "en": "She was rummaging in her handbag for her keys.",
                        "vi": "Cô ấy đang lục trong túi xách để lấy chìa khóa."
                    },
                    {
                        "en": "She took a pen out of her large leather handbag.",
                        "vi": "Cô ấy lấy một cây bút ra khỏi chiếc túi xách da lớn của mình."
                    },
                    {
                        "en": "I had my handbag stolen at the train station.",
                        "vi": "Tôi đã bị đánh cắp túi xách của tôi ở nhà ga xe lửa."
                    },
                    {
                        "en": "She put her purse into her handbag.",
                        "vi": "Cô ấy bỏ ví vào túi xách của mình."
                    }
                ]
            }
        ]
    },
    {
        "id": "6b9cd68b7cad486696717a914400378f",
        "word": "purse",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/pɜːs/",
            "us": "/pɜːrs/"
        },
        "nearby": [
            {
                "word": "purr",
                "pos": "noun"
            },
            {
                "word": "purr",
                "pos": "verb"
            },
            {
                "word": "purse",
                "pos": "noun"
            },
            {
                "word": "purse",
                "pos": "verb"
            },
            {
                "word": "purser",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small bag made of leather, plastic, etc. for carrying coins and often also paper money, cards, etc., used especially by women",
                    "vi": "một chiếc túi nhỏ bằng da, nhựa, v.v. để đựng tiền xu và thường là tiền giấy, thẻ, v.v., được phụ nữ đặc biệt sử dụng"
                },
                "examples": [
                    {
                        "en": "I took a coin out of my purse and gave it to the child.",
                        "vi": "Tôi lấy một đồng xu ra khỏi ví và đưa cho đứa trẻ."
                    },
                    {
                        "en": "She handed him a bulging velvet purse.",
                        "vi": "Cô đưa cho anh một chiếc ví nhung căng phồng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a small bag for money, keys, etc., carried especially by women",
                    "vi": "một chiếc túi nhỏ đựng tiền, chìa khóa, v.v., được phụ nữ đặc biệt mang theo"
                },
                "examples": [
                    {
                        "en": "She grabbed her purse and headed out the door.",
                        "vi": "Cô nắm lấy ví của mình và đi ra cửa."
                    },
                    {
                        "en": "I rummaged through my purse for my lip gloss.",
                        "vi": "Tôi lục trong ví lấy son bóng."
                    },
                    {
                        "en": "She had her purse snatched.",
                        "vi": "Cô ấy đã bị giật ví."
                    },
                    {
                        "en": "She slung her black leather purse over her shoulder.",
                        "vi": "Cô đeo chiếc ví da đen của mình qua vai."
                    },
                    {
                        "en": "She wore pink heels with a matching clutch purse.",
                        "vi": "Cô đi giày cao gót màu hồng với một chiếc ví cầm tay phù hợp."
                    },
                    {
                        "en": "She fumbled in her purse for her glasses.",
                        "vi": "Cô lần mò trong ví lấy cặp kính."
                    }
                ]
            },
            {
                "define": {
                    "en": "the amount of money that is available to a person, an organization or a government to spend",
                    "vi": "số tiền mà một người, một tổ chức hoặc chính phủ có thể chi tiêu"
                },
                "examples": [
                    {
                        "en": "We have holidays to suit every purse.",
                        "vi": "Chúng tôi có những ngày lễ phù hợp với mọi túi tiền."
                    },
                    {
                        "en": "Should spending on the arts be met out of the public purse (= from government money)?",
                        "vi": "Chi tiêu cho nghệ thuật có nên được đáp ứng từ hầu bao công cộng (= từ tiền của chính phủ)?"
                    }
                ]
            },
            {
                "define": {
                    "en": "a sum of money given as a prize in a boxing match",
                    "vi": "một khoản tiền được trao như một giải thưởng trong một trận đấu quyền anh"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "(you won't) succeed in making something good out of material that does not seem very good at all",
                    "vi": "(bạn sẽ không) thành công trong việc tạo ra một thứ gì đó tốt từ những thứ có vẻ không tốt chút nào"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "04bc435cec6d4e40a9084374f232dccc",
        "word": "sunglasses",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈsʌnɡlɑːsɪz/",
            "us": "/ˈsʌnɡlæsɪz/"
        },
        "nearby": [
            {
                "word": "sunflower",
                "pos": "noun"
            },
            {
                "word": "sung",
                "pos": "verb"
            },
            {
                "word": "sunglasses",
                "pos": "noun"
            },
            {
                "word": "sun hat",
                "pos": "noun"
            },
            {
                "word": "sunk",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a pair of glasses with dark glass in them that you wear to protect your eyes from bright light from the sun",
                    "vi": "bạn đeo một cặp kính có kính sẫm màu để bảo vệ mắt khỏi ánh sáng chói từ mặt trời"
                },
                "examples": [
                    {
                        "en": "a pair of sunglasses",
                        "vi": "một cặp kính râm"
                    },
                    {
                        "en": "Her sunglasses were perched on her head.",
                        "vi": "Kính râm của cô ấy được đặt trên đầu."
                    }
                ]
            }
        ]
    },
    {
        "id": "0804019a92ea4341a1cc20ed8c7e8873",
        "word": "wallet",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈwɒlɪt/",
            "us": "/ˈwɑːlɪt/"
        },
        "nearby": [
            {
                "word": "wallcovering",
                "pos": "noun"
            },
            {
                "word": "'Fats' Waller",
                "pos": ""
            },
            {
                "word": "wallet",
                "pos": "noun"
            },
            {
                "word": "walleye",
                "pos": "noun"
            },
            {
                "word": "wallflower",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small, flat, folding case made of leather or plastic used for keeping paper money and credit cards in",
                    "vi": "một hộp gấp nhỏ, phẳng, làm bằng da hoặc nhựa được sử dụng để giữ tiền giấy và thẻ tín dụng trong"
                },
                "examples": [
                    {
                        "en": "He carried a photo of his children in his wallet.",
                        "vi": "Anh ta mang theo một bức ảnh của các con mình trong ví."
                    },
                    {
                        "en": "He pulled a €50 note out of his fat wallet.",
                        "vi": "Anh ta rút một tờ 50 € ra khỏi chiếc ví béo của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "a flat case made of leather, plastic or card for carrying documents in",
                    "vi": "một hộp phẳng làm bằng da, nhựa hoặc thẻ để đựng tài liệu trong"
                },
                "examples": [
                    {
                        "en": "a document wallet",
                        "vi": "một ví tài liệu"
                    }
                ]
            }
        ]
    },
    {
        "id": "9ac7e0340a494c93a7601f786a3a61e1",
        "word": "glove",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ɡlʌv/",
            "us": "/ɡlʌv/"
        },
        "nearby": [
            {
                "word": "Gloucester",
                "pos": ""
            },
            {
                "word": "Gloucestershire",
                "pos": ""
            },
            {
                "word": "glove",
                "pos": "noun"
            },
            {
                "word": "glovebox",
                "pos": "noun"
            },
            {
                "word": "glove compartment",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a piece of clothing for the hand, made of wool, leather, etc. with separate parts for each finger and the thumb",
                    "vi": "một bộ quần áo cho bàn tay, bằng len, da, v.v. với các bộ phận riêng biệt cho từng ngón tay và ngón cái"
                },
                "examples": [
                    {
                        "en": "a pair of gloves",
                        "vi": "một đôi găng tay"
                    },
                    {
                        "en": "rubber/latex gloves",
                        "vi": "găng tay cao su / cao su"
                    },
                    {
                        "en": "gardening/boxing gloves",
                        "vi": "găng tay làm vườn / đấm bốc"
                    },
                    {
                        "en": "The burglar must have been wearing gloves.",
                        "vi": "Tên trộm chắc hẳn đã đeo găng tay."
                    },
                    {
                        "en": "She peeled off her glove to reveal a wedding ring.",
                        "vi": "Cô tự lột găng tay để lộ nhẫn cưới."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be the perfect size or shape for somebody",
                    "vi": "trở thành kích thước hoặc hình dạng hoàn hảo cho ai đó"
                },
                "examples": [
                    {
                        "en": "The dress fits me like a glove.",
                        "vi": "Chiếc váy vừa vặn với tôi như một chiếc găng tay."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that somebody is ready for a fight or an argument",
                    "vi": "được sử dụng để nói rằng ai đó đã sẵn sàng cho một cuộc chiến hoặc một cuộc tranh cãi"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "working closely with somebody, especially in a secret and/or illegal way",
                    "vi": "hợp tác chặt chẽ với ai đó, đặc biệt là theo cách bí mật và / hoặc bất hợp pháp"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to deal with somebody in a very careful way so that you do not offend or upset them",
                    "vi": "đối phó với ai đó một cách rất cẩn thận để bạn không xúc phạm hoặc làm họ khó chịu"
                },
                "examples": [
                    {
                        "en": "Treat her with kid gloves—she's very sensitive.",
                        "vi": "Đối xử với cô ấy bằng găng tay trẻ em - cô ấy rất nhạy cảm."
                    }
                ]
            },
            {
                "define": {
                    "en": "if you use the words an iron fist/hand when describing the way that somebody behaves, you mean that they treat people severely. This treatment may be hidden behind a kind appearance (the velvet glove).",
                    "vi": "nếu bạn sử dụng các từ như một nắm đấm / bàn tay sắt khi mô tả cách một người nào đó cư xử, bạn có nghĩa là họ đối xử nghiêm khắc với mọi người. Phương pháp điều trị này có thể ẩn sau vẻ ngoài tử tế (chiếc găng tay nhung)."
                },
                "examples": [
                    {
                        "en": "They promised that the army would strike with an iron fist at any resistance.",
                        "vi": "Họ hứa rằng quân đội sẽ tấn công bằng nắm đấm sắt vào bất kỳ sự kháng cự nào."
                    },
                    {
                        "en": "The iron hand in the velvet glove approach seems to work best with this age group.",
                        "vi": "Phương pháp tiếp cận bàn tay sắt trong cách tiếp cận găng tay nhung dường như hiệu quả nhất với nhóm tuổi này."
                    }
                ]
            }
        ]
    },
    {
        "id": "f6a7989fa7504ec7892e19f647f71819",
        "word": "badge",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/bædʒ/",
            "us": "/bædʒ/"
        },
        "nearby": [
            {
                "word": "bade",
                "pos": "verb"
            },
            {
                "word": "Lord Baden-Powell",
                "pos": ""
            },
            {
                "word": "badge",
                "pos": "noun"
            },
            {
                "word": "badger",
                "pos": "noun"
            },
            {
                "word": "badger",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small piece of metal or plastic, with a design or words on it, that a person wears or carries to show that they belong to an organization, support something, have achieved something, have a particular rank, etc.",
                    "vi": "một mảnh kim loại hoặc nhựa nhỏ, có thiết kế hoặc dòng chữ mà một người đeo hoặc mang để thể hiện rằng họ thuộc về một tổ chức, ủng hộ điều gì đó, đã đạt được điều gì đó, có một thứ hạng cụ thể, v.v."
                },
                "examples": [
                    {
                        "en": "She wore a badge saying ‘Vote for Coates’.",
                        "vi": "Cô ấy đeo một huy hiệu có nội dung 'Hãy bình chọn cho Coates'."
                    },
                    {
                        "en": "All employees have to wear name badges.",
                        "vi": "Tất cả nhân viên phải đeo bảng tên."
                    },
                    {
                        "en": "He pulled out a badge and said he was a cop.",
                        "vi": "Anh ta rút ra một chiếc huy hiệu và nói rằng anh ta là cảnh sát."
                    },
                    {
                        "en": "parking for disabled badge holders",
                        "vi": "đậu xe cho người khuyết tật"
                    },
                    {
                        "en": "The police officer flashed his badge.",
                        "vi": "Viên cảnh sát nháy phù hiệu."
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of material that you sew onto clothes as part of a uniform",
                    "vi": "một phần vật liệu mà bạn may vào quần áo như một phần của đồng phục"
                },
                "examples": [
                    {
                        "en": "the school badge",
                        "vi": "huy hiệu trường"
                    }
                ]
            },
            {
                "define": {
                    "en": "a symbol of a particular quality or status",
                    "vi": "một biểu tượng của một chất lượng hoặc trạng thái cụ thể"
                },
                "examples": [
                    {
                        "en": "His gun was a badge of power for him.",
                        "vi": "Khẩu súng của anh ta là một huy hiệu quyền lực đối với anh ta."
                    },
                    {
                        "en": "Her badge of office, a large gold key, hung around her neck.",
                        "vi": "Huy hiệu của chức vụ, một chiếc chìa khóa lớn bằng vàng, treo quanh cổ cô."
                    },
                    {
                        "en": "He saw his injuries as a badge of honour.",
                        "vi": "Anh xem vết thương của mình như một huy hiệu của danh dự."
                    }
                ]
            }
        ]
    },
    {
        "id": "e684bee46d6b442e9577ba1d9227ee8b",
        "word": "accessory",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/əkˈsesəri/",
            "us": "/əkˈsesəri/"
        },
        "nearby": [
            {
                "word": "accession",
                "pos": "noun"
            },
            {
                "word": "accessorize",
                "pos": "verb"
            },
            {
                "word": "accessory",
                "pos": "noun"
            },
            {
                "word": "accessory",
                "pos": "adjective"
            },
            {
                "word": "access provider",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an extra piece of equipment that is useful but not essential or that can be added to something else as a decoration",
                    "vi": "một phần thiết bị bổ sung hữu ích nhưng không cần thiết hoặc có thể được thêm vào một thứ khác như một vật trang trí"
                },
                "examples": [
                    {
                        "en": "We stock a large range of bicycle accessories.",
                        "vi": "Chúng tôi có một lượng lớn các phụ kiện xe đạp."
                    },
                    {
                        "en": "Our catalogue now includes a range of furnishings and accessories for the home.",
                        "vi": "Danh mục của chúng tôi hiện bao gồm một loạt các đồ nội thất và phụ kiện cho ngôi nhà."
                    }
                ]
            },
            {
                "define": {
                    "en": "a thing that you can wear or carry that matches your clothes, for example a belt or a bag",
                    "vi": "một thứ mà bạn có thể mặc hoặc mang theo phù hợp với quần áo của mình, ví dụ như thắt lưng hoặc túi xách"
                },
                "examples": [
                    {
                        "en": "fashion accessories to dress up your wardrobe",
                        "vi": "phụ kiện thời trang để trang điểm cho tủ quần áo của bạn"
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who helps somebody to commit a crime or who knows about it and protects the person from the police",
                    "vi": "người giúp ai đó phạm tội hoặc người biết về điều đó và bảo vệ người đó khỏi cảnh sát"
                },
                "examples": [
                    {
                        "en": "He was charged with being an accessory to murder.",
                        "vi": "Anh ta bị buộc tội là một phụ kiện cho tội giết người."
                    },
                    {
                        "en": "(old-fashioned) an accessory before/after the fact (= before/after the crime was committed)",
                        "vi": "(kiểu cũ) một phụ kiện trước / sau sự việc (= trước / sau khi tội ác được thực hiện)"
                    }
                ]
            }
        ]
    },
    {
        "id": "ffa261f4580945cb9e431b7f5cb263b2",
        "word": "goggles",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈɡɒɡlz/",
            "us": "/ˈɡɑːɡlz/"
        },
        "nearby": [
            {
                "word": "goggle-box",
                "pos": "noun"
            },
            {
                "word": "goggle-eyed",
                "pos": "adjective"
            },
            {
                "word": "goggles",
                "pos": "noun"
            },
            {
                "word": "the Gogmagog Hills",
                "pos": ""
            },
            {
                "word": "gogo",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a pair of glasses that fit closely to the face to protect the eyes from wind, dust, water, etc. or give extra visual powers",
                    "vi": "một cặp kính vừa khít với khuôn mặt để bảo vệ mắt khỏi gió, bụi, nước, v.v. hoặc tăng thêm sức mạnh thị giác"
                },
                "examples": [
                    {
                        "en": "a pair of swimming/ski/safety goggles",
                        "vi": "một cặp kính bơi / trượt tuyết / kính an toàn"
                    },
                    {
                        "en": "night-vision goggles",
                        "vi": "kính nhìn ban đêm"
                    },
                    {
                        "en": "My swimming goggles keep steaming up so I can’t see.",
                        "vi": "Kính bơi của tôi cứ hấp dần lên nên tôi không thể nhìn thấy."
                    }
                ]
            }
        ]
    },
    {
        "id": "7ec48d9a4cec4646b037f9db04972213",
        "word": "ribbon",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈrɪbən/",
            "us": "/ˈrɪbən/"
        },
        "nearby": [
            {
                "word": "ribbed",
                "pos": "adjective"
            },
            {
                "word": "ribbing",
                "pos": "noun"
            },
            {
                "word": "ribbon",
                "pos": "noun"
            },
            {
                "word": "ribbon development",
                "pos": "noun"
            },
            {
                "word": "ribbon lake",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a narrow piece of material, used to tie things or for decoration",
                    "vi": "một mảnh vật liệu hẹp, được sử dụng để buộc mọi thứ hoặc để trang trí"
                },
                "examples": [
                    {
                        "en": "Her present was tied with yellow ribbon.",
                        "vi": "Quà của cô ấy được buộc bằng ruy băng màu vàng."
                    },
                    {
                        "en": "lengths of velvet ribbon",
                        "vi": "chiều dài của dải băng nhung"
                    },
                    {
                        "en": "She was wearing two blue silk ribbons in her hair.",
                        "vi": "Cô ấy đang đeo hai dải lụa màu xanh lam trên tóc."
                    }
                ]
            },
            {
                "define": {
                    "en": "something that is long and narrow in shape",
                    "vi": "một cái gì đó dài và hẹp có hình dạng"
                },
                "examples": [
                    {
                        "en": "The road was a ribbon of moonlight.",
                        "vi": "Con đường là dải băng ánh trăng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a ribbon in special colours, or tied in a special way, that is given to somebody as a prize or as a military honour, or that is worn by somebody to show that they belong to a particular political party",
                    "vi": "một dải ruy băng có màu sắc đặc biệt hoặc được buộc theo cách đặc biệt, được trao cho ai đó như một giải thưởng hoặc danh dự quân sự, hoặc một người nào đó đeo để chứng tỏ rằng họ thuộc một đảng chính trị cụ thể"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a long narrow piece of material containing ink (= coloured liquid for writing, drawing, etc.) that you put into typewriters and some computer printers",
                    "vi": "một mảnh vật liệu hẹp dài có chứa mực (= chất lỏng màu để viết, vẽ, v.v.) mà bạn cho vào máy đánh chữ và một số máy in máy tính"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to officially open a building, road, etc. with a special ceremony that typically involves cutting a ribbon across the entrance",
                    "vi": "chính thức khai trương một tòa nhà, con đường, v.v. với một buổi lễ đặc biệt thường bao gồm cắt băng khánh thành lối vào"
                },
                "examples": [
                    {
                        "en": "The prince cut the ribbon to officially open the building.",
                        "vi": "Hoàng tử cắt băng khai trương chính thức tòa nhà."
                    },
                    {
                        "en": "Yesterday the mayor cut the ribbon on the new sports centre.",
                        "vi": "Hôm qua thị trưởng đã cắt băng khánh thành trung tâm thể thao mới."
                    }
                ]
            },
            {
                "define": {
                    "en": "to officially start something, such as a business project or activity",
                    "vi": "để chính thức bắt đầu một cái gì đó, chẳng hạn như một dự án kinh doanh hoặc hoạt động"
                },
                "examples": [
                    {
                        "en": "Today we're happy to cut the ribbon on a project that will improve safety for cyclists.",
                        "vi": "Hôm nay, chúng tôi rất vui được cắt băng khánh thành một dự án nhằm cải thiện sự an toàn cho người đi xe đạp."
                    }
                ]
            },
            {
                "define": {
                    "en": "to cut/tear, etc. something very badly",
                    "vi": "để cắt / xé, v.v. một cái gì đó rất tồi tệ"
                },
                "examples": [
                    {
                        "en": "His coat was torn to ribbons by the barbed wire fence.",
                        "vi": "Áo khoác của anh bị hàng rào dây thép gai xé rách thành từng dải."
                    }
                ]
            }
        ]
    },
    {
        "id": "8923ac334a234d65b5a510e80a621cb9",
        "word": "spectacle",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈspektəkl/",
            "us": "/ˈspektəkl/"
        },
        "nearby": [
            {
                "word": "specky",
                "pos": "adjective"
            },
            {
                "word": "specs",
                "pos": "noun"
            },
            {
                "word": "spectacle",
                "pos": "noun"
            },
            {
                "word": "spectacular",
                "pos": "adjective"
            },
            {
                "word": "spectacular",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "two lenses in a frame that rests on the nose and ears. People wear spectacles in order to be able to see better or to protect their eyes from bright light.",
                    "vi": "hai thấu kính trong một khung đặt trên mũi và tai. Mọi người đeo kính để có thể nhìn rõ hơn hoặc để bảo vệ mắt khỏi ánh sáng chói."
                },
                "examples": [
                    {
                        "en": "a pair of spectacles",
                        "vi": "một cặp kính"
                    },
                    {
                        "en": "a spectacle case (= to put your spectacles in)",
                        "vi": "một hộp đựng kính (= để đeo kính của bạn vào)"
                    }
                ]
            },
            {
                "define": {
                    "en": "a performance or an event that is very impressive and exciting to look at",
                    "vi": "một buổi biểu diễn hoặc một sự kiện rất ấn tượng và thú vị để xem"
                },
                "examples": [
                    {
                        "en": "The carnival parade was a magnificent spectacle.",
                        "vi": "Cuộc diễu hành lễ hội là một cảnh tượng tráng lệ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a sight or view that is very impressive to look at",
                    "vi": "một cảnh tượng hoặc quang cảnh rất ấn tượng khi nhìn vào"
                },
                "examples": [
                    {
                        "en": "The sunset was a stunning spectacle.",
                        "vi": "Hoàng hôn là một cảnh tượng tuyệt đẹp."
                    },
                    {
                        "en": "The wide plain, with thousands of wildebeest on the move, was an awesome spectacle.",
                        "vi": "Đồng bằng rộng lớn, với hàng ngàn con linh dương đầu bò đang di chuyển, là một cảnh tượng tuyệt vời."
                    }
                ]
            },
            {
                "define": {
                    "en": "an unusual or surprising sight or situation that attracts a lot of attention",
                    "vi": "một cảnh tượng hoặc tình huống bất thường hoặc đáng ngạc nhiên thu hút nhiều sự chú ý"
                },
                "examples": [
                    {
                        "en": "I remember the sad spectacle of her standing in her wedding dress, covered in mud.",
                        "vi": "Tôi nhớ cảnh tượng đau buồn khi cô ấy đứng trong chiếc váy cưới, lấm lem bùn đất."
                    },
                    {
                        "en": "the sad spectacle of him struggling to keep up with the younger players",
                        "vi": "cảnh tượng đáng buồn khi anh ấy phải vật lộn để theo kịp các cầu thủ trẻ"
                    }
                ]
            },
            {
                "define": {
                    "en": "to draw attention to yourself by behaving or dressing in a silly way in public",
                    "vi": "thu hút sự chú ý đến bản thân bằng cách cư xử hoặc ăn mặc ngớ ngẩn ở nơi công cộng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "bec59932217e48c790ea3db4b9729564",
        "word": "wig",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/wɪɡ/",
            "us": "/wɪɡ/"
        },
        "nearby": [
            {
                "word": "wife-swapping",
                "pos": "noun"
            },
            {
                "word": "Wi-Fi",
                "pos": "noun"
            },
            {
                "word": "wig",
                "pos": "noun"
            },
            {
                "word": "wig",
                "pos": "verb"
            },
            {
                "word": "Wigan",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a piece of artificial hair that is worn on the head, for example to hide the fact that a person is bald, to cover somebody’s own hair, or by a judge and some other lawyers in some courts of law",
                    "vi": "một phần tóc nhân tạo được đội trên đầu, chẳng hạn như để che giấu sự thật rằng một người bị hói, để che đi mái tóc của chính ai đó, hoặc của một thẩm phán và một số luật sư khác trong một số tòa án luật"
                },
                "examples": [
                    {
                        "en": "Do you think she was wearing a wig?",
                        "vi": "Bạn có nghĩ rằng cô ấy đang đội tóc giả?"
                    },
                    {
                        "en": "The wig seemed to perch on his head.",
                        "vi": "Bộ tóc giả dường như đậu trên đầu anh."
                    },
                    {
                        "en": "Who's that man in the wig?",
                        "vi": "Người đàn ông đội tóc giả đó là ai?"
                    }
                ]
            }
        ]
    },
    {
        "id": "d9873f23070547daa9beb930225f43e1",
        "word": "ascot",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈæskɒt/",
            "us": "/ˈæskɑːt/"
        },
        "nearby": [
            {
                "word": "ASCII",
                "pos": "noun"
            },
            {
                "word": "ascorbic acid",
                "pos": "noun"
            },
            {
                "word": "ascot",
                "pos": "noun"
            },
            {
                "word": "Ascot",
                "pos": ""
            },
            {
                "word": "ascribable",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a short wide piece of silk, etc. worn by men around the neck, folded inside the collar of a shirt",
                    "vi": "một mảnh lụa ngắn, rộng, v.v ... được nam giới đeo quanh cổ, gấp bên trong cổ áo sơ mi"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "f5155c9ccf3c4de8ad3f9a0e43581b66",
        "word": "bandeau",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbændəʊ/",
            "us": "/bænˈdəʊ/"
        },
        "nearby": [
            {
                "word": "B and B",
                "pos": "abbreviation"
            },
            {
                "word": "band council",
                "pos": "noun"
            },
            {
                "word": "bandeau",
                "pos": "noun"
            },
            {
                "word": "bandh",
                "pos": "noun"
            },
            {
                "word": "bandicoot",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a narrow band worn around the head to hold the hair in place",
                    "vi": "một dải hẹp đeo quanh đầu để giữ tóc cố định"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a piece of women’s clothing that is tied around the body to cover the breasts",
                    "vi": "một bộ quần áo của phụ nữ buộc quanh người để che ngực"
                },
                "examples": [
                    {
                        "en": "a bandeau bikini top",
                        "vi": "một chiếc áo bikini bandeau"
                    }
                ]
            }
        ]
    },
    {
        "id": "c62fbc4a8b6e41d7934cd3ddf5446bef",
        "word": "barrette",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/bəˈret/",
            "us": "/bəˈret/"
        },
        "nearby": [
            {
                "word": "barrenness",
                "pos": "noun"
            },
            {
                "word": "Elizabeth Barrett Browning",
                "pos": ""
            },
            {
                "word": "barrette",
                "pos": "noun"
            },
            {
                "word": "barricade",
                "pos": "noun"
            },
            {
                "word": "barricade",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small piece of metal or plastic used for holding the hair in place and as a hair decoration",
                    "vi": "một mảnh kim loại hoặc nhựa nhỏ dùng để giữ cố định tóc và làm vật trang trí cho tóc"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c92b524764264c6eaf5bc95239f6dafd",
        "word": "billfold",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbɪlfəʊld/",
            "us": "/ˈbɪlfəʊld/"
        },
        "nearby": [
            {
                "word": "billet",
                "pos": "verb"
            },
            {
                "word": "billet-doux",
                "pos": "noun"
            },
            {
                "word": "billfold",
                "pos": "noun"
            },
            {
                "word": "billhook",
                "pos": "noun"
            },
            {
                "word": "billiard",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small flat folding case made of leather or plastic used for keeping paper money and credit cards in",
                    "vi": "một hộp gấp phẳng nhỏ làm bằng da hoặc nhựa được sử dụng để giữ tiền giấy và thẻ tín dụng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "984f72444a9547de9a084139e7c99f1f",
        "word": "bobby pin",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbɒbi pɪn/",
            "us": "/ˈbɑːbi pɪn/"
        },
        "nearby": [
            {
                "word": "Bobby",
                "pos": ""
            },
            {
                "word": "bobby-dazzler",
                "pos": "noun"
            },
            {
                "word": "bobby pin",
                "pos": "noun"
            },
            {
                "word": "Bobby Shafto",
                "pos": ""
            },
            {
                "word": "bobby socks",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small thin piece of metal or plastic folded in the middle, used for holding the hair in place",
                    "vi": "một miếng kim loại hoặc nhựa mỏng nhỏ được gấp ở giữa, dùng để giữ tóc vào nếp"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "ecaebf662c7849d18262d9761630d560",
        "word": "cravat",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/krəˈvæt/",
            "us": "/krəˈvæt/"
        },
        "nearby": [
            {
                "word": "crater",
                "pos": "noun"
            },
            {
                "word": "-cratic",
                "pos": "suffix"
            },
            {
                "word": "cravat",
                "pos": "noun"
            },
            {
                "word": "crave",
                "pos": "verb"
            },
            {
                "word": "craven",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a short wide piece of silk, etc. worn by men around the neck, folded inside the collar of a shirt",
                    "vi": "một mảnh lụa ngắn, rộng, v.v ... được nam giới đeo quanh cổ, gấp bên trong cổ áo sơ mi"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "5b0c012b12a745a6bd13312b294274bf",
        "word": "feather boa",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌfeðə ˈbəʊə/",
            "us": "/ˌfeðər ˈbəʊə/"
        },
        "nearby": [
            {
                "word": "feather",
                "pos": "verb"
            },
            {
                "word": "feather-bed",
                "pos": "verb"
            },
            {
                "word": "feather boa",
                "pos": "noun"
            },
            {
                "word": "feather-brained",
                "pos": "adjective"
            },
            {
                "word": "feather duster",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a long thin piece of clothing like a scarf, made of feathers and worn over the shoulders, especially by women in the past",
                    "vi": "một bộ quần áo dài mỏng như một chiếc khăn, làm bằng lông vũ và được đeo trên vai, đặc biệt là của phụ nữ thời xưa."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "70fc3af2716c40248d7974ee6691d55c",
        "word": "hairband",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈheəbænd/",
            "us": "/ˈherbænd/"
        },
        "nearby": [
            {
                "word": "hair",
                "pos": "noun"
            },
            {
                "word": "Hair",
                "pos": ""
            },
            {
                "word": "hairband",
                "pos": "noun"
            },
            {
                "word": "hairbrush",
                "pos": "noun"
            },
            {
                "word": "haircut",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a narrow piece of cloth or curved plastic worn in the hair that fits closely over the top of the head and behind the ears",
                    "vi": "một mảnh vải hẹp hoặc nhựa cong được đeo trên tóc ôm sát đỉnh đầu và sau tai"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "93bcc94d99f349b993dd184534e182e2",
        "word": "hairgrip",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈheəɡrɪp/",
            "us": "/ˈherɡrɪp/"
        },
        "nearby": [
            {
                "word": "hairdryer",
                "pos": "noun"
            },
            {
                "word": "hair extension",
                "pos": "noun"
            },
            {
                "word": "hairgrip",
                "pos": "noun"
            },
            {
                "word": "hairiness",
                "pos": "noun"
            },
            {
                "word": "hairless",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small thin piece of metal or plastic folded in the middle, used for holding your hair in place",
                    "vi": "một miếng kim loại hoặc nhựa mỏng nhỏ được gấp lại ở giữa, dùng để giữ tóc của bạn vào nếp"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "b9812247884c4a69b51463f89bd53cd7",
        "word": "hairnet",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈheənet/",
            "us": "/ˈhernet/"
        },
        "nearby": [
            {
                "word": "hairless",
                "pos": "adjective"
            },
            {
                "word": "hairline",
                "pos": "noun"
            },
            {
                "word": "hairnet",
                "pos": "noun"
            },
            {
                "word": "hairpiece",
                "pos": "noun"
            },
            {
                "word": "hairpin",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a net worn over the hair to keep it in place",
                    "vi": "lưới đeo trên tóc để giữ tóc cố định"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a6b52b302afa41d29cd902926af63341",
        "word": "hairpin",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈheəpɪn/",
            "us": "/ˈherpɪn/"
        },
        "nearby": [
            {
                "word": "hairnet",
                "pos": "noun"
            },
            {
                "word": "hairpiece",
                "pos": "noun"
            },
            {
                "word": "hairpin",
                "pos": "noun"
            },
            {
                "word": "hairpin bend",
                "pos": "noun"
            },
            {
                "word": "hair-raising",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small thin piece of wire that is folded in the middle, used by women for holding their hair in place",
                    "vi": "một đoạn dây mảnh nhỏ được gấp ở giữa, được phụ nữ sử dụng để giữ nếp tóc"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a sharp U-shaped bend in a road, especially a mountain road",
                    "vi": "khúc cua gấp hình chữ U trên đường, đặc biệt là đường núi"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "127d373a63364711a9d2a601584f728c",
        "word": "hairslide",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈheəslaɪd/",
            "us": "/ˈherslaɪd/"
        },
        "nearby": [
            {
                "word": "hair's breadth",
                "pos": "noun"
            },
            {
                "word": "hair shirt",
                "pos": "noun"
            },
            {
                "word": "hairslide",
                "pos": "noun"
            },
            {
                "word": "hair-splitting",
                "pos": "noun"
            },
            {
                "word": "hairspray",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small attractive piece of metal or plastic used for holding your hair in place",
                    "vi": "một miếng kim loại hoặc nhựa hấp dẫn nhỏ dùng để giữ tóc bạn vào nếp"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "82098db507ad43b580d8ee49badd34d8",
        "word": "headband",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈhedbænd/",
            "us": "/ˈhedbænd/"
        },
        "nearby": [
            {
                "word": "headache",
                "pos": "noun"
            },
            {
                "word": "Head and Shoulders",
                "pos": "noun"
            },
            {
                "word": "headband",
                "pos": "noun"
            },
            {
                "word": "headbanger",
                "pos": "noun"
            },
            {
                "word": "headbanging",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a narrow piece of cloth worn around the head, especially to keep hair or sweat out of your eyes when playing sports",
                    "vi": "Một mảnh vải hẹp quấn quanh đầu, đặc biệt để giữ tóc hoặc mồ hôi ra khỏi mắt khi chơi thể thao"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "bd362e84ca37486d8a16bc0cd80ab19b",
        "word": "scrunchy",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈskrʌntʃi/",
            "us": "/ˈskrʌntʃi/"
        },
        "nearby": [
            {
                "word": "scrunch",
                "pos": "verb"
            },
            {
                "word": "scrunch-dry",
                "pos": "verb"
            },
            {
                "word": "scrunchy",
                "pos": "noun"
            },
            {
                "word": "scruple",
                "pos": "noun"
            },
            {
                "word": "scruple",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a rubber band covered in cloth used to fasten hair away from the face",
                    "vi": "một sợi dây chun bọc vải dùng để buộc tóc khỏi mặt"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "51099a65cc25479ca02ef7075c167c2e",
        "word": "snood",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/snuːd/",
            "us": "/snuːd/"
        },
        "nearby": [
            {
                "word": "snog",
                "pos": "verb"
            },
            {
                "word": "snog",
                "pos": "noun"
            },
            {
                "word": "snood",
                "pos": "noun"
            },
            {
                "word": "snook",
                "pos": "noun"
            },
            {
                "word": "snooker",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a net or bag worn over the hair at the back of the head for decoration",
                    "vi": "lưới hoặc túi đeo sau đầu để trang trí"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "b1305df18f904de8a8d4871682948802",
        "word": "sweatband",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈswetbænd/",
            "us": "/ˈswetbænd/"
        },
        "nearby": [
            {
                "word": "sweat",
                "pos": "noun"
            },
            {
                "word": "sweat",
                "pos": "verb"
            },
            {
                "word": "sweatband",
                "pos": "noun"
            },
            {
                "word": "sweated labour",
                "pos": "noun"
            },
            {
                "word": "sweater",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a band of cloth worn around the head or wrist that prevents sweat from going into the eyes or onto the hands",
                    "vi": "một dải vải quấn quanh đầu hoặc cổ tay để ngăn mồ hôi chảy vào mắt hoặc vào tay"
                },
                "examples": []
            }
        ]
    }
]