[
    {
        "id": "199f8895af3844f5883b09178272dbea",
        "word": "discuss",
        "pos": "verb",
        "level": "a1",
        "phonetic": {
            "uk": "/dɪˈskʌs/",
            "us": "/dɪˈskʌs/"
        },
        "nearby": [
            {
                "word": "discursive",
                "pos": "adjective"
            },
            {
                "word": "discus",
                "pos": "noun"
            },
            {
                "word": "discuss",
                "pos": "verb"
            },
            {
                "word": "discussion",
                "pos": "noun"
            },
            {
                "word": "discussion board",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to talk about something with somebody, especially in order to decide something",
                    "vi": "để nói về điều gì đó với ai đó, đặc biệt là để quyết định điều gì đó"
                },
                "examples": [
                    {
                        "en": "discuss something with somebody Have you discussed the problem with anyone?",
                        "vi": "thảo luận điều gì đó với ai đó Bạn đã thảo luận vấn đề với ai chưa?"
                    },
                    {
                        "en": "discuss something I'm not prepared to discuss this on the phone.",
                        "vi": "thảo luận về điều gì đó mà tôi không chuẩn bị để thảo luận về vấn đề này qua điện thoại."
                    },
                    {
                        "en": "to discuss the issue/matter/topic",
                        "vi": "để thảo luận về vấn đề / vấn đề / chủ đề"
                    },
                    {
                        "en": "to discuss a plan/proposal",
                        "vi": "thảo luận về một kế hoạch / đề xuất"
                    },
                    {
                        "en": "They met to discuss the possibility of working together.",
                        "vi": "Họ đã gặp nhau để thảo luận về khả năng làm việc cùng nhau."
                    },
                    {
                        "en": "discuss when, what, etc… We need to discuss when we should go.",
                        "vi": "thảo luận khi nào, cái gì, vv… Chúng ta cần thảo luận khi nào chúng ta nên đi."
                    },
                    {
                        "en": "discuss doing something We briefly discussed buying a second car.",
                        "vi": "thảo luận về việc làm gì đó Chúng tôi đã thảo luận ngắn gọn về việc mua một chiếc ô tô thứ hai."
                    },
                    {
                        "en": "discuss somebody/something doing something They discussed the whole family possibly travelling together.",
                        "vi": "thảo luận về ai đó / điều gì đó đang làm điều gì đó Họ đã thảo luận về việc cả gia đình có thể đi du lịch cùng nhau."
                    }
                ]
            },
            {
                "define": {
                    "en": "to write or talk about something in detail, showing the different ideas and opinions about it",
                    "vi": "viết hoặc nói chi tiết về điều gì đó, thể hiện những ý tưởng và quan điểm khác nhau về điều đó"
                },
                "examples": [
                    {
                        "en": "discuss something This topic will be discussed at greater length in the next chapter.",
                        "vi": "thảo luận điều gì đó Chủ đề này sẽ được thảo luận dài hơn trong chương tiếp theo."
                    },
                    {
                        "en": "The author discusses the economic impact of these changes.",
                        "vi": "Tác giả thảo luận về tác động kinh tế của những thay đổi này."
                    },
                    {
                        "en": "discuss what, how, etc… The article discusses how teachers can use technology in their classrooms.",
                        "vi": "thảo luận về cái gì, như thế nào, v.v.… Bài báo thảo luận về cách giáo viên có thể sử dụng công nghệ trong lớp học của họ."
                    },
                    {
                        "en": "The novel's main theme is ‘You reap what you sow’. Discuss. (= in an essay question)",
                        "vi": "Chủ đề chính của cuốn tiểu thuyết là 'Gieo nhân nào gặt quả nấy'. Bàn luận. (= trong một câu hỏi tiểu luận)"
                    }
                ]
            }
        ]
    },
    {
        "id": "cf07d0b019784fe78d8db4e0fa1c205a",
        "word": "discussion",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/dɪˈskʌʃn/",
            "us": "/dɪˈskʌʃn/"
        },
        "nearby": [
            {
                "word": "discus",
                "pos": "noun"
            },
            {
                "word": "discuss",
                "pos": "verb"
            },
            {
                "word": "discussion",
                "pos": "noun"
            },
            {
                "word": "discussion board",
                "pos": "noun"
            },
            {
                "word": "discussion forum",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a conversation about somebody/something; the process of discussing somebody/something",
                    "vi": "một cuộc trò chuyện về ai đó / cái gì đó; quá trình thảo luận về ai đó / điều gì đó"
                },
                "examples": [
                    {
                        "en": "I discovered something interesting during a family discussion.",
                        "vi": "Tôi đã phát hiện ra một điều thú vị trong một cuộc thảo luận gia đình."
                    },
                    {
                        "en": "We'll continue this discussion some other time.",
                        "vi": "Chúng ta sẽ tiếp tục cuộc thảo luận này vào lúc khác."
                    },
                    {
                        "en": "discussion with somebody (about somebody/something) We had a discussion with them about the differences between Britain and the US.",
                        "vi": "thảo luận với ai đó (về ai đó / cái gì đó) Chúng tôi đã thảo luận với họ về sự khác biệt giữa Anh và Mỹ."
                    },
                    {
                        "en": "discussion about somebody/something A lively discussion followed about whether he should be allowed to join the club.",
                        "vi": "thảo luận về ai đó / điều gì đó Một cuộc thảo luận sôi nổi diễn ra sau đó về việc liệu anh ta có nên được phép tham gia câu lạc bộ hay không."
                    },
                    {
                        "en": "discussion on something The pair held informal discussions on a number of topics.",
                        "vi": "thảo luận về điều gì đó Cặp đôi đã tổ chức các cuộc thảo luận không chính thức về một số chủ đề."
                    },
                    {
                        "en": "discussion around something The exhibition offers opportunities for frank discussions around sensitive issues.",
                        "vi": "thảo luận xung quanh vấn đề gì đó Triển lãm mang đến cơ hội thảo luận thẳng thắn xung quanh các vấn đề nhạy cảm."
                    },
                    {
                        "en": "discussion of something We want to encourage public discussion of mental health issues.",
                        "vi": "thảo luận về điều gì đó Chúng tôi muốn khuyến khích thảo luận công khai về các vấn đề sức khỏe tâm thần."
                    },
                    {
                        "en": "discussion among/between A and B (about somebody/something) There was some discussion among reviewers about this film.",
                        "vi": "thảo luận giữa / giữa A và B (về ai đó / cái gì đó) Có một số cuộc thảo luận giữa các nhà phê bình về bộ phim này."
                    },
                    {
                        "en": "under discussion The plans have been under discussion (= being talked about) for a year now.",
                        "vi": "đang thảo luận Các kế hoạch đã được thảo luận (= đang được nói đến) trong một năm nay."
                    },
                    {
                        "en": "for discussion a list of topics for discussion",
                        "vi": "cho cuộc thảo luận một danh sách các chủ đề để thảo luận"
                    },
                    {
                        "en": "to stimulate/provoke discussion",
                        "vi": "để kích thích / khơi gợi thảo luận"
                    },
                    {
                        "en": "to initiate/start/spark a discussion",
                        "vi": "để bắt đầu / bắt đầu / châm ngòi cho một cuộc thảo luận"
                    },
                    {
                        "en": "a panel/group/round-table discussion",
                        "vi": "thảo luận bảng / nhóm / bàn tròn"
                    }
                ]
            },
            {
                "define": {
                    "en": "a speech or a piece of writing that discusses many different aspects of a subject",
                    "vi": "một bài phát biểu hoặc một đoạn văn thảo luận về nhiều khía cạnh khác nhau của một chủ đề"
                },
                "examples": [
                    {
                        "en": "I have chosen to focus my discussion on a single work.",
                        "vi": "Tôi đã chọn tập trung cuộc thảo luận của mình vào một tác phẩm duy nhất."
                    },
                    {
                        "en": "discussion of something Her article is a discussion of the methods used in research.",
                        "vi": "thảo luận về điều gì Bài báo của cô ấy là một cuộc thảo luận về các phương pháp được sử dụng trong nghiên cứu."
                    },
                    {
                        "en": "See chapter 15 for a detailed discussion of the approach used.",
                        "vi": "Xem chương 15 để biết thảo luận chi tiết về phương pháp được sử dụng."
                    }
                ]
            }
        ]
    },
    {
        "id": "9e553a1c610140318e8f19523e850dc6",
        "word": "dialogue",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈdaɪəlɒɡ/",
            "us": "/ˈdaɪəlɔːɡ/"
        },
        "nearby": [
            {
                "word": "dialling tone",
                "pos": "noun"
            },
            {
                "word": "dialog box",
                "pos": "noun"
            },
            {
                "word": "dialogue",
                "pos": "noun"
            },
            {
                "word": "dial up",
                "pos": "phrasal verb"
            },
            {
                "word": "dial-up",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a conversation in a book, play or film or in language teaching materials",
                    "vi": "một cuộc trò chuyện trong một cuốn sách, vở kịch hoặc phim hoặc trong tài liệu giảng dạy ngôn ngữ"
                },
                "examples": [
                    {
                        "en": "Learners are asked to listen to three short dialogues.",
                        "vi": "Người học được yêu cầu nghe ba đoạn hội thoại ngắn."
                    },
                    {
                        "en": "Practise the dialogue with a partner.",
                        "vi": "Thực hành đối thoại với đối tác."
                    },
                    {
                        "en": "The novel has long descriptions and not much dialogue.",
                        "vi": "Cuốn tiểu thuyết có những đoạn miêu tả dài và không nhiều lời thoại."
                    }
                ]
            },
            {
                "define": {
                    "en": "a formal discussion between two groups or countries, especially when they are trying to solve a problem, end a disagreement, etc.",
                    "vi": "một cuộc thảo luận chính thức giữa hai nhóm hoặc quốc gia, đặc biệt khi họ đang cố gắng giải quyết một vấn đề, chấm dứt bất đồng, v.v."
                },
                "examples": [
                    {
                        "en": "The president told waiting reporters there had been a constructive dialogue.",
                        "vi": "Tổng thống nói với các phóng viên đang chờ rằng đã có một cuộc đối thoại mang tính xây dựng."
                    },
                    {
                        "en": "dialogue with somebody The government refused to engage in direct dialogue with the terrorists.",
                        "vi": "đối thoại với ai đó Chính phủ từ chối tham gia đối thoại trực tiếp với những kẻ khủng bố."
                    },
                    {
                        "en": "dialogue between A and B There needs to be a closer dialogue between management and staff.",
                        "vi": "đối thoại giữa A và B Cần có một cuộc đối thoại chặt chẽ hơn giữa quản lý và nhân viên."
                    },
                    {
                        "en": "dialogue about something an honest and open dialogue about racial identity in the US",
                        "vi": "đối thoại về điều gì đó đối thoại trung thực và cởi mở về bản sắc chủng tộc ở Hoa Kỳ"
                    },
                    {
                        "en": "dialogue on something a meaningful dialogue on pay and working conditions",
                        "vi": "đối thoại về điều gì đó đối thoại có ý nghĩa về lương và điều kiện làm việc"
                    }
                ]
            }
        ]
    },
    {
        "id": "0bfc1b48baa941eaba46b9a8c0ad90fe",
        "word": "negotiate",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/nɪˈɡəʊʃieɪt/",
            "us": "/nɪˈɡəʊʃieɪt/"
        },
        "nearby": [
            {
                "word": "negligible",
                "pos": "adjective"
            },
            {
                "word": "negotiable",
                "pos": "adjective"
            },
            {
                "word": "negotiate",
                "pos": "verb"
            },
            {
                "word": "the negotiating table",
                "pos": "noun"
            },
            {
                "word": "negotiation",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to try to reach an agreement by formal discussion",
                    "vi": "cố gắng đạt được một thỏa thuận bằng cách thảo luận chính thức"
                },
                "examples": [
                    {
                        "en": "negotiate (with somebody) (for something) The government will not negotiate with terrorists.",
                        "vi": "thương lượng (với ai đó) (cho điều gì đó) Chính phủ sẽ không thương lượng với những kẻ khủng bố."
                    },
                    {
                        "en": "We have been negotiating for more pay.",
                        "vi": "Chúng tôi đã đàm phán để được trả nhiều tiền hơn."
                    },
                    {
                        "en": "negotiate (with somebody) about/on something They have refused to negotiate on this issue.",
                        "vi": "thương lượng (với ai đó) về / về điều gì đó Họ đã từ chối thương lượng về vấn đề này."
                    },
                    {
                        "en": "a strong negotiating position",
                        "vi": "một vị trí đàm phán mạnh mẽ"
                    },
                    {
                        "en": "negotiating skills",
                        "vi": "các kỹ năng thương lượng"
                    },
                    {
                        "en": "negotiate between A and B to negotiate between the two sides",
                        "vi": "thương lượng giữa A và B để thương lượng giữa hai bên"
                    }
                ]
            },
            {
                "define": {
                    "en": "to arrange or agree something by formal discussion",
                    "vi": "sắp xếp hoặc đồng ý một cái gì đó bằng cách thảo luận chính thức"
                },
                "examples": [
                    {
                        "en": "to negotiate a deal/contract/treaty/settlement",
                        "vi": "để thương lượng một thỏa thuận / hợp đồng / hiệp ước / dàn xếp"
                    },
                    {
                        "en": "We successfully negotiated the release of the hostages.",
                        "vi": "Chúng tôi đã thương lượng thành công việc thả con tin."
                    }
                ]
            },
            {
                "define": {
                    "en": "to successfully get over or past a difficult part on a path or route",
                    "vi": "để vượt qua hoặc vượt qua một phần khó khăn trên một con đường hoặc lộ trình"
                },
                "examples": [
                    {
                        "en": "The climbers had to negotiate a steep rock face.",
                        "vi": "Các nhà leo núi đã phải thương lượng về một mặt đá dốc."
                    }
                ]
            }
        ]
    },
    {
        "id": "d1283fa127b344e49bc7a1f36a46051a",
        "word": "negotiation",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/nɪˌɡəʊʃiˈeɪʃn/",
            "us": "/nɪˌɡəʊʃiˈeɪʃn/"
        },
        "nearby": [
            {
                "word": "negotiate",
                "pos": "verb"
            },
            {
                "word": "the negotiating table",
                "pos": "noun"
            },
            {
                "word": "negotiation",
                "pos": "noun"
            },
            {
                "word": "negotiator",
                "pos": "noun"
            },
            {
                "word": "Negress",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "formal discussion between people who are trying to reach an agreement",
                    "vi": "thảo luận chính thức giữa những người đang cố gắng đạt được thỏa thuận"
                },
                "examples": [
                    {
                        "en": "peace/trade/contract negotiations",
                        "vi": "đàm phán hòa bình / thương mại / hợp đồng"
                    },
                    {
                        "en": "They begin another round of negotiations today.",
                        "vi": "Họ bắt đầu một vòng đàm phán khác hôm nay."
                    },
                    {
                        "en": "to enter into/open/begin negotiations",
                        "vi": "tham gia / mở / bắt đầu đàm phán"
                    },
                    {
                        "en": "to continue/resume/conclude negotiations",
                        "vi": "tiếp tục / tiếp tục / kết thúc đàm phán"
                    },
                    {
                        "en": "negotiation with somebody They were conducting secret negotiations with Spain.",
                        "vi": "đàm phán với ai đó Họ đang tiến hành các cuộc đàm phán bí mật với Tây Ban Nha."
                    },
                    {
                        "en": "negotiation between A and B The rent is a matter for negotiation between the landlord and the tenant.",
                        "vi": "thương lượng giữa A và B Giá thuê là vấn đề cần thương lượng giữa chủ nhà và người thuê."
                    },
                    {
                        "en": "in negotiation with somebody A contract is prepared in negotiation with our clients.",
                        "vi": "trong thương lượng với ai đó Một hợp đồng được chuẩn bị để thương lượng với khách hàng của chúng tôi."
                    },
                    {
                        "en": "under negotiation The issue is still under negotiation.",
                        "vi": "đang thương lượng Vấn đề vẫn đang được thương lượng."
                    },
                    {
                        "en": "The price is generally open to negotiation.",
                        "vi": "Giá cả nói chung là mở để thương lượng."
                    }
                ]
            }
        ]
    },
    {
        "id": "cf43c0a42311490891f758dac1eccd18",
        "word": "bargain",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈbɑːɡən/",
            "us": "/ˈbɑːrɡən/"
        },
        "nearby": [
            {
                "word": "barfly",
                "pos": "noun"
            },
            {
                "word": "bargain",
                "pos": "noun"
            },
            {
                "word": "bargain",
                "pos": "verb"
            },
            {
                "word": "bargain away",
                "pos": "phrasal verb"
            },
            {
                "word": "bargain basement",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to discuss prices, conditions, etc. with somebody in order to reach an agreement that is acceptable",
                    "vi": "thảo luận về giá cả, điều kiện, v.v. với ai đó để đạt được thỏa thuận có thể chấp nhận được"
                },
                "examples": [
                    {
                        "en": "bargain (with somebody) (about/over/for something) In the market dealers were bargaining with growers over the price of coffee.",
                        "vi": "mặc cả (với ai đó) (về / hơn / cho một cái gì đó) Trong chợ, những người buôn bán đang mặc cả với người trồng về giá cà phê."
                    },
                    {
                        "en": "He said he wasn't prepared to bargain.",
                        "vi": "Anh ấy nói rằng anh ấy không chuẩn bị để mặc cả."
                    }
                ]
            }
        ]
    },
    {
        "id": "e7d6ff78f039408f9c79585fb3ba2798",
        "word": "bargaining",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈbɑːɡənɪŋ/",
            "us": "/ˈbɑːrɡənɪŋ/"
        },
        "nearby": [
            {
                "word": "bargain hunter",
                "pos": "noun"
            },
            {
                "word": "bargain hunting",
                "pos": "noun"
            },
            {
                "word": "bargaining",
                "pos": "noun"
            },
            {
                "word": "bargaining chip",
                "pos": "noun"
            },
            {
                "word": "bargaining power",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "discussion of prices, conditions, etc. with the aim of reaching an agreement that is acceptable",
                    "vi": "thảo luận về giá cả, điều kiện, v.v. với mục đích đạt được thỏa thuận có thể chấp nhận được"
                },
                "examples": [
                    {
                        "en": "After much hard bargaining we reached an agreement.",
                        "vi": "Sau nhiều thương lượng khó khăn, chúng tôi đã đạt được một thỏa thuận."
                    },
                    {
                        "en": "wage bargaining",
                        "vi": "mặc cả lương"
                    },
                    {
                        "en": "Exporters are in a strong bargaining position at the moment.",
                        "vi": "Các nhà xuất khẩu đang ở trong một vị thế thương lượng mạnh mẽ vào lúc này."
                    }
                ]
            }
        ]
    },
    {
        "id": "26cebd97d5754874bafe096fbbeafed3",
        "word": "bargaining power",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈbɑːɡənɪŋ paʊə(r)/",
            "us": "/ˈbɑːrɡənɪŋ paʊər/"
        },
        "nearby": [
            {
                "word": "bargaining",
                "pos": "noun"
            },
            {
                "word": "bargaining chip",
                "pos": "noun"
            },
            {
                "word": "bargaining power",
                "pos": "noun"
            },
            {
                "word": "bargain on",
                "pos": "phrasal verb"
            },
            {
                "word": "barge",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the amount of control a person or group has when trying to reach an agreement with another group in a business or political situation",
                    "vi": "mức độ kiểm soát của một người hoặc một nhóm khi cố gắng đạt được thỏa thuận với một nhóm khác trong một tình huống kinh doanh hoặc chính trị"
                },
                "examples": [
                    {
                        "en": "The smaller states’ efforts to exercise their collective bargaining power against multinationals have failed.",
                        "vi": "Các nỗ lực của các quốc gia nhỏ hơn để thực hiện quyền thương lượng tập thể của họ chống lại các công ty đa quốc gia đã thất bại."
                    }
                ]
            }
        ]
    },
    {
        "id": "dcc708486f1045bcb8e683b69655e73e",
        "word": "talk over",
        "pos": "phrasal verb",
        "level": "c1",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "talk out",
                "pos": "phrasal verb"
            },
            {
                "word": "talk out of",
                "pos": "phrasal verb"
            },
            {
                "word": "talk over",
                "pos": "phrasal verb"
            },
            {
                "word": "talk radio",
                "pos": "noun"
            },
            {
                "word": "talk round",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to discuss something carefully and completely, especially in order to reach an agreement or make a decision",
                    "vi": "để thảo luận về điều gì đó một cách cẩn thận và đầy đủ, đặc biệt là để đạt được thỏa thuận hoặc đưa ra quyết định"
                },
                "examples": [
                    {
                        "en": "You'll find it helpful to talk things over with a friend.",
                        "vi": "Bạn sẽ thấy hữu ích khi nói chuyện với một người bạn."
                    },
                    {
                        "en": "They talked over the proposal and decided to give it their approval.",
                        "vi": "Họ đã thảo luận về đề xuất và quyết định chấp thuận đề xuất đó."
                    }
                ]
            }
        ]
    },
    {
        "id": "d70987032793434b978fd3c41a4408aa",
        "word": "bargaining chip",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbɑːɡənɪŋ tʃɪp/",
            "us": "/ˈbɑːrɡənɪŋ tʃɪp/"
        },
        "nearby": [
            {
                "word": "bargain hunting",
                "pos": "noun"
            },
            {
                "word": "bargaining",
                "pos": "noun"
            },
            {
                "word": "bargaining chip",
                "pos": "noun"
            },
            {
                "word": "bargaining power",
                "pos": "noun"
            },
            {
                "word": "bargain on",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a fact or a thing that a person or a group of people can use to get an advantage for themselves when they are trying to reach an agreement with another group",
                    "vi": "một thực tế hoặc một điều mà một người hoặc một nhóm người có thể sử dụng để đạt được lợi thế cho bản thân khi họ đang cố gắng đạt được thỏa thuận với một nhóm khác"
                },
                "examples": [
                    {
                        "en": "The release of the prisoners was used as a bargaining chip.",
                        "vi": "Việc trả tự do cho các tù nhân được sử dụng như một con bài mặc cả."
                    },
                    {
                        "en": "Ownership of the land gives us a strong bargaining counter.",
                        "vi": "Quyền sở hữu đất đai mang lại cho chúng ta một cơ hội mặc cả mạnh mẽ."
                    },
                    {
                        "en": "Should nuclear weapons be used as bargaining chips in arms negotiations?",
                        "vi": "Có nên sử dụng vũ khí hạt nhân như con bài mặc cả trong các cuộc đàm phán về vũ khí?"
                    }
                ]
            }
        ]
    },
    {
        "id": "1e58c67b26ce4840a648032ca3d7f5fc",
        "word": "drive/strike a hard bargain",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/hɑːd/",
            "us": "/hɑːrd/"
        },
        "nearby": [
            {
                "word": "harbour master",
                "pos": "noun"
            },
            {
                "word": "hard-ass",
                "pos": "noun"
            },
            {
                "word": "hard",
                "pos": "adjective"
            },
            {
                "word": "hard",
                "pos": "adverb"
            },
            {
                "word": "hard-ass",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "difficult to do, understand or answer",
                    "vi": "khó làm, hiểu hoặc trả lời"
                },
                "examples": [
                    {
                        "en": "a hard choice/decision/question",
                        "vi": "một lựa chọn / quyết định / câu hỏi khó"
                    },
                    {
                        "en": "hard to do something It is hard to believe that she's only nine.",
                        "vi": "khó để làm điều gì đó Thật khó tin rằng cô ấy chỉ mới chín tuổi."
                    },
                    {
                        "en": "It's hard to see how they can lose.",
                        "vi": "Thật khó để thấy họ có thể thua như thế nào."
                    },
                    {
                        "en": "It's hard to imagine a more cynical political strategy.",
                        "vi": "Thật khó để tưởng tượng một chiến lược chính trị hoài nghi hơn."
                    },
                    {
                        "en": "‘When will the job be finished?’ ‘It's hard to say (= it is difficult to be certain)’ .",
                        "vi": "Khi nào công việc sẽ hoàn thành?' 'Thật khó để nói (= rất khó để chắc chắn)'."
                    },
                    {
                        "en": "It's getting harder and harder to earn enough to pay the rent.",
                        "vi": "Ngày càng khó kiếm đủ tiền trả tiền thuê nhà."
                    },
                    {
                        "en": "I find his attitude very hard to take (= difficult to accept).",
                        "vi": "Tôi thấy thái độ của anh ấy rất khó chấp nhận (= khó chấp nhận)."
                    },
                    {
                        "en": "We're finding reliable staff hard to come by (= difficult to get).",
                        "vi": "Chúng tôi khó tìm được nhân viên đáng tin cậy (= khó kiếm)."
                    },
                    {
                        "en": "Houses like this are extremely hard to find.",
                        "vi": "Những ngôi nhà như thế này cực kỳ khó kiếm."
                    },
                    {
                        "en": "You are hard to please, aren’t you?",
                        "vi": "Em thật khó vừa lòng anh nhỉ?"
                    },
                    {
                        "en": "I found it hard to believe what they told me.",
                        "vi": "Tôi cảm thấy thật khó tin những gì họ nói với tôi."
                    },
                    {
                        "en": "hard for somebody It must be hard for her, bringing up four children on her own.",
                        "vi": "Khó cho ai đó Hẳn là khó cho cô ấy, một mình nuôi nấng bốn đứa con."
                    },
                    {
                        "en": "hard for somebody to do something It's hard for old people to change their ways.",
                        "vi": "Khó ai đó làm được điều gì đó Người già khó thay đổi cách làm của họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "full of difficulty and problems, especially because of a lack of money",
                    "vi": "đầy khó khăn và vấn đề, đặc biệt là vì thiếu tiền"
                },
                "examples": [
                    {
                        "en": "Times were hard at the end of the war.",
                        "vi": "Thời kỳ khó khăn khi chiến tranh kết thúc."
                    },
                    {
                        "en": "She's had a hard life.",
                        "vi": "Cô ấy đã có một cuộc sống khó khăn."
                    }
                ]
            },
            {
                "define": {
                    "en": "needing or using a lot of physical strength or mental effort",
                    "vi": "cần hoặc sử dụng nhiều thể lực hoặc tinh thần"
                },
                "examples": [
                    {
                        "en": "It's hard work shovelling snow.",
                        "vi": "Công việc xúc tuyết thật khó."
                    },
                    {
                        "en": "This is the hardest part of my job.",
                        "vi": "Đây là phần khó nhất trong công việc của tôi."
                    },
                    {
                        "en": "It was one of the hardest things I ever did.",
                        "vi": "Đó là một trong những điều khó khăn nhất mà tôi từng làm."
                    },
                    {
                        "en": "I've had a long hard day.",
                        "vi": "Tôi đã có một ngày dài khó khăn."
                    },
                    {
                        "en": "This season has been a hard slog.",
                        "vi": "Mùa giải này là một khẩu hiệu khó."
                    },
                    {
                        "en": "They had put in hours of hard graft.",
                        "vi": "Họ đã dành hàng giờ đồng hồ để ghép xương."
                    }
                ]
            },
            {
                "define": {
                    "en": "putting a lot of effort or energy into an activity",
                    "vi": "đặt nhiều nỗ lực hoặc năng lượng vào một hoạt động"
                },
                "examples": [
                    {
                        "en": "She's a very hard worker.",
                        "vi": "Cô ấy là một người làm việc rất chăm chỉ."
                    },
                    {
                        "en": "He's hard at work on a new novel.",
                        "vi": "Anh ấy đang chăm chỉ làm một cuốn tiểu thuyết mới."
                    },
                    {
                        "en": "When I left they were all still hard at it (= working hard).",
                        "vi": "Khi tôi rời đi, tất cả họ vẫn chăm chỉ (= làm việc chăm chỉ)."
                    }
                ]
            },
            {
                "define": {
                    "en": "done with a lot of strength or force",
                    "vi": "được thực hiện với rất nhiều sức mạnh hoặc lực lượng"
                },
                "examples": [
                    {
                        "en": "He gave the door a good hard kick.",
                        "vi": "Anh ta đá mạnh vào cánh cửa."
                    },
                    {
                        "en": "a hard punch",
                        "vi": "một cú đấm mạnh"
                    }
                ]
            },
            {
                "define": {
                    "en": "solid or stiff and difficult to bend or break",
                    "vi": "rắn hoặc cứng và khó uốn cong hoặc gãy"
                },
                "examples": [
                    {
                        "en": "Wait for the concrete to go hard.",
                        "vi": "Chờ cho bê tông đông cứng."
                    },
                    {
                        "en": "a hard mattress",
                        "vi": "một tấm nệm cứng"
                    },
                    {
                        "en": "Diamonds are the hardest known mineral.",
                        "vi": "Kim cương là khoáng chất cứng nhất được biết đến."
                    }
                ]
            },
            {
                "define": {
                    "en": "showing no kind feelings or sympathy",
                    "vi": "không thể hiện cảm xúc tử tế hoặc cảm thông"
                },
                "examples": [
                    {
                        "en": "My father was a hard man.",
                        "vi": "Cha tôi là một người chăm chỉ."
                    },
                    {
                        "en": "She gave me a hard stare.",
                        "vi": "Cô ấy nhìn tôi chằm chằm."
                    },
                    {
                        "en": "His voice was hard.",
                        "vi": "Giọng anh khó nghe."
                    },
                    {
                        "en": "He said some very hard things to me.",
                        "vi": "Anh ấy đã nói một số điều rất khó với tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "showing no signs of fear or weakness; ready to fight or compete",
                    "vi": "không có dấu hiệu sợ hãi hoặc yếu đuối; sẵn sàng chiến đấu hoặc cạnh tranh"
                },
                "examples": [
                    {
                        "en": "Come and get me if you think you're hard enough.",
                        "vi": "Hãy đến và lấy tôi nếu bạn nghĩ rằng bạn đủ chăm chỉ."
                    },
                    {
                        "en": "You think you're really hard, don't you?",
                        "vi": "Bạn nghĩ rằng bạn thực sự khó khăn, phải không?"
                    },
                    {
                        "en": "He's as hard and uncompromising as any professional sportsman.",
                        "vi": "Anh ấy chăm chỉ và không khoan nhượng như bất kỳ vận động viên thể thao chuyên nghiệp nào."
                    }
                ]
            },
            {
                "define": {
                    "en": "definitely true and based on information that can be proved",
                    "vi": "chắc chắn đúng và dựa trên thông tin có thể được chứng minh"
                },
                "examples": [
                    {
                        "en": "Is there any hard evidence either way?",
                        "vi": "Có bất kỳ bằng chứng khó khăn nào không?"
                    },
                    {
                        "en": "The newspaper story is based on hard facts.",
                        "vi": "Câu chuyện trên báo dựa trên những sự kiện khó."
                    }
                ]
            },
            {
                "define": {
                    "en": "very cold and severe",
                    "vi": "rất lạnh và khắc nghiệt"
                },
                "examples": [
                    {
                        "en": "It had been a hard winter.",
                        "vi": "Đó là một mùa đông khó khăn."
                    },
                    {
                        "en": "There was a hard frost that night.",
                        "vi": "Đêm đó có sương giá dày đặc."
                    }
                ]
            },
            {
                "define": {
                    "en": "strongly alcoholic",
                    "vi": "rượu mạnh"
                },
                "examples": [
                    {
                        "en": "hard liquor",
                        "vi": "rượu mạnh"
                    },
                    {
                        "en": "(informal) a drop of the hard stuff (= a strong alcoholic drink)",
                        "vi": "(không chính thức) một giọt rượu mạnh (= đồ uống có cồn mạnh)"
                    }
                ]
            },
            {
                "define": {
                    "en": "containing calcium and other mineral salts that make mixing with soap difficult",
                    "vi": "chứa canxi và các muối khoáng khác nên khó trộn với xà phòng"
                },
                "examples": [
                    {
                        "en": "a hard water area",
                        "vi": "một vùng nước cứng"
                    },
                    {
                        "en": "Our water is very hard.",
                        "vi": "Nước của chúng tôi rất cứng."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to describe a letter c or g when pronounced as in ‘cat’ or ‘go’, rather than as in ‘city’ or ‘giant’",
                    "vi": "được sử dụng để mô tả một chữ cái c hoặc g khi được phát âm như trong \"cat\" hoặc \"go\", thay vì như trong \"city\" hoặc \"giant\""
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to treat or criticize somebody in a very severe or strict way",
                    "vi": "đối xử hoặc chỉ trích ai đó theo cách rất nghiêm khắc hoặc nghiêm khắc"
                },
                "examples": [
                    {
                        "en": "Don't be too hard on him—he's very young.",
                        "vi": "Đừng quá khắt khe với anh ấy - anh ấy còn rất trẻ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be difficult for or unfair to somebody/something",
                    "vi": "khó khăn hoặc không công bằng với ai đó / điều gì đó"
                },
                "examples": [
                    {
                        "en": "It's hard on people who don't have a car.",
                        "vi": "Thật khó cho những người không có xe hơi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be likely to hurt or damage something",
                    "vi": "có khả năng làm tổn thương hoặc làm hỏng thứ gì đó"
                },
                "examples": [
                    {
                        "en": "Looking at a computer screen all day can be very hard on the eyes.",
                        "vi": "Nhìn vào màn hình máy tính cả ngày có thể rất khó cho mắt."
                    }
                ]
            },
            {
                "define": {
                    "en": "in a situation where you have to choose between two things, both of which are unpleasant",
                    "vi": "trong một tình huống mà bạn phải lựa chọn giữa hai điều, cả hai điều này đều khó chịu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to argue in an aggressive way and force somebody to agree on the best possible price or arrangement",
                    "vi": "tranh luận một cách tích cực và buộc ai đó phải đồng ý về mức giá hoặc thỏa thuận tốt nhất có thể"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to deliberately make a situation difficult and unpleasant for somebody",
                    "vi": "cố tình tạo ra một tình huống khó khăn và khó chịu cho ai đó"
                },
                "examples": [
                    {
                        "en": "They really gave me a hard time at the interview.",
                        "vi": "Họ thực sự đã gây khó khăn cho tôi trong buổi phỏng vấn."
                    }
                ]
            },
            {
                "define": {
                    "en": "that cannot be changed in any circumstances",
                    "vi": "điều đó không thể thay đổi trong mọi trường hợp"
                },
                "examples": [
                    {
                        "en": "There are no hard and fast rules about this.",
                        "vi": "Không có quy tắc cứng và nhanh chóng về điều này."
                    },
                    {
                        "en": "This situation isn’t hard and fast.",
                        "vi": "Tình huống này không khó và nhanh chóng."
                    }
                ]
            },
            {
                "define": {
                    "en": "showing no fear, sympathy or kind behaviour",
                    "vi": "không tỏ ra sợ hãi, cảm thông hoặc cư xử tử tế"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used as a way of saying that you are sorry about something, usually ironically (= you really mean the opposite)",
                    "vi": "được sử dụng như một cách để nói rằng bạn xin lỗi về điều gì đó, thường là mỉa mai (= bạn thực sự có ý ngược lại)"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "difficult to understand or needing a lot of effort",
                    "vi": "khó hiểu hoặc cần nhiều nỗ lực"
                },
                "examples": [
                    {
                        "en": "I'm finding his latest novel very hard going.",
                        "vi": "Tôi đang tìm cuốn tiểu thuyết mới nhất của anh ấy rất khó khăn."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to tell somebody that you feel sorry for them",
                    "vi": "từng nói với ai đó rằng bạn cảm thấy tiếc cho họ"
                },
                "examples": [
                    {
                        "en": "‘Failed again, I'm afraid.’ ‘Oh, hard luck.’",
                        "vi": "Tôi lại thất bại, tôi sợ.' 'Ôi, may quá.'"
                    }
                ]
            },
            {
                "define": {
                    "en": "a difficult problem or situation to deal with",
                    "vi": "một vấn đề hoặc tình huống khó giải quyết"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a person or event that is so good or successful at something that it will be difficult for anyone/anything else coming after them to be as good or successful",
                    "vi": "một người hoặc một sự kiện quá tốt hoặc thành công ở một thứ gì đó mà sẽ khó cho bất kỳ ai / bất cứ điều gì khác sau họ trở nên tốt hoặc thành công"
                },
                "examples": [
                    {
                        "en": "She has been an excellent principal and will be a hard act to follow.",
                        "vi": "Cô ấy đã là một hiệu trưởng xuất sắc và sẽ là một hành động khó để noi theo."
                    },
                    {
                        "en": "Their contribution will prove a tough act to follow.",
                        "vi": "Sự đóng góp của họ sẽ chứng minh một hành động khó khăn để làm theo."
                    }
                ]
            },
            {
                "define": {
                    "en": "by having an unpleasant experience or by making mistakes",
                    "vi": "do có trải nghiệm khó chịu hoặc do mắc lỗi"
                },
                "examples": [
                    {
                        "en": "She won't listen to my advice so she'll just have to learn the hard way.",
                        "vi": "Cô ấy sẽ không nghe lời khuyên của tôi vì vậy cô ấy sẽ phải học một cách khó khăn."
                    },
                    {
                        "en": "He learned about the dangers of drugs the hard way.",
                        "vi": "Anh ấy đã học về sự nguy hiểm của ma túy một cách khó khăn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have difficulty doing something",
                    "vi": "gặp khó khăn khi làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "You'll have a job convincing them that you're right.",
                        "vi": "Bạn sẽ có một công việc thuyết phục họ rằng bạn đúng."
                    },
                    {
                        "en": "He had a hard job to make himself heard.",
                        "vi": "Anh ấy đã gặp khó khăn trong việc làm cho mình được lắng nghe."
                    }
                ]
            },
            {
                "define": {
                    "en": "to use more time or energy on a task than is necessary",
                    "vi": "sử dụng nhiều thời gian hoặc năng lượng cho một công việc hơn mức cần thiết"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used after you have been arguing with somebody or have beaten them in a contest but you would still like to be friendly with them",
                    "vi": "được sử dụng sau khi bạn đã tranh cãi với ai đó hoặc đã đánh bại họ trong một cuộc thi nhưng bạn vẫn muốn thân thiện với họ"
                },
                "examples": [
                    {
                        "en": "It looks like I'm the winner again. No hard feelings, Dave, eh?",
                        "vi": "Có vẻ như tôi lại là người chiến thắng. Không có cảm giác khó khăn, Dave, eh?"
                    },
                    {
                        "en": "Someone has to lose. No hard feelings, eh?",
                        "vi": "Có người phải mất. Không có cảm giác khó khăn, hả?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to make yourself seem more attractive or interesting by not immediately accepting an invitation to do something",
                    "vi": "để khiến bản thân có vẻ hấp dẫn hoặc thú vị hơn bằng cách không nhận lời mời làm việc gì đó ngay lập tức"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to consider a problem or possibility very carefully and without hurrying",
                    "vi": "xem xét một vấn đề hoặc khả năng rất cẩn thận và không vội vàng"
                },
                "examples": [
                    {
                        "en": "We need to take a long, hard look at all the options.",
                        "vi": "Chúng ta cần phải xem xét kỹ lưỡng và lâu dài về tất cả các lựa chọn."
                    }
                ]
            },
            {
                "define": {
                    "en": "needing too much effort",
                    "vi": "cần quá nhiều nỗ lực"
                },
                "examples": [
                    {
                        "en": "I can't be bothered making a hot meal—it's too much like hard work.",
                        "vi": "Tôi không thể làm phiền khi nấu một bữa ăn nóng - nó quá giống như một công việc khó khăn."
                    }
                ]
            }
        ]
    },
    {
        "id": "b063c379b7f741df850203c98892f586",
        "word": "hammer out",
        "pos": "phrasal verb",
        "level": "c2",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "hammer into",
                "pos": "phrasal verb"
            },
            {
                "word": "hammerlock",
                "pos": "noun"
            },
            {
                "word": "hammer out",
                "pos": "phrasal verb"
            },
            {
                "word": "hammer price",
                "pos": "noun"
            },
            {
                "word": "Oscar Hammerstein",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to discuss a plan, an idea, etc. until everyone agrees or a decision is made",
                    "vi": "thảo luận về một kế hoạch, một ý tưởng, v.v. cho đến khi mọi người đồng ý hoặc một quyết định được đưa ra"
                },
                "examples": [
                    {
                        "en": "to hammer out a compromise",
                        "vi": "để đưa ra một thỏa hiệp"
                    }
                ]
            },
            {
                "define": {
                    "en": "to play a tune, especially on a piano, loudly and not very well",
                    "vi": "để chơi một giai điệu, đặc biệt là trên đàn piano, to và không hay lắm"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "e9c132c68d2d4aadab93d18d72d8b67d",
        "word": "hash out",
        "pos": "phrasal verb",
        "level": "c2",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "hash browns",
                "pos": "noun"
            },
            {
                "word": "hashish",
                "pos": "noun"
            },
            {
                "word": "hash out",
                "pos": "phrasal verb"
            },
            {
                "word": "hashtag",
                "pos": "noun"
            },
            {
                "word": "Hasid",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to discuss something carefully and completely in order to reach an agreement or decide something",
                    "vi": "thảo luận một cách cẩn thận và đầy đủ về điều gì đó để đạt được thỏa thuận hoặc quyết định điều gì đó"
                },
                "examples": [
                    {
                        "en": "We still need to hash out the details of the contract.",
                        "vi": "Chúng tôi vẫn cần phải băm ra các chi tiết của hợp đồng."
                    }
                ]
            }
        ]
    },
    {
        "id": "97e984eba709493a8f231c0670b2f7b1",
        "word": "hold out for",
        "pos": "phrasal verb",
        "level": "c2",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "hold onto",
                "pos": "phrasal verb"
            },
            {
                "word": "hold out",
                "pos": "phrasal verb"
            },
            {
                "word": "hold out for",
                "pos": "phrasal verb"
            },
            {
                "word": "hold out on",
                "pos": "phrasal verb"
            },
            {
                "word": "hold over",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to cause a delay in reaching an agreement because you hope you will gain something",
                    "vi": "gây ra sự chậm trễ trong việc đạt được thỏa thuận bởi vì bạn hy vọng bạn sẽ đạt được một cái gì đó"
                },
                "examples": [
                    {
                        "en": "The union negotiators are holding out for a more generous pay settlement.",
                        "vi": "Các nhà đàm phán công đoàn đang cố gắng giải quyết việc trả lương hào phóng hơn."
                    }
                ]
            }
        ]
    },
    {
        "id": "ea455333ab814f178387533e9394174a",
        "word": "horse-trading",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈhɔːs treɪdɪŋ/",
            "us": "/ˈhɔːrs treɪdɪŋ/"
        },
        "nearby": [
            {
                "word": "horse show",
                "pos": "noun"
            },
            {
                "word": "horse's neck",
                "pos": "noun"
            },
            {
                "word": "horse-trading",
                "pos": "noun"
            },
            {
                "word": "horse trailer",
                "pos": "noun"
            },
            {
                "word": "horsewhip",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the activity of buying and selling horses",
                    "vi": "hoạt động mua bán ngựa"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the activity of discussing business with somebody using clever or secret methods in order to reach an agreement that suits you",
                    "vi": "hoạt động thảo luận kinh doanh với ai đó bằng các phương pháp thông minh hoặc bí mật để đạt được thỏa thuận phù hợp với bạn"
                },
                "examples": [
                    {
                        "en": "political horse-trading",
                        "vi": "buôn bán ngựa chính trị"
                    }
                ]
            }
        ]
    },
    {
        "id": "92dfb7684f254de88bd20220e60e247d",
        "word": "negotiable",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/nɪˈɡəʊʃiəbl/",
            "us": "/nɪˈɡəʊʃiəbl/"
        },
        "nearby": [
            {
                "word": "negligently",
                "pos": "adverb"
            },
            {
                "word": "negligible",
                "pos": "adjective"
            },
            {
                "word": "negotiable",
                "pos": "adjective"
            },
            {
                "word": "negotiate",
                "pos": "verb"
            },
            {
                "word": "the negotiating table",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "that you can discuss or change before you make an agreement or a decision",
                    "vi": "mà bạn có thể thảo luận hoặc thay đổi trước khi đưa ra thỏa thuận hoặc quyết định"
                },
                "examples": [
                    {
                        "en": "The terms of employment are negotiable.",
                        "vi": "Các điều khoản lao động có thể thương lượng."
                    },
                    {
                        "en": "The price was not negotiable.",
                        "vi": "Giá không thể thương lượng."
                    }
                ]
            },
            {
                "define": {
                    "en": "that you can exchange for money or give to another person in exchange for money",
                    "vi": "mà bạn có thể đổi lấy tiền hoặc đưa cho người khác để đổi lấy tiền"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "68760d8c13d14752a9de16f67a4ffb2f",
        "word": "the negotiating table",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ðə nɪˈɡəʊʃieɪtɪŋ teɪbl/",
            "us": "/ðə nɪˈɡəʊʃieɪtɪŋ teɪbl/"
        },
        "nearby": [
            {
                "word": "negotiable",
                "pos": "adjective"
            },
            {
                "word": "negotiate",
                "pos": "verb"
            },
            {
                "word": "the negotiating table",
                "pos": "noun"
            },
            {
                "word": "negotiation",
                "pos": "noun"
            },
            {
                "word": "negotiator",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a formal discussion to try and reach an agreement",
                    "vi": "một cuộc thảo luận chính thức để cố gắng và đạt được một thỏa thuận"
                },
                "examples": [
                    {
                        "en": "We want to get all the parties back to the negotiating table.",
                        "vi": "Chúng tôi muốn đưa tất cả các bên trở lại bàn đàm phán."
                    }
                ]
            }
        ]
    },
    {
        "id": "ea1d412705174536b18fecbb218b388e",
        "word": "on the understanding that…",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌʌndəˈstændɪŋ/",
            "us": "/ˌʌndərˈstændɪŋ/"
        },
        "nearby": [
            {
                "word": "understandable",
                "pos": "adjective"
            },
            {
                "word": "understandably",
                "pos": "adverb"
            },
            {
                "word": "understanding",
                "pos": "noun"
            },
            {
                "word": "understanding",
                "pos": "adjective"
            },
            {
                "word": "understandingly",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the knowledge that somebody has about a particular subject or situation",
                    "vi": "kiến thức mà ai đó có về một chủ đề hoặc tình huống cụ thể"
                },
                "examples": [
                    {
                        "en": "Students will gain a broad understanding of the workings of Parliament.",
                        "vi": "Sinh viên sẽ có được sự hiểu biết rộng rãi về hoạt động của Nghị viện."
                    },
                    {
                        "en": "a deep/clear understanding of something",
                        "vi": "hiểu biết sâu sắc / rõ ràng về điều gì đó"
                    },
                    {
                        "en": "Unions said her comments showed a complete lack of understanding of what the civil service does.",
                        "vi": "Các hiệp hội cho biết những bình luận của cô ấy cho thấy sự thiếu hiểu biết hoàn toàn về những gì mà công vụ làm."
                    },
                    {
                        "en": "She possesses a thorough understanding of the nature of the threat we are faced with.",
                        "vi": "Cô ấy có một sự hiểu biết thấu đáo về bản chất của mối đe dọa mà chúng ta phải đối mặt."
                    },
                    {
                        "en": "The book aims to inform readers seeking a greater understanding of the issues involved.",
                        "vi": "Cuốn sách nhằm mục đích thông báo cho những độc giả đang tìm kiếm sự hiểu biết sâu sắc hơn về các vấn đề liên quan."
                    },
                    {
                        "en": "The committee has little or no understanding of the problem.",
                        "vi": "Ủy ban có rất ít hoặc không hiểu vấn đề."
                    },
                    {
                        "en": "to develop/improve/increase understanding of something",
                        "vi": "để phát triển / cải thiện / tăng cường hiểu biết về điều gì đó"
                    },
                    {
                        "en": "to contribute to/lead to an understanding of something",
                        "vi": "để đóng góp vào / dẫn đến sự hiểu biết về một cái gì đó"
                    },
                    {
                        "en": "Most of the students have a sound understanding of English grammar.",
                        "vi": "Hầu hết học sinh đều hiểu ngữ pháp tiếng Anh."
                    },
                    {
                        "en": "The existence of God is beyond human understanding (= humans cannot know whether God exists or not).",
                        "vi": "Sự tồn tại của Thượng đế nằm ngoài sự hiểu biết của con người (= con người không thể biết Thượng đế có tồn tại hay không)."
                    }
                ]
            },
            {
                "define": {
                    "en": "the ability to understand why people behave in a particular way and to forgive them when they do something wrong",
                    "vi": "khả năng hiểu tại sao mọi người cư xử theo một cách cụ thể và tha thứ cho họ khi họ làm điều gì đó sai trái"
                },
                "examples": [
                    {
                        "en": "Organizers of the rally say they want to promote understanding, tolerance and open-mindedness",
                        "vi": "Những người tổ chức cuộc biểu tình nói rằng họ muốn thúc đẩy sự hiểu biết, lòng khoan dung và tinh thần cởi mở"
                    },
                    {
                        "en": "These efforts would foster mutual understanding and respect for different values.",
                        "vi": "Những nỗ lực này sẽ thúc đẩy sự hiểu biết lẫn nhau và tôn trọng các giá trị khác nhau."
                    },
                    {
                        "en": "We must tackle the problem with sympathy and understanding.",
                        "vi": "Chúng ta phải giải quyết vấn đề với sự thông cảm và thấu hiểu."
                    },
                    {
                        "en": "Try to show a little more understanding.",
                        "vi": "Cố gắng thể hiện sự hiểu biết nhiều hơn một chút."
                    },
                    {
                        "en": "understanding between A and B We are looking for a better understanding between the two nations.",
                        "vi": "sự hiểu biết giữa A và B Chúng tôi đang tìm kiếm sự hiểu biết tốt hơn giữa hai quốc gia."
                    }
                ]
            },
            {
                "define": {
                    "en": "an informal agreement",
                    "vi": "một thỏa thuận không chính thức"
                },
                "examples": [
                    {
                        "en": "understanding about something We finally came to an understanding about what hours we would work.",
                        "vi": "hiểu biết về điều gì đó Cuối cùng chúng tôi đã hiểu được những giờ chúng tôi sẽ làm việc."
                    },
                    {
                        "en": "understanding that… We have this understanding that nobody talks about work over lunch.",
                        "vi": "hiểu điều đó… Chúng tôi hiểu rằng không ai nói về công việc trong bữa trưa."
                    },
                    {
                        "en": "understanding with somebody I think I've reached an understanding with my mother.",
                        "vi": "hiểu biết với ai đó Tôi nghĩ rằng tôi đã đạt được sự hiểu biết với mẹ tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "the particular way in which somebody understands something",
                    "vi": "cách cụ thể mà ai đó hiểu điều gì đó"
                },
                "examples": [
                    {
                        "en": "My understanding of the situation is different",
                        "vi": "Sự hiểu biết của tôi về tình hình là khác nhau"
                    },
                    {
                        "en": "It was our understanding that you had already been informed.",
                        "vi": "Chúng tôi hiểu rằng bạn đã được thông báo."
                    },
                    {
                        "en": "My understanding is that we're meeting him at the theatre.",
                        "vi": "Tôi hiểu là chúng tôi đang gặp anh ấy ở nhà hát."
                    },
                    {
                        "en": "The statement is open to various understandings.",
                        "vi": "Tuyên bố mở cho nhiều cách hiểu khác nhau."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to introduce a condition that must be agreed before something else can happen",
                    "vi": "được sử dụng để đưa ra một điều kiện phải được đồng ý trước khi điều gì khác có thể xảy ra"
                },
                "examples": [
                    {
                        "en": "They agreed to the changes on the understanding that they would be introduced gradually.",
                        "vi": "Họ đồng ý với những thay đổi về hiểu biết mà họ sẽ được giới thiệu dần dần."
                    },
                    {
                        "en": "I thought you gave me the book on the understanding that I could keep it.",
                        "vi": "Tôi nghĩ rằng bạn đã cho tôi cuốn sách về sự hiểu biết rằng tôi có thể giữ nó."
                    }
                ]
            }
        ]
    },
    {
        "id": "d4cde25f91954150a801b6cba71e63a1",
        "word": "parley",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpɑːli/",
            "us": "/ˈpɑːrli/"
        },
        "nearby": [
            {
                "word": "parlay",
                "pos": "verb"
            },
            {
                "word": "parlay into",
                "pos": "phrasal verb"
            },
            {
                "word": "parley",
                "pos": "noun"
            },
            {
                "word": "parley",
                "pos": "verb"
            },
            {
                "word": "parliament",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a discussion between enemies or people who disagree, in order to try and find a way of solving a problem",
                    "vi": "một cuộc thảo luận giữa kẻ thù hoặc những người không đồng ý, để cố gắng và tìm ra cách giải quyết vấn đề"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "99d762614c8041a39f736d0142dfb109",
        "word": "parley",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpɑːli/",
            "us": "/ˈpɑːrli/"
        },
        "nearby": [
            {
                "word": "parlay into",
                "pos": "phrasal verb"
            },
            {
                "word": "parley",
                "pos": "noun"
            },
            {
                "word": "parley",
                "pos": "verb"
            },
            {
                "word": "parliament",
                "pos": "noun"
            },
            {
                "word": "parliamentarian",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to discuss something with somebody in order to solve a problem",
                    "vi": "thảo luận điều gì đó với ai đó để giải quyết vấn đề"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a7c62eb4f47545778a82fd69d1538d79",
        "word": "red line",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌred ˈlaɪn/",
            "us": "/ˌred ˈlaɪn/"
        },
        "nearby": [
            {
                "word": "red light",
                "pos": "noun"
            },
            {
                "word": "red-light district",
                "pos": "noun"
            },
            {
                "word": "red line",
                "pos": "noun"
            },
            {
                "word": "red meat",
                "pos": "noun"
            },
            {
                "word": "red mist",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an issue or a demand that one person or group refuses to change their opinion about during a disagreement or negotiations",
                    "vi": "một vấn đề hoặc một yêu cầu mà một người hoặc một nhóm từ chối thay đổi quan điểm của họ trong khi bất đồng hoặc đàm phán"
                },
                "examples": [
                    {
                        "en": "The issue of sovereignty is a red line that cannot be crossed.",
                        "vi": "Vấn đề chủ quyền là lằn ranh đỏ không thể vượt qua."
                    }
                ]
            }
        ]
    }
]