[
    {
        "id": "2f6f8f7b788c4dc7b4050f515bc89b97",
        "word": "sad",
        "pos": "adjective",
        "level": "a1",
        "phonetic": {
            "uk": "/sæd/",
            "us": "/sæd/"
        },
        "nearby": [
            {
                "word": "sacrosanct",
                "pos": "adjective"
            },
            {
                "word": "sacrum",
                "pos": "noun"
            },
            {
                "word": "sad",
                "pos": "adjective"
            },
            {
                "word": "SAD",
                "pos": "abbreviation"
            },
            {
                "word": "sadden",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "unhappy or showing unhappiness",
                    "vi": "không vui hoặc thể hiện sự không vui"
                },
                "examples": [
                    {
                        "en": "sad to do something We are very sad to hear that you are leaving.",
                        "vi": "buồn khi làm điều gì đó Chúng tôi rất buồn khi biết tin bạn ra đi."
                    },
                    {
                        "en": "sad that… I was sad that she had to go.",
                        "vi": "buồn vì… tôi buồn vì cô ấy phải đi."
                    },
                    {
                        "en": "sad about something I felt terribly sad about it.",
                        "vi": "buồn về một điều gì đó tôi cảm thấy rất buồn về điều đó."
                    },
                    {
                        "en": "sad at something I won't pretend I'm not slightly sad at the idea of never seeing them again.",
                        "vi": "buồn vì điều gì đó, tôi sẽ không giả vờ như tôi không buồn với ý tưởng sẽ không bao giờ gặp lại họ nữa."
                    },
                    {
                        "en": "sad for somebody/something I felt so sad for her.",
                        "vi": "buồn cho ai đó / điều gì đó tôi cảm thấy rất buồn cho cô ấy."
                    },
                    {
                        "en": "She looked sad and tired.",
                        "vi": "Trông cô ấy buồn và mệt mỏi."
                    },
                    {
                        "en": "He gave a slight, sad smile.",
                        "vi": "Anh nở một nụ cười nhẹ buồn."
                    },
                    {
                        "en": "The divorce left him sadder and wiser (= having learned from the unpleasant experience).",
                        "vi": "Cuộc ly hôn khiến anh buồn hơn và khôn ngoan hơn (= đã học được từ trải nghiệm khó chịu)."
                    },
                    {
                        "en": "I was sad to see the series end.",
                        "vi": "Tôi rất buồn khi thấy bộ truyện kết thúc."
                    }
                ]
            },
            {
                "define": {
                    "en": "that makes you feel unhappy",
                    "vi": "điều đó khiến bạn cảm thấy không vui"
                },
                "examples": [
                    {
                        "en": "a sad story",
                        "vi": "Một câu chuyện buồn"
                    },
                    {
                        "en": "sad to do something It was sad to see them go.",
                        "vi": "buồn khi làm điều gì đó Thật buồn khi thấy họ ra đi."
                    },
                    {
                        "en": "sad (that)… It is sad that so many of his paintings have been lost.",
                        "vi": "buồn (điều đó)… Thật đáng buồn là rất nhiều bức tranh của ông đã bị mất."
                    },
                    {
                        "en": "We had some sad news yesterday.",
                        "vi": "Chúng tôi đã có một số tin buồn ngày hôm qua."
                    },
                    {
                        "en": "He's a sad case—his wife died last year and he can't seem to manage without her.",
                        "vi": "Anh ấy là một trường hợp đáng buồn - vợ anh ấy mất năm ngoái và anh ấy dường như không thể xoay sở nếu không có cô ấy."
                    },
                    {
                        "en": "It will be a sad day for all of us if the theatre is forced to close.",
                        "vi": "Đó sẽ là một ngày buồn cho tất cả chúng ta nếu nhà hát buộc phải đóng cửa."
                    },
                    {
                        "en": "Sad to say (= unfortunately) the house has now been demolished.",
                        "vi": "Thật đáng buồn khi nói (= không may) ngôi nhà hiện đã bị phá bỏ."
                    }
                ]
            },
            {
                "define": {
                    "en": "unacceptable; deserving blame or criticism",
                    "vi": "không thể chấp nhận được; đáng bị đổ lỗi hoặc bị chỉ trích"
                },
                "examples": [
                    {
                        "en": "a sad state of affairs",
                        "vi": "một trạng thái buồn"
                    },
                    {
                        "en": "It's a sad fact that many of those killed were children.",
                        "vi": "Một thực tế đáng buồn là nhiều người trong số những người thiệt mạng là trẻ em."
                    },
                    {
                        "en": "The sad truth is, he never loved her.",
                        "vi": "Sự thật đáng buồn là anh chưa bao giờ yêu cô."
                    },
                    {
                        "en": "The sad thing is that the real situation is probably much worse.",
                        "vi": "Điều đáng buồn là tình hình thực tế có lẽ còn tồi tệ hơn nhiều."
                    },
                    {
                        "en": "It's a sad reflection on life that it takes danger and suffering to bring people closer together.",
                        "vi": "Đó là một sự phản ánh đáng buồn về cuộc sống mà nó phải chấp nhận nguy hiểm và đau khổ để mang mọi người đến gần nhau hơn."
                    }
                ]
            },
            {
                "define": {
                    "en": "boring or not fashionable",
                    "vi": "nhàm chán hoặc không hợp thời trang"
                },
                "examples": [
                    {
                        "en": "You sad old man.",
                        "vi": "Ông già buồn."
                    },
                    {
                        "en": "You'd have to be sad to wear a shirt like that.",
                        "vi": "Bạn sẽ phải buồn khi mặc một chiếc áo như vậy."
                    }
                ]
            },
            {
                "define": {
                    "en": "in poor condition",
                    "vi": "trong tình trạng tồi tệ"
                },
                "examples": [
                    {
                        "en": "The salad consisted of a few leaves of sad-looking lettuce.",
                        "vi": "Món salad gồm một vài lá rau diếp buồn tẻ."
                    }
                ]
            }
        ]
    },
    {
        "id": "a0ee0cdeca114ad98c74472a265ee5df",
        "word": "terrible",
        "pos": "adjective",
        "level": "a1",
        "phonetic": {
            "uk": "/ˈterəbl/",
            "us": "/ˈterəbl/"
        },
        "nearby": [
            {
                "word": "the Terrence Higgins Trust",
                "pos": ""
            },
            {
                "word": "terrestrial",
                "pos": "adjective"
            },
            {
                "word": "terrible",
                "pos": "adjective"
            },
            {
                "word": "terribly",
                "pos": "adverb"
            },
            {
                "word": "terrier",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "very unpleasant; making you feel very unhappy, upset or frightened",
                    "vi": "rất khó chịu; khiến bạn cảm thấy rất không vui, khó chịu hoặc sợ hãi"
                },
                "examples": [
                    {
                        "en": "a terrible experience",
                        "vi": "một kinh nghiệm khủng khiếp"
                    },
                    {
                        "en": "What terrible news!",
                        "vi": "Tin gì khủng khiếp!"
                    },
                    {
                        "en": "I've just had a terrible thought.",
                        "vi": "Tôi vừa có một ý nghĩ khủng khiếp."
                    },
                    {
                        "en": "It was a terrible thing to happen to someone so young.",
                        "vi": "Đó là một điều khủng khiếp xảy ra với một người quá trẻ."
                    },
                    {
                        "en": "That’s a terrible thing to say!",
                        "vi": "Đó là một điều khủng khiếp để nói!"
                    },
                    {
                        "en": "It smells terrible in here.",
                        "vi": "Ở đây có mùi kinh khủng."
                    },
                    {
                        "en": "It must have been terrible to witness the accident.",
                        "vi": "Chắc hẳn rất kinh khủng khi chứng kiến vụ tai nạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "causing great harm or injury; very serious",
                    "vi": "gây tổn hại hoặc thương tích lớn; rất nghiêm trọng"
                },
                "examples": [
                    {
                        "en": "a terrible accident",
                        "vi": "một tai nạn khủng khiếp"
                    },
                    {
                        "en": "He had suffered terrible injuries.",
                        "vi": "Anh ấy đã phải chịu đựng những vết thương khủng khiếp."
                    },
                    {
                        "en": "I'll have to stay with her—she's in a terrible state.",
                        "vi": "Tôi sẽ phải ở với cô ấy - cô ấy đang ở trong tình trạng tồi tệ."
                    },
                    {
                        "en": "The storm was terrible and caused a lot of damage.",
                        "vi": "Cơn bão khủng khiếp và gây ra rất nhiều thiệt hại."
                    }
                ]
            },
            {
                "define": {
                    "en": "unhappy or ill",
                    "vi": "không vui hoặc ốm"
                },
                "examples": [
                    {
                        "en": "I feel terrible—I think I'll go to bed.",
                        "vi": "Tôi cảm thấy khủng khiếp - tôi nghĩ mình sẽ đi ngủ."
                    },
                    {
                        "en": "You look terrible, you'd better sit down.",
                        "vi": "Trông bạn thật tệ hại, bạn nên ngồi xuống."
                    }
                ]
            },
            {
                "define": {
                    "en": "of very bad quality; very bad",
                    "vi": "có chất lượng rất tệ; rất tệ"
                },
                "examples": [
                    {
                        "en": "a terrible meal",
                        "vi": "một bữa ăn tồi tệ"
                    },
                    {
                        "en": "Your driving is terrible!",
                        "vi": "Lái xe của bạn là khủng khiếp!"
                    },
                    {
                        "en": "I have a terrible memory for names.",
                        "vi": "Tôi có một trí nhớ khủng khiếp về những cái tên."
                    },
                    {
                        "en": "Cyclists claim that most city streets are in terrible condition.",
                        "vi": "Những người đi xe đạp cho rằng hầu hết các đường phố trong thành phố đều trong tình trạng tồi tệ."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to show the great extent or degree of something bad",
                    "vi": "được sử dụng để thể hiện mức độ lớn hoặc mức độ của điều gì đó tồi tệ"
                },
                "examples": [
                    {
                        "en": "a terrible mistake",
                        "vi": "một sai lầm khủng khiếp"
                    },
                    {
                        "en": "to be in terrible pain",
                        "vi": "bị đau khủng khiếp"
                    },
                    {
                        "en": "The room was in a terrible mess.",
                        "vi": "Căn phòng lộn xộn khủng khiếp."
                    },
                    {
                        "en": "It was a terrible tragedy.",
                        "vi": "Đó là một bi kịch khủng khiếp."
                    },
                    {
                        "en": "(informal) I had a terrible job (= it was very difficult) to persuade her to come.",
                        "vi": "(không chính thức) Tôi đã có một công việc tồi tệ (= rất khó khăn) để thuyết phục cô ấy đến."
                    },
                    {
                        "en": "You’ll be in terrible trouble if you’re late again.",
                        "vi": "Bạn sẽ gặp rắc rối khủng khiếp nếu lại đến muộn."
                    },
                    {
                        "en": "Sometimes the pain is so terrible I can't sleep.",
                        "vi": "Nhiều khi đau kinh khủng không ngủ được."
                    }
                ]
            }
        ]
    },
    {
        "id": "8fab9fefef6c440295766232d7348f77",
        "word": "cry",
        "pos": "verb",
        "level": "a2",
        "phonetic": {
            "uk": "/kraɪ/",
            "us": "/kraɪ/"
        },
        "nearby": [
            {
                "word": "crutch",
                "pos": "noun"
            },
            {
                "word": "crux",
                "pos": "noun"
            },
            {
                "word": "cry",
                "pos": "verb"
            },
            {
                "word": "cry",
                "pos": "noun"
            },
            {
                "word": "crybaby",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to produce tears from your eyes because you are unhappy or hurt",
                    "vi": "để chảy nước mắt vì bạn không vui hoặc bị tổn thương"
                },
                "examples": [
                    {
                        "en": "It's all right. Don't cry.",
                        "vi": "Không sao đâu. Đừng khóc."
                    },
                    {
                        "en": "I just couldn't stop crying.",
                        "vi": "Tôi không thể ngừng khóc."
                    },
                    {
                        "en": "The little boy fell over and started to cry.",
                        "vi": "Cậu bé ngã xuống và bắt đầu khóc."
                    },
                    {
                        "en": "cry for somebody/something The baby was crying for (= because it wanted) its mother.",
                        "vi": "khóc vì ai đó / điều gì đó. Đứa bé đã khóc vì (= vì nó muốn) mẹ của nó."
                    },
                    {
                        "en": "cry about/over something There's nothing to cry about.",
                        "vi": "khóc về / về điều gì đó Không có gì phải khóc."
                    },
                    {
                        "en": "cry with something He felt like crying with rage.",
                        "vi": "khóc với một cái gì đó Anh cảm thấy như khóc với cơn thịnh nộ."
                    },
                    {
                        "en": "She threw her arms around his neck crying tears of joy.",
                        "vi": "Cô vòng tay qua cổ anh khóc vì sung sướng."
                    },
                    {
                        "en": "He started to cry real tears.",
                        "vi": "Anh bắt đầu khóc thật."
                    },
                    {
                        "en": "+ speech ‘Waaa!’ she cried.",
                        "vi": "Err:509"
                    },
                    {
                        "en": "(informal) I found him crying his eyes out (= crying very much).",
                        "vi": "(thân mật) Tôi thấy anh ấy đang rơi nước mắt (= khóc rất nhiều)."
                    },
                    {
                        "en": "That night she cried herself to sleep.",
                        "vi": "Đêm đó cô tự khóc đến mất ngủ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to shout loudly",
                    "vi": "hét lớn"
                },
                "examples": [
                    {
                        "en": "cry for something She ran to the window and cried for help.",
                        "vi": "khóc vì điều gì đó Cô chạy đến cửa sổ và kêu cứu."
                    },
                    {
                        "en": "+ speech ‘You're safe!’ Tom cried in delight.",
                        "vi": "Err:509"
                    }
                ]
            },
            {
                "define": {
                    "en": "to make a loud noise",
                    "vi": "tạo ra một tiếng ồn lớn"
                },
                "examples": [
                    {
                        "en": "Seagulls followed the boat, crying loudly.",
                        "vi": "Hải âu bay theo thuyền, kêu lớn."
                    },
                    {
                        "en": "A pair of eagles cried out to each other as they circled above the trees.",
                        "vi": "Một cặp đại bàng kêu với nhau khi chúng bay vòng trên những cái cây."
                    }
                ]
            },
            {
                "define": {
                    "en": "to complain that somebody else has done something wrong or unfair",
                    "vi": "phàn nàn rằng ai đó đã làm điều gì đó sai trái hoặc không công bằng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to waste time worrying about something that has happened that you cannot do anything about",
                    "vi": "lãng phí thời gian để lo lắng về điều gì đó đã xảy ra mà bạn không thể làm gì"
                },
                "examples": [
                    {
                        "en": "As the saying goes—it's no use crying over spilt milk.",
                        "vi": "Như người ta đã nói - khóc vì sữa đổ cũng chẳng ích gì."
                    }
                ]
            },
            {
                "define": {
                    "en": "to call for help when you do not need it, with the result that when you do need it people do not believe you",
                    "vi": "kêu gọi sự giúp đỡ khi bạn không cần, với kết quả là khi bạn cần người ta không tin bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to show you are angry or surprised",
                    "vi": "được sử dụng để cho thấy bạn đang tức giận hoặc ngạc nhiên"
                },
                "examples": [
                    {
                        "en": "For crying out loud! Why did you have to do that?",
                        "vi": "Khóc thật to! Tại sao bạn phải làm như vậy?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to laugh so long and hard that there are tears in your eyes",
                    "vi": "cười thật lâu và thật nhiều nước mắt"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be unable to decide how to react to a bad situation",
                    "vi": "không thể quyết định cách phản ứng với một tình huống xấu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to describe a person who listens to your problems and gives you sympathy",
                    "vi": "được sử dụng để mô tả một người lắng nghe vấn đề của bạn và thông cảm cho bạn"
                },
                "examples": [
                    {
                        "en": "He was a fatherly shoulder to cry on when things went wrong.",
                        "vi": "Anh ấy là bờ vai của một người cha để em khóc khi mọi chuyện không như ý."
                    }
                ]
            }
        ]
    },
    {
        "id": "1d2900b5462b44dcbe987915884a7f3d",
        "word": "pain",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/peɪn/",
            "us": "/peɪn/"
        },
        "nearby": [
            {
                "word": "Paige",
                "pos": ""
            },
            {
                "word": "pail",
                "pos": "noun"
            },
            {
                "word": "pain",
                "pos": "noun"
            },
            {
                "word": "pain",
                "pos": "verb"
            },
            {
                "word": "pain barrier",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the feelings that you have in your body when you have been hurt or when you are ill",
                    "vi": "những cảm giác mà bạn có trong cơ thể của bạn khi bạn bị tổn thương hoặc khi bạn bị ốm"
                },
                "examples": [
                    {
                        "en": "a cry of pain",
                        "vi": "một tiếng kêu đau đớn"
                    },
                    {
                        "en": "in pain She was clearly in a lot of pain.",
                        "vi": "trong đau đớn Cô ấy rõ ràng đã rất đau đớn."
                    },
                    {
                        "en": "He screamed in pain as he fell to his knees.",
                        "vi": "Anh đau đớn hét lên khi khuỵu xuống."
                    },
                    {
                        "en": "pain in something He felt a sharp pain in his knee.",
                        "vi": "đau một cái gì đó Anh cảm thấy đau nhói ở đầu gối của mình."
                    },
                    {
                        "en": "chronic/acute/severe pain",
                        "vi": "đau mãn tính / cấp tính / nghiêm trọng"
                    },
                    {
                        "en": "patients suffering from back pain",
                        "vi": "bệnh nhân bị đau lưng"
                    },
                    {
                        "en": "stomach/chest/abdominal/back pains",
                        "vi": "đau bụng / ngực / bụng / lưng"
                    },
                    {
                        "en": "You get more aches and pains as you get older.",
                        "vi": "Bạn bị đau nhức nhiều hơn khi bạn già đi."
                    },
                    {
                        "en": "The booklet contains information on pain relief during labour.",
                        "vi": "Tập sách có thông tin về giảm đau khi chuyển dạ."
                    },
                    {
                        "en": "This cream should help to relieve the pain.",
                        "vi": "Kem này sẽ giúp giảm đau."
                    },
                    {
                        "en": "These pills should ease the pain.",
                        "vi": "Những viên thuốc này sẽ làm dịu cơn đau."
                    },
                    {
                        "en": "to feel/experience/suffer pain",
                        "vi": "để cảm nhận / trải nghiệm / chịu đựng nỗi đau"
                    },
                    {
                        "en": "It's wrong to inflict pain on any animal.",
                        "vi": "Gây đau đớn cho bất kỳ con vật nào là sai."
                    },
                    {
                        "en": "I was able to learn pain management techniques.",
                        "vi": "Tôi đã có thể học các kỹ thuật kiểm soát cơn đau."
                    }
                ]
            },
            {
                "define": {
                    "en": "mental or emotional difficulty",
                    "vi": "khó khăn về tinh thần hoặc cảm xúc"
                },
                "examples": [
                    {
                        "en": "the pain of something the pain of separation",
                        "vi": "nỗi đau của một cái gì đó nỗi đau của sự chia ly"
                    },
                    {
                        "en": "the pain of doing something It took him several years to get over the pain of losing his job.",
                        "vi": "nỗi đau khi làm điều gì đó Phải mất vài năm anh ta mới có thể vượt qua nỗi đau mất việc."
                    },
                    {
                        "en": "I never meant to cause her pain.",
                        "vi": "Tôi không bao giờ có ý định gây ra nỗi đau cho cô ấy."
                    },
                    {
                        "en": "the pleasures and pains of growing old",
                        "vi": "niềm vui và nỗi đau của tuổi già"
                    },
                    {
                        "en": "a life full of pain and suffering",
                        "vi": "một cuộc sống đầy đau đớn và đau khổ"
                    }
                ]
            },
            {
                "define": {
                    "en": "a person or thing that is very annoying",
                    "vi": "một người hoặc một điều rất khó chịu"
                },
                "examples": [
                    {
                        "en": "She can be a real pain when she's in a bad mood.",
                        "vi": "Cô ấy có thể là một nỗi đau thực sự khi cô ấy có tâm trạng tồi tệ."
                    },
                    {
                        "en": "It's a pain having to go all that way for just one meeting.",
                        "vi": "Thật là khó khăn khi phải đi tất cả những con đường đó chỉ cho một cuộc họp."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that you need to suffer if you want to achieve something",
                    "vi": "từng nói rằng bạn cần phải chịu đựng nếu bạn muốn đạt được điều gì đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "with the threat of having something done to you as a punishment if you do not obey",
                    "vi": "với lời đe dọa sẽ làm gì đó với bạn như một hình phạt nếu bạn không tuân theo"
                },
                "examples": [
                    {
                        "en": "They were required to cut pollution levels, on pain of a £10 000 fine if they disobeyed.",
                        "vi": "Họ được yêu cầu cắt giảm mức độ ô nhiễm, với mức phạt 10 000 bảng Anh nếu họ không tuân theo."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person or thing that is very annoying",
                    "vi": "một người hoặc một điều rất khó chịu"
                },
                "examples": [
                    {
                        "en": "That man's a pain in the neck!",
                        "vi": "Người đàn ông đó rất đau cổ!"
                    }
                ]
            }
        ]
    },
    {
        "id": "8228e67d3b814c16b631a06e94412950",
        "word": "sadly",
        "pos": "adverb",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈsædli/",
            "us": "/ˈsædli/"
        },
        "nearby": [
            {
                "word": "sadistically",
                "pos": "adverb"
            },
            {
                "word": "Sadler's Wells",
                "pos": ""
            },
            {
                "word": "sadly",
                "pos": "adverb"
            },
            {
                "word": "sadness",
                "pos": "noun"
            },
            {
                "word": "sadomasochism",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "in a sad way",
                    "vi": "theo một cách buồn"
                },
                "examples": [
                    {
                        "en": "‘I'm so sorry,’ she said sadly.",
                        "vi": "Tôi rất xin lỗi, cô nói một cách buồn bã."
                    },
                    {
                        "en": "She shook her head sadly.",
                        "vi": "Cô buồn bã lắc đầu."
                    },
                    {
                        "en": "Charles smiled sadly. There was nothing more he could say.",
                        "vi": "Charles cười buồn. Anh ta không thể nói gì hơn được nữa."
                    },
                    {
                        "en": "My father smiled sadly and shook his head.",
                        "vi": "Cha tôi cười buồn và lắc đầu."
                    }
                ]
            },
            {
                "define": {
                    "en": "unfortunately",
                    "vi": "không may"
                },
                "examples": [
                    {
                        "en": "Sadly, after eight years of marriage they had grown apart.",
                        "vi": "Đáng buồn thay, sau tám năm chung sống, họ đã xa nhau."
                    },
                    {
                        "en": "Although Scott is remarkably talented at screenwriting, his directing skills are sadly lacking.",
                        "vi": "Mặc dù Scott được đánh giá là tài năng trong việc biên kịch, nhưng đáng buồn là kỹ năng đạo diễn của anh ấy lại thiếu."
                    }
                ]
            },
            {
                "define": {
                    "en": "very much and in a way that makes you sad",
                    "vi": "rất nhiều và theo cách khiến bạn buồn"
                },
                "examples": [
                    {
                        "en": "She will be sadly missed.",
                        "vi": "Cô ấy sẽ rất buồn."
                    },
                    {
                        "en": "They had hoped to win and were sadly disappointed.",
                        "vi": "Họ đã hy vọng chiến thắng và đã thất vọng một cách đáng buồn."
                    },
                    {
                        "en": "If you think I'm going to help you again, you're sadly (= completely) mistaken.",
                        "vi": "Nếu bạn nghĩ rằng tôi sẽ giúp bạn một lần nữa, bạn thật đáng buồn (= hoàn toàn) nhầm."
                    },
                    {
                        "en": "His work has been sadly neglected.",
                        "vi": "Công việc của anh ấy đã bị bỏ bê một cách đáng buồn."
                    }
                ]
            }
        ]
    },
    {
        "id": "1992d29367b242fb8673afa02286a7a8",
        "word": "unhappy",
        "pos": "adjective",
        "level": "a2",
        "phonetic": {
            "uk": "/ʌnˈhæpi/",
            "us": "/ʌnˈhæpi/"
        },
        "nearby": [
            {
                "word": "unhappily",
                "pos": "adverb"
            },
            {
                "word": "unhappiness",
                "pos": "noun"
            },
            {
                "word": "unhappy",
                "pos": "adjective"
            },
            {
                "word": "unharmed",
                "pos": "adjective"
            },
            {
                "word": "UNHCR",
                "pos": "abbreviation"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "not happy; sad",
                    "vi": "không vui; buồn"
                },
                "examples": [
                    {
                        "en": "to feel/look/seem/sound/become unhappy",
                        "vi": "cảm thấy / nhìn / có vẻ / âm thanh / trở nên không vui"
                    },
                    {
                        "en": "an unhappy marriage/childhood",
                        "vi": "một cuộc hôn nhân / tuổi thơ không hạnh phúc"
                    },
                    {
                        "en": "I didn't realize but he was deeply unhappy at that time.",
                        "vi": "Tôi không nhận ra nhưng anh ấy vô cùng bất hạnh vào thời điểm đó."
                    },
                    {
                        "en": "This story has an unhappy ending.",
                        "vi": "Câu chuyện này có một kết thúc không mấy vui vẻ."
                    },
                    {
                        "en": "unhappy to do something It makes me very unhappy to see you so miserable.",
                        "vi": "không vui khi làm điều gì đó Tôi rất không vui khi thấy bạn quá đau khổ."
                    }
                ]
            },
            {
                "define": {
                    "en": "not pleased or satisfied with somebody/something",
                    "vi": "không hài lòng hoặc hài lòng với ai đó / điều gì đó"
                },
                "examples": [
                    {
                        "en": "unhappy customers",
                        "vi": "khách hàng không hài lòng"
                    },
                    {
                        "en": "unhappy about/at something Many people are deeply unhappy about the way the government has handled this matter.",
                        "vi": "không hài lòng về / ở điều gì đó Nhiều người vô cùng bất bình về cách chính phủ xử lý vấn đề này."
                    },
                    {
                        "en": "unhappy about/at doing something He was unhappy at being left out of the team.",
                        "vi": "không hài lòng về / khi làm điều gì đó Anh ấy không hài lòng khi bị loại khỏi nhóm."
                    },
                    {
                        "en": "unhappy with somebody/something They were unhappy with their accommodation.",
                        "vi": "không hài lòng với ai đó / điều gì đó Họ không hài lòng với chỗ ở của họ."
                    },
                    {
                        "en": "Your teacher says she's very unhappy with you.",
                        "vi": "Giáo viên của bạn nói rằng cô ấy rất không hài lòng với bạn."
                    },
                    {
                        "en": "A lot of people were unhappy with the decision.",
                        "vi": "Rất nhiều người đã không hài lòng với quyết định này."
                    },
                    {
                        "en": "unhappy to do something Shareholders are unhappy to have him as their CEO.",
                        "vi": "không hài lòng khi làm điều gì đó Các cổ đông không hài lòng khi có anh ta làm Giám đốc điều hành của họ."
                    },
                    {
                        "en": "unhappy (that)… Voters are unhappy that he has failed to deliver the kind of change that he promised.",
                        "vi": "không hài lòng (điều đó)… Các cử tri không hài lòng vì anh ta đã không thực hiện được loại thay đổi mà anh ta đã hứa."
                    }
                ]
            },
            {
                "define": {
                    "en": "not suitable",
                    "vi": "không phù hợp"
                },
                "examples": [
                    {
                        "en": "an unhappy coincidence",
                        "vi": "một sự trùng hợp không vui"
                    },
                    {
                        "en": "It was an unhappy choice of words.",
                        "vi": "Đó là một sự lựa chọn từ ngữ không mấy vui vẻ."
                    }
                ]
            }
        ]
    },
    {
        "id": "5817c51b9f884e2a824116e405ebb8b5",
        "word": "fed up",
        "pos": "adjective",
        "level": "b1",
        "phonetic": {
            "uk": "/ˌfed ˈʌp/",
            "us": "/ˌfed ˈʌp/"
        },
        "nearby": [
            {
                "word": "FedEx",
                "pos": ""
            },
            {
                "word": "fedora",
                "pos": "noun"
            },
            {
                "word": "fed up",
                "pos": "adjective"
            },
            {
                "word": "fee",
                "pos": "noun"
            },
            {
                "word": "feeble",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "bored or unhappy, especially with a situation that has continued for too long",
                    "vi": "buồn chán hoặc không vui, đặc biệt là với một tình huống đã tiếp diễn quá lâu"
                },
                "examples": [
                    {
                        "en": "You look fed up. What's the matter?",
                        "vi": "Bạn trông có vẻ mệt mỏi. Có chuyện gì vậy?"
                    },
                    {
                        "en": "fed up with somebody/something People are fed up with all these traffic jams.",
                        "vi": "chán ngấy với ai đó / cái gì đó Mọi người đã chán ngấy với tất cả những cảnh tắc đường này."
                    },
                    {
                        "en": "In the end, I just got fed up with his constant complaining.",
                        "vi": "Cuối cùng, tôi phát ngán với việc anh ấy liên tục phàn nàn."
                    },
                    {
                        "en": "I wish he'd get a job. I'm fed up with it (= with the situation).",
                        "vi": "Tôi ước anh ấy sẽ kiếm được một công việc. Tôi chán ngấy với nó (= với tình hình)."
                    },
                    {
                        "en": "fed up with doing something I'm fed up with waiting for her.",
                        "vi": "chán ngấy với việc làm gì đó Tôi chán ngấy việc chờ đợi cô ấy."
                    },
                    {
                        "en": "I’m fed up to the back teeth (= very fed up) with hearing about your problems.",
                        "vi": "Tôi chán ngấy (= rất chán) khi nghe về những vấn đề của bạn."
                    }
                ]
            }
        ]
    },
    {
        "id": "cde34e94fa0f4ac3a4a9cdb80dbfe32b",
        "word": "jealous",
        "pos": "adjective",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈdʒeləs/",
            "us": "/ˈdʒeləs/"
        },
        "nearby": [
            {
                "word": "J. Crew",
                "pos": ""
            },
            {
                "word": "J.D.",
                "pos": "noun"
            },
            {
                "word": "jealous",
                "pos": "adjective"
            },
            {
                "word": "jealously",
                "pos": "adverb"
            },
            {
                "word": "jealousy",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "feeling angry or unhappy because somebody you like or love is showing interest in somebody else",
                    "vi": "cảm thấy tức giận hoặc không vui vì người nào đó bạn thích hoặc yêu đang thể hiện sự quan tâm đến người khác"
                },
                "examples": [
                    {
                        "en": "a jealous wife/husband",
                        "vi": "vợ / chồng ghen tuông"
                    },
                    {
                        "en": "He's only talking to her to make you jealous.",
                        "vi": "Anh ấy chỉ nói chuyện với cô ấy để khiến bạn ghen tị."
                    }
                ]
            },
            {
                "define": {
                    "en": "feeling angry or unhappy because you wish you had something that somebody else has",
                    "vi": "cảm thấy tức giận hoặc không vui bởi vì bạn ước bạn có một cái gì đó mà người khác có"
                },
                "examples": [
                    {
                        "en": "She's jealous of my success.",
                        "vi": "Cô ấy ghen tị với thành công của tôi."
                    },
                    {
                        "en": "Children often feel jealous when a new baby arrives.",
                        "vi": "Trẻ em thường cảm thấy ghen tị khi một em bé mới chào đời."
                    }
                ]
            },
            {
                "define": {
                    "en": "wanting to keep or protect something that you have because it makes you feel proud",
                    "vi": "muốn giữ hoặc bảo vệ thứ gì đó mà bạn có vì nó khiến bạn cảm thấy tự hào"
                },
                "examples": [
                    {
                        "en": "They are very jealous of their good reputation (= they do not want to lose it).",
                        "vi": "Họ rất ghen tị với danh tiếng tốt của mình (= họ không muốn mất nó)."
                    }
                ]
            }
        ]
    },
    {
        "id": "03ef6bf25093430794af7a2460feb087",
        "word": "lonely",
        "pos": "adjective",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈləʊnli/",
            "us": "/ˈləʊnli/"
        },
        "nearby": [
            {
                "word": "lone",
                "pos": "adjective"
            },
            {
                "word": "loneliness",
                "pos": "noun"
            },
            {
                "word": "lonely",
                "pos": "adjective"
            },
            {
                "word": "lonely heart",
                "pos": "noun"
            },
            {
                "word": "lone parent",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "unhappy because you have no friends or people to talk to",
                    "vi": "không vui vì bạn không có bạn bè hoặc người nào để nói chuyện"
                },
                "examples": [
                    {
                        "en": "She lives alone and often feels lonely.",
                        "vi": "Cô ấy sống một mình và thường cảm thấy cô đơn."
                    }
                ]
            },
            {
                "define": {
                    "en": "sad and spent alone",
                    "vi": "buồn và dành một mình"
                },
                "examples": [
                    {
                        "en": "all those lonely nights at home watching TV",
                        "vi": "tất cả những đêm cô đơn ở nhà xem TV"
                    },
                    {
                        "en": "a lonely childhood",
                        "vi": "một tuổi thơ cô đơn"
                    },
                    {
                        "en": "She contemplated the lonely walk home.",
                        "vi": "Cô suy tư về bước đi lẻ loi về nhà."
                    },
                    {
                        "en": "These characters live sad, lonely lives.",
                        "vi": "Những nhân vật này sống cuộc đời buồn bã, cô đơn."
                    }
                ]
            },
            {
                "define": {
                    "en": "where only a few people ever come or visit",
                    "vi": "nơi chỉ có một vài người từng đến hoặc ghé thăm"
                },
                "examples": [
                    {
                        "en": "a lonely beach",
                        "vi": "một bãi biển cô đơn"
                    },
                    {
                        "en": "a lonely mountain road",
                        "vi": "một con đường núi cô đơn"
                    },
                    {
                        "en": "It gets pretty lonely here in winter.",
                        "vi": "Ở đây khá cô đơn vào mùa đông."
                    }
                ]
            }
        ]
    },
    {
        "id": "f0b585a0318a4c9c9d85a32c10d07ccd",
        "word": "painful",
        "pos": "adjective",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈpeɪnfl/",
            "us": "/ˈpeɪnfl/"
        },
        "nearby": [
            {
                "word": "Thomas Paine",
                "pos": ""
            },
            {
                "word": "pained",
                "pos": "adjective"
            },
            {
                "word": "painful",
                "pos": "adjective"
            },
            {
                "word": "painfully",
                "pos": "adverb"
            },
            {
                "word": "painkiller",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "causing you pain",
                    "vi": "làm bạn đau"
                },
                "examples": [
                    {
                        "en": "Is your back still painful?",
                        "vi": "Còn đau lưng không?"
                    },
                    {
                        "en": "a painful death",
                        "vi": "một cái chết đau đớn"
                    },
                    {
                        "en": "My ankle is still too painful to walk on.",
                        "vi": "Mắt cá chân của tôi vẫn còn quá đau để đi tiếp."
                    },
                    {
                        "en": "He took a painful blow on the shoulder.",
                        "vi": "Anh ta giáng một đòn đau vào vai."
                    },
                    {
                        "en": "It was a difficult and painful operation.",
                        "vi": "Đó là một ca phẫu thuật khó khăn và đau đớn."
                    }
                ]
            },
            {
                "define": {
                    "en": "causing you to feel upset or embarrassed",
                    "vi": "khiến bạn cảm thấy khó chịu hoặc xấu hổ"
                },
                "examples": [
                    {
                        "en": "Seeing her again brought back painful memories.",
                        "vi": "Gặp lại cô ấy lại mang những ký ức đau buồn."
                    },
                    {
                        "en": "My parents' divorce was a very painful experience for me.",
                        "vi": "Cuộc ly hôn của bố mẹ tôi là một trải nghiệm rất đau đớn đối với tôi."
                    },
                    {
                        "en": "Christmas can be a painful reminder of the loss of a loved one.",
                        "vi": "Giáng sinh có thể là một lời nhắc nhở đau đớn về sự mất mát của một người thân yêu."
                    },
                    {
                        "en": "painful to do something Their efforts were painful to watch.",
                        "vi": "đau đớn khi làm điều gì đó Những nỗ lực của họ rất đau đớn khi theo dõi."
                    },
                    {
                        "en": "I find it extremely painful to read the daily news.",
                        "vi": "Tôi thấy vô cùng đau lòng khi đọc những tin tức hàng ngày."
                    },
                    {
                        "en": "painful for somebody (to do something) It's very painful for a kid to face up to that kind of thing.",
                        "vi": "đau đớn cho ai đó (làm điều gì đó) Rất đau đớn cho một đứa trẻ khi phải đối mặt với điều đó."
                    },
                    {
                        "en": "painful doing something It was painful watching them get it all wrong.",
                        "vi": "đau đớn khi làm điều gì đó Thật đau đớn khi chứng kiến tất cả sai lầm của họ."
                    },
                    {
                        "en": "painful to somebody The subject of his failed marriage was quite painful to him.",
                        "vi": "đau đớn cho ai đó Chủ đề về cuộc hôn nhân thất bại của anh ấy khá đau đớn đối với anh ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "unpleasant or difficult to do",
                    "vi": "khó chịu hoặc khó làm"
                },
                "examples": [
                    {
                        "en": "Applying for jobs can be a long and painful process.",
                        "vi": "Xin việc có thể là một quá trình lâu dài và khó khăn."
                    }
                ]
            }
        ]
    },
    {
        "id": "6942e66a7ba949ee89345586ae3c718f",
        "word": "sadness",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈsædnəs/",
            "us": "/ˈsædnəs/"
        },
        "nearby": [
            {
                "word": "Sadler's Wells",
                "pos": ""
            },
            {
                "word": "sadly",
                "pos": "adverb"
            },
            {
                "word": "sadness",
                "pos": "noun"
            },
            {
                "word": "sadomasochism",
                "pos": "noun"
            },
            {
                "word": "sadomasochist",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the feeling of being sad",
                    "vi": "cảm giác buồn"
                },
                "examples": [
                    {
                        "en": "memories tinged with sadness",
                        "vi": "ký ức nhuốm màu buồn"
                    },
                    {
                        "en": "I felt a deep sadness.",
                        "vi": "Tôi cảm thấy một nỗi buồn sâu sắc."
                    },
                    {
                        "en": "It is with great sadness that we report the death of James Banks yesterday.",
                        "vi": "Chúng tôi vô cùng đau buồn khi chúng tôi báo cáo về cái chết của James Banks ngày hôm qua."
                    }
                ]
            },
            {
                "define": {
                    "en": "something which makes you sad",
                    "vi": "điều gì đó làm bạn buồn"
                },
                "examples": [
                    {
                        "en": "our joys and sadnesses",
                        "vi": "niềm vui và nỗi buồn của chúng tôi"
                    }
                ]
            }
        ]
    },
    {
        "id": "8c9b32fb4539496fa2095d71f7fc0376",
        "word": "unhappiness",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ʌnˈhæpinəs/",
            "us": "/ʌnˈhæpinəs/"
        },
        "nearby": [
            {
                "word": "unhand",
                "pos": "verb"
            },
            {
                "word": "unhappily",
                "pos": "adverb"
            },
            {
                "word": "unhappiness",
                "pos": "noun"
            },
            {
                "word": "unhappy",
                "pos": "adjective"
            },
            {
                "word": "unharmed",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the feeling of being sad or not being happy",
                    "vi": "cảm giác buồn hay không vui"
                },
                "examples": [
                    {
                        "en": "He tried to hide his unhappiness from his fans.",
                        "vi": "Anh ấy cố gắng che giấu sự không vui của mình với người hâm mộ."
                    }
                ]
            },
            {
                "define": {
                    "en": "the feeling of not being pleased or satisfied with something",
                    "vi": "cảm giác không hài lòng hoặc hài lòng với một cái gì đó"
                },
                "examples": [
                    {
                        "en": "He expressed his office's unhappiness about the way the regulations were made.",
                        "vi": "Ông bày tỏ sự không hài lòng của văn phòng về cách thực hiện các quy định."
                    }
                ]
            }
        ]
    },
    {
        "id": "8ce7f0b19032424cad9f982f98b495e3",
        "word": "upset",
        "pos": "adjective",
        "level": "b1",
        "phonetic": {
            "uk": "/ˌʌpˈset/",
            "us": "/ˌʌpˈset/"
        },
        "nearby": [
            {
                "word": "upsell",
                "pos": "verb"
            },
            {
                "word": "upselling",
                "pos": "noun"
            },
            {
                "word": "upset",
                "pos": "adjective"
            },
            {
                "word": "upset",
                "pos": "verb"
            },
            {
                "word": "upset",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "unhappy or disappointed because of something unpleasant that has happened",
                    "vi": "không vui hoặc thất vọng vì điều gì đó khó chịu đã xảy ra"
                },
                "examples": [
                    {
                        "en": "I understand how upset you must be feeling.",
                        "vi": "Tôi hiểu bạn phải cảm thấy khó chịu như thế nào."
                    },
                    {
                        "en": "upset about/at/over something There's no point getting upset about it.",
                        "vi": "khó chịu về / tại / về điều gì đó Không có ích gì khi bạn khó chịu về điều đó."
                    },
                    {
                        "en": "upset about/at/over doing something He was really upset over not getting the present he wanted from Father Christmas.",
                        "vi": "khó chịu về / tại / quá làm điều gì đó Anh ấy thực sự rất buồn vì không nhận được món quà anh ấy muốn từ Cha Giáng sinh."
                    },
                    {
                        "en": "I was upset at missing all the excitement.",
                        "vi": "Tôi đã rất buồn vì bỏ lỡ tất cả sự phấn khích."
                    },
                    {
                        "en": "upset (that)… She was upset that he had left without saying goodbye.",
                        "vi": "khó chịu (điều đó)… Cô ấy buồn vì anh ấy đã bỏ đi mà không nói lời tạm biệt."
                    },
                    {
                        "en": "upset with somebody I think she may be a bit upset with you.",
                        "vi": "khó chịu với ai đó Tôi nghĩ cô ấy có thể hơi khó chịu với bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "an illness in the stomach that makes you feel sick (= want to vomit) or have diarrhoea",
                    "vi": "bệnh dạ dày khiến bạn cảm thấy buồn nôn (= muốn nôn) hoặc tiêu chảy"
                },
                "examples": [
                    {
                        "en": "I've been off work with an upset stomach.",
                        "vi": "Tôi vừa nghỉ làm với cái bụng khó chịu."
                    }
                ]
            }
        ]
    },
    {
        "id": "0e539948ba174c0d9fb86e7702842e29",
        "word": "upset",
        "pos": "verb",
        "level": "b1",
        "phonetic": {
            "uk": "/ʌpˈset/",
            "us": "/ʌpˈset/"
        },
        "nearby": [
            {
                "word": "upselling",
                "pos": "noun"
            },
            {
                "word": "upset",
                "pos": "adjective"
            },
            {
                "word": "upset",
                "pos": "verb"
            },
            {
                "word": "upset",
                "pos": "noun"
            },
            {
                "word": "upsetting",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to make somebody/yourself feel unhappy, anxious or annoyed",
                    "vi": "làm cho ai đó / chính bạn cảm thấy không vui, lo lắng hoặc khó chịu"
                },
                "examples": [
                    {
                        "en": "upset somebody/yourself This decision is likely to upset a lot of people.",
                        "vi": "làm buồn lòng ai đó / bản thân bạn Quyết định này có thể khiến nhiều người khó chịu."
                    },
                    {
                        "en": "Try not to let him upset you.",
                        "vi": "Cố gắng đừng để anh ấy làm bạn buồn."
                    },
                    {
                        "en": "Don't upset yourself about it—let's just forget it ever happened.",
                        "vi": "Đừng buồn phiền về điều đó — hãy quên nó đã từng xảy ra."
                    },
                    {
                        "en": "He had clearly been upset by the incident.",
                        "vi": "Anh ấy rõ ràng đã rất buồn vì vụ việc."
                    },
                    {
                        "en": "it upsets somebody that… It upset him that nobody had bothered to tell him about it.",
                        "vi": "nó làm phiền ai đó rằng… Nó làm anh ấy buồn vì không ai buồn nói với anh ấy về điều đó."
                    },
                    {
                        "en": "it upsets somebody to do something It upsets me to think of her all alone in that big house.",
                        "vi": "nó khiến ai đó phải làm điều gì đó làm tôi buồn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make a plan, situation, etc. go wrong",
                    "vi": "sai kế hoạch, tình huống, v.v."
                },
                "examples": [
                    {
                        "en": "He arrived an hour late and upset all our arrangements.",
                        "vi": "Anh ấy đến muộn một tiếng và làm đảo lộn mọi sắp xếp của chúng tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody feel sick (= want to vomit) after they have eaten or drunk something",
                    "vi": "làm cho ai đó cảm thấy buồn nôn (= muốn nôn) sau khi họ ăn hoặc uống thứ gì đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to make something fall over by hitting it by accident",
                    "vi": "để làm cho một cái gì đó rơi xuống do va vào nó một cách tình cờ"
                },
                "examples": [
                    {
                        "en": "She stood up suddenly, upsetting a glass of wine.",
                        "vi": "Cô đột ngột đứng dậy, bưng ly rượu."
                    }
                ]
            },
            {
                "define": {
                    "en": "to cause problems for somebody or cause their plans, arrangements, etc. to fail",
                    "vi": "gây ra vấn đề cho ai đó hoặc khiến các kế hoạch, sự sắp xếp, v.v. của họ không thành công"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "4e2d9b9049b345cf9acc709b1d47ee8f",
        "word": "bitter",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈbɪtə(r)/",
            "us": "/ˈbɪtər/"
        },
        "nearby": [
            {
                "word": "bitstream",
                "pos": "noun"
            },
            {
                "word": "bitten",
                "pos": "verb"
            },
            {
                "word": "bitter",
                "pos": "adjective"
            },
            {
                "word": "bitter",
                "pos": "noun"
            },
            {
                "word": "bitter lemon",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "having a strong, unpleasant taste; not sweet",
                    "vi": "có mùi vị nồng, khó chịu; không ngọt"
                },
                "examples": [
                    {
                        "en": "Black coffee leaves a bitter taste in the mouth.",
                        "vi": "Cà phê đen để lại vị đắng trong miệng."
                    }
                ]
            },
            {
                "define": {
                    "en": "very serious and unpleasant, with a lot of anger and hate involved",
                    "vi": "rất nghiêm trọng và khó chịu, với rất nhiều sự tức giận và căm ghét liên quan"
                },
                "examples": [
                    {
                        "en": "a long and bitter dispute",
                        "vi": "một cuộc tranh chấp dài và gay gắt"
                    },
                    {
                        "en": "They are locked in a bitter custody battle over their three children.",
                        "vi": "Họ bị nhốt trong cuộc chiến giành quyền nuôi ba đứa con của mình."
                    },
                    {
                        "en": "The candidates are locked in an increasingly bitter struggle.",
                        "vi": "Các ứng cử viên bị khóa trong một cuộc đấu tranh ngày càng gay gắt."
                    }
                ]
            },
            {
                "define": {
                    "en": "feeling angry and unhappy because you feel that you have been treated unfairly",
                    "vi": "cảm thấy tức giận và không vui vì bạn cảm thấy rằng bạn đã bị đối xử bất công"
                },
                "examples": [
                    {
                        "en": "She is very bitter about losing her job.",
                        "vi": "Cô ấy rất cay đắng vì bị mất việc làm."
                    },
                    {
                        "en": "The company sounds pretty bitter about the experience.",
                        "vi": "Công ty có vẻ khá cay đắng về trải nghiệm này."
                    }
                ]
            },
            {
                "define": {
                    "en": "making you feel very unhappy; caused by great unhappiness",
                    "vi": "khiến bạn cảm thấy rất không vui; gây ra bởi sự bất hạnh lớn"
                },
                "examples": [
                    {
                        "en": "to weep/shed bitter tears",
                        "vi": "khóc / rơi nước mắt cay đắng"
                    },
                    {
                        "en": "Losing the match was a bitter disappointment for the team.",
                        "vi": "Thua trận là một nỗi thất vọng cay đắng cho cả đội."
                    },
                    {
                        "en": "I've learnt from bitter experience not to trust what he says.",
                        "vi": "Tôi đã học được từ kinh nghiệm cay đắng là không tin những gì anh ta nói."
                    }
                ]
            },
            {
                "define": {
                    "en": "extremely cold and unpleasant",
                    "vi": "cực kỳ lạnh và khó chịu"
                },
                "examples": [
                    {
                        "en": "bitter cold",
                        "vi": "lạnh thấu xương"
                    },
                    {
                        "en": "a bitter wind",
                        "vi": "một cơn gió đắng"
                    },
                    {
                        "en": "It's really bitter out today.",
                        "vi": "Hôm nay nó thực sự cay đắng."
                    },
                    {
                        "en": "The weather turned bitter.",
                        "vi": "Thời tiết trở nên chua chát."
                    }
                ]
            },
            {
                "define": {
                    "en": "a fact or an event that is unpleasant and difficult to accept",
                    "vi": "một thực tế hoặc một sự kiện khó chịu và khó chấp nhận"
                },
                "examples": [
                    {
                        "en": "The election defeat was a bitter pill for the party to swallow.",
                        "vi": "Thất bại trong cuộc bầu cử là một viên thuốc đắng cho đảng này."
                    }
                ]
            },
            {
                "define": {
                    "en": "continuing until you have done everything you can, or until something is completely finished, despite difficulties and problems",
                    "vi": "tiếp tục cho đến khi bạn hoàn thành mọi việc có thể hoặc cho đến khi hoàn thành xong việc gì đó, bất chấp những khó khăn và vấn đề"
                },
                "examples": [
                    {
                        "en": "They were prepared to fight to the bitter end for their rights.",
                        "vi": "Họ đã sẵn sàng chiến đấu đến cùng cay đắng cho quyền lợi của mình."
                    },
                    {
                        "en": "We will fight this case to the bitter end.",
                        "vi": "Chúng tôi sẽ đấu tranh vụ này đến cùng."
                    }
                ]
            }
        ]
    },
    {
        "id": "a4b12e5387f54a1a8bcbaf9528bab2af",
        "word": "depressed",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/dɪˈprest/",
            "us": "/dɪˈprest/"
        },
        "nearby": [
            {
                "word": "depress",
                "pos": "verb"
            },
            {
                "word": "depressant",
                "pos": "noun"
            },
            {
                "word": "depressed",
                "pos": "adjective"
            },
            {
                "word": "depressing",
                "pos": "adjective"
            },
            {
                "word": "depressingly",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "very sad and without hope",
                    "vi": "rất buồn và không có hy vọng"
                },
                "examples": [
                    {
                        "en": "You mustn't let yourself get depressed.",
                        "vi": "Bạn không được để mình chán nản."
                    },
                    {
                        "en": "depressed about something She felt very depressed about the future.",
                        "vi": "chán nản về điều gì đó Cô cảm thấy rất chán nản về tương lai."
                    },
                    {
                        "en": "depressed at something He was really depressed at the thought of going into the office.",
                        "vi": "chán nản vì điều gì đó Anh thực sự chán nản khi nghĩ đến việc đi vào văn phòng."
                    },
                    {
                        "en": "depressed over something She was depressed over the recent death of her mother.",
                        "vi": "chán nản vì điều gì đó Cô ấy bị trầm cảm về cái chết gần đây của mẹ cô ấy."
                    },
                    {
                        "en": "depressed by something I was depressed by our lack of progress.",
                        "vi": "chán nản vì điều gì đó Tôi chán nản vì sự thiếu tiến bộ của chúng tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "suffering from the medical condition of depression",
                    "vi": "bị bệnh trầm cảm"
                },
                "examples": [
                    {
                        "en": "She became severely depressed.",
                        "vi": "Cô ấy trở nên trầm cảm nghiêm trọng."
                    },
                    {
                        "en": "There is medical evidence to show that he is clinically depressed.",
                        "vi": "Có bằng chứng y tế cho thấy anh ta bị trầm cảm về mặt lâm sàng."
                    },
                    {
                        "en": "She suffers from sleep disturbance and depressed mood.",
                        "vi": "Cô bị rối loạn giấc ngủ và tâm trạng chán nản."
                    }
                ]
            },
            {
                "define": {
                    "en": "without enough economic activity or jobs for people",
                    "vi": "không có đủ hoạt động kinh tế hoặc công ăn việc làm cho mọi người"
                },
                "examples": [
                    {
                        "en": "They have made little attempt to bring jobs to economically depressed areas.",
                        "vi": "Họ đã có rất ít nỗ lực để mang lại công ăn việc làm cho các khu vực kinh tế suy thoái."
                    },
                    {
                        "en": "The shipping trade was badly depressed.",
                        "vi": "Việc buôn bán vận tải biển sa sút nghiêm trọng."
                    }
                ]
            },
            {
                "define": {
                    "en": "having a lower amount or level than usual",
                    "vi": "có số lượng hoặc mức thấp hơn bình thường"
                },
                "examples": [
                    {
                        "en": "depressed prices",
                        "vi": "giá giảm"
                    }
                ]
            }
        ]
    },
    {
        "id": "ab911c82be434d86a7f88729d79d3d7f",
        "word": "depressing",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/dɪˈpresɪŋ/",
            "us": "/dɪˈpresɪŋ/"
        },
        "nearby": [
            {
                "word": "depressant",
                "pos": "noun"
            },
            {
                "word": "depressed",
                "pos": "adjective"
            },
            {
                "word": "depressing",
                "pos": "adjective"
            },
            {
                "word": "depressingly",
                "pos": "adverb"
            },
            {
                "word": "depression",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "making you feel very sad and without enthusiasm",
                    "vi": "khiến bạn cảm thấy rất buồn và không có nhiệt huyết"
                },
                "examples": [
                    {
                        "en": "a depressing sight/thought/experience",
                        "vi": "một cảnh tượng / suy nghĩ / trải nghiệm chán nản"
                    },
                    {
                        "en": "Looking for a job these days can be very depressing.",
                        "vi": "Tìm kiếm một công việc những ngày này có thể rất chán nản."
                    },
                    {
                        "en": "These findings make very depressing reading.",
                        "vi": "Những phát hiện này làm cho việc đọc rất chán nản."
                    }
                ]
            }
        ]
    },
    {
        "id": "c042cbea968b4f7c802061de2497317e",
        "word": "depression",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/dɪˈpreʃn/",
            "us": "/dɪˈpreʃn/"
        },
        "nearby": [
            {
                "word": "depressing",
                "pos": "adjective"
            },
            {
                "word": "depressingly",
                "pos": "adverb"
            },
            {
                "word": "depression",
                "pos": "noun"
            },
            {
                "word": "the Depression",
                "pos": ""
            },
            {
                "word": "depressive",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a medical condition in which a person feels very sad and anxious and often has physical symptoms such as being unable to sleep, etc.",
                    "vi": "Một tình trạng bệnh mà một người cảm thấy rất buồn và lo lắng và thường có các triệu chứng về thể chất như không thể ngủ, v.v."
                },
                "examples": [
                    {
                        "en": "She was diagnosed as having clinical depression.",
                        "vi": "Cô được chẩn đoán là mắc chứng trầm cảm lâm sàng."
                    },
                    {
                        "en": "She suffered from severe depression after losing her job.",
                        "vi": "Cô bị trầm cảm nặng sau khi mất việc."
                    }
                ]
            },
            {
                "define": {
                    "en": "the state of feeling very sad and without hope",
                    "vi": "trạng thái cảm thấy rất buồn và không có hy vọng"
                },
                "examples": [
                    {
                        "en": "There was a feeling of gloom and depression in the office when the news of the job cuts was announced.",
                        "vi": "Có một cảm giác u ám và chán nản trong văn phòng khi tin tức về việc cắt giảm việc làm được thông báo."
                    }
                ]
            },
            {
                "define": {
                    "en": "a period when there is little economic activity and many people are poor or without jobs",
                    "vi": "thời kỳ có ít hoạt động kinh tế và nhiều người nghèo hoặc không có việc làm"
                },
                "examples": [
                    {
                        "en": "The country was in the grip of (an) economic depression.",
                        "vi": "Đất nước đang trong vòng xoáy của (một) suy thoái kinh tế."
                    },
                    {
                        "en": "the great Depression of the 1930s",
                        "vi": "cuộc đại suy thoái những năm 1930"
                    },
                    {
                        "en": "He grew up during the Great Depression of the 1930s.",
                        "vi": "Ông lớn lên trong cuộc Đại suy thoái những năm 1930."
                    }
                ]
            },
            {
                "define": {
                    "en": "a part of a surface that is lower than the parts around it",
                    "vi": "một phần của bề mặt thấp hơn các phần xung quanh nó"
                },
                "examples": [
                    {
                        "en": "Rainwater collects in shallow depressions on the ground.",
                        "vi": "Nước mưa đọng lại ở những chỗ trũng nông trên mặt đất."
                    },
                    {
                        "en": "From the air, the photos show a shallow depression on the planet's surface.",
                        "vi": "Từ trên không, các bức ảnh cho thấy một vùng lõm nông trên bề mặt hành tinh."
                    }
                ]
            },
            {
                "define": {
                    "en": "a weather condition in which the pressure of the air becomes lower, often causing rain",
                    "vi": "một điều kiện thời tiết trong đó áp suất của không khí trở nên thấp hơn, thường gây ra mưa"
                },
                "examples": [
                    {
                        "en": "an atmospheric depression moving east from the Atlantic",
                        "vi": "một áp thấp khí quyển di chuyển về phía đông từ Đại Tây Dương"
                    }
                ]
            }
        ]
    },
    {
        "id": "f1b059ed50574c1b8471cb5a246b5d7b",
        "word": "desperate",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈdespərət/",
            "us": "/ˈdespərət/"
        },
        "nearby": [
            {
                "word": "despatch box",
                "pos": "noun"
            },
            {
                "word": "desperado",
                "pos": "noun"
            },
            {
                "word": "desperate",
                "pos": "adjective"
            },
            {
                "word": "Desperate Dan",
                "pos": ""
            },
            {
                "word": "Desperate Housewives",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "feeling or showing that you have little hope and are ready to do anything without worrying about danger to yourself or others",
                    "vi": "cảm thấy hoặc cho thấy rằng bạn có rất ít hy vọng và sẵn sàng làm bất cứ điều gì mà không lo lắng về nguy hiểm cho bản thân hoặc người khác"
                },
                "examples": [
                    {
                        "en": "The prisoners grew increasingly desperate.",
                        "vi": "Các tù nhân ngày càng trở nên tuyệt vọng."
                    },
                    {
                        "en": "Stores are getting desperate after two years of poor sales.",
                        "vi": "Các cửa hàng đang trở nên tuyệt vọng sau hai năm bán hàng kém."
                    },
                    {
                        "en": "Somewhere out there was a desperate man, cold, hungry, hunted.",
                        "vi": "Đâu đó ngoài kia có một người đàn ông tuyệt vọng, lạnh lùng, đói khát, bị săn đuổi."
                    },
                    {
                        "en": "I heard sounds of a desperate struggle in the next room.",
                        "vi": "Tôi nghe thấy âm thanh của một cuộc đấu tranh tuyệt vọng trong phòng bên cạnh."
                    }
                ]
            },
            {
                "define": {
                    "en": "giving little hope of success; tried when everything else has failed",
                    "vi": "cho ít hy vọng thành công; đã thử khi mọi thứ khác không thành công"
                },
                "examples": [
                    {
                        "en": "He made a desperate bid for freedom.",
                        "vi": "Anh ta đã thực hiện một nỗ lực tuyệt vọng cho tự do."
                    },
                    {
                        "en": "She clung to the edge in a desperate attempt to save herself.",
                        "vi": "Cô bám vào bờ vực trong một nỗ lực tuyệt vọng để tự cứu mình."
                    },
                    {
                        "en": "His increasing financial difficulties forced him to take desperate measures.",
                        "vi": "Khó khăn tài chính ngày càng gia tăng buộc anh phải thực hiện các biện pháp tuyệt vọng."
                    },
                    {
                        "en": "Doctors were fighting a desperate battle to save the little girl's life.",
                        "vi": "Các bác sĩ đã chiến đấu trong một trận chiến tuyệt vọng để cứu sống cô gái nhỏ."
                    }
                ]
            },
            {
                "define": {
                    "en": "needing or wanting something very much",
                    "vi": "cần hoặc muốn một cái gì đó rất nhiều"
                },
                "examples": [
                    {
                        "en": "desperate for something He was so desperate for a job he would have done anything.",
                        "vi": "tuyệt vọng vì điều gì đó Anh ấy rất tuyệt vọng về một công việc mà anh ấy sẽ làm bất cứ điều gì."
                    },
                    {
                        "en": "(informal) I'm desperate for a coffee.",
                        "vi": "(thân mật) Tôi đang rất muốn uống cà phê."
                    },
                    {
                        "en": "to be desperate for money/help/cash/attention",
                        "vi": "tuyệt vọng vì tiền / sự giúp đỡ / tiền mặt / sự chú ý"
                    },
                    {
                        "en": "desperate to do something I was absolutely desperate to see her.",
                        "vi": "tuyệt vọng để làm điều gì đó Tôi hoàn toàn tuyệt vọng khi gặp cô ấy."
                    },
                    {
                        "en": "She was desperate to escape small town life.",
                        "vi": "Cô tuyệt vọng để thoát khỏi cuộc sống thị trấn nhỏ."
                    }
                ]
            },
            {
                "define": {
                    "en": "extremely serious or dangerous",
                    "vi": "cực kỳ nghiêm trọng hoặc nguy hiểm"
                },
                "examples": [
                    {
                        "en": "The children are in desperate need of love and attention.",
                        "vi": "Những đứa trẻ đang rất cần tình yêu thương và sự quan tâm."
                    },
                    {
                        "en": "They face a desperate shortage of clean water.",
                        "vi": "Họ phải đối mặt với tình trạng thiếu nước sạch một cách tuyệt vọng."
                    },
                    {
                        "en": "His financial situation was desperate.",
                        "vi": "Tình hình tài chính của anh ấy thật tuyệt vọng."
                    },
                    {
                        "en": "He had died in desperate poverty.",
                        "vi": "Anh ấy đã chết trong cảnh nghèo đói tuyệt vọng."
                    },
                    {
                        "en": "American farmers are in desperate straits today.",
                        "vi": "Ngày nay, nông dân Mỹ đang lâm vào cảnh túng quẫn."
                    }
                ]
            }
        ]
    },
    {
        "id": "8e1d93978be2407f8c0ca60f85b79d3b",
        "word": "down",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/daʊn/",
            "us": "/daʊn/"
        },
        "nearby": [
            {
                "word": "down",
                "pos": "preposition"
            },
            {
                "word": "down",
                "pos": "verb"
            },
            {
                "word": "down",
                "pos": "adjective"
            },
            {
                "word": "down",
                "pos": "noun"
            },
            {
                "word": "down and out",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "moving or directed downwards or away from a place",
                    "vi": "di chuyển hoặc hướng xuống dưới hoặc ra khỏi một nơi"
                },
                "examples": [
                    {
                        "en": "The down escalator isn't working.",
                        "vi": "Thang cuốn xuống không hoạt động."
                    },
                    {
                        "en": "Click the down arrow.",
                        "vi": "Nhấp vào mũi tên xuống."
                    }
                ]
            },
            {
                "define": {
                    "en": "sad or depressed",
                    "vi": "buồn hoặc chán nản"
                },
                "examples": [
                    {
                        "en": "I feel a bit down today.",
                        "vi": "Tôi cảm thấy một chút xuống ngày hôm nay."
                    },
                    {
                        "en": "You look a bit down. Is something the matter?",
                        "vi": "Bạn nhìn xuống một chút. Có gì sai không?"
                    },
                    {
                        "en": "Don't let the weather get you down.",
                        "vi": "Đừng để thời tiết làm bạn thất vọng."
                    }
                ]
            },
            {
                "define": {
                    "en": "not working",
                    "vi": "không làm việc"
                },
                "examples": [
                    {
                        "en": "The system was down all morning.",
                        "vi": "Hệ thống đã ngừng hoạt động cả buổi sáng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have no money because of a period of bad luck",
                    "vi": "không có tiền vì một khoảng thời gian kém may mắn"
                },
                "examples": [
                    {
                        "en": "In the movie they play two jazz musicians who are down on their luck.",
                        "vi": "Trong phim, họ đóng vai hai nhạc sĩ nhạc jazz đang thất vọng với vận may của họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "unhappy and depressed",
                    "vi": "không vui và chán nản"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to continue to hurt somebody when they are already defeated",
                    "vi": "tiếp tục làm tổn thương ai đó khi họ đã bị đánh bại"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to continue to hurt somebody when they are already defeated, etc.",
                    "vi": "để tiếp tục làm tổn thương ai đó khi họ đã bị đánh bại, v.v."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "7471012e6d8e42d1b87890c19794f5cc",
        "word": "empty",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈempti/",
            "us": "/ˈempti/"
        },
        "nearby": [
            {
                "word": "emptiness",
                "pos": "noun"
            },
            {
                "word": "empty",
                "pos": "noun"
            },
            {
                "word": "empty",
                "pos": "adjective"
            },
            {
                "word": "empty",
                "pos": "verb"
            },
            {
                "word": "empty-handed",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "with no people or things inside",
                    "vi": "không có người hoặc vật gì bên trong"
                },
                "examples": [
                    {
                        "en": "an empty box/glass/bottle",
                        "vi": "một hộp / ly / chai rỗng"
                    },
                    {
                        "en": "empty hands (= not holding anything)",
                        "vi": "hai bàn tay trắng (= không cầm bất cứ thứ gì)"
                    },
                    {
                        "en": "an empty plate (= with no food on it)",
                        "vi": "một cái đĩa trống (= không có thức ăn trên đó)"
                    },
                    {
                        "en": "I noticed an empty space on the bookshelf.",
                        "vi": "Tôi nhận thấy một không gian trống trên giá sách."
                    },
                    {
                        "en": "I couldn't see any empty seats (= with nobody sitting in them).",
                        "vi": "Tôi không thể thấy bất kỳ ghế trống nào (= không có ai ngồi trong đó)."
                    },
                    {
                        "en": "The theatre was half empty.",
                        "vi": "Rạp đã trống một nửa."
                    },
                    {
                        "en": "an empty house/room/bus",
                        "vi": "một ngôi nhà trống / phòng / xe buýt"
                    },
                    {
                        "en": "As it got later, the streets became empty.",
                        "vi": "Càng về sau, đường phố càng vắng tanh."
                    },
                    {
                        "en": "The house had been standing empty (= without people living in it) for some time.",
                        "vi": "Ngôi nhà đã trống rỗng (= không có người sống trong đó) một thời gian."
                    },
                    {
                        "en": "It's not good to drink alcohol on an empty stomach (= without having eaten something).",
                        "vi": "Sẽ không tốt nếu uống rượu khi bụng đói (= mà chưa ăn gì)."
                    },
                    {
                        "en": "empty of something (formal) The room was empty of furniture.",
                        "vi": "trống rỗng của một cái gì đó (trang trọng) Căn phòng trống rỗng của đồ nội thất."
                    }
                ]
            },
            {
                "define": {
                    "en": "with no meaning; not meaning what is said",
                    "vi": "vô nghĩa; không có nghĩa là những gì được nói"
                },
                "examples": [
                    {
                        "en": "empty words",
                        "vi": "những từ trống rỗng"
                    },
                    {
                        "en": "an empty promise",
                        "vi": "một lời hứa suông"
                    },
                    {
                        "en": "Voters will see through the empty rhetoric.",
                        "vi": "Các cử tri sẽ nhìn thấy qua các bài hùng biện trống rỗng."
                    },
                    {
                        "en": "an empty gesture aimed at pleasing the crowds",
                        "vi": "một cử chỉ trống rỗng nhằm làm hài lòng đám đông"
                    }
                ]
            },
            {
                "define": {
                    "en": "unhappy because life does not seem to have a purpose, usually after something sad has happened",
                    "vi": "không hạnh phúc bởi vì cuộc sống dường như không có mục đích, thường là sau khi một điều gì đó buồn đã xảy ra"
                },
                "examples": [
                    {
                        "en": "Three months after his death, she still felt empty.",
                        "vi": "Ba tháng sau cái chết của anh, cô vẫn cảm thấy trống trải."
                    },
                    {
                        "en": "My life seems empty without you.",
                        "vi": "Cuộc sống của tôi dường như trống rỗng khi không có em."
                    },
                    {
                        "en": "We all feel very empty now she's gone.",
                        "vi": "Tất cả chúng tôi đều cảm thấy rất trống rỗng khi cô ấy đã ra đi."
                    }
                ]
            },
            {
                "define": {
                    "en": "without a quality that you would expect to be there",
                    "vi": "không có chất lượng mà bạn mong đợi ở đó"
                },
                "examples": [
                    {
                        "en": "words that were empty of meaning",
                        "vi": "những từ không có nghĩa"
                    }
                ]
            }
        ]
    },
    {
        "id": "057301e2af1248ecacc15035daca8505",
        "word": "homesick",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈhəʊmsɪk/",
            "us": "/ˈhəʊmsɪk/"
        },
        "nearby": [
            {
                "word": "Home Secretary",
                "pos": "noun"
            },
            {
                "word": "home shopping",
                "pos": "noun"
            },
            {
                "word": "homesick",
                "pos": "adjective"
            },
            {
                "word": "homesickness",
                "pos": "noun"
            },
            {
                "word": "homespun",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "sad because you are away from home and you miss your family and friends",
                    "vi": "buồn vì bạn xa nhà và bạn nhớ gia đình và bạn bè của bạn"
                },
                "examples": [
                    {
                        "en": "I felt homesick for Scotland.",
                        "vi": "Tôi cảm thấy nhớ nhà đối với Scotland."
                    },
                    {
                        "en": "She felt homesick for her country.",
                        "vi": "Cô cảm thấy nhớ quê hương đất nước của mình."
                    },
                    {
                        "en": "She was beginning to get a bit homesick.",
                        "vi": "Cô bắt đầu nhớ nhà một chút."
                    }
                ]
            }
        ]
    },
    {
        "id": "c505ce63e8ed448ebcc4e2135e043316",
        "word": "hurt",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/hɜːt/",
            "us": "/hɜːrt/"
        },
        "nearby": [
            {
                "word": "hurry on",
                "pos": "phrasal verb"
            },
            {
                "word": "hurry up",
                "pos": "phrasal verb"
            },
            {
                "word": "hurt",
                "pos": "verb"
            },
            {
                "word": "hurt",
                "pos": "adjective"
            },
            {
                "word": "hurt",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to cause physical pain to somebody/yourself; to injure somebody/yourself",
                    "vi": "gây ra nỗi đau thể xác cho ai đó / chính bạn; để làm bị thương ai đó / chính bạn"
                },
                "examples": [
                    {
                        "en": "hurt something He hurt his back playing squash.",
                        "vi": "đau cái gì đó Anh ấy đau lưng khi chơi bóng quần."
                    },
                    {
                        "en": "Strong light hurts my eyes.",
                        "vi": "Ánh sáng mạnh làm đau mắt tôi."
                    },
                    {
                        "en": "hurt yourself Did you hurt yourself?",
                        "vi": "làm tổn thương chính mình Bạn đã làm tổn thương chính mình?"
                    },
                    {
                        "en": "hurt (somebody) Stop it. You're hurting me.",
                        "vi": "làm tổn thương (ai đó) Dừng lại. Bạn đang làm tổn thương tôi."
                    },
                    {
                        "en": "No one was seriously hurt in the accident.",
                        "vi": "Không ai bị thương nặng trong vụ tai nạn."
                    },
                    {
                        "en": "My back is really hurting me today.",
                        "vi": "Hôm nay lưng em đau lắm."
                    },
                    {
                        "en": "My shoes hurt—they're too tight.",
                        "vi": "Giày của tôi bị đau - chúng quá chật."
                    }
                ]
            },
            {
                "define": {
                    "en": "to feel painful",
                    "vi": "cảm thấy đau đớn"
                },
                "examples": [
                    {
                        "en": "My feet hurt.",
                        "vi": "Chân tôi đau."
                    },
                    {
                        "en": "My head hurts.",
                        "vi": "Đầu tôi đau."
                    },
                    {
                        "en": "Ouch! That hurt!",
                        "vi": "Ầm ầm! Đau quá!"
                    },
                    {
                        "en": "it hurts when/if… It hurts when I bend my knee.",
                        "vi": "nó đau khi / nếu… Nó đau khi tôi uốn cong đầu gối của mình."
                    },
                    {
                        "en": "It hurts if I move my neck.",
                        "vi": "Nếu tôi cử động cổ sẽ rất đau."
                    },
                    {
                        "en": "it hurts to do something It hurts to breathe.",
                        "vi": "nó đau khi làm điều gì đó Nó đau khi thở."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody unhappy or upset",
                    "vi": "làm cho ai đó không vui hoặc khó chịu"
                },
                "examples": [
                    {
                        "en": "What really hurt was that he never answered my letter.",
                        "vi": "Điều thực sự làm tổn thương là anh ấy không bao giờ trả lời thư của tôi."
                    },
                    {
                        "en": "hurt somebody/something I'm sorry, I didn't mean to hurt you.",
                        "vi": "làm tổn thương ai đó / điều gì đó Tôi xin lỗi, tôi không cố ý làm tổn thương bạn."
                    },
                    {
                        "en": "I didn't want to hurt his feelings.",
                        "vi": "Tôi không muốn làm tổn thương tình cảm của anh ấy."
                    },
                    {
                        "en": "it hurts to do something It always hurts to lose, especially in the final.",
                        "vi": "rất đau khi làm điều gì đó Luôn luôn đau đớn khi thua, đặc biệt là trong trận chung kết."
                    },
                    {
                        "en": "it hurts somebody to do something It hurt me to think that he would lie to me.",
                        "vi": "Ai đó làm điều gì đó rất đau, tôi rất đau khi nghĩ rằng anh ấy sẽ nói dối tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to feel unhappy or upset",
                    "vi": "cảm thấy không vui hoặc buồn"
                },
                "examples": [
                    {
                        "en": "I know you're hurting and I want to help you.",
                        "vi": "Tôi biết bạn đang bị tổn thương và tôi muốn giúp bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have a bad effect on somebody/something",
                    "vi": "có ảnh hưởng xấu đến ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "Hard work never hurt anyone.",
                        "vi": "Làm việc chăm chỉ không bao giờ làm tổn thương bất cứ ai."
                    },
                    {
                        "en": "Many people on low incomes will be hurt by the government's plans.",
                        "vi": "Nhiều người có thu nhập thấp sẽ bị ảnh hưởng bởi các kế hoạch của chính phủ."
                    },
                    {
                        "en": "High interest rates are hurting the local economy.",
                        "vi": "Lãi suất cao đang gây tổn hại cho nền kinh tế địa phương."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be in a difficult situation because you need something, especially money",
                    "vi": "rơi vào một tình huống khó khăn vì bạn cần một thứ gì đó, đặc biệt là tiền"
                },
                "examples": [
                    {
                        "en": "His campaign is already hurting for money.",
                        "vi": "Chiến dịch của anh ấy đã bị tổn hại vì tiền."
                    }
                ]
            },
            {
                "define": {
                    "en": "to affect somebody where they will feel it most",
                    "vi": "ảnh hưởng đến ai đó mà họ sẽ cảm thấy điều đó nhất"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to say that somebody should do a particular thing",
                    "vi": "từng nói rằng ai đó nên làm một việc cụ thể"
                },
                "examples": [
                    {
                        "en": "It wouldn't hurt you to help with the housework occasionally.",
                        "vi": "Thỉnh thoảng giúp bạn làm việc nhà sẽ không có hại gì."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be kind and gentle and unwilling to cause unhappiness",
                    "vi": "tử tế và nhẹ nhàng và không muốn gây ra bất hạnh"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "0e994706c1a24bc58ae172acd8110b2c",
        "word": "jealousy",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈdʒeləsi/",
            "us": "/ˈdʒeləsi/"
        },
        "nearby": [
            {
                "word": "jealous",
                "pos": "adjective"
            },
            {
                "word": "jealously",
                "pos": "adverb"
            },
            {
                "word": "jealousy",
                "pos": "noun"
            },
            {
                "word": "Jean",
                "pos": ""
            },
            {
                "word": "Jeanette",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a feeling of being jealous",
                    "vi": "cảm giác ghen tị"
                },
                "examples": [
                    {
                        "en": "I felt sick with jealousy.",
                        "vi": "Tôi cảm thấy phát ốm vì ghen tị."
                    },
                    {
                        "en": "He felt a sudden stab of pure sexual jealousy.",
                        "vi": "Anh đột nhiên cảm thấy một sự ghen tuông tình dục thuần túy đâm vào."
                    }
                ]
            },
            {
                "define": {
                    "en": "an action or a remark that shows that a person is jealous",
                    "vi": "một hành động hoặc một nhận xét cho thấy rằng một người đang ghen tị"
                },
                "examples": [
                    {
                        "en": "I'm tired of her petty jealousies.",
                        "vi": "Tôi mệt mỏi vì những trò ghen tuông vụn vặt của cô ấy."
                    }
                ]
            }
        ]
    },
    {
        "id": "11f2ea4c141a44a1842597a66ae2e98d",
        "word": "miserable",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈmɪzrəbl/",
            "us": "/ˈmɪzrəbl/"
        },
        "nearby": [
            {
                "word": "mise en scène",
                "pos": "noun"
            },
            {
                "word": "miser",
                "pos": "noun"
            },
            {
                "word": "miserable",
                "pos": "adjective"
            },
            {
                "word": "miserably",
                "pos": "adverb"
            },
            {
                "word": "miserly",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "very unhappy or uncomfortable",
                    "vi": "rất không vui hoặc không thoải mái"
                },
                "examples": [
                    {
                        "en": "We were cold, wet and thoroughly miserable.",
                        "vi": "Chúng tôi đã bị lạnh, ẩm ướt và hoàn toàn đau khổ."
                    },
                    {
                        "en": "Don't look so miserable!",
                        "vi": "Đừng trông khổ sở như vậy!"
                    },
                    {
                        "en": "She knows how to make life miserable for her employees.",
                        "vi": "Cô ấy biết làm thế nào để làm cho cuộc sống khốn khổ cho nhân viên của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "making you feel very unhappy or uncomfortable",
                    "vi": "khiến bạn cảm thấy rất không vui hoặc không thoải mái"
                },
                "examples": [
                    {
                        "en": "miserable housing conditions",
                        "vi": "điều kiện nhà ở khốn khổ"
                    },
                    {
                        "en": "I spent a miserable weekend alone at home.",
                        "vi": "Tôi đã trải qua một ngày cuối tuần khốn khổ khi ở nhà một mình."
                    },
                    {
                        "en": "What a miserable day! (= cold and wet)",
                        "vi": "Thật là một ngày khốn khổ! (= lạnh và ẩm ướt)"
                    },
                    {
                        "en": "The play was a miserable failure.",
                        "vi": "Vở kịch là một thất bại thảm hại."
                    },
                    {
                        "en": "These people live in miserable conditions.",
                        "vi": "Những người này sống trong điều kiện khốn khổ."
                    }
                ]
            },
            {
                "define": {
                    "en": "always unhappy, unfriendly and in a bad mood",
                    "vi": "luôn không vui, không thân thiện và có tâm trạng tồi tệ"
                },
                "examples": [
                    {
                        "en": "He was a miserable old devil.",
                        "vi": "Ông ta là một con quỷ già khốn nạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "too small in quantity",
                    "vi": "số lượng quá ít"
                },
                "examples": [
                    {
                        "en": "How can anyone live on such a miserable wage?",
                        "vi": "Làm sao ai có thể sống được bằng đồng lương khốn khổ như vậy?"
                    }
                ]
            }
        ]
    },
    {
        "id": "5cfd055224eb4ab5a43c86ac2e3e303c",
        "word": "moody",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈmuːdi/",
            "us": "/ˈmuːdi/"
        },
        "nearby": [
            {
                "word": "moodiness",
                "pos": "noun"
            },
            {
                "word": "mood music",
                "pos": "noun"
            },
            {
                "word": "moody",
                "pos": "adjective"
            },
            {
                "word": "Helen Wills Moody",
                "pos": ""
            },
            {
                "word": "Moody's",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "having moods that change quickly and often",
                    "vi": "có tâm trạng thay đổi nhanh chóng và thường xuyên"
                },
                "examples": [
                    {
                        "en": "Moody people are very difficult to deal with.",
                        "vi": "Những người thất thường rất khó đối phó."
                    },
                    {
                        "en": "She’s a bit moody and never the same two days in a row.",
                        "vi": "Cô ấy hơi thất thường và không bao giờ giống như vậy trong hai ngày liên tiếp."
                    },
                    {
                        "en": "Teenagers tend to get a bad name for being moody, rude and irresponsible.",
                        "vi": "Thanh thiếu niên có xu hướng bị mang tiếng xấu vì tính tình thất thường, thô lỗ và vô trách nhiệm."
                    }
                ]
            },
            {
                "define": {
                    "en": "angry or upset, often for no particular reason",
                    "vi": "tức giận hoặc khó chịu, thường không có lý do cụ thể"
                },
                "examples": [
                    {
                        "en": "Why are you so moody today?",
                        "vi": "Sao hôm nay bạn ủ rũ thế?"
                    }
                ]
            },
            {
                "define": {
                    "en": "suggesting particular emotions, especially sad ones",
                    "vi": "gợi ra những cảm xúc cụ thể, đặc biệt là những cảm xúc buồn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "2e106fdc6a1841c5b0d5a6d8a903c40d",
        "word": "pity",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈpɪti/",
            "us": "/ˈpɪti/"
        },
        "nearby": [
            {
                "word": "pit viper",
                "pos": "noun"
            },
            {
                "word": "pity",
                "pos": "noun"
            },
            {
                "word": "pity",
                "pos": "verb"
            },
            {
                "word": "pitying",
                "pos": "adjective"
            },
            {
                "word": "pityingly",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to feel sorry for somebody because of their situation; to feel pity for somebody",
                    "vi": "cảm thấy tiếc cho ai đó vì hoàn cảnh của họ; cảm thấy thương hại cho ai đó"
                },
                "examples": [
                    {
                        "en": "pity somebody He pitied people who were stuck in dead-end jobs.",
                        "vi": "thương hại ai đó Anh ấy thương hại những người bị mắc kẹt trong những công việc bế tắc."
                    },
                    {
                        "en": "Compulsive gamblers are more to be pitied than condemned.",
                        "vi": "Những người chơi cờ bạc bắt buộc đáng thương hơn là đáng lên án."
                    },
                    {
                        "en": "pity somebody doing something I pity her having to work such long hours.",
                        "vi": "thương hại ai đó đang làm điều gì đó Tôi thương hại cô ấy phải làm việc nhiều giờ như vậy."
                    }
                ]
            }
        ]
    },
    {
        "id": "46c48143d27546f7a705186bd273109b",
        "word": "tragic",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈtrædʒɪk/",
            "us": "/ˈtrædʒɪk/"
        },
        "nearby": [
            {
                "word": "tragedienne",
                "pos": "noun"
            },
            {
                "word": "tragedy",
                "pos": "noun"
            },
            {
                "word": "tragic",
                "pos": "adjective"
            },
            {
                "word": "tragically",
                "pos": "adverb"
            },
            {
                "word": "tragic irony",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "making you feel very sad, usually because somebody has died or suffered a lot",
                    "vi": "khiến bạn cảm thấy rất buồn, thường là vì ai đó đã chết hoặc phải chịu đựng rất nhiều"
                },
                "examples": [
                    {
                        "en": "He was killed in a tragic accident at the age of 24.",
                        "vi": "Anh ấy đã thiệt mạng trong một vụ tai nạn thảm khốc ở tuổi 24."
                    },
                    {
                        "en": "Cuts in the health service could have tragic consequences for patients.",
                        "vi": "Việc cắt giảm dịch vụ y tế có thể gây ra hậu quả bi thảm cho bệnh nhân."
                    },
                    {
                        "en": "It would be tragic if her talent remained unrecognized.",
                        "vi": "Sẽ thật bi thảm nếu tài năng của cô ấy vẫn không được công nhận."
                    },
                    {
                        "en": "a rather tragic story",
                        "vi": "một câu chuyện khá bi thảm"
                    }
                ]
            },
            {
                "define": {
                    "en": "connected with tragedy (= the style of literature)",
                    "vi": "kết nối với bi kịch (= phong cách văn học)"
                },
                "examples": [
                    {
                        "en": "a tragic actor/hero",
                        "vi": "một diễn viên / anh hùng bi kịch"
                    }
                ]
            }
        ]
    },
    {
        "id": "579f2baae2fa443fa77e96ced659a74e",
        "word": "upsetting",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/ʌpˈsetɪŋ/",
            "us": "/ʌpˈsetɪŋ/"
        },
        "nearby": [
            {
                "word": "upset",
                "pos": "verb"
            },
            {
                "word": "upset",
                "pos": "noun"
            },
            {
                "word": "upsetting",
                "pos": "adjective"
            },
            {
                "word": "upshift",
                "pos": "verb"
            },
            {
                "word": "the upshot",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "making you feel unhappy, anxious or annoyed",
                    "vi": "khiến bạn cảm thấy không vui, lo lắng hoặc khó chịu"
                },
                "examples": [
                    {
                        "en": "I could see that it had been an upsetting experience for him.",
                        "vi": "Tôi có thể thấy rằng đó là một trải nghiệm khó chịu đối với anh ấy."
                    },
                    {
                        "en": "She finds the divorce too upsetting to talk about.",
                        "vi": "Cô ấy thấy cuộc ly hôn quá khó chịu để nói về nó."
                    }
                ]
            }
        ]
    },
    {
        "id": "42b5ae8baea942629ea46834b44650e6",
        "word": "broken heart",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌbrəʊkən ˈhɑːt/",
            "us": "/ˌbrəʊkən ˈhɑːrt/"
        },
        "nearby": [
            {
                "word": "broken",
                "pos": "verb"
            },
            {
                "word": "broken-down",
                "pos": "adjective"
            },
            {
                "word": "broken heart",
                "pos": "noun"
            },
            {
                "word": "broken-hearted",
                "pos": "adjective"
            },
            {
                "word": "broken home",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a very sad feeling, especially when somebody you love has died or left you",
                    "vi": "một cảm giác rất buồn, đặc biệt là khi người bạn yêu thương đã chết hoặc rời bỏ bạn"
                },
                "examples": [
                    {
                        "en": "No one ever died of a broken heart.",
                        "vi": "Không ai từng chết vì trái tim tan vỡ."
                    }
                ]
            }
        ]
    },
    {
        "id": "0a7e9df32162415697b44466750833cd",
        "word": "broken-hearted",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌbrəʊkən ˈhɑːtɪd/",
            "us": "/ˌbrəʊkən ˈhɑːrtɪd/"
        },
        "nearby": [
            {
                "word": "broken-down",
                "pos": "adjective"
            },
            {
                "word": "broken heart",
                "pos": "noun"
            },
            {
                "word": "broken-hearted",
                "pos": "adjective"
            },
            {
                "word": "broken home",
                "pos": "noun"
            },
            {
                "word": "brokenly",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "extremely sad, especially when somebody you love has died or left you",
                    "vi": "cực kỳ buồn, đặc biệt là khi người bạn yêu đã chết hoặc rời bỏ bạn"
                },
                "examples": [
                    {
                        "en": "He was broken-hearted when his wife died.",
                        "vi": "Anh ấy đã rất đau khổ khi vợ anh ấy qua đời."
                    }
                ]
            }
        ]
    },
    {
        "id": "70e10e81c5af421c840e552acd25a5d7",
        "word": "despair",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/dɪˈspeə(r)/",
            "us": "/dɪˈsper/"
        },
        "nearby": [
            {
                "word": "desolate",
                "pos": "verb"
            },
            {
                "word": "desolation",
                "pos": "noun"
            },
            {
                "word": "despair",
                "pos": "noun"
            },
            {
                "word": "despair",
                "pos": "verb"
            },
            {
                "word": "despairing",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the feeling of having lost all hope",
                    "vi": "cảm giác mất hết hy vọng"
                },
                "examples": [
                    {
                        "en": "She uttered a cry of despair.",
                        "vi": "Cô ấy thốt lên một tiếng tuyệt vọng."
                    },
                    {
                        "en": "A deep sense of despair overwhelmed him.",
                        "vi": "Cảm giác tuyệt vọng sâu sắc bao trùm lấy anh."
                    },
                    {
                        "en": "in despair He gave up the struggle in despair.",
                        "vi": "trong tuyệt vọng Anh đã từ bỏ cuộc đấu tranh trong tuyệt vọng."
                    },
                    {
                        "en": "One harsh word would send her into the depths of despair.",
                        "vi": "Một lời nói cay nghiệt sẽ khiến cô ấy rơi vào hố sâu của sự tuyệt vọng."
                    },
                    {
                        "en": "Eventually, driven to despair, he threw himself under a train.",
                        "vi": "Cuối cùng, bị đẩy đến tuyệt vọng, anh ta đã ném mình xuống dưới một chiếc xe lửa."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody worried or unhappy, because they cannot help",
                    "vi": "để làm cho ai đó lo lắng hoặc không vui, bởi vì họ không thể giúp"
                },
                "examples": [
                    {
                        "en": "My handwriting was the despair of my teachers.",
                        "vi": "Nét chữ của tôi là nỗi thất vọng của các giáo viên."
                    }
                ]
            },
            {
                "define": {
                    "en": "advice not to try to do something because it is too difficult",
                    "vi": "lời khuyên đừng cố gắng làm điều gì đó vì nó quá khó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "23e716e5e19e405c88180f5e73fb5391",
        "word": "despair",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/dɪˈspeə(r)/",
            "us": "/dɪˈsper/"
        },
        "nearby": [
            {
                "word": "desolation",
                "pos": "noun"
            },
            {
                "word": "despair",
                "pos": "noun"
            },
            {
                "word": "despair",
                "pos": "verb"
            },
            {
                "word": "despairing",
                "pos": "adjective"
            },
            {
                "word": "despairingly",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to stop having any hope that a situation will change or improve",
                    "vi": "ngừng hy vọng rằng một tình huống sẽ thay đổi hoặc cải thiện"
                },
                "examples": [
                    {
                        "en": "Don't despair! We'll think of a way out of this.",
                        "vi": "Đừng tuyệt vọng! Chúng tôi sẽ nghĩ cách thoát khỏi điều này."
                    },
                    {
                        "en": "despair of something/somebody I despair of him; he can't keep a job for more than six months.",
                        "vi": "tuyệt vọng về điều gì đó / ai đó mà tôi thất vọng về anh ta; anh ta không thể giữ một công việc trong hơn sáu tháng."
                    },
                    {
                        "en": "despair of doing something They'd almost despaired of ever having children.",
                        "vi": "tuyệt vọng khi làm điều gì đó Họ gần như tuyệt vọng về việc có con."
                    }
                ]
            }
        ]
    },
    {
        "id": "2ff8852dbb584076a350fcf9a9fe4b77",
        "word": "devastate",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈdevəsteɪt/",
            "us": "/ˈdevəsteɪt/"
        },
        "nearby": [
            {
                "word": "devalue",
                "pos": "verb"
            },
            {
                "word": "Devanagari",
                "pos": "noun"
            },
            {
                "word": "devastate",
                "pos": "verb"
            },
            {
                "word": "devastated",
                "pos": "adjective"
            },
            {
                "word": "devastating",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to completely destroy a place or an area",
                    "vi": "để phá hủy hoàn toàn một địa điểm hoặc một khu vực"
                },
                "examples": [
                    {
                        "en": "The bomb devastated much of the old part of the city.",
                        "vi": "Quả bom đã tàn phá phần lớn khu vực cũ của thành phố."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody feel very shocked and sad",
                    "vi": "làm cho ai đó cảm thấy rất sốc và buồn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "98b471e423644168a2d9fceda73359dc",
        "word": "discontent",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌdɪskənˈtent/",
            "us": "/ˌdɪskənˈtent/"
        },
        "nearby": [
            {
                "word": "disconsolate",
                "pos": "adjective"
            },
            {
                "word": "disconsolately",
                "pos": "adverb"
            },
            {
                "word": "discontent",
                "pos": "noun"
            },
            {
                "word": "discontented",
                "pos": "adjective"
            },
            {
                "word": "discontentedly",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a feeling of being unhappy because you are not satisfied with a particular situation; something that makes you have this feeling",
                    "vi": "cảm giác không vui vì bạn không hài lòng với một tình huống cụ thể; điều gì đó khiến bạn có cảm giác này"
                },
                "examples": [
                    {
                        "en": "There is widespread discontent among the staff at the proposed changes to pay and conditions.",
                        "vi": "Có sự bất bình rộng rãi trong các nhân viên về những thay đổi đề xuất trả lương và các điều kiện."
                    },
                    {
                        "en": "(formal) There are a wide variety of popular discontents which need discussing.",
                        "vi": "(chính thức) Có rất nhiều sự bất mãn phổ biến cần được thảo luận."
                    }
                ]
            }
        ]
    },
    {
        "id": "8da46cc0b4524157a622a1b0d2b821c8",
        "word": "discontented",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌdɪskənˈtentɪd/",
            "us": "/ˌdɪskənˈtentɪd/"
        },
        "nearby": [
            {
                "word": "disconsolately",
                "pos": "adverb"
            },
            {
                "word": "discontent",
                "pos": "noun"
            },
            {
                "word": "discontented",
                "pos": "adjective"
            },
            {
                "word": "discontentedly",
                "pos": "adverb"
            },
            {
                "word": "discontinue",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "unhappy because you are not satisfied with your situation",
                    "vi": "không vui vì bạn không hài lòng với hoàn cảnh của mình"
                },
                "examples": [
                    {
                        "en": "He felt discontented with the way his life had turned out.",
                        "vi": "Anh cảm thấy bất bình với cuộc sống của mình."
                    },
                    {
                        "en": "discontented party members",
                        "vi": "đảng viên bất mãn"
                    }
                ]
            }
        ]
    },
    {
        "id": "a724732e9706448aa22e2c6ae9733726",
        "word": "distress",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/dɪˈstres/",
            "us": "/dɪˈstres/"
        },
        "nearby": [
            {
                "word": "distractor",
                "pos": "noun"
            },
            {
                "word": "distraught",
                "pos": "adjective"
            },
            {
                "word": "distress",
                "pos": "noun"
            },
            {
                "word": "distress",
                "pos": "verb"
            },
            {
                "word": "distressed",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a feeling of great worry or unhappiness; great mental pain",
                    "vi": "cảm giác vô cùng lo lắng hoặc không vui; nỗi đau tinh thần lớn"
                },
                "examples": [
                    {
                        "en": "The newspaper article caused the actor considerable distress.",
                        "vi": "Bài báo trên báo đã khiến nam diễn viên xót xa đáng kể."
                    },
                    {
                        "en": "She sensed his deep emotional distress.",
                        "vi": "Cô cảm nhận được tình cảm sâu sắc của anh."
                    },
                    {
                        "en": "in distress She was obviously in distress after the attack.",
                        "vi": "gặp nạn Cô ấy rõ ràng đã gặp nạn sau cuộc tấn công."
                    }
                ]
            },
            {
                "define": {
                    "en": "severe problems caused by not having enough money, food, etc.",
                    "vi": "các vấn đề nghiêm trọng do không có đủ tiền, thức ăn, v.v."
                },
                "examples": [
                    {
                        "en": "economic/financial distress",
                        "vi": "khó khăn kinh tế / tài chính"
                    },
                    {
                        "en": "The charity aims to relieve poverty and distress caused by natural disasters.",
                        "vi": "Tổ chức từ thiện nhằm giảm bớt đói nghèo và khốn khó do thiên tai gây ra."
                    }
                ]
            },
            {
                "define": {
                    "en": "a situation in which a ship, plane, etc. is in danger or difficulty and needs help",
                    "vi": "một tình huống trong đó một con tàu, máy bay, v.v. đang gặp nguy hiểm hoặc khó khăn và cần được giúp đỡ"
                },
                "examples": [
                    {
                        "en": "a distress signal (= a message asking for help)",
                        "vi": "một tín hiệu cấp cứu (= một thông báo yêu cầu giúp đỡ)"
                    },
                    {
                        "en": "in distress It is a rule of the sea to help another boat in distress.",
                        "vi": "gặp nạn Đó là một quy luật của biển cả để giúp đỡ một con thuyền khác gặp nạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a state of physical pain and effort, especially difficulty in breathing",
                    "vi": "trạng thái đau đớn về thể chất và gắng sức, đặc biệt là khó thở"
                },
                "examples": [
                    {
                        "en": "The patient was suffering serious respiratory distress.",
                        "vi": "Bệnh nhân suy hô hấp nặng."
                    },
                    {
                        "en": "in distress The baby was clearly in distress.",
                        "vi": "gặp nạn Em bé rõ ràng đang gặp nạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a woman who needs help",
                    "vi": "một người phụ nữ cần giúp đỡ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a8531bed9d5942aaa495a95d2d9ab450",
        "word": "distress",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/dɪˈstres/",
            "us": "/dɪˈstres/"
        },
        "nearby": [
            {
                "word": "distraught",
                "pos": "adjective"
            },
            {
                "word": "distress",
                "pos": "noun"
            },
            {
                "word": "distress",
                "pos": "verb"
            },
            {
                "word": "distressed",
                "pos": "adjective"
            },
            {
                "word": "distressing",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to make somebody feel very worried or unhappy",
                    "vi": "làm cho ai đó cảm thấy rất lo lắng hoặc không vui"
                },
                "examples": [
                    {
                        "en": "distress somebody It was clear that the letter had deeply distressed her.",
                        "vi": "làm đau khổ ai đó Rõ ràng là bức thư đã làm cô ấy đau khổ vô cùng."
                    },
                    {
                        "en": "distress yourself Don't distress yourself (= don't worry).",
                        "vi": "làm khổ mình Đừng làm khổ mình (= đừng lo lắng)."
                    }
                ]
            }
        ]
    },
    {
        "id": "de5cec6a49554d20bc4cdbe692967969",
        "word": "distressed",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/dɪˈstrest/",
            "us": "/dɪˈstrest/"
        },
        "nearby": [
            {
                "word": "distress",
                "pos": "noun"
            },
            {
                "word": "distress",
                "pos": "verb"
            },
            {
                "word": "distressed",
                "pos": "adjective"
            },
            {
                "word": "distressing",
                "pos": "adjective"
            },
            {
                "word": "distressingly",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "very upset and anxious",
                    "vi": "rất khó chịu và lo lắng"
                },
                "examples": [
                    {
                        "en": "He was too distressed and confused to answer their questions.",
                        "vi": "Anh quá đau khổ và bối rối để trả lời câu hỏi của họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "suffering pain; in a poor physical condition",
                    "vi": "bị đau đớn; trong một tình trạng thể chất kém"
                },
                "examples": [
                    {
                        "en": "When the baby was born, it was blue and distressed.",
                        "vi": "Khi đứa bé chào đời, nó có màu xanh lam và xót xa."
                    }
                ]
            },
            {
                "define": {
                    "en": "made to look older and more worn than it really is",
                    "vi": "được làm để trông cũ hơn và mòn hơn so với thực tế"
                },
                "examples": [
                    {
                        "en": "a distressed leather jacket",
                        "vi": "một chiếc áo khoác da đau khổ"
                    }
                ]
            },
            {
                "define": {
                    "en": "having problems caused by lack of money",
                    "vi": "gặp vấn đề do thiếu tiền"
                },
                "examples": [
                    {
                        "en": "They buy up financially distressed companies.",
                        "vi": "Họ mua lại các công ty đang gặp khó khăn về tài chính."
                    },
                    {
                        "en": "The charity helps kids in distressed situations.",
                        "vi": "Tổ chức từ thiện giúp đỡ trẻ em có hoàn cảnh khó khăn."
                    },
                    {
                        "en": "a map showing economically distressed areas in the state",
                        "vi": "một bản đồ cho thấy các khu vực kinh tế khó khăn trong tiểu bang"
                    }
                ]
            }
        ]
    },
    {
        "id": "619aa4cc0ee2458c9a32e372845c925e",
        "word": "distressing",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/dɪˈstresɪŋ/",
            "us": "/dɪˈstresɪŋ/"
        },
        "nearby": [
            {
                "word": "distress",
                "pos": "verb"
            },
            {
                "word": "distressed",
                "pos": "adjective"
            },
            {
                "word": "distressing",
                "pos": "adjective"
            },
            {
                "word": "distressingly",
                "pos": "adverb"
            },
            {
                "word": "distribute",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "making you feel extremely upset, especially because somebody is suffering",
                    "vi": "khiến bạn cảm thấy vô cùng khó chịu, đặc biệt là vì ai đó đang đau khổ"
                },
                "examples": [
                    {
                        "en": "It was a very distressing documentary.",
                        "vi": "Đó là một bộ phim tài liệu rất đau buồn."
                    },
                    {
                        "en": "What could be more distressing than the death of their only child?",
                        "vi": "Còn gì đau buồn hơn cái chết của đứa con duy nhất của họ?"
                    },
                    {
                        "en": "The divorce was extremely distressing for the children.",
                        "vi": "Cuộc ly hôn khiến những đứa trẻ vô cùng đau khổ."
                    }
                ]
            }
        ]
    },
    {
        "id": "568b11c6c971418a9205c549ead38104",
        "word": "disturbed",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/dɪˈstɜːbd/",
            "us": "/dɪˈstɜːrbd/"
        },
        "nearby": [
            {
                "word": "disturb",
                "pos": "verb"
            },
            {
                "word": "disturbance",
                "pos": "noun"
            },
            {
                "word": "disturbed",
                "pos": "adjective"
            },
            {
                "word": "disturber",
                "pos": "noun"
            },
            {
                "word": "disturbing",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "mentally ill, especially because of very unhappy or unpleasant experiences",
                    "vi": "bị bệnh tâm thần, đặc biệt là vì những trải nghiệm rất bất hạnh hoặc khó chịu"
                },
                "examples": [
                    {
                        "en": "a special school for emotionally disturbed children",
                        "vi": "một trường học đặc biệt dành cho trẻ em bị rối loạn cảm xúc"
                    },
                    {
                        "en": "His behaviour is deeply disturbed.",
                        "vi": "Hành vi của anh ta đang bị xáo trộn sâu sắc."
                    }
                ]
            },
            {
                "define": {
                    "en": "unhappy and full of bad or horrible experiences",
                    "vi": "không vui và đầy những trải nghiệm tồi tệ hoặc khủng khiếp"
                },
                "examples": [
                    {
                        "en": "The killer had a disturbed family background.",
                        "vi": "Kẻ giết người có một nền tảng gia đình xáo trộn."
                    }
                ]
            },
            {
                "define": {
                    "en": "very anxious and unhappy about something",
                    "vi": "rất lo lắng và không hài lòng về điều gì đó"
                },
                "examples": [
                    {
                        "en": "I was deeply disturbed and depressed by the news.",
                        "vi": "Tôi vô cùng bối rối và chán nản khi nghe tin này."
                    },
                    {
                        "en": "I felt vaguely disturbed by the incident.",
                        "vi": "Tôi cảm thấy mơ hồ bị xáo trộn bởi sự việc."
                    }
                ]
            }
        ]
    },
    {
        "id": "28f8b0f30d2c4a3c8a0772312ddabbd1",
        "word": "envy",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈenvi/",
            "us": "/ˈenvi/"
        },
        "nearby": [
            {
                "word": "envoi",
                "pos": "noun"
            },
            {
                "word": "envoy",
                "pos": "noun"
            },
            {
                "word": "envy",
                "pos": "noun"
            },
            {
                "word": "envy",
                "pos": "verb"
            },
            {
                "word": "enzyme",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the feeling of wanting to be in the same situation as somebody else; the feeling of wanting something that somebody else has",
                    "vi": "cảm giác muốn ở trong hoàn cảnh giống như ai đó khác; cảm giác muốn một cái gì đó mà người khác có"
                },
                "examples": [
                    {
                        "en": "envy (of somebody) He couldn't conceal his envy of me.",
                        "vi": "ghen tị (của ai đó) Anh ấy không thể che giấu sự ghen tị của mình với tôi."
                    },
                    {
                        "en": "envy (at/of something) She felt a pang of envy at the thought of his success.",
                        "vi": "ghen tị (tại / của một cái gì đó) Cô cảm thấy ghen tị khi nghĩ đến thành công của anh ta."
                    },
                    {
                        "en": "They looked with envy at her latest purchase.",
                        "vi": "Họ nhìn với vẻ ghen tị với lần mua mới nhất của cô ấy."
                    },
                    {
                        "en": "Her colleagues were green with envy (= they had very strong feelings of envy).",
                        "vi": "Các đồng nghiệp của cô ấy đã xanh mặt vì ghen tị (= họ có cảm giác ghen tị rất mạnh)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be a person or thing that other people admire and that causes feelings of envy",
                    "vi": "trở thành một người hoặc một thứ mà người khác ngưỡng mộ và gây ra cảm giác ghen tị"
                },
                "examples": [
                    {
                        "en": "British television is the envy of the world.",
                        "vi": "Truyền hình Anh là niềm ghen tị của thế giới."
                    }
                ]
            }
        ]
    },
    {
        "id": "4564effb749d44f19eacf1999a034d1a",
        "word": "envy",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈenvi/",
            "us": "/ˈenvi/"
        },
        "nearby": [
            {
                "word": "envoy",
                "pos": "noun"
            },
            {
                "word": "envy",
                "pos": "noun"
            },
            {
                "word": "envy",
                "pos": "verb"
            },
            {
                "word": "enzyme",
                "pos": "noun"
            },
            {
                "word": "eolian",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to wish you had the same qualities, possessions, opportunities, etc. as somebody else",
                    "vi": "ước gì bạn có những phẩm chất, tài sản, cơ hội, v.v. như người khác"
                },
                "examples": [
                    {
                        "en": "envy somebody He envied her—she seemed to have everything she could possibly want.",
                        "vi": "ghen tị với ai đó Anh ấy ghen tị với cô ấy — cô ấy dường như có mọi thứ mà cô ấy có thể muốn."
                    },
                    {
                        "en": "envy something She has always envied my success.",
                        "vi": "ghen tị với điều gì đó Cô ấy đã luôn ghen tị với thành công của tôi."
                    },
                    {
                        "en": "envy somebody (for) something I envied him his good looks.",
                        "vi": "ghen tị với ai đó (vì) một cái gì đó Tôi ghen tị với anh ta vẻ ngoài đẹp trai của anh ta."
                    },
                    {
                        "en": "I secretly envied her for her good looks.",
                        "vi": "Tôi thầm ghen tị với cô ấy vì ngoại hình đẹp của cô ấy."
                    },
                    {
                        "en": "envy somebody doing something I envy you having such a close family.",
                        "vi": "ghen tị với ai đó làm điều gì đó Tôi ghen tị với bạn có một gia đình thân thiết như vậy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be glad that you do not have to do what somebody else has to do",
                    "vi": "vui vì bạn không phải làm những gì người khác phải làm"
                },
                "examples": [
                    {
                        "en": "not envy somebody It's a difficult situation you're in. I don't envy you.",
                        "vi": "không ghen tị với ai đó Đó là một tình huống khó khăn mà bạn đang gặp phải. Tôi không ghen tị với bạn."
                    },
                    {
                        "en": "not envy somebody something I don't envy her that job.",
                        "vi": "không ghen tị với ai đó một cái gì đó Tôi không ghen tị với cô ấy công việc."
                    }
                ]
            }
        ]
    },
    {
        "id": "5bd630b7952f4083950a459ea9fb1d26",
        "word": "gloom",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ɡluːm/",
            "us": "/ɡluːm/"
        },
        "nearby": [
            {
                "word": "glom",
                "pos": "verb"
            },
            {
                "word": "glom onto",
                "pos": "phrasal verb"
            },
            {
                "word": "gloom",
                "pos": "noun"
            },
            {
                "word": "gloomily",
                "pos": "adverb"
            },
            {
                "word": "gloominess",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a feeling of being sad and without hope",
                    "vi": "một cảm giác buồn và không có hy vọng"
                },
                "examples": [
                    {
                        "en": "The gloom deepened as the election results came in.",
                        "vi": "Sự u ám càng sâu sắc khi kết quả bầu cử đến."
                    },
                    {
                        "en": "He remained sunk in gloom for several days.",
                        "vi": "Anh vẫn chìm trong u ám trong nhiều ngày."
                    },
                    {
                        "en": "An air of gloom and despondency settled over the household.",
                        "vi": "Một bầu không khí u ám và tuyệt vọng bao trùm khắp gia đình."
                    }
                ]
            },
            {
                "define": {
                    "en": "almost total darkness",
                    "vi": "gần như hoàn toàn bóng tối"
                },
                "examples": [
                    {
                        "en": "We watched the boats come back in the gathering gloom.",
                        "vi": "Chúng tôi nhìn những con thuyền trở về trong sự ảm đạm của buổi tụ họp."
                    },
                    {
                        "en": "Caroline peered into the gloom of the hallway.",
                        "vi": "Caroline nhìn chăm chú vào bóng tối của hành lang."
                    }
                ]
            },
            {
                "define": {
                    "en": "a general feeling of having lost all hope, and of pessimism (= expecting things to go badly)",
                    "vi": "cảm giác chung về việc mất hết hy vọng và bi quan (= mong đợi mọi thứ trở nên tồi tệ)"
                },
                "examples": [
                    {
                        "en": "Despite the obvious setbacks, it is not all doom and gloom for the England team.",
                        "vi": "Bất chấp những thất bại rõ ràng, đó không phải là tất cả những gì ảm đạm và ảm đạm cho đội tuyển Anh."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make an unpleasant situation worse",
                    "vi": "để làm cho một tình huống khó chịu trở nên tồi tệ hơn"
                },
                "examples": [
                    {
                        "en": "Bosses piled on the agony with threats of more job losses.",
                        "vi": "Các ông chủ chồng chất lên cơn đau đớn với những lời đe dọa mất việc nhiều hơn."
                    }
                ]
            }
        ]
    },
    {
        "id": "4c0cb1808c95486da801f4c1be59c62e",
        "word": "gloomy",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈɡluːmi/",
            "us": "/ˈɡluːmi/"
        },
        "nearby": [
            {
                "word": "gloomily",
                "pos": "adverb"
            },
            {
                "word": "gloominess",
                "pos": "noun"
            },
            {
                "word": "gloomy",
                "pos": "adjective"
            },
            {
                "word": "gloop",
                "pos": "noun"
            },
            {
                "word": "gloopy",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "nearly dark, or badly lit in a way that makes you feel sad",
                    "vi": "gần như tối, hoặc ánh sáng kém theo cách khiến bạn cảm thấy buồn"
                },
                "examples": [
                    {
                        "en": "a gloomy room/atmosphere",
                        "vi": "một căn phòng / bầu không khí u ám"
                    },
                    {
                        "en": "It was a wet and gloomy day.",
                        "vi": "Đó là một ngày ẩm ướt và u ám."
                    }
                ]
            },
            {
                "define": {
                    "en": "sad and without hope",
                    "vi": "buồn và không có hy vọng"
                },
                "examples": [
                    {
                        "en": "a gloomy expression",
                        "vi": "một biểu hiện u ám"
                    },
                    {
                        "en": "We sat in gloomy silence.",
                        "vi": "Chúng tôi ngồi trong im lặng ảm đạm."
                    }
                ]
            },
            {
                "define": {
                    "en": "without much hope of success or happiness in the future",
                    "vi": "không có nhiều hy vọng thành công hoặc hạnh phúc trong tương lai"
                },
                "examples": [
                    {
                        "en": "a gloomy picture of the country’s economic future",
                        "vi": "một bức tranh ảm đạm về tương lai kinh tế đất nước"
                    },
                    {
                        "en": "Suddenly, the future didn't look so gloomy after all.",
                        "vi": "Đột nhiên, tương lai rốt cuộc có vẻ không u ám như vậy."
                    }
                ]
            }
        ]
    },
    {
        "id": "0db74aed38f14dcc8d448dd8e5ec6e51",
        "word": "heartbroken",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈhɑːtbrəʊkən/",
            "us": "/ˈhɑːrtbrəʊkən/"
        },
        "nearby": [
            {
                "word": "heartbreak",
                "pos": "noun"
            },
            {
                "word": "heartbreaking",
                "pos": "adjective"
            },
            {
                "word": "heartbroken",
                "pos": "adjective"
            },
            {
                "word": "heartburn",
                "pos": "noun"
            },
            {
                "word": "hearten",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "extremely sad because of something that has happened",
                    "vi": "vô cùng buồn vì một điều gì đó đã xảy ra"
                },
                "examples": [
                    {
                        "en": "He was heartbroken when she left him.",
                        "vi": "Anh rất đau lòng khi cô rời xa anh."
                    },
                    {
                        "en": "Friends are tonight trying to comfort the heartbroken teenager.",
                        "vi": "Bạn bè đêm nay đang cố gắng an ủi cậu thiếu niên đau lòng."
                    }
                ]
            }
        ]
    },
    {
        "id": "69f99847d97c47cb921fccdfbaa6c101",
        "word": "homesickness",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈhəʊmsɪknəs/",
            "us": "/ˈhəʊmsɪknəs/"
        },
        "nearby": [
            {
                "word": "home shopping",
                "pos": "noun"
            },
            {
                "word": "homesick",
                "pos": "adjective"
            },
            {
                "word": "homesickness",
                "pos": "noun"
            },
            {
                "word": "homespun",
                "pos": "adjective"
            },
            {
                "word": "homestay",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the feeling of being sad because you are away from home and you miss your family and friends",
                    "vi": "cảm giác buồn vì xa nhà và nhớ gia đình, bạn bè"
                },
                "examples": [
                    {
                        "en": "She soon got over her homesickness.",
                        "vi": "Cô ấy nhanh chóng vượt qua nỗi nhớ nhà của mình."
                    },
                    {
                        "en": "A great wave of homesickness swept over me.",
                        "vi": "Một cơn sóng nhớ nhà tràn ngập trong tôi."
                    }
                ]
            }
        ]
    },
    {
        "id": "8db8e576418b4ff0b0d56dbbf2210c16",
        "word": "loveless",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈlʌvləs/",
            "us": "/ˈlʌvləs/"
        },
        "nearby": [
            {
                "word": "love interest",
                "pos": "noun"
            },
            {
                "word": "Richard Lovelace",
                "pos": ""
            },
            {
                "word": "loveless",
                "pos": "adjective"
            },
            {
                "word": "love letter",
                "pos": "noun"
            },
            {
                "word": "love life",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "without love",
                    "vi": "không có tình yêu"
                },
                "examples": [
                    {
                        "en": "a loveless marriage",
                        "vi": "một cuộc hôn nhân không tình yêu"
                    }
                ]
            }
        ]
    },
    {
        "id": "5c919766f1fa4761a12d2e90e8ed0422",
        "word": "misery",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈmɪzəri/",
            "us": "/ˈmɪzəri/"
        },
        "nearby": [
            {
                "word": "miserably",
                "pos": "adverb"
            },
            {
                "word": "miserly",
                "pos": "adjective"
            },
            {
                "word": "misery",
                "pos": "noun"
            },
            {
                "word": "misery memoir",
                "pos": "noun"
            },
            {
                "word": "misfile",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "great physical or mental pain",
                    "vi": "nỗi đau lớn về thể xác hoặc tinh thần"
                },
                "examples": [
                    {
                        "en": "Fame brought her nothing but misery.",
                        "vi": "Sự nổi tiếng chẳng mang lại gì cho cô ấy ngoài sự khốn khổ."
                    }
                ]
            },
            {
                "define": {
                    "en": "very poor living conditions",
                    "vi": "điều kiện sống rất kém"
                },
                "examples": [
                    {
                        "en": "The vast majority of the population lives in utter misery.",
                        "vi": "Đại đa số dân chúng sống trong cảnh khốn cùng."
                    }
                ]
            },
            {
                "define": {
                    "en": "something that causes great physical or mental pain",
                    "vi": "thứ gì đó gây ra nỗi đau lớn về thể chất hoặc tinh thần"
                },
                "examples": [
                    {
                        "en": "the miseries of unemployment",
                        "vi": "nỗi khổ của thất nghiệp"
                    },
                    {
                        "en": "the sheer misery of homelessness",
                        "vi": "nỗi thống khổ tuyệt đối của tình trạng vô gia cư"
                    },
                    {
                        "en": "the country's economic misery",
                        "vi": "kinh tế đất nước khốn khổ"
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who is always unhappy and complaining",
                    "vi": "một người luôn không hài lòng và phàn nàn"
                },
                "examples": [
                    {
                        "en": "Don't be such an old misery!",
                        "vi": "Đừng làm khổ người già như vậy!"
                    },
                    {
                        "en": "Old misery guts here doesn’t want to go out.",
                        "vi": "Khổ già đến đây ruột gan không muốn ra ngoài."
                    }
                ]
            },
            {
                "define": {
                    "en": "to behave in a way that makes somebody else feel very unhappy",
                    "vi": "cư xử theo cách khiến người khác cảm thấy rất không vui"
                },
                "examples": [
                    {
                        "en": "My old boss used to make my life a misery.",
                        "vi": "Ông chủ cũ của tôi từng khiến cuộc đời tôi khốn đốn."
                    },
                    {
                        "en": "His constant criticism made her life a misery.",
                        "vi": "Những lời chỉ trích liên tục của anh khiến cuộc sống của cô trở nên khốn khổ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to kill a creature because it has an illness or injury that cannot be treated",
                    "vi": "giết một sinh vật vì nó bị bệnh hoặc bị thương không thể chữa trị"
                },
                "examples": [
                    {
                        "en": "In the end we asked the vet to put the poor creature out of its misery.",
                        "vi": "Cuối cùng, chúng tôi yêu cầu bác sĩ thú y đưa sinh vật tội nghiệp ra khỏi tình trạng khốn khổ của nó."
                    }
                ]
            },
            {
                "define": {
                    "en": "to stop somebody worrying by telling them something that they are anxious to know",
                    "vi": "để ngăn ai đó lo lắng bằng cách nói với họ điều gì đó mà họ lo lắng được biết"
                },
                "examples": [
                    {
                        "en": "Put me out of my misery—did I pass or didn't I?",
                        "vi": "Đưa tôi ra khỏi tình trạng khốn khổ của tôi — tôi đã vượt qua hay chưa?"
                    },
                    {
                        "en": "Oh, put her out of her misery—tell her who won.",
                        "vi": "Ôi, hãy đưa cô ấy ra khỏi sự khốn khổ của cô ấy — hãy nói cho cô ấy biết ai đã thắng."
                    }
                ]
            }
        ]
    },
    {
        "id": "a68144adeb424a329887fd79e97fe394",
        "word": "pity",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈpɪti/",
            "us": "/ˈpɪti/"
        },
        "nearby": [
            {
                "word": "pituitary",
                "pos": "noun"
            },
            {
                "word": "pit viper",
                "pos": "noun"
            },
            {
                "word": "pity",
                "pos": "noun"
            },
            {
                "word": "pity",
                "pos": "verb"
            },
            {
                "word": "pitying",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "used to show that you are disappointed about something",
                    "vi": "được sử dụng để cho thấy rằng bạn thất vọng về điều gì đó"
                },
                "examples": [
                    {
                        "en": "a pity (that…) It's a pity that you can't stay longer.",
                        "vi": "một điều đáng tiếc (điều đó…) Thật tiếc khi bạn không thể ở lại lâu hơn."
                    },
                    {
                        "en": "‘I've lost it!’ ‘Oh, what a pity.’",
                        "vi": "Tôi đã mất nó!' 'Ồ, thật đáng tiếc.'"
                    },
                    {
                        "en": "What a pity that she didn't tell me earlier.",
                        "vi": "Thật tiếc khi cô ấy không nói với tôi sớm hơn."
                    },
                    {
                        "en": "This dress is really nice. Pity it's so expensive.",
                        "vi": "Chiếc váy này thực sự rất đẹp. Thật đáng tiếc vì nó quá đắt."
                    },
                    {
                        "en": "Oh, that's a pity.",
                        "vi": "Oh đó là một điều đáng tiếc."
                    },
                    {
                        "en": "It would be a great pity if you gave up now.",
                        "vi": "Sẽ là một điều đáng tiếc lớn nếu bạn từ bỏ ngay bây giờ."
                    },
                    {
                        "en": "a pity to do something It seems a pity to waste this food.",
                        "vi": "rất tiếc khi làm điều gì đó Có vẻ như rất tiếc khi lãng phí thực phẩm này."
                    }
                ]
            },
            {
                "define": {
                    "en": "a sad feeling caused by the pain and troubles of others",
                    "vi": "một cảm giác buồn do nỗi đau và rắc rối của người khác gây ra"
                },
                "examples": [
                    {
                        "en": "I took pity on her and lent her the money.",
                        "vi": "Tôi thương hại cô ấy và cho cô ấy vay tiền."
                    },
                    {
                        "en": "(formal) I beg you to have pity on him.",
                        "vi": "(chính thức) Tôi cầu xin bạn hãy thương hại anh ấy."
                    },
                    {
                        "en": "I don't want your pity.",
                        "vi": "Tôi không muốn sự thương hại của bạn."
                    },
                    {
                        "en": "a look/feeling/surge of pity",
                        "vi": "một cái nhìn / cảm giác / sự thương hại dâng trào"
                    },
                    {
                        "en": "pity for somebody/something I could only feel pity for what they were enduring.",
                        "vi": "thương hại cho ai đó / điều gì đó tôi chỉ có thể cảm thấy thương hại cho những gì họ đã phải chịu đựng."
                    },
                    {
                        "en": "He had no pity for her.",
                        "vi": "Anh không hề thương hại cô."
                    }
                ]
            },
            {
                "define": {
                    "en": "unfortunately",
                    "vi": "không may"
                },
                "examples": [
                    {
                        "en": "‘Was the bicycle insured?’ ‘No, more's the pity!’",
                        "vi": "Xe đạp có được bảo hiểm không?' 'Không, đáng tiếc hơn!'"
                    }
                ]
            }
        ]
    },
    {
        "id": "c552435696e446f2939cd2b8b57945bc",
        "word": "sorrow",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈsɒrəʊ/",
            "us": "/ˈsɑːrəʊ/"
        },
        "nearby": [
            {
                "word": "sorority",
                "pos": "noun"
            },
            {
                "word": "sorrel",
                "pos": "noun"
            },
            {
                "word": "sorrow",
                "pos": "noun"
            },
            {
                "word": "sorrow",
                "pos": "verb"
            },
            {
                "word": "sorrowful",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a feeling of being very sad because something very bad has happened",
                    "vi": "một cảm giác rất buồn vì một điều gì đó rất tồi tệ đã xảy ra"
                },
                "examples": [
                    {
                        "en": "He expressed his sorrow at the news of her death.",
                        "vi": "Anh bày tỏ sự đau buồn trước tin cô qua đời."
                    },
                    {
                        "en": "They said that the decision was made more in sorrow than in anger.",
                        "vi": "Họ nói rằng quyết định này được đưa ra vì đau buồn hơn là tức giận."
                    }
                ]
            },
            {
                "define": {
                    "en": "a very sad event or situation",
                    "vi": "một sự kiện hoặc tình huống rất buồn"
                },
                "examples": [
                    {
                        "en": "the joys and sorrows of childhood",
                        "vi": "những niềm vui và nỗi buồn của tuổi thơ"
                    },
                    {
                        "en": "His death was a great sorrow to everyone who knew him.",
                        "vi": "Cái chết của ông là một nỗi buồn lớn đối với tất cả những người biết ông."
                    }
                ]
            }
        ]
    },
    {
        "id": "9daa837c6f344db995feb88f340c5bde",
        "word": "torture",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈtɔːtʃə(r)/",
            "us": "/ˈtɔːrtʃər/"
        },
        "nearby": [
            {
                "word": "tortuous",
                "pos": "adjective"
            },
            {
                "word": "tortuously",
                "pos": "adverb"
            },
            {
                "word": "torture",
                "pos": "noun"
            },
            {
                "word": "torture",
                "pos": "verb"
            },
            {
                "word": "tortured",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act of causing somebody severe pain in order to punish them or make them say or do something",
                    "vi": "hành động gây ra cho ai đó nỗi đau nghiêm trọng để trừng phạt họ hoặc khiến họ nói hoặc làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "Many of the refugees have suffered torture.",
                        "vi": "Nhiều người trong số những người tị nạn đã bị tra tấn."
                    },
                    {
                        "en": "the use of torture",
                        "vi": "sử dụng tra tấn"
                    },
                    {
                        "en": "terrible instruments of torture",
                        "vi": "dụng cụ tra tấn khủng khiếp"
                    },
                    {
                        "en": "under torture His confessions were made under torture.",
                        "vi": "bị tra tấn Những lời thú tội của ông đã bị tra tấn."
                    },
                    {
                        "en": "I heard stories of gruesome tortures in prisons.",
                        "vi": "Tôi đã nghe những câu chuyện về những cuộc tra tấn khủng khiếp trong nhà tù."
                    }
                ]
            },
            {
                "define": {
                    "en": "mental or physical pain; something that causes this",
                    "vi": "nỗi đau tinh thần hoặc thể xác; một cái gì đó gây ra điều này"
                },
                "examples": [
                    {
                        "en": "The interview was sheer torture from start to finish.",
                        "vi": "Cuộc phỏng vấn là cực hình từ đầu đến cuối."
                    }
                ]
            }
        ]
    },
    {
        "id": "4bf5ffbdda8846a78f23e8dcd4a7ba02",
        "word": "torture",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈtɔːtʃə(r)/",
            "us": "/ˈtɔːrtʃər/"
        },
        "nearby": [
            {
                "word": "tortuously",
                "pos": "adverb"
            },
            {
                "word": "torture",
                "pos": "noun"
            },
            {
                "word": "torture",
                "pos": "verb"
            },
            {
                "word": "tortured",
                "pos": "adjective"
            },
            {
                "word": "torturer",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to hurt somebody physically or mentally in order to punish them or make them tell you something",
                    "vi": "làm tổn thương ai đó về thể chất hoặc tinh thần để trừng phạt họ hoặc khiến họ nói với bạn điều gì đó"
                },
                "examples": [
                    {
                        "en": "torture somebody Many of the rebels were captured and tortured by secret police.",
                        "vi": "tra tấn ai đó Nhiều người trong số những người nổi dậy đã bị cảnh sát mật bắt và tra tấn."
                    },
                    {
                        "en": "The prisoners were routinely tortured.",
                        "vi": "Các tù nhân bị tra tấn thường xuyên."
                    },
                    {
                        "en": "torture somebody into doing something He was tortured into giving them the information.",
                        "vi": "tra tấn ai đó làm điều gì đó. Anh ta bị tra tấn khi cung cấp thông tin cho họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody feel extremely unhappy or anxious",
                    "vi": "làm cho ai đó cảm thấy cực kỳ không vui hoặc lo lắng"
                },
                "examples": [
                    {
                        "en": "He spent his life tortured by the memories of his childhood.",
                        "vi": "Anh đã trải qua cuộc đời mình bị tra tấn bởi những ký ức thời thơ ấu của mình."
                    }
                ]
            }
        ]
    },
    {
        "id": "98653b4cf72e47e18736c08c475151ab",
        "word": "uneasy",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ʌnˈiːzi/",
            "us": "/ʌnˈiːzi/"
        },
        "nearby": [
            {
                "word": "unease",
                "pos": "noun"
            },
            {
                "word": "uneasily",
                "pos": "adverb"
            },
            {
                "word": "uneasy",
                "pos": "adjective"
            },
            {
                "word": "uneatable",
                "pos": "adjective"
            },
            {
                "word": "uneaten",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "feeling worried or unhappy about a particular situation, especially because you think that something bad or unpleasant may happen or because you are not sure that what you are doing is right",
                    "vi": "cảm thấy lo lắng hoặc không vui về một tình huống cụ thể, đặc biệt là vì bạn nghĩ rằng điều gì đó tồi tệ hoặc khó chịu có thể xảy ra hoặc vì bạn không chắc chắn rằng những gì bạn đang làm là đúng"
                },
                "examples": [
                    {
                        "en": "an uneasy laugh",
                        "vi": "một tiếng cười khó chịu"
                    },
                    {
                        "en": "His presence made her feel uneasy.",
                        "vi": "Sự hiện diện của anh khiến cô cảm thấy bất an."
                    },
                    {
                        "en": "She had an uneasy feeling that something terrible was going to happen.",
                        "vi": "Cô có cảm giác bất an rằng một điều gì đó khủng khiếp sắp xảy ra."
                    },
                    {
                        "en": "uneasy about something He was beginning to feel distinctly uneasy about their visit.",
                        "vi": "không thoải mái về điều gì đó Anh bắt đầu cảm thấy bất an rõ rệt về chuyến thăm của họ."
                    },
                    {
                        "en": "uneasy about doing something She felt uneasy about leaving the children with them.",
                        "vi": "không thoải mái khi làm điều gì đó Cô cảm thấy không thoải mái khi để lại bọn trẻ với chúng."
                    }
                ]
            },
            {
                "define": {
                    "en": "not certain to last; not safe or settled",
                    "vi": "không nhất định kéo dài; không an toàn hoặc ổn định"
                },
                "examples": [
                    {
                        "en": "an uneasy peace",
                        "vi": "một sự bình yên không dễ dàng"
                    },
                    {
                        "en": "The two sides eventually reached an uneasy compromise.",
                        "vi": "Cuối cùng hai bên đã đạt được một thỏa hiệp không dễ dàng."
                    }
                ]
            },
            {
                "define": {
                    "en": "that does not enable you to relax or feel comfortable",
                    "vi": "điều đó không cho phép bạn thư giãn hoặc cảm thấy thoải mái"
                },
                "examples": [
                    {
                        "en": "She woke from an uneasy sleep to find the house empty.",
                        "vi": "Cô tỉnh dậy sau một giấc ngủ không yên và thấy căn nhà trống rỗng."
                    },
                    {
                        "en": "They passed an uneasy night waiting for news from the hospital.",
                        "vi": "Họ đã vượt qua một đêm không yên để chờ đợi tin tức từ bệnh viện."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to describe a mixture of two things, feelings, etc. that do not go well together",
                    "vi": "được sử dụng để mô tả sự kết hợp của hai điều, cảm giác, v.v. không đi đôi với nhau"
                },
                "examples": [
                    {
                        "en": "an uneasy mix of humour and violence",
                        "vi": "một sự pha trộn khó chịu giữa hài hước và bạo lực"
                    },
                    {
                        "en": "Old farmhouses and new villas stood together in uneasy proximity.",
                        "vi": "Trang trại cũ và biệt thự mới đứng gần nhau không dễ chịu."
                    }
                ]
            }
        ]
    },
    {
        "id": "c64df9daa8c9421798c0b093c06bc564",
        "word": "weep",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/wiːp/",
            "us": "/wiːp/"
        },
        "nearby": [
            {
                "word": "weenie",
                "pos": "noun"
            },
            {
                "word": "weeny",
                "pos": "adjective"
            },
            {
                "word": "weep",
                "pos": "verb"
            },
            {
                "word": "weep",
                "pos": "noun"
            },
            {
                "word": "weeping",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to cry, usually because you are sad",
                    "vi": "khóc, thường là vì bạn buồn"
                },
                "examples": [
                    {
                        "en": "She started to weep uncontrollably.",
                        "vi": "Cô ấy bắt đầu khóc không kiểm soát được."
                    },
                    {
                        "en": "I could have wept (= I was sad enough to cry) thinking about what I'd missed.",
                        "vi": "Tôi có thể đã khóc (= Tôi đã buồn đến mức khóc) khi nghĩ về những gì tôi đã bỏ lỡ."
                    },
                    {
                        "en": "weep for/with something He wept for joy.",
                        "vi": "khóc vì / với điều gì đó Anh ta khóc vì vui mừng."
                    },
                    {
                        "en": "weep at/over something I do not weep over his death.",
                        "vi": "khóc vì / vì điều gì đó Tôi không khóc về cái chết của anh ấy."
                    },
                    {
                        "en": "weep something She wept bitter tears of disappointment.",
                        "vi": "khóc một cái gì đó Cô ấy khóc những giọt nước mắt cay đắng vì thất vọng."
                    },
                    {
                        "en": "weep to do something I wept to see him looking so sick.",
                        "vi": "khóc để làm điều gì đó Tôi khóc khi thấy anh ấy trông thật ốm yếu."
                    },
                    {
                        "en": "+ speech ‘I'm so unhappy!’ she wept.",
                        "vi": "Err:509"
                    }
                ]
            },
            {
                "define": {
                    "en": "to produce liquid",
                    "vi": "để sản xuất chất lỏng"
                },
                "examples": [
                    {
                        "en": "His legs were covered with weeping sores (= sores which had not healed).",
                        "vi": "Chân anh ta đầy vết loét (= vết loét chưa lành)."
                    },
                    {
                        "en": "His legs were covered with weeping sores (= that had not healed).",
                        "vi": "Chân anh ta đầy vết loét (= chưa lành)."
                    }
                ]
            }
        ]
    },
    {
        "id": "4952d8fd1d6748e5a9ff8a0f4f49b10a",
        "word": "blue",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/bluː/",
            "us": "/bluː/"
        },
        "nearby": [
            {
                "word": "bludgeon",
                "pos": "verb"
            },
            {
                "word": "bludger",
                "pos": "noun"
            },
            {
                "word": "blue",
                "pos": "adjective"
            },
            {
                "word": "blue",
                "pos": "noun"
            },
            {
                "word": "blue baby",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "having the colour of a clear sky or the sea on a clear day",
                    "vi": "có màu của bầu trời trong xanh hoặc biển vào một ngày quang đãng"
                },
                "examples": [
                    {
                        "en": "piercing blue eyes",
                        "vi": "xuyên mắt xanh"
                    },
                    {
                        "en": "The sun shone brilliantly in the clear blue sky.",
                        "vi": "Mặt trời tỏa sáng rực rỡ trên bầu trời trong xanh."
                    },
                    {
                        "en": "His eyes were dark blue.",
                        "vi": "Đôi mắt anh ta có màu xanh lam đậm."
                    },
                    {
                        "en": "She wanted to dye her hair blue.",
                        "vi": "Cô muốn nhuộm tóc màu xanh lam."
                    },
                    {
                        "en": "a blue shirt",
                        "vi": "cái áo màu xanh"
                    },
                    {
                        "en": "a navy blue jumper",
                        "vi": "một chiếc áo liền quần màu xanh nước biển"
                    },
                    {
                        "en": "her vivid blue eyes",
                        "vi": "đôi mắt xanh sống động của cô ấy"
                    }
                ]
            },
            {
                "define": {
                    "en": "looking slightly blue in colour because the person is cold or cannot breathe easily",
                    "vi": "màu hơi xanh lam vì người đó bị lạnh hoặc không thể thở dễ dàng"
                },
                "examples": [
                    {
                        "en": "His lips were turning blue.",
                        "vi": "Môi anh đã chuyển sang màu xanh."
                    },
                    {
                        "en": "blue with something Her hands were blue with cold.",
                        "vi": "xanh da trời với thứ gì đó Đôi tay cô ấy xanh ngắt vì lạnh."
                    }
                ]
            },
            {
                "define": {
                    "en": "sad",
                    "vi": "buồn"
                },
                "examples": [
                    {
                        "en": "He'd been feeling blue all week.",
                        "vi": "Anh ấy đã cảm thấy xanh cả tuần."
                    }
                ]
            },
            {
                "define": {
                    "en": "films, jokes or stories that are blue are about sex",
                    "vi": "phim, truyện cười hay lầu xanh nói về tình dục"
                },
                "examples": [
                    {
                        "en": "a blue movie",
                        "vi": "phim lam tinh"
                    }
                ]
            },
            {
                "define": {
                    "en": "(of an area in the US) having more people who vote for the Democratic candidate than the Republican one",
                    "vi": "(của một khu vực ở Hoa Kỳ) có nhiều người bỏ phiếu cho ứng cử viên Đảng Dân chủ hơn ứng cử viên Đảng Cộng hòa"
                },
                "examples": [
                    {
                        "en": "blue states/counties",
                        "vi": "tiểu bang / quận màu xanh lam"
                    }
                ]
            },
            {
                "define": {
                    "en": "in a difficult situation where there are two equally unpleasant or unacceptable choices",
                    "vi": "trong một tình huống khó khăn mà có hai sự lựa chọn khó chịu hoặc không thể chấp nhận được như nhau"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "(to hit somebody until they are) covered with bruises (= blue, brown or purple marks on the body)",
                    "vi": "(đánh ai đó cho đến khi họ bị thương) đầy vết bầm tím (= vết xanh, nâu hoặc tím trên cơ thể)"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a complete difference or division between two people or groups",
                    "vi": "sự khác biệt hoàn toàn hoặc sự phân chia giữa hai người hoặc nhóm"
                },
                "examples": [
                    {
                        "en": "Voters want to see clear blue water between the main parties.",
                        "vi": "Các cử tri muốn nhìn thấy làn nước trong xanh giữa các đảng chính."
                    },
                    {
                        "en": "They failed to put clear blue water between themselves and their competitors.",
                        "vi": "Họ đã thất bại trong việc đặt làn nước trong xanh giữa mình và các đối thủ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to try to do something as hard and as long as you possibly can but without success",
                    "vi": "cố gắng làm điều gì đó khó và miễn là bạn có thể nhưng không thành công"
                },
                "examples": [
                    {
                        "en": "You can argue till you're blue in the face, but you won't change my mind.",
                        "vi": "Bạn có thể tranh luận cho đến khi bạn xanh mặt, nhưng bạn sẽ không thay đổi ý kiến của tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "very rarely",
                    "vi": "rất hiếm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to scream loudly and for a long time, especially in order to protest about something",
                    "vi": "hét to và trong một thời gian dài, đặc biệt là để phản đối điều gì đó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "9879f7f5615545fdaf77022385174369",
        "word": "broody",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbruːdi/",
            "us": "/ˈbruːdi/"
        },
        "nearby": [
            {
                "word": "brooding",
                "pos": "adjective"
            },
            {
                "word": "brood mare",
                "pos": "noun"
            },
            {
                "word": "broody",
                "pos": "adjective"
            },
            {
                "word": "brook",
                "pos": "noun"
            },
            {
                "word": "brook",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "wanting very much to have a baby",
                    "vi": "rất muốn có con"
                },
                "examples": [
                    {
                        "en": "I reached the age of 27 and suddenly started to feel broody.",
                        "vi": "Tôi bước qua tuổi 27 và đột nhiên bắt đầu cảm thấy buồn tẻ."
                    }
                ]
            },
            {
                "define": {
                    "en": "wanting to lay eggs and sit on them",
                    "vi": "muốn đẻ trứng và ngồi trên chúng"
                },
                "examples": [
                    {
                        "en": "a broody hen",
                        "vi": "một con gà mái tơ"
                    }
                ]
            },
            {
                "define": {
                    "en": "quiet and thinking about something because you are unhappy or disappointed",
                    "vi": "im lặng và suy nghĩ về điều gì đó vì bạn không vui hoặc thất vọng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "4e45ea2106864201bdec9dbc3a9bae0d",
        "word": "bum",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/bʌm/",
            "us": "/bʌm/"
        },
        "nearby": [
            {
                "word": "bulwark",
                "pos": "noun"
            },
            {
                "word": "bum",
                "pos": "noun"
            },
            {
                "word": "bum",
                "pos": "verb"
            },
            {
                "word": "bum",
                "pos": "adjective"
            },
            {
                "word": "bum about",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to get something from somebody by asking",
                    "vi": "để nhận được thứ gì đó từ ai đó bằng cách yêu cầu"
                },
                "examples": [
                    {
                        "en": "Can I bum a cigarette off you?",
                        "vi": "Tôi có thể hút cho anh một điếu thuốc được không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody feel upset or disappointed",
                    "vi": "làm cho ai đó cảm thấy khó chịu hoặc thất vọng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "7bd311e9c4c145bfb9097daac4258821",
        "word": "choked",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/tʃəʊkt/",
            "us": "/tʃəʊkt/"
        },
        "nearby": [
            {
                "word": "chokecherry",
                "pos": "noun"
            },
            {
                "word": "choke collar",
                "pos": "noun"
            },
            {
                "word": "choked",
                "pos": "adjective"
            },
            {
                "word": "choke down",
                "pos": "phrasal verb"
            },
            {
                "word": "choke off",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "upset or angry about something, so that you find it difficult to speak",
                    "vi": "khó chịu hoặc tức giận về điều gì đó, do đó bạn cảm thấy khó nói"
                },
                "examples": [
                    {
                        "en": "‘I've had enough,’ he said in a choked voice.",
                        "vi": "Tôi ăn đủ rồi, anh nói với giọng nghẹn ngào."
                    },
                    {
                        "en": "I felt choked, but I couldn't cry.",
                        "vi": "Tôi cảm thấy nghẹn ngào, nhưng tôi không thể khóc."
                    },
                    {
                        "en": "She was choked up remembering it.",
                        "vi": "Cô đã nghẹn ngào khi nhớ lại nó."
                    }
                ]
            }
        ]
    },
    {
        "id": "b906bb9dca354aa9b8ceae3954457564",
        "word": "cloud",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/klaʊd/",
            "us": "/klaʊd/"
        },
        "nearby": [
            {
                "word": "clotting factor",
                "pos": "noun"
            },
            {
                "word": "cloud",
                "pos": "noun"
            },
            {
                "word": "cloud",
                "pos": "verb"
            },
            {
                "word": "cloudburst",
                "pos": "noun"
            },
            {
                "word": "cloud computing",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "if something clouds your judgement, memory, etc., it makes it difficult for you to understand or remember something clearly",
                    "vi": "nếu điều gì đó làm mờ khả năng phán đoán, trí nhớ, v.v. của bạn, khiến bạn khó hiểu hoặc nhớ rõ điều gì đó"
                },
                "examples": [
                    {
                        "en": "Doubts were beginning to cloud my mind.",
                        "vi": "Những nghi ngờ bắt đầu vẩn đục trong tâm trí tôi."
                    },
                    {
                        "en": "His judgement was clouded by jealousy.",
                        "vi": "Sự phán xét của anh ta đã bị che mờ bởi sự ghen tị."
                    }
                ]
            },
            {
                "define": {
                    "en": "to show that you feel sad, afraid, angry, etc.; to make somebody look sad, afraid, angry, etc.",
                    "vi": "để thể hiện rằng bạn cảm thấy buồn, sợ hãi, tức giận, v.v.; để làm cho ai đó trông buồn, sợ hãi, tức giận, v.v."
                },
                "examples": [
                    {
                        "en": "cloud (over) Her face clouded over with anger.",
                        "vi": "đám mây (trên) Khuôn mặt cô ấy mờ mịt vì giận dữ."
                    },
                    {
                        "en": "cloud something Suspicion clouded his face.",
                        "vi": "mây một cái gì đó Sự nghi ngờ che mờ khuôn mặt của anh ta."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make something you are discussing or considering less clear, especially by introducing subjects that are not connected with it",
                    "vi": "để làm cho điều gì đó bạn đang thảo luận hoặc xem xét kém rõ ràng hơn, đặc biệt là bằng cách giới thiệu các chủ đề không liên quan đến nó"
                },
                "examples": [
                    {
                        "en": "Cost factors should not be allowed to cloud the issue.",
                        "vi": "Các yếu tố chi phí không được phép làm lu mờ vấn đề."
                    },
                    {
                        "en": "Further clouding the picture is the question of gender.",
                        "vi": "Bao trùm hơn nữa bức tranh là câu hỏi về giới tính."
                    }
                ]
            },
            {
                "define": {
                    "en": "to fill with clouds",
                    "vi": "lấp đầy những đám mây"
                },
                "examples": [
                    {
                        "en": "It was beginning to cloud over.",
                        "vi": "Trời bắt đầu có mây mù."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make something less pleasant",
                    "vi": "để làm cho một cái gì đó ít dễ chịu hơn"
                },
                "examples": [
                    {
                        "en": "His last years were clouded by financial worries.",
                        "vi": "Những năm cuối đời của ông bị bao phủ bởi những lo lắng về tài chính."
                    }
                ]
            },
            {
                "define": {
                    "en": "if glass, water, etc. clouds, or if something clouds it, it becomes less easy to see through",
                    "vi": "nếu thủy tinh, nước, v.v. có mây, hoặc nếu có thứ gì đó làm mờ nó, thì việc nhìn xuyên qua sẽ trở nên ít dễ dàng hơn"
                },
                "examples": [
                    {
                        "en": "cloud (with something) Her eyes clouded with tears.",
                        "vi": "đám mây (với một cái gì đó) Đôi mắt cô ấy vẩn đục nước mắt."
                    },
                    {
                        "en": "cloud something Steam had clouded the mirror.",
                        "vi": "đám mây một cái gì đó Hơi nước đã làm mờ chiếc gương."
                    }
                ]
            }
        ]
    },
    {
        "id": "c348d77f1d564301b507e5589fbf912a",
        "word": "condole",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/kənˈdəʊl/",
            "us": "/kənˈdəʊl/"
        },
        "nearby": [
            {
                "word": "conditioning",
                "pos": "noun"
            },
            {
                "word": "condo",
                "pos": "noun"
            },
            {
                "word": "condole",
                "pos": "verb"
            },
            {
                "word": "condolence",
                "pos": "noun"
            },
            {
                "word": "condom",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to express sympathy for somebody, especially when a person in their family or somebody they know well has died",
                    "vi": "để bày tỏ sự cảm thông đối với ai đó, đặc biệt là khi một người trong gia đình của họ hoặc một người nào đó mà họ biết rõ đã qua đời"
                },
                "examples": [
                    {
                        "en": "The president condoled with the bereaved families.",
                        "vi": "Chủ tịch nước chia buồn cùng tang quyến."
                    }
                ]
            }
        ]
    },
    {
        "id": "0c59618d893849ae911475d6fa08bf4b",
        "word": "consternation",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌkɒnstəˈneɪʃn/",
            "us": "/ˌkɑːnstərˈneɪʃn/"
        },
        "nearby": [
            {
                "word": "constellate",
                "pos": "verb"
            },
            {
                "word": "constellation",
                "pos": "noun"
            },
            {
                "word": "consternation",
                "pos": "noun"
            },
            {
                "word": "constipated",
                "pos": "adjective"
            },
            {
                "word": "constipation",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a worried, sad feeling after you have received an unpleasant surprise",
                    "vi": "một cảm giác lo lắng, buồn bã sau khi bạn nhận được một bất ngờ khó chịu"
                },
                "examples": [
                    {
                        "en": "The announcement of her retirement caused consternation among tennis fans.",
                        "vi": "Việc tuyên bố giải nghệ của cô khiến người hâm mộ quần vợt vô cùng lo lắng."
                    },
                    {
                        "en": "Her mouth fell open in consternation.",
                        "vi": "Miệng cô ấy há ra vì kinh ngạc."
                    }
                ]
            }
        ]
    },
    {
        "id": "f026568152944ebb9eaa31cefc9c4c0c",
        "word": "desperation",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌdespəˈreɪʃn/",
            "us": "/ˌdespəˈreɪʃn/"
        },
        "nearby": [
            {
                "word": "Desperate Housewives",
                "pos": ""
            },
            {
                "word": "desperately",
                "pos": "adverb"
            },
            {
                "word": "desperation",
                "pos": "noun"
            },
            {
                "word": "despicable",
                "pos": "adjective"
            },
            {
                "word": "despicably",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the state of being desperate",
                    "vi": "trạng thái tuyệt vọng"
                },
                "examples": [
                    {
                        "en": "in desperation In desperation, she called Louise and asked for her help.",
                        "vi": "trong tuyệt vọng Trong tuyệt vọng, cô gọi cho Louise và nhờ cô ấy giúp đỡ."
                    },
                    {
                        "en": "There was a note of desperation in his voice.",
                        "vi": "Có một chút tuyệt vọng trong giọng nói của anh ta."
                    },
                    {
                        "en": "an act of sheer desperation",
                        "vi": "một hành động tuyệt vọng"
                    }
                ]
            }
        ]
    },
    {
        "id": "a0f52fd77ed5400594c91ac844dc60af",
        "word": "despondency",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/dɪˈspɒndənsi/",
            "us": "/dɪˈspɑːndənsi/"
        },
        "nearby": [
            {
                "word": "despite",
                "pos": "preposition"
            },
            {
                "word": "despoil",
                "pos": "verb"
            },
            {
                "word": "despondency",
                "pos": "noun"
            },
            {
                "word": "despondent",
                "pos": "adjective"
            },
            {
                "word": "despondently",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a feeling of being sad and without much hope",
                    "vi": "một cảm giác buồn và không có nhiều hy vọng"
                },
                "examples": [
                    {
                        "en": "a mood of despondency",
                        "vi": "tâm trạng chán nản"
                    },
                    {
                        "en": "Life's not all gloom and despondency.",
                        "vi": "Cuộc sống không phải là tất cả ảm đạm và tuyệt vọng."
                    },
                    {
                        "en": "despondency about/over something a situation of high unemployment and despondency about the future",
                        "vi": "thất vọng về / về điều gì đó trong tình trạng thất nghiệp cao và thất vọng về tương lai"
                    }
                ]
            }
        ]
    },
    {
        "id": "95740e3b74ef43838871259cf56b835b",
        "word": "despondent",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/dɪˈspɒndənt/",
            "us": "/dɪˈspɑːndənt/"
        },
        "nearby": [
            {
                "word": "despoil",
                "pos": "verb"
            },
            {
                "word": "despondency",
                "pos": "noun"
            },
            {
                "word": "despondent",
                "pos": "adjective"
            },
            {
                "word": "despondently",
                "pos": "adverb"
            },
            {
                "word": "despot",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "sad, without much hope",
                    "vi": "buồn, không có nhiều hy vọng"
                },
                "examples": [
                    {
                        "en": "There are times when it is hard not to feel despondent.",
                        "vi": "Có những lúc thật khó để không cảm thấy chán nản."
                    },
                    {
                        "en": "despondent about/over something She was becoming increasingly despondent about the way things were going.",
                        "vi": "chán nản về / về điều gì đó Cô ấy ngày càng trở nên chán nản về cách mọi thứ đang diễn ra."
                    }
                ]
            }
        ]
    },
    {
        "id": "49a24a36a3c542ee881209659b4c998e",
        "word": "disconsolate",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/dɪsˈkɒnsələt/",
            "us": "/dɪsˈkɑːnsələt/"
        },
        "nearby": [
            {
                "word": "disconnected",
                "pos": "adjective"
            },
            {
                "word": "disconnection",
                "pos": "noun"
            },
            {
                "word": "disconsolate",
                "pos": "adjective"
            },
            {
                "word": "disconsolately",
                "pos": "adverb"
            },
            {
                "word": "discontent",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "very unhappy and disappointed",
                    "vi": "rất không vui và thất vọng"
                },
                "examples": [
                    {
                        "en": "The disconsolate players left for home without a trophy.",
                        "vi": "Các cầu thủ thất vọng rời về nhà mà không có danh hiệu."
                    }
                ]
            }
        ]
    },
    {
        "id": "6fa93de8a3f04a64b072ac5626152596",
        "word": "doldrums",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈdɒldrəmz/",
            "us": "/ˈdəʊldrəmz/"
        },
        "nearby": [
            {
                "word": "Dolby",
                "pos": "noun"
            },
            {
                "word": "dolce",
                "pos": "adverb, adjective"
            },
            {
                "word": "doldrums",
                "pos": "noun"
            },
            {
                "word": "dole",
                "pos": "noun"
            },
            {
                "word": "dole",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the state of feeling sad or depressed",
                    "vi": "trạng thái cảm thấy buồn hoặc chán nản"
                },
                "examples": [
                    {
                        "en": "in the doldrums He's been in the doldrums ever since she left him.",
                        "vi": "trong tình trạng ảm đạm Anh ấy đã ở trong tình trạng ảm đạm kể từ khi cô ấy rời bỏ anh ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "a lack of activity or improvement",
                    "vi": "thiếu hoạt động hoặc cải thiện"
                },
                "examples": [
                    {
                        "en": "The bond market normally revives after the summer doldrums.",
                        "vi": "Thị trường trái phiếu thường hồi sinh sau mùa hè ảm đạm."
                    },
                    {
                        "en": "in the doldrums Despite these measures, the economy remains in the doldrums.",
                        "vi": "trong tình trạng ảm đạm Bất chấp những biện pháp này, nền kinh tế vẫn ở trong tình trạng ảm đạm."
                    }
                ]
            }
        ]
    },
    {
        "id": "ee3c6155cdf44e009e78c3de102710fe",
        "word": "doleful",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈdəʊlfl/",
            "us": "/ˈdəʊlfl/"
        },
        "nearby": [
            {
                "word": "dole",
                "pos": "noun"
            },
            {
                "word": "dole",
                "pos": "verb"
            },
            {
                "word": "doleful",
                "pos": "adjective"
            },
            {
                "word": "dolefully",
                "pos": "adverb"
            },
            {
                "word": "dole out",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "very sad",
                    "vi": "rất buồn"
                },
                "examples": [
                    {
                        "en": "a doleful expression/face/song",
                        "vi": "một biểu cảm / khuôn mặt / bài hát buồn tẻ"
                    },
                    {
                        "en": "a doleful looking man",
                        "vi": "một người đàn ông trông ngoan cường"
                    }
                ]
            }
        ]
    },
    {
        "id": "2fb62e3856dc4a40ad52a6e9e0d15d02",
        "word": "downcast",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈdaʊnkɑːst/",
            "us": "/ˈdaʊnkæst/"
        },
        "nearby": [
            {
                "word": "down at heel",
                "pos": "adjective"
            },
            {
                "word": "downbeat",
                "pos": "adjective"
            },
            {
                "word": "downcast",
                "pos": "adjective"
            },
            {
                "word": "downdraught",
                "pos": "noun"
            },
            {
                "word": "downer",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "looking down",
                    "vi": "nhìn xuống"
                },
                "examples": [
                    {
                        "en": "Eyes downcast, she continued eating.",
                        "vi": "Đôi mắt u ám, cô tiếp tục ăn."
                    },
                    {
                        "en": "She kept her eyes slightly downcast to avoid looking into their faces.",
                        "vi": "Cô ấy giữ đôi mắt của mình hơi cụp xuống để tránh nhìn vào mặt họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "sad or depressed",
                    "vi": "buồn hoặc chán nản"
                },
                "examples": [
                    {
                        "en": "A group of downcast men stood waiting for food.",
                        "vi": "Một nhóm đàn ông ủ rũ đứng đợi thức ăn."
                    }
                ]
            }
        ]
    },
    {
        "id": "3ef853d3b1f6440781f5463a8aee7888",
        "word": "downer",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈdaʊnə(r)/",
            "us": "/ˈdaʊnər/"
        },
        "nearby": [
            {
                "word": "downcast",
                "pos": "adjective"
            },
            {
                "word": "downdraught",
                "pos": "noun"
            },
            {
                "word": "downer",
                "pos": "noun"
            },
            {
                "word": "downfall",
                "pos": "noun"
            },
            {
                "word": "downgrade",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a drug, especially a barbiturate, that relaxes you or makes you want to sleep",
                    "vi": "một loại thuốc, đặc biệt là barbiturat, giúp bạn thư giãn hoặc khiến bạn muốn ngủ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "an experience that makes you feel sad or depressed",
                    "vi": "một trải nghiệm khiến bạn cảm thấy buồn hoặc chán nản"
                },
                "examples": [
                    {
                        "en": "Not getting the promotion was a real downer.",
                        "vi": "Không nhận được khuyến mại là một kẻ thất bại thực sự."
                    },
                    {
                        "en": "on a downer He's really on a downer (= very depressed).",
                        "vi": "trên một kẻ thất vọng Anh ấy thực sự đang ở trên một kẻ thất vọng (= rất chán nản)."
                    }
                ]
            }
        ]
    },
    {
        "id": "244d9fa577aa4950a53a1052547841b0",
        "word": "downhearted",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌdaʊnˈhɑːtɪd/",
            "us": "/ˌdaʊnˈhɑːrtɪd/"
        },
        "nearby": [
            {
                "word": "downgrade",
                "pos": "verb"
            },
            {
                "word": "downgrading",
                "pos": "noun"
            },
            {
                "word": "downhearted",
                "pos": "adjective"
            },
            {
                "word": "downhill",
                "pos": "adverb"
            },
            {
                "word": "downhill",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "feeling depressed or sad",
                    "vi": "cảm thấy chán nản hoặc buồn bã"
                },
                "examples": [
                    {
                        "en": "We're disappointed by these results but we're not downhearted.",
                        "vi": "Chúng tôi thất vọng vì những kết quả này nhưng chúng tôi không thất vọng."
                    }
                ]
            }
        ]
    },
    {
        "id": "b6f90009f2f84f44a9802b1558e31651",
        "word": "down in the dumps",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/dʌmps/",
            "us": "/dʌmps/"
        },
        "nearby": [
            {
                "word": "dumpling",
                "pos": "noun"
            },
            {
                "word": "dump on",
                "pos": "phrasal verb"
            },
            {
                "word": "dumps",
                "pos": "noun"
            },
            {
                "word": "Dumpster",
                "pos": "noun"
            },
            {
                "word": "dump truck",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "feeling unhappy",
                    "vi": "cảm thấy không vui"
                },
                "examples": [
                    {
                        "en": "He’d been down in the dumps since his girlfriend left him.",
                        "vi": "Anh ấy đã sa vào bãi rác kể từ khi bạn gái bỏ anh ấy."
                    }
                ]
            }
        ]
    },
    {
        "id": "a3d94bf1767b4514abfb7e71c5226cb7",
        "word": "down in the mouth",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/maʊθ/",
            "us": "/maʊθ/"
        },
        "nearby": [
            {
                "word": "moustached",
                "pos": "adjective"
            },
            {
                "word": "mousy",
                "pos": "adjective"
            },
            {
                "word": "mouth",
                "pos": "noun"
            },
            {
                "word": "mouth",
                "pos": "verb"
            },
            {
                "word": "mouthfeel",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the opening in the face used for speaking, eating, etc.; the area inside the head behind this opening",
                    "vi": "phần mở ở mặt được sử dụng để nói, ăn, v.v.; khu vực bên trong đầu đằng sau lỗ mở này"
                },
                "examples": [
                    {
                        "en": "She opened her mouth to say something.",
                        "vi": "Cô mở miệng muốn nói gì đó."
                    },
                    {
                        "en": "His mouth twisted into a wry smile.",
                        "vi": "Miệng anh nhếch lên thành một nụ cười gượng gạo."
                    },
                    {
                        "en": "Their mouths fell open (= they were surprised).",
                        "vi": "Miệng họ há hốc (= họ ngạc nhiên)."
                    },
                    {
                        "en": "Don't talk with your mouth full (= when eating).",
                        "vi": "Đừng nói chuyện với miệng của bạn (= khi ăn)."
                    },
                    {
                        "en": "The creature was foaming/frothing at the mouth.",
                        "vi": "Sinh vật đang sủi bọt / sủi bọt ở miệng."
                    },
                    {
                        "en": "Cover your mouth when you cough.",
                        "vi": "Che miệng khi ho."
                    },
                    {
                        "en": "The adult bird drops the worms into the mouths of the hungry chicks.",
                        "vi": "Chim trưởng thành thả giun vào miệng chim con đang đói."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person considered only as somebody who needs to be provided with food",
                    "vi": "một người chỉ được coi là người cần được cung cấp thức ăn"
                },
                "examples": [
                    {
                        "en": "Now there would be another mouth to feed.",
                        "vi": "Bây giờ sẽ có một miệng khác để kiếm ăn."
                    },
                    {
                        "en": "The world will not be able to support all these extra hungry mouths.",
                        "vi": "Thế giới sẽ không thể hỗ trợ tất cả những cái miệng đói thêm này."
                    }
                ]
            },
            {
                "define": {
                    "en": "the place where a river joins the sea",
                    "vi": "nơi sông hợp với biển"
                },
                "examples": [
                    {
                        "en": "A number of industries sprang up around the mouth of the river.",
                        "vi": "Một số ngành công nghiệp mọc lên xung quanh cửa sông."
                    },
                    {
                        "en": "Pelicans are found close to river mouths.",
                        "vi": "Bồ nông được tìm thấy gần các cửa sông."
                    }
                ]
            },
            {
                "define": {
                    "en": "the entrance or opening of something",
                    "vi": "lối vào hoặc mở một cái gì đó"
                },
                "examples": [
                    {
                        "en": "the mouth of a cave/pit",
                        "vi": "miệng của một hang động / hố"
                    },
                    {
                        "en": "Up ahead was the tunnel mouth.",
                        "vi": "Phía trước là miệng đường hầm."
                    }
                ]
            },
            {
                "define": {
                    "en": "a particular way of speaking",
                    "vi": "một cách nói cụ thể"
                },
                "examples": [
                    {
                        "en": "He has a foul mouth on him!",
                        "vi": "Anh ta có một cái miệng hôi của anh ta!"
                    },
                    {
                        "en": "Watch your mouth! (= stop saying things that are rude and/or offensive)",
                        "vi": "Cẩn thận mồm miệng! (= ngừng nói những điều thô lỗ và / hoặc xúc phạm)"
                    }
                ]
            },
            {
                "define": {
                    "en": "having the type or shape of mouth mentioned",
                    "vi": "có kiểu hoặc hình dạng miệng được đề cập"
                },
                "examples": [
                    {
                        "en": "a wide-mouthed old woman",
                        "vi": "một bà già mồm mép"
                    },
                    {
                        "en": "a narrow-mouthed cave",
                        "vi": "một cái hang hẹp"
                    }
                ]
            },
            {
                "define": {
                    "en": "having a particular way of speaking",
                    "vi": "có một cách nói cụ thể"
                },
                "examples": [
                    {
                        "en": "a rather crude-mouthed individual",
                        "vi": "một cá nhân khá thô thiển"
                    }
                ]
            },
            {
                "define": {
                    "en": "if you say somebody is all mouth, you mean that they talk a lot about doing something, but are, in fact, not brave enough to do it",
                    "vi": "nếu bạn nói ai đó chỉ toàn mồm mép, bạn có nghĩa là họ nói rất nhiều về việc làm điều gì đó, nhưng thực tế là bạn không đủ can đảm để làm điều đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "having rich parents",
                    "vi": "có cha mẹ giàu có"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to say that somebody seems to be innocent, kind, etc. when they are not really",
                    "vi": "được sử dụng để nói rằng ai đó dường như vô tội, tốt bụng, v.v. trong khi họ không thực sự"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "because people tell each other and not because they read about it",
                    "vi": "bởi vì mọi người nói với nhau chứ không phải vì họ đọc về nó"
                },
                "examples": [
                    {
                        "en": "The news spread by word of mouth.",
                        "vi": "Tin tức được truyền miệng."
                    },
                    {
                        "en": "The restaurant does not advertise, but relies on word of mouth for custom.",
                        "vi": "Nhà hàng không quảng cáo mà dựa vào truyền miệng tùy tục."
                    }
                ]
            },
            {
                "define": {
                    "en": "unhappy and depressed",
                    "vi": "không vui và chán nản"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to have a mass of small bubbles in and around its mouth, especially because it is sick or angry",
                    "vi": "có một khối bong bóng nhỏ trong và xung quanh miệng của nó, đặc biệt là vì nó bị ốm hoặc tức giận"
                },
                "examples": [
                    {
                        "en": "The dog started foaming at the mouth.",
                        "vi": "Con chó bắt đầu sùi bọt mép."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be very angry",
                    "vi": "rất tức giận"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "given by somebody who is directly involved and therefore likely to be accurate",
                    "vi": "được đưa ra bởi ai đó có liên quan trực tiếp và do đó có khả năng chính xác"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be bad at keeping secrets",
                    "vi": "kém trong việc giữ bí mật"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to talk too much, especially about your own abilities and achievements",
                    "vi": "nói quá nhiều, đặc biệt là về khả năng và thành tích của chính bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "somebody feels nervous or frightened about something",
                    "vi": "ai đó cảm thấy lo lắng hoặc sợ hãi về điều gì đó"
                },
                "examples": [
                    {
                        "en": "My heart was in my mouth as I opened the envelope.",
                        "vi": "Trái tim tôi đang ở trong miệng khi tôi mở phong bì."
                    }
                ]
            },
            {
                "define": {
                    "en": "to not talk about something to somebody because it is a secret or because it will upset or annoy them",
                    "vi": "không nói về điều gì đó với ai đó vì nó là bí mật hoặc vì nó sẽ làm họ khó chịu hoặc khó chịu"
                },
                "examples": [
                    {
                        "en": "I've warned them to keep their mouths shut about this.",
                        "vi": "Tôi đã cảnh báo họ phải giữ miệng về điều này."
                    },
                    {
                        "en": "Now she's upset—why couldn't you keep your mouth shut?",
                        "vi": "Bây giờ cô ấy đang buồn - tại sao bạn không thể ngậm miệng?"
                    },
                    {
                        "en": "The athletes were warned to keep their mouths shut about politics.",
                        "vi": "Các vận động viên đã được cảnh báo để giữ kín miệng về chính trị."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make you feel upset or ashamed afterwards",
                    "vi": "làm cho bạn cảm thấy khó chịu hoặc xấu hổ sau đó"
                },
                "examples": [
                    {
                        "en": "The whole business left a bad taste in my mouth.",
                        "vi": "Toàn bộ công việc kinh doanh để lại một hương vị tồi tệ trong miệng của tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to spend all the money you earn on basic needs such as food without being able to save any money",
                    "vi": "chi tiêu tất cả số tiền bạn kiếm được cho các nhu cầu cơ bản như thực phẩm mà không thể tiết kiệm được tiền"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to refuse or criticize something that is given to you for nothing",
                    "vi": "từ chối hoặc chỉ trích một thứ gì đó được trao cho bạn mà chẳng có gì"
                },
                "examples": [
                    {
                        "en": "I’m never one to look a gift horse in the mouth.",
                        "vi": "Tôi không bao giờ là người nhìn vào miệng một con ngựa quà tặng."
                    }
                ]
            },
            {
                "define": {
                    "en": "used when you realize that you have said something that you should not have said",
                    "vi": "được sử dụng khi bạn nhận ra rằng bạn đã nói điều gì đó mà lẽ ra bạn không nên nói"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be soft and very good to eat",
                    "vi": "mềm và ăn rất ngon"
                },
                "examples": [
                    {
                        "en": "They serve steaks that just melt in your mouth.",
                        "vi": "Họ phục vụ những miếng bít tết vừa tan trong miệng của bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "used when a small child has just said something that seems very wise or clever",
                    "vi": "được sử dụng khi một đứa trẻ nhỏ vừa nói một điều gì đó có vẻ rất khôn ngoan hoặc thông minh"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to say or do something that upsets, offends or embarrasses somebody",
                    "vi": "nói hoặc làm điều gì đó khiến ai đó khó chịu, xúc phạm hoặc xấu hổ"
                },
                "examples": [
                    {
                        "en": "I really put my foot in my mouth with Ella—I didn't know she'd split up with Tom.",
                        "vi": "Tôi thực sự đưa chân vào miệng với Ella - Tôi không biết cô ấy đã chia tay với Tom."
                    }
                ]
            },
            {
                "define": {
                    "en": "to support what you say by doing something practical; to show by your actions that you really mean something",
                    "vi": "để hỗ trợ những gì bạn nói bằng cách làm một cái gì đó thiết thực; để thể hiện bằng hành động của bạn rằng bạn thực sự có ý nghĩa"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to suggest that somebody has said something when in fact they have not",
                    "vi": "gợi ý rằng ai đó đã nói điều gì đó trong khi thực tế là họ chưa"
                },
                "examples": [
                    {
                        "en": "He felt after the interview that the police officers had been trying to put words into his mouth.",
                        "vi": "Anh cảm thấy sau cuộc phỏng vấn rằng các nhân viên cảnh sát đang cố nhét lời vào miệng anh."
                    }
                ]
            },
            {
                "define": {
                    "en": "to talk too much, in a way that is not sensible",
                    "vi": "nói quá nhiều, theo cách không hợp lý"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to talk about something in a way that shows that you are too proud of it",
                    "vi": "nói về điều gì đó theo cách thể hiện rằng bạn quá tự hào về điều đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to talk about something that is private or secret",
                    "vi": "để nói về điều gì đó riêng tư hoặc bí mật"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a rude way of telling somebody to be quiet or stop talking",
                    "vi": "một cách thô lỗ để bảo ai đó im lặng hoặc ngừng nói"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to take away somebody’s job so that they are no longer able to earn enough money to live",
                    "vi": "tước bỏ công việc của ai đó để họ không còn có thể kiếm đủ tiền để sống"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to say what somebody else was going to say",
                    "vi": "để nói những gì người khác sẽ nói"
                },
                "examples": [
                    {
                        "en": "I was about to say we should cancel the trip, but she took the words right out of my mouth.",
                        "vi": "Tôi định nói chúng tôi nên hủy chuyến đi, nhưng cô ấy đã rút lời ngay từ miệng tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be careful what you say in order not to offend somebody or make them angry",
                    "vi": "hãy cẩn thận với những gì bạn nói để không xúc phạm ai đó hoặc khiến họ tức giận"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "7817372975094d1f8a54ff1f32df88e2",
        "word": "dreary",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈdrɪəri/",
            "us": "/ˈdrɪri/"
        },
        "nearby": [
            {
                "word": "drearily",
                "pos": "adverb"
            },
            {
                "word": "dreariness",
                "pos": "noun"
            },
            {
                "word": "dreary",
                "pos": "adjective"
            },
            {
                "word": "dreck",
                "pos": "noun"
            },
            {
                "word": "dredge",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "that makes you feel sad; not bright or interesting",
                    "vi": "điều đó khiến bạn cảm thấy buồn; không sáng sủa hay thú vị"
                },
                "examples": [
                    {
                        "en": "a dreary winter’s day",
                        "vi": "một ngày mùa đông ảm đạm"
                    },
                    {
                        "en": "a dreary film",
                        "vi": "một bộ phim thê lương"
                    },
                    {
                        "en": "a long and dreary journey on the train",
                        "vi": "một cuộc hành trình dài và buồn tẻ trên tàu"
                    }
                ]
            }
        ]
    },
    {
        "id": "f1c2d229cec1481590bf79f62f39b5cd",
        "word": "droop",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/druːp/",
            "us": "/druːp/"
        },
        "nearby": [
            {
                "word": "drongo",
                "pos": "noun"
            },
            {
                "word": "drool",
                "pos": "verb"
            },
            {
                "word": "droop",
                "pos": "verb"
            },
            {
                "word": "droop",
                "pos": "noun"
            },
            {
                "word": "droopy",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to bend, hang or move downwards, especially because of being weak or tired",
                    "vi": "cúi, treo hoặc di chuyển xuống dưới, đặc biệt là vì yếu hoặc mệt"
                },
                "examples": [
                    {
                        "en": "the drooping branches of the apple tree",
                        "vi": "cành cây táo rũ xuống"
                    },
                    {
                        "en": "She was so tired, her eyelids were beginning to droop.",
                        "vi": "Cô mệt mỏi quá, mi mắt bắt đầu rũ xuống."
                    },
                    {
                        "en": "The plants were drooping from lack of water.",
                        "vi": "Cây cối rũ rượi vì thiếu nước."
                    }
                ]
            },
            {
                "define": {
                    "en": "to become sad or depressed",
                    "vi": "trở nên buồn bã hoặc chán nản"
                },
                "examples": [
                    {
                        "en": "Our spirits drooped when we heard the news.",
                        "vi": "Tinh thần chúng tôi sa sút khi biết tin."
                    }
                ]
            }
        ]
    },
    {
        "id": "54ce78e926c347c0bc678acc7e0a706b",
        "word": "emptiness",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈemptinəs/",
            "us": "/ˈemptinəs/"
        },
        "nearby": [
            {
                "word": "empties",
                "pos": "noun"
            },
            {
                "word": "emptily",
                "pos": "adverb"
            },
            {
                "word": "emptiness",
                "pos": "noun"
            },
            {
                "word": "empty",
                "pos": "noun"
            },
            {
                "word": "empty",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a feeling of being sad because nothing seems to have any value",
                    "vi": "cảm giác buồn vì dường như không có gì có giá trị"
                },
                "examples": [
                    {
                        "en": "There was an aching emptiness in her heart.",
                        "vi": "Có một sự trống rỗng nhức nhối trong tim cô."
                    }
                ]
            },
            {
                "define": {
                    "en": "the fact that there is nothing or nobody in a place",
                    "vi": "thực tế là không có gì hoặc không có ai ở một nơi"
                },
                "examples": [
                    {
                        "en": "The silence and emptiness of the house did not scare her.",
                        "vi": "Sự im lặng và trống trải của ngôi nhà không làm cô sợ hãi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a place that is empty",
                    "vi": "một nơi trống rỗng"
                },
                "examples": [
                    {
                        "en": "He stared out at the vast emptiness of the sea.",
                        "vi": "Anh nhìn chằm chằm vào khoảng không mênh mông của biển cả."
                    }
                ]
            }
        ]
    },
    {
        "id": "bfa06d9f0fcc407c9bfda06e7feb013e",
        "word": "glum",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ɡlʌm/",
            "us": "/ɡlʌm/"
        },
        "nearby": [
            {
                "word": "glug",
                "pos": "verb"
            },
            {
                "word": "glug",
                "pos": "noun"
            },
            {
                "word": "glum",
                "pos": "adjective"
            },
            {
                "word": "glumly",
                "pos": "adverb"
            },
            {
                "word": "glut",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "sad, quiet and unhappy",
                    "vi": "buồn, yên lặng và không vui"
                },
                "examples": [
                    {
                        "en": "The players sat there with glum looks on their faces.",
                        "vi": "Các cầu thủ ngồi đó với vẻ mặt lo lắng."
                    },
                    {
                        "en": "The couple looked distinctly glum.",
                        "vi": "Cặp đôi trông rất quyến rũ."
                    }
                ]
            }
        ]
    },
    {
        "id": "6d6c90620d044edebd0d3d7edac7177c",
        "word": "grave",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ɡreɪv/",
            "us": "/ɡreɪv/"
        },
        "nearby": [
            {
                "word": "Grauman's Chinese Theater",
                "pos": ""
            },
            {
                "word": "grave1",
                "pos": "noun"
            },
            {
                "word": "grave1",
                "pos": "adjective"
            },
            {
                "word": "grave2",
                "pos": "noun"
            },
            {
                "word": "gravedigger",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "very serious and important; giving you a reason to feel worried",
                    "vi": "rất nghiêm túc và quan trọng; cho bạn một lý do để cảm thấy lo lắng"
                },
                "examples": [
                    {
                        "en": "The police have expressed grave concern about the missing child's safety.",
                        "vi": "Cảnh sát đã bày tỏ mối quan tâm nghiêm trọng về sự an toàn của đứa trẻ mất tích."
                    },
                    {
                        "en": "The consequences will be very grave if nothing is done.",
                        "vi": "Hậu quả sẽ rất nghiêm trọng nếu không làm gì."
                    },
                    {
                        "en": "We were in grave danger.",
                        "vi": "Chúng tôi đang gặp nguy hiểm nghiêm trọng."
                    },
                    {
                        "en": "I fear you are making a very grave mistake.",
                        "vi": "Tôi sợ bạn đang mắc một sai lầm rất nghiêm trọng."
                    }
                ]
            },
            {
                "define": {
                    "en": "serious in manner, as if something sad or important has just happened",
                    "vi": "nghiêm túc, như thể điều gì đó buồn hoặc quan trọng vừa xảy ra"
                },
                "examples": [
                    {
                        "en": "He looked very grave as he entered the room.",
                        "vi": "Anh ta trông rất nghiêm trang khi bước vào phòng."
                    }
                ]
            }
        ]
    },
    {
        "id": "49f4916c302f48a98ecea97a1dd6f285",
        "word": "grief-stricken",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɡriːf strɪkən/",
            "us": "/ˈɡriːf strɪkən/"
        },
        "nearby": [
            {
                "word": "gridlocked",
                "pos": "adjective"
            },
            {
                "word": "grief",
                "pos": "noun"
            },
            {
                "word": "grief-stricken",
                "pos": "adjective"
            },
            {
                "word": "grievance",
                "pos": "noun"
            },
            {
                "word": "grieve",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "feeling extremely sad because of something that has happened, especially the death of somebody",
                    "vi": "cảm thấy vô cùng đau buồn vì một điều gì đó đã xảy ra, đặc biệt là cái chết của một người nào đó"
                },
                "examples": [
                    {
                        "en": "There was no way of consoling her grief-stricken family.",
                        "vi": "Không có cách nào để an ủi gia đình đau buồn của cô ấy."
                    }
                ]
            }
        ]
    },
    {
        "id": "e0eddb71dcec46149dcc90ce24fe6e9c",
        "word": "grieve",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ɡriːv/",
            "us": "/ɡriːv/"
        },
        "nearby": [
            {
                "word": "grief-stricken",
                "pos": "adjective"
            },
            {
                "word": "grievance",
                "pos": "noun"
            },
            {
                "word": "grieve",
                "pos": "verb"
            },
            {
                "word": "grievous",
                "pos": "adjective"
            },
            {
                "word": "grievous bodily harm",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to feel very sad, especially because somebody has died",
                    "vi": "cảm thấy rất buồn, đặc biệt là vì ai đó đã chết"
                },
                "examples": [
                    {
                        "en": "grieve (for/over somebody/something) They are still grieving for their dead child.",
                        "vi": "đau buồn (vì / vì ai đó / cái gì đó) Họ vẫn đang đau buồn cho đứa con đã chết của họ."
                    },
                    {
                        "en": "grieving relatives",
                        "vi": "người thân đau buồn"
                    },
                    {
                        "en": "grieve somebody/something She grieved the death of her husband.",
                        "vi": "làm buồn ai đó / cái gì đó Cô ấy đau buồn về cái chết của chồng mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make you feel very sad",
                    "vi": "làm cho bạn cảm thấy rất buồn"
                },
                "examples": [
                    {
                        "en": "it grieves somebody that… It grieved him that he could do nothing to help her.",
                        "vi": "điều đó khiến ai đó đau buồn vì… Anh ấy đau buồn vì anh ấy không thể làm gì để giúp cô ấy."
                    },
                    {
                        "en": "grieve somebody Their lack of interest grieved her.",
                        "vi": "làm buồn lòng ai đó Sự thiếu quan tâm của họ đã làm cô ấy buồn."
                    },
                    {
                        "en": "it grieves somebody to do something It grieved her to leave.",
                        "vi": "nó làm ai đó đau buồn khi làm điều gì đó Nó khiến cô ấy đau buồn khi phải ra đi."
                    }
                ]
            },
            {
                "define": {
                    "en": "if a person does not know about something that they would normally think was bad, then it cannot hurt them",
                    "vi": "nếu một người không biết về điều gì đó mà họ thường nghĩ là tồi tệ, thì điều đó không thể làm tổn thương họ"
                },
                "examples": [
                    {
                        "en": "What does it matter if I use his flat while he’s away? What the eye doesn’t see…!",
                        "vi": "Có vấn đề gì nếu tôi sử dụng căn hộ của anh ấy khi anh ấy đi vắng? Những gì mắt không thấy…!"
                    }
                ]
            }
        ]
    },
    {
        "id": "f87d4b13bbe0496fbfa930462d342ca1",
        "word": "heartache",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈhɑːteɪk/",
            "us": "/ˈhɑːrteɪk/"
        },
        "nearby": [
            {
                "word": "heart",
                "pos": "noun"
            },
            {
                "word": "heart",
                "pos": "verb"
            },
            {
                "word": "heartache",
                "pos": "noun"
            },
            {
                "word": "heart attack",
                "pos": "noun"
            },
            {
                "word": "heartbeat",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a feeling of being very sad or worried",
                    "vi": "cảm giác rất buồn hoặc lo lắng"
                },
                "examples": [
                    {
                        "en": "The relationship caused her a great deal of heartache.",
                        "vi": "Mối quan hệ khiến cô vô cùng đau lòng."
                    },
                    {
                        "en": "the heartaches of being a parent",
                        "vi": "nỗi đau của việc làm cha mẹ"
                    }
                ]
            }
        ]
    },
    {
        "id": "9cf5c581facf4bd3a475e4d7cfee47cc",
        "word": "heartbreak",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈhɑːtbreɪk/",
            "us": "/ˈhɑːrtbreɪk/"
        },
        "nearby": [
            {
                "word": "heart attack",
                "pos": "noun"
            },
            {
                "word": "heartbeat",
                "pos": "noun"
            },
            {
                "word": "heartbreak",
                "pos": "noun"
            },
            {
                "word": "heartbreaking",
                "pos": "adjective"
            },
            {
                "word": "heartbroken",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a feeling of being very sad",
                    "vi": "một cảm giác rất buồn"
                },
                "examples": [
                    {
                        "en": "They suffered the heartbreak of losing a child through cancer.",
                        "vi": "Họ đã phải chịu đựng sự đau lòng khi mất đi một đứa trẻ vì căn bệnh ung thư."
                    }
                ]
            }
        ]
    },
    {
        "id": "85a1dd820648433a8edd77c647392635",
        "word": "heartbreaking",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈhɑːtbreɪkɪŋ/",
            "us": "/ˈhɑːrtbreɪkɪŋ/"
        },
        "nearby": [
            {
                "word": "heartbeat",
                "pos": "noun"
            },
            {
                "word": "heartbreak",
                "pos": "noun"
            },
            {
                "word": "heartbreaking",
                "pos": "adjective"
            },
            {
                "word": "heartbroken",
                "pos": "adjective"
            },
            {
                "word": "heartburn",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "extremely sad",
                    "vi": "rất buồn"
                },
                "examples": [
                    {
                        "en": "a heartbreaking story",
                        "vi": "một câu chuyện đau lòng"
                    },
                    {
                        "en": "It's heartbreaking to see him wasting his life like this.",
                        "vi": "Thật đau lòng khi thấy anh ấy lãng phí cuộc đời mình như thế này."
                    }
                ]
            }
        ]
    },
    {
        "id": "5fd834911b324f41aab8add855943280",
        "word": "heart-rending",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈhɑːt rendɪŋ/",
            "us": "/ˈhɑːrt rendɪŋ/"
        },
        "nearby": [
            {
                "word": "heart of palm",
                "pos": "noun"
            },
            {
                "word": "heart rate",
                "pos": "noun"
            },
            {
                "word": "heart-rending",
                "pos": "adjective"
            },
            {
                "word": "heart-searching",
                "pos": "noun"
            },
            {
                "word": "heartsick",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "causing very sad feelings",
                    "vi": "gây ra cảm giác rất buồn"
                },
                "examples": [
                    {
                        "en": "a heart-rending story",
                        "vi": "một câu chuyện khắc cốt ghi tâm"
                    }
                ]
            }
        ]
    },
    {
        "id": "9c51427960c94df481c28512db24d507",
        "word": "heartsick",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈhɑːtsɪk/",
            "us": "/ˈhɑːrtsɪk/"
        },
        "nearby": [
            {
                "word": "heart-rending",
                "pos": "adjective"
            },
            {
                "word": "heart-searching",
                "pos": "noun"
            },
            {
                "word": "heartsick",
                "pos": "adjective"
            },
            {
                "word": "heart-stopping",
                "pos": "adjective"
            },
            {
                "word": "heartstrings",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "extremely unhappy or disappointed",
                    "vi": "cực kỳ không vui hoặc thất vọng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "5f971be7348f43ee932120740589f2ac",
        "word": "inconsolable",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌɪnkənˈsəʊləbl/",
            "us": "/ˌɪnkənˈsəʊləbl/"
        },
        "nearby": [
            {
                "word": "inconsistent",
                "pos": "adjective"
            },
            {
                "word": "inconsistently",
                "pos": "adverb"
            },
            {
                "word": "inconsolable",
                "pos": "adjective"
            },
            {
                "word": "inconsolably",
                "pos": "adverb"
            },
            {
                "word": "inconspicuous",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "very sad and unable to accept help or comfort",
                    "vi": "rất buồn và không thể chấp nhận sự giúp đỡ hoặc an ủi"
                },
                "examples": [
                    {
                        "en": "They were inconsolable when their only child died.",
                        "vi": "Họ không thể nguôi ngoai khi đứa con duy nhất của họ qua đời."
                    },
                    {
                        "en": "inconsolable grief",
                        "vi": "đau buồn khôn nguôi"
                    }
                ]
            }
        ]
    },
    {
        "id": "7e5b5d19bc4f41e683dfcf3c8dac974d",
        "word": "lovelorn",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈlʌvlɔːn/",
            "us": "/ˈlʌvlɔːrn/"
        },
        "nearby": [
            {
                "word": "loveliness",
                "pos": "noun"
            },
            {
                "word": "Bernard Lovell",
                "pos": ""
            },
            {
                "word": "lovelorn",
                "pos": "adjective"
            },
            {
                "word": "lovely",
                "pos": "adjective"
            },
            {
                "word": "lovely",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "unhappy because the person you love does not love you",
                    "vi": "không hạnh phúc vì người bạn yêu không yêu bạn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "287b6ca5da1e42dca5fa69ddf81d0d97",
        "word": "lugubrious",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ləˈɡuːbriəs/",
            "us": "/ləˈɡuːbriəs/"
        },
        "nearby": [
            {
                "word": "lughole",
                "pos": "noun"
            },
            {
                "word": "lug nut",
                "pos": "noun"
            },
            {
                "word": "lugubrious",
                "pos": "adjective"
            },
            {
                "word": "lugubriously",
                "pos": "adverb"
            },
            {
                "word": "lugworm",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "sad and serious",
                    "vi": "buồn và nghiêm túc"
                },
                "examples": [
                    {
                        "en": "a lugubrious expression",
                        "vi": "một biểu hiện lugubrious"
                    }
                ]
            }
        ]
    },
    {
        "id": "656eabf1a9f843a7bcad9405465079ba",
        "word": "melancholy",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmelənkəli/",
            "us": "/ˈmelənkɑːli/"
        },
        "nearby": [
            {
                "word": "melancholia",
                "pos": "noun"
            },
            {
                "word": "melancholic",
                "pos": "adjective"
            },
            {
                "word": "melancholy",
                "pos": "noun"
            },
            {
                "word": "melancholy",
                "pos": "adjective"
            },
            {
                "word": "melange",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a feeling of being very sad that lasts for a long time and often cannot be explained",
                    "vi": "một cảm giác rất buồn kéo dài và thường không thể giải thích được"
                },
                "examples": [
                    {
                        "en": "A mood of melancholy descended on us.",
                        "vi": "Một tâm trạng u uất bao trùm lên chúng tôi."
                    },
                    {
                        "en": "There is a brooding melancholy in his black and white photography.",
                        "vi": "Có một nỗi sầu muộn đang nghiền ngẫm trong bức ảnh đen trắng của anh ấy."
                    }
                ]
            }
        ]
    },
    {
        "id": "6d085fc098f34683be27306ef2821df8",
        "word": "melancholy",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmelənkəli/",
            "us": "/ˈmelənkɑːli/"
        },
        "nearby": [
            {
                "word": "melancholic",
                "pos": "adjective"
            },
            {
                "word": "melancholy",
                "pos": "noun"
            },
            {
                "word": "melancholy",
                "pos": "adjective"
            },
            {
                "word": "melange",
                "pos": "noun"
            },
            {
                "word": "Melanie",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "very sad or making you feel very sad",
                    "vi": "rất buồn hoặc làm bạn cảm thấy rất buồn"
                },
                "examples": [
                    {
                        "en": "melancholy thoughts/memories",
                        "vi": "những suy nghĩ / ký ức u sầu"
                    },
                    {
                        "en": "The melancholy song died away.",
                        "vi": "Khúc hát sầu đã tàn."
                    }
                ]
            }
        ]
    },
    {
        "id": "be93bfe9f10d4142990c8bcc042a8e82",
        "word": "messed-up",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌmest ˈʌp/",
            "us": "/ˌmest ˈʌp/"
        },
        "nearby": [
            {
                "word": "mess around",
                "pos": "phrasal verb"
            },
            {
                "word": "mess around with",
                "pos": "phrasal verb"
            },
            {
                "word": "messed-up",
                "pos": "adjective"
            },
            {
                "word": "messenger",
                "pos": "noun"
            },
            {
                "word": "Messiah",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "full of problems, often because of a lack of organization or because of mistakes that somebody has made",
                    "vi": "đầy những vấn đề, thường là do thiếu tổ chức hoặc vì những sai lầm mà ai đó đã mắc phải"
                },
                "examples": [
                    {
                        "en": "Sport offers an escape from the messed-up world these kids find themselves in.",
                        "vi": "Thể thao cung cấp một lối thoát khỏi thế giới lộn xộn mà những đứa trẻ này tìm thấy chính mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "upset; very emotional",
                    "vi": "khó chịu; rất xúc động"
                },
                "examples": [
                    {
                        "en": "I wanted to write stories about the messed-up kids I grew up with who acted in messed-up ways.",
                        "vi": "Tôi muốn viết những câu chuyện về những đứa trẻ lộn xộn mà tôi lớn lên cùng những người đã hành động theo những cách lộn xộn."
                    }
                ]
            }
        ]
    },
    {
        "id": "39465d1a5cf24d5492ddc0c29c873a35",
        "word": "moon about",
        "pos": "phrasal verb",
        "level": "c2",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "moon",
                "pos": "noun"
            },
            {
                "word": "moon",
                "pos": "verb"
            },
            {
                "word": "moon about",
                "pos": "phrasal verb"
            },
            {
                "word": "moon around",
                "pos": "phrasal verb"
            },
            {
                "word": "moonbeam",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to spend time doing nothing or walking around with no particular purpose, especially because you are unhappy",
                    "vi": "dành thời gian không làm gì hoặc đi lại không có mục đích cụ thể, đặc biệt là vì bạn không hạnh phúc"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "4c08b25fbc8a43e387a18ce7ad73a8b3",
        "word": "moon around",
        "pos": "phrasal verb",
        "level": "c2",
        "phonetic": {
            "uk": "",
            "us": ""
        },
        "nearby": [
            {
                "word": "moon",
                "pos": "verb"
            },
            {
                "word": "moon about",
                "pos": "phrasal verb"
            },
            {
                "word": "moon around",
                "pos": "phrasal verb"
            },
            {
                "word": "moonbeam",
                "pos": "noun"
            },
            {
                "word": "Moon Boot",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to spend time doing nothing or walking around with no particular purpose, especially because you are unhappy",
                    "vi": "dành thời gian không làm gì hoặc đi lại không có mục đích cụ thể, đặc biệt là vì bạn không hạnh phúc"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "12e51b4199db414baf1913589802616b",
        "word": "morose",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/məˈrəʊs/",
            "us": "/məˈrəʊs/"
        },
        "nearby": [
            {
                "word": "moron",
                "pos": "noun"
            },
            {
                "word": "moronic",
                "pos": "adjective"
            },
            {
                "word": "morose",
                "pos": "adjective"
            },
            {
                "word": "morosely",
                "pos": "adverb"
            },
            {
                "word": "morph",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "unhappy, in a bad mood and not talking very much",
                    "vi": "không vui, tâm trạng tồi tệ và không nói nhiều"
                },
                "examples": [
                    {
                        "en": "She just sat there looking morose.",
                        "vi": "Cô ấy chỉ ngồi đó trông có vẻ cáu kỉnh."
                    },
                    {
                        "en": "She seems a bit morose today.",
                        "vi": "Hôm nay cô ấy có vẻ hơi lo lắng."
                    }
                ]
            }
        ]
    },
    {
        "id": "8d426d186e8c4a7784453e153e3fd30c",
        "word": "mourn",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/mɔːn/",
            "us": "/mɔːrn/"
        },
        "nearby": [
            {
                "word": "mount up",
                "pos": "phrasal verb"
            },
            {
                "word": "Mount Vernon",
                "pos": ""
            },
            {
                "word": "mourn",
                "pos": "verb"
            },
            {
                "word": "mourner",
                "pos": "noun"
            },
            {
                "word": "mournful",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to feel and show that you are sad because somebody has died; to feel sad because something no longer exists or is no longer the same",
                    "vi": "để cảm nhận và thể hiện rằng bạn đang buồn vì ai đó đã chết; cảm thấy buồn vì điều gì đó không còn tồn tại hoặc không còn như trước"
                },
                "examples": [
                    {
                        "en": "Please, leave us to mourn in peace.",
                        "vi": "Xin hãy để chúng tôi than khóc trong hòa bình."
                    },
                    {
                        "en": "mourn something He was still mourning his brother's death.",
                        "vi": "thương tiếc một cái gì đó Anh vẫn để tang cái chết của anh trai mình."
                    },
                    {
                        "en": "They mourn the passing of a simpler way of life.",
                        "vi": "Họ thương tiếc sự ra đi của một lối sống đơn giản hơn."
                    },
                    {
                        "en": "The city was mourning the victims of the bombings.",
                        "vi": "Thành phố đang để tang các nạn nhân của các vụ đánh bom."
                    },
                    {
                        "en": "mourn (for somebody/something) Today we mourn for all those who died in two world wars.",
                        "vi": "thương tiếc (cho ai đó / cái gì đó) Hôm nay chúng ta thương tiếc cho tất cả những người đã chết trong hai cuộc chiến tranh thế giới."
                    },
                    {
                        "en": "She mourned for her lost childhood.",
                        "vi": "Cô thương tiếc cho tuổi thơ đã mất của mình."
                    }
                ]
            }
        ]
    },
    {
        "id": "85a3abb1aea64d2c9cfc4f372617d05c",
        "word": "mournful",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmɔːnfl/",
            "us": "/ˈmɔːrnfl/"
        },
        "nearby": [
            {
                "word": "mourn",
                "pos": "verb"
            },
            {
                "word": "mourner",
                "pos": "noun"
            },
            {
                "word": "mournful",
                "pos": "adjective"
            },
            {
                "word": "mournfully",
                "pos": "adverb"
            },
            {
                "word": "mourning",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "very sad",
                    "vi": "rất buồn"
                },
                "examples": [
                    {
                        "en": "mournful eyes",
                        "vi": "đôi mắt thê lương"
                    },
                    {
                        "en": "mournful music",
                        "vi": "nhạc buồn"
                    },
                    {
                        "en": "I couldn't bear the mournful look on her face.",
                        "vi": "Tôi không thể chịu được vẻ mặt thê lương của cô ấy."
                    }
                ]
            }
        ]
    },
    {
        "id": "460dde936b5d45d29a72d12199983542",
        "word": "pine",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/paɪn/",
            "us": "/paɪn/"
        },
        "nearby": [
            {
                "word": "pin down",
                "pos": "phrasal verb"
            },
            {
                "word": "pine",
                "pos": "noun"
            },
            {
                "word": "pine",
                "pos": "verb"
            },
            {
                "word": "pineal",
                "pos": "noun"
            },
            {
                "word": "pineapple",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to become very sad because somebody has died or gone away",
                    "vi": "trở nên rất buồn vì ai đó đã chết hoặc ra đi"
                },
                "examples": [
                    {
                        "en": "She pined for months after he'd gone.",
                        "vi": "Cô ấy đã trăn trở trong nhiều tháng sau khi anh ấy đi."
                    },
                    {
                        "en": "The Major’s dog pined badly when her master died.",
                        "vi": "Con chó của Thiếu tá bị thương nặng khi chủ của cô qua đời."
                    }
                ]
            }
        ]
    },
    {
        "id": "1012f941cb7e4d68885d8e1c9a8bad32",
        "word": "plaintive",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpleɪntɪv/",
            "us": "/ˈpleɪntɪv/"
        },
        "nearby": [
            {
                "word": "plain text",
                "pos": "noun"
            },
            {
                "word": "plaintiff",
                "pos": "noun"
            },
            {
                "word": "plaintive",
                "pos": "adjective"
            },
            {
                "word": "plaintively",
                "pos": "adverb"
            },
            {
                "word": "plait",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "sounding sad, especially in a weak, complaining way",
                    "vi": "nghe có vẻ buồn, đặc biệt là một cách yếu ớt, phàn nàn"
                },
                "examples": [
                    {
                        "en": "a plaintive cry/voice",
                        "vi": "một tiếng kêu / giọng ai oán"
                    }
                ]
            }
        ]
    },
    {
        "id": "426771de533949209738e64d2f253e98",
        "word": "poignancy",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpɔɪnjənsi/",
            "us": "/ˈpɔɪnjənsi/"
        },
        "nearby": [
            {
                "word": "pogrom",
                "pos": "noun"
            },
            {
                "word": "The Pogues",
                "pos": ""
            },
            {
                "word": "poignancy",
                "pos": "noun"
            },
            {
                "word": "poignant",
                "pos": "adjective"
            },
            {
                "word": "poignantly",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the fact of having a strong effect on your feelings, especially in a way that makes you feel sad",
                    "vi": "thực tế là có ảnh hưởng mạnh mẽ đến cảm xúc của bạn, đặc biệt là theo cách khiến bạn cảm thấy buồn"
                },
                "examples": [
                    {
                        "en": "the poignancy of parting and separation",
                        "vi": "sự cay đắng của sự chia tay và chia ly"
                    },
                    {
                        "en": "Of particular poignancy was the photograph of their son with his sisters, taken the day before he died.",
                        "vi": "Đặc biệt đáng buồn là bức ảnh con trai của họ với các chị gái, được chụp một ngày trước khi anh qua đời."
                    }
                ]
            }
        ]
    },
    {
        "id": "2124746be44f44129120f25405ced4fa",
        "word": "poignant",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpɔɪnjənt/",
            "us": "/ˈpɔɪnjənt/"
        },
        "nearby": [
            {
                "word": "The Pogues",
                "pos": ""
            },
            {
                "word": "poignancy",
                "pos": "noun"
            },
            {
                "word": "poignant",
                "pos": "adjective"
            },
            {
                "word": "poignantly",
                "pos": "adverb"
            },
            {
                "word": "poinsettia",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "having a strong effect on your feelings, especially in a way that makes you feel sad",
                    "vi": "có ảnh hưởng mạnh mẽ đến cảm xúc của bạn, đặc biệt là theo cách khiến bạn cảm thấy buồn"
                },
                "examples": [
                    {
                        "en": "a poignant image/moment/memory, etc.",
                        "vi": "một hình ảnh / khoảnh khắc / kỷ niệm sâu sắc, v.v."
                    },
                    {
                        "en": "Her face was a poignant reminder of the passing of time.",
                        "vi": "Khuôn mặt của cô ấy là một lời nhắc nhở sâu sắc về thời gian đã trôi qua."
                    }
                ]
            }
        ]
    }
]