[
    {
        "id": "1b889c1220124596ba1fde71f943ca47",
        "word": "captain",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈkæptɪn/",
            "us": "/ˈkæptɪn/"
        },
        "nearby": [
            {
                "word": "capsule",
                "pos": "noun"
            },
            {
                "word": "Capt.",
                "pos": "abbreviation"
            },
            {
                "word": "captain",
                "pos": "noun"
            },
            {
                "word": "captain",
                "pos": "verb"
            },
            {
                "word": "Captain Beefheart",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the person in charge of a ship or commercial aircraft",
                    "vi": "người phụ trách tàu thủy hoặc máy bay thương mại"
                },
                "examples": [
                    {
                        "en": "Captain Cook",
                        "vi": "Bếp trưởng"
                    },
                    {
                        "en": "The captain gave the order to abandon ship.",
                        "vi": "Thuyền trưởng ra lệnh bỏ tàu."
                    },
                    {
                        "en": "The captain of the ship invited them to dine at his table.",
                        "vi": "Thuyền trưởng của con tàu mời họ dùng bữa tại bàn của mình."
                    },
                    {
                        "en": "The captain of the plane was already announcing our arrival.",
                        "vi": "Cơ trưởng của máy bay đã thông báo về sự xuất hiện của chúng tôi."
                    },
                    {
                        "en": "Her husband had been a ship's captain.",
                        "vi": "Chồng cô đã từng là thuyền trưởng của một con tàu."
                    },
                    {
                        "en": "Captain Jones and her co-pilot",
                        "vi": "Cơ trưởng Jones và phi công phụ của cô ấy"
                    }
                ]
            },
            {
                "define": {
                    "en": "an officer of fairly high rank in the navy, the army and the US air force",
                    "vi": "một sĩ quan có cấp bậc khá cao trong hải quân, lục quân và không quân Hoa Kỳ"
                },
                "examples": [
                    {
                        "en": "Captain Lance Price",
                        "vi": "Giá thuyền trưởng Lance"
                    },
                    {
                        "en": "She has since been promoted to the rank of captain.",
                        "vi": "Cô ấy đã được thăng cấp lên cấp đội trưởng."
                    },
                    {
                        "en": "Her father had been a captain in the army.",
                        "vi": "Cha cô từng là đại úy trong quân đội."
                    }
                ]
            },
            {
                "define": {
                    "en": "the leader of a group of people, especially a sports team",
                    "vi": "lãnh đạo của một nhóm người, đặc biệt là một đội thể thao"
                },
                "examples": [
                    {
                        "en": "She's a former captain of the English national team.",
                        "vi": "Cô ấy là cựu đội trưởng của đội tuyển quốc gia Anh."
                    },
                    {
                        "en": "He has just been made team captain.",
                        "vi": "Anh ấy vừa được làm đội trưởng đội."
                    },
                    {
                        "en": "The appointment of the former England captain as their new manager is bound to boost morale.",
                        "vi": "Việc bổ nhiệm cựu đội trưởng tuyển Anh làm tân HLV trưởng của họ chắc chắn sẽ thúc đẩy tinh thần."
                    }
                ]
            },
            {
                "define": {
                    "en": "an officer of high rank in a US police or fire department",
                    "vi": "một sĩ quan cấp cao trong cảnh sát hoặc sở cứu hỏa Hoa Kỳ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "9107cb1e2f3f4302af04ed971f260f9f",
        "word": "the armed forces",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ði ˌɑːmd ˈfɔːsɪz/",
            "us": "/ði ˌɑːrmd ˈfɔːrsɪz/"
        },
        "nearby": [
            {
                "word": "armchair",
                "pos": "adjective"
            },
            {
                "word": "armed",
                "pos": "adjective"
            },
            {
                "word": "the armed forces",
                "pos": "noun"
            },
            {
                "word": "Armenia",
                "pos": "noun"
            },
            {
                "word": "Armenian",
                "pos": "noun, adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a country’s army, navy and air force",
                    "vi": "quân đội, hải quân và không quân của một quốc gia"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "bf5abd05b43e4d779016dce3e508068f",
        "word": "command",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/kəˈmɑːnd/",
            "us": "/kəˈmænd/"
        },
        "nearby": [
            {
                "word": "comma",
                "pos": "noun"
            },
            {
                "word": "command",
                "pos": "noun"
            },
            {
                "word": "command",
                "pos": "verb"
            },
            {
                "word": "commandant",
                "pos": "noun"
            },
            {
                "word": "command-driven",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to tell somebody to do something",
                    "vi": "bảo ai đó làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "command somebody to do something He commanded his men to retreat.",
                        "vi": "ra lệnh cho ai đó làm điều gì đó. Ông ra lệnh cho người của mình rút lui."
                    },
                    {
                        "en": "command something She commanded the release of the prisoners.",
                        "vi": "ra lệnh gì đó Cô ấy đã ra lệnh thả các tù nhân."
                    },
                    {
                        "en": "command (somebody) + speech ‘Come here!’ he commanded (them).",
                        "vi": "lệnh (ai đó) + bài phát biểu 'Đến đây!' ông đã chỉ huy (họ)."
                    },
                    {
                        "en": "‘Get back to your room,’ she commanded.",
                        "vi": "Trở lại phòng của bạn, cô ra lệnh."
                    },
                    {
                        "en": "command that… (formal) The commission intervened and commanded that work on the building cease.",
                        "vi": "ra lệnh rằng… (chính thức) Ủy ban đã can thiệp và yêu cầu công việc đó trên tòa nhà ngừng lại."
                    },
                    {
                        "en": "(British English also) The commission commanded that work on the building should cease.",
                        "vi": "(Tiếng Anh cũng là tiếng Anh) Ủy ban đã ra lệnh rằng công việc trên tòa nhà phải dừng lại."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be in charge of a group of people in the army, navy, etc.",
                    "vi": "phụ trách một nhóm người trong quân đội, hải quân, v.v."
                },
                "examples": [
                    {
                        "en": "In March 1942 he was appointed to command US naval forces in Europe",
                        "vi": "Tháng 3 năm 1942, ông được bổ nhiệm chỉ huy lực lượng hải quân Hoa Kỳ ở Châu Âu"
                    },
                    {
                        "en": "The troops were commanded by General Haig.",
                        "vi": "Quân đội do Tướng Haig chỉ huy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to deserve and get something because of the special qualities you have",
                    "vi": "xứng đáng và nhận được điều gì đó vì những phẩm chất đặc biệt mà bạn có"
                },
                "examples": [
                    {
                        "en": "to command sympathy/support",
                        "vi": "ra lệnh cho sự cảm thông / hỗ trợ"
                    },
                    {
                        "en": "She was able to command the respect of the class.",
                        "vi": "Cô ấy đã có thể chỉ huy sự tôn trọng của cả lớp."
                    },
                    {
                        "en": "The headlines commanded her attention.",
                        "vi": "Các tiêu đề thu hút sự chú ý của cô ấy."
                    },
                    {
                        "en": "As a top lawyer, he can expect to command a six-figure salary.",
                        "vi": "Là một luật sư hàng đầu, anh ta có thể mong đợi mức lương sáu con số."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be in a position from where you can see or control something",
                    "vi": "ở một vị trí mà từ đó bạn có thể nhìn thấy hoặc kiểm soát một cái gì đó"
                },
                "examples": [
                    {
                        "en": "The hotel commands a fine view of the valley.",
                        "vi": "Khách sạn có tầm nhìn đẹp ra thung lũng."
                    },
                    {
                        "en": "They built a castle commanding the river crossing.",
                        "vi": "Họ xây một lâu đài chỉ huy việc vượt sông."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have control of something; to have something available for use",
                    "vi": "có quyền kiểm soát một cái gì đó; để có một cái gì đó có sẵn để sử dụng"
                },
                "examples": [
                    {
                        "en": "The party was no longer able to command a majority in Parliament.",
                        "vi": "Đảng đã không còn có thể chỉ huy đa số trong Quốc hội."
                    },
                    {
                        "en": "the power and finances commanded by the police",
                        "vi": "quyền lực và tài chính do cảnh sát chỉ huy"
                    }
                ]
            }
        ]
    },
    {
        "id": "3b6094d47472455db56dd7b82b840c2d",
        "word": "commander",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/kəˈmɑːndə(r)/",
            "us": "/kəˈmændər/"
        },
        "nearby": [
            {
                "word": "command economy",
                "pos": "noun"
            },
            {
                "word": "commandeer",
                "pos": "verb"
            },
            {
                "word": "commander",
                "pos": "noun"
            },
            {
                "word": "commander-in-chief",
                "pos": "noun"
            },
            {
                "word": "commanding",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who is in charge of something, especially an officer in charge of a particular group of soldiers or a military operation",
                    "vi": "một người phụ trách một việc gì đó, đặc biệt là một sĩ quan phụ trách một nhóm binh lính cụ thể hoặc một hoạt động quân sự"
                },
                "examples": [
                    {
                        "en": "military/allied/field/flight commanders",
                        "vi": "chỉ huy quân sự / đồng minh / lĩnh vực / chuyến bay"
                    },
                    {
                        "en": "the commander of the expedition",
                        "vi": "chỉ huy của cuộc thám hiểm"
                    },
                    {
                        "en": "General Eisenhower was Supreme Allied Commander in Western Europe.",
                        "vi": "Tướng Eisenhower là Tư lệnh Đồng minh Tối cao ở Tây Âu."
                    },
                    {
                        "en": "the commander of US forces in Iraq",
                        "vi": "chỉ huy lực lượng Hoa Kỳ ở Iraq"
                    }
                ]
            },
            {
                "define": {
                    "en": "an officer of fairly high rank in the British or American navy",
                    "vi": "một sĩ quan có cấp bậc khá cao trong hải quân Anh hoặc Mỹ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "(in England) a London police officer of high rank",
                    "vi": "(ở Anh) một cảnh sát London cấp cao"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "448c5422318d498b805b35c92cac23eb",
        "word": "deserter",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/dɪˈzɜːtə(r)/",
            "us": "/dɪˈzɜːrtər/"
        },
        "nearby": [
            {
                "word": "desert boot",
                "pos": "noun"
            },
            {
                "word": "deserted",
                "pos": "adjective"
            },
            {
                "word": "deserter",
                "pos": "noun"
            },
            {
                "word": "desertification",
                "pos": "noun"
            },
            {
                "word": "desertion",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who leaves the army, navy, etc. without permission",
                    "vi": "một người rời khỏi quân đội, hải quân, v.v. mà không được phép"
                },
                "examples": [
                    {
                        "en": "He was convicted of hiding deserters.",
                        "vi": "Anh ta bị kết tội che giấu những kẻ đào ngũ."
                    }
                ]
            }
        ]
    },
    {
        "id": "e27b26e94e7a4e7097e2a69a82eff205",
        "word": "rank",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ræŋk/",
            "us": "/ræŋk/"
        },
        "nearby": [
            {
                "word": "rangy",
                "pos": "adjective"
            },
            {
                "word": "rani",
                "pos": "noun"
            },
            {
                "word": "rank",
                "pos": "noun"
            },
            {
                "word": "J Arthur Rank",
                "pos": ""
            },
            {
                "word": "rank",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the position, especially a high position, that somebody has in a particular organization, society, etc.",
                    "vi": "vị trí, đặc biệt là vị trí cao, mà ai đó có trong một tổ chức, xã hội cụ thể, v.v."
                },
                "examples": [
                    {
                        "en": "She was not used to mixing with people of high social rank.",
                        "vi": "Cô không quen hòa mình với những người có địa vị cao trong xã hội."
                    },
                    {
                        "en": "He rose through the ranks to become managing director.",
                        "vi": "Ông đã vượt qua các cấp bậc để trở thành giám đốc điều hành."
                    },
                    {
                        "en": "Within months she was elevated to ministerial rank.",
                        "vi": "Trong vòng vài tháng, cô đã được nâng lên cấp bộ trưởng."
                    },
                    {
                        "en": "in rank Promotion will mean that I’m immediately above him in rank.",
                        "vi": "thăng hạng có nghĩa là tôi ngay lập tức xếp trên anh ta về thứ hạng."
                    },
                    {
                        "en": "rank of something Barons are the lowest rank of the nobility.",
                        "vi": "cấp bậc của một thứ gì đó Nam tước là cấp bậc thấp nhất của giới quý tộc."
                    }
                ]
            },
            {
                "define": {
                    "en": "the position that somebody has in the army, navy, police, etc.",
                    "vi": "vị trí mà ai đó có trong quân đội, hải quân, cảnh sát, v.v."
                },
                "examples": [
                    {
                        "en": "rank of something He was soon promoted to the rank of captain.",
                        "vi": "cấp bậc của một cái gì đó Ông đã sớm được thăng cấp bậc đại đội trưởng."
                    },
                    {
                        "en": "He rose steadily through the ranks and retired as a lieutenant-colonel.",
                        "vi": "Ông thăng tiến đều đặn qua các cấp bậc và nghỉ hưu với quân hàm trung tá."
                    },
                    {
                        "en": "officers of junior/senior rank",
                        "vi": "sĩ quan cấp tá / cấp cao"
                    },
                    {
                        "en": "officers and other ranks (= people who are not officers)",
                        "vi": "sĩ quan và các cấp bậc khác (= những người không phải là sĩ quan)"
                    },
                    {
                        "en": "The colonel was stripped of his rank (= was given a lower position, especially as a punishment).",
                        "vi": "Đại tá bị tước quân hàm (= được trao một chức vụ thấp hơn, đặc biệt là như một hình phạt)."
                    },
                    {
                        "en": "in rank a military commander similar in rank to a modern general",
                        "vi": "trong cấp bậc chỉ huy quân sự tương tự như cấp bậc của một vị tướng hiện đại"
                    }
                ]
            },
            {
                "define": {
                    "en": "the position of ordinary soldiers rather than officers; the army",
                    "vi": "vị trí của những người lính bình thường hơn là sĩ quan; quân đội"
                },
                "examples": [
                    {
                        "en": "He served in the ranks for most of the war.",
                        "vi": "Ông đã phục vụ trong hàng ngũ trong hầu hết thời gian của cuộc chiến."
                    },
                    {
                        "en": "He rose from the ranks (= from being an ordinary soldier) to become a warrant officer.",
                        "vi": "Anh ta đã vượt lên từ hàng ngũ (= từ một người lính bình thường) để trở thành một sĩ quan cảnh sát."
                    },
                    {
                        "en": "a campaign to attract more women into the military ranks",
                        "vi": "một chiến dịch thu hút nhiều phụ nữ hơn vào hàng ngũ quân đội"
                    }
                ]
            },
            {
                "define": {
                    "en": "the degree to which somebody/something is of high quality",
                    "vi": "mức độ mà ai đó / cái gì đó có chất lượng cao"
                },
                "examples": [
                    {
                        "en": "a painter of the first rank",
                        "vi": "một họa sĩ của hạng nhất"
                    },
                    {
                        "en": "Britain is no longer in the front rank of world powers.",
                        "vi": "Nước Anh không còn ở vị trí hàng đầu của các cường quốc trên thế giới."
                    },
                    {
                        "en": "The findings are arranged in rank order according to performance.",
                        "vi": "Các phát hiện được sắp xếp theo thứ tự xếp hạng theo hiệu suất."
                    }
                ]
            },
            {
                "define": {
                    "en": "the members of a particular group or organization",
                    "vi": "các thành viên của một nhóm hoặc tổ chức cụ thể"
                },
                "examples": [
                    {
                        "en": "We have a number of international players in our ranks.",
                        "vi": "Chúng tôi có một số tuyển thủ quốc tế trong hàng ngũ của mình."
                    },
                    {
                        "en": "At 50, he was forced to join the ranks of the unemployed.",
                        "vi": "Ở tuổi 50, ông buộc phải gia nhập hàng ngũ những người thất nghiệp."
                    },
                    {
                        "en": "There were serious divisions within the party's own ranks.",
                        "vi": "Đã có sự chia rẽ nghiêm trọng trong hàng ngũ của đảng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a line or row of soldiers, police, etc. standing next to each other",
                    "vi": "một hàng hoặc hàng lính, cảnh sát, v.v. đứng cạnh nhau"
                },
                "examples": [
                    {
                        "en": "They watched as ranks of marching infantry passed the window.",
                        "vi": "Họ quan sát hàng ngũ bộ binh hành quân đi qua cửa sổ."
                    },
                    {
                        "en": "They fired at random into the enemy ranks.",
                        "vi": "Họ bắn ngẫu nhiên vào hàng ngũ đối phương."
                    }
                ]
            },
            {
                "define": {
                    "en": "a line or row of people or things",
                    "vi": "một dòng hoặc một hàng người hoặc sự vật"
                },
                "examples": [
                    {
                        "en": "massed ranks of spectators",
                        "vi": "hàng ngũ khán giả đông đảo"
                    },
                    {
                        "en": "The trees grew in serried ranks (= very closely together).",
                        "vi": "Các cây mọc thành hàng ngang (= rất gần nhau)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a number that gives the position of a member of a set of numbers",
                    "vi": "một số cung cấp vị trí của một thành viên của một tập hợp các số"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to fail to remain in line",
                    "vi": "không thể xếp hàng"
                },
                "examples": [
                    {
                        "en": "The police broke ranks and started hitting people with their batons.",
                        "vi": "Cảnh sát đã phá vỡ hàng ngũ và bắt đầu đánh mọi người bằng dùi cui của họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to refuse to support the group or the organization of which they are members",
                    "vi": "từ chối hỗ trợ nhóm hoặc tổ chức mà họ là thành viên"
                },
                "examples": [
                    {
                        "en": "Large numbers of MPs felt compelled to break ranks over the issue.",
                        "vi": "Một số lượng lớn các nghị sĩ cảm thấy buộc phải phá bỏ cấp bậc vì vấn đề này."
                    },
                    {
                        "en": "He broke ranks with his fellow Republicans and opposed the war.",
                        "vi": "Anh ta đã phá bỏ hàng ngũ với những người bạn thuộc Đảng Cộng hòa của mình và phản đối chiến tranh."
                    }
                ]
            },
            {
                "define": {
                    "en": "if a group of people close ranks, they work closely together to defend themselves, especially when they are being criticized",
                    "vi": "nếu một nhóm người gần gũi với nhau, họ hợp tác chặt chẽ với nhau để bảo vệ mình, đặc biệt là khi họ đang bị chỉ trích"
                },
                "examples": [
                    {
                        "en": "It's not unusual for the police to close ranks when one of their officers is being investigated.",
                        "vi": "Không có gì lạ khi cảnh sát đóng quân khi một trong những sĩ quan của họ đang bị điều tra."
                    }
                ]
            },
            {
                "define": {
                    "en": "if soldiers close ranks, they move closer together in order to defend themselves",
                    "vi": "nếu binh lính đóng hàng ngũ, họ tiến lại gần nhau hơn để tự vệ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to make use of your place or status in society or at work to make somebody do what you want",
                    "vi": "để sử dụng vị trí hoặc địa vị của bạn trong xã hội hoặc tại nơi làm việc để khiến ai đó làm những gì bạn muốn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "3ed4bf3872974db1bc68404576e1308c",
        "word": "recruit",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/rɪˈkruːt/",
            "us": "/rɪˈkruːt/"
        },
        "nearby": [
            {
                "word": "recrudescence",
                "pos": "noun"
            },
            {
                "word": "recrudescent",
                "pos": "adjective"
            },
            {
                "word": "recruit",
                "pos": "verb"
            },
            {
                "word": "recruit",
                "pos": "noun"
            },
            {
                "word": "recruiter",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to find new people to join a company, an organization, the armed forces, etc.",
                    "vi": "để tìm những người mới tham gia vào một công ty, một tổ chức, lực lượng vũ trang, v.v."
                },
                "examples": [
                    {
                        "en": "recruit (somebody) We are trying to recruit officers from more diverse backgrounds.",
                        "vi": "tuyển dụng (ai đó) Chúng tôi đang cố gắng tuyển dụng các sĩ quan từ nhiều nguồn gốc khác nhau."
                    },
                    {
                        "en": "He's responsible for recruiting at all levels.",
                        "vi": "Anh ấy chịu trách nhiệm tuyển dụng ở tất cả các cấp."
                    },
                    {
                        "en": "recruit somebody to something They recruited several new members to the club.",
                        "vi": "tuyển dụng ai đó vào một cái gì đó Họ đã tuyển dụng một số thành viên mới vào câu lạc bộ."
                    },
                    {
                        "en": "recruit somebody to do something They recruited more staff to deal with the complaints.",
                        "vi": "tuyển dụng ai đó làm việc gì đó Họ tuyển thêm nhân viên để giải quyết các khiếu nại."
                    }
                ]
            },
            {
                "define": {
                    "en": "to persuade somebody to do something, especially to help you",
                    "vi": "thuyết phục ai đó làm điều gì đó, đặc biệt là giúp bạn"
                },
                "examples": [
                    {
                        "en": "We were recruited to help peel the vegetables.",
                        "vi": "Chúng tôi được tuyển dụng để giúp gọt rau."
                    }
                ]
            },
            {
                "define": {
                    "en": "to form a new army, team, etc. by persuading new people to join it",
                    "vi": "để thành lập một đội quân, đội mới, v.v. bằng cách thuyết phục những người mới tham gia"
                },
                "examples": [
                    {
                        "en": "to recruit a task force",
                        "vi": "tuyển dụng một đội đặc nhiệm"
                    }
                ]
            }
        ]
    },
    {
        "id": "5e1d9f50e7d44ca9a1a96688fee6c178",
        "word": "recruit",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/rɪˈkruːt/",
            "us": "/rɪˈkruːt/"
        },
        "nearby": [
            {
                "word": "recrudescent",
                "pos": "adjective"
            },
            {
                "word": "recruit",
                "pos": "verb"
            },
            {
                "word": "recruit",
                "pos": "noun"
            },
            {
                "word": "recruiter",
                "pos": "noun"
            },
            {
                "word": "recruitment",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who has recently joined the armed forces or the police",
                    "vi": "một người gần đây đã tham gia lực lượng vũ trang hoặc cảnh sát"
                },
                "examples": [
                    {
                        "en": "the training of new recruits",
                        "vi": "đào tạo tân binh"
                    },
                    {
                        "en": "He spoke of us scornfully as raw recruits (= people without training or experience).",
                        "vi": "Anh ta khinh bỉ nói về chúng tôi như những tân binh thô sơ (= những người không được đào tạo hoặc kinh nghiệm)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who joins an organization, a company, etc.",
                    "vi": "một người tham gia vào một tổ chức, một công ty, v.v."
                },
                "examples": [
                    {
                        "en": "They are stepping up attempts to attract new recruits to the nursing profession.",
                        "vi": "Họ đang đẩy mạnh nỗ lực thu hút những người mới tuyển dụng vào nghề điều dưỡng."
                    }
                ]
            }
        ]
    },
    {
        "id": "cfb37021ab38463d97729a7e828d056e",
        "word": "service",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈsɜːvɪs/",
            "us": "/ˈsɜːrvɪs/"
        },
        "nearby": [
            {
                "word": "servery",
                "pos": "noun"
            },
            {
                "word": "serve up",
                "pos": "phrasal verb"
            },
            {
                "word": "service",
                "pos": "noun"
            },
            {
                "word": "service",
                "pos": "verb"
            },
            {
                "word": "serviceable",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a system that provides something that the public needs, organized by the government or a private company",
                    "vi": "một hệ thống cung cấp thứ gì đó mà công chúng cần, được tổ chức bởi chính phủ hoặc một công ty tư nhân"
                },
                "examples": [
                    {
                        "en": "the ambulance/bus/postal service",
                        "vi": "xe cứu thương / xe buýt / dịch vụ bưu điện"
                    },
                    {
                        "en": "The government aims to improve public services, especially education.",
                        "vi": "Chính phủ đặt mục tiêu cải thiện các dịch vụ công, đặc biệt là giáo dục."
                    },
                    {
                        "en": "Essential services (= the supply of water, gas, electricity) will be maintained.",
                        "vi": "Các dịch vụ thiết yếu (= cung cấp nước, khí đốt, điện) sẽ được duy trì."
                    },
                    {
                        "en": "Councillors have called for better provision of services for young people.",
                        "vi": "Các ủy viên hội đồng đã kêu gọi cung cấp các dịch vụ tốt hơn cho những người trẻ tuổi."
                    },
                    {
                        "en": "The charity provides a vital service to the local community.",
                        "vi": "Tổ chức từ thiện cung cấp một dịch vụ quan trọng cho cộng đồng địa phương."
                    }
                ]
            },
            {
                "define": {
                    "en": "an organization or a company that provides something for the public or does something for the government",
                    "vi": "một tổ chức hoặc một công ty cung cấp một cái gì đó cho công chúng hoặc làm một cái gì đó cho chính phủ"
                },
                "examples": [
                    {
                        "en": "the prison service",
                        "vi": "dịch vụ nhà tù"
                    },
                    {
                        "en": "the BBC World Service",
                        "vi": "Dịch vụ Thế giới của BBC"
                    },
                    {
                        "en": "the Foreign Service",
                        "vi": "Bộ Ngoại giao"
                    }
                ]
            },
            {
                "define": {
                    "en": "a business whose work involves doing something for customers but not producing goods; the work that such a business does",
                    "vi": "một doanh nghiệp có công việc liên quan đến việc làm một cái gì đó cho khách hàng nhưng không sản xuất hàng hóa; công việc mà một doanh nghiệp như vậy làm"
                },
                "examples": [
                    {
                        "en": "financial services",
                        "vi": "các dịch vụ tài chính"
                    },
                    {
                        "en": "the development of new goods and services",
                        "vi": "sự phát triển của hàng hóa và dịch vụ mới"
                    },
                    {
                        "en": "Smith's Catering Services (= a company) offers the best value.",
                        "vi": "Smith's Catering Services (= một công ty) mang lại giá trị tốt nhất."
                    },
                    {
                        "en": "We guarantee (an) excellent service.",
                        "vi": "Chúng tôi đảm bảo (một) dịch vụ xuất sắc."
                    },
                    {
                        "en": "We aim to provide a high-quality service.",
                        "vi": "Chúng tôi mong muốn cung cấp một dịch vụ chất lượng cao."
                    },
                    {
                        "en": "They offer an after-care service.",
                        "vi": "Họ cung cấp một dịch vụ chăm sóc sau."
                    },
                    {
                        "en": "Training the staff required to deliver the service remains a challenge.",
                        "vi": "Đào tạo nhân viên cần thiết để cung cấp dịch vụ vẫn là một thách thức."
                    },
                    {
                        "en": "We are working hard to improve the services that we provide.",
                        "vi": "Chúng tôi đang làm việc chăm chỉ để cải thiện các dịch vụ mà chúng tôi cung cấp."
                    },
                    {
                        "en": "The number of people using the service has fallen.",
                        "vi": "Số lượng người sử dụng dịch vụ đã giảm."
                    },
                    {
                        "en": "I am not willing to pay for a service I am not receiving.",
                        "vi": "Tôi không sẵn sàng trả tiền cho một dịch vụ mà tôi không nhận được."
                    },
                    {
                        "en": "We offer clients a broad range of services.",
                        "vi": "Chúng tôi cung cấp cho khách hàng một loạt các dịch vụ."
                    },
                    {
                        "en": "the service sector (= the part of the economy involved in this type of business)",
                        "vi": "khu vực dịch vụ (= một phần của nền kinh tế tham gia vào loại hình kinh doanh này)"
                    },
                    {
                        "en": "a service industry",
                        "vi": "một ngành dịch vụ"
                    }
                ]
            },
            {
                "define": {
                    "en": "the serving of customers in hotels, restaurants, and shops",
                    "vi": "phục vụ khách hàng trong khách sạn, nhà hàng và cửa hàng"
                },
                "examples": [
                    {
                        "en": "The food was good but the service was very slow.",
                        "vi": "Thức ăn ngon nhưng dịch vụ rất chậm."
                    },
                    {
                        "en": "I complained about the poor service.",
                        "vi": "Tôi phàn nàn về dịch vụ kém."
                    },
                    {
                        "en": "10% will be added to your bill for service.",
                        "vi": "10% sẽ được thêm vào hóa đơn dịch vụ của bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "the work that somebody does for an organization, etc., especially when it continues for a long time or is admired very much",
                    "vi": "công việc mà ai đó làm cho một tổ chức, v.v., đặc biệt là khi nó tiếp tục trong một thời gian dài hoặc được ngưỡng mộ rất nhiều"
                },
                "examples": [
                    {
                        "en": "service with something She has just celebrated 25 years' service with the company.",
                        "vi": "dịch vụ với một cái gì đó Cô ấy vừa kỷ niệm 25 năm phục vụ với công ty."
                    },
                    {
                        "en": "service to something He has retired after 30 years of dedicated service to the local community.",
                        "vi": "Ông đã nghỉ hưu sau 30 năm cống hiến cho cộng đồng địa phương."
                    },
                    {
                        "en": "She was presented with a long-service award after 40 years with the firm.",
                        "vi": "Cô đã được trao tặng giải thưởng phục vụ lâu dài sau 40 năm gắn bó với công ty."
                    },
                    {
                        "en": "The employees have good conditions of service.",
                        "vi": "Các nhân viên có điều kiện phục vụ tốt."
                    },
                    {
                        "en": "After retiring, she became involved in voluntary service in the local community.",
                        "vi": "Sau khi nghỉ hưu, cô đã tham gia hoạt động tình nguyện trong cộng đồng địa phương."
                    }
                ]
            },
            {
                "define": {
                    "en": "the army, the navy and the air force; the work done by people in them",
                    "vi": "lục quân, hải quân và không quân; công việc được thực hiện bởi những người trong họ"
                },
                "examples": [
                    {
                        "en": "Most of the boys went straight into the services.",
                        "vi": "Hầu hết các chàng trai đã đi thẳng vào các dịch vụ."
                    },
                    {
                        "en": "He saw service in North Africa.",
                        "vi": "Anh ấy đã thấy dịch vụ ở Bắc Phi."
                    },
                    {
                        "en": "After service in the US Army, he began his legal career.",
                        "vi": "Sau khi phục vụ trong Quân đội Hoa Kỳ, ông bắt đầu sự nghiệp luật sư của mình."
                    },
                    {
                        "en": "the country's military intelligence services",
                        "vi": "dịch vụ tình báo quân sự của đất nước"
                    },
                    {
                        "en": "a service family",
                        "vi": "một gia đình dịch vụ"
                    }
                ]
            },
            {
                "define": {
                    "en": "the use that you can get from a vehicle or machine; the state of being used",
                    "vi": "việc sử dụng mà bạn có thể nhận được từ một chiếc xe hoặc máy móc; trạng thái được sử dụng"
                },
                "examples": [
                    {
                        "en": "That computer gave us very good service.",
                        "vi": "Máy tính đó đã cung cấp cho chúng tôi dịch vụ rất tốt."
                    },
                    {
                        "en": "in service This bus is not in service.",
                        "vi": "đang hoạt động Xe buýt này không hoạt động."
                    },
                    {
                        "en": "out of service The ship will be taken out of service within two years.",
                        "vi": "hết hoạt động Con tàu sẽ ngừng hoạt động trong vòng hai năm."
                    }
                ]
            },
            {
                "define": {
                    "en": "an examination of a vehicle or machine followed by any work that is necessary to keep it operating well",
                    "vi": "kiểm tra phương tiện hoặc máy móc sau đó là bất kỳ công việc nào cần thiết để giữ cho nó hoạt động tốt"
                },
                "examples": [
                    {
                        "en": "a service engineer",
                        "vi": "một kỹ sư dịch vụ"
                    },
                    {
                        "en": "(British English) I had taken the car in for a service.",
                        "vi": "(Anh Anh) Tôi đã lấy xe hơi cho một dịch vụ."
                    },
                    {
                        "en": "(North American English) I had taken the car in for service.",
                        "vi": "(Tiếng Anh Bắc Mỹ) Tôi đã đưa xe vào dịch vụ."
                    }
                ]
            },
            {
                "define": {
                    "en": "the particular skills or help that a person is able to offer",
                    "vi": "các kỹ năng cụ thể hoặc sự giúp đỡ mà một người có thể cung cấp"
                },
                "examples": [
                    {
                        "en": "You need the services of a good lawyer.",
                        "vi": "Bạn cần dịch vụ của một luật sư giỏi."
                    },
                    {
                        "en": "service as somebody/something He offered his services as a driver.",
                        "vi": "dịch vụ như một ai đó / cái gì đó Anh ấy đã cung cấp dịch vụ của mình với tư cách là một người lái xe."
                    }
                ]
            },
            {
                "define": {
                    "en": "a religious ceremony",
                    "vi": "một buổi lễ tôn giáo"
                },
                "examples": [
                    {
                        "en": "a funeral/memorial service",
                        "vi": "một lễ tang / lễ tưởng niệm"
                    },
                    {
                        "en": "A memorial service will be held at St James's Church on Sunday.",
                        "vi": "Một buổi lễ tưởng niệm sẽ được tổ chức tại Nhà thờ St James vào Chủ nhật."
                    },
                    {
                        "en": "More than 100 people attended the service.",
                        "vi": "Hơn 100 người đã tham dự buổi lễ."
                    },
                    {
                        "en": "to go to morning/evening service",
                        "vi": "đi phục vụ buổi sáng / buổi tối"
                    }
                ]
            },
            {
                "define": {
                    "en": "a bus, train, etc. that goes regularly to a particular place at a particular time",
                    "vi": "xe buýt, xe lửa, v.v. thường xuyên đến một địa điểm cụ thể vào một thời điểm cụ thể"
                },
                "examples": [
                    {
                        "en": "the cancellation of the 10.15 service to Glasgow",
                        "vi": "việc hủy bỏ dịch vụ 10.15 đến Glasgow"
                    }
                ]
            },
            {
                "define": {
                    "en": "a place next to a motorway where you can stop for petrol, a meal, the toilets, etc.",
                    "vi": "một nơi bên cạnh đường cao tốc, nơi bạn có thể dừng lại để đổ xăng, ăn uống, nhà vệ sinh, v.v."
                },
                "examples": [
                    {
                        "en": "motorway services",
                        "vi": "dịch vụ đường cao tốc"
                    },
                    {
                        "en": "It's five miles to the next services.",
                        "vi": "Còn năm dặm nữa là đến các dịch vụ tiếp theo."
                    }
                ]
            },
            {
                "define": {
                    "en": "an act of hitting the ball in order to start playing; the way that you hit it",
                    "vi": "một hành động đánh bóng để bắt đầu chơi; cách bạn đánh nó"
                },
                "examples": [
                    {
                        "en": "It's your service (= your turn to start playing).",
                        "vi": "Đó là dịch vụ của bạn (= đến lượt bạn bắt đầu chơi)."
                    },
                    {
                        "en": "Her service has improved.",
                        "vi": "Dịch vụ của cô ấy đã được cải thiện."
                    }
                ]
            },
            {
                "define": {
                    "en": "a complete set of plates, dishes, etc. that match each other",
                    "vi": "một bộ đầy đủ các đĩa, đĩa, v.v. khớp với nhau"
                },
                "examples": [
                    {
                        "en": "a tea service (= cups, saucers, a teapot and plates, for serving tea)",
                        "vi": "một dịch vụ trà (= tách, đĩa, ấm trà và đĩa, để phục vụ trà)"
                    }
                ]
            },
            {
                "define": {
                    "en": "the state or position of being a servant",
                    "vi": "trạng thái hoặc vị trí của một người hầu"
                },
                "examples": [
                    {
                        "en": "to be in/go into service (= to be/become a servant)",
                        "vi": "được trong / đi phục vụ (= trở thành / trở thành người hầu)"
                    },
                    {
                        "en": "a job in domestic service",
                        "vi": "một công việc giúp việc gia đình"
                    }
                ]
            },
            {
                "define": {
                    "en": "the formal giving of an official document, etc. to somebody",
                    "vi": "việc trao chính thức một tài liệu chính thức, v.v. cho ai đó"
                },
                "examples": [
                    {
                        "en": "the service of a demand for payment",
                        "vi": "dịch vụ của một nhu cầu thanh toán"
                    }
                ]
            },
            {
                "define": {
                    "en": "completely available for somebody to use or to help somebody",
                    "vi": "hoàn toàn có sẵn để ai đó sử dụng hoặc để giúp ai đó"
                },
                "examples": [
                    {
                        "en": "Healthcare must be at the service of all who need it.",
                        "vi": "Chăm sóc sức khỏe phải phục vụ tất cả những ai cần."
                    },
                    {
                        "en": "(formal or humorous) If you need anything, I am at your service.",
                        "vi": "(trang trọng hoặc hài hước) Nếu bạn cần bất cứ điều gì, tôi sẽ phục vụ bạn."
                    },
                    {
                        "en": "The cabin staff are at your service throughout the flight.",
                        "vi": "Các nhân viên tiếp viên phục vụ bạn trong suốt chuyến bay."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be useful or helpful",
                    "vi": "hữu ích hoặc hữu ích"
                },
                "examples": [
                    {
                        "en": "Can I be of service to anyone?",
                        "vi": "Tôi có thể phục vụ bất cứ ai?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to do something that is helpful/not helpful to somebody",
                    "vi": "làm điều gì đó hữu ích / không hữu ích cho ai đó"
                },
                "examples": [
                    {
                        "en": "She was doing herself no service by remaining silent.",
                        "vi": "Cô ấy không phục vụ mình bằng cách giữ im lặng."
                    },
                    {
                        "en": "You have done us a great service.",
                        "vi": "Bạn đã làm cho chúng tôi một dịch vụ tuyệt vời."
                    }
                ]
            },
            {
                "define": {
                    "en": "to use somebody/something for a purpose that they were not trained or intended for because there is nobody or nothing else available",
                    "vi": "sử dụng ai đó / cái gì đó cho một mục đích mà họ không được đào tạo hoặc dự định vì không có ai hoặc không có gì khác"
                },
                "examples": [
                    {
                        "en": "Every type of boat was pressed into service to rescue passengers from the sinking ferry.",
                        "vi": "Các loại thuyền đều dồn dập tham gia cứu hộ hành khách thoát khỏi vụ chìm phà."
                    }
                ]
            }
        ]
    },
    {
        "id": "8f1ebcc4b100429c968ea73e07efd604",
        "word": "volunteer",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˌvɒlənˈtɪə(r)/",
            "us": "/ˌvɑːlənˈtɪr/"
        },
        "nearby": [
            {
                "word": "voluntary school",
                "pos": "noun"
            },
            {
                "word": "Voluntary Service Overseas",
                "pos": "noun"
            },
            {
                "word": "volunteer",
                "pos": "noun"
            },
            {
                "word": "volunteer",
                "pos": "verb"
            },
            {
                "word": "volunteerism",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who does a job without being paid for it",
                    "vi": "một người làm một công việc mà không được trả tiền cho nó"
                },
                "examples": [
                    {
                        "en": "Schools need volunteers to help children to read.",
                        "vi": "Các trường học cần tình nguyện viên để giúp trẻ em đọc."
                    },
                    {
                        "en": "She does volunteer work at an orphanage.",
                        "vi": "Cô ấy làm công việc tình nguyện tại một trại trẻ mồ côi."
                    },
                    {
                        "en": "volunteer for/with something She was a volunteer for the Red Cross before training as a nurse.",
                        "vi": "tình nguyện cho / với điều gì đó Cô ấy từng là tình nguyện viên cho Hội Chữ thập đỏ trước khi được đào tạo thành y tá."
                    },
                    {
                        "en": "Volunteers from various organizations are working to save the lives of the earthquake victims.",
                        "vi": "Các tình nguyện viên từ nhiều tổ chức khác nhau đang làm việc để cứu sống những nạn nhân của trận động đất."
                    },
                    {
                        "en": "a volunteer firefighter",
                        "vi": "một lính cứu hỏa tình nguyện"
                    },
                    {
                        "en": "volunteer helpers/carers",
                        "vi": "người giúp đỡ / chăm sóc tình nguyện"
                    },
                    {
                        "en": "The Centre is run by a group of dedicated volunteers.",
                        "vi": "Trung tâm được điều hành bởi một nhóm tình nguyện viên tận tụy."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who offers to do something without being forced to do it",
                    "vi": "một người đề nghị làm điều gì đó mà không bị buộc phải làm điều đó"
                },
                "examples": [
                    {
                        "en": "Are there any volunteers to help clear up?",
                        "vi": "Có tình nguyện viên nào giúp giải tỏa không?"
                    },
                    {
                        "en": "For my next trick, I'll need a volunteer from the audience.",
                        "vi": "Đối với thủ thuật tiếp theo của tôi, tôi sẽ cần một tình nguyện viên từ khán giả."
                    },
                    {
                        "en": "The company is looking for volunteers to take part in a trial.",
                        "vi": "Công ty đang tìm kiếm người tình nguyện tham gia thử việc."
                    },
                    {
                        "en": "Hundreds of volunteers have come forward to offer their help.",
                        "vi": "Hàng trăm tình nguyện viên đã đến để đề nghị sự giúp đỡ của họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who chooses to join the armed forces without being forced to join",
                    "vi": "một người chọn tham gia lực lượng vũ trang mà không bị buộc phải tham gia"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "bc861d74d6ca49c3ae9f3cbd75512270",
        "word": "volunteer",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/ˌvɒlənˈtɪə(r)/",
            "us": "/ˌvɑːlənˈtɪr/"
        },
        "nearby": [
            {
                "word": "Voluntary Service Overseas",
                "pos": "noun"
            },
            {
                "word": "volunteer",
                "pos": "noun"
            },
            {
                "word": "volunteer",
                "pos": "verb"
            },
            {
                "word": "volunteerism",
                "pos": "noun"
            },
            {
                "word": "the Volunteer Reserve Forces",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to offer to do something without being forced to do it or without getting paid for it",
                    "vi": "đề nghị làm điều gì đó mà không bị ép buộc hoặc không được trả tiền cho việc đó"
                },
                "examples": [
                    {
                        "en": "He has been volunteering for 11 years now.",
                        "vi": "Anh ấy đã làm tình nguyện viên được 11 năm rồi."
                    },
                    {
                        "en": "volunteer to do something Jill volunteered to organize a petition.",
                        "vi": "tình nguyện làm điều gì đó Jill tình nguyện tổ chức một cuộc thỉnh nguyện."
                    },
                    {
                        "en": "I volunteered to help clean up the beach.",
                        "vi": "Tôi tình nguyện giúp làm sạch bãi biển."
                    },
                    {
                        "en": "volunteer for something Several staff members volunteered for early retirement.",
                        "vi": "tình nguyện cho một cái gì đó Một số nhân viên đã tình nguyện nghỉ hưu sớm."
                    },
                    {
                        "en": "volunteer as something He volunteered as a translator for Spanish-speaking patients.",
                        "vi": "tình nguyện như một điều gì đó Anh ấy tình nguyện làm phiên dịch cho những bệnh nhân nói tiếng Tây Ban Nha."
                    },
                    {
                        "en": "volunteer something Workers volunteer their time, as no funds are available to pay professional staff.",
                        "vi": "tình nguyện điều gì đó Người lao động tình nguyện dành thời gian của họ, vì không có ngân quỹ để trả cho nhân viên chuyên nghiệp."
                    },
                    {
                        "en": "volunteer something as something He volunteered his services as a driver.",
                        "vi": "tình nguyện một cái gì đó như một cái gì đó Anh ấy tình nguyện phục vụ của mình với tư cách là một người lái xe."
                    },
                    {
                        "en": "volunteer something for something She has been volunteering her computer skills for the foundation.",
                        "vi": "tình nguyện một cái gì đó cho một cái gì đó Cô ấy đã và đang tình nguyện xây dựng kỹ năng máy tính của mình cho tổ chức."
                    }
                ]
            },
            {
                "define": {
                    "en": "to suggest something or tell somebody something without being asked",
                    "vi": "đề xuất điều gì đó hoặc nói với ai đó điều gì đó mà không bị hỏi"
                },
                "examples": [
                    {
                        "en": "volunteer something to volunteer advice",
                        "vi": "tình nguyện một cái gì đó để tình nguyện lời khuyên"
                    },
                    {
                        "en": "Nobody asked her, and she didn't volunteer any information.",
                        "vi": "Không ai hỏi cô ấy, và cô ấy không tình nguyện bất kỳ thông tin nào."
                    },
                    {
                        "en": "+ speech ‘I could lend you some books,’ he volunteered.",
                        "vi": "bài phát biểu 'Tôi có thể cho bạn mượn một số cuốn sách,' anh ấy tình nguyện."
                    }
                ]
            },
            {
                "define": {
                    "en": "to join the army, etc. without being forced to",
                    "vi": "gia nhập quân đội, v.v. mà không bị buộc phải"
                },
                "examples": [
                    {
                        "en": "He wasn't conscripted. He volunteered.",
                        "vi": "Anh ấy không phải nhập ngũ. Anh ấy tình nguyện."
                    },
                    {
                        "en": "volunteer for something to volunteer for military service",
                        "vi": "tình nguyện vì điều gì đó tình nguyện đi nghĩa vụ quân sự"
                    },
                    {
                        "en": "I volunteered for service in the Air Force.",
                        "vi": "Tôi tình nguyện phục vụ trong Lực lượng Không quân."
                    },
                    {
                        "en": "volunteer to do something More than a hundred thousand Irish men and women volunteered to serve in the British armed forces during World War II.",
                        "vi": "tình nguyện làm điều gì đó Hơn một trăm nghìn đàn ông và phụ nữ Ireland đã tình nguyện phục vụ trong các lực lượng vũ trang của Anh trong Thế chiến thứ hai."
                    }
                ]
            },
            {
                "define": {
                    "en": "to suggest somebody for a job or an activity, even though they may not want to do it",
                    "vi": "đề xuất ai đó cho một công việc hoặc một hoạt động, mặc dù họ có thể không muốn làm điều đó"
                },
                "examples": [
                    {
                        "en": "volunteer somebody (for/as something) They volunteered me for the job of interpreter.",
                        "vi": "tình nguyện ai đó (cho / như một cái gì đó) Họ tình nguyện cho tôi làm công việc thông dịch viên."
                    },
                    {
                        "en": "volunteer somebody to do something Her dad had volunteered her to help put away the equipment.",
                        "vi": "tình nguyện ai đó làm điều gì đó Bố cô ấy đã tình nguyện giúp cô ấy cất thiết bị."
                    }
                ]
            }
        ]
    },
    {
        "id": "8c75ddbdf6f149e98d7f286daeb7c351",
        "word": "active duty",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌæktɪv ˈdjuːti/",
            "us": "/ˌæktɪv ˈduːti/"
        },
        "nearby": [
            {
                "word": "active",
                "pos": "noun"
            },
            {
                "word": "active citizen",
                "pos": "noun"
            },
            {
                "word": "active duty",
                "pos": "noun"
            },
            {
                "word": "active list",
                "pos": "noun"
            },
            {
                "word": "actively",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "taking part in military action as a member of the armed forces",
                    "vi": "tham gia hành động quân sự với tư cách là thành viên của lực lượng vũ trang"
                },
                "examples": [
                    {
                        "en": "He has been treated in hospital and is returning to active duty.",
                        "vi": "Anh ấy đã được điều trị tại bệnh viện và đang trở lại nghĩa vụ."
                    },
                    {
                        "en": "on active duty He sustained serious injuries while on active duty.",
                        "vi": "đang tại ngũ Anh bị thương nặng khi đang tại ngũ."
                    }
                ]
            }
        ]
    },
    {
        "id": "d3a3383b4c904112a9a68aa7fde41f4e",
        "word": "active service",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌæktɪv ˈsɜːvɪs/",
            "us": "/ˌæktɪv ˈsɜːrvɪs/"
        },
        "nearby": [
            {
                "word": "active list",
                "pos": "noun"
            },
            {
                "word": "actively",
                "pos": "adverb"
            },
            {
                "word": "active service",
                "pos": "noun"
            },
            {
                "word": "activism",
                "pos": "noun"
            },
            {
                "word": "activist",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "taking part in military action as a member of the armed forces, especially during a war",
                    "vi": "tham gia hành động quân sự với tư cách là thành viên của lực lượng vũ trang, đặc biệt là trong chiến tranh"
                },
                "examples": [
                    {
                        "en": "on active service troops on active service",
                        "vi": "về quân nhân tại ngũ đang tại ngũ"
                    }
                ]
            }
        ]
    },
    {
        "id": "9d6d1b0c86c548c89ea63fb247863cde",
        "word": "colonel",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈkɜːnl/",
            "us": "/ˈkɜːrnl/"
        },
        "nearby": [
            {
                "word": "Colombian",
                "pos": "noun, adjective"
            },
            {
                "word": "colon",
                "pos": "noun"
            },
            {
                "word": "colonel",
                "pos": "noun"
            },
            {
                "word": "Colonel Blimp",
                "pos": "noun"
            },
            {
                "word": "Colonel Bogey",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an officer of high rank in the army, the marines, or the US air force",
                    "vi": "một sĩ quan cấp cao trong quân đội, thủy quân lục chiến hoặc lực lượng không quân Hoa Kỳ"
                },
                "examples": [
                    {
                        "en": "Colonel Jim Edge",
                        "vi": "Đại tá Jim Edge"
                    }
                ]
            }
        ]
    },
    {
        "id": "c15b4f38dc354b158a9f054ba2b6bdcb",
        "word": "general",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈdʒenrəl/",
            "us": "/ˈdʒenrəl/"
        },
        "nearby": [
            {
                "word": "genera",
                "pos": "noun"
            },
            {
                "word": "general",
                "pos": "adjective"
            },
            {
                "word": "general",
                "pos": "noun"
            },
            {
                "word": "general admission",
                "pos": "noun"
            },
            {
                "word": "General American",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an officer of very high rank in the army or (in the US) the air force; the officer with the highest rank in the marines",
                    "vi": "một sĩ quan có cấp bậc rất cao trong quân đội hoặc (ở Mỹ) lực lượng không quân; sĩ quan có cấp bậc cao nhất trong thủy quân lục chiến"
                },
                "examples": [
                    {
                        "en": "a four-star general",
                        "vi": "một vị tướng bốn sao"
                    },
                    {
                        "en": "General Tom Parker",
                        "vi": "Tướng Tom Parker"
                    },
                    {
                        "en": "Both generals had commanded units in that area.",
                        "vi": "Cả hai vị tướng đều đã chỉ huy các đơn vị trong khu vực đó."
                    }
                ]
            }
        ]
    },
    {
        "id": "25874db1d6584378a9fd3205349c0764",
        "word": "major",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈmeɪdʒə(r)/",
            "us": "/ˈmeɪdʒər/"
        },
        "nearby": [
            {
                "word": "majimbo",
                "pos": "noun"
            },
            {
                "word": "major",
                "pos": "adjective"
            },
            {
                "word": "major",
                "pos": "noun"
            },
            {
                "word": "major",
                "pos": "verb"
            },
            {
                "word": "major-domo",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an officer of fairly high rank in the army or the US air force",
                    "vi": "một sĩ quan có cấp bậc khá cao trong quân đội hoặc lực lượng không quân Hoa Kỳ"
                },
                "examples": [
                    {
                        "en": "Major Smith",
                        "vi": "Thiếu tá Smith"
                    },
                    {
                        "en": "He's a major in the US army.",
                        "vi": "Anh ta là một thiếu tá trong quân đội Hoa Kỳ."
                    }
                ]
            },
            {
                "define": {
                    "en": "the main subject or course of a student at college or university",
                    "vi": "môn học hoặc khóa học chính của một sinh viên tại trường cao đẳng hoặc đại học"
                },
                "examples": [
                    {
                        "en": "Her major is French.",
                        "vi": "Chuyên ngành của cô ấy là tiếng Pháp."
                    }
                ]
            },
            {
                "define": {
                    "en": "a student studying a particular subject as the main part of their course",
                    "vi": "một sinh viên nghiên cứu một chủ đề cụ thể như là phần chính của khóa học của họ"
                },
                "examples": [
                    {
                        "en": "She's a French major.",
                        "vi": "Cô ấy là một sinh viên chuyên ngành tiếng Pháp."
                    }
                ]
            },
            {
                "define": {
                    "en": "a major organization or competition",
                    "vi": "một tổ chức hoặc cuộc thi lớn"
                },
                "examples": [
                    {
                        "en": "The output of the big five oil majors has fallen in recent years.",
                        "vi": "Sản lượng của 5 công ty dầu mỏ lớn đã giảm trong những năm gần đây."
                    },
                    {
                        "en": "The greatest achievement in tennis is to win all four majors in a single year.",
                        "vi": "Thành tích lớn nhất của quần vợt là vô địch cả 4 chuyên ngành chỉ trong một năm."
                    }
                ]
            },
            {
                "define": {
                    "en": "the major leagues",
                    "vi": "các giải đấu lớn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "5f158b5d32c741519a95090a55436d5b",
        "word": "military police",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌmɪlətri pəˈliːs/",
            "us": "/ˌmɪləteri pəˈliːs/"
        },
        "nearby": [
            {
                "word": "the Military Cross",
                "pos": ""
            },
            {
                "word": "the Military Medal",
                "pos": ""
            },
            {
                "word": "military police",
                "pos": "noun"
            },
            {
                "word": "military service",
                "pos": "noun"
            },
            {
                "word": "militate",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the police force that is responsible for the army, navy, etc.",
                    "vi": "lực lượng cảnh sát đặc nhiệm lục quân, hải quân, v.v."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "889de2a3b146429591fd566b3cb972e1",
        "word": "servicewoman",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈsɜːvɪswʊmən/",
            "us": "/ˈsɜːrvɪswʊmən/"
        },
        "nearby": [
            {
                "word": "service road",
                "pos": "noun"
            },
            {
                "word": "service station",
                "pos": "noun"
            },
            {
                "word": "servicewoman",
                "pos": "noun"
            },
            {
                "word": "servicing",
                "pos": "noun"
            },
            {
                "word": "serviette",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a woman who is a member of the armed forces",
                    "vi": "một phụ nữ là thành viên của lực lượng vũ trang"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "8e515cac185d4fef800116925f4cfb75",
        "word": "station",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈsteɪʃn/",
            "us": "/ˈsteɪʃn/"
        },
        "nearby": [
            {
                "word": "static electricity",
                "pos": "noun"
            },
            {
                "word": "statin",
                "pos": "noun"
            },
            {
                "word": "station",
                "pos": "noun"
            },
            {
                "word": "station",
                "pos": "verb"
            },
            {
                "word": "station agent",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a place where trains stop so that passengers can get on and off; the buildings connected with this",
                    "vi": "nơi dừng tàu để hành khách lên xuống tàu; những tòa nhà kết nối với cái này"
                },
                "examples": [
                    {
                        "en": "the main station",
                        "vi": "nhà ga chính"
                    },
                    {
                        "en": "Euston Station",
                        "vi": "Ga Euston"
                    },
                    {
                        "en": "a train station",
                        "vi": "Một ga tàu"
                    },
                    {
                        "en": "(British English also) a railway station",
                        "vi": "(Anh cũng có tiếng Anh) ga đường sắt"
                    },
                    {
                        "en": "(British English) a tube/an underground station",
                        "vi": "(Tiếng Anh Anh) một ống / một ga tàu điện ngầm"
                    },
                    {
                        "en": "(North American English) a subway station",
                        "vi": "(Tiếng Anh Bắc Mỹ) ga tàu điện ngầm"
                    },
                    {
                        "en": "at a station I get off at the next station.",
                        "vi": "tại một ga tôi xuống ở ga tiếp theo."
                    }
                ]
            },
            {
                "define": {
                    "en": "a place where buses stop; the buildings connected with this",
                    "vi": "nơi dừng xe buýt; những tòa nhà kết nối với cái này"
                },
                "examples": [
                    {
                        "en": "We waited for him at the bus station.",
                        "vi": "Chúng tôi đợi anh ấy ở bến xe."
                    },
                    {
                        "en": "(British English also) a coach station",
                        "vi": "(Anh cũng có tiếng Anh) một trạm xe buýt"
                    },
                    {
                        "en": "Victoria Coach Station",
                        "vi": "Bến xe khách Victoria"
                    }
                ]
            },
            {
                "define": {
                    "en": "a place or building where a service is organized and provided or a special type of work is done",
                    "vi": "một địa điểm hoặc tòa nhà nơi dịch vụ được tổ chức và cung cấp hoặc một loại công việc đặc biệt được thực hiện"
                },
                "examples": [
                    {
                        "en": "Report the theft at the nearest police station.",
                        "vi": "Báo vụ trộm tại đồn cảnh sát gần nhất."
                    },
                    {
                        "en": "(British English) a petrol station",
                        "vi": "(Tiếng Anh Anh) một trạm xăng"
                    },
                    {
                        "en": "(North American English) a gas station",
                        "vi": "(Tiếng Anh Bắc Mỹ) một trạm xăng"
                    },
                    {
                        "en": "a pollution monitoring station",
                        "vi": "một trạm giám sát ô nhiễm"
                    },
                    {
                        "en": "an agricultural research station",
                        "vi": "một trạm nghiên cứu nông nghiệp"
                    }
                ]
            },
            {
                "define": {
                    "en": "a radio or television company and the programmes it broadcasts",
                    "vi": "một công ty phát thanh hoặc truyền hình và các chương trình mà nó phát sóng"
                },
                "examples": [
                    {
                        "en": "a local radio/television/TV station",
                        "vi": "đài phát thanh / truyền hình / truyền hình địa phương"
                    },
                    {
                        "en": "He tuned to another station.",
                        "vi": "Anh điều chỉnh sang một đài khác."
                    },
                    {
                        "en": "The station broadcasts 24 hours a day.",
                        "vi": "Đài phát sóng 24 giờ một ngày."
                    }
                ]
            },
            {
                "define": {
                    "en": "your social position",
                    "vi": "vị trí xã hội của bạn"
                },
                "examples": [
                    {
                        "en": "above your station She was definitely getting ideas above her station.",
                        "vi": "phía trên trạm của bạn Cô ấy chắc chắn đang lấy ý tưởng ở phía trên trạm của cô ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "a place where somebody has to wait and watch or be ready to do work if needed",
                    "vi": "một nơi mà ai đó phải đợi và xem hoặc sẵn sàng làm việc nếu cần"
                },
                "examples": [
                    {
                        "en": "You are not to leave your station without permission.",
                        "vi": "Bạn không được rời khỏi trạm của mình mà không có sự cho phép."
                    }
                ]
            },
            {
                "define": {
                    "en": "a large sheep or cattle farm in Australia or New Zealand",
                    "vi": "một trang trại cừu hoặc gia súc lớn ở Úc hoặc New Zealand"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a small base for the army or navy; the people living in it",
                    "vi": "một căn cứ nhỏ cho quân đội hoặc hải quân; những người sống trong đó"
                },
                "examples": [
                    {
                        "en": "a naval station",
                        "vi": "một trạm hải quân"
                    }
                ]
            },
            {
                "define": {
                    "en": "a situation in which people feel very anxious and there is a lot of confused activity, especially because there is a lot to do in a short period of time",
                    "vi": "một tình huống mà mọi người cảm thấy rất lo lắng và có rất nhiều hoạt động bối rối, đặc biệt là vì có rất nhiều việc phải làm trong một khoảng thời gian ngắn"
                },
                "examples": [
                    {
                        "en": "It was panic stations when the deadline was brought forward by a week.",
                        "vi": "Đó là các trạm hoảng loạn khi thời hạn được đưa ra trước một tuần."
                    }
                ]
            }
        ]
    },
    {
        "id": "badf374b6d774c058135ea07d25c2584",
        "word": "veteran",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈvetərən/",
            "us": "/ˈvetərən/"
        },
        "nearby": [
            {
                "word": "vet",
                "pos": "verb"
            },
            {
                "word": "vetch",
                "pos": "noun"
            },
            {
                "word": "veteran",
                "pos": "noun"
            },
            {
                "word": "veteran car",
                "pos": "noun"
            },
            {
                "word": "Veterans Day",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who has a lot of experience in a particular area or activity",
                    "vi": "một người có nhiều kinh nghiệm trong một lĩnh vực hoặc hoạt động cụ thể"
                },
                "examples": [
                    {
                        "en": "the veteran American actor, Clint Eastwood",
                        "vi": "diễn viên gạo cội người Mỹ, Clint Eastwood"
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who has been a soldier, sailor, etc. in a war",
                    "vi": "một người từng là quân nhân, thủy thủ, v.v. trong chiến tranh"
                },
                "examples": [
                    {
                        "en": "war veterans",
                        "vi": "những cựu chiến binh"
                    },
                    {
                        "en": "a veteran of the Spanish Civil War",
                        "vi": "một cựu chiến binh trong Nội chiến Tây Ban Nha"
                    }
                ]
            }
        ]
    },
    {
        "id": "eaca970597db4352b9f0be77187dd914",
        "word": "aide-de-camp",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌeɪd də ˈkɒ̃/",
            "us": "/ˌeɪd də ˈkæmp/"
        },
        "nearby": [
            {
                "word": "aid climbing",
                "pos": "noun"
            },
            {
                "word": "aide",
                "pos": "noun"
            },
            {
                "word": "aide-de-camp",
                "pos": "noun"
            },
            {
                "word": "aide-memoire",
                "pos": "noun"
            },
            {
                "word": "aiding",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an officer in the army or navy who helps a more senior officer",
                    "vi": "một sĩ quan trong quân đội hoặc hải quân giúp đỡ một sĩ quan cao cấp hơn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "fb5a356fc8b44f36b957e034639b8bc2",
        "word": "brigadier general",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌbrɪɡədɪə ˈdʒenrəl/",
            "us": "/ˌbrɪɡədɪr ˈdʒenrəl/"
        },
        "nearby": [
            {
                "word": "brigade",
                "pos": "noun"
            },
            {
                "word": "brigadier",
                "pos": "noun"
            },
            {
                "word": "brigadier general",
                "pos": "noun"
            },
            {
                "word": "brigand",
                "pos": "noun"
            },
            {
                "word": "bright",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an officer of high rank in the US army, air force or marines",
                    "vi": "một sĩ quan cấp cao trong quân đội, không quân hoặc thủy quân lục chiến Hoa Kỳ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "b37389face8146518da56cdde5b502e0",
        "word": "cashier",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/kæˈʃɪə(r)/",
            "us": "/kæˈʃɪr/"
        },
        "nearby": [
            {
                "word": "cash for questions",
                "pos": ""
            },
            {
                "word": "cashier",
                "pos": "noun"
            },
            {
                "word": "cashier",
                "pos": "verb"
            },
            {
                "word": "cashier's check",
                "pos": "noun"
            },
            {
                "word": "cash in",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to make somebody leave the army, navy, etc. because they have done something wrong",
                    "vi": "để khiến ai đó rời khỏi quân đội, hải quân, v.v. bởi vì họ đã làm điều gì đó sai trái"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "524f6651dbaa490d9baa770693ab80a5",
        "word": "corporal",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkɔːpərəl/",
            "us": "/ˈkɔːrpərəl/"
        },
        "nearby": [
            {
                "word": "Corp.",
                "pos": "abbreviation"
            },
            {
                "word": "corpora",
                "pos": "noun"
            },
            {
                "word": "corporal",
                "pos": "noun"
            },
            {
                "word": "corporal punishment",
                "pos": "noun"
            },
            {
                "word": "corporate",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a member of one of the lower ranks in the army, the marines or the British air force",
                    "vi": "thành viên của một trong các cấp bậc thấp hơn trong quân đội, thủy quân lục chiến hoặc lực lượng không quân Anh"
                },
                "examples": [
                    {
                        "en": "Corporal Smith",
                        "vi": "Hạ sĩ Smith"
                    }
                ]
            }
        ]
    },
    {
        "id": "8d7df06070c043488a23934bb4715573",
        "word": "corpsman",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkɔːmən/",
            "us": "/ˈkɔːrmən/"
        },
        "nearby": [
            {
                "word": "corps de ballet",
                "pos": "noun"
            },
            {
                "word": "corpse",
                "pos": "noun"
            },
            {
                "word": "corpsman",
                "pos": "noun"
            },
            {
                "word": "corpulence",
                "pos": "noun"
            },
            {
                "word": "corpulent",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a member of a military medical unit who is not an officer",
                    "vi": "thành viên của đơn vị quân y không phải là sĩ quan"
                },
                "examples": [
                    {
                        "en": "He enlisted in the Navy, trained as a hospital corpsman and was sent to the Pacific.",
                        "vi": "Anh gia nhập Hải quân, được đào tạo như một quân nhân bệnh viện và được gửi đến Thái Bình Dương."
                    }
                ]
            }
        ]
    },
    {
        "id": "d151a63d77f94158888b0466ccf0bf69",
        "word": "draft",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/drɑːft/",
            "us": "/dræft/"
        },
        "nearby": [
            {
                "word": "draconian",
                "pos": "adjective"
            },
            {
                "word": "Dracula",
                "pos": "noun"
            },
            {
                "word": "draft",
                "pos": "noun"
            },
            {
                "word": "draft",
                "pos": "verb"
            },
            {
                "word": "draft",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a rough written version of something that is not yet in its final form",
                    "vi": "một phiên bản viết thô của thứ gì đó vẫn chưa ở dạng cuối cùng"
                },
                "examples": [
                    {
                        "en": "This is only the first draft of my speech.",
                        "vi": "Đây chỉ là bản thảo đầu tiên của bài phát biểu của tôi."
                    },
                    {
                        "en": "I've made a rough draft of the letter.",
                        "vi": "Tôi đã làm một bản thảo thô của bức thư."
                    },
                    {
                        "en": "The final published version differs from earlier drafts in many key details.",
                        "vi": "Phiên bản cuối cùng được xuất bản khác với các bản nháp trước đó ở nhiều chi tiết chính."
                    },
                    {
                        "en": "the final draft (= the final version)",
                        "vi": "bản nháp cuối cùng (= phiên bản cuối cùng)"
                    },
                    {
                        "en": "a draft report/plan/bill/resolution",
                        "vi": "một dự thảo báo cáo / kế hoạch / hóa đơn / giải quyết"
                    },
                    {
                        "en": "a draft document/proposal",
                        "vi": "một tài liệu / đề xuất dự thảo"
                    },
                    {
                        "en": "the draft constitution/legislation/agreement",
                        "vi": "dự thảo hiến pháp / luật pháp / hiệp định"
                    },
                    {
                        "en": "The legislation is still in draft form.",
                        "vi": "Luật vẫn đang ở dạng dự thảo."
                    }
                ]
            },
            {
                "define": {
                    "en": "a written order to a bank to pay money to somebody",
                    "vi": "một văn bản yêu cầu ngân hàng trả tiền cho ai đó"
                },
                "examples": [
                    {
                        "en": "Payment must be made by bank draft drawn on a UK bank.",
                        "vi": "Thanh toán phải được thực hiện bằng hối phiếu ngân hàng được ký phát tại một ngân hàng ở Vương quốc Anh."
                    }
                ]
            },
            {
                "define": {
                    "en": "the practice of ordering people by law to join the armed forces",
                    "vi": "thực hành lệnh mọi người tham gia lực lượng vũ trang theo quy định của pháp luật"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a system in which professional teams in some sports choose players each year from among college students",
                    "vi": "một hệ thống trong đó các đội chuyên nghiệp trong một số môn thể thao chọn người chơi mỗi năm trong số các sinh viên đại học"
                },
                "examples": [
                    {
                        "en": "He was the fourth player chosen in the 2017 draft, but the first of his class to reach the major leagues.",
                        "vi": "Anh ấy là cầu thủ thứ tư được chọn trong bản dự thảo năm 2017, nhưng là người đầu tiên trong lớp của anh ấy tham dự các giải đấu lớn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a flow of cool air in a room or other small space",
                    "vi": "luồng không khí mát trong phòng hoặc không gian nhỏ khác"
                },
                "examples": [
                    {
                        "en": "Can you shut the door? There's a draft in here.",
                        "vi": "Bạn có thể đóng cửa lại không? Có một bản nháp ở đây."
                    }
                ]
            },
            {
                "define": {
                    "en": "one continuous action of swallowing liquid (= making it go down your throat); the amount swallowed",
                    "vi": "một hành động liên tục nuốt chất lỏng (= làm cho nó chảy xuống cổ họng của bạn); số lượng nuốt"
                },
                "examples": [
                    {
                        "en": "He took a deep draft of his beer.",
                        "vi": "Anh uống một hơi hết sạch bia của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "medicine in a liquid form",
                    "vi": "thuốc ở dạng lỏng"
                },
                "examples": [
                    {
                        "en": "a sleeping draft (= one that makes you sleep)",
                        "vi": "một bản nháp khi ngủ (= một bản nháp khiến bạn ngủ)"
                    }
                ]
            }
        ]
    },
    {
        "id": "2f4b803a4af34721bdd1f9c5faceccf1",
        "word": "draft",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/drɑːft/",
            "us": "/dræft/"
        },
        "nearby": [
            {
                "word": "Dracula",
                "pos": "noun"
            },
            {
                "word": "draft",
                "pos": "noun"
            },
            {
                "word": "draft",
                "pos": "verb"
            },
            {
                "word": "draft",
                "pos": "adjective"
            },
            {
                "word": "draft board",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to write the first rough version of something such as a letter, speech, book or law",
                    "vi": "để viết phiên bản thô đầu tiên của một cái gì đó chẳng hạn như một lá thư, bài phát biểu, sách hoặc luật"
                },
                "examples": [
                    {
                        "en": "I'll draft a letter for you.",
                        "vi": "Tôi sẽ soạn thảo một lá thư cho bạn."
                    },
                    {
                        "en": "The military began drafting a new constitution.",
                        "vi": "Quân đội bắt đầu soạn thảo hiến pháp mới."
                    },
                    {
                        "en": "Members of Parliament are busy drafting new legislation.",
                        "vi": "Các thành viên của Quốc hội đang bận rộn với việc soạn thảo luật mới."
                    },
                    {
                        "en": "to draft a bill/law/plan",
                        "vi": "để soạn thảo một dự luật / luật / kế hoạch"
                    }
                ]
            },
            {
                "define": {
                    "en": "to choose people and send them somewhere for a special task",
                    "vi": "để chọn người và gửi họ đến một nơi nào đó cho một nhiệm vụ đặc biệt"
                },
                "examples": [
                    {
                        "en": "Extra police are being drafted in to control the crowds.",
                        "vi": "Cảnh sát bổ sung đang được điều động để kiểm soát đám đông."
                    }
                ]
            },
            {
                "define": {
                    "en": "to order somebody by law to join the armed forces",
                    "vi": "ra lệnh cho ai đó theo luật gia nhập lực lượng vũ trang"
                },
                "examples": [
                    {
                        "en": "be drafted (into something) They were drafted into the army.",
                        "vi": "được dự thảo (thành một cái gì đó) Họ đã được đưa vào quân đội."
                    }
                ]
            }
        ]
    },
    {
        "id": "83bd20ee42c14257bcb1cdc9516472d3",
        "word": "dress uniform",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈdres juːnɪfɔːm/",
            "us": "/ˈdres juːnɪfɔːrm/"
        },
        "nearby": [
            {
                "word": "dress rehearsal",
                "pos": "noun"
            },
            {
                "word": "dress shirt",
                "pos": "noun"
            },
            {
                "word": "dress uniform",
                "pos": "noun"
            },
            {
                "word": "dress up",
                "pos": "phrasal verb"
            },
            {
                "word": "dressy",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a uniform that army, navy, etc. officers wear for formal occasions and ceremonies",
                    "vi": "một bộ đồng phục mà các sĩ quan lục quân, hải quân, v.v. mặc cho những dịp và nghi lễ trang trọng"
                },
                "examples": [
                    {
                        "en": "wearing full dress uniform",
                        "vi": "mặc đồng phục đầy đủ"
                    }
                ]
            }
        ]
    },
    {
        "id": "ff740000e5704ba2b2d2b2bc04a73ef9",
        "word": "ex-service",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌeks ˈsɜːvɪs/",
            "us": "/ˌeks ˈsɜːrvɪs/"
        },
        "nearby": [
            {
                "word": "exquisite",
                "pos": "adjective"
            },
            {
                "word": "exquisitely",
                "pos": "adverb"
            },
            {
                "word": "ex-service",
                "pos": "adjective"
            },
            {
                "word": "ex-serviceman",
                "pos": "noun"
            },
            {
                "word": "ex-servicewoman",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "having previously been a member of the army, navy, etc.",
                    "vi": "đã từng là thành viên của lục quân, hải quân, v.v."
                },
                "examples": [
                    {
                        "en": "ex-service personnel",
                        "vi": "nhân viên phục vụ cũ"
                    }
                ]
            }
        ]
    },
    {
        "id": "401338afdfbc4b6a9c1bf55070e65299",
        "word": "lieutenant",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/lefˈtenənt/",
            "us": "/luːˈtenənt/"
        },
        "nearby": [
            {
                "word": "lieu",
                "pos": "noun"
            },
            {
                "word": "Lieut.",
                "pos": "abbreviation"
            },
            {
                "word": "lieutenant",
                "pos": "noun"
            },
            {
                "word": "lieutenant colonel",
                "pos": "noun"
            },
            {
                "word": "lieutenant commander",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an officer of middle rank in the army, navy, or air force",
                    "vi": "một sĩ quan cấp trung trong lục quân, hải quân hoặc không quân"
                },
                "examples": [
                    {
                        "en": "Lieutenant Paul Fisher",
                        "vi": "Trung úy Paul Fisher"
                    }
                ]
            },
            {
                "define": {
                    "en": "an officer just below the rank mentioned",
                    "vi": "một sĩ quan ngay dưới cấp bậc được đề cập"
                },
                "examples": [
                    {
                        "en": "a lieutenant colonel",
                        "vi": "một trung tá"
                    }
                ]
            },
            {
                "define": {
                    "en": "(in the US) a police officer of fairly high rank",
                    "vi": "(ở Mỹ) một sĩ quan cảnh sát có cấp bậc khá cao"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a person who helps somebody who is above them in rank or who performs their duties when that person is unable to",
                    "vi": "một người giúp đỡ người nào đó cao hơn họ về cấp bậc hoặc người thực hiện nhiệm vụ của họ khi người đó không thể"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "bb366aa5bc704cd299abc9615781f8c9",
        "word": "lieutenant colonel",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/lefˌtenənt ˈkɜːnl/",
            "us": "/luːˌtenənt ˈkɜːrnl/"
        },
        "nearby": [
            {
                "word": "Lieut.",
                "pos": "abbreviation"
            },
            {
                "word": "lieutenant",
                "pos": "noun"
            },
            {
                "word": "lieutenant colonel",
                "pos": "noun"
            },
            {
                "word": "lieutenant commander",
                "pos": "noun"
            },
            {
                "word": "lieutenant general",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an officer of middle rank in the US army, US air force or British army",
                    "vi": "một sĩ quan cấp trung trong quân đội Hoa Kỳ, lực lượng không quân Hoa Kỳ hoặc quân đội Anh"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "f8dfcaa5e66f45ceb29d06ad758202fc",
        "word": "major general",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌmeɪdʒə ˈdʒenrəl/",
            "us": "/ˌmeɪdʒər ˈdʒenrəl/"
        },
        "nearby": [
            {
                "word": "major-domo",
                "pos": "noun"
            },
            {
                "word": "majorette",
                "pos": "noun"
            },
            {
                "word": "major general",
                "pos": "noun"
            },
            {
                "word": "major in",
                "pos": "phrasal verb"
            },
            {
                "word": "majority",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an officer of very high rank in the army or the US air force",
                    "vi": "một sĩ quan có cấp bậc rất cao trong quân đội hoặc lực lượng không quân Hoa Kỳ"
                },
                "examples": [
                    {
                        "en": "Major General William Hunt",
                        "vi": "Thiếu tướng William Hunt"
                    }
                ]
            }
        ]
    },
    {
        "id": "f5dd3c54e30e453498d316df615a0dec",
        "word": "marshal",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmɑːʃl/",
            "us": "/ˈmɑːrʃl/"
        },
        "nearby": [
            {
                "word": "Ngaio Marsh",
                "pos": ""
            },
            {
                "word": "Pete Marsh",
                "pos": ""
            },
            {
                "word": "marshal",
                "pos": "noun"
            },
            {
                "word": "marshal",
                "pos": "verb"
            },
            {
                "word": "Marshall",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an officer of the highest rank in the armed forces of some countries",
                    "vi": "một sĩ quan cấp cao nhất trong lực lượng vũ trang của một số quốc gia"
                },
                "examples": [
                    {
                        "en": "Field Marshal Lord Haig",
                        "vi": "Thống chế Lord Haig"
                    },
                    {
                        "en": "Marshal of the Royal Air Force",
                        "vi": "Nguyên soái Không quân Hoàng gia"
                    }
                ]
            },
            {
                "define": {
                    "en": "a person responsible for making sure that public events, especially sports events, take place without any problems, and for controlling crowds",
                    "vi": "một người chịu trách nhiệm đảm bảo rằng các sự kiện công cộng, đặc biệt là các sự kiện thể thao, diễn ra mà không gặp bất kỳ sự cố nào và kiểm soát đám đông"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "(in the US) an officer whose job is to put court orders into effect",
                    "vi": "(ở Hoa Kỳ) một sĩ quan có công việc là đưa lệnh của tòa án có hiệu lực"
                },
                "examples": [
                    {
                        "en": "a federal marshal",
                        "vi": "một thống chế liên bang"
                    }
                ]
            },
            {
                "define": {
                    "en": "(in some US cities) an officer of high rank in a police or fire department",
                    "vi": "(ở một số thành phố của Hoa Kỳ) một sĩ quan cấp cao trong cảnh sát hoặc sở cứu hỏa"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "fb2817ecf6e245df89a9793fbfe3699d",
        "word": "master corporal",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌmɑːstə ˈkɔːpərəl/",
            "us": "/ˌmæstər ˈkɔːrpərəl/"
        },
        "nearby": [
            {
                "word": "master chief petty officer",
                "pos": "noun"
            },
            {
                "word": "masterclass",
                "pos": "noun"
            },
            {
                "word": "master corporal",
                "pos": "noun"
            },
            {
                "word": "masterful",
                "pos": "adjective"
            },
            {
                "word": "masterfully",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a member of one of the lower ranks of the Canadian army or air force",
                    "vi": "thành viên của một trong những cấp bậc thấp hơn của quân đội hoặc lực lượng không quân Canada"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c43717f6408b47cd8475de92685396d5",
        "word": "NAAFI",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈnæfi/",
            "us": "/ˈnæfi/"
        },
        "nearby": [
            {
                "word": "n/a",
                "pos": "abbreviation"
            },
            {
                "word": "NAACP",
                "pos": "abbreviation"
            },
            {
                "word": "NAAFI",
                "pos": "noun"
            },
            {
                "word": "naan",
                "pos": "noun"
            },
            {
                "word": "naartjie",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an organization which provides shops and places to eat for British soldiers (the abbreviation for ‘Navy, Army and Air Force Institutes’)",
                    "vi": "một tổ chức cung cấp các cửa hàng và địa điểm ăn uống cho binh lính Anh (viết tắt của 'Học viện Hải quân, Lục quân và Không quân')"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "035e693f8dc74ef1af02162bd0f18f6e",
        "word": "reservist",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/rɪˈzɜːvɪst/",
            "us": "/rɪˈzɜːrvɪst/"
        },
        "nearby": [
            {
                "word": "reserved",
                "pos": "adjective"
            },
            {
                "word": "reserved word",
                "pos": "noun"
            },
            {
                "word": "reservist",
                "pos": "noun"
            },
            {
                "word": "reservoir",
                "pos": "noun"
            },
            {
                "word": "reset",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a soldier, etc. who is a member of the reserves (= a military force that can be used in an emergency)",
                    "vi": "một người lính, v.v. là thành viên của lực lượng dự bị (= lực lượng quân đội có thể được sử dụng trong trường hợp khẩn cấp)"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c7dd23bf05884d1182c2777c24b83095",
        "word": "second lieutenant",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌsekənd ˌlefˈtenənt/",
            "us": "/ˌsekənd ˌluːˈtenənt/"
        },
        "nearby": [
            {
                "word": "second language",
                "pos": "noun"
            },
            {
                "word": "second language acquisition",
                "pos": "noun"
            },
            {
                "word": "second lieutenant",
                "pos": "noun"
            },
            {
                "word": "Second Life",
                "pos": "noun"
            },
            {
                "word": "secondly",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an officer of lower rank in the army or the US air force just below the rank of a lieutenant",
                    "vi": "một sĩ quan có cấp bậc thấp hơn trong quân đội hoặc lực lượng không quân Hoa Kỳ ngay dưới cấp bậc trung úy"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "4baab1e04ff848a085305288c7cd5633",
        "word": "sergeant",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsɑːdʒənt/",
            "us": "/ˈsɑːrdʒənt/"
        },
        "nearby": [
            {
                "word": "serfdom",
                "pos": "noun"
            },
            {
                "word": "serge",
                "pos": "noun"
            },
            {
                "word": "sergeant",
                "pos": "noun"
            },
            {
                "word": "sergeant major",
                "pos": "noun"
            },
            {
                "word": "Sergeant Pepper",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a member of one of the middle ranks in the army and the air force, below an officer",
                    "vi": "thành viên của một trong các cấp bậc trung trong lục quân và không quân, dưới sĩ quan"
                },
                "examples": [
                    {
                        "en": "Sergeant Salter",
                        "vi": "Sergeant Salter"
                    }
                ]
            },
            {
                "define": {
                    "en": "(in the UK) a police officer just below the rank of an inspector",
                    "vi": "(ở Anh) một sĩ quan cảnh sát chỉ dưới cấp bậc của một thanh tra"
                },
                "examples": [
                    {
                        "en": "Detective Sergeant Peter Wiles",
                        "vi": "Trung sĩ thám tử Peter Wiles"
                    },
                    {
                        "en": "Visitors to the police station should report to the duty sergeant.",
                        "vi": "Du khách đến đồn cảnh sát nên báo cáo với trung sĩ trực."
                    }
                ]
            },
            {
                "define": {
                    "en": "(in the US) a police officer just below the rank of a lieutenant or captain",
                    "vi": "(ở Mỹ) một sĩ quan cảnh sát chỉ dưới cấp trung úy hoặc đại úy"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "11c0d3b9843846cb8edddba97800f110",
        "word": "signaller",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsɪɡnələ(r)/",
            "us": "/ˈsɪɡnələr/"
        },
        "nearby": [
            {
                "word": "signal",
                "pos": "adjective"
            },
            {
                "word": "signal box",
                "pos": "noun"
            },
            {
                "word": "signaller",
                "pos": "noun"
            },
            {
                "word": "signally",
                "pos": "adverb"
            },
            {
                "word": "signalman",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person whose job is operating signals on a railway",
                    "vi": "một người có công việc đang điều hành tín hiệu trên đường sắt"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a person trained to give and receive signals in the army or navy",
                    "vi": "một người được đào tạo để đưa và nhận tín hiệu trong quân đội hoặc hải quân"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "1919d037165e4f10b51d0ffbf2edf5a5",
        "word": "signalman",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsɪɡnəlmən/",
            "us": "/ˈsɪɡnəlmən/"
        },
        "nearby": [
            {
                "word": "signaller",
                "pos": "noun"
            },
            {
                "word": "signally",
                "pos": "adverb"
            },
            {
                "word": "signalman",
                "pos": "noun"
            },
            {
                "word": "signal-to-noise ratio",
                "pos": "noun"
            },
            {
                "word": "signatory",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person whose job is operating signals on a railway",
                    "vi": "một người có công việc đang điều hành tín hiệu trên đường sắt"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a person trained to give and receive signals in the army or navy",
                    "vi": "một người được đào tạo để đưa và nhận tín hiệu trong quân đội hoặc hải quân"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "2e3fc95194d045aba9de2599c6683875",
        "word": "squadron",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈskwɒdrən/",
            "us": "/ˈskwɑːdrən/"
        },
        "nearby": [
            {
                "word": "squad car",
                "pos": "noun"
            },
            {
                "word": "squaddie",
                "pos": "noun"
            },
            {
                "word": "squadron",
                "pos": "noun"
            },
            {
                "word": "squadron leader",
                "pos": "noun"
            },
            {
                "word": "squalid",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a group of military aircraft or ships forming a section of a military force",
                    "vi": "một nhóm máy bay hoặc tàu quân sự tạo thành một bộ phận của lực lượng quân sự"
                },
                "examples": [
                    {
                        "en": "a bomber/fighter squadron",
                        "vi": "một phi đội máy bay ném bom / máy bay chiến đấu"
                    }
                ]
            }
        ]
    },
    {
        "id": "af421763b9a44cfe9ced11a1e14b1d0f",
        "word": "staff sergeant",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈstɑːf sɑːdʒənt/",
            "us": "/ˈstæf sɑːrdʒənt/"
        },
        "nearby": [
            {
                "word": "Staffordshire pottery",
                "pos": "noun"
            },
            {
                "word": "staffroom",
                "pos": "noun"
            },
            {
                "word": "staff sergeant",
                "pos": "noun"
            },
            {
                "word": "staff writer",
                "pos": "noun"
            },
            {
                "word": "stag",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a member of the army or the US air force just above the rank of a sergeant",
                    "vi": "một thành viên của quân đội hoặc lực lượng không quân Hoa Kỳ chỉ trên cấp bậc trung sĩ"
                },
                "examples": [
                    {
                        "en": "Staff Sergeant Bob Woods",
                        "vi": "Nhân viên Trung sĩ Bob Woods"
                    }
                ]
            }
        ]
    },
    {
        "id": "ee3aa2e8ba2242789688d37b97114d32",
        "word": "tour of duty",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌtʊər əv ˈdjuːti/",
            "us": "/ˌtʊr əv ˈduːti/"
        },
        "nearby": [
            {
                "word": "tourniquet",
                "pos": "noun"
            },
            {
                "word": "the Tour of Britain",
                "pos": ""
            },
            {
                "word": "tour of duty",
                "pos": "noun"
            },
            {
                "word": "tourtière",
                "pos": "noun"
            },
            {
                "word": "tousle",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a period of time when somebody is serving in the armed forces or as a diplomat in a particular place",
                    "vi": "một khoảng thời gian khi ai đó đang phục vụ trong lực lượng vũ trang hoặc là một nhà ngoại giao ở một nơi cụ thể"
                },
                "examples": [
                    {
                        "en": "She has served two tours of duty overseas.",
                        "vi": "Cô đã thực hiện hai chuyến công tác ở nước ngoài."
                    },
                    {
                        "en": "They have recently returned from a year-long tour of duty.",
                        "vi": "Gần đây họ đã trở về sau chuyến đi làm nhiệm vụ kéo dài một năm."
                    },
                    {
                        "en": "on a tour of duty He was wounded while on a tour of duty.",
                        "vi": "trong một chuyến tham quan của nhiệm vụ Anh ấy đã bị thương trong khi thực hiện một chuyến tham quan của nhiệm vụ."
                    }
                ]
            }
        ]
    },
    {
        "id": "31dca180d0724141b8d6839f1acc0b51",
        "word": "warrant officer",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈwɒrənt ɒfɪsə(r)/",
            "us": "/ˈwɔːrənt ɑːfɪsər/"
        },
        "nearby": [
            {
                "word": "warrant",
                "pos": "noun"
            },
            {
                "word": "warrant",
                "pos": "verb"
            },
            {
                "word": "warrant officer",
                "pos": "noun"
            },
            {
                "word": "warranty",
                "pos": "noun"
            },
            {
                "word": "warren",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a member of one of the middle ranks in the army, the British air force and the US navy",
                    "vi": "thành viên của một trong những cấp bậc trung trong lục quân, không quân Anh và hải quân Hoa Kỳ"
                },
                "examples": [
                    {
                        "en": "Warrant Officer Gary Owen",
                        "vi": "Cảnh sát viên Gary Owen"
                    }
                ]
            }
        ]
    }
]