[
    {
        "id": "9c9b2600530547709f131979ce18ae92",
        "word": "result",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/rɪˈzʌlt/",
            "us": "/rɪˈzʌlt/"
        },
        "nearby": [
            {
                "word": "rest upon",
                "pos": "phrasal verb"
            },
            {
                "word": "rest with",
                "pos": "phrasal verb"
            },
            {
                "word": "result",
                "pos": "noun"
            },
            {
                "word": "result",
                "pos": "verb"
            },
            {
                "word": "resultant",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a thing that is caused or produced because of something else",
                    "vi": "một thứ được gây ra hoặc được tạo ra do một thứ khác"
                },
                "examples": [
                    {
                        "en": "And did your intervention produce the desired result?",
                        "vi": "Và sự can thiệp của bạn có mang lại kết quả như mong muốn không?"
                    },
                    {
                        "en": "to yield/achieve a result",
                        "vi": "để mang lại / đạt được một kết quả"
                    },
                    {
                        "en": "result of something The company's failure was a direct result of bad management.",
                        "vi": "kết quả của điều gì đó Sự thất bại của công ty là kết quả trực tiếp của việc quản lý tồi."
                    },
                    {
                        "en": "This book is the result of 25 years of research.",
                        "vi": "Cuốn sách này là kết quả của 25 năm nghiên cứu."
                    },
                    {
                        "en": "The end result (= the final one) of her hard work was a place at medical school.",
                        "vi": "Kết quả cuối cùng (= kết quả cuối cùng) cho sự chăm chỉ của cô ấy là một suất vào trường y."
                    },
                    {
                        "en": "as a result He made one big mistake, and, as a result, lost his job.",
                        "vi": "kết quả là anh ta đã mắc một sai lầm lớn, và kết quả là anh ta bị mất việc làm."
                    },
                    {
                        "en": "as a result of something She died as a result of her injuries.",
                        "vi": "do hậu quả của một cái gì đó Cô ấy đã chết vì những vết thương của cô ấy."
                    },
                    {
                        "en": "with the result that… The farm was flooded, with the result that the crop was lost.",
                        "vi": "với kết quả là… Trang trại bị ngập lụt, kết quả là mùa màng bị mất trắng."
                    },
                    {
                        "en": "with… results He decided to get involved, with disastrous results.",
                        "vi": "với… kết quả Anh ấy quyết định tham gia, với kết quả thảm hại."
                    }
                ]
            },
            {
                "define": {
                    "en": "the final score or the name of the winner in a sports event, competition, election, etc.",
                    "vi": "điểm số cuối cùng hoặc tên của người chiến thắng trong một sự kiện thể thao, cuộc thi, cuộc bầu cử, v.v."
                },
                "examples": [
                    {
                        "en": "the election results",
                        "vi": "kết quả bầu cử"
                    },
                    {
                        "en": "The announcer was reading out the football results.",
                        "vi": "Phát thanh viên đang đọc kết quả bóng đá."
                    },
                    {
                        "en": "result of something They will announce the result of the vote tonight.",
                        "vi": "kết quả của một cái gì đó Họ sẽ công bố kết quả của cuộc bỏ phiếu vào tối nay."
                    }
                ]
            },
            {
                "define": {
                    "en": "a victory or a success",
                    "vi": "một chiến thắng hoặc một thành công"
                },
                "examples": [
                    {
                        "en": "We badly need to get a result from this match.",
                        "vi": "Chúng tôi rất cần có được một kết quả từ trận đấu này."
                    },
                    {
                        "en": "This was a great result for us.",
                        "vi": "Đây là một kết quả tuyệt vời cho chúng tôi."
                    },
                    {
                        "en": "He left. Result! (= used when you are happy something has happened)",
                        "vi": "Anh ấy đã đi. Kết quả! (= được sử dụng khi bạn vui vì điều gì đó đã xảy ra)"
                    }
                ]
            },
            {
                "define": {
                    "en": "the mark or grade you get in an exam or in a number of exams",
                    "vi": "điểm hoặc điểm bạn đạt được trong một kỳ thi hoặc trong một số kỳ thi"
                },
                "examples": [
                    {
                        "en": "Have you had your results yet?",
                        "vi": "Bạn đã có kết quả của mình chưa?"
                    },
                    {
                        "en": "When do you get your exam results?",
                        "vi": "Khi nào bạn nhận được kết quả kỳ thi của mình?"
                    }
                ]
            },
            {
                "define": {
                    "en": "the information that you get from a scientific test or piece of research",
                    "vi": "thông tin mà bạn nhận được từ một thử nghiệm khoa học hoặc một phần của nghiên cứu"
                },
                "examples": [
                    {
                        "en": "Other research has yielded similar results.",
                        "vi": "Nghiên cứu khác cũng cho kết quả tương tự."
                    },
                    {
                        "en": "The doctor will explain your blood test results.",
                        "vi": "Bác sĩ sẽ giải thích kết quả xét nghiệm máu của bạn."
                    },
                    {
                        "en": "a positive/negative test result",
                        "vi": "một kết quả xét nghiệm dương tính / âm tính"
                    },
                    {
                        "en": "result of something the results of a study",
                        "vi": "kết quả của một cái gì đó kết quả của một nghiên cứu"
                    },
                    {
                        "en": "The results of our experiment indicate that environmental factors play a part.",
                        "vi": "Kết quả thí nghiệm của chúng tôi chỉ ra rằng các yếu tố môi trường đóng một vai trò quan trọng."
                    },
                    {
                        "en": "The results obtained were compared with previous results.",
                        "vi": "Kết quả thu được được so sánh với kết quả trước đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "the information that you get from a computer search",
                    "vi": "thông tin mà bạn nhận được từ tìm kiếm trên máy tính"
                },
                "examples": [
                    {
                        "en": "My search produced several thousand results.",
                        "vi": "Tìm kiếm của tôi cho ra vài nghìn kết quả."
                    },
                    {
                        "en": "The user can control how the search results are displayed.",
                        "vi": "Người dùng có thể kiểm soát cách hiển thị kết quả tìm kiếm."
                    },
                    {
                        "en": "the first page of search results",
                        "vi": "trang đầu tiên của kết quả tìm kiếm"
                    }
                ]
            },
            {
                "define": {
                    "en": "things that are achieved successfully",
                    "vi": "những điều đạt được thành công"
                },
                "examples": [
                    {
                        "en": "The project is beginning to show results.",
                        "vi": "Dự án đang bắt đầu cho thấy kết quả."
                    },
                    {
                        "en": "a coach who knows how to get results from his players",
                        "vi": "một huấn luyện viên biết cách thu được kết quả từ các cầu thủ của mình"
                    },
                    {
                        "en": "For best results, defrost fully before use.",
                        "vi": "Để có kết quả tốt nhất, hãy rã đông hoàn toàn trước khi sử dụng."
                    }
                ]
            },
            {
                "define": {
                    "en": "the amount of profit or loss made by a business over a particular period of time",
                    "vi": "số tiền lãi hoặc lỗ của một doanh nghiệp trong một khoảng thời gian cụ thể"
                },
                "examples": [
                    {
                        "en": "Companies are required by law to report their financial results on a quarterly basis.",
                        "vi": "Theo luật, các công ty phải báo cáo kết quả tài chính của họ hàng quý."
                    },
                    {
                        "en": "The company will publish its interim results (= before the final results are known) on Monday.",
                        "vi": "Công ty sẽ công bố kết quả tạm thời (= trước khi biết kết quả cuối cùng) vào thứ Hai."
                    },
                    {
                        "en": "The corporation is expected to announce improved results for the last quarter.",
                        "vi": "Công ty dự kiến sẽ công bố kết quả cải thiện trong quý cuối cùng."
                    }
                ]
            }
        ]
    },
    {
        "id": "b9f3dba972da40f0a1fff103573ce853",
        "word": "lab",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/læb/",
            "us": "/læb/"
        },
        "nearby": [
            {
                "word": "LA",
                "pos": "abbreviation"
            },
            {
                "word": "laager",
                "pos": "noun"
            },
            {
                "word": "lab",
                "pos": "noun"
            },
            {
                "word": "Lab.",
                "pos": "abbreviation"
            },
            {
                "word": "the Laban Centre",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a laboratory",
                    "vi": "phòng thí nghiệm"
                },
                "examples": [
                    {
                        "en": "a computer/research lab",
                        "vi": "một phòng thí nghiệm máy tính / nghiên cứu"
                    },
                    {
                        "en": "the school science labs",
                        "vi": "phòng thí nghiệm khoa học của trường"
                    },
                    {
                        "en": "in a lab She'd been working in the lab all day.",
                        "vi": "trong phòng thí nghiệm Cô ấy đã làm việc trong phòng thí nghiệm cả ngày."
                    },
                    {
                        "en": "a lab technician",
                        "vi": "một kỹ thuật viên phòng thí nghiệm"
                    },
                    {
                        "en": "a lab coat (= a white coat worn by scientists, etc. working in a laboratory)",
                        "vi": "áo khoác phòng thí nghiệm (= áo khoác trắng do các nhà khoa học mặc, v.v. làm việc trong phòng thí nghiệm)"
                    }
                ]
            }
        ]
    },
    {
        "id": "2c69fb9eeffb46a7a40c5f83ada2e19b",
        "word": "method",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈmeθəd/",
            "us": "/ˈmeθəd/"
        },
        "nearby": [
            {
                "word": "methicillin",
                "pos": "noun"
            },
            {
                "word": "methinks",
                "pos": "verb"
            },
            {
                "word": "method",
                "pos": "noun"
            },
            {
                "word": "method acting",
                "pos": "noun"
            },
            {
                "word": "method actor",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a particular way of doing something",
                    "vi": "một cách cụ thể để làm một cái gì đó"
                },
                "examples": [
                    {
                        "en": "Which method is the most effective?",
                        "vi": "Phương pháp nào là hiệu quả nhất?"
                    },
                    {
                        "en": "traditional/alternative methods",
                        "vi": "phương pháp truyền thống / thay thế"
                    },
                    {
                        "en": "method of something a scientific method of data analysis",
                        "vi": "phương pháp của một cái gì đó một phương pháp khoa học phân tích dữ liệu"
                    },
                    {
                        "en": "method of doing something a reliable method of measuring blood pressure",
                        "vi": "phương pháp làm việc gì đó một phương pháp đo huyết áp đáng tin cậy"
                    },
                    {
                        "en": "method for (doing) something the best method for arriving at an accurate prediction of the costs",
                        "vi": "phương pháp để (làm) điều gì đó là phương pháp tốt nhất để đưa ra dự đoán chính xác về chi phí"
                    },
                    {
                        "en": "method to do something Developing new methods to keep insects out of food packages is critical.",
                        "vi": "Phương pháp để làm điều gì đó Phát triển các phương pháp mới để ngăn côn trùng ra khỏi gói thực phẩm là rất quan trọng."
                    },
                    {
                        "en": "to use/employ/apply a method",
                        "vi": "sử dụng / sử dụng / áp dụng một phương pháp"
                    },
                    {
                        "en": "to devise/propose/adopt a method",
                        "vi": "đưa ra / đề xuất / áp dụng một phương pháp"
                    },
                    {
                        "en": "He's quite critical of modern teaching methods.",
                        "vi": "Ông ấy khá phê phán các phương pháp giảng dạy hiện đại."
                    }
                ]
            },
            {
                "define": {
                    "en": "the quality of being well planned and organized",
                    "vi": "chất lượng của việc được lập kế hoạch và tổ chức tốt"
                },
                "examples": [
                    {
                        "en": "There's very little method in his approach.",
                        "vi": "Có rất ít phương pháp trong cách tiếp cận của anh ấy."
                    },
                    {
                        "en": "We have to apply some method to this investigation.",
                        "vi": "Chúng tôi phải áp dụng một số phương pháp cho cuộc điều tra này."
                    }
                ]
            },
            {
                "define": {
                    "en": "there is a reason for somebody’s behaviour and it is not as strange or as stupid as it seems",
                    "vi": "có lý do cho hành vi của ai đó và nó không kỳ lạ hay ngu ngốc như nó có vẻ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "7b8a9c9fcf9e475b8618fc26a026f3c2",
        "word": "test",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/test/",
            "us": "/test/"
        },
        "nearby": [
            {
                "word": "tessitura",
                "pos": "noun"
            },
            {
                "word": "Tess of the D'Urbervilles",
                "pos": ""
            },
            {
                "word": "test",
                "pos": "noun"
            },
            {
                "word": "test",
                "pos": "verb"
            },
            {
                "word": "testable",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an examination of somebody’s knowledge or ability, consisting of questions for them to answer or activities for them to perform",
                    "vi": "kiểm tra kiến thức hoặc khả năng của ai đó, bao gồm các câu hỏi để họ trả lời hoặc các hoạt động để họ thực hiện"
                },
                "examples": [
                    {
                        "en": "an IQ/a fitness test",
                        "vi": "IQ / kiểm tra thể chất"
                    },
                    {
                        "en": "test on something a test on irregular verbs",
                        "vi": "kiểm tra về một cái gì đó một bài kiểm tra về động từ bất quy tắc"
                    },
                    {
                        "en": "test in something Students take standardized tests in English and maths.",
                        "vi": "kiểm tra trong một cái gì đó Học sinh làm các bài kiểm tra tiêu chuẩn trong tiếng Anh và toán học."
                    },
                    {
                        "en": "(British English also) to do a test",
                        "vi": "(Anh cũng có tiếng Anh) để làm bài kiểm tra"
                    },
                    {
                        "en": "to pass/fail a test",
                        "vi": "vượt qua / thất bại một bài kiểm tra"
                    },
                    {
                        "en": "in a test (British English) a good mark in the test",
                        "vi": "trong một bài kiểm tra (tiếng Anh Anh), một điểm tốt trong bài kiểm tra"
                    },
                    {
                        "en": "on a test (North American English) a good score on the test",
                        "vi": "trong một bài kiểm tra (Tiếng Anh Bắc Mỹ), một điểm tốt trong bài kiểm tra"
                    }
                ]
            },
            {
                "define": {
                    "en": "a medical examination to discover what is wrong with you or to check the condition of your health",
                    "vi": "khám sức khỏe để phát hiện ra bạn bị bệnh gì hoặc để kiểm tra tình trạng sức khỏe của bạn"
                },
                "examples": [
                    {
                        "en": "The hospital is doing some tests.",
                        "vi": "Bệnh viện đang làm một số xét nghiệm."
                    },
                    {
                        "en": "We'll need to perform a series of tests.",
                        "vi": "Chúng tôi sẽ cần thực hiện một loạt các thử nghiệm."
                    },
                    {
                        "en": "test for something screening tests for cancer",
                        "vi": "kiểm tra một cái gì đó xét nghiệm sàng lọc ung thư"
                    },
                    {
                        "en": "Three athletes were sent home after failing drugs tests.",
                        "vi": "Ba vận động viên đã được cho về nhà sau khi thất bại trong các cuộc kiểm tra ma túy."
                    },
                    {
                        "en": "The pregnancy test was positive.",
                        "vi": "Kết quả thử thai cho kết quả dương tính."
                    },
                    {
                        "en": "negative/positive test results",
                        "vi": "kết quả xét nghiệm âm tính / dương tính"
                    }
                ]
            },
            {
                "define": {
                    "en": "an experiment to discover whether or how well something works, or to find out more information about it",
                    "vi": "một thử nghiệm để khám phá xem một cái gì đó hoạt động tốt như thế nào hoặc để tìm hiểu thêm thông tin về nó"
                },
                "examples": [
                    {
                        "en": "the results of laboratory tests",
                        "vi": "kết quả của các xét nghiệm trong phòng thí nghiệm"
                    },
                    {
                        "en": "to conduct a nuclear test",
                        "vi": "tiến hành một vụ thử hạt nhân"
                    },
                    {
                        "en": "Tests have shown high levels of pollutants in the water.",
                        "vi": "Các cuộc kiểm tra cho thấy hàm lượng chất ô nhiễm trong nước cao."
                    },
                    {
                        "en": "I'll run a diagnostic test to determine why the server keeps crashing.",
                        "vi": "Tôi sẽ chạy kiểm tra chẩn đoán để xác định lý do tại sao máy chủ liên tục gặp sự cố."
                    }
                ]
            },
            {
                "define": {
                    "en": "a situation or an event that shows how good, strong, etc. somebody/something is",
                    "vi": "một tình huống hoặc một sự kiện cho thấy ai đó / điều gì đó tốt, mạnh mẽ như thế nào"
                },
                "examples": [
                    {
                        "en": "The local elections will be a good test of the government's popularity.",
                        "vi": "Các cuộc bầu cử địa phương sẽ là một thử nghiệm tốt về sự phổ biến của chính phủ."
                    },
                    {
                        "en": "He saw their separation as a test of the strength of their love.",
                        "vi": "Anh xem cuộc chia ly của họ như một phép thử cho sức mạnh tình yêu của họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a cricket or rugby match played between the teams of two different countries, usually as part of a series of matches on a tour",
                    "vi": "một trận đấu cricket hoặc bóng bầu dục diễn ra giữa các đội của hai quốc gia khác nhau, thường là một phần của một loạt các trận đấu trong chuyến lưu diễn"
                },
                "examples": [
                    {
                        "en": "They played well in the first Test against South Africa.",
                        "vi": "Họ đã chơi tốt trong bài kiểm tra đầu tiên với Nam Phi."
                    },
                    {
                        "en": "He will be first choice for the opening test against the All Blacks.",
                        "vi": "Anh ta sẽ là lựa chọn đầu tiên cho bài kiểm tra mở màn với All Blacks."
                    }
                ]
            },
            {
                "define": {
                    "en": "to put somebody/something in a situation that will show what their or its true qualities are",
                    "vi": "đặt ai đó / điều gì đó vào một tình huống sẽ cho thấy phẩm chất thực sự của họ hoặc của nó là gì"
                },
                "examples": [
                    {
                        "en": "His theories have never really been put to the test.",
                        "vi": "Các lý thuyết của ông chưa bao giờ thực sự được đưa vào thử nghiệm."
                    },
                    {
                        "en": "The latest pay dispute has really put her management skills to the test.",
                        "vi": "Vụ tranh chấp lương mới nhất đã thực sự khiến kỹ năng quản lý của cô ấy bị thử thách."
                    }
                ]
            },
            {
                "define": {
                    "en": "to prove to be good, popular, etc. over a long period of time",
                    "vi": "để chứng minh là tốt, phổ biến, v.v. trong một thời gian dài"
                },
                "examples": [
                    {
                        "en": "Whether this new technology will stand the test of time remains to be seen.",
                        "vi": "Liệu công nghệ mới này có đứng vững trước thử thách của thời gian hay không vẫn còn phải xem."
                    }
                ]
            },
            {
                "define": {
                    "en": "to teach students only what is necessary in order to pass a particular test, rather than help them develop a range of skills",
                    "vi": "chỉ dạy học sinh những gì cần thiết để vượt qua một bài kiểm tra cụ thể, thay vì giúp họ phát triển một loạt các kỹ năng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "7dd746de2d5943f692908d899b6ae6e7",
        "word": "test",
        "pos": "verb",
        "level": "a2",
        "phonetic": {
            "uk": "/test/",
            "us": "/test/"
        },
        "nearby": [
            {
                "word": "Tess of the D'Urbervilles",
                "pos": ""
            },
            {
                "word": "test",
                "pos": "noun"
            },
            {
                "word": "test",
                "pos": "verb"
            },
            {
                "word": "testable",
                "pos": "adjective"
            },
            {
                "word": "the Test Act",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to find out how much somebody knows, or what they can do by asking them questions or giving them activities to perform",
                    "vi": "để tìm hiểu xem ai đó biết bao nhiêu hoặc họ có thể làm gì bằng cách đặt câu hỏi cho họ hoặc cung cấp cho họ các hoạt động để thực hiện"
                },
                "examples": [
                    {
                        "en": "test somebody Students will be tested at the end of each module.",
                        "vi": "kiểm tra ai đó Học sinh sẽ được kiểm tra vào cuối mỗi học phần."
                    },
                    {
                        "en": "test somebody on something Children are tested on core subjects at age 11.",
                        "vi": "kiểm tra ai đó về điều gì Trẻ em được kiểm tra các môn học chính ở tuổi 11."
                    },
                    {
                        "en": "test somebody in something We test all students in English and maths.",
                        "vi": "kiểm tra ai đó trong điều gì đó Chúng tôi kiểm tra tất cả học sinh bằng tiếng Anh và toán."
                    },
                    {
                        "en": "test something Applicants' skills, ability and knowledge are tested before job offers are made.",
                        "vi": "kiểm tra điều gì đó Các kỹ năng, khả năng và kiến thức của ứng viên được kiểm tra trước khi đưa ra lời mời làm việc."
                    },
                    {
                        "en": "We test your English before deciding which class to put you in.",
                        "vi": "Chúng tôi kiểm tra trình độ tiếng Anh của bạn trước khi quyết định đưa bạn vào lớp nào."
                    }
                ]
            },
            {
                "define": {
                    "en": "to perform well/badly in a test of knowledge or ability",
                    "vi": "thể hiện tốt / kém trong bài kiểm tra kiến thức hoặc khả năng"
                },
                "examples": [
                    {
                        "en": "students who tested well in reading",
                        "vi": "học sinh thi đọc tốt"
                    },
                    {
                        "en": "There are people who test well and people who don’t.",
                        "vi": "Có những người thi tốt và những người không."
                    }
                ]
            },
            {
                "define": {
                    "en": "to examine the blood, a part of the body, etc. to find out what is wrong with a person, or to check the condition of their health",
                    "vi": "để kiểm tra máu, một bộ phận của cơ thể, v.v. để tìm ra bệnh gì ở một người, hoặc kiểm tra tình trạng sức khỏe của họ"
                },
                "examples": [
                    {
                        "en": "test somebody/something to test somebody’s eyesight/hearing",
                        "vi": "kiểm tra ai đó / cái gì đó để kiểm tra thị lực / thính giác của ai đó"
                    },
                    {
                        "en": "test somebody/something for something The doctor tested him for hepatitis.",
                        "vi": "kiểm tra ai đó / cái gì đó cho cái gì Bác sĩ đã kiểm tra anh ta về bệnh viêm gan."
                    },
                    {
                        "en": "test + adj. (for something) She tested negative for HIV.",
                        "vi": "kiểm tra + adj. (vì điều gì đó) Cô ấy đã xét nghiệm âm tính với HIV."
                    },
                    {
                        "en": "Two athletes tested positive for steroids.",
                        "vi": "Hai vận động viên xét nghiệm dương tính với steroid."
                    }
                ]
            },
            {
                "define": {
                    "en": "to use or try a machine, substance, idea, etc. to find out how well it works or to find out more information about it",
                    "vi": "sử dụng hoặc thử một chiếc máy, chất liệu, ý tưởng, v.v. để tìm hiểu xem nó hoạt động tốt như thế nào hoặc để tìm hiểu thêm thông tin về nó"
                },
                "examples": [
                    {
                        "en": "test something Test your brakes regularly.",
                        "vi": "kiểm tra một cái gì đó Kiểm tra phanh của bạn thường xuyên."
                    },
                    {
                        "en": "The new system has been rigorously tested.",
                        "vi": "Hệ thống mới đã được kiểm tra nghiêm ngặt."
                    },
                    {
                        "en": "test something on somebody/something Our beauty products are not tested on animals.",
                        "vi": "thử nghiệm cái gì đó trên ai đó / cái gì đó Sản phẩm làm đẹp của chúng tôi không được thử nghiệm trên động vật."
                    },
                    {
                        "en": "test something out The chef uses his family to test out new ideas for the restaurant menu.",
                        "vi": "thử nghiệm thứ gì đó Đầu bếp sử dụng gia đình của mình để thử nghiệm những ý tưởng mới cho thực đơn nhà hàng."
                    },
                    {
                        "en": "They opened a single store in Europe to test out the market.",
                        "vi": "Họ đã mở một cửa hàng duy nhất ở Châu Âu để thử nghiệm thị trường."
                    },
                    {
                        "en": "test something for something The software has been tested for viruses.",
                        "vi": "kiểm tra một cái gì đó cho một cái gì đó Phần mềm đã được kiểm tra vi rút."
                    },
                    {
                        "en": "The water is regularly tested for purity.",
                        "vi": "Nước thường xuyên được kiểm tra độ tinh khiết."
                    },
                    {
                        "en": "test something against something Researchers are now testing the hypothesis against available data.",
                        "vi": "Kiểm tra điều gì đó chống lại điều gì đó Các nhà nghiên cứu hiện đang kiểm tra giả thuyết dựa trên dữ liệu có sẵn."
                    }
                ]
            },
            {
                "define": {
                    "en": "(of a machine or product) to perform well/badly in a test of how well it works",
                    "vi": "(của một máy hoặc sản phẩm) để hoạt động tốt / kém trong một bài kiểm tra xem nó hoạt động như thế nào"
                },
                "examples": [
                    {
                        "en": "The ad had tested badly with consumers.",
                        "vi": "Quảng cáo đã thử nghiệm không tốt với người tiêu dùng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be difficult and therefore need all your strength, ability, etc.",
                    "vi": "khó khăn và do đó cần tất cả sức lực, khả năng của bạn, v.v."
                },
                "examples": [
                    {
                        "en": "The long climb tested our fitness and stamina.",
                        "vi": "Cuộc leo núi dài đã kiểm tra thể lực và sức chịu đựng của chúng tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to find out what the situation is before doing something or making a decision",
                    "vi": "để tìm hiểu tình hình trước khi làm điều gì đó hoặc đưa ra quyết định"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "that you have used or relied on in the past successfully",
                    "vi": "mà bạn đã sử dụng hoặc dựa vào trong quá khứ thành công"
                },
                "examples": [
                    {
                        "en": "a tried and tested method for solving the problem",
                        "vi": "một phương pháp đã thử và đã thử nghiệm để giải quyết vấn đề"
                    }
                ]
            }
        ]
    },
    {
        "id": "2432cc991aa64440b1f64c8f47ecdbae",
        "word": "experiment",
        "pos": "verb",
        "level": "b1",
        "phonetic": {
            "uk": "/ɪkˈsperɪment/",
            "us": "/ɪkˈsperɪment/"
        },
        "nearby": [
            {
                "word": "experiential",
                "pos": "adjective"
            },
            {
                "word": "experiment",
                "pos": "noun"
            },
            {
                "word": "experiment",
                "pos": "verb"
            },
            {
                "word": "experimental",
                "pos": "adjective"
            },
            {
                "word": "experimentally",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to do a scientific experiment or experiments",
                    "vi": "để làm một thí nghiệm khoa học hoặc các thí nghiệm"
                },
                "examples": [
                    {
                        "en": "After experimenting at Columbia University, he realized that fission was the key to releasing nuclear energy.",
                        "vi": "Sau khi thử nghiệm tại Đại học Columbia, ông nhận ra rằng sự phân hạch là chìa khóa để giải phóng năng lượng hạt nhân."
                    },
                    {
                        "en": "experiment on somebody/something Some people feel that experimenting on animals is wrong.",
                        "vi": "thử nghiệm trên ai đó / cái gì đó Một số người cảm thấy rằng thử nghiệm trên động vật là sai."
                    },
                    {
                        "en": "They experimented successfully on the plants to discover disease-resistant varieties.",
                        "vi": "Họ đã thử nghiệm thành công trên cây để tìm ra các giống kháng bệnh."
                    },
                    {
                        "en": "experiment with something The country had secretly experimented with biological weapons for years.",
                        "vi": "thử nghiệm với thứ gì đó Đất nước đã bí mật thử nghiệm vũ khí sinh học trong nhiều năm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to try or test new ideas, methods, etc. to find out what effect they have",
                    "vi": "để thử hoặc kiểm tra các ý tưởng, phương pháp mới, v.v. để tìm hiểu xem chúng có tác dụng gì"
                },
                "examples": [
                    {
                        "en": "I experimented until I got the recipe just right.",
                        "vi": "Tôi đã thử nghiệm cho đến khi tôi có được công thức phù hợp."
                    },
                    {
                        "en": "experiment with something She had experimented with drugs when she was at college.",
                        "vi": "thử nghiệm với thứ gì đó Cô ấy đã thử nghiệm với ma túy khi còn học đại học."
                    },
                    {
                        "en": "He wanted to experiment more with different textures in his paintings.",
                        "vi": "Anh ấy muốn thử nghiệm nhiều hơn với các kết cấu khác nhau trong tranh của mình."
                    }
                ]
            }
        ]
    },
    {
        "id": "a776bd01710045cf9a134f18a8eee6f3",
        "word": "laboratory",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ləˈbɒrətri/",
            "us": "/ˈlæbrətɔːri/"
        },
        "nearby": [
            {
                "word": "labor",
                "pos": "noun"
            },
            {
                "word": "labor",
                "pos": "verb"
            },
            {
                "word": "laboratory",
                "pos": "noun"
            },
            {
                "word": "Labor Day",
                "pos": "noun"
            },
            {
                "word": "labored",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a room or building used for scientific research, experiments, testing, etc.",
                    "vi": "một căn phòng hoặc tòa nhà được sử dụng để nghiên cứu khoa học, thí nghiệm, thử nghiệm, v.v."
                },
                "examples": [
                    {
                        "en": "a clinical/research laboratory",
                        "vi": "phòng thí nghiệm lâm sàng / nghiên cứu"
                    },
                    {
                        "en": "to send a specimen to the laboratory for analysis",
                        "vi": "gửi một mẫu vật đến phòng thí nghiệm để phân tích"
                    },
                    {
                        "en": "in a/the laboratory The effects of weathering can be simulated in the laboratory.",
                        "vi": "trong phòng thí nghiệm Các tác động của thời tiết có thể được mô phỏng trong phòng thí nghiệm."
                    },
                    {
                        "en": "laboratory experiments/tests",
                        "vi": "thí nghiệm / thử nghiệm trong phòng thí nghiệm"
                    },
                    {
                        "en": "The athletes' reflexes were tested under laboratory conditions.",
                        "vi": "Phản xạ của các vận động viên đã được kiểm tra trong điều kiện phòng thí nghiệm."
                    }
                ]
            }
        ]
    },
    {
        "id": "908185304bf24bada03f81f8564f2612",
        "word": "conduct",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/kənˈdʌkt/",
            "us": "/kənˈdʌkt/"
        },
        "nearby": [
            {
                "word": "condor",
                "pos": "noun"
            },
            {
                "word": "conducive",
                "pos": "adjective"
            },
            {
                "word": "conduct",
                "pos": "verb"
            },
            {
                "word": "conduct",
                "pos": "noun"
            },
            {
                "word": "conductance",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to organize and/or do a particular activity",
                    "vi": "để tổ chức và / hoặc thực hiện một hoạt động cụ thể"
                },
                "examples": [
                    {
                        "en": "to conduct an experiment/inquiry/investigation/interview",
                        "vi": "để thực hiện một thử nghiệm / yêu cầu / điều tra / phỏng vấn"
                    },
                    {
                        "en": "to conduct a survey/poll/study/review",
                        "vi": "để thực hiện một cuộc khảo sát / thăm dò ý kiến / nghiên cứu / đánh giá"
                    },
                    {
                        "en": "to conduct a test/trial",
                        "vi": "để tiến hành một bài kiểm tra / thử nghiệm"
                    },
                    {
                        "en": "to conduct research/business",
                        "vi": "để thực hiện nghiên cứu / kinh doanh"
                    },
                    {
                        "en": "There are concerns about the way in which the firm conducts its acitvities.",
                        "vi": "Có những lo ngại về cách thức mà công ty tiến hành các hoạt động của mình."
                    },
                    {
                        "en": "The battalion had been preparing to conduct operations in the same area.",
                        "vi": "Tiểu đoàn đã chuẩn bị hành quân trong cùng một khu vực."
                    },
                    {
                        "en": "Police conducted a thorough search of the building.",
                        "vi": "Cảnh sát đã tiến hành khám xét toàn bộ tòa nhà."
                    },
                    {
                        "en": "The negotiations have been conducted in a positive manner.",
                        "vi": "Các cuộc đàm phán đã được tiến hành một cách tích cực."
                    },
                    {
                        "en": "They conducted a vigorous campaign for a shorter working week.",
                        "vi": "Họ đã tiến hành một chiến dịch sôi nổi trong một tuần làm việc ngắn hơn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to direct a group of people who are singing or playing music",
                    "vi": "để chỉ đạo một nhóm người đang hát hoặc chơi nhạc"
                },
                "examples": [
                    {
                        "en": "a concert by the London Philharmonic Orchestra, conducted by Marin Alsop",
                        "vi": "một buổi hòa nhạc của Dàn nhạc giao hưởng London, do Marin Alsop chỉ huy"
                    },
                    {
                        "en": "He conducted a programme of Sibelius and Tchaikovsky.",
                        "vi": "Ông đã tiến hành một chương trình của Sibelius và Tchaikovsky."
                    },
                    {
                        "en": "She will conduct works by Brahms and Schumann in tonight's concert.",
                        "vi": "Cô ấy sẽ biểu diễn các tác phẩm của Brahms và Schumann trong buổi hòa nhạc tối nay."
                    },
                    {
                        "en": "She sang Gluck's Orfeo at Covent Garden, with Sir Thomas Beecham conducting.",
                        "vi": "Cô đã hát Gluck's Orfeo tại Covent Garden, với sự chỉ huy của Ngài Thomas Beecham."
                    }
                ]
            },
            {
                "define": {
                    "en": "to lead or guide somebody through or around a place",
                    "vi": "dẫn dắt hoặc hướng dẫn ai đó đi qua hoặc xung quanh một địa điểm"
                },
                "examples": [
                    {
                        "en": "a conducted tour of Athens (= one with a guide, giving information about it)",
                        "vi": "một chuyến tham quan được thực hiện ở Athens (= một chuyến tham quan có hướng dẫn viên, cung cấp thông tin về nó)"
                    },
                    {
                        "en": "The guide conducted us around the ruins of the ancient city.",
                        "vi": "Người hướng dẫn đưa chúng tôi đi quanh những tàn tích của thành phố cổ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to behave in a particular way",
                    "vi": "cư xử theo một cách cụ thể"
                },
                "examples": [
                    {
                        "en": "He conducted himself far better than expected.",
                        "vi": "Anh ấy đã tiến hành bản thân tốt hơn nhiều so với mong đợi."
                    },
                    {
                        "en": "The report challenges them to examine how they conduct themselves in the workplace.",
                        "vi": "Báo cáo thách thức họ kiểm tra cách họ ứng xử tại nơi làm việc."
                    }
                ]
            },
            {
                "define": {
                    "en": "to allow heat or electricity to pass along or through it",
                    "vi": "để cho phép nhiệt hoặc điện truyền qua hoặc đi qua nó"
                },
                "examples": [
                    {
                        "en": "Copper conducts electricity well.",
                        "vi": "Đồng dẫn điện tốt."
                    }
                ]
            }
        ]
    },
    {
        "id": "7ac56bd8daca45a7832e83b2137bc8ce",
        "word": "procedure",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/prəˈsiːdʒə(r)/",
            "us": "/prəˈsiːdʒər/"
        },
        "nearby": [
            {
                "word": "procaryotic",
                "pos": "adjective"
            },
            {
                "word": "procedural",
                "pos": "adjective"
            },
            {
                "word": "procedure",
                "pos": "noun"
            },
            {
                "word": "proceed",
                "pos": "verb"
            },
            {
                "word": "proceed against",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a way of doing something, especially the usual or correct way",
                    "vi": "một cách để làm điều gì đó, đặc biệt là cách thông thường hoặc cách đúng"
                },
                "examples": [
                    {
                        "en": "emergency/safety/disciplinary procedures",
                        "vi": "quy trình khẩn cấp / an toàn / kỷ luật"
                    },
                    {
                        "en": "Making a complaint is quite a simple procedure.",
                        "vi": "Khiếu nại là một thủ tục khá đơn giản."
                    },
                    {
                        "en": "The school in this case did not follow the correct procedure.",
                        "vi": "Nhà trường trong trường hợp này đã không thực hiện đúng quy trình."
                    },
                    {
                        "en": "to follow normal/standard/the proper procedure",
                        "vi": "để tuân theo quy trình bình thường / tiêu chuẩn / thích hợp"
                    },
                    {
                        "en": "To ensure high quality, all products go through rigorous testing procedures.",
                        "vi": "Để đảm bảo chất lượng cao, tất cả các sản phẩm đều trải qua quy trình kiểm tra nghiêm ngặt."
                    },
                    {
                        "en": "procedure for (doing) something The procedure for logging on to the network involves a password.",
                        "vi": "thủ tục cho (làm) điều gì đó Thủ tục đăng nhập vào mạng liên quan đến mật khẩu."
                    },
                    {
                        "en": "under a procedure Any complaint has to be investigated under our complaints procedure.",
                        "vi": "theo một thủ tục Mọi khiếu nại phải được điều tra theo thủ tục khiếu nại của chúng tôi."
                    },
                    {
                        "en": "according to a procedure All experiments were performed according to standard procedures.",
                        "vi": "theo quy trình Tất cả các thí nghiệm được thực hiện theo quy trình tiêu chuẩn."
                    }
                ]
            },
            {
                "define": {
                    "en": "the official or formal order or way of doing something, especially in business, law or politics",
                    "vi": "trình tự chính thức hoặc chính thức hoặc cách thức làm việc gì đó, đặc biệt là trong kinh doanh, luật pháp hoặc chính trị"
                },
                "examples": [
                    {
                        "en": "court/legal/parliamentary procedure",
                        "vi": "thủ tục tòa án / pháp lý / quốc hội"
                    }
                ]
            },
            {
                "define": {
                    "en": "a medical operation",
                    "vi": "một hoạt động y tế"
                },
                "examples": [
                    {
                        "en": "a routine surgical procedure",
                        "vi": "một thủ tục phẫu thuật thông thường"
                    },
                    {
                        "en": "to perform/undergo a procedure",
                        "vi": "để thực hiện / trải qua một thủ tục"
                    }
                ]
            }
        ]
    },
    {
        "id": "fa91886eb3314774b8f00fda6825399a",
        "word": "trial",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈtraɪəl/",
            "us": "/ˈtraɪəl/"
        },
        "nearby": [
            {
                "word": "triad",
                "pos": "noun"
            },
            {
                "word": "triage",
                "pos": "noun"
            },
            {
                "word": "trial",
                "pos": "noun"
            },
            {
                "word": "trial",
                "pos": "verb"
            },
            {
                "word": "trial balloon",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a formal examination of evidence in court by a judge and often a jury, to decide if somebody accused of a crime is guilty or not",
                    "vi": "một cuộc kiểm tra chính thức bằng chứng trước tòa bởi một thẩm phán và thường là bồi thẩm đoàn, để quyết định xem ai đó bị buộc tội có tội hay không"
                },
                "examples": [
                    {
                        "en": "a murder/criminal trial",
                        "vi": "một vụ giết người / xét xử tội phạm"
                    },
                    {
                        "en": "on trial He's on trial for murder.",
                        "vi": "đang bị xét xử Anh ta đang bị xét xử về tội giết người."
                    },
                    {
                        "en": "She will stand trial/go on trial for fraud.",
                        "vi": "Cô ấy sẽ hầu tòa / ra tòa vì tội lừa đảo."
                    },
                    {
                        "en": "He should have been arrested and put on trial.",
                        "vi": "Anh ta đáng lẽ phải bị bắt và đưa ra xét xử."
                    },
                    {
                        "en": "He was facing trial on a murder charge.",
                        "vi": "Anh ta đang phải đối mặt với phiên tòa về tội giết người."
                    },
                    {
                        "en": "The men were arrested but not brought to trial.",
                        "vi": "Những người đàn ông bị bắt nhưng không bị đưa ra xét xử."
                    },
                    {
                        "en": "She is awaiting trial on corruption charges.",
                        "vi": "Cô đang chờ xét xử về tội danh tham nhũng."
                    },
                    {
                        "en": "He did not receive a fair trial.",
                        "vi": "Anh ta không nhận được một phiên tòa công bằng."
                    },
                    {
                        "en": "the right to trial by jury",
                        "vi": "quyền được xét xử bởi bồi thẩm đoàn"
                    },
                    {
                        "en": "She was detained without trial.",
                        "vi": "Cô đã bị giam giữ mà không cần xét xử."
                    },
                    {
                        "en": "a trial judge/lawyer/court",
                        "vi": "một thẩm phán xét xử / luật sư / tòa án"
                    },
                    {
                        "en": "She became a key witness in the trial.",
                        "vi": "Cô trở thành nhân chứng chủ chốt trong phiên tòa."
                    },
                    {
                        "en": "They will lose their right to a jury trial.",
                        "vi": "Họ sẽ mất quyền được xét xử bồi thẩm đoàn."
                    }
                ]
            },
            {
                "define": {
                    "en": "the process of testing the ability, quality or performance of somebody/something, especially before you make a final decision about them",
                    "vi": "quá trình kiểm tra khả năng, chất lượng hoặc hiệu suất của ai đó / điều gì đó, đặc biệt là trước khi bạn đưa ra quyết định cuối cùng về họ"
                },
                "examples": [
                    {
                        "en": "a clinical/field/randomized/controlled trial",
                        "vi": "một thử nghiệm lâm sàng / thực địa / ngẫu nhiên / đối chứng"
                    },
                    {
                        "en": "Australia and the US have conducted joint trials of the drone.",
                        "vi": "Australia và Mỹ đã tiến hành thử nghiệm chung máy bay không người lái."
                    },
                    {
                        "en": "She agreed to employ me for a trial period.",
                        "vi": "Cô ấy đồng ý cho tôi làm việc trong thời gian thử việc."
                    },
                    {
                        "en": "on trial We had the machine on trial for a week.",
                        "vi": "đang dùng thử Chúng tôi đã dùng thử máy trong một tuần."
                    },
                    {
                        "en": "The system was introduced on a trial basis for one month.",
                        "vi": "Hệ thống đã được giới thiệu trên cơ sở thử nghiệm trong một tháng."
                    },
                    {
                        "en": "a trial separation (= of a couple whose marriage is in difficulties)",
                        "vi": "cuộc chia ly trong thử thách (= của một cặp vợ chồng đang gặp khó khăn trong hôn nhân)"
                    },
                    {
                        "en": "a trial of strength (= a contest to see who is stronger)",
                        "vi": "thử sức mạnh (= cuộc thi xem ai mạnh hơn)"
                    }
                ]
            },
            {
                "define": {
                    "en": "a competition or series of tests to find the best players for a sports team or an important event",
                    "vi": "một cuộc thi hoặc một loạt các bài kiểm tra để tìm ra những cầu thủ giỏi nhất cho một đội thể thao hoặc một sự kiện quan trọng"
                },
                "examples": [
                    {
                        "en": "Olympic trials",
                        "vi": "Thử nghiệm Olympic"
                    }
                ]
            },
            {
                "define": {
                    "en": "an event at which animals compete or perform",
                    "vi": "một sự kiện mà tại đó động vật cạnh tranh hoặc biểu diễn"
                },
                "examples": [
                    {
                        "en": "horse trials",
                        "vi": "thử nghiệm ngựa"
                    }
                ]
            },
            {
                "define": {
                    "en": "an experience or a person that causes difficulties for somebody",
                    "vi": "một kinh nghiệm hoặc một người gây ra khó khăn cho ai đó"
                },
                "examples": [
                    {
                        "en": "the trials and tribulations of married life",
                        "vi": "những thử thách và khổ nạn của cuộc sống hôn nhân"
                    },
                    {
                        "en": "trial to somebody She was a sore trial to her family at times.",
                        "vi": "thử nghiệm với ai đó Đôi khi cô ấy là một thử thách nhức nhối đối với gia đình cô ấy."
                    },
                    {
                        "en": "(figurative) My first day at work was a trial by fire.",
                        "vi": "(nghĩa bóng) Ngày đầu tiên đi làm của tôi là một thử thách bằng lửa."
                    }
                ]
            },
            {
                "define": {
                    "en": "the process of solving a problem by trying various methods until you find a method that is successful",
                    "vi": "quá trình giải quyết một vấn đề bằng cách thử các phương pháp khác nhau cho đến khi bạn tìm thấy một phương pháp thành công"
                },
                "examples": [
                    {
                        "en": "Children learn to use computer programs by trial and error.",
                        "vi": "Trẻ em học cách sử dụng các chương trình máy tính bằng cách thử và sai."
                    }
                ]
            }
        ]
    },
    {
        "id": "6424206ae9b240929c1310503b25edf0",
        "word": "clinical trial",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌklɪnɪkl ˈtraɪəl/",
            "us": "/ˌklɪnɪkl ˈtraɪəl/"
        },
        "nearby": [
            {
                "word": "clinical",
                "pos": "adjective"
            },
            {
                "word": "clinically",
                "pos": "adverb"
            },
            {
                "word": "clinical trial",
                "pos": "noun"
            },
            {
                "word": "clinician",
                "pos": "noun"
            },
            {
                "word": "clink",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a research study in which a medical treatment is carefully tested on people in order to assess how safe and effective it is",
                    "vi": "một nghiên cứu nghiên cứu trong đó một phương pháp điều trị y tế được thử nghiệm cẩn thận trên người để đánh giá mức độ an toàn và hiệu quả của nó"
                },
                "examples": [
                    {
                        "en": "The new drug is undergoing clinical trials.",
                        "vi": "Thuốc mới đang được thử nghiệm lâm sàng."
                    }
                ]
            }
        ]
    },
    {
        "id": "7a0f5b276ca74997ac7c864b7da31a87",
        "word": "control",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/kənˈtrəʊl/",
            "us": "/kənˈtrəʊl/"
        },
        "nearby": [
            {
                "word": "contrive",
                "pos": "verb"
            },
            {
                "word": "contrived",
                "pos": "adjective"
            },
            {
                "word": "control",
                "pos": "noun"
            },
            {
                "word": "control",
                "pos": "verb"
            },
            {
                "word": "control centre",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the power to make decisions about how a country, an area, an organization, etc. is run",
                    "vi": "quyền đưa ra quyết định về cách thức vận hành của một quốc gia, một khu vực, một tổ chức, v.v."
                },
                "examples": [
                    {
                        "en": "control of somebody/something The party expects to gain control of the council in the next election.",
                        "vi": "sự kiểm soát của ai đó / cái gì đó Đảng kỳ vọng sẽ giành được quyền kiểm soát hội đồng trong cuộc bầu cử tiếp theo."
                    },
                    {
                        "en": "Militants have taken control of the town.",
                        "vi": "Các chiến binh đã giành quyền kiểm soát thị trấn."
                    },
                    {
                        "en": "The Democrats have lost control of Congress.",
                        "vi": "Đảng Dân chủ đã mất quyền kiểm soát Quốc hội."
                    },
                    {
                        "en": "A military junta seized control of the country.",
                        "vi": "Một chính quyền quân sự nắm quyền kiểm soát đất nước."
                    },
                    {
                        "en": "The founders eventually regained control of the company.",
                        "vi": "Những người sáng lập cuối cùng đã giành lại quyền kiểm soát công ty."
                    },
                    {
                        "en": "control over somebody/something He defended the tradition of civilian control over the military.",
                        "vi": "kiểm soát ai đó / cái gì đó Anh ta bảo vệ truyền thống kiểm soát dân sự đối với quân đội."
                    },
                    {
                        "en": "in the control of somebody/something The city is in the control of enemy forces.",
                        "vi": "trong sự kiểm soát của ai đó / cái gì đó Thành phố nằm trong sự kiểm soát của lực lượng đối phương."
                    },
                    {
                        "en": "under… control The area remains under international control.",
                        "vi": "dưới sự kiểm soát của… Khu vực này vẫn nằm dưới sự kiểm soát của quốc tế."
                    }
                ]
            },
            {
                "define": {
                    "en": "the ability to make somebody/something do what you want",
                    "vi": "khả năng khiến ai đó / điều gì đó làm theo ý bạn"
                },
                "examples": [
                    {
                        "en": "control over somebody/something The teacher had no control over the children.",
                        "vi": "kiểm soát ai đó / cái gì đó Giáo viên không kiểm soát được bọn trẻ."
                    },
                    {
                        "en": "He fought hard to retain control over his work.",
                        "vi": "Anh ấy đã chiến đấu hết mình để giữ quyền kiểm soát công việc của mình."
                    },
                    {
                        "en": "control of something She struggled to keep control of her voice.",
                        "vi": "kiểm soát một cái gì đó Cô ấy đấu tranh để giữ quyền kiểm soát giọng nói của mình."
                    },
                    {
                        "en": "She lost control of her car on the ice.",
                        "vi": "Cô ấy đã mất kiểm soát chiếc xe của mình trên băng."
                    },
                    {
                        "en": "He got so angry he lost control (= shouted and said or did things he would not normally do).",
                        "vi": "Anh ấy tức giận đến mức mất kiểm soát (= hét lên và nói hoặc làm những điều mà bình thường anh ấy sẽ không làm)."
                    },
                    {
                        "en": "beyond/outside somebody's control Owing to circumstances beyond our control, the flight to Rome has been cancelled.",
                        "vi": "ngoài / ngoài tầm kiểm soát của ai đó Do những trường hợp ngoài tầm kiểm soát của chúng tôi, chuyến bay đến Rome đã bị hủy."
                    },
                    {
                        "en": "under control The situation is under control.",
                        "vi": "trong tầm kiểm soát Tình hình được kiểm soát."
                    },
                    {
                        "en": "The coach made the team work hard on ball control (= in a ball game).",
                        "vi": "Huấn luyện viên đã yêu cầu toàn đội làm việc chăm chỉ trong việc kiểm soát bóng (= trong một trận bóng)."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of limiting or managing something; a method of doing this",
                    "vi": "hành động hạn chế hoặc quản lý một cái gì đó; một phương pháp để làm điều này"
                },
                "examples": [
                    {
                        "en": "traffic control",
                        "vi": "điều khiển giao thông"
                    },
                    {
                        "en": "talks on arms control",
                        "vi": "nói về kiểm soát vũ khí"
                    },
                    {
                        "en": "controls on something tight controls on government spending",
                        "vi": "kiểm soát về một cái gì đó kiểm soát chặt chẽ chi tiêu của chính phủ"
                    },
                    {
                        "en": "Price controls on food were ended.",
                        "vi": "Kiểm soát giá thực phẩm đã kết thúc."
                    },
                    {
                        "en": "control of something exciting advances in the control of malaria",
                        "vi": "kiểm soát một cái gì đó tiến bộ thú vị trong việc kiểm soát bệnh sốt rét"
                    },
                    {
                        "en": "state control of the economy",
                        "vi": "kiểm soát của nhà nước đối với nền kinh tế"
                    },
                    {
                        "en": "It was an exercise in damage control (= trying to prevent further damage).",
                        "vi": "Đó là một bài tập về kiểm soát thiệt hại (= cố gắng ngăn chặn thiệt hại thêm)."
                    },
                    {
                        "en": "A pest control officer was called in to deal with the rat problem.",
                        "vi": "Một nhân viên kiểm soát dịch hại đã được gọi đến để giải quyết vấn đề chuột."
                    }
                ]
            },
            {
                "define": {
                    "en": "the switches and buttons, etc. that you use to operate a machine or a vehicle",
                    "vi": "các công tắc và nút, v.v. mà bạn sử dụng để vận hành máy hoặc phương tiện"
                },
                "examples": [
                    {
                        "en": "the controls of an aircraft",
                        "vi": "điều khiển của một chiếc máy bay"
                    },
                    {
                        "en": "the control panel",
                        "vi": "bảng điều khiển"
                    },
                    {
                        "en": "the volume control of a TV",
                        "vi": "điều khiển âm lượng của TV"
                    },
                    {
                        "en": "at the controls The co-pilot was at the controls when the plane landed.",
                        "vi": "ở phần điều khiển Người phụ lái đã ở phần điều khiển khi máy bay hạ cánh."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person, thing or group used as a standard of comparison for checking the results of a scientific experiment; an experiment whose result is known, used for checking working methods",
                    "vi": "người, sự vật hoặc tập thể được dùng làm tiêu chuẩn so sánh để kiểm tra kết quả của một thí nghiệm khoa học; một thử nghiệm đã biết kết quả, được sử dụng để kiểm tra các phương pháp làm việc"
                },
                "examples": [
                    {
                        "en": "The study showed that women with the disease have had fewer children than the controls.",
                        "vi": "Nghiên cứu cho thấy phụ nữ mắc bệnh sinh ít con hơn so với nhóm chứng."
                    },
                    {
                        "en": "One group was treated with the new drug, and the control group was given a sugar pill.",
                        "vi": "Một nhóm được điều trị bằng loại thuốc mới, và nhóm đối chứng được cho uống một viên đường."
                    }
                ]
            },
            {
                "define": {
                    "en": "a place where orders are given or where checks are made; the people who work in this place",
                    "vi": "nơi đặt lệnh hoặc nơi thực hiện séc; những người làm việc ở nơi này"
                },
                "examples": [
                    {
                        "en": "We went through passport control and into the departure lounge.",
                        "vi": "Chúng tôi đã qua kiểm soát hộ chiếu và vào phòng chờ khởi hành."
                    }
                ]
            },
            {
                "define": {
                    "en": "(on a computer keyboard) a key that you press when you want to perform a particular operation",
                    "vi": "(trên bàn phím máy tính) một phím bạn nhấn khi muốn thực hiện một thao tác cụ thể"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to direct or manage an organization, an area or a situation",
                    "vi": "để chỉ đạo hoặc quản lý một tổ chức, một khu vực hoặc một tình huống"
                },
                "examples": [
                    {
                        "en": "He's reached retiring age, but he's still firmly in control.",
                        "vi": "Anh ấy đã đến tuổi nghỉ hưu, nhưng anh ấy vẫn nắm quyền kiểm soát vững chắc."
                    },
                    {
                        "en": "There has been some violence after the match, but the police are now in control of the situation.",
                        "vi": "Đã có một số bạo lực xảy ra sau trận đấu, nhưng cảnh sát hiện đang kiểm soát tình hình."
                    },
                    {
                        "en": "The elected government is back in control.",
                        "vi": "Chính phủ được bầu trở lại kiểm soát."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be able to organize your life well and keep calm",
                    "vi": "để có thể tổ chức cuộc sống của bạn tốt và giữ bình tĩnh"
                },
                "examples": [
                    {
                        "en": "In spite of all her family problems, she's really in control.",
                        "vi": "Bất chấp mọi vấn đề gia đình, cô ấy thực sự kiểm soát được."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be or become impossible to manage or to control",
                    "vi": "trở nên không thể quản lý hoặc kiểm soát"
                },
                "examples": [
                    {
                        "en": "The children are completely out of control since their father left.",
                        "vi": "Những đứa trẻ hoàn toàn mất kiểm soát kể từ khi bố chúng bỏ đi."
                    },
                    {
                        "en": "A truck ran out of control on the hill.",
                        "vi": "Một chiếc xe tải chạy mất kiểm soát trên đồi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be being dealt with successfully",
                    "vi": "được xử lý thành công"
                },
                "examples": [
                    {
                        "en": "Don't worry—everything's under control!",
                        "vi": "Đừng lo lắng — mọi thứ đều trong tầm kiểm soát!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to succeed in dealing with something so that it does not cause any damage or hurt anyone",
                    "vi": "thành công trong việc đối phó với một cái gì đó để nó không gây ra bất kỳ thiệt hại hoặc làm tổn thương bất kỳ ai"
                },
                "examples": [
                    {
                        "en": "It took two hours to bring the fire under control.",
                        "vi": "Phải mất hai giờ đồng hồ mới khống chế được ngọn lửa."
                    },
                    {
                        "en": "Please keep your dog under control!",
                        "vi": "Hãy kiểm soát con chó của bạn!"
                    }
                ]
            }
        ]
    },
    {
        "id": "4c58acbd338a4a58888e6312c45a8d28",
        "word": "empirical",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ɪmˈpɪrɪkl/",
            "us": "/ɪmˈpɪrɪkl/"
        },
        "nearby": [
            {
                "word": "Empire line",
                "pos": "noun"
            },
            {
                "word": "the Empire State Building",
                "pos": ""
            },
            {
                "word": "empirical",
                "pos": "adjective"
            },
            {
                "word": "empirically",
                "pos": "adverb"
            },
            {
                "word": "empiricism",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "based on experiments or experience rather than ideas or theories",
                    "vi": "dựa trên các thí nghiệm hoặc kinh nghiệm hơn là các ý tưởng hoặc lý thuyết"
                },
                "examples": [
                    {
                        "en": "empirical evidence/knowledge/research",
                        "vi": "bằng chứng thực nghiệm / kiến thức / nghiên cứu"
                    },
                    {
                        "en": "an empirical study",
                        "vi": "Một nghiên cứu thực nghiệm"
                    }
                ]
            }
        ]
    },
    {
        "id": "faec9fcb28d34b61bfcf77c58efeb5e3",
        "word": "empirically",
        "pos": "adverb",
        "level": "c1",
        "phonetic": {
            "uk": "/ɪmˈpɪrɪkli/",
            "us": "/ɪmˈpɪrɪkli/"
        },
        "nearby": [
            {
                "word": "the Empire State Building",
                "pos": ""
            },
            {
                "word": "empirical",
                "pos": "adjective"
            },
            {
                "word": "empirically",
                "pos": "adverb"
            },
            {
                "word": "empiricism",
                "pos": "noun"
            },
            {
                "word": "empiricist",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "in a way that is based on experiments or experience rather than ideas or theories",
                    "vi": "theo cách dựa trên các thí nghiệm hoặc kinh nghiệm hơn là các ý tưởng hoặc lý thuyết"
                },
                "examples": [
                    {
                        "en": "Such claims need to be tested empirically.",
                        "vi": "Những tuyên bố như vậy cần được kiểm tra theo kinh nghiệm."
                    }
                ]
            }
        ]
    },
    {
        "id": "8add416eb97349e68468d0a41cd035bb",
        "word": "experimental",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ɪkˌsperɪˈmentl/",
            "us": "/ɪkˌsperɪˈmentl/"
        },
        "nearby": [
            {
                "word": "experiment",
                "pos": "noun"
            },
            {
                "word": "experiment",
                "pos": "verb"
            },
            {
                "word": "experimental",
                "pos": "adjective"
            },
            {
                "word": "experimentally",
                "pos": "adverb"
            },
            {
                "word": "experimentation",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "based on new ideas, forms or methods that are used to find out what effect they have",
                    "vi": "dựa trên những ý tưởng, hình thức hoặc phương pháp mới được sử dụng để tìm hiểu xem chúng có tác dụng gì"
                },
                "examples": [
                    {
                        "en": "The school's experimental teaching methods include letting the children decide what to study.",
                        "vi": "Phương pháp giảng dạy thử nghiệm của trường bao gồm việc để bọn trẻ tự quyết định học gì."
                    },
                    {
                        "en": "experimental theatre/art/music",
                        "vi": "nhà hát thử nghiệm / nghệ thuật / âm nhạc"
                    },
                    {
                        "en": "The equipment is still at the experimental stage.",
                        "vi": "Các thiết bị vẫn đang ở giai đoạn thử nghiệm."
                    },
                    {
                        "en": "Doctors stress that this kind of treatment is still experimental.",
                        "vi": "Các bác sĩ nhấn mạnh rằng phương pháp điều trị này vẫn còn đang thử nghiệm."
                    }
                ]
            },
            {
                "define": {
                    "en": "connected with scientific experiments",
                    "vi": "kết nối với các thí nghiệm khoa học"
                },
                "examples": [
                    {
                        "en": "experimental conditions/data/evidence",
                        "vi": "điều kiện thực nghiệm / dữ liệu / bằng chứng"
                    },
                    {
                        "en": "experimental physics",
                        "vi": "vật lý thực nghiệm"
                    }
                ]
            }
        ]
    },
    {
        "id": "5985eaecf07943fc98ceb4b3fcbb7da8",
        "word": "experimentation",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ɪkˌsperɪmenˈteɪʃn/",
            "us": "/ɪkˌsperɪmenˈteɪʃn/"
        },
        "nearby": [
            {
                "word": "experimental",
                "pos": "adjective"
            },
            {
                "word": "experimentally",
                "pos": "adverb"
            },
            {
                "word": "experimentation",
                "pos": "noun"
            },
            {
                "word": "experimenter",
                "pos": "noun"
            },
            {
                "word": "expert",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the activity or process of doing scientific experiments",
                    "vi": "hoạt động hoặc quá trình thực hiện các thí nghiệm khoa học"
                },
                "examples": [
                    {
                        "en": "Further experimentation is needed to verify this hypothesis.",
                        "vi": "Cần thực nghiệm thêm để xác minh giả thuyết này."
                    },
                    {
                        "en": "experimentation on something Many people object to experimentation on embryos.",
                        "vi": "thử nghiệm trên một cái gì đó Nhiều người phản đối việc thử nghiệm trên phôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "the activity or process of trying or testing new ideas, methods, etc. to find out what effect they have",
                    "vi": "hoạt động hoặc quá trình thử hoặc thử nghiệm các ý tưởng, phương pháp mới, v.v. để tìm hiểu xem chúng có tác dụng gì"
                },
                "examples": [
                    {
                        "en": "He has a flair for musical experimentation.",
                        "vi": "Anh ấy có khiếu thử nghiệm âm nhạc."
                    },
                    {
                        "en": "experimentation with something experimentation with new teaching methods",
                        "vi": "thử nghiệm với một cái gì đó thử nghiệm với các phương pháp giảng dạy mới"
                    }
                ]
            }
        ]
    },
    {
        "id": "6055ec61c40d481287699d9c6a7f3203",
        "word": "guinea pig",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈɡɪni pɪɡ/",
            "us": "/ˈɡɪni pɪɡ/"
        },
        "nearby": [
            {
                "word": "guinea fowl",
                "pos": "noun"
            },
            {
                "word": "Guinean",
                "pos": "noun, adjective"
            },
            {
                "word": "guinea pig",
                "pos": "noun"
            },
            {
                "word": "Guinevere",
                "pos": ""
            },
            {
                "word": "Guinness",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small animal with short ears and no tail, often kept as a pet",
                    "vi": "một con vật nhỏ có tai ngắn và không có đuôi, thường được nuôi làm thú cưng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a person used in medical or other experiments",
                    "vi": "một người được sử dụng trong y tế hoặc các thí nghiệm khác"
                },
                "examples": [
                    {
                        "en": "Students in fifty schools are to act as guinea pigs for these new teaching methods.",
                        "vi": "Học sinh của năm mươi trường học sẽ đóng vai trò như những con chuột lang cho những phương pháp giảng dạy mới này."
                    }
                ]
            }
        ]
    },
    {
        "id": "2f90fe3831044825826eb6f1e684ab7d",
        "word": "subject",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈsʌbdʒɪkt/",
            "us": "/ˈsʌbdʒɪkt/"
        },
        "nearby": [
            {
                "word": "subheading",
                "pos": "noun"
            },
            {
                "word": "subhuman",
                "pos": "adjective"
            },
            {
                "word": "subject",
                "pos": "noun"
            },
            {
                "word": "subject",
                "pos": "adjective"
            },
            {
                "word": "subject",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a thing or person that is being discussed, described or dealt with",
                    "vi": "một sự vật hoặc con người đang được thảo luận, mô tả hoặc xử lý"
                },
                "examples": [
                    {
                        "en": "subject of something Walker's work has been the subject of much debate.",
                        "vi": "chủ đề của một cái gì đó Công việc của Walker đã là chủ đề của nhiều cuộc tranh luận."
                    },
                    {
                        "en": "a subject of discussion/conversation",
                        "vi": "một chủ đề của cuộc thảo luận / cuộc trò chuyện"
                    },
                    {
                        "en": "Nelson Mandela is the subject of a new biography.",
                        "vi": "Nelson Mandela là chủ đề của một cuốn tiểu sử mới."
                    },
                    {
                        "en": "The incident is currently the subject of a police investigation.",
                        "vi": "Vụ việc hiện đang là chủ đề của một cuộc điều tra của cảnh sát."
                    },
                    {
                        "en": "on a/the subject books on many different subjects",
                        "vi": "trên a / sách chủ đề về nhiều chủ đề khác nhau"
                    },
                    {
                        "en": "I have nothing more to say on the subject.",
                        "vi": "Tôi không còn gì để nói về chủ đề này."
                    },
                    {
                        "en": "on the subject of something a magazine article on the subject of space travel",
                        "vi": "về chủ đề gì đó một bài báo trên tạp chí về chủ đề du hành vũ trụ"
                    },
                    {
                        "en": "How did we get onto the subject of marriage?",
                        "vi": "Làm thế nào chúng ta có được chủ đề hôn nhân?"
                    },
                    {
                        "en": "I wish you'd change the subject (= talk about something else).",
                        "vi": "Tôi ước bạn thay đổi chủ đề (= nói về điều gì đó khác)."
                    },
                    {
                        "en": "We seem to have got off the subject we're meant to be discussing.",
                        "vi": "Chúng ta dường như đã lạc đề tài mà chúng ta muốn thảo luận."
                    },
                    {
                        "en": "a subject for debate/discussion",
                        "vi": "một chủ đề để tranh luận / thảo luận"
                    },
                    {
                        "en": "The university runs a wide range of research programmes in different subject areas.",
                        "vi": "Trường đại học điều hành một loạt các chương trình nghiên cứu trong các lĩnh vực chủ đề khác nhau."
                    }
                ]
            },
            {
                "define": {
                    "en": "an area of knowledge studied in a school, college, etc.",
                    "vi": "một lĩnh vực kiến thức được học ở trường học, trường cao đẳng, v.v."
                },
                "examples": [
                    {
                        "en": "Biology is my favourite subject.",
                        "vi": "Sinh học là môn học yêu thích của tôi."
                    },
                    {
                        "en": "Which subjects are you studying?",
                        "vi": "Bạn đang học những môn nào?"
                    },
                    {
                        "en": "The college offers a wide range of subjects.",
                        "vi": "Trường cung cấp một loạt các môn học."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person or thing that is the main feature of a picture or photograph, or that a work of art is based on",
                    "vi": "một người hoặc một vật là đặc điểm chính của một bức tranh hoặc ảnh chụp hoặc một tác phẩm nghệ thuật dựa trên"
                },
                "examples": [
                    {
                        "en": "Focus the camera on the subject.",
                        "vi": "Lấy nét máy ảnh vào đối tượng."
                    },
                    {
                        "en": "Classical landscapes were a popular subject with many 18th century painters.",
                        "vi": "Phong cảnh cổ điển là một chủ đề phổ biến với nhiều họa sĩ thế kỷ 18."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person or thing being used to study something, especially in an experiment",
                    "vi": "một người hoặc vật được sử dụng để nghiên cứu điều gì đó, đặc biệt là trong một thí nghiệm"
                },
                "examples": [
                    {
                        "en": "We need male subjects between the ages of 18 and 25 for the experiment.",
                        "vi": "Chúng tôi cần đối tượng nam trong độ tuổi từ 18 đến 25 cho cuộc thử nghiệm."
                    }
                ]
            },
            {
                "define": {
                    "en": "a noun, noun phrase or pronoun representing the person or thing that performs the action of the verb (I in I sat down.), about which something is stated (the house in the house is very old) or, in a passive sentence, that is affected by the action of the verb (the tree in the tree was blown down in the storm)",
                    "vi": "một danh từ, cụm danh từ hoặc đại từ đại diện cho người hoặc vật thực hiện hành động của động từ (tôi trong tôi ngồi xuống.), về cái gì đó được nêu (ngôi nhà trong ngôi nhà rất cũ) hoặc, trong một câu bị động, điều đó bị ảnh hưởng bởi hành động của động từ (cây trên cây bị thổi ngã trong cơn bão)"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a person who belongs to a particular country, especially one with a king or queen",
                    "vi": "một người thuộc về một quốc gia cụ thể, đặc biệt là một quốc gia có vua hoặc hoàng hậu"
                },
                "examples": [
                    {
                        "en": "a British subject",
                        "vi": "một chủ đề tiếng Anh"
                    },
                    {
                        "en": "The prince had to tax his subjects heavily to raise money for the war.",
                        "vi": "Hoàng tử đã phải đánh thuế thần dân của mình một cách nặng nề để gây quỹ cho chiến tranh."
                    }
                ]
            }
        ]
    },
    {
        "id": "fa776af2ad4a4eaa9982b173e7fc6b24",
        "word": "controlled experiment",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/kənˌtrəʊld ɪkˈsperɪmənt/",
            "us": "/kənˌtrəʊld ɪkˈsperɪmənt/"
        },
        "nearby": [
            {
                "word": "controlled",
                "pos": "adjective"
            },
            {
                "word": "controlled economy",
                "pos": "noun"
            },
            {
                "word": "controlled experiment",
                "pos": "noun"
            },
            {
                "word": "controlled substance",
                "pos": "noun"
            },
            {
                "word": "controller",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a scientific experiment in which only one condition is changed in each of several tests in order to find out what effect that condition has on the results of the experiment",
                    "vi": "một thí nghiệm khoa học trong đó chỉ có một điều kiện được thay đổi trong một số lần thử nghiệm để tìm hiểu xem điều kiện đó có ảnh hưởng gì đến kết quả của thí nghiệm"
                },
                "examples": [
                    {
                        "en": "Controlled experiments show how shore crabs of different sizes respond to ship noise.",
                        "vi": "Các thí nghiệm có kiểm soát cho thấy cách những con cua bờ biển có kích cỡ khác nhau phản ứng với tiếng ồn của tàu."
                    }
                ]
            }
        ]
    },
    {
        "id": "8dbb6a222f424123b4aa2ae669e402d7",
        "word": "dissect",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/dɪˈsekt/",
            "us": "/dɪˈsekt/"
        },
        "nearby": [
            {
                "word": "dissatisfaction",
                "pos": "noun"
            },
            {
                "word": "dissatisfied",
                "pos": "adjective"
            },
            {
                "word": "dissect",
                "pos": "verb"
            },
            {
                "word": "dissection",
                "pos": "noun"
            },
            {
                "word": "dissemble",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to cut up a dead person, animal or plant in order to study it",
                    "vi": "chặt xác một người, động vật hoặc thực vật để nghiên cứu nó"
                },
                "examples": [
                    {
                        "en": "The biology students had to dissect a rat.",
                        "vi": "Các sinh viên sinh học đã phải mổ xẻ một con chuột."
                    },
                    {
                        "en": "dissecting instruments",
                        "vi": "dụng cụ mổ xẻ"
                    }
                ]
            },
            {
                "define": {
                    "en": "to study something closely and/or discuss it in great detail",
                    "vi": "để nghiên cứu kỹ điều gì đó và / hoặc thảo luận về nó rất chi tiết"
                },
                "examples": [
                    {
                        "en": "Her latest novel was dissected by the critics.",
                        "vi": "Cuốn tiểu thuyết mới nhất của cô bị giới phê bình mổ xẻ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to divide something into smaller pieces, areas, etc.",
                    "vi": "để chia một thứ gì đó thành các phần nhỏ hơn, các khu vực, v.v."
                },
                "examples": [
                    {
                        "en": "The city is dissected by a network of old canals.",
                        "vi": "Thành phố bị chia cắt bởi một mạng lưới các kênh cũ."
                    }
                ]
            }
        ]
    },
    {
        "id": "56a6e8cdfe0242f08b7790f72e8541d4",
        "word": "protocol",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈprəʊtəkɒl/",
            "us": "/ˈprəʊtəkɑːl/"
        },
        "nearby": [
            {
                "word": "protest vote",
                "pos": "noun"
            },
            {
                "word": "proto-",
                "pos": "combining form"
            },
            {
                "word": "protocol",
                "pos": "noun"
            },
            {
                "word": "Proto-Indo-European",
                "pos": "noun"
            },
            {
                "word": "proton",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a system of fixed rules and formal behaviour used at official meetings, usually between governments",
                    "vi": "một hệ thống các quy tắc cố định và hành vi chính thức được sử dụng tại các cuộc họp chính thức, thường là giữa các chính phủ"
                },
                "examples": [
                    {
                        "en": "a breach of protocol",
                        "vi": "vi phạm giao thức"
                    },
                    {
                        "en": "the protocol of diplomatic visits",
                        "vi": "nghi thức của các chuyến thăm ngoại giao"
                    }
                ]
            },
            {
                "define": {
                    "en": "the first or original version of an agreement, especially a treaty between countries, etc.; an extra part added to an agreement or treaty",
                    "vi": "phiên bản đầu tiên hoặc phiên bản gốc của một hiệp định, đặc biệt là hiệp ước giữa các quốc gia, v.v.; một phần bổ sung được thêm vào một thỏa thuận hoặc hiệp ước"
                },
                "examples": [
                    {
                        "en": "the first Geneva Protocol",
                        "vi": "Nghị định thư Geneva đầu tiên"
                    },
                    {
                        "en": "It is set out in a legally binding protocol which forms part of the treaty.",
                        "vi": "Nó được quy định trong một giao thức ràng buộc về mặt pháp lý tạo thành một phần của hiệp ước."
                    },
                    {
                        "en": "The dates were agreed under a protocol to the climate convention.",
                        "vi": "Các ngày đã được thống nhất theo một giao thức của công ước khí hậu."
                    }
                ]
            },
            {
                "define": {
                    "en": "a set of rules that control the way data is sent between computers",
                    "vi": "một tập hợp các quy tắc kiểm soát cách dữ liệu được gửi giữa các máy tính"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a plan for performing a scientific experiment or medical treatment",
                    "vi": "một kế hoạch để thực hiện một thí nghiệm khoa học hoặc điều trị y tế"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "73e90739db284fb2b7f248bf4cf91e49",
        "word": "randomize",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈrændəmaɪz/",
            "us": "/ˈrændəmaɪz/"
        },
        "nearby": [
            {
                "word": "random access",
                "pos": "noun"
            },
            {
                "word": "random-access memory",
                "pos": "noun"
            },
            {
                "word": "randomize",
                "pos": "verb"
            },
            {
                "word": "randomly",
                "pos": "adverb"
            },
            {
                "word": "randomness",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to use a method in an experiment, a piece of research, etc. that gives every item an equal chance of being considered; to put things in a random order",
                    "vi": "sử dụng một phương pháp trong một thí nghiệm, một phần của nghiên cứu, v.v. để mọi mục đều có cơ hội được xem xét như nhau; đặt mọi thứ theo thứ tự ngẫu nhiên"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "48a36669fcee401bb5a40722816e3bec",
        "word": "vivisection",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌvɪvɪˈsekʃn/",
            "us": "/ˌvɪvɪˈsekʃn/"
        },
        "nearby": [
            {
                "word": "vividness",
                "pos": "noun"
            },
            {
                "word": "viviparous",
                "pos": "adjective"
            },
            {
                "word": "vivisection",
                "pos": "noun"
            },
            {
                "word": "vivo",
                "pos": ""
            },
            {
                "word": "vixen",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the practice of doing experiments on live animals for medical or scientific research",
                    "vi": "thực hành thí nghiệm trên động vật sống để nghiên cứu khoa học hoặc y tế"
                },
                "examples": []
            }
        ]
    }
]