[
    {
        "id": "1167b114855b4a3a935c3788bc14aa56",
        "word": "mistake",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/mɪˈsteɪk/",
            "us": "/mɪˈsteɪk/"
        },
        "nearby": [
            {
                "word": "mist",
                "pos": "noun"
            },
            {
                "word": "mist",
                "pos": "verb"
            },
            {
                "word": "mistake",
                "pos": "noun"
            },
            {
                "word": "mistake",
                "pos": "verb"
            },
            {
                "word": "mistake for",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an action or an opinion that is not correct, or that produces a result that you did not want",
                    "vi": "một hành động hoặc một ý kiến không đúng hoặc tạo ra một kết quả mà bạn không mong muốn"
                },
                "examples": [
                    {
                        "en": "It's easy to make a mistake.",
                        "vi": "Rất dễ mắc lỗi."
                    },
                    {
                        "en": "Don't worry, we all make mistakes.",
                        "vi": "Đừng lo lắng, tất cả chúng ta đều mắc sai lầm."
                    },
                    {
                        "en": "You are making a big mistake.",
                        "vi": "Bạn đang mắc một sai lầm lớn."
                    },
                    {
                        "en": "Leaving school so young was the biggest mistake of my life.",
                        "vi": "Bỏ học quá trẻ là sai lầm lớn nhất của cuộc đời tôi."
                    },
                    {
                        "en": "a terrible/serious/huge mistake",
                        "vi": "một sai lầm khủng khiếp / nghiêm trọng / lớn"
                    },
                    {
                        "en": "It’s a common mistake (= one that a lot of people make).",
                        "vi": "Đó là một lỗi phổ biến (= một lỗi mà rất nhiều người mắc phải)."
                    },
                    {
                        "en": "You must try to learn from your mistakes.",
                        "vi": "Bạn phải cố gắng học hỏi từ những sai lầm của mình."
                    },
                    {
                        "en": "He is determined not to repeat the mistakes of his predecessors.",
                        "vi": "Anh quyết tâm không lặp lại sai lầm của những người tiền nhiệm."
                    },
                    {
                        "en": "This letter is addressed to someone else—there must be some mistake.",
                        "vi": "Bức thư này được gửi cho một người khác — chắc chắn có một số nhầm lẫn."
                    },
                    {
                        "en": "the mistake of doing something I made the mistake of giving him my address.",
                        "vi": "sai lầm khi làm điều gì đó, tôi đã sai lầm khi cho anh ta địa chỉ của tôi."
                    },
                    {
                        "en": "it is a mistake to do something It would be a mistake to ignore his opinion.",
                        "vi": "đó là một sai lầm khi làm điều gì đó Sẽ là một sai lầm nếu bỏ qua ý kiến của anh ấy."
                    },
                    {
                        "en": "It was a big mistake on my part to have trusted her.",
                        "vi": "Đó là một sai lầm lớn về phía tôi khi đã tin tưởng cô ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "a word, figure, etc. that is not said or written down correctly",
                    "vi": "một từ, con số, v.v. không được nói hoặc viết ra một cách chính xác"
                },
                "examples": [
                    {
                        "en": "It's a common mistake among learners of English.",
                        "vi": "Đó là một lỗi phổ biến ở những người học tiếng Anh."
                    },
                    {
                        "en": "Her essay is full of spelling mistakes.",
                        "vi": "Bài văn của cô ấy đầy lỗi chính tả."
                    },
                    {
                        "en": "If students correct their own mistakes, learning improves.",
                        "vi": "Nếu học sinh tự sửa chữa những sai lầm của mình thì việc học sẽ được cải thiện."
                    },
                    {
                        "en": "mistake (in) doing something The waiter made a mistake (in) adding up the bill.",
                        "vi": "nhầm lẫn (trong) làm điều gì đó Người phục vụ đã mắc lỗi (trong) cộng hóa đơn."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to show that you are sure about the truth of what you have just said",
                    "vi": "được sử dụng để chứng tỏ rằng bạn chắc chắn về sự thật của những gì bạn vừa nói"
                },
                "examples": [
                    {
                        "en": "This is a strange business and no mistake.",
                        "vi": "Đây là một công việc kinh doanh kỳ lạ và không có sai lầm."
                    }
                ]
            },
            {
                "define": {
                    "en": "by accident; without intending to",
                    "vi": "vô tình; mà không có ý định"
                },
                "examples": [
                    {
                        "en": "I took your bag instead of mine by mistake.",
                        "vi": "Tôi đã lấy nhầm túi của bạn thay vì của tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "thinking that something is something else",
                    "vi": "nghĩ rằng một cái gì đó là một cái gì đó khác"
                },
                "examples": [
                    {
                        "en": "Children may eat pills in mistake for sweets.",
                        "vi": "Trẻ em có thể ăn nhầm thuốc với đồ ngọt."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to emphasize what you are saying, especially when you want to warn somebody about something",
                    "vi": "được sử dụng để nhấn mạnh những gì bạn đang nói, đặc biệt là khi bạn muốn cảnh báo ai đó về điều gì đó"
                },
                "examples": [
                    {
                        "en": "Make no mistake (about it), this is one crisis that won’t just go away.",
                        "vi": "Đừng nhầm lẫn (về nó), đây là một cuộc khủng hoảng sẽ không biến mất."
                    }
                ]
            }
        ]
    },
    {
        "id": "806830b81f6e464eaa6b56a10e8f8d4e",
        "word": "disaster",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/dɪˈzɑːstə(r)/",
            "us": "/dɪˈzæstər/"
        },
        "nearby": [
            {
                "word": "disassembler",
                "pos": "noun"
            },
            {
                "word": "disassociate",
                "pos": "verb"
            },
            {
                "word": "disaster",
                "pos": "noun"
            },
            {
                "word": "disaster area",
                "pos": "noun"
            },
            {
                "word": "disastrous",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an unexpected event, such as a very bad accident, a flood or a fire, that kills a lot of people or causes a lot of damage",
                    "vi": "một sự kiện bất ngờ, chẳng hạn như một tai nạn rất tồi tệ, lũ lụt hoặc hỏa hoạn, giết chết nhiều người hoặc gây ra nhiều thiệt hại"
                },
                "examples": [
                    {
                        "en": "the world's worst humanitarian disaster",
                        "vi": "thảm họa nhân đạo tồi tệ nhất thế giới"
                    },
                    {
                        "en": "an environmental/ecological disaster",
                        "vi": "một thảm họa môi trường / sinh thái"
                    },
                    {
                        "en": "a rail/mining/tsunami disaster",
                        "vi": "thảm họa đường sắt / khai thác mỏ / sóng thần"
                    },
                    {
                        "en": "in a disaster Thousands died in the disaster.",
                        "vi": "trong một thảm họa Hàng ngàn người chết trong thảm họa."
                    },
                    {
                        "en": "They provided more than $2.3 billion in disaster relief.",
                        "vi": "Họ đã cung cấp hơn 2,3 tỷ đô la cứu trợ thiên tai."
                    },
                    {
                        "en": "a disaster area/zone",
                        "vi": "một khu vực / khu vực thiên tai"
                    },
                    {
                        "en": "It was taking years for disaster victims to settle and rebuild.",
                        "vi": "Các nạn nhân thiên tai đã mất nhiều năm để định cư và xây dựng lại."
                    },
                    {
                        "en": "Given the threat of earthquake, we recognized the need for disaster recovery centres.",
                        "vi": "Trước mối đe dọa của động đất, chúng tôi nhận thấy sự cần thiết của các trung tâm khắc phục hậu quả thiên tai."
                    }
                ]
            },
            {
                "define": {
                    "en": "a very bad situation that causes problems",
                    "vi": "một tình huống rất xấu gây ra vấn đề"
                },
                "examples": [
                    {
                        "en": "Losing your job doesn't have to be such a disaster.",
                        "vi": "Mất việc không phải là một thảm họa như vậy."
                    },
                    {
                        "en": "Disaster struck when the wheel came off.",
                        "vi": "Tai họa ập đến khi bánh xe chệch choạc."
                    },
                    {
                        "en": "Archie has to act quickly to avert disaster.",
                        "vi": "Archie phải hành động nhanh chóng để ngăn chặn thảm họa."
                    },
                    {
                        "en": "They could think of no way to avoid the impending disaster.",
                        "vi": "Họ không thể nghĩ ra cách nào để tránh được thảm họa sắp xảy ra."
                    },
                    {
                        "en": "Many business partnerships end in disaster.",
                        "vi": "Nhiều quan hệ đối tác kinh doanh kết thúc trong thảm họa."
                    },
                    {
                        "en": "disaster for somebody The discovery of the disease among sheep spells financial disaster for farmers.",
                        "vi": "thảm họa cho ai đó Việc phát hiện ra căn bệnh giữa những con cừu gieo rắc thảm họa tài chính cho người nông dân."
                    },
                    {
                        "en": "Letting her organize the party is a recipe for disaster (= something that is likely to go badly wrong).",
                        "vi": "Để cô ấy tổ chức bữa tiệc là một công thức dẫn đến thảm họa (= điều gì đó có khả năng xảy ra sai lầm nghiêm trọng)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a complete failure",
                    "vi": "một sự thất bại hoàn toàn"
                },
                "examples": [
                    {
                        "en": "As a teacher, he's a disaster.",
                        "vi": "Là một giáo viên, anh ấy là một thảm họa."
                    },
                    {
                        "en": "The play's first night was a total disaster.",
                        "vi": "Đêm đầu tiên của vở kịch là một thảm họa hoàn toàn."
                    },
                    {
                        "en": "a complete/total/absolute/unmitigated disaster",
                        "vi": "một thảm họa hoàn toàn / toàn bộ / tuyệt đối / không thể khắc phục được"
                    }
                ]
            },
            {
                "define": {
                    "en": "a thing or person that is very likely to cause danger or a problem in the future because of the condition it is in or the way they behave",
                    "vi": "một vật hoặc người rất có thể gây ra nguy hiểm hoặc vấn đề trong tương lai vì tình trạng của nó hoặc cách họ cư xử"
                },
                "examples": [
                    {
                        "en": "Any one of these nuclear plants may be a disaster waiting to happen.",
                        "vi": "Bất kỳ một trong những nhà máy hạt nhân này đều có thể là một thảm họa đang chực chờ xảy ra."
                    }
                ]
            }
        ]
    },
    {
        "id": "2a503b0a5ff84186b71ae38c34bd886f",
        "word": "attempt",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/əˈtempt/",
            "us": "/əˈtempt/"
        },
        "nearby": [
            {
                "word": "attainment",
                "pos": "noun"
            },
            {
                "word": "attar",
                "pos": "noun"
            },
            {
                "word": "attempt",
                "pos": "noun"
            },
            {
                "word": "attempt",
                "pos": "verb"
            },
            {
                "word": "attempted",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an act of trying to do something, especially something difficult, often with no success",
                    "vi": "một hành động cố gắng làm điều gì đó, đặc biệt là điều gì đó khó khăn, thường không thành công"
                },
                "examples": [
                    {
                        "en": "I passed my driving test at the first attempt.",
                        "vi": "Tôi đã vượt qua bài kiểm tra lái xe của mình ngay lần thử đầu tiên."
                    },
                    {
                        "en": "attempt to do something They made no attempt to escape.",
                        "vi": "cố gắng làm điều gì đó Họ không cố gắng trốn thoát."
                    },
                    {
                        "en": "The launch will go ahead despite the failure of previous attempts to create an online business.",
                        "vi": "Việc ra mắt sẽ được tiến hành bất chấp sự thất bại của những nỗ lực trước đó nhằm tạo ra một doanh nghiệp trực tuyến."
                    },
                    {
                        "en": "Why have repeated attempts to find a permanent solution to the problem failed ?",
                        "vi": "Tại sao những nỗ lực lặp đi lặp lại để tìm ra giải pháp lâu dài cho vấn đề không thành công?"
                    },
                    {
                        "en": "They were frustrated in their attempts to get an explanation.",
                        "vi": "Họ đã thất vọng trong nỗ lực tìm kiếm lời giải thích."
                    },
                    {
                        "en": "He has failed in three previous attempts to win the world title.",
                        "vi": "Anh ấy đã thất bại trong ba lần trước đó để giành chức vô địch thế giới."
                    },
                    {
                        "en": "in an attempt to do something Two factories were closed in an attempt to cut costs.",
                        "vi": "trong một nỗ lực để làm điều gì đó Hai nhà máy đã bị đóng cửa trong một nỗ lực để cắt giảm chi phí."
                    },
                    {
                        "en": "attempt at something The couple made an unsuccessful attempt at a compromise.",
                        "vi": "cố gắng vào một cái gì đó Cặp đôi đã thực hiện một nỗ lực không thành công với một thỏa hiệp."
                    },
                    {
                        "en": "attempt at doing something They were praised for making an attempt at solving the problem.",
                        "vi": "cố gắng làm điều gì đó Họ được khen ngợi vì đã nỗ lực giải quyết vấn đề."
                    }
                ]
            },
            {
                "define": {
                    "en": "an act of trying to kill somebody",
                    "vi": "một hành động cố gắng giết ai đó"
                },
                "examples": [
                    {
                        "en": "attempt on somebody/sb’s life Someone has made an attempt on the president's life.",
                        "vi": "Cố gắng vào cuộc sống của ai đó / sb Ai đó đã cố gắng vào cuộc sống của tổng thống."
                    },
                    {
                        "en": "an assassination attempt",
                        "vi": "một vụ ám sát"
                    },
                    {
                        "en": "a murder/suicide attempt",
                        "vi": "một vụ giết người / cố gắng tự sát"
                    }
                ]
            },
            {
                "define": {
                    "en": "an effort to do better than something, such as a very good performance in sport",
                    "vi": "nỗ lực để làm tốt hơn điều gì đó, chẳng hạn như thành tích rất tốt trong thể thao"
                },
                "examples": [
                    {
                        "en": "his attempt on the world land speed record",
                        "vi": "nỗ lực của anh ấy về kỷ lục tốc độ đất liền thế giới"
                    },
                    {
                        "en": "a world-record attempt",
                        "vi": "một nỗ lực kỷ lục thế giới"
                    }
                ]
            },
            {
                "define": {
                    "en": "a thing that you produce as a result of trying to make or achieve something",
                    "vi": "một thứ mà bạn tạo ra là kết quả của việc cố gắng tạo ra hoặc đạt được điều gì đó"
                },
                "examples": [
                    {
                        "en": "She picked her first attempt at a letter out of the bin.",
                        "vi": "Cô ấy đã chọn lần thử đầu tiên với một lá thư trong thùng."
                    }
                ]
            }
        ]
    },
    {
        "id": "811d7ac02b7e4649ac91d5c11d71ce13",
        "word": "collapse",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/kəˈlæps/",
            "us": "/kəˈlæps/"
        },
        "nearby": [
            {
                "word": "collapsar",
                "pos": "noun"
            },
            {
                "word": "collapse",
                "pos": "verb"
            },
            {
                "word": "collapse",
                "pos": "noun"
            },
            {
                "word": "collapsed",
                "pos": "adjective"
            },
            {
                "word": "collapsible",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a sudden failure of something, such as an institution, a business or a course of action",
                    "vi": "một thất bại đột ngột của một cái gì đó, chẳng hạn như một tổ chức, một doanh nghiệp hoặc một quá trình hành động"
                },
                "examples": [
                    {
                        "en": "the collapse of the Soviet Union",
                        "vi": "sự sụp đổ của Liên Xô"
                    },
                    {
                        "en": "The peace talks were on the verge of collapse.",
                        "vi": "Các cuộc đàm phán hòa bình đang trên bờ vực sụp đổ."
                    },
                    {
                        "en": "a decision which will push the country a step closer to economic collapse",
                        "vi": "một quyết định sẽ đẩy đất nước đến gần hơn với sự sụp đổ kinh tế"
                    },
                    {
                        "en": "the collapse of law and order in the area",
                        "vi": "sự sụp đổ của luật pháp và trật tự trong khu vực"
                    },
                    {
                        "en": "They thought their strategy would cause the collapse of the regime.",
                        "vi": "Họ nghĩ rằng chiến lược của họ sẽ gây ra sự sụp đổ của chế độ."
                    },
                    {
                        "en": "The articles they published led to the collapse of the trial.",
                        "vi": "Các bài báo họ đăng đã dẫn đến sự sụp đổ của phiên tòa."
                    },
                    {
                        "en": "The present system is on the brink of collapse.",
                        "vi": "Hệ thống hiện tại đang trên bờ vực sụp đổ."
                    }
                ]
            },
            {
                "define": {
                    "en": "the action of a building suddenly falling",
                    "vi": "hành động của một tòa nhà đột nhiên đổ xuống"
                },
                "examples": [
                    {
                        "en": "The walls were strengthened to protect them from collapse.",
                        "vi": "Các bức tường đã được gia cố để bảo vệ chúng khỏi bị sụp đổ."
                    },
                    {
                        "en": "the sudden collapse of the bridge",
                        "vi": "sự sụp đổ đột ngột của cây cầu"
                    }
                ]
            },
            {
                "define": {
                    "en": "a medical condition when a person suddenly becomes very ill, or when somebody falls because they are ill or weak",
                    "vi": "một tình trạng y tế khi một người đột nhiên trở nên ốm nặng, hoặc khi ai đó ngã vì họ bị ốm hoặc yếu"
                },
                "examples": [
                    {
                        "en": "a state of mental/nervous collapse",
                        "vi": "trạng thái suy sụp tinh thần / thần kinh"
                    },
                    {
                        "en": "She was taken to hospital after her collapse at work.",
                        "vi": "Cô đã được đưa đến bệnh viện sau khi suy sụp trong công việc."
                    }
                ]
            },
            {
                "define": {
                    "en": "a sudden fall in value",
                    "vi": "giá trị giảm đột ngột"
                },
                "examples": [
                    {
                        "en": "Shares suffered a fresh collapse today.",
                        "vi": "Cổ phiếu bị sụt giảm mới hôm nay."
                    },
                    {
                        "en": "the collapse of share prices/the dollar/the market",
                        "vi": "sự sụp đổ của giá cổ phiếu / đô la / thị trường"
                    },
                    {
                        "en": "collapse in something the collapse in the price of oil",
                        "vi": "sụp đổ trong một cái gì đó sự sụp đổ của giá dầu"
                    }
                ]
            }
        ]
    },
    {
        "id": "6dd2b46215f446649d40d501cd95c426",
        "word": "defeat",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/dɪˈfiːt/",
            "us": "/dɪˈfiːt/"
        },
        "nearby": [
            {
                "word": "defaulter",
                "pos": "noun"
            },
            {
                "word": "defeat",
                "pos": "verb"
            },
            {
                "word": "defeat",
                "pos": "noun"
            },
            {
                "word": "defeated",
                "pos": "adjective"
            },
            {
                "word": "defeatism",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "failure to win or to be successful",
                    "vi": "thất bại để giành chiến thắng hoặc thành công"
                },
                "examples": [
                    {
                        "en": "The party faces defeat in the election.",
                        "vi": "Đảng đối mặt với thất bại trong cuộc bầu cử."
                    },
                    {
                        "en": "They suffered a narrow defeat in the final.",
                        "vi": "Họ chịu thất bại sít sao trong trận chung kết."
                    },
                    {
                        "en": "a heavy/humiliating/crushing defeat",
                        "vi": "một thất bại nặng nề / nhục nhã / nghiền nát"
                    },
                    {
                        "en": "The world champion has only had two defeats in 20 fights.",
                        "vi": "Nhà vô địch thế giới chỉ có hai thất bại trong 20 trận đấu."
                    },
                    {
                        "en": "They finally had to admit defeat (= stop trying to be successful).",
                        "vi": "Cuối cùng họ đã phải thừa nhận thất bại (= ngừng cố gắng để thành công)."
                    },
                    {
                        "en": "to concede/accept defeat",
                        "vi": "nhượng bộ / chấp nhận thất bại"
                    },
                    {
                        "en": "defeat by somebody their defeat by the Brazilians",
                        "vi": "đánh bại bởi ai đó thất bại của họ trước người Brazil"
                    },
                    {
                        "en": "defeat against somebody last week's defeat against Manchester United",
                        "vi": "thất bại trước ai đó thất bại tuần trước trước Manchester United"
                    },
                    {
                        "en": "a punishing defeat at the hands of Iceland in the World Cup",
                        "vi": "một thất bại trừng phạt dưới tay Iceland ở World Cup"
                    },
                    {
                        "en": "in defeat He was gracious in defeat, acknowledging his opponent's greater skill.",
                        "vi": "trong thất bại Anh ta tỏ ra nhã nhặn trong thất bại, thừa nhận kỹ năng tuyệt vời hơn của đối thủ."
                    },
                    {
                        "en": "a series of small victories and defeats",
                        "vi": "một loạt các chiến thắng và thất bại nhỏ"
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of winning a victory over somebody/something",
                    "vi": "hành động giành chiến thắng trước ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "The army inflicted a heavy defeat on rebel forces.",
                        "vi": "Quân đội đã gây ra một thất bại nặng nề cho lực lượng nổi dậy."
                    },
                    {
                        "en": "the defeat of fascism",
                        "vi": "sự thất bại của chủ nghĩa phát xít"
                    }
                ]
            },
            {
                "define": {
                    "en": "to win something even though it seemed up until the last moment that you would lose",
                    "vi": "để giành được một cái gì đó mặc dù có vẻ như cho đến giây phút cuối cùng bạn sẽ thua"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "b417405a6a4e404ca9f21aa43dd47993",
        "word": "failure",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈfeɪljə(r)/",
            "us": "/ˈfeɪljər/"
        },
        "nearby": [
            {
                "word": "failing",
                "pos": "preposition"
            },
            {
                "word": "fail-safe",
                "pos": "adjective"
            },
            {
                "word": "failure",
                "pos": "noun"
            },
            {
                "word": "fain",
                "pos": "adverb"
            },
            {
                "word": "faint",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "lack of success in doing or achieving something",
                    "vi": "thiếu thành công trong việc làm hoặc đạt được điều gì đó"
                },
                "examples": [
                    {
                        "en": "The success or failure of the plan depends on you.",
                        "vi": "Kế hoạch thành công hay thất bại phụ thuộc vào bạn."
                    },
                    {
                        "en": "She is still coming to terms with the failure of her marriage.",
                        "vi": "Cô ấy vẫn đang phải đối mặt với sự thất bại trong cuộc hôn nhân của mình."
                    },
                    {
                        "en": "The attempt was doomed to failure.",
                        "vi": "Nỗ lực đã thất bại."
                    },
                    {
                        "en": "All my efforts ended in failure.",
                        "vi": "Mọi nỗ lực của tôi đều thất bại."
                    },
                    {
                        "en": "the problems of economic failure and increasing unemployment",
                        "vi": "các vấn đề của sự thất bại kinh tế và tỷ lệ thất nghiệp ngày càng tăng"
                    },
                    {
                        "en": "Their bid to win the contract resulted in abject failure.",
                        "vi": "Sự cố gắng giành được hợp đồng của họ đã dẫn đến thất bại thảm hại."
                    },
                    {
                        "en": "The decision to withdraw funding represents a failure of imagination.",
                        "vi": "Quyết định rút tiền tài trợ thể hiện một sự thất bại trong tưởng tượng."
                    },
                    {
                        "en": "the intelligence failures that preceded the terrorist attacks",
                        "vi": "những thất bại tình báo trước các cuộc tấn công khủng bố"
                    }
                ]
            },
            {
                "define": {
                    "en": "a person or thing that is not successful",
                    "vi": "một người hoặc một điều không thành công"
                },
                "examples": [
                    {
                        "en": "The whole thing was a complete failure.",
                        "vi": "Toàn bộ là một thất bại hoàn toàn."
                    },
                    {
                        "en": "A team learns from experience, both successes and failures.",
                        "vi": "Một nhóm học hỏi từ kinh nghiệm, cả thành công và thất bại."
                    },
                    {
                        "en": "failure as something He was a failure as a teacher.",
                        "vi": "thất bại như một cái gì đó Ông là một thất bại với tư cách là một giáo viên."
                    }
                ]
            },
            {
                "define": {
                    "en": "an act of not doing something, especially something that you are expected to do",
                    "vi": "một hành động không làm điều gì đó, đặc biệt là điều gì đó mà bạn dự kiến sẽ làm"
                },
                "examples": [
                    {
                        "en": "failure to do something Failure to comply with the regulations will result in prosecution.",
                        "vi": "không làm được việc Không tuân thủ các quy định sẽ bị truy tố."
                    },
                    {
                        "en": "the city's failure to provide an efficient public transport system",
                        "vi": "thành phố không cung cấp một hệ thống giao thông công cộng hiệu quả"
                    },
                    {
                        "en": "the government's failure to carry out reforms in the energy sector",
                        "vi": "chính phủ không thực hiện cải cách trong lĩnh vực năng lượng"
                    },
                    {
                        "en": "His confession followed repeated failures to appear in court.",
                        "vi": "Lời thú tội của anh ta sau nhiều lần thất bại trong việc hầu tòa."
                    },
                    {
                        "en": "failure of somebody/something to do something the failure of the United Nations to maintain food supplies",
                        "vi": "sự thất bại của ai đó / điều gì đó để làm điều gì đó sự thất bại của Liên hợp quốc trong việc duy trì nguồn cung cấp lương thực"
                    },
                    {
                        "en": "failure by somebody/something to do something a report on the failure by the police to protect her",
                        "vi": "thất bại của ai đó / việc gì đó để làm điều gì đó Báo cáo về việc cảnh sát không bảo vệ cô ấy"
                    }
                ]
            },
            {
                "define": {
                    "en": "the state of not working correctly or as expected; an occasion when this happens",
                    "vi": "trạng thái hoạt động không chính xác hoặc như mong đợi; một dịp khi điều này xảy ra"
                },
                "examples": [
                    {
                        "en": "patients suffering from heart/kidney/liver failure",
                        "vi": "bệnh nhân bị suy tim / thận / gan"
                    },
                    {
                        "en": "renal/respiratory failure",
                        "vi": "suy thận / hô hấp"
                    },
                    {
                        "en": "Production has been hampered by mechanical failure.",
                        "vi": "Sản xuất đã bị cản trở bởi lỗi cơ học."
                    },
                    {
                        "en": "A power failure plunged everything into darkness.",
                        "vi": "Sự cố mất điện khiến mọi thứ chìm trong bóng tối."
                    },
                    {
                        "en": "The cause of the crash was given as engine failure.",
                        "vi": "Nguyên nhân của vụ tai nạn được đưa ra là do hỏng động cơ."
                    },
                    {
                        "en": "Poor maintenance caused the failure of two electricity generators.",
                        "vi": "Bảo dưỡng không tốt khiến hai máy phát điện bị hỏng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a situation in which a business has to close because it is not successful",
                    "vi": "một tình huống trong đó một doanh nghiệp phải đóng cửa vì nó không thành công"
                },
                "examples": [
                    {
                        "en": "There has been an alarming increase in business failures.",
                        "vi": "Đã có một sự gia tăng đáng báo động của các thất bại kinh doanh."
                    },
                    {
                        "en": "Are we going to see more closures or failures in the ISP business?",
                        "vi": "Chúng ta sẽ thấy nhiều lần đóng cửa hoặc thất bại hơn trong hoạt động kinh doanh của ISP?"
                    },
                    {
                        "en": "Business failures rose by 30% in 2018.",
                        "vi": "Thất bại trong kinh doanh đã tăng 30% trong năm 2018."
                    }
                ]
            },
            {
                "define": {
                    "en": "a situation in which crops do not grow correctly and do not produce food",
                    "vi": "một tình huống trong đó cây trồng không phát triển đúng cách và không tạo ra lương thực"
                },
                "examples": [
                    {
                        "en": "Bad weather has resulted in crop failure.",
                        "vi": "Thời tiết xấu đã làm mất mùa."
                    }
                ]
            }
        ]
    },
    {
        "id": "852ec748943d4229ada8fb70d5473743",
        "word": "loser",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈluːzə(r)/",
            "us": "/ˈluːzər/"
        },
        "nearby": [
            {
                "word": "lose out",
                "pos": "phrasal verb"
            },
            {
                "word": "lose out to",
                "pos": "phrasal verb"
            },
            {
                "word": "loser",
                "pos": "noun"
            },
            {
                "word": "lose yourself in",
                "pos": "phrasal verb"
            },
            {
                "word": "loss",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who is defeated in a competition",
                    "vi": "một người bị đánh bại trong một cuộc thi"
                },
                "examples": [
                    {
                        "en": "winners and losers",
                        "vi": "ngươi thăng va kẻ thua"
                    },
                    {
                        "en": "He’s a good/bad loser (= he accepts defeat well/badly).",
                        "vi": "Anh ấy là một kẻ thua cuộc tốt / xấu (= anh ấy chấp nhận thất bại tốt / xấu)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who is regularly unsuccessful, especially when you have a low opinion of them",
                    "vi": "một người thường xuyên không thành công, đặc biệt là khi bạn có đánh giá thấp về họ"
                },
                "examples": [
                    {
                        "en": "She's one of life's losers.",
                        "vi": "Cô ấy là một trong những kẻ thất bại trong cuộc sống."
                    },
                    {
                        "en": "He's a born loser.",
                        "vi": "Anh ấy là một kẻ thất bại bẩm sinh."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who suffers because of a particular action, decision, etc.",
                    "vi": "một người đau khổ vì một hành động, quyết định cụ thể, v.v."
                },
                "examples": [
                    {
                        "en": "The real losers in all of this are the students.",
                        "vi": "Những người thực sự thất bại trong tất cả những điều này là học sinh."
                    },
                    {
                        "en": "If the teachers go on strike, the children are the ultimate losers.",
                        "vi": "Nếu giáo viên đình công, trẻ em là người thua cuộc cuối cùng."
                    }
                ]
            }
        ]
    },
    {
        "id": "c7b35468f5194f2db7c4b2495f78b6b4",
        "word": "loss",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/lɒs/",
            "us": "/lɔːs/"
        },
        "nearby": [
            {
                "word": "loser",
                "pos": "noun"
            },
            {
                "word": "lose yourself in",
                "pos": "phrasal verb"
            },
            {
                "word": "loss",
                "pos": "noun"
            },
            {
                "word": "loss adjuster",
                "pos": "noun"
            },
            {
                "word": "loss-leader",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the state of no longer having something or as much of something; the process that leads to this",
                    "vi": "trạng thái không còn có một cái gì đó hoặc nhiều cái gì đó; quá trình dẫn đến điều này"
                },
                "examples": [
                    {
                        "en": "I want to report the loss of a package.",
                        "vi": "Tôi muốn báo cáo việc mất một gói hàng."
                    },
                    {
                        "en": "Insure your instrument against loss or damage.",
                        "vi": "Bảo đảm thiết bị của bạn không bị mất hoặc hư hỏng."
                    },
                    {
                        "en": "weight loss",
                        "vi": "giảm cân"
                    },
                    {
                        "en": "hearing/memory loss",
                        "vi": "giảm thính lực / trí nhớ"
                    },
                    {
                        "en": "The closure of the factory will lead to a number of job losses.",
                        "vi": "Việc đóng cửa nhà máy sẽ dẫn đến một số người mất việc làm."
                    },
                    {
                        "en": "When she died I was filled with a sense of loss.",
                        "vi": "Khi cô ấy mất, tôi tràn ngập cảm giác mất mát."
                    },
                    {
                        "en": "loss of something He suffered a loss of confidence.",
                        "vi": "mất một cái gì đó Anh ấy bị mất tự tin."
                    },
                    {
                        "en": "loss of earnings/income (= the money you do not earn because you are prevented from working)",
                        "vi": "mất thu nhập / thu nhập (= số tiền bạn không kiếm được vì bạn bị ngăn cản làm việc)"
                    },
                    {
                        "en": "The loss of her job was a terrible blow.",
                        "vi": "Việc cô ấy bị mất việc là một cú đánh khủng khiếp."
                    }
                ]
            },
            {
                "define": {
                    "en": "money that has been lost by a business or an organization",
                    "vi": "tiền đã bị thất thoát bởi một doanh nghiệp hoặc một tổ chức"
                },
                "examples": [
                    {
                        "en": "The company has announced net losses of $1.5 million.",
                        "vi": "Công ty đã thông báo lỗ ròng 1,5 triệu đô la."
                    },
                    {
                        "en": "The banks incurred huge losses.",
                        "vi": "Các ngân hàng bị lỗ rất lớn."
                    },
                    {
                        "en": "loss on something We made a loss on (= lost money on) the deal.",
                        "vi": "thua lỗ đối với một thứ gì đó Chúng tôi đã lỗ khi (= mất tiền khi) giao dịch."
                    }
                ]
            },
            {
                "define": {
                    "en": "the death of a person",
                    "vi": "cái chết của một người"
                },
                "examples": [
                    {
                        "en": "He is mourning the loss of his wife.",
                        "vi": "Anh ấy đang để tang cho sự mất mát của người vợ của mình."
                    },
                    {
                        "en": "the tragic loss of a child",
                        "vi": "sự mất mát bi thảm của một đứa trẻ"
                    },
                    {
                        "en": "Enemy troops suffered heavy losses.",
                        "vi": "Quân địch bị tổn thất nặng."
                    },
                    {
                        "en": "The drought caused widespread loss of life.",
                        "vi": "Hạn hán gây ra thiệt hại về nhân mạng trên diện rộng."
                    }
                ]
            },
            {
                "define": {
                    "en": "the disadvantage that is caused when somebody leaves, or when a useful or valuable object is taken away; a person who causes a disadvantage by leaving",
                    "vi": "sự bất lợi gây ra khi ai đó rời đi, hoặc khi một đồ vật hữu ích hoặc có giá trị bị lấy đi; một người gây ra bất lợi bằng cách bỏ đi"
                },
                "examples": [
                    {
                        "en": "a loss to somebody/something Her departure is a big loss to the school.",
                        "vi": "một mất mát đối với ai đó / điều gì đó Sự ra đi của cô ấy là một mất mát lớn đối với nhà trường."
                    },
                    {
                        "en": "She will be a great loss to the company.",
                        "vi": "Cô ấy sẽ là một tổn thất lớn cho công ty."
                    },
                    {
                        "en": "She wouldn't be able to attend the lecture, which was no great loss.",
                        "vi": "Cô ấy sẽ không thể tham dự buổi diễn thuyết, đó không phải là một mất mát lớn."
                    },
                    {
                        "en": "His death is a sad loss to all who knew him.",
                        "vi": "Cái chết của anh ấy là một mất mát đau buồn cho tất cả những người biết anh ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "a failure to win a contest",
                    "vi": "thất bại trong việc giành chiến thắng trong một cuộc thi"
                },
                "examples": [
                    {
                        "en": "Brazil’s 2–1 loss to Argentina",
                        "vi": "Brazil thua 2–1 trước Argentina"
                    }
                ]
            },
            {
                "define": {
                    "en": "not knowing what to say or do",
                    "vi": "không biết phải nói gì hoặc làm gì"
                },
                "examples": [
                    {
                        "en": "His comments left me at a loss for words.",
                        "vi": "Những lời bình luận của anh ấy khiến tôi không nói nên lời."
                    },
                    {
                        "en": "I'm at a loss what to do next.",
                        "vi": "Tôi không biết phải làm gì tiếp theo."
                    },
                    {
                        "en": "We are at a loss to understand his actions.",
                        "vi": "Chúng tôi không hiểu được hành động của anh ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "in a way that loses you money",
                    "vi": "theo cách khiến bạn mất tiền"
                },
                "examples": [
                    {
                        "en": "We are now operating at a loss.",
                        "vi": "Hiện chúng tôi đang hoạt động thua lỗ."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that if somebody chooses not to do something, they will not obtain a benefit they could have had",
                    "vi": "được sử dụng để nói rằng nếu ai đó chọn không làm điều gì đó, họ sẽ không đạt được lợi ích mà họ có thể có"
                },
                "examples": [
                    {
                        "en": "If people can't appreciate how great this film is, it's their loss.",
                        "vi": "Nếu mọi người không thể đánh giá cao bộ phim này tuyệt vời như thế nào thì đó là sự mất mát của họ."
                    },
                    {
                        "en": "I can see you don't trust me. Well, that's your loss",
                        "vi": "Tôi có thể thấy bạn không tin tưởng tôi. Chà, đó là mất mát của bạn"
                    }
                ]
            },
            {
                "define": {
                    "en": "to stop doing something that is not successful before the situation becomes even worse",
                    "vi": "ngừng làm điều gì đó không thành công trước khi tình hình trở nên tồi tệ hơn"
                },
                "examples": [
                    {
                        "en": "I decided to cut my losses and move back to England.",
                        "vi": "Tôi quyết định cắt lỗ và quay trở lại Anh."
                    },
                    {
                        "en": "He decided to cut his losses and sell the shares before they sank further.",
                        "vi": "Anh quyết định cắt lỗ và bán cổ phiếu trước khi chúng chìm sâu hơn."
                    }
                ]
            },
            {
                "define": {
                    "en": "the state of being less respected by other people or looking stupid because of something you have done",
                    "vi": "trạng thái ít được người khác tôn trọng hoặc trông ngu ngốc vì điều gì đó bạn đã làm"
                },
                "examples": [
                    {
                        "en": "Failure to pass the exams means a massive loss of face for the students and their parents.",
                        "vi": "Không vượt qua được kỳ thi đồng nghĩa với việc học sinh và cha mẹ học sinh bị mất thể diện rất lớn."
                    }
                ]
            }
        ]
    },
    {
        "id": "e97a194a4b5246e6821b227dbabb83e6",
        "word": "disaster area",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/dɪˈzɑːstər eəriə/",
            "us": "/dɪˈzæstər eriə/"
        },
        "nearby": [
            {
                "word": "disassociate",
                "pos": "verb"
            },
            {
                "word": "disaster",
                "pos": "noun"
            },
            {
                "word": "disaster area",
                "pos": "noun"
            },
            {
                "word": "disastrous",
                "pos": "adjective"
            },
            {
                "word": "disastrously",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a place where a disaster has happened and that needs special help",
                    "vi": "nơi đã xảy ra thảm họa và cần được giúp đỡ đặc biệt"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a place or situation that has a lot of problems, is a failure, or is badly organized",
                    "vi": "một địa điểm hoặc tình huống có nhiều vấn đề, thất bại hoặc được tổ chức tồi"
                },
                "examples": [
                    {
                        "en": "Housing is another disaster area for the government.",
                        "vi": "Nhà ở là một khu vực thiên tai khác đối với chính phủ."
                    },
                    {
                        "en": "His office was a disaster area with papers piled everywhere.",
                        "vi": "Văn phòng của ông là một khu vực thảm họa với giấy tờ chất đống khắp nơi."
                    }
                ]
            }
        ]
    },
    {
        "id": "0eaf1014d6574a66a4ac61ace283345d",
        "word": "fail",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/feɪl/",
            "us": "/feɪl/"
        },
        "nearby": [
            {
                "word": "Fahrenheit",
                "pos": "noun"
            },
            {
                "word": "fail",
                "pos": "verb"
            },
            {
                "word": "fail",
                "pos": "noun"
            },
            {
                "word": "failed",
                "pos": "adjective"
            },
            {
                "word": "failed state",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the result of an exam in which a person is not successful",
                    "vi": "kết quả của một kỳ thi mà một người không thành công"
                },
                "examples": [
                    {
                        "en": "I got three passes and one fail.",
                        "vi": "Tôi có ba đường chuyền và một lần thất bại."
                    }
                ]
            },
            {
                "define": {
                    "en": "a mistake or lack of success in doing something",
                    "vi": "một sai lầm hoặc thiếu thành công khi làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "The show was an epic fail.",
                        "vi": "Buổi biểu diễn là một thất bại hoành tráng."
                    },
                    {
                        "en": "For the sake of that potential, I'm willing to put up with some fail.",
                        "vi": "Vì lợi ích của tiềm năng đó, tôi sẵn sàng chấp nhận một số thất bại."
                    }
                ]
            },
            {
                "define": {
                    "en": "when you tell somebody to do something without fail, you are telling them that they must do it",
                    "vi": "khi bạn nói với ai đó làm điều gì đó mà không thất bại, bạn đang nói với họ rằng họ phải làm điều đó"
                },
                "examples": [
                    {
                        "en": "I want you here by two o'clock without fail.",
                        "vi": "Tôi muốn bạn ở đây trước hai giờ mà không thất bại."
                    }
                ]
            },
            {
                "define": {
                    "en": "always",
                    "vi": "luôn"
                },
                "examples": [
                    {
                        "en": "He hands in his assignment every week without fail.",
                        "vi": "Anh ấy giao nhiệm vụ của mình hàng tuần mà không thất bại."
                    }
                ]
            }
        ]
    },
    {
        "id": "2977e03b5eaa4f00876d3b090de17799",
        "word": "instability",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌɪnstəˈbɪləti/",
            "us": "/ˌɪnstəˈbɪləti/"
        },
        "nearby": [
            {
                "word": "inspiring",
                "pos": "adjective"
            },
            {
                "word": "inspo",
                "pos": "noun"
            },
            {
                "word": "instability",
                "pos": "noun"
            },
            {
                "word": "Instagram",
                "pos": "noun"
            },
            {
                "word": "install",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the quality or state of being likely to change or fail suddenly",
                    "vi": "chất lượng hoặc trạng thái có khả năng thay đổi hoặc hỏng hóc đột ngột"
                },
                "examples": [
                    {
                        "en": "political and economic instability",
                        "vi": "bất ổn chính trị và kinh tế"
                    }
                ]
            },
            {
                "define": {
                    "en": "a mental condition in which somebody’s behaviour is likely to change suddenly",
                    "vi": "một tình trạng tinh thần trong đó hành vi của ai đó có khả năng thay đổi đột ngột"
                },
                "examples": [
                    {
                        "en": "mental/emotional instability",
                        "vi": "tinh thần / cảm xúc bất ổn"
                    },
                    {
                        "en": "He showed increasing signs of mental instability.",
                        "vi": "Anh ta ngày càng có dấu hiệu bất ổn về tinh thần."
                    }
                ]
            }
        ]
    },
    {
        "id": "3db7f66d50ee43688c9d4ee98bb03e16",
        "word": "malfunction",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌmælˈfʌŋkʃn/",
            "us": "/ˌmælˈfʌŋkʃn/"
        },
        "nearby": [
            {
                "word": "malformed",
                "pos": "adjective"
            },
            {
                "word": "malfunction",
                "pos": "verb"
            },
            {
                "word": "malfunction",
                "pos": "noun"
            },
            {
                "word": "mali",
                "pos": "noun"
            },
            {
                "word": "Mali",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "failure of a machine, etc. to work correctly",
                    "vi": "hỏng máy, v.v. để hoạt động bình thường"
                },
                "examples": [
                    {
                        "en": "The drug caused a malfunction in the brain.",
                        "vi": "Thuốc gây ra sự cố trong não."
                    },
                    {
                        "en": "There was no evidence of technical malfunction.",
                        "vi": "Không có bằng chứng về sự cố kỹ thuật."
                    }
                ]
            }
        ]
    },
    {
        "id": "4e3561171eff482199663d231c2a1640",
        "word": "underdog",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈʌndədɒɡ/",
            "us": "/ˈʌndərdɔːɡ/"
        },
        "nearby": [
            {
                "word": "underdeveloped",
                "pos": "adjective"
            },
            {
                "word": "underdevelopment",
                "pos": "noun"
            },
            {
                "word": "underdog",
                "pos": "noun"
            },
            {
                "word": "underdone",
                "pos": "adjective"
            },
            {
                "word": "underdressed",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person, team, country, etc. that is thought to be in a weaker position than others and therefore not likely to be successful, win a competition, etc.",
                    "vi": "một người, đội, quốc gia, v.v. được cho là ở vị trí yếu hơn những người khác và do đó không có khả năng thành công, giành chiến thắng trong một cuộc thi, v.v."
                },
                "examples": [
                    {
                        "en": "Before the game we were definitely the underdogs.",
                        "vi": "Trước trận đấu, chúng tôi chắc chắn là đội chiếu dưới."
                    },
                    {
                        "en": "In politics, he was a champion of the underdog (= always fought for the rights of weaker people).",
                        "vi": "Trong chính trị, ông là người đấu tranh cho những kẻ yếu hơn (= luôn đấu tranh cho quyền lợi của những người yếu hơn)."
                    }
                ]
            }
        ]
    },
    {
        "id": "b0b7150f77a24e8eb40042a39c40feb6",
        "word": "a close thing",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/kləʊs/",
            "us": "/kləʊs/"
        },
        "nearby": [
            {
                "word": "close1",
                "pos": "verb"
            },
            {
                "word": "close1",
                "pos": "noun"
            },
            {
                "word": "close2",
                "pos": "adjective"
            },
            {
                "word": "close2",
                "pos": "adverb"
            },
            {
                "word": "close2",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "near in space or time",
                    "vi": "gần trong không gian hoặc thời gian"
                },
                "examples": [
                    {
                        "en": "I had no idea the beach was so close.",
                        "vi": "Tôi không biết bãi biển lại gần như vậy."
                    },
                    {
                        "en": "close to somebody/something Our new house is close to the school.",
                        "vi": "gần với ai đó / cái gì đó Ngôi nhà mới của chúng tôi gần trường học."
                    },
                    {
                        "en": "The children are close to each other in age.",
                        "vi": "Những đứa trẻ gần bằng tuổi nhau."
                    },
                    {
                        "en": "She is looking for a job closer to home.",
                        "vi": "Cô ấy đang tìm kiếm một công việc gần nhà hơn."
                    },
                    {
                        "en": "close together The tables were too close together.",
                        "vi": "gần nhau Các bàn quá gần nhau."
                    },
                    {
                        "en": "Their birthdays are very close together.",
                        "vi": "Sinh nhật của họ rất gần nhau."
                    },
                    {
                        "en": "This is the closest we can get to the beach by car.",
                        "vi": "Đây là nơi gần nhất chúng tôi có thể đến bãi biển bằng ô tô."
                    },
                    {
                        "en": "We all have to work in close proximity (= near each other).",
                        "vi": "Tất cả chúng ta phải làm việc trong khoảng cách gần nhau (= near nhau)."
                    },
                    {
                        "en": "Victory was tantalizingly close.",
                        "vi": "Chiến thắng đã gần như trêu ngươi."
                    }
                ]
            },
            {
                "define": {
                    "en": "knowing somebody very well and liking them very much",
                    "vi": "biết ai đó rất rõ và rất thích họ"
                },
                "examples": [
                    {
                        "en": "Jo is a very close friend.",
                        "vi": "Jo là một người bạn rất thân."
                    },
                    {
                        "en": "close to somebody She is very close to her father.",
                        "vi": "gần gũi với ai đó Cô ấy rất gần gũi với cha cô ấy."
                    },
                    {
                        "en": "She and her father are very close.",
                        "vi": "Cô ấy và bố cô ấy rất thân thiết."
                    },
                    {
                        "en": "We're a very close family.",
                        "vi": "Chúng tôi là một gia đình rất thân thiết."
                    }
                ]
            },
            {
                "define": {
                    "en": "near in family relationship",
                    "vi": "gần trong mối quan hệ gia đình"
                },
                "examples": [
                    {
                        "en": "close relatives, such as your mother and father, and brothers and sisters",
                        "vi": "những người thân gần gũi, chẳng hạn như mẹ và cha của bạn, và anh chị em của bạn"
                    },
                    {
                        "en": "The groom and his close family took their places.",
                        "vi": "Chú rể và gia đình thân thiết vào thế chỗ."
                    }
                ]
            },
            {
                "define": {
                    "en": "very involved in the work or activities of somebody else, usually seeing and talking to them regularly",
                    "vi": "rất tham gia vào công việc hoặc hoạt động của người khác, thường xuyên gặp và nói chuyện với họ"
                },
                "examples": [
                    {
                        "en": "She has kept in close contact with the victims' families.",
                        "vi": "Cô ấy đã giữ liên lạc chặt chẽ với gia đình nạn nhân."
                    },
                    {
                        "en": "They have forged a close working relationship.",
                        "vi": "Họ đã tạo nên một mối quan hệ làm việc thân thiết."
                    },
                    {
                        "en": "a retired army general with close ties to the military",
                        "vi": "một tướng quân đội đã nghỉ hưu có quan hệ mật thiết với quân đội"
                    },
                    {
                        "en": "The college has close links with many other institutions.",
                        "vi": "Trường có liên kết chặt chẽ với nhiều học viện khác."
                    },
                    {
                        "en": "We work in close association with the ministry.",
                        "vi": "Chúng tôi hợp tác chặt chẽ với Bộ."
                    },
                    {
                        "en": "Their survival depends on close cooperation.",
                        "vi": "Sự sống còn của họ phụ thuộc vào sự hợp tác chặt chẽ."
                    },
                    {
                        "en": "Even their closest allies were shocked by the move.",
                        "vi": "Ngay cả những đồng minh thân cận nhất của họ cũng bị sốc trước động thái này."
                    },
                    {
                        "en": "He is one of the prime minister's closest advisers.",
                        "vi": "Ông là một trong những cố vấn thân cận nhất của thủ tướng."
                    },
                    {
                        "en": "We are in close touch with the police.",
                        "vi": "Chúng tôi đang liên lạc chặt chẽ với cảnh sát."
                    }
                ]
            },
            {
                "define": {
                    "en": "careful and complete",
                    "vi": "cẩn thận và đầy đủ"
                },
                "examples": [
                    {
                        "en": "Take a close look at this photograph.",
                        "vi": "Hãy nhìn kỹ bức ảnh này."
                    },
                    {
                        "en": "On closer examination, the painting proved to be a fake.",
                        "vi": "Khi xem xét kỹ hơn, bức tranh được chứng minh là giả."
                    },
                    {
                        "en": "A close inspection reveals stunning attention to detail.",
                        "vi": "Kiểm tra kỹ càng cho thấy sự chú ý tuyệt vời đến từng chi tiết."
                    },
                    {
                        "en": "Pay close attention to what I am telling you.",
                        "vi": "Hãy chú ý đến những gì tôi đang nói với bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "almost in a particular state; likely to do something soon",
                    "vi": "hầu như ở một trạng thái cụ thể; có khả năng làm điều gì đó sớm"
                },
                "examples": [
                    {
                        "en": "close to something The airline is close to collapse.",
                        "vi": "close to something Hãng hàng không gần sụp đổ."
                    },
                    {
                        "en": "He was close to tears.",
                        "vi": "Anh gần rơi nước mắt."
                    },
                    {
                        "en": "The species is dangerously close to extinction.",
                        "vi": "Loài này đang ở mức nguy hiểm sắp tuyệt chủng."
                    },
                    {
                        "en": "The new library is close to completion.",
                        "vi": "Thư viện mới sắp hoàn thành."
                    },
                    {
                        "en": "She knew she was close to death.",
                        "vi": "Cô biết mình đã cận kề cái chết."
                    },
                    {
                        "en": "close to doing something We are close to signing the agreement.",
                        "vi": "sắp làm được điều gì đó Chúng tôi sắp ký kết thỏa thuận."
                    }
                ]
            },
            {
                "define": {
                    "en": "very similar to something else or to an amount",
                    "vi": "rất giống với một cái gì đó khác hoặc với một số lượng"
                },
                "examples": [
                    {
                        "en": "There's a close resemblance between them (= they look very similar).",
                        "vi": "Có một điểm tương đồng gần giữa chúng (= chúng trông rất giống nhau)."
                    },
                    {
                        "en": "close to something This movie is about as close to perfect as you could wish for.",
                        "vi": "gần với một cái gì đó Bộ phim này gần đến mức hoàn hảo như bạn có thể mong muốn."
                    },
                    {
                        "en": "Their chances of winning are close to zero.",
                        "vi": "Cơ hội chiến thắng của họ gần bằng không."
                    },
                    {
                        "en": "His feeling for her was close to hatred.",
                        "vi": "Cảm giác của anh dành cho cô gần như là hận thù."
                    },
                    {
                        "en": "The total was close to 20% of the workforce.",
                        "vi": "Tổng số gần 20% lực lượng lao động."
                    },
                    {
                        "en": "It was the closest thing to a home she had ever known.",
                        "vi": "Đó là thứ gần gũi nhất với ngôi nhà mà cô từng biết."
                    },
                    {
                        "en": "We tried to match the colours, but this is the closest we could get.",
                        "vi": "Chúng tôi đã cố gắng kết hợp màu sắc, nhưng đây là màu gần nhất mà chúng tôi có thể nhận được."
                    }
                ]
            },
            {
                "define": {
                    "en": "won by only a small amount or distance",
                    "vi": "chỉ giành được một số tiền nhỏ hoặc khoảng cách"
                },
                "examples": [
                    {
                        "en": "a close match/contest/election",
                        "vi": "một trận đấu chặt chẽ / cuộc thi / cuộc bầu cử"
                    },
                    {
                        "en": "It was pretty close but we lost.",
                        "vi": "Nó đã khá gần nhưng chúng tôi đã thua."
                    },
                    {
                        "en": "Our team came a close second (= nearly won).",
                        "vi": "Đội của chúng tôi đã về nhì (= suýt thắng)."
                    },
                    {
                        "en": "No one expected such a close finish.",
                        "vi": "Không ai mong đợi một kết thúc gần như vậy."
                    },
                    {
                        "en": "The game was closer than the score suggests.",
                        "vi": "Trò chơi đã gần hơn so với tỷ số cho thấy."
                    },
                    {
                        "en": "The result is going to be too close to call (= either side may win).",
                        "vi": "Kết quả là quá gần để gọi (= một trong hai bên có thể thắng)."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to describe something, usually a dangerous or unpleasant situation, that nearly happens",
                    "vi": "được sử dụng để mô tả một cái gì đó, thường là một tình huống nguy hiểm hoặc khó chịu, gần như xảy ra"
                },
                "examples": [
                    {
                        "en": "Phew! That was close—that car nearly hit us.",
                        "vi": "Phù! Đó là gần - chiếc xe đó gần như đâm vào chúng tôi."
                    },
                    {
                        "en": "We caught the bus in the end but it was close (= we nearly missed it).",
                        "vi": "Cuối cùng thì chúng tôi cũng bắt được xe buýt nhưng nó đã đến gần (= chúng tôi đã suýt bỏ lỡ nó)."
                    }
                ]
            },
            {
                "define": {
                    "en": "with little or no space in between",
                    "vi": "có ít hoặc không có khoảng trống ở giữa"
                },
                "examples": [
                    {
                        "en": "over 1 000 pages of close print",
                        "vi": "hơn 1000 trang in gần"
                    },
                    {
                        "en": "The soldiers advanced in close formation.",
                        "vi": "Các binh sĩ tiến sát đội hình."
                    }
                ]
            },
            {
                "define": {
                    "en": "cut very short, near to the skin",
                    "vi": "cắt rất ngắn, gần da"
                },
                "examples": [
                    {
                        "en": "a close haircut/shave",
                        "vi": "cắt tóc / cạo râu"
                    }
                ]
            },
            {
                "define": {
                    "en": "carefully guarded",
                    "vi": "được bảo vệ cẩn thận"
                },
                "examples": [
                    {
                        "en": "The donor's identity is a close secret.",
                        "vi": "Danh tính của người hiến tặng là một bí mật chặt chẽ."
                    },
                    {
                        "en": "She was kept under close arrest.",
                        "vi": "Cô bị quản thúc chặt chẽ."
                    }
                ]
            },
            {
                "define": {
                    "en": "warm in an uncomfortable way because there does not seem to be enough fresh air",
                    "vi": "ấm một cách khó chịu vì dường như không có đủ không khí trong lành"
                },
                "examples": [
                    {
                        "en": "It’s very close today—I think there’s going to be a storm.",
                        "vi": "Hôm nay trời rất gần rồi - tôi nghĩ sắp có bão."
                    }
                ]
            },
            {
                "define": {
                    "en": "not willing to give personal information about yourself",
                    "vi": "không sẵn sàng cung cấp thông tin cá nhân về bản thân"
                },
                "examples": [
                    {
                        "en": "He was close about his past.",
                        "vi": "Anh ấy đã kể về quá khứ của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "not liking to spend money",
                    "vi": "không thích tiêu tiền"
                },
                "examples": [
                    {
                        "en": "She's always been very close with her money.",
                        "vi": "Cô ấy luôn rất gần gũi với tiền của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "produced with part of the tongue in the highest possible position without limiting the flow of air",
                    "vi": "được tạo ra với một phần của lưỡi ở vị trí cao nhất có thể mà không hạn chế luồng không khí"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "very near",
                    "vi": "rất gần"
                },
                "examples": [
                    {
                        "en": "fighting at close quarters",
                        "vi": "chiến đấu ở gần"
                    }
                ]
            },
            {
                "define": {
                    "en": "from only a short distance away",
                    "vi": "chỉ từ một khoảng cách ngắn"
                },
                "examples": [
                    {
                        "en": "The president was shot at close range.",
                        "vi": "Tổng thống bị bắn ở cự ly gần."
                    },
                    {
                        "en": "She scored from close range.",
                        "vi": "Cô ấy đã ghi bàn từ cự ly gần."
                    }
                ]
            },
            {
                "define": {
                    "en": "close to you in time or distance",
                    "vi": "gần với bạn trong thời gian hoặc khoảng cách"
                },
                "examples": [
                    {
                        "en": "Help was at hand.",
                        "vi": "Giúp đỡ đã ở trong tầm tay."
                    },
                    {
                        "en": "The property is ideally located with all local amenities close at hand.",
                        "vi": "Nơi nghỉ này tọa lạc tại một vị trí lý tưởng với tất cả các tiện nghi địa phương nằm trong tầm tay."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to tell somebody that their attempt or guess was almost but not quite successful",
                    "vi": "được sử dụng để nói với ai đó rằng nỗ lực hoặc suy đoán của họ gần như đã thành công nhưng không hoàn toàn thành công"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a situation in which you only just manage to avoid an accident, etc.",
                    "vi": "một tình huống mà bạn chỉ xoay sở để tránh tai nạn, v.v."
                },
                "examples": [
                    {
                        "en": "He had a close shave when his brakes failed on the mountain road.",
                        "vi": "Anh ta đã bị cạo sát khi không phanh được trên đường núi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a situation in which success or failure is equally possible",
                    "vi": "một tình huống mà thành công hay thất bại đều có thể xảy ra"
                },
                "examples": [
                    {
                        "en": "We got him out in the end, but it was a close thing.",
                        "vi": "Cuối cùng thì chúng tôi cũng đưa được anh ta ra ngoài, nhưng đó là một điều gần như tuyệt vời."
                    }
                ]
            },
            {
                "define": {
                    "en": "having a lot of importance and interest for somebody",
                    "vi": "có rất nhiều tầm quan trọng và sự quan tâm đối với ai đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "if a remark or topic of discussion is close to home, it is accurate or connected with you in a way that makes you uncomfortable or embarrassed",
                    "vi": "nếu một nhận xét hoặc chủ đề thảo luận gần nhà, nó là chính xác hoặc có liên quan đến bạn theo cách khiến bạn không thoải mái hoặc xấu hổ"
                },
                "examples": [
                    {
                        "en": "Her remarks about me were embarrassingly close to home.",
                        "vi": "Những lời nhận xét của cô ấy về tôi thật đáng xấu hổ khi ở gần nhà."
                    }
                ]
            },
            {
                "define": {
                    "en": "that involves somebody directly",
                    "vi": "liên quan trực tiếp đến ai đó"
                },
                "examples": [
                    {
                        "en": "The next year tragedy struck much closer to home.",
                        "vi": "Thảm kịch năm sau ập đến gần nhà hơn nhiều."
                    }
                ]
            },
            {
                "define": {
                    "en": "to watch somebody/something carefully",
                    "vi": "để xem ai đó / cái gì đó cẩn thận"
                },
                "examples": [
                    {
                        "en": "Over the next few months we will keep a close eye on sales.",
                        "vi": "Trong vài tháng tới, chúng tôi sẽ theo dõi chặt chẽ doanh số bán hàng."
                    }
                ]
            },
            {
                "define": {
                    "en": "so near that it is uncomfortable or dangerous",
                    "vi": "gần đến mức không thoải mái hoặc nguy hiểm"
                },
                "examples": [
                    {
                        "en": "When she leaves the stage, the fans can get a little too close for comfort.",
                        "vi": "Khi cô ấy rời sân khấu, người hâm mộ có thể lại gần một chút để tạo sự thoải mái."
                    },
                    {
                        "en": "(figurative) They got the win but it was a tight match, definitely too close for comfort.",
                        "vi": "(nghĩa bóng) Họ đã giành được chiến thắng nhưng đó là một trận đấu chặt chẽ, chắc chắn là quá gần để thoải mái."
                    }
                ]
            },
            {
                "define": {
                    "en": "physically very close to somebody; getting to know them well",
                    "vi": "về thể chất rất gần gũi với ai đó; làm quen với họ tốt"
                },
                "examples": [
                    {
                        "en": "Get up close and personal with the koalas at the San Diego Zoo.",
                        "vi": "Cận cảnh và cá nhân với những chú gấu túi tại Sở thú San Diego."
                    },
                    {
                        "en": "For the last 30 years, I’ve been up close and personal with people whose lives were in crisis.",
                        "vi": "Trong 30 năm qua, tôi đã gần gũi và riêng tư với những người có cuộc sống khủng hoảng."
                    }
                ]
            }
        ]
    },
    {
        "id": "d8f855a5da8a4e868e94fe794b32b5da",
        "word": "a dead duck",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/ded/",
            "us": "/ded/"
        },
        "nearby": [
            {
                "word": "deaconess",
                "pos": "noun"
            },
            {
                "word": "deactivate",
                "pos": "verb"
            },
            {
                "word": "dead",
                "pos": "adjective"
            },
            {
                "word": "dead",
                "pos": "noun"
            },
            {
                "word": "dead",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "no longer alive",
                    "vi": "Không còn sống nữa"
                },
                "examples": [
                    {
                        "en": "My mother's dead; she died in 2017.",
                        "vi": "Mẹ tôi đã chết; cô ấy đã chết vào năm 2017."
                    },
                    {
                        "en": "a dead person/animal",
                        "vi": "một người / động vật chết"
                    },
                    {
                        "en": "dead leaves/wood/skin",
                        "vi": "lá chết / gỗ / da"
                    },
                    {
                        "en": "Catherine's dead body lay peacefully on the bed.",
                        "vi": "Xác chết của Catherine nằm yên bình trên giường."
                    },
                    {
                        "en": "He was shot dead by a gunman outside his home.",
                        "vi": "Anh ta đã bị bắn chết bởi một tay súng bên ngoài nhà của mình."
                    },
                    {
                        "en": "A high school shooting has left six students dead.",
                        "vi": "Một vụ nổ súng ở trường trung học đã khiến sáu học sinh thiệt mạng."
                    },
                    {
                        "en": "She was pronounced dead at the scene of the accident.",
                        "vi": "Cô được cho là đã chết tại hiện trường vụ tai nạn."
                    },
                    {
                        "en": "The poor child looks more dead than alive.",
                        "vi": "Đứa trẻ tội nghiệp trông chết hơn còn sống."
                    },
                    {
                        "en": "He was missing, presumed dead.",
                        "vi": "Anh ta mất tích, được cho là đã chết."
                    },
                    {
                        "en": "(informal) He dropped dead (= died suddenly) last week.",
                        "vi": "(không chính thức) Anh ấy đã chết (= chết đột ngột) vào tuần trước."
                    },
                    {
                        "en": "dead from/of something One short year later, Fred would be dead from a drug overdose.",
                        "vi": "chết vì / của thứ gì đó Một năm sau đó, Fred chết vì dùng ma túy quá liều."
                    },
                    {
                        "en": "(figurative) In ten years he'll be dead and buried as a politician.",
                        "vi": "(nghĩa bóng) Trong mười năm nữa, anh ta sẽ chết và được chôn cất như một chính trị gia."
                    }
                ]
            },
            {
                "define": {
                    "en": "not working because of a lack of power",
                    "vi": "không hoạt động vì thiếu điện"
                },
                "examples": [
                    {
                        "en": "a dead battery",
                        "vi": "pin chết"
                    },
                    {
                        "en": "Suddenly the phone went dead.",
                        "vi": "Đột nhiên điện thoại chết máy."
                    },
                    {
                        "en": "John's mobile was completely dead.",
                        "vi": "Điện thoại di động của John đã hoàn toàn chết."
                    }
                ]
            },
            {
                "define": {
                    "en": "no longer believed in or aimed for",
                    "vi": "không còn tin tưởng hoặc nhắm đến"
                },
                "examples": [
                    {
                        "en": "Many believe the peace plan is dead.",
                        "vi": "Nhiều người tin rằng kế hoạch hòa bình đã chết."
                    },
                    {
                        "en": "Unfortunately racism is not yet dead.",
                        "vi": "Thật không may, phân biệt chủng tộc vẫn chưa chết."
                    },
                    {
                        "en": "Though the idea may be dead, it is far from being buried (= people still talk about it, even though there is nothing new to say).",
                        "vi": "Mặc dù ý tưởng có thể đã chết, nhưng nó còn lâu mới bị chôn vùi (= mọi người vẫn nói về nó, mặc dù không có gì mới để nói)."
                    }
                ]
            },
            {
                "define": {
                    "en": "belonging to the past; no longer practised or fashionable",
                    "vi": "thuộc về quá khứ; không còn thực hành hoặc thời trang"
                },
                "examples": [
                    {
                        "en": "Is the Western a dead art form?",
                        "vi": "Phương Tây có phải là một loại hình nghệ thuật đã chết?"
                    },
                    {
                        "en": "a dead language (= one that is no longer spoken, for example Latin)",
                        "vi": "ngôn ngữ đã chết (= ngôn ngữ không còn được sử dụng, ví dụ như tiếng Latinh)"
                    }
                ]
            },
            {
                "define": {
                    "en": "finished; not able to be used any more",
                    "vi": "đã kết thúc; không thể được sử dụng nữa"
                },
                "examples": [
                    {
                        "en": "dead matches",
                        "vi": "trận đấu chết"
                    },
                    {
                        "en": "There were two dead bottles of wine on the table.",
                        "vi": "Có hai chai rượu đã chết trên bàn."
                    }
                ]
            },
            {
                "define": {
                    "en": "very quiet, without activity or interest",
                    "vi": "rất yên tĩnh, không có hoạt động hoặc quan tâm"
                },
                "examples": [
                    {
                        "en": "There were no theatres, no cinemas, no coffee bars. It was dead as anything.",
                        "vi": "Không có rạp hát, không có rạp chiếu phim, không có quán cà phê. Nó đã chết như bất cứ điều gì."
                    }
                ]
            },
            {
                "define": {
                    "en": "without activity; with nobody buying or selling anything",
                    "vi": "không có hoạt động; không ai mua hoặc bán bất cứ thứ gì"
                },
                "examples": [
                    {
                        "en": "‘The market is absolutely dead this morning,’ said one foreign exchange trader.",
                        "vi": "Một nhà kinh doanh ngoại hối cho biết: “Thị trường đã chết trong sáng nay."
                    },
                    {
                        "en": "Winter is traditionally the dead season for the housing market.",
                        "vi": "Theo truyền thống, mùa đông là mùa chết của thị trường nhà đất."
                    }
                ]
            },
            {
                "define": {
                    "en": "extremely tired; not well",
                    "vi": "mệt mỏi vô cùng; không tốt"
                },
                "examples": [
                    {
                        "en": "half dead with cold and hunger",
                        "vi": "chết một nửa vì lạnh và đói"
                    },
                    {
                        "en": "She felt dead on her feet and didn't have the energy to question them further.",
                        "vi": "Cô cảm thấy như chết đứng và không còn sức lực để tra hỏi chúng thêm nữa."
                    }
                ]
            },
            {
                "define": {
                    "en": "unable to feel because of cold, etc.",
                    "vi": "không thể cảm thấy vì lạnh, v.v."
                },
                "examples": [
                    {
                        "en": "My left arm had gone dead.",
                        "vi": "Cánh tay trái của tôi đã chết."
                    }
                ]
            },
            {
                "define": {
                    "en": "unable to feel or understand emotions",
                    "vi": "không thể cảm nhận hoặc hiểu được cảm xúc"
                },
                "examples": [
                    {
                        "en": "He was dead to all feelings of pity.",
                        "vi": "Anh đã chết trước tất cả cảm giác thương hại."
                    }
                ]
            },
            {
                "define": {
                    "en": "showing no emotion",
                    "vi": "không biểu lộ cảm xúc"
                },
                "examples": [
                    {
                        "en": "She said, ‘I'm sorry, too,’ in a quiet, dead voice.",
                        "vi": "Cô ấy nói, 'Tôi cũng xin lỗi,' bằng một giọng chết lặng."
                    },
                    {
                        "en": "His usually dead grey eyes were sparkling.",
                        "vi": "Đôi mắt xám thường chết của anh ấy lấp lánh."
                    }
                ]
            },
            {
                "define": {
                    "en": "complete or exact",
                    "vi": "đầy đủ hoặc chính xác"
                },
                "examples": [
                    {
                        "en": "a dead silence/calm",
                        "vi": "một sự im lặng chết chóc / bình tĩnh"
                    },
                    {
                        "en": "the dead centre of the target",
                        "vi": "trung tâm chết của mục tiêu"
                    },
                    {
                        "en": "The car gave a sudden jerk and came to a dead stop.",
                        "vi": "Chiếc xe bị giật một cách đột ngột và dừng lại."
                    },
                    {
                        "en": "(informal) Her face was a dead giveaway (= made it very obvious) that something was going on.",
                        "vi": "(thân mật) Khuôn mặt của cô ấy là một món quà chết chóc (= thể hiện rất rõ ràng) rằng có điều gì đó đang xảy ra."
                    },
                    {
                        "en": "(British English) This horse is a dead cert for (= will certainly win) the race tomorrow.",
                        "vi": "(Tiếng Anh Anh) Con ngựa này là chứng chỉ đã chết cho (= chắc chắn sẽ thắng) cuộc đua vào ngày mai."
                    },
                    {
                        "en": "She crumpled to the floor in a dead faint (= completely unconscious).",
                        "vi": "Cô gục xuống sàn trong tình trạng ngất xỉu (= hoàn toàn bất tỉnh)."
                    }
                ]
            },
            {
                "define": {
                    "en": "never having been alive",
                    "vi": "chưa bao giờ sống"
                },
                "examples": [
                    {
                        "en": "dead matter (= for example rock)",
                        "vi": "vật chất chết (= ví dụ đá)"
                    },
                    {
                        "en": "a dead planet (= one with no life on it)",
                        "vi": "một hành tinh chết (= một hành tinh không có sự sống trên đó)"
                    }
                ]
            },
            {
                "define": {
                    "en": "outside the playing area",
                    "vi": "bên ngoài khu vui chơi"
                },
                "examples": [
                    {
                        "en": "There was a dead ball with five seconds to go in the game.",
                        "vi": "Có một quả bóng chết còn năm giây nữa trong trò chơi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be dead",
                    "vi": "chết"
                },
                "examples": [
                    {
                        "en": "You'll be sorry you said that when I'm dead and gone.",
                        "vi": "Bạn sẽ rất tiếc vì đã nói điều đó khi tôi chết và ra đi."
                    },
                    {
                        "en": "That won't happen until long after I'm dead and gone.",
                        "vi": "Điều đó sẽ không xảy ra cho đến khi tôi chết và ra đi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to look very like somebody",
                    "vi": "trông rất giống ai đó"
                },
                "examples": [
                    {
                        "en": "She's a dead ringer for a girl I used to know.",
                        "vi": "Cô ấy là kẻ phá đám cho một cô gái tôi từng quen."
                    }
                ]
            },
            {
                "define": {
                    "en": "completely dead; no longer interesting or relevant",
                    "vi": "chết hoàn toàn; không còn thú vị hoặc phù hợp"
                },
                "examples": [
                    {
                        "en": "In the second half both teams made substitutions to try and liven things up, but the game was as dead as a dodo.",
                        "vi": "Trong hiệp hai, cả hai đội đã thay người để cố gắng và làm sống động mọi thứ, nhưng trận đấu diễn ra như chết vì dodo."
                    }
                ]
            },
            {
                "define": {
                    "en": "completely dead",
                    "vi": "chết hoàn toàn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a plan, an event, etc. that has failed or is certain to fail and that is therefore not worth discussing",
                    "vi": "một kế hoạch, một sự kiện, v.v. đã thất bại hoặc chắc chắn thất bại và điều đó không đáng bàn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "an influence that controls or limits something",
                    "vi": "một ảnh hưởng kiểm soát hoặc hạn chế một cái gì đó"
                },
                "examples": [
                    {
                        "en": "We need to free business from the dead hand of bureaucracy.",
                        "vi": "Chúng ta cần giải phóng doanh nghiệp khỏi bàn tay chết chóc của bộ máy quan liêu."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person or plan that is dead in the water has failed and has little hope of succeeding in the future",
                    "vi": "một người hoặc kế hoạch chết trong nước đã thất bại và có rất ít hy vọng thành công trong tương lai"
                },
                "examples": [
                    {
                        "en": "His leadership campaign is dead in the water.",
                        "vi": "Chiến dịch lãnh đạo của anh ta đã chết trong nước."
                    }
                ]
            },
            {
                "define": {
                    "en": "in serious trouble",
                    "vi": "gặp rắc rối nghiêm trọng"
                },
                "examples": [
                    {
                        "en": "If anyone finds out, you're dead meat.",
                        "vi": "Nếu ai đó phát hiện ra, bạn sẽ chết."
                    }
                ]
            },
            {
                "define": {
                    "en": "(of an accident victim or other patient) already dead when arriving at a hospital",
                    "vi": "(của một nạn nhân tai nạn hoặc bệnh nhân khác) đã chết khi đến bệnh viện"
                },
                "examples": [
                    {
                        "en": "She was pronounced dead on arrival.",
                        "vi": "Cô ấy được cho là đã chết khi đến nơi."
                    },
                    {
                        "en": "He didn’t even make it to hospital: DOA.",
                        "vi": "Anh ấy thậm chí còn không đến được bệnh viện: DOA."
                    },
                    {
                        "en": "Many of the casualties were dead on arrival.",
                        "vi": "Nhiều người trong số những người thương vong đã chết khi đến nơi."
                    }
                ]
            },
            {
                "define": {
                    "en": "very unlikely to be successful; not working when it is delivered",
                    "vi": "rất khó thành công; không hoạt động khi nó được giao"
                },
                "examples": [
                    {
                        "en": "The bill was dead on arrival in the Senate.",
                        "vi": "Dự luật đã chết khi đến Thượng viện."
                    },
                    {
                        "en": "The software was DOA.",
                        "vi": "Phần mềm là DOA."
                    }
                ]
            },
            {
                "define": {
                    "en": "in a deep sleep",
                    "vi": "trong một giấc ngủ sâu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to waste your effort by trying to do something that is no longer possible",
                    "vi": "lãng phí nỗ lực của bạn bằng cách cố gắng làm điều gì đó mà không còn khả thi"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to impress somebody very much",
                    "vi": "để gây ấn tượng với ai đó rất nhiều"
                },
                "examples": [
                    {
                        "en": "You look fabulous—you'll knock ’em dead tonight.",
                        "vi": "Trông bạn thật tuyệt vời - bạn sẽ đánh gục họ đêm nay."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to show you are strongly opposed to something",
                    "vi": "được sử dụng để cho thấy bạn phản đối mạnh mẽ điều gì đó"
                },
                "examples": [
                    {
                        "en": "She moves into our home over my dead body.",
                        "vi": "Cô ấy chuyển đến nhà của chúng tôi trên xác chết của tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that you would not like to wear particular clothes, or to be in a particular situation",
                    "vi": "từng nói rằng bạn không muốn mặc quần áo cụ thể hoặc ở trong một tình huống cụ thể"
                },
                "examples": [
                    {
                        "en": "She wouldn't be seen dead in a hat.",
                        "vi": "Cô ấy sẽ không bị coi là chết trong chiếc mũ."
                    },
                    {
                        "en": "He wouldn't be caught dead going to a club with his mother.",
                        "vi": "Anh ta sẽ không bị bắt chết khi đi câu lạc bộ với mẹ mình."
                    }
                ]
            }
        ]
    },
    {
        "id": "cbc6fca672e144a8ac672a85cd24d6bf",
        "word": "also-ran",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɔːlsəʊ ræn/",
            "us": "/ˈɔːlsəʊ ræn/"
        },
        "nearby": [
            {
                "word": "Alsatian",
                "pos": "noun"
            },
            {
                "word": "also",
                "pos": "adverb"
            },
            {
                "word": "also-ran",
                "pos": "noun"
            },
            {
                "word": "alt-",
                "pos": "combining form"
            },
            {
                "word": "altar",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who is not successful, especially in a competition or an election",
                    "vi": "một người không thành công, đặc biệt là trong một cuộc thi hoặc một cuộc bầu cử"
                },
                "examples": [
                    {
                        "en": "A year ago he was just an also-ran for the Democratic nomination.",
                        "vi": "Một năm trước, anh ấy cũng chỉ là một ứng cử viên cho sự đề cử của đảng Dân chủ."
                    },
                    {
                        "en": "The campaign transformed him from an also-ran in the polls to front-runner.",
                        "vi": "Chiến dịch đã biến anh ta từ một người cũng chạy trong các cuộc thăm dò thành người dẫn đầu."
                    }
                ]
            }
        ]
    },
    {
        "id": "1363392a13c943459063d5a48867548a",
        "word": "a mug’s game",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/mʌɡ/",
            "us": "/mʌɡ/"
        },
        "nearby": [
            {
                "word": "muffler",
                "pos": "noun"
            },
            {
                "word": "mufti",
                "pos": "noun"
            },
            {
                "word": "mug",
                "pos": "noun"
            },
            {
                "word": "mug",
                "pos": "verb"
            },
            {
                "word": "mugger",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a tall cup for drinking from, usually with straight sides and a handle, used without a saucer",
                    "vi": "một chiếc cốc cao để uống nước, thường có các cạnh thẳng và một tay cầm, được sử dụng mà không có đĩa"
                },
                "examples": [
                    {
                        "en": "a coffee mug",
                        "vi": "một cốc cà phê"
                    },
                    {
                        "en": "a beer mug (= a large glass with a handle)",
                        "vi": "cốc bia (= ly lớn có tay cầm)"
                    }
                ]
            },
            {
                "define": {
                    "en": "a mug and what it contains",
                    "vi": "một cái cốc và những gì nó chứa"
                },
                "examples": [
                    {
                        "en": "He drank a mug of coffee and left.",
                        "vi": "Anh uống một cốc cà phê và rời đi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person’s face",
                    "vi": "khuôn mặt của một người"
                },
                "examples": [
                    {
                        "en": "I never want to see his ugly mug again.",
                        "vi": "Tôi không bao giờ muốn nhìn thấy cái cốc xấu xí của anh ta nữa."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who is stupid and easy to trick",
                    "vi": "một người ngu ngốc và dễ lừa"
                },
                "examples": [
                    {
                        "en": "They made me look a complete mug.",
                        "vi": "Họ làm cho tôi trông như một chiếc cốc hoàn chỉnh."
                    },
                    {
                        "en": "He's no mug.",
                        "vi": "Anh ấy không có cốc."
                    }
                ]
            },
            {
                "define": {
                    "en": "an activity that is unlikely to be successful or make a profit",
                    "vi": "một hoạt động không chắc sẽ thành công hoặc tạo ra lợi nhuận"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "d05bf73b4d91402d85ad509acad1f426",
        "word": "bomb",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/bɒm/",
            "us": "/bɑːm/"
        },
        "nearby": [
            {
                "word": "bolus",
                "pos": "noun"
            },
            {
                "word": "boma",
                "pos": "noun"
            },
            {
                "word": "bomb",
                "pos": "noun"
            },
            {
                "word": "bomb",
                "pos": "verb"
            },
            {
                "word": "bomb alert",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a weapon designed to explode at a particular time or when it is dropped or thrown",
                    "vi": "một vũ khí được thiết kế để phát nổ tại một thời điểm cụ thể hoặc khi nó bị rơi hoặc ném"
                },
                "examples": [
                    {
                        "en": "a bomb goes off/explodes",
                        "vi": "một quả bom nổ / nổ"
                    },
                    {
                        "en": "Hundreds of bombs were dropped on the city.",
                        "vi": "Hàng trăm quả bom đã được thả xuống thành phố."
                    },
                    {
                        "en": "to plant/detonate a bomb",
                        "vi": "trồng / kích nổ một quả bom"
                    },
                    {
                        "en": "a suicide bomb",
                        "vi": "một quả bom tự sát"
                    },
                    {
                        "en": "a roadside bomb (= one that is designed to blow up vehicles)",
                        "vi": "một quả bom ven đường (= một quả bom được thiết kế để làm nổ tung xe cộ)"
                    },
                    {
                        "en": "a bomb attack/blast",
                        "vi": "một cuộc tấn công / vụ nổ bom"
                    },
                    {
                        "en": "extensive bomb damage",
                        "vi": "thiệt hại bom lớn"
                    }
                ]
            },
            {
                "define": {
                    "en": "nuclear weapons (atomic or hydrogen bombs)",
                    "vi": "vũ khí hạt nhân (bom nguyên tử hoặc khinh khí)"
                },
                "examples": [
                    {
                        "en": "countries that have the bomb",
                        "vi": "quốc gia có bom"
                    }
                ]
            },
            {
                "define": {
                    "en": "a lot of money",
                    "vi": "nhiều tiền"
                },
                "examples": [
                    {
                        "en": "That dress must have cost a bomb!",
                        "vi": "Cái váy đó chắc có giá một quả bom!"
                    },
                    {
                        "en": "Some company directors make an absolute bomb.",
                        "vi": "Một số giám đốc công ty tạo ra một quả bom tuyệt đối."
                    }
                ]
            },
            {
                "define": {
                    "en": "a complete failure",
                    "vi": "một sự thất bại hoàn toàn"
                },
                "examples": [
                    {
                        "en": "The musical was a complete bomb on Broadway.",
                        "vi": "Vở nhạc kịch hoàn toàn là một quả bom trên sân khấu Broadway."
                    }
                ]
            },
            {
                "define": {
                    "en": "a long forward throw of the ball",
                    "vi": "ném bóng dài về phía trước"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a container in which a liquid such as paint or insect poison is kept under pressure and released as a spray or as foam",
                    "vi": "một thùng chứa trong đó chất lỏng như sơn hoặc chất độc côn trùng được giữ dưới áp suất và được giải phóng dưới dạng phun hoặc dưới dạng bọt"
                },
                "examples": [
                    {
                        "en": "a bug bomb (= used for killing insects)",
                        "vi": "bom bọ (= dùng để giết côn trùng)"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be very good; to be the best",
                    "vi": "trở nên rất tốt; trở nên tốt nhất"
                },
                "examples": [
                    {
                        "en": "Check out the new website. It's the bomb!",
                        "vi": "Ghé thăm trang web mới nào. Đó là quả bom!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be very successful",
                    "vi": "rất thành công"
                },
                "examples": [
                    {
                        "en": "Our performance went down a bomb.",
                        "vi": "Màn trình diễn của chúng tôi đã gặp phải một quả bom."
                    },
                    {
                        "en": "The party was really going (like) a bomb.",
                        "vi": "Bữa tiệc đã thực sự diễn ra (giống như) một quả bom."
                    },
                    {
                        "en": "Her new novel is going like a bomb (= selling well).",
                        "vi": "Cuốn tiểu thuyết mới của cô ấy đang đi như một quả bom (= bán rất chạy)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to go very fast",
                    "vi": "đi rất nhanh"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "ab0ff67a0f774be28512095c98f8e0ae",
        "word": "Canute",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/kəˈnjuːt/",
            "us": "/kəˈnuːt/"
        },
        "nearby": [
            {
                "word": "Eddie Cantor",
                "pos": ""
            },
            {
                "word": "Canuck",
                "pos": "noun"
            },
            {
                "word": "Canute",
                "pos": "noun"
            },
            {
                "word": "canvas",
                "pos": "noun"
            },
            {
                "word": "canvass",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a Danish king of England (1017–35). He is remembered for standing in front of the sea in order to show people that he was not able to order the water that was moving in towards the land to turn back. The story is often changed to suggest that Canute really thought that he could turn back the sea.",
                    "vi": "một vị vua Đan Mạch của Anh (1017–35). Anh ta được nhớ đến vì đã đứng trước biển để cho mọi người thấy rằng anh ta không thể ra lệnh cho nước đang chảy vào đất liền quay ngược trở lại. Câu chuyện thường được thay đổi để gợi ý rằng Canute thực sự nghĩ rằng anh ta có thể quay ngược biển."
                },
                "examples": [
                    {
                        "en": "Like Canute, the prime minister will not be able to turn this tide.",
                        "vi": "Giống như Canute, thủ tướng sẽ không thể xoay chuyển tình thế này."
                    }
                ]
            }
        ]
    },
    {
        "id": "26109e9d01364a939c88abd6bdd49bd1",
        "word": "car crash",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkɑː kræʃ/",
            "us": "/ˈkɑːr kræʃ/"
        },
        "nearby": [
            {
                "word": "carcinoma",
                "pos": "noun"
            },
            {
                "word": "car coat",
                "pos": "noun"
            },
            {
                "word": "car crash",
                "pos": "noun"
            },
            {
                "word": "card",
                "pos": "noun"
            },
            {
                "word": "card",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an accident in which a car hits something, for example another vehicle, usually causing damage and often killing or injuring the passengers",
                    "vi": "một vụ tai nạn trong đó một chiếc xe hơi va vào một thứ gì đó, chẳng hạn như một chiếc xe khác, thường gây ra thiệt hại và thường làm chết hoặc bị thương hành khách"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a very unsuccessful event or situation that people often find interesting",
                    "vi": "một sự kiện hoặc tình huống không thành công mà mọi người thường thấy thú vị"
                },
                "examples": [
                    {
                        "en": "Her life is turning into a car crash.",
                        "vi": "Cuộc đời cô ấy đang trở thành vết xe đổ."
                    },
                    {
                        "en": "The whole industry is a car crash—even major investment won’t save it now.",
                        "vi": "Toàn bộ ngành công nghiệp là một vết xe đổ - ngay cả những khoản đầu tư lớn cũng không thể cứu vãn nó ngay bây giờ."
                    },
                    {
                        "en": "car-crash television",
                        "vi": "truyền hình tai nạn ô tô"
                    }
                ]
            }
        ]
    },
    {
        "id": "5aa29641ac304daa8ce1433636b0c613",
        "word": "dead in the water",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/ded/",
            "us": "/ded/"
        },
        "nearby": [
            {
                "word": "deaconess",
                "pos": "noun"
            },
            {
                "word": "deactivate",
                "pos": "verb"
            },
            {
                "word": "dead",
                "pos": "adjective"
            },
            {
                "word": "dead",
                "pos": "noun"
            },
            {
                "word": "dead",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "no longer alive",
                    "vi": "Không còn sống nữa"
                },
                "examples": [
                    {
                        "en": "My mother's dead; she died in 2017.",
                        "vi": "Mẹ tôi đã chết; cô ấy đã chết vào năm 2017."
                    },
                    {
                        "en": "a dead person/animal",
                        "vi": "một người / động vật chết"
                    },
                    {
                        "en": "dead leaves/wood/skin",
                        "vi": "lá chết / gỗ / da"
                    },
                    {
                        "en": "Catherine's dead body lay peacefully on the bed.",
                        "vi": "Xác chết của Catherine nằm yên bình trên giường."
                    },
                    {
                        "en": "He was shot dead by a gunman outside his home.",
                        "vi": "Anh ta đã bị bắn chết bởi một tay súng bên ngoài nhà của mình."
                    },
                    {
                        "en": "A high school shooting has left six students dead.",
                        "vi": "Một vụ nổ súng ở trường trung học đã khiến sáu học sinh thiệt mạng."
                    },
                    {
                        "en": "She was pronounced dead at the scene of the accident.",
                        "vi": "Cô được cho là đã chết tại hiện trường vụ tai nạn."
                    },
                    {
                        "en": "The poor child looks more dead than alive.",
                        "vi": "Đứa trẻ tội nghiệp trông chết hơn còn sống."
                    },
                    {
                        "en": "He was missing, presumed dead.",
                        "vi": "Anh ta mất tích, được cho là đã chết."
                    },
                    {
                        "en": "(informal) He dropped dead (= died suddenly) last week.",
                        "vi": "(không chính thức) Anh ấy đã chết (= chết đột ngột) vào tuần trước."
                    },
                    {
                        "en": "dead from/of something One short year later, Fred would be dead from a drug overdose.",
                        "vi": "chết vì / của thứ gì đó Một năm sau đó, Fred chết vì dùng ma túy quá liều."
                    },
                    {
                        "en": "(figurative) In ten years he'll be dead and buried as a politician.",
                        "vi": "(nghĩa bóng) Trong mười năm nữa, anh ta sẽ chết và được chôn cất như một chính trị gia."
                    }
                ]
            },
            {
                "define": {
                    "en": "not working because of a lack of power",
                    "vi": "không hoạt động vì thiếu điện"
                },
                "examples": [
                    {
                        "en": "a dead battery",
                        "vi": "pin chết"
                    },
                    {
                        "en": "Suddenly the phone went dead.",
                        "vi": "Đột nhiên điện thoại chết máy."
                    },
                    {
                        "en": "John's mobile was completely dead.",
                        "vi": "Điện thoại di động của John đã hoàn toàn chết."
                    }
                ]
            },
            {
                "define": {
                    "en": "no longer believed in or aimed for",
                    "vi": "không còn tin tưởng hoặc nhắm đến"
                },
                "examples": [
                    {
                        "en": "Many believe the peace plan is dead.",
                        "vi": "Nhiều người tin rằng kế hoạch hòa bình đã chết."
                    },
                    {
                        "en": "Unfortunately racism is not yet dead.",
                        "vi": "Thật không may, phân biệt chủng tộc vẫn chưa chết."
                    },
                    {
                        "en": "Though the idea may be dead, it is far from being buried (= people still talk about it, even though there is nothing new to say).",
                        "vi": "Mặc dù ý tưởng có thể đã chết, nhưng nó còn lâu mới bị chôn vùi (= mọi người vẫn nói về nó, mặc dù không có gì mới để nói)."
                    }
                ]
            },
            {
                "define": {
                    "en": "belonging to the past; no longer practised or fashionable",
                    "vi": "thuộc về quá khứ; không còn thực hành hoặc thời trang"
                },
                "examples": [
                    {
                        "en": "Is the Western a dead art form?",
                        "vi": "Phương Tây có phải là một loại hình nghệ thuật đã chết?"
                    },
                    {
                        "en": "a dead language (= one that is no longer spoken, for example Latin)",
                        "vi": "ngôn ngữ đã chết (= ngôn ngữ không còn được sử dụng, ví dụ như tiếng Latinh)"
                    }
                ]
            },
            {
                "define": {
                    "en": "finished; not able to be used any more",
                    "vi": "đã kết thúc; không thể được sử dụng nữa"
                },
                "examples": [
                    {
                        "en": "dead matches",
                        "vi": "trận đấu chết"
                    },
                    {
                        "en": "There were two dead bottles of wine on the table.",
                        "vi": "Có hai chai rượu đã chết trên bàn."
                    }
                ]
            },
            {
                "define": {
                    "en": "very quiet, without activity or interest",
                    "vi": "rất yên tĩnh, không có hoạt động hoặc quan tâm"
                },
                "examples": [
                    {
                        "en": "There were no theatres, no cinemas, no coffee bars. It was dead as anything.",
                        "vi": "Không có rạp hát, không có rạp chiếu phim, không có quán cà phê. Nó đã chết như bất cứ điều gì."
                    }
                ]
            },
            {
                "define": {
                    "en": "without activity; with nobody buying or selling anything",
                    "vi": "không có hoạt động; không ai mua hoặc bán bất cứ thứ gì"
                },
                "examples": [
                    {
                        "en": "‘The market is absolutely dead this morning,’ said one foreign exchange trader.",
                        "vi": "Một nhà kinh doanh ngoại hối cho biết: “Thị trường đã chết trong sáng nay."
                    },
                    {
                        "en": "Winter is traditionally the dead season for the housing market.",
                        "vi": "Theo truyền thống, mùa đông là mùa chết của thị trường nhà đất."
                    }
                ]
            },
            {
                "define": {
                    "en": "extremely tired; not well",
                    "vi": "mệt mỏi vô cùng; không tốt"
                },
                "examples": [
                    {
                        "en": "half dead with cold and hunger",
                        "vi": "chết một nửa vì lạnh và đói"
                    },
                    {
                        "en": "She felt dead on her feet and didn't have the energy to question them further.",
                        "vi": "Cô cảm thấy như chết đứng và không còn sức lực để tra hỏi chúng thêm nữa."
                    }
                ]
            },
            {
                "define": {
                    "en": "unable to feel because of cold, etc.",
                    "vi": "không thể cảm thấy vì lạnh, v.v."
                },
                "examples": [
                    {
                        "en": "My left arm had gone dead.",
                        "vi": "Cánh tay trái của tôi đã chết."
                    }
                ]
            },
            {
                "define": {
                    "en": "unable to feel or understand emotions",
                    "vi": "không thể cảm nhận hoặc hiểu được cảm xúc"
                },
                "examples": [
                    {
                        "en": "He was dead to all feelings of pity.",
                        "vi": "Anh đã chết trước tất cả cảm giác thương hại."
                    }
                ]
            },
            {
                "define": {
                    "en": "showing no emotion",
                    "vi": "không biểu lộ cảm xúc"
                },
                "examples": [
                    {
                        "en": "She said, ‘I'm sorry, too,’ in a quiet, dead voice.",
                        "vi": "Cô ấy nói, 'Tôi cũng xin lỗi,' bằng một giọng chết lặng."
                    },
                    {
                        "en": "His usually dead grey eyes were sparkling.",
                        "vi": "Đôi mắt xám thường chết của anh ấy lấp lánh."
                    }
                ]
            },
            {
                "define": {
                    "en": "complete or exact",
                    "vi": "đầy đủ hoặc chính xác"
                },
                "examples": [
                    {
                        "en": "a dead silence/calm",
                        "vi": "một sự im lặng chết chóc / bình tĩnh"
                    },
                    {
                        "en": "the dead centre of the target",
                        "vi": "trung tâm chết của mục tiêu"
                    },
                    {
                        "en": "The car gave a sudden jerk and came to a dead stop.",
                        "vi": "Chiếc xe bị giật một cách đột ngột và dừng lại."
                    },
                    {
                        "en": "(informal) Her face was a dead giveaway (= made it very obvious) that something was going on.",
                        "vi": "(thân mật) Khuôn mặt của cô ấy là một món quà chết chóc (= thể hiện rất rõ ràng) rằng có điều gì đó đang xảy ra."
                    },
                    {
                        "en": "(British English) This horse is a dead cert for (= will certainly win) the race tomorrow.",
                        "vi": "(Tiếng Anh Anh) Con ngựa này là chứng chỉ đã chết cho (= chắc chắn sẽ thắng) cuộc đua vào ngày mai."
                    },
                    {
                        "en": "She crumpled to the floor in a dead faint (= completely unconscious).",
                        "vi": "Cô gục xuống sàn trong tình trạng ngất xỉu (= hoàn toàn bất tỉnh)."
                    }
                ]
            },
            {
                "define": {
                    "en": "never having been alive",
                    "vi": "chưa bao giờ sống"
                },
                "examples": [
                    {
                        "en": "dead matter (= for example rock)",
                        "vi": "vật chất chết (= ví dụ đá)"
                    },
                    {
                        "en": "a dead planet (= one with no life on it)",
                        "vi": "một hành tinh chết (= một hành tinh không có sự sống trên đó)"
                    }
                ]
            },
            {
                "define": {
                    "en": "outside the playing area",
                    "vi": "bên ngoài khu vui chơi"
                },
                "examples": [
                    {
                        "en": "There was a dead ball with five seconds to go in the game.",
                        "vi": "Có một quả bóng chết còn năm giây nữa trong trò chơi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be dead",
                    "vi": "chết"
                },
                "examples": [
                    {
                        "en": "You'll be sorry you said that when I'm dead and gone.",
                        "vi": "Bạn sẽ rất tiếc vì đã nói điều đó khi tôi chết và ra đi."
                    },
                    {
                        "en": "That won't happen until long after I'm dead and gone.",
                        "vi": "Điều đó sẽ không xảy ra cho đến khi tôi chết và ra đi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to look very like somebody",
                    "vi": "trông rất giống ai đó"
                },
                "examples": [
                    {
                        "en": "She's a dead ringer for a girl I used to know.",
                        "vi": "Cô ấy là kẻ phá đám cho một cô gái tôi từng quen."
                    }
                ]
            },
            {
                "define": {
                    "en": "completely dead; no longer interesting or relevant",
                    "vi": "chết hoàn toàn; không còn thú vị hoặc phù hợp"
                },
                "examples": [
                    {
                        "en": "In the second half both teams made substitutions to try and liven things up, but the game was as dead as a dodo.",
                        "vi": "Trong hiệp hai, cả hai đội đã thay người để cố gắng và làm sống động mọi thứ, nhưng trận đấu diễn ra như chết vì dodo."
                    }
                ]
            },
            {
                "define": {
                    "en": "completely dead",
                    "vi": "chết hoàn toàn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a plan, an event, etc. that has failed or is certain to fail and that is therefore not worth discussing",
                    "vi": "một kế hoạch, một sự kiện, v.v. đã thất bại hoặc chắc chắn thất bại và điều đó không đáng bàn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "an influence that controls or limits something",
                    "vi": "một ảnh hưởng kiểm soát hoặc hạn chế một cái gì đó"
                },
                "examples": [
                    {
                        "en": "We need to free business from the dead hand of bureaucracy.",
                        "vi": "Chúng ta cần giải phóng doanh nghiệp khỏi bàn tay chết chóc của bộ máy quan liêu."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person or plan that is dead in the water has failed and has little hope of succeeding in the future",
                    "vi": "một người hoặc kế hoạch chết trong nước đã thất bại và có rất ít hy vọng thành công trong tương lai"
                },
                "examples": [
                    {
                        "en": "His leadership campaign is dead in the water.",
                        "vi": "Chiến dịch lãnh đạo của anh ta đã chết trong nước."
                    }
                ]
            },
            {
                "define": {
                    "en": "in serious trouble",
                    "vi": "gặp rắc rối nghiêm trọng"
                },
                "examples": [
                    {
                        "en": "If anyone finds out, you're dead meat.",
                        "vi": "Nếu ai đó phát hiện ra, bạn sẽ chết."
                    }
                ]
            },
            {
                "define": {
                    "en": "(of an accident victim or other patient) already dead when arriving at a hospital",
                    "vi": "(của một nạn nhân tai nạn hoặc bệnh nhân khác) đã chết khi đến bệnh viện"
                },
                "examples": [
                    {
                        "en": "She was pronounced dead on arrival.",
                        "vi": "Cô ấy được cho là đã chết khi đến nơi."
                    },
                    {
                        "en": "He didn’t even make it to hospital: DOA.",
                        "vi": "Anh ấy thậm chí còn không đến được bệnh viện: DOA."
                    },
                    {
                        "en": "Many of the casualties were dead on arrival.",
                        "vi": "Nhiều người trong số những người thương vong đã chết khi đến nơi."
                    }
                ]
            },
            {
                "define": {
                    "en": "very unlikely to be successful; not working when it is delivered",
                    "vi": "rất khó thành công; không hoạt động khi nó được giao"
                },
                "examples": [
                    {
                        "en": "The bill was dead on arrival in the Senate.",
                        "vi": "Dự luật đã chết khi đến Thượng viện."
                    },
                    {
                        "en": "The software was DOA.",
                        "vi": "Phần mềm là DOA."
                    }
                ]
            },
            {
                "define": {
                    "en": "in a deep sleep",
                    "vi": "trong một giấc ngủ sâu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to waste your effort by trying to do something that is no longer possible",
                    "vi": "lãng phí nỗ lực của bạn bằng cách cố gắng làm điều gì đó mà không còn khả thi"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to impress somebody very much",
                    "vi": "để gây ấn tượng với ai đó rất nhiều"
                },
                "examples": [
                    {
                        "en": "You look fabulous—you'll knock ’em dead tonight.",
                        "vi": "Trông bạn thật tuyệt vời - bạn sẽ đánh gục họ đêm nay."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to show you are strongly opposed to something",
                    "vi": "được sử dụng để cho thấy bạn phản đối mạnh mẽ điều gì đó"
                },
                "examples": [
                    {
                        "en": "She moves into our home over my dead body.",
                        "vi": "Cô ấy chuyển đến nhà của chúng tôi trên xác chết của tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that you would not like to wear particular clothes, or to be in a particular situation",
                    "vi": "từng nói rằng bạn không muốn mặc quần áo cụ thể hoặc ở trong một tình huống cụ thể"
                },
                "examples": [
                    {
                        "en": "She wouldn't be seen dead in a hat.",
                        "vi": "Cô ấy sẽ không bị coi là chết trong chiếc mũ."
                    },
                    {
                        "en": "He wouldn't be caught dead going to a club with his mother.",
                        "vi": "Anh ta sẽ không bị bắt chết khi đi câu lạc bộ với mẹ mình."
                    }
                ]
            }
        ]
    },
    {
        "id": "ea557931855842159436bc1a6f5af784",
        "word": "debacle",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/dɪˈbɑːkl/",
            "us": "/dɪˈbɑːkl/"
        },
        "nearby": [
            {
                "word": "deb",
                "pos": "noun"
            },
            {
                "word": "Deb",
                "pos": ""
            },
            {
                "word": "debacle",
                "pos": "noun"
            },
            {
                "word": "debar",
                "pos": "verb"
            },
            {
                "word": "debark",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an event or a situation that is a complete failure and causes people to feel ashamed or embarrassed",
                    "vi": "một sự kiện hoặc một tình huống thất bại hoàn toàn và khiến mọi người cảm thấy xấu hổ hoặc xấu hổ"
                },
                "examples": [
                    {
                        "en": "He should take responsibility for the debacle and resign.",
                        "vi": "Anh ta nên chịu trách nhiệm về sự thất bại và từ chức."
                    },
                    {
                        "en": "Let’s hope this is the end of the debacle over player transfer fees.",
                        "vi": "Hãy hy vọng đây là sự kết thúc của sự thất bại về phí chuyển nhượng cầu thủ."
                    }
                ]
            }
        ]
    },
    {
        "id": "60350f22457f4949b7b4a4feb75e2065",
        "word": "demise",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/dɪˈmaɪz/",
            "us": "/dɪˈmaɪz/"
        },
        "nearby": [
            {
                "word": "demineralization",
                "pos": "noun"
            },
            {
                "word": "demineralize",
                "pos": "verb"
            },
            {
                "word": "demise",
                "pos": "noun"
            },
            {
                "word": "demi-sec",
                "pos": "adjective"
            },
            {
                "word": "demisemiquaver",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the end or failure of an institution, an idea, a company, etc.",
                    "vi": "sự kết thúc hay thất bại của một tổ chức, một ý tưởng, một công ty, v.v."
                },
                "examples": [
                    {
                        "en": "He praised the union's aims but predicted its early demise.",
                        "vi": "Ông ca ngợi mục tiêu của công đoàn nhưng dự đoán sự sụp đổ sớm của nó."
                    },
                    {
                        "en": "the demise of the USSR",
                        "vi": "sự sụp đổ của Liên Xô"
                    },
                    {
                        "en": "The war brought about the industry's sudden demise.",
                        "vi": "Chiến tranh đã dẫn đến sự sụp đổ đột ngột của ngành."
                    },
                    {
                        "en": "the events which contributed to his political demise",
                        "vi": "những sự kiện góp phần vào sự sụp đổ chính trị của anh ấy"
                    }
                ]
            },
            {
                "define": {
                    "en": "death",
                    "vi": "tử vong"
                },
                "examples": [
                    {
                        "en": "his imminent/sudden/sad demise",
                        "vi": "cái chết sắp xảy ra / đột ngột / đau buồn của anh ấy"
                    }
                ]
            }
        ]
    },
    {
        "id": "64a2515234864244b4d951d1964152c0",
        "word": "dog",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/dɒɡ/",
            "us": "/dɔːɡ/"
        },
        "nearby": [
            {
                "word": "doff",
                "pos": "verb"
            },
            {
                "word": "do for",
                "pos": "phrasal verb"
            },
            {
                "word": "dog",
                "pos": "noun"
            },
            {
                "word": "dog",
                "pos": "verb"
            },
            {
                "word": "dog biscuit",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an animal with four legs and a tail, often kept as a pet or trained for work, for example hunting or guarding buildings. There are many types of dog, some of which are wild.",
                    "vi": "một con vật có bốn chân và một cái đuôi, thường được nuôi làm thú cưng hoặc được huấn luyện để làm việc, ví dụ như săn bắn hoặc canh gác các tòa nhà. Có rất nhiều loại chó, một số trong số đó là hoang dã."
                },
                "examples": [
                    {
                        "en": "I took the dog for a walk.",
                        "vi": "Tôi dắt chó đi dạo."
                    },
                    {
                        "en": "I'm just going to walk the dog.",
                        "vi": "Tôi chỉ định dắt chó đi dạo."
                    },
                    {
                        "en": "I could hear a dog barking.",
                        "vi": "Tôi có thể nghe thấy tiếng chó sủa."
                    },
                    {
                        "en": "Stray dogs roamed the streets at night.",
                        "vi": "Những chú chó lạc lang thang trên đường phố vào ban đêm."
                    },
                    {
                        "en": "dog walkers/owners",
                        "vi": "người dắt chó / chủ sở hữu"
                    },
                    {
                        "en": "dog food/biscuits",
                        "vi": "thức ăn cho chó / bánh quy"
                    },
                    {
                        "en": "a dog and its puppies",
                        "vi": "một con chó và những con chó con của nó"
                    },
                    {
                        "en": "A labrador is a breed of dog.",
                        "vi": "Labrador là một giống chó."
                    }
                ]
            },
            {
                "define": {
                    "en": "a male dog, fox, wolf or otter",
                    "vi": "một con chó đực, cáo, sói hoặc rái cá"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "greyhound racing",
                    "vi": "cuộc đua chó săn thỏ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a thing of low quality; a failure",
                    "vi": "một thứ có chất lượng thấp; một thất bại"
                },
                "examples": [
                    {
                        "en": "Her last movie was an absolute dog.",
                        "vi": "Bộ phim cuối cùng của cô ấy là một con chó tuyệt đối."
                    }
                ]
            },
            {
                "define": {
                    "en": "an offensive way of describing a woman who is not considered attractive",
                    "vi": "một cách mô tả xúc phạm một người phụ nữ không được coi là hấp dẫn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used, especially after an adjective, to describe a man who has done something bad",
                    "vi": "được sử dụng, đặc biệt là sau một tính từ, để mô tả một người đàn ông đã làm điều gì đó tồi tệ"
                },
                "examples": [
                    {
                        "en": "You dirty dog!",
                        "vi": "Đồ chó bẩn!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be raining heavily",
                    "vi": "trời mưa to"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "an event that is planned only in order to impress people so that they will support or buy something",
                    "vi": "một sự kiện chỉ được lên kế hoạch nhằm gây ấn tượng với mọi người để họ ủng hộ hoặc mua thứ gì đó"
                },
                "examples": [
                    {
                        "en": "the dog and pony show of his visits to the war zone",
                        "vi": "con chó và con ngựa con trong chuyến thăm của anh ấy đến khu vực chiến tranh"
                    },
                    {
                        "en": "a dog and pony show to sell the idea to investors",
                        "vi": "một buổi biểu diễn chó và ngựa để bán ý tưởng cho các nhà đầu tư"
                    }
                ]
            },
            {
                "define": {
                    "en": "a situation in business, politics, etc. where there is a lot of competition and people are willing to harm each other in order to succeed",
                    "vi": "một tình huống trong kinh doanh, chính trị, v.v. nơi có nhiều cạnh tranh và mọi người sẵn sàng làm hại lẫn nhau để thành công"
                },
                "examples": [
                    {
                        "en": "I'm afraid in this line of work it's a case of dog eat dog.",
                        "vi": "Tôi sợ trong dòng công việc này là trường hợp chó ăn thịt chó."
                    },
                    {
                        "en": "We're operating in a dog-eat-dog world.",
                        "vi": "Chúng tôi đang hoạt động trong một thế giới chó ăn thịt."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who stops other people from enjoying something that the person cannot use or does not want themselves",
                    "vi": "một người ngăn cản người khác thưởng thức thứ gì đó mà người đó không thể sử dụng hoặc không muốn bản thân họ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a thing that has been done badly",
                    "vi": "một điều đã được thực hiện tồi tệ"
                },
                "examples": [
                    {
                        "en": "He's made a real dog's breakfast of these accounts.",
                        "vi": "Anh ấy đã làm bữa sáng cho một con chó thực sự của những tài khoản này."
                    }
                ]
            },
            {
                "define": {
                    "en": "an unhappy life, full of problems or unfair treatment",
                    "vi": "một cuộc sống bất hạnh, đầy rẫy những vấn đề hoặc bị đối xử bất công"
                },
                "examples": [
                    {
                        "en": "He led his poor partner a dog's life.",
                        "vi": "Anh ta đã dẫn người bạn đời tội nghiệp của mình một cuộc sống của một con chó."
                    }
                ]
            },
            {
                "define": {
                    "en": "everyone has good luck or success at some point in their life",
                    "vi": "mọi người đều gặp may mắn hoặc thành công vào một thời điểm nào đó trong cuộc đời của họ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "when a person already has a bad reputation, it is difficult to change it because others will continue to blame or suspect them",
                    "vi": "Khi một người đã có tiếng xấu, rất khó để thay đổi điều đó vì người khác sẽ tiếp tục đổ lỗi hoặc nghi ngờ họ."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to get into a very bad state",
                    "vi": "rơi vào trạng thái rất tồi tệ"
                },
                "examples": [
                    {
                        "en": "This firm's gone to the dogs since the new management took over.",
                        "vi": "Công ty này đã được chuyển giao cho những chú chó kể từ khi ban quản lý mới tiếp quản."
                    }
                ]
            },
            {
                "define": {
                    "en": "alcohol that you drink in order to make you feel better when you have drunk too much alcohol the night before",
                    "vi": "rượu mà bạn uống để làm cho bạn cảm thấy dễ chịu hơn khi bạn đã uống quá nhiều rượu vào đêm hôm trước"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be involved in a situation so that you will gain or lose according to the result",
                    "vi": "tham gia vào một tình huống để bạn sẽ được hoặc mất tùy theo kết quả"
                },
                "examples": [
                    {
                        "en": "I really don't have a dog in this fight, so I can just enjoy the game.",
                        "vi": "Tôi thực sự không có một con chó trong cuộc chiến này, vì vậy tôi chỉ có thể tận hưởng trò chơi."
                    },
                    {
                        "en": "The employees have a dog in the hunt, so their views should be listened to.",
                        "vi": "Các nhân viên có một con chó trong cuộc đi săn, vì vậy quan điểm của họ nên được lắng nghe."
                    }
                ]
            },
            {
                "define": {
                    "en": "to avoid mentioning a subject or something that happened in the past, in order to avoid any problems or arguments",
                    "vi": "để tránh đề cập đến một chủ đề hoặc điều gì đó đã xảy ra trong quá khứ, để tránh bất kỳ vấn đề hoặc tranh luận nào"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "extremely hard",
                    "vi": "cực kì khó khắn"
                },
                "examples": [
                    {
                        "en": "I've been working like a dog recently.",
                        "vi": "Gần đây tôi đã làm việc như một con chó."
                    }
                ]
            },
            {
                "define": {
                    "en": "in a very bad or cruel way",
                    "vi": "theo một cách rất tồi tệ hoặc tàn nhẫn"
                },
                "examples": [
                    {
                        "en": "They treated him like a dog.",
                        "vi": "Họ đối xử với anh ấy như một con chó."
                    }
                ]
            },
            {
                "define": {
                    "en": "very determined and refusing to give up",
                    "vi": "rất quyết tâm và không chịu bỏ cuộc"
                },
                "examples": [
                    {
                        "en": "When she sensed a good story she was like a dog with a bone.",
                        "vi": "Khi cảm nhận được một câu chuyện hay, cô ấy như một con chó bị hóc xương."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have no chance at all",
                    "vi": "không có cơ hội nào cả"
                },
                "examples": [
                    {
                        "en": "He hasn't a dog's chance of passing the exam.",
                        "vi": "Nó không có cơ hội vượt qua kỳ thi của một con chó."
                    }
                ]
            },
            {
                "define": {
                    "en": "feeling very sick; vomiting a lot",
                    "vi": "cảm thấy rất ốm; nôn nhiều"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to describe a situation in which the most important aspect is being influenced and controlled by somebody/something that is not as important",
                    "vi": "được sử dụng để mô tả một tình huống trong đó khía cạnh quan trọng nhất đang bị ảnh hưởng và kiểm soát bởi ai đó / điều gì đó không quan trọng bằng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "(you cannot) successfully make people change their ideas, methods of work, etc., when they have had them for a long time",
                    "vi": "(bạn không thể) thành công khiến mọi người thay đổi ý tưởng, phương pháp làm việc, v.v., khi họ đã có chúng từ lâu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to allow somebody to suffer or be punished in an unfair way, as if they have no value",
                    "vi": "để cho phép ai đó phải chịu đựng hoặc bị trừng phạt một cách bất công, như thể họ không có giá trị"
                },
                "examples": [
                    {
                        "en": "Her boss collects a big retirement cheque while she is thrown to the dogs.",
                        "vi": "Ông chủ của cô ấy thu thập một tờ séc hưu trí lớn trong khi cô ấy bị ném cho lũ chó."
                    }
                ]
            },
            {
                "define": {
                    "en": "if somebody can do a task for you, there is no point in doing it yourself",
                    "vi": "nếu ai đó có thể làm một nhiệm vụ cho bạn, thì chẳng ích gì khi tự mình làm"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "7fd6d5577f214e48b0bb5b0a8caba974",
        "word": "false move",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌfɔːls ˈmuːv/",
            "us": "/ˌfɔːls ˈmuːv/"
        },
        "nearby": [
            {
                "word": "falsely shouting fire in a crowded theater",
                "pos": ""
            },
            {
                "word": "false memory",
                "pos": "noun"
            },
            {
                "word": "false move",
                "pos": "noun"
            },
            {
                "word": "false rib",
                "pos": "noun"
            },
            {
                "word": "false start",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an action that is not allowed or not recommended and that may cause a bad result",
                    "vi": "một hành động không được phép hoặc không được khuyến khích và có thể gây ra kết quả xấu"
                },
                "examples": [
                    {
                        "en": "One false move and the bomb might blow up.",
                        "vi": "Một hành động sai lầm và quả bom có thể phát nổ."
                    }
                ]
            }
        ]
    },
    {
        "id": "1edd150bacec493aa524471fc80466b7",
        "word": "false start",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌfɔːls ˈstɑːt/",
            "us": "/ˌfɔːls ˈstɑːrt/"
        },
        "nearby": [
            {
                "word": "false move",
                "pos": "noun"
            },
            {
                "word": "false rib",
                "pos": "noun"
            },
            {
                "word": "false start",
                "pos": "noun"
            },
            {
                "word": "false teeth",
                "pos": "noun"
            },
            {
                "word": "falsettist",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an unsuccessful attempt to begin something",
                    "vi": "một nỗ lực không thành công để bắt đầu một cái gì đó"
                },
                "examples": [
                    {
                        "en": "After a number of false starts, she finally found a job she liked.",
                        "vi": "Sau nhiều lần khởi đầu sai lầm, cuối cùng cô cũng tìm được một công việc mà mình yêu thích."
                    }
                ]
            },
            {
                "define": {
                    "en": "a situation when somebody taking part in a race starts before the official signal has been given",
                    "vi": "một tình huống khi ai đó tham gia vào một cuộc đua bắt đầu trước khi tín hiệu chính thức được đưa ra"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "989146a36e8743c9bcdb67362f42e11b",
        "word": "fiasco",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/fiˈæskəʊ/",
            "us": "/fiˈæskəʊ/"
        },
        "nearby": [
            {
                "word": "fiancée",
                "pos": "noun"
            },
            {
                "word": "Fianna Fáil",
                "pos": "noun"
            },
            {
                "word": "fiasco",
                "pos": "noun"
            },
            {
                "word": "fiat",
                "pos": "noun"
            },
            {
                "word": "fib",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "something that does not succeed, often in a way that makes people feel embarrassed",
                    "vi": "điều gì đó không thành công, thường theo cách khiến mọi người cảm thấy xấu hổ"
                },
                "examples": [
                    {
                        "en": "The party was a complete fiasco.",
                        "vi": "Bữa tiệc hoàn toàn thất bại."
                    },
                    {
                        "en": "What a fiasco!",
                        "vi": "Thật là một thất bại!"
                    },
                    {
                        "en": "After the fiasco over the brochures, I decided to take charge of the marketing.",
                        "vi": "Sau khi thất bại với các tài liệu quảng cáo, tôi quyết định phụ trách tiếp thị."
                    }
                ]
            }
        ]
    },
    {
        "id": "ba1153cdccc542fa9b17773d53de6bc3",
        "word": "fizzer",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈfɪzə(r)/",
            "us": "/ˈfɪzər/"
        },
        "nearby": [
            {
                "word": "fizz",
                "pos": "verb"
            },
            {
                "word": "fizz",
                "pos": "noun"
            },
            {
                "word": "fizzer",
                "pos": "noun"
            },
            {
                "word": "fizzle",
                "pos": "verb"
            },
            {
                "word": "fizzle out",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a failure",
                    "vi": "một thất bại"
                },
                "examples": [
                    {
                        "en": "The party was a fizzer.",
                        "vi": "Bữa tiệc đã thành công."
                    }
                ]
            }
        ]
    },
    {
        "id": "da7f56393e0945d486fb513ef80b2f11",
        "word": "flop",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/flɒp/",
            "us": "/flɑːp/"
        },
        "nearby": [
            {
                "word": "floozy",
                "pos": "noun"
            },
            {
                "word": "flop",
                "pos": "verb"
            },
            {
                "word": "flop",
                "pos": "noun"
            },
            {
                "word": "flophouse",
                "pos": "noun"
            },
            {
                "word": "floppy",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a thing or person that is not successful, especially a film, show or party",
                    "vi": "một điều hoặc một người không thành công, đặc biệt là một bộ phim, chương trình hoặc bữa tiệc"
                },
                "examples": [
                    {
                        "en": "a box-office flop",
                        "vi": "phòng vé thất bại"
                    },
                    {
                        "en": "The share sale has been a flop with investors.",
                        "vi": "Việc bán cổ phần đã thất bại với các nhà đầu tư."
                    },
                    {
                        "en": "The show was the biggest flop in TV history.",
                        "vi": "Chương trình là thất bại lớn nhất trong lịch sử truyền hình."
                    }
                ]
            }
        ]
    },
    {
        "id": "f470036f6c314e009003791fab55841d",
        "word": "fool’s errand",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌfuːlz ˈerənd/",
            "us": "/ˌfuːlz ˈerənd/"
        },
        "nearby": [
            {
                "word": "foolproof",
                "pos": "adjective"
            },
            {
                "word": "foolscap",
                "pos": "noun"
            },
            {
                "word": "fool's errand",
                "pos": "noun"
            },
            {
                "word": "fool's gold",
                "pos": "noun"
            },
            {
                "word": "fool's paradise",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a task that has no hope of being done successfully",
                    "vi": "một nhiệm vụ không có hy vọng được thực hiện thành công"
                },
                "examples": [
                    {
                        "en": "He sent me on a fool's errand.",
                        "vi": "Anh ta sai tôi làm một việc vặt vãnh."
                    }
                ]
            }
        ]
    },
    {
        "id": "9a5899ccc1f34ae68e51ebc3eec6e484",
        "word": "fool’s gold",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌfuːlz ˈɡəʊld/",
            "us": "/ˌfuːlz ˈɡəʊld/"
        },
        "nearby": [
            {
                "word": "foolscap",
                "pos": "noun"
            },
            {
                "word": "fool's errand",
                "pos": "noun"
            },
            {
                "word": "fool's gold",
                "pos": "noun"
            },
            {
                "word": "fool's paradise",
                "pos": "noun"
            },
            {
                "word": "foosball",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a yellow mineral found in rock, which looks like gold but is not valuable, also called iron pyrites",
                    "vi": "một khoáng chất màu vàng được tìm thấy trong đá, trông giống như vàng nhưng không có giá trị, còn được gọi là pyrit sắt"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "something that you think is valuable or will earn you a lot of money, but which has no chance of succeeding",
                    "vi": "thứ mà bạn nghĩ là có giá trị hoặc sẽ kiếm được nhiều tiền cho bạn, nhưng không có cơ hội thành công"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "165d713f05a44e4f9dd63884aa7f1136",
        "word": "glitch",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ɡlɪtʃ/",
            "us": "/ɡlɪtʃ/"
        },
        "nearby": [
            {
                "word": "glisten",
                "pos": "verb"
            },
            {
                "word": "glister",
                "pos": "verb"
            },
            {
                "word": "glitch",
                "pos": "noun"
            },
            {
                "word": "glitch",
                "pos": "verb"
            },
            {
                "word": "glitchy",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small problem or fault that stops something working successfully",
                    "vi": "một vấn đề nhỏ hoặc một lỗi làm dừng một cái gì đó hoạt động thành công"
                },
                "examples": [
                    {
                        "en": "A few technical glitches forced us to postpone the demonstration.",
                        "vi": "Một vài trục trặc kỹ thuật buộc chúng tôi phải hoãn buổi biểu diễn."
                    },
                    {
                        "en": "It was only a temporary glitch but it could have put people’s lives in danger.",
                        "vi": "Đó chỉ là một trục trặc tạm thời nhưng nó có thể khiến tính mạng của mọi người gặp nguy hiểm."
                    },
                    {
                        "en": "The new system has too many bugs and glitches to be trusted.",
                        "vi": "Hệ thống mới có quá nhiều lỗi và trục trặc đáng tin cậy."
                    }
                ]
            },
            {
                "define": {
                    "en": "a type of electronic music that uses sound recordings and electronic instruments that have been made to work incorrectly so there are deliberate glitches in the sound",
                    "vi": "một loại nhạc điện tử sử dụng các bản ghi âm và nhạc cụ điện tử đã được chế tạo để hoạt động không chính xác nên âm thanh có cố ý bị trục trặc"
                },
                "examples": [
                    {
                        "en": "Their style embraces everything from hip hop and funk to techno and glitch.",
                        "vi": "Phong cách của họ bao hàm mọi thứ, từ hip hop và funk đến techno và glitch."
                    }
                ]
            }
        ]
    },
    {
        "id": "f7d54699da0f49579a51645236216c02",
        "word": "goner",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɡɒnə(r)/",
            "us": "/ˈɡɔːnər/"
        },
        "nearby": [
            {
                "word": "gone",
                "pos": "preposition"
            },
            {
                "word": "gone",
                "pos": "verb"
            },
            {
                "word": "goner",
                "pos": "noun"
            },
            {
                "word": "Gone with the Wind",
                "pos": ""
            },
            {
                "word": "gong",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person or animal who is going to die soon; somebody/something that cannot be saved from a dangerous situation",
                    "vi": "một người hoặc động vật sắp chết; ai đó / cái gì đó không thể được cứu khỏi một tình huống nguy hiểm"
                },
                "examples": [
                    {
                        "en": "We were frantic. We thought you were a goner.",
                        "vi": "Chúng tôi đã điên cuồng. Chúng tôi nghĩ rằng bạn là một người đi chơi."
                    }
                ]
            }
        ]
    },
    {
        "id": "16da1101398f4696af440a125a7ebf75",
        "word": "has-been",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈhæz biːn/",
            "us": "/ˈhæz bɪn/"
        },
        "nearby": [
            {
                "word": "Harwell Laboratory",
                "pos": ""
            },
            {
                "word": "has",
                "pos": "verb"
            },
            {
                "word": "has-been",
                "pos": "noun"
            },
            {
                "word": "hash",
                "pos": "noun"
            },
            {
                "word": "hash",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who is no longer as famous, successful or important as they used to be",
                    "vi": "một người không còn nổi tiếng, thành công hay quan trọng như họ đã từng"
                },
                "examples": [
                    {
                        "en": "He’s very much a political has-been.",
                        "vi": "Anh ấy đã từng là một chính trị gia."
                    },
                    {
                        "en": "She’s just an old has-been.",
                        "vi": "Cô ấy chỉ là một người cũ."
                    }
                ]
            }
        ]
    },
    {
        "id": "beba9fb6c05d4d5fadff466c4b5d5a3a",
        "word": "hot mess",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌhɒt ˈmes/",
            "us": "/ˌhɑːt ˈmes/"
        },
        "nearby": [
            {
                "word": "hotlist",
                "pos": "noun"
            },
            {
                "word": "hotly",
                "pos": "adverb"
            },
            {
                "word": "hot mess",
                "pos": "noun"
            },
            {
                "word": "hot pants",
                "pos": "noun"
            },
            {
                "word": "hot pink",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person or thing that is completely unsuccessful and lacks any order or control",
                    "vi": "một người hoặc một việc hoàn toàn không thành công và thiếu bất kỳ lệnh hoặc sự kiểm soát nào"
                },
                "examples": [
                    {
                        "en": "That whole storyline was just a crazy hot mess.",
                        "vi": "Toàn bộ cốt truyện đó chỉ là một mớ hỗn độn nóng bỏng điên cuồng."
                    }
                ]
            }
        ]
    },
    {
        "id": "a9caeb9cbfbb48ff81187ba16c778205",
        "word": "house of cards",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌhaʊs əv ˈkɑːdz/",
            "us": "/ˌhaʊs əv ˈkɑːrdz/"
        },
        "nearby": [
            {
                "word": "housemother",
                "pos": "noun"
            },
            {
                "word": "house music",
                "pos": "noun"
            },
            {
                "word": "house of cards",
                "pos": "noun"
            },
            {
                "word": "the House of Commons",
                "pos": "noun"
            },
            {
                "word": "house officer",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a plan, an organization, etc. that is so badly arranged that it could easily fail",
                    "vi": "một kế hoạch, một tổ chức, v.v. được sắp xếp tồi đến mức nó có thể dễ dàng thất bại"
                },
                "examples": [
                    {
                        "en": "The enormous national debt amassed in the last eight years makes all this apparent prosperity nothing but a house of cards.",
                        "vi": "Khoản nợ quốc gia khổng lồ được tích lũy trong tám năm qua khiến tất cả sự thịnh vượng rõ ràng này không có gì khác ngoài một ngôi nhà của quân bài."
                    }
                ]
            },
            {
                "define": {
                    "en": "a structure built out of playing cards",
                    "vi": "một cấu trúc được xây dựng từ việc chơi bài"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "af7ba27582b44be085c2e1651762ef5b",
        "word": "implosion",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ɪmˈpləʊʒn/",
            "us": "/ɪmˈpləʊʒn/"
        },
        "nearby": [
            {
                "word": "implore",
                "pos": "verb"
            },
            {
                "word": "imploring",
                "pos": "adjective"
            },
            {
                "word": "implosion",
                "pos": "noun"
            },
            {
                "word": "imply",
                "pos": "verb"
            },
            {
                "word": "impolite",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act of collapsing into the centre",
                    "vi": "hành động sụp đổ vào trung tâm"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the sudden or complete failure of something",
                    "vi": "sự thất bại đột ngột hoặc hoàn toàn của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "the country's economic implosion",
                        "vi": "sự bùng nổ kinh tế của đất nước"
                    }
                ]
            }
        ]
    },
    {
        "id": "7882920fa13d494f8e48c444258c36c6",
        "word": "lame duck",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌleɪm ˈdʌk/",
            "us": "/ˌleɪm ˈdʌk/"
        },
        "nearby": [
            {
                "word": "lamebrain",
                "pos": "noun"
            },
            {
                "word": "lamebrained",
                "pos": "adjective"
            },
            {
                "word": "lame duck",
                "pos": "noun"
            },
            {
                "word": "lamely",
                "pos": "adverb"
            },
            {
                "word": "lameness",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person or an organization that is not very successful and that needs help",
                    "vi": "một người hoặc một tổ chức không thành công lắm và cần được giúp đỡ"
                },
                "examples": [
                    {
                        "en": "The government should not spend money on helping lame ducks.",
                        "vi": "Chính phủ không nên chi tiền để giúp vịt què."
                    }
                ]
            },
            {
                "define": {
                    "en": "a politician or government whose period of office will soon end and who will not be elected again",
                    "vi": "một chính trị gia hoặc chính phủ sắp kết thúc nhiệm kỳ và người sẽ không được bầu lại"
                },
                "examples": [
                    {
                        "en": "a lame-duck president/administration",
                        "vi": "một tổng thống / chính quyền què quặt"
                    }
                ]
            }
        ]
    },
    {
        "id": "669e2479d4924dd981a4ab9558ef6e5f",
        "word": "lost cause",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌlɒst ˈkɔːz/",
            "us": "/ˌlɔːst ˈkɔːz/"
        },
        "nearby": [
            {
                "word": "lost",
                "pos": "verb"
            },
            {
                "word": "lost and found",
                "pos": "noun"
            },
            {
                "word": "lost cause",
                "pos": "noun"
            },
            {
                "word": "the Lost Gardens of Heligan",
                "pos": ""
            },
            {
                "word": "the lost generation",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "something that has failed or that cannot succeed",
                    "vi": "một cái gì đó đã thất bại hoặc không thể thành công"
                },
                "examples": [
                    {
                        "en": "The game looked a lost cause when the score reached 6–0.",
                        "vi": "Trận đấu có vẻ lạc hướng khi tỷ số lên 6–0."
                    }
                ]
            }
        ]
    },
    {
        "id": "551a6d9f885c4b10bce0200dcb44d1d7",
        "word": "manqué",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmɒŋkeɪ/",
            "us": "/mɑːŋˈkeɪ/"
        },
        "nearby": [
            {
                "word": "manorial",
                "pos": "adjective"
            },
            {
                "word": "manpower",
                "pos": "noun"
            },
            {
                "word": "manqué",
                "pos": "adjective"
            },
            {
                "word": "mansard",
                "pos": "noun"
            },
            {
                "word": "manscaping",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "used to describe a person who hoped to follow a particular career but who failed in it or never tried it",
                    "vi": "được sử dụng để mô tả một người hy vọng theo một nghề nghiệp cụ thể nhưng đã thất bại trong đó hoặc không bao giờ thử"
                },
                "examples": [
                    {
                        "en": "He's really an artist manqué.",
                        "vi": "Anh ấy thực sự là một người nghệ sĩ."
                    }
                ]
            }
        ]
    },
    {
        "id": "16c4016b8b674c78b8ebf0ab6e659ef1",
        "word": "meltdown",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmeltdaʊn/",
            "us": "/ˈmeltdaʊn/"
        },
        "nearby": [
            {
                "word": "melt away",
                "pos": "phrasal verb"
            },
            {
                "word": "melt down",
                "pos": "phrasal verb"
            },
            {
                "word": "meltdown",
                "pos": "noun"
            },
            {
                "word": "melting",
                "pos": "adjective"
            },
            {
                "word": "meltingly",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a serious accident in which the central part of a nuclear reactor melts, causing harmful radiation to escape",
                    "vi": "một tai nạn nghiêm trọng trong đó phần trung tâm của lò phản ứng hạt nhân nóng chảy, làm thoát ra bức xạ có hại"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a situation where something fails or becomes weaker in a sudden or dramatic way",
                    "vi": "một tình huống trong đó một cái gì đó không thành công hoặc trở nên yếu hơn một cách đột ngột hoặc kịch tính"
                },
                "examples": [
                    {
                        "en": "in meltdown The country is in economic meltdown.",
                        "vi": "trong cuộc khủng hoảng Đất nước đang trong cuộc khủng hoảng kinh tế."
                    },
                    {
                        "en": "a meltdown on the New York Stock Exchange",
                        "vi": "một cuộc khủng hoảng trên thị trường chứng khoán New York"
                    }
                ]
            }
        ]
    },
    {
        "id": "6b075ddf06cf4a069173bae82404d0a4",
        "word": "miscommunication",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌmɪskəˌmjuːnɪˈkeɪʃn/",
            "us": "/ˌmɪskəˌmjuːnɪˈkeɪʃn/"
        },
        "nearby": [
            {
                "word": "mischievously",
                "pos": "adverb"
            },
            {
                "word": "miscible",
                "pos": "adjective"
            },
            {
                "word": "miscommunication",
                "pos": "noun"
            },
            {
                "word": "misconceive",
                "pos": "verb"
            },
            {
                "word": "misconceived",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "failure to make information or your ideas and feelings clear to somebody, or to understand what somebody says to you",
                    "vi": "không làm cho thông tin hoặc ý tưởng và cảm xúc của bạn rõ ràng với ai đó, hoặc để hiểu những gì ai đó nói với bạn"
                },
                "examples": [
                    {
                        "en": "The study focused on the source of miscommunication that frequently occurs between men and women.",
                        "vi": "Nghiên cứu tập trung vào nguồn gốc của thông tin sai lệch thường xảy ra giữa nam giới và phụ nữ."
                    },
                    {
                        "en": "Opportunities for misunderstandings and miscommunications increase when the information is very technical.",
                        "vi": "Cơ hội cho sự hiểu lầm và thông tin sai sẽ tăng lên khi thông tin mang tính kỹ thuật cao."
                    }
                ]
            }
        ]
    },
    {
        "id": "7122abd420cb4aa8a8c520b0b8eb4054",
        "word": "mockery",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmɒkəri/",
            "us": "/ˈmɑːkəri/"
        },
        "nearby": [
            {
                "word": "mocker",
                "pos": "noun"
            },
            {
                "word": "mockers",
                "pos": "noun"
            },
            {
                "word": "mockery",
                "pos": "noun"
            },
            {
                "word": "mocking",
                "pos": "adjective"
            },
            {
                "word": "mockingbird",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "comments or actions that are intended to make somebody/something seem silly",
                    "vi": "nhận xét hoặc hành động nhằm làm cho ai đó / điều gì đó có vẻ ngớ ngẩn"
                },
                "examples": [
                    {
                        "en": "She couldn't stand any more of their mockery.",
                        "vi": "Cô không thể chịu đựng thêm những lời chế giễu của họ nữa."
                    },
                    {
                        "en": "His smile was full of mockery.",
                        "vi": "Nụ cười của anh ta đầy vẻ chế giễu."
                    },
                    {
                        "en": "The government has left itself open to mockery and ridicule.",
                        "vi": "Chính phủ đã để ngỏ cho mình những lời chế giễu và chế giễu."
                    }
                ]
            },
            {
                "define": {
                    "en": "an action, a decision, etc. that is a failure and that is not as it is supposed to be",
                    "vi": "một hành động, một quyết định, v.v. là một thất bại và điều đó không như nó được cho là"
                },
                "examples": [
                    {
                        "en": "It was a mockery of a trial.",
                        "vi": "Đó là một sự nhạo báng của một phiên tòa."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make something seem silly or without effect",
                    "vi": "để làm cho một cái gì đó có vẻ ngớ ngẩn hoặc không có tác dụng"
                },
                "examples": [
                    {
                        "en": "The trial made a mockery of justice.",
                        "vi": "Phiên tòa thực hiện một sự nhạo báng công lý."
                    }
                ]
            }
        ]
    },
    {
        "id": "a2c55d145a2848c1b77f9096eceab5ab",
        "word": "no-hoper",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌnəʊ ˈhəʊpə(r)/",
            "us": "/ˌnəʊ ˈhəʊpər/"
        },
        "nearby": [
            {
                "word": "Noh",
                "pos": "noun"
            },
            {
                "word": "no-hitter",
                "pos": "noun"
            },
            {
                "word": "no-hoper",
                "pos": "noun"
            },
            {
                "word": "noir",
                "pos": "noun"
            },
            {
                "word": "noise",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person or an animal that is considered very unlikely to be successful",
                    "vi": "một người hoặc một động vật được coi là rất khó có thể thành công"
                },
                "examples": [
                    {
                        "en": "a team of complete no-hopers",
                        "vi": "một đội hoàn toàn không hopers"
                    },
                    {
                        "en": "An apparent no-hoper won the race at 33–1.",
                        "vi": "Một người không hoper rõ ràng đã thắng cuộc đua với tỷ số 33–1."
                    },
                    {
                        "en": "They were written off as a bunch of no-hopers.",
                        "vi": "Họ đã bị xóa sổ như một đám vô tích sự."
                    }
                ]
            }
        ]
    },
    {
        "id": "d96dd738c92841b896beda85ba6ebee4",
        "word": "nonentity",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/nɒnˈentəti/",
            "us": "/nɑːnˈentəti/"
        },
        "nearby": [
            {
                "word": "none",
                "pos": "pronoun"
            },
            {
                "word": "none",
                "pos": "adverb"
            },
            {
                "word": "nonentity",
                "pos": "noun"
            },
            {
                "word": "non-essential",
                "pos": "adjective"
            },
            {
                "word": "non-essential",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person without any special qualities, who has not achieved anything important",
                    "vi": "một người không có bất kỳ phẩm chất đặc biệt nào, người không đạt được bất cứ điều gì quan trọng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "86ab9a5a44f340f98e5cbaf1387d24d2",
        "word": "non-starter",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌnɒn ˈstɑːtə(r)/",
            "us": "/ˌnɑːn ˈstɑːrtər/"
        },
        "nearby": [
            {
                "word": "non-specific urethritis",
                "pos": "noun"
            },
            {
                "word": "non-standard",
                "pos": "adjective"
            },
            {
                "word": "non-starter",
                "pos": "noun"
            },
            {
                "word": "non-stick",
                "pos": "adjective"
            },
            {
                "word": "non-stop",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a thing or a person that has no chance of success",
                    "vi": "một điều hoặc một người không có cơ hội thành công"
                },
                "examples": [
                    {
                        "en": "As a business proposition, it's a non-starter.",
                        "vi": "Là một đề xuất kinh doanh, nó không phải là người khởi đầu."
                    }
                ]
            }
        ]
    },
    {
        "id": "2ce90093de6c44aa8e4f8df0e3cf7b7b",
        "word": "own goal",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌəʊn ˈɡəʊl/",
            "us": "/ˌəʊn ˈɡəʊl/"
        },
        "nearby": [
            {
                "word": "owner-occupier",
                "pos": "noun"
            },
            {
                "word": "ownership",
                "pos": "noun"
            },
            {
                "word": "own goal",
                "pos": "noun"
            },
            {
                "word": "own-label",
                "pos": "adjective"
            },
            {
                "word": "own up",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a goal that is scored by mistake by a player against his or her own team",
                    "vi": "một bàn thắng được ghi do nhầm lẫn bởi một cầu thủ trong đội của họ"
                },
                "examples": [
                    {
                        "en": "Vega scored an unfortunate own goal when he slipped as he tried to clear the ball.",
                        "vi": "Vega đã phản lưới nhà đáng tiếc khi anh ấy trượt chân khi cố gắng phá bóng."
                    }
                ]
            },
            {
                "define": {
                    "en": "something that you do that achieves the opposite of what you wanted and that brings you a disadvantage",
                    "vi": "điều gì đó mà bạn làm đạt được điều ngược lại với những gì bạn muốn và điều đó mang lại cho bạn một bất lợi"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "7c582d6ae9eb4bd7b0758acabf402a4d",
        "word": "paper tiger",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌpeɪpə ˈtaɪɡə(r)/",
            "us": "/ˌpeɪpər ˈtaɪɡər/"
        },
        "nearby": [
            {
                "word": "paper shop",
                "pos": "noun"
            },
            {
                "word": "paper-thin",
                "pos": "adjective"
            },
            {
                "word": "paper tiger",
                "pos": "noun"
            },
            {
                "word": "paper towel",
                "pos": "noun"
            },
            {
                "word": "paper trail",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person, a country or a situation that seems or claims to be powerful or dangerous but is not really",
                    "vi": "một người, một quốc gia hoặc một tình huống có vẻ như hoặc tuyên bố là mạnh mẽ hoặc nguy hiểm nhưng không thực sự"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "0aaab41511aa478aac6bf7af0b7f205c",
        "word": "poor relation",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌpɔː rɪˈleɪʃn/",
            "us": "/ˌpʊr rɪˈleɪʃn/"
        },
        "nearby": [
            {
                "word": "poorly",
                "pos": "adjective"
            },
            {
                "word": "poorness",
                "pos": "noun"
            },
            {
                "word": "poor relation",
                "pos": "noun"
            },
            {
                "word": "Poor Richard's Almanack",
                "pos": ""
            },
            {
                "word": "Mr Pooter",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "something that is not treated with as much respect as other similar things because it is not thought to be as good, important or successful",
                    "vi": "một thứ không được tôn trọng như những thứ tương tự khác bởi vì nó không được cho là tốt, quan trọng hoặc thành công"
                },
                "examples": [
                    {
                        "en": "The short story is often considered to be a poor relation to the novel.",
                        "vi": "Truyện ngắn thường bị coi là kém liên quan đến tiểu thuyết."
                    }
                ]
            }
        ]
    },
    {
        "id": "572acbd5ee2a403493c11366fe835ebc",
        "word": "put something down to experience",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/ɪkˈspɪəriəns/",
            "us": "/ɪkˈspɪriəns/"
        },
        "nearby": [
            {
                "word": "expensive",
                "pos": "adjective"
            },
            {
                "word": "expensively",
                "pos": "adverb"
            },
            {
                "word": "experience",
                "pos": "noun"
            },
            {
                "word": "experience",
                "pos": "verb"
            },
            {
                "word": "experienced",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the knowledge and skill that you have gained through doing something for a period of time; the process of gaining this",
                    "vi": "kiến thức và kỹ năng mà bạn có được khi làm một việc gì đó trong một khoảng thời gian; quá trình đạt được điều này"
                },
                "examples": [
                    {
                        "en": "My lack of practical experience was a disadvantage.",
                        "vi": "Thiếu kinh nghiệm thực tế của tôi là một bất lợi."
                    },
                    {
                        "en": "experience of something Do you have any previous experience of this type of work?",
                        "vi": "kinh nghiệm của một cái gì đó Bạn có bất kỳ kinh nghiệm trước đây về loại công việc?"
                    },
                    {
                        "en": "This new approach draws on years of experience of teaching children to read.",
                        "vi": "Cách tiếp cận mới này dựa trên kinh nghiệm nhiều năm dạy trẻ em đọc."
                    },
                    {
                        "en": "experience in doing something a doctor with experience in dealing with patients suffering from stress",
                        "vi": "kinh nghiệm làm việc gì đó một bác sĩ có kinh nghiệm đối phó với những bệnh nhân bị căng thẳng"
                    },
                    {
                        "en": "experience in something He gained extensive experience in the field of artificial intelligence whilst working on the project.",
                        "vi": "kinh nghiệm trong lĩnh vực nào đó Anh ấy đã có được nhiều kinh nghiệm trong lĩnh vực trí tuệ nhân tạo khi làm việc trong dự án."
                    },
                    {
                        "en": "experience as something I have over ten years’ experience as a teacher.",
                        "vi": "kinh nghiệm như một thứ mà tôi có hơn mười năm kinh nghiệm làm giáo viên."
                    },
                    {
                        "en": "experience with something The course provides hands-on experience with various systems.",
                        "vi": "trải nghiệm với điều gì đó Khóa học cung cấp kinh nghiệm thực hành với các hệ thống khác nhau."
                    },
                    {
                        "en": "She didn't get paid much but it was all good experience.",
                        "vi": "Cô ấy không được trả nhiều tiền nhưng tất cả đều là trải nghiệm tốt."
                    },
                    {
                        "en": "We all learn by experience.",
                        "vi": "Tất cả chúng ta đều học hỏi bằng kinh nghiệm."
                    },
                    {
                        "en": "The new player will bring a wealth of experience to the team.",
                        "vi": "Người chơi mới sẽ mang lại nhiều kinh nghiệm cho cả đội."
                    }
                ]
            },
            {
                "define": {
                    "en": "the things that have happened to you that influence the way you think and behave",
                    "vi": "những điều đã xảy ra với bạn ảnh hưởng đến cách bạn suy nghĩ và cư xử"
                },
                "examples": [
                    {
                        "en": "Experience has taught me that life can be very unfair.",
                        "vi": "Kinh nghiệm đã dạy tôi rằng cuộc sống có thể rất bất công."
                    },
                    {
                        "en": "Experience shows that this strategy does not always work.",
                        "vi": "Kinh nghiệm cho thấy không phải lúc nào chiến lược này cũng hiệu quả."
                    },
                    {
                        "en": "The book is based on personal experience.",
                        "vi": "Cuốn sách dựa trên kinh nghiệm cá nhân."
                    },
                    {
                        "en": "from experience It is important to try and learn from experience.",
                        "vi": "từ kinh nghiệm Điều quan trọng là cố gắng và học hỏi kinh nghiệm."
                    },
                    {
                        "en": "She knew from past experience that Ann would not give up easily.",
                        "vi": "Từ kinh nghiệm trong quá khứ, cô biết rằng Ann sẽ không dễ dàng từ bỏ."
                    },
                    {
                        "en": "in somebody's experience In my experience, very few people really understand the problem.",
                        "vi": "theo kinh nghiệm của ai đó Theo kinh nghiệm của tôi, rất ít người thực sự hiểu được vấn đề."
                    },
                    {
                        "en": "experience of something He had first-hand experience of poverty.",
                        "vi": "kinh nghiệm về điều gì đó Anh ấy đã có kinh nghiệm đầu tiên về nghèo đói."
                    },
                    {
                        "en": "the collective experience of everyday life",
                        "vi": "kinh nghiệm chung của cuộc sống hàng ngày"
                    }
                ]
            },
            {
                "define": {
                    "en": "an event or activity that affects you in some way",
                    "vi": "một sự kiện hoặc hoạt động ảnh hưởng đến bạn theo một cách nào đó"
                },
                "examples": [
                    {
                        "en": "a unique/positive/wonderful experience",
                        "vi": "một trải nghiệm độc đáo / tích cực / tuyệt vời"
                    },
                    {
                        "en": "experience of something Share your experiences of parenthood by emailing the address below.",
                        "vi": "kinh nghiệm về điều gì đó Chia sẻ kinh nghiệm làm cha mẹ của bạn bằng cách gửi email đến địa chỉ bên dưới."
                    },
                    {
                        "en": "We aim to give our guests the experience of a lifetime.",
                        "vi": "Chúng tôi mong muốn mang đến cho khách những trải nghiệm trọn đời."
                    },
                    {
                        "en": "experience of doing something It was her first experience of living alone.",
                        "vi": "kinh nghiệm làm điều gì đó Đó là kinh nghiệm sống một mình đầu tiên của cô."
                    },
                    {
                        "en": "The play is based loosely on his own life experiences.",
                        "vi": "Vở kịch được xây dựng dựa trên kinh nghiệm sống của chính anh ấy."
                    },
                    {
                        "en": "He found the whole experience traumatic.",
                        "vi": "Anh ấy thấy toàn bộ trải nghiệm đều là đau thương."
                    },
                    {
                        "en": "Losing four matches in a row proved a valuable learning experience (= it showed the players what they need to improve).",
                        "vi": "Để thua bốn trận liên tiếp chứng tỏ một kinh nghiệm học hỏi quý giá (= nó cho các cầu thủ thấy họ cần cải thiện điều gì)."
                    },
                    {
                        "en": "Living in Africa was very different from home and quite an experience (= unusual for us).",
                        "vi": "Sống ở Châu Phi rất khác so với ở nhà và là một trải nghiệm (= bất thường đối với chúng tôi)."
                    }
                ]
            },
            {
                "define": {
                    "en": "what it is like for somebody to use a service, do an activity, attend an event, etc.",
                    "vi": "ai đó sử dụng một dịch vụ, thực hiện một hoạt động, tham dự một sự kiện, v.v."
                },
                "examples": [
                    {
                        "en": "We are continually looking for ways to improve the customer experience.",
                        "vi": "Chúng tôi liên tục tìm cách cải thiện trải nghiệm của khách hàng."
                    },
                    {
                        "en": "Enjoy a fine dining experience with quality service.",
                        "vi": "Tận hưởng trải nghiệm ẩm thực cao cấp với dịch vụ chất lượng."
                    }
                ]
            },
            {
                "define": {
                    "en": "events or knowledge shared by all the members of a particular group in society, that influences the way they think and behave",
                    "vi": "các sự kiện hoặc kiến thức được chia sẻ bởi tất cả các thành viên của một nhóm cụ thể trong xã hội, ảnh hưởng đến cách họ suy nghĩ và hành xử"
                },
                "examples": [
                    {
                        "en": "musical forms like jazz that emerged out of the Black American experience",
                        "vi": "các hình thức âm nhạc như jazz xuất hiện từ trải nghiệm của người Mỹ da đen"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that somebody should think of a failure as being something that they can learn from",
                    "vi": "đã từng nói rằng ai đó nên nghĩ về thất bại là điều gì đó mà họ có thể học hỏi từ"
                },
                "examples": [
                    {
                        "en": "We lost a lot of money, but we just put it down to experience.",
                        "vi": "Chúng tôi đã mất rất nhiều tiền, nhưng chúng tôi chỉ đặt nó xuống để trải nghiệm."
                    }
                ]
            }
        ]
    },
    {
        "id": "e993fe3581b44eda8c8d59a44169c86b",
        "word": "rearguard action",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌrɪəɡɑːd ˈækʃn/",
            "us": "/ˌrɪrɡɑːrd ˈækʃn/"
        },
        "nearby": [
            {
                "word": "rear-end",
                "pos": "verb"
            },
            {
                "word": "rearguard",
                "pos": "noun"
            },
            {
                "word": "rearguard action",
                "pos": "noun"
            },
            {
                "word": "rearing",
                "pos": "noun"
            },
            {
                "word": "rearm",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a struggle to change or stop something even when it is not likely that you will succeed",
                    "vi": "một cuộc đấu tranh để thay đổi hoặc ngăn chặn điều gì đó ngay cả khi bạn không chắc sẽ thành công"
                },
                "examples": [
                    {
                        "en": "They have been fighting a rearguard action for two years to stop their house being demolished.",
                        "vi": "Họ đã chiến đấu chống lại một hành động hậu thuẫn trong hai năm để ngăn ngôi nhà của họ bị phá dỡ."
                    }
                ]
            }
        ]
    },
    {
        "id": "6388901c95584ec8ba76c11e81fd78b4",
        "word": "reverse",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/rɪˈvɜːs/",
            "us": "/rɪˈvɜːrs/"
        },
        "nearby": [
            {
                "word": "reversal",
                "pos": "noun"
            },
            {
                "word": "reverse",
                "pos": "verb"
            },
            {
                "word": "reverse",
                "pos": "noun"
            },
            {
                "word": "reverse",
                "pos": "adjective"
            },
            {
                "word": "reverse-charge",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the opposite of what has just been mentioned",
                    "vi": "đối lập với những gì vừa được đề cập"
                },
                "examples": [
                    {
                        "en": "This problem is the reverse of the previous one.",
                        "vi": "Vấn đề này là mặt trái của vấn đề trước."
                    },
                    {
                        "en": "Although I expected to enjoy living in the country, in fact the reverse is true.",
                        "vi": "Mặc dù tôi mong muốn được tận hưởng cuộc sống trong nước, nhưng thực tế thì điều ngược lại là đúng."
                    },
                    {
                        "en": "In the south, the reverse applies.",
                        "vi": "Ở miền nam, điều ngược lại được áp dụng."
                    },
                    {
                        "en": "It wasn't easy to persuade her to come—quite the reverse.",
                        "vi": "Thật không dễ dàng để thuyết phục cô ấy đến — hoàn toàn ngược lại."
                    },
                    {
                        "en": "If you tell children to do something, they will often do the exact reverse.",
                        "vi": "Nếu bạn bảo trẻ làm điều gì đó, chúng thường sẽ làm ngược lại hoàn toàn."
                    }
                ]
            },
            {
                "define": {
                    "en": "the back of a coin, piece of material, piece of paper, etc.",
                    "vi": "mặt sau của đồng xu, mảnh vật liệu, mảnh giấy, v.v."
                },
                "examples": [
                    {
                        "en": "The coin has a coat of arms stamped on the reverse.",
                        "vi": "Mặt trái của đồng tiền có in hình quốc huy."
                    },
                    {
                        "en": "The coin has a date on one side and the emperor's head on the reverse.",
                        "vi": "Đồng xu có ngày ở một mặt và đầu của hoàng đế ở mặt sau."
                    }
                ]
            },
            {
                "define": {
                    "en": "the machine in a vehicle used to make it move backwards",
                    "vi": "máy trong một chiếc xe được sử dụng để làm cho nó di chuyển ngược lại"
                },
                "examples": [
                    {
                        "en": "Put the car in/into reverse.",
                        "vi": "Cho xe vào / lùi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a loss or defeat; a change from success to failure",
                    "vi": "một mất mát hoặc thất bại; sự thay đổi từ thành công sang thất bại"
                },
                "examples": [
                    {
                        "en": "Property values have suffered another reverse.",
                        "vi": "Giá trị tài sản đã bị ngược lại."
                    },
                    {
                        "en": "a damaging political reverse",
                        "vi": "một mặt trái chính trị tai hại"
                    },
                    {
                        "en": "Their forces have suffered serious reverses in recent months.",
                        "vi": "Lực lượng của họ đã bị đảo ngược nghiêm trọng trong những tháng gần đây."
                    }
                ]
            },
            {
                "define": {
                    "en": "to start to happen or to make something happen in the opposite way",
                    "vi": "bắt đầu xảy ra hoặc làm cho điều gì đó xảy ra theo cách ngược lại"
                },
                "examples": [
                    {
                        "en": "In 2008 economic growth went into reverse.",
                        "vi": "Năm 2008 tăng trưởng kinh tế đi ngược lại."
                    },
                    {
                        "en": "Various problems have put the company’s expansion plans into reverse.",
                        "vi": "Nhiều vấn đề khác nhau đã khiến kế hoạch mở rộng của công ty bị đảo ngược."
                    }
                ]
            },
            {
                "define": {
                    "en": "in the opposite order or way",
                    "vi": "theo thứ tự hoặc cách ngược lại"
                },
                "examples": [
                    {
                        "en": "The secret number is my phone number in reverse.",
                        "vi": "Số bí mật là số điện thoại của tôi ngược lại."
                    },
                    {
                        "en": "We did a similar trip to you, but in reverse.",
                        "vi": "Chúng tôi đã thực hiện một chuyến đi tương tự với bạn, nhưng ngược lại."
                    }
                ]
            }
        ]
    },
    {
        "id": "8974c142a2814840af9f0916585697b4",
        "word": "slippage",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈslɪpɪdʒ/",
            "us": "/ˈslɪpɪdʒ/"
        },
        "nearby": [
            {
                "word": "slip-on",
                "pos": "noun"
            },
            {
                "word": "slip out",
                "pos": "phrasal verb"
            },
            {
                "word": "slippage",
                "pos": "noun"
            },
            {
                "word": "slipped disc",
                "pos": "noun"
            },
            {
                "word": "slipper",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "failure to achieve an aim or complete a task by a particular date",
                    "vi": "không đạt được mục tiêu hoặc hoàn thành nhiệm vụ vào một ngày cụ thể"
                },
                "examples": [
                    {
                        "en": "The smallest slippage could delay completion of the project.",
                        "vi": "Sự trượt giá nhỏ nhất có thể làm trì hoãn việc hoàn thành dự án."
                    }
                ]
            },
            {
                "define": {
                    "en": "a slight or slow steady fall in the amount, value, etc. of something",
                    "vi": "sự giảm nhẹ hoặc chậm đều đặn về số lượng, giá trị, v.v. của một thứ gì đó"
                },
                "examples": [
                    {
                        "en": "There has been some slippage of support for the government’s policies.",
                        "vi": "Sự hỗ trợ cho các chính sách của chính phủ đã có một số trượt giá."
                    }
                ]
            }
        ]
    },
    {
        "id": "de670c55bbe74de2b0de5e7d7c2adc79",
        "word": "small-time",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsmɔːl taɪm/",
            "us": "/ˈsmɔːl taɪm/"
        },
        "nearby": [
            {
                "word": "the small screen",
                "pos": "noun"
            },
            {
                "word": "small talk",
                "pos": "noun"
            },
            {
                "word": "small-time",
                "pos": "adjective"
            },
            {
                "word": "small-town",
                "pos": "adjective"
            },
            {
                "word": "smarmy",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "not very important or successful",
                    "vi": "không quan trọng hay thành công"
                },
                "examples": [
                    {
                        "en": "a small-time crook",
                        "vi": "một kẻ gian nhỏ"
                    }
                ]
            }
        ]
    },
    {
        "id": "6f3fdf59b77c4853b0c0cbf14a480f9f",
        "word": "stumble",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈstʌmbl/",
            "us": "/ˈstʌmbl/"
        },
        "nearby": [
            {
                "word": "stultifying",
                "pos": "adjective"
            },
            {
                "word": "stultifyingly",
                "pos": "adverb"
            },
            {
                "word": "stumble",
                "pos": "noun"
            },
            {
                "word": "stumble",
                "pos": "verb"
            },
            {
                "word": "stumble across",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a problem or temporary failure when you are on the way to achieving something",
                    "vi": "một vấn đề hoặc thất bại tạm thời khi bạn đang trên đường đạt được điều gì đó"
                },
                "examples": [
                    {
                        "en": "There were good reasons for the team's first-round stumble against Los Angeles.",
                        "vi": "Có những lý do chính đáng cho việc đội đầu tiên vấp ngã trước Los Angeles."
                    }
                ]
            },
            {
                "define": {
                    "en": "an act of falling or almost falling, especially because you hit your foot against something",
                    "vi": "một hành động ngã hoặc suýt ngã, đặc biệt là vì bạn đập chân vào vật gì đó"
                },
                "examples": [
                    {
                        "en": "After a slight stumble backwards, he regained his balance.",
                        "vi": "Sau khi hơi loạng choạng về phía sau, anh đã lấy lại được thăng bằng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a mistake that causes you to stop when you are reading, speaking or playing music",
                    "vi": "một lỗi khiến bạn dừng lại khi đang đọc, nói hoặc chơi nhạc"
                },
                "examples": [
                    {
                        "en": "verbal stumbles",
                        "vi": "vấp váp bằng lời nói"
                    }
                ]
            }
        ]
    },
    {
        "id": "9d970b3d25924495a7adc87ce8a14a46",
        "word": "train wreck",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈtreɪn rek/",
            "us": "/ˈtreɪn rek/"
        },
        "nearby": [
            {
                "word": "trainspotting",
                "pos": "noun"
            },
            {
                "word": "Trainspotting",
                "pos": ""
            },
            {
                "word": "train wreck",
                "pos": "noun"
            },
            {
                "word": "traipse",
                "pos": "verb"
            },
            {
                "word": "trait",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an accident in which a train crashes into something else or comes off the track",
                    "vi": "một vụ tai nạn trong đó một đoàn tàu đâm vào một thứ khác hoặc chệch khỏi đường ray"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a situation, a person’s life, etc. that people find extremely interesting because it lacks order, is very bad or is unsuccessful",
                    "vi": "một tình huống, cuộc sống của một người, v.v. mà mọi người cảm thấy vô cùng thú vị vì nó thiếu trật tự, rất tồi tệ hoặc không thành công"
                },
                "examples": [
                    {
                        "en": "She gives a train wreck of a performance in the movie.",
                        "vi": "Cô ấy cho một xác tàu hỏa của một màn trình diễn trong phim."
                    },
                    {
                        "en": "This guy is a train wreck.",
                        "vi": "Anh chàng này là một xác tàu hỏa."
                    }
                ]
            }
        ]
    },
    {
        "id": "8910e4ab999b474ebc8ec6a6726316a0",
        "word": "turkey",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈtɜːki/",
            "us": "/ˈtɜːrki/"
        },
        "nearby": [
            {
                "word": "turista",
                "pos": "noun"
            },
            {
                "word": "Turk",
                "pos": "noun"
            },
            {
                "word": "turkey",
                "pos": "noun"
            },
            {
                "word": "Turkey",
                "pos": "noun"
            },
            {
                "word": "turkey shoot",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a large bird that is often kept for its meat, eaten especially at Christmas in the UK and at Thanksgiving in the US",
                    "vi": "một loài chim lớn thường được nuôi để lấy thịt, đặc biệt là ăn vào dịp Giáng sinh ở Anh và Lễ tạ ơn ở Mỹ"
                },
                "examples": [
                    {
                        "en": "We raise turkeys mainly for the Christmas market.",
                        "vi": "Chúng tôi nuôi gà tây chủ yếu để phục vụ thị trường Giáng sinh."
                    }
                ]
            },
            {
                "define": {
                    "en": "meat from a turkey",
                    "vi": "thịt gà tây"
                },
                "examples": [
                    {
                        "en": "roast turkey",
                        "vi": "gà tây nướng"
                    },
                    {
                        "en": "the traditional turkey with all the trimmings",
                        "vi": "gà tây truyền thống với tất cả các đồ trang trí"
                    }
                ]
            },
            {
                "define": {
                    "en": "a failure",
                    "vi": "một thất bại"
                },
                "examples": [
                    {
                        "en": "His latest movie is a real turkey.",
                        "vi": "Bộ phim mới nhất của anh ấy là một con gà tây có thật."
                    }
                ]
            },
            {
                "define": {
                    "en": "a stupid person who is not useful to anyone",
                    "vi": "một người ngu ngốc và không có ích cho bất cứ ai"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to talk about something seriously",
                    "vi": "để nói về một cái gì đó nghiêm túc"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "78211e8fafb14b26b6757c68a41af709",
        "word": "washout",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈwɒʃaʊt/",
            "us": "/ˈwɑːʃaʊt/"
        },
        "nearby": [
            {
                "word": "wash off",
                "pos": "phrasal verb"
            },
            {
                "word": "wash out",
                "pos": "phrasal verb"
            },
            {
                "word": "washout",
                "pos": "noun"
            },
            {
                "word": "wash over",
                "pos": "phrasal verb"
            },
            {
                "word": "washroom",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an event, etc. that is a complete failure, especially because of rain",
                    "vi": "một sự kiện, v.v. thất bại hoàn toàn, đặc biệt là do mưa"
                },
                "examples": [
                    {
                        "en": "They feared that the wedding was going to be a washout after torrential rain.",
                        "vi": "Họ sợ rằng đám cưới sẽ trôi qua sau cơn mưa xối xả."
                    }
                ]
            }
        ]
    },
    {
        "id": "fa80cc84c9c74184b161f17b42326528",
        "word": "the weak link (in the chain)",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/wiːk/",
            "us": "/wiːk/"
        },
        "nearby": [
            {
                "word": "WC",
                "pos": "noun"
            },
            {
                "word": "we",
                "pos": "pronoun"
            },
            {
                "word": "weak",
                "pos": "adjective"
            },
            {
                "word": "weaken",
                "pos": "verb"
            },
            {
                "word": "The Weakest Link",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "not physically strong",
                    "vi": "không khỏe mạnh"
                },
                "examples": [
                    {
                        "en": "She is still weak after her illness.",
                        "vi": "Cô ấy vẫn còn yếu sau trận ốm."
                    },
                    {
                        "en": "His legs felt weak.",
                        "vi": "Chân anh yếu đi."
                    },
                    {
                        "en": "She suffered from a weak heart.",
                        "vi": "Cô bị một trái tim yếu ớt."
                    },
                    {
                        "en": "weak with/from something I was exhausted and weak with hunger.",
                        "vi": "yếu ớt với / từ một cái gì đó Tôi đã kiệt sức và yếu ớt vì đói."
                    }
                ]
            },
            {
                "define": {
                    "en": "that cannot support a lot of weight; likely to break",
                    "vi": "mà không thể hỗ trợ nhiều trọng lượng; có khả năng bị phá vỡ"
                },
                "examples": [
                    {
                        "en": "That bridge is too weak for heavy traffic.",
                        "vi": "Cây cầu đó quá yếu cho giao thông đông đúc."
                    },
                    {
                        "en": "Weak foundations caused the building to collapse.",
                        "vi": "Nền móng yếu khiến tòa nhà bị sập."
                    }
                ]
            },
            {
                "define": {
                    "en": "easy to influence; not having much power",
                    "vi": "dễ ảnh hưởng; không có nhiều quyền lực"
                },
                "examples": [
                    {
                        "en": "a weak and cowardly man",
                        "vi": "một người đàn ông yếu đuối và hèn nhát"
                    },
                    {
                        "en": "In a weak moment (= when I was easily persuaded) I said she could borrow the car.",
                        "vi": "Trong một khoảnh khắc yếu đuối (= khi tôi bị thuyết phục dễ dàng), tôi đã nói rằng cô ấy có thể mượn xe."
                    },
                    {
                        "en": "Small firms find themselves in a very weak position during a recession.",
                        "vi": "Các công ty nhỏ nhận thấy mình ở một vị trí rất yếu trong thời kỳ suy thoái."
                    },
                    {
                        "en": "a weak leader",
                        "vi": "một nhà lãnh đạo yếu kém"
                    },
                    {
                        "en": "The unions have always been weak in this industry.",
                        "vi": "Các công đoàn luôn yếu trong ngành này."
                    }
                ]
            },
            {
                "define": {
                    "en": "people who are poor, sick or without power",
                    "vi": "những người nghèo, bệnh tật hoặc không có quyền lực"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "not financially strong or successful",
                    "vi": "không đủ mạnh về tài chính hoặc không thành công"
                },
                "examples": [
                    {
                        "en": "A weak dollar isn't bad news for everyone.",
                        "vi": "Đồng đô la yếu không phải là tin xấu đối với tất cả mọi người."
                    },
                    {
                        "en": "a weak currency/yen/euro",
                        "vi": "đồng tiền yếu / yên / euro"
                    },
                    {
                        "en": "Is it your policy to have a relatively weak currency?",
                        "vi": "Có phải chính sách của bạn là có một đồng tiền tương đối yếu?"
                    },
                    {
                        "en": "The economy is very weak.",
                        "vi": "Nền kinh tế rất yếu."
                    },
                    {
                        "en": "weak against something The currency was still relatively weak against the dollar.",
                        "vi": "yếu so với thứ gì đó Đồng tiền vẫn tương đối yếu so với đồng đô la."
                    }
                ]
            },
            {
                "define": {
                    "en": "a weak liquid contains a lot of water",
                    "vi": "một chất lỏng yếu chứa nhiều nước"
                },
                "examples": [
                    {
                        "en": "weak tea",
                        "vi": "trà nhạt"
                    },
                    {
                        "en": "a weak acid",
                        "vi": "một axit yếu"
                    }
                ]
            },
            {
                "define": {
                    "en": "not easily seen or heard",
                    "vi": "không dễ dàng nhìn thấy hoặc nghe thấy"
                },
                "examples": [
                    {
                        "en": "a weak light/signal/sound",
                        "vi": "ánh sáng / tín hiệu / âm thanh yếu"
                    },
                    {
                        "en": "The weak winter sunlight spread across the lake.",
                        "vi": "Ánh nắng mùa đông yếu ớt trải khắp mặt hồ."
                    }
                ]
            },
            {
                "define": {
                    "en": "not good at something",
                    "vi": "không giỏi một cái gì đó"
                },
                "examples": [
                    {
                        "en": "a weak team",
                        "vi": "một đội yếu"
                    },
                    {
                        "en": "weak in something I was always weak in the science subjects.",
                        "vi": "yếu trong một điều gì đó Tôi luôn luôn yếu trong các môn khoa học."
                    }
                ]
            },
            {
                "define": {
                    "en": "that people are not likely to believe or be persuaded by",
                    "vi": "mà mọi người không có khả năng tin hoặc bị thuyết phục bởi"
                },
                "examples": [
                    {
                        "en": "weak arguments/evidence",
                        "vi": "lập luận / bằng chứng yếu"
                    },
                    {
                        "en": "I enjoyed the movie but I thought the ending was very weak.",
                        "vi": "Tôi rất thích bộ phim nhưng tôi nghĩ phần kết rất yếu."
                    }
                ]
            },
            {
                "define": {
                    "en": "done without enthusiasm or energy",
                    "vi": "thực hiện mà không cần nhiệt tình hoặc năng lượng"
                },
                "examples": [
                    {
                        "en": "a weak smile",
                        "vi": "một nụ cười yếu ớt"
                    },
                    {
                        "en": "He made a weak attempt to look cheerful.",
                        "vi": "Anh ấy đã cố gắng yếu ớt để trông vui vẻ."
                    }
                ]
            },
            {
                "define": {
                    "en": "the part of a person’s character, an argument, etc. that is easy to attack or criticize",
                    "vi": "phần tính cách của một người, lập luận, v.v. dễ bị công kích hoặc chỉ trích"
                },
                "examples": [
                    {
                        "en": "The team's weak points are in defence.",
                        "vi": "Điểm yếu của đội là ở hàng thủ."
                    },
                    {
                        "en": "He knew her weak spot where Steve was concerned.",
                        "vi": "Anh biết điểm yếu của cô là nơi Steve quan tâm."
                    }
                ]
            },
            {
                "define": {
                    "en": "a weak verb forms the past tense and past participle by adding a regular ending and not by changing a vowel. In English this is done by adding -d, -ed or -t (for example walk, walked).",
                    "vi": "một động từ yếu tạo thành thì quá khứ và phân từ bằng cách thêm đuôi thông thường chứ không phải bằng cách thay đổi nguyên âm. Trong tiếng Anh, điều này được thực hiện bằng cách thêm -d, -ed hoặc -t (ví dụ: đi bộ, đi bộ)."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used when there is no stress on the word. For example, the weak form of and is /ən/ or /n/, as in fish and chips /fɪʃ ən tʃɪps/.",
                    "vi": "được sử dụng khi không có trọng âm trên từ. Ví dụ, dạng yếu của và là / ən / hoặc / n /, như trong fish and chips / fɪʃ ən tʃɪps /."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "you intend to do good things but you are too lazy, weak or busy to actually do them",
                    "vi": "bạn có ý định làm những điều tốt nhưng bạn quá lười biếng, yếu đuối hoặc bận rộn để thực sự làm chúng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "hardly able to stand because of emotion, fear, illness, etc.",
                    "vi": "hầu như không thể đứng vững vì xúc động, sợ hãi, bệnh tật, v.v."
                },
                "examples": [
                    {
                        "en": "His sudden smile made her go weak at the knees.",
                        "vi": "Nụ cười bất ngờ của anh khiến cô yếu mềm hai đầu gối."
                    }
                ]
            },
            {
                "define": {
                    "en": "the point at which a system or an organization is most likely to fail",
                    "vi": "thời điểm mà một hệ thống hoặc một tổ chức có nhiều khả năng bị thất bại nhất"
                },
                "examples": [
                    {
                        "en": "She went straight for the one weak link in the chain of his argument.",
                        "vi": "Cô đã đi thẳng đến một mắt xích yếu trong chuỗi tranh luận của anh ta."
                    }
                ]
            }
        ]
    },
    {
        "id": "1a9b7501691241689d3491aea6d8453d",
        "word": "write-off",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈraɪt ɒf/",
            "us": "/ˈraɪt ɔːf/"
        },
        "nearby": [
            {
                "word": "write into",
                "pos": "phrasal verb"
            },
            {
                "word": "write off",
                "pos": "phrasal verb"
            },
            {
                "word": "write-off",
                "pos": "noun"
            },
            {
                "word": "write out",
                "pos": "phrasal verb"
            },
            {
                "word": "write-protect",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a vehicle that has been so badly damaged in an accident that cannot be repaired or would cost more to repair than to replace",
                    "vi": "một chiếc xe bị hư hỏng nặng trong một vụ tai nạn mà không thể sửa chữa được hoặc sẽ tốn nhiều chi phí sửa chữa hơn là thay thế"
                },
                "examples": [
                    {
                        "en": "She survived the crash with minor injuries, but the car was a write-off.",
                        "vi": "Cô ấy sống sót sau vụ va chạm với những vết thương nhẹ, nhưng chiếc xe đã bị xóa sổ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a period of time during which you do not achieve anything",
                    "vi": "một khoảng thời gian mà bạn không đạt được bất cứ điều gì"
                },
                "examples": [
                    {
                        "en": "With meetings and phone calls, yesterday was a complete write-off.",
                        "vi": "Với các cuộc họp và các cuộc điện thoại, ngày hôm qua là một ngày hoàn toàn xóa sổ."
                    }
                ]
            },
            {
                "define": {
                    "en": "an act of cancelling a debt and accepting that it will never be paid",
                    "vi": "một hành động hủy bỏ một khoản nợ và chấp nhận rằng nó sẽ không bao giờ được trả"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "53fa282f32c74ff7a4e1f2be391a3d4a",
        "word": "Z-list",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈzed lɪst/",
            "us": "/ˈziː lɪst/"
        },
        "nearby": [
            {
                "word": "zit",
                "pos": "noun"
            },
            {
                "word": "zither",
                "pos": "noun"
            },
            {
                "word": "Z-list",
                "pos": "adjective"
            },
            {
                "word": "Z-lister",
                "pos": "noun"
            },
            {
                "word": "zodiac",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "used to describe the group of people who are considered to be the least famous, successful or important, especially in entertainment",
                    "vi": "được sử dụng để mô tả nhóm người được coi là kém nổi tiếng nhất, thành công hoặc quan trọng nhất, đặc biệt là trong lĩnh vực giải trí"
                },
                "examples": [
                    {
                        "en": "There are too many reality shows featuring Z-list celebrities.",
                        "vi": "Có quá nhiều chương trình thực tế có sự góp mặt của những người nổi tiếng trong danh sách Z."
                    }
                ]
            }
        ]
    },
    {
        "id": "b835c20e2dc84b13b69979d0f83da2a8",
        "word": "Z-lister",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈzed lɪstə(r)/",
            "us": "/ˈziː lɪstər/"
        },
        "nearby": [
            {
                "word": "zither",
                "pos": "noun"
            },
            {
                "word": "Z-list",
                "pos": "adjective"
            },
            {
                "word": "Z-lister",
                "pos": "noun"
            },
            {
                "word": "zodiac",
                "pos": "noun"
            },
            {
                "word": "zodiacal",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "one of a group of people who are considered to be the least famous, successful or important, especially in entertainment",
                    "vi": "một trong số những người được coi là kém nổi tiếng, thành công hoặc quan trọng nhất, đặc biệt là trong lĩnh vực giải trí"
                },
                "examples": []
            }
        ]
    }
]