[
    {
        "id": "48319f39d3804e0a8168d3741a4ceb61",
        "word": "natural disaster",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˌnætʃrəl dɪˈzɑːstə(r)/",
            "us": "/ˌnætʃrəl dɪˈzæstər/"
        },
        "nearby": [
            {
                "word": "natural-born",
                "pos": "adjective"
            },
            {
                "word": "natural childbirth",
                "pos": "noun"
            },
            {
                "word": "natural disaster",
                "pos": "noun"
            },
            {
                "word": "Natural England",
                "pos": ""
            },
            {
                "word": "natural gas",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a sudden and violent event in nature (such as an earthquake, hurricane or flood) that kills or injures a lot of people or causes a lot of damage",
                    "vi": "một sự kiện đột ngột và bạo lực trong tự nhiên (chẳng hạn như động đất, bão hoặc lũ lụt) làm chết hoặc bị thương nhiều người hoặc gây ra nhiều thiệt hại"
                },
                "examples": [
                    {
                        "en": "Emergency treatment of drinking water may be necessary following natural disasters.",
                        "vi": "Xử lý khẩn cấp nước uống có thể cần thiết sau các thảm họa thiên nhiên."
                    },
                    {
                        "en": "This is an unprecedented natural disaster.",
                        "vi": "Đây là một thảm họa thiên nhiên chưa từng có."
                    },
                    {
                        "en": "Hurricane Katrina was the costliest natural disaster in history.",
                        "vi": "Bão Katrina là thảm họa thiên nhiên tốn kém nhất trong lịch sử."
                    },
                    {
                        "en": "earthquakes, floods and other natural disasters",
                        "vi": "động đất, lũ lụt và các thảm họa thiên nhiên khác"
                    },
                    {
                        "en": "They will not insure you against a natural disaster.",
                        "vi": "Họ sẽ không bảo đảm cho bạn trước một thảm họa thiên nhiên."
                    }
                ]
            }
        ]
    },
    {
        "id": "5cd024e7fd5a43d6add16cdccfc38c16",
        "word": "storm",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/stɔːm/",
            "us": "/stɔːrm/"
        },
        "nearby": [
            {
                "word": "stork",
                "pos": "noun"
            },
            {
                "word": "Stork",
                "pos": "noun"
            },
            {
                "word": "storm",
                "pos": "noun"
            },
            {
                "word": "storm",
                "pos": "verb"
            },
            {
                "word": "storm cloud",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "very bad weather with strong winds and rain, and often thunder and lightning",
                    "vi": "thời tiết rất xấu với gió mạnh và mưa, và thường xuyên có sấm sét"
                },
                "examples": [
                    {
                        "en": "fierce/heavy/severe/violent storms",
                        "vi": "bão dữ dội / nặng / nghiêm trọng / dữ dội"
                    },
                    {
                        "en": "Winter storms swept the coasts.",
                        "vi": "Những cơn bão mùa đông quét qua các bờ biển."
                    },
                    {
                        "en": "Her home was hit by two tropical storms.",
                        "vi": "Nhà của cô đã bị hai cơn bão nhiệt đới đổ bộ."
                    },
                    {
                        "en": "A few minutes later the storm broke (= began).",
                        "vi": "Vài phút sau bão tan (= bắt đầu)."
                    },
                    {
                        "en": "I think we're in for a storm (= going to have one).",
                        "vi": "Tôi nghĩ chúng ta đang có một cơn bão (= sắp có một cơn bão)."
                    },
                    {
                        "en": "Off on the horizon, dark grey storm clouds gathered.",
                        "vi": "Ngoài đường chân trời, những đám mây bão màu xám đen tụ tập."
                    },
                    {
                        "en": "Insurance companies face hefty payouts for storm damage.",
                        "vi": "Các công ty bảo hiểm phải đối mặt với những khoản chi quá lớn cho thiệt hại do bão."
                    }
                ]
            },
            {
                "define": {
                    "en": "very bad weather of the type mentioned",
                    "vi": "thời tiết rất xấu của loại được đề cập"
                },
                "examples": [
                    {
                        "en": "She had to brave an ice storm to get to the interview.",
                        "vi": "Cô đã phải vượt qua một cơn bão băng để đến được buổi phỏng vấn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a situation in which a lot of people suddenly express very strong feelings about something",
                    "vi": "một tình huống trong đó nhiều người đột nhiên bày tỏ cảm xúc rất mạnh về điều gì đó"
                },
                "examples": [
                    {
                        "en": "His comments created a storm of protest in the media.",
                        "vi": "Bình luận của anh đã tạo nên một cơn bão phản đối trên các phương tiện truyền thông."
                    },
                    {
                        "en": "A political storm is brewing over the prime minister's comments.",
                        "vi": "Một cơn bão chính trị đang bùng phát về những bình luận của thủ tướng."
                    },
                    {
                        "en": "The footballer has been at the centre of a media storm after remarks he made on the radio caused controversy.",
                        "vi": "Cầu thủ bóng đá này đã trở thành tâm điểm của một cơn bão truyền thông sau khi những phát biểu mà anh ấy đưa ra trên đài phát thanh gây ra tranh cãi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a sudden loud noise that is caused by emotion or excitement",
                    "vi": "một tiếng ồn lớn đột ngột gây ra bởi cảm xúc hoặc sự phấn khích"
                },
                "examples": [
                    {
                        "en": "a storm of applause",
                        "vi": "một cơn bão vỗ tay"
                    }
                ]
            },
            {
                "define": {
                    "en": "if you are in great trouble, you take any help that is offered",
                    "vi": "nếu bạn đang gặp khó khăn lớn, bạn thực hiện bất kỳ sự trợ giúp nào được cung cấp"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a calm time immediately before an expected period of violent activity or argument",
                    "vi": "một khoảng thời gian yên tĩnh ngay lập tức trước một khoảng thời gian dự kiến có hoạt động bạo lực hoặc tranh cãi"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to do something with great energy and enthusiasm",
                    "vi": "để làm điều gì đó với năng lượng và sự nhiệt tình"
                },
                "examples": [
                    {
                        "en": "Leonie was in the kitchen, cooking up a storm for her friends.",
                        "vi": "Leonie đang ở trong bếp, nấu một món ăn cho bạn bè của cô ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "a lot of anger or worry about something that is not important",
                    "vi": "rất nhiều tức giận hoặc lo lắng về điều gì đó không quan trọng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be extremely successful very quickly in a particular place or among particular people",
                    "vi": "cực kỳ thành công rất nhanh chóng ở một nơi cụ thể hoặc giữa những người cụ thể"
                },
                "examples": [
                    {
                        "en": "The play took London by storm.",
                        "vi": "Vở kịch đã gây bão London."
                    }
                ]
            },
            {
                "define": {
                    "en": "to attack a place suddenly and capture it",
                    "vi": "tấn công một nơi bất ngờ và chiếm lấy nó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "d54b7ac97897475eb8157504ab94557a",
        "word": "disaster area",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/dɪˈzɑːstər eəriə/",
            "us": "/dɪˈzæstər eriə/"
        },
        "nearby": [
            {
                "word": "disassociate",
                "pos": "verb"
            },
            {
                "word": "disaster",
                "pos": "noun"
            },
            {
                "word": "disaster area",
                "pos": "noun"
            },
            {
                "word": "disastrous",
                "pos": "adjective"
            },
            {
                "word": "disastrously",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a place where a disaster has happened and that needs special help",
                    "vi": "nơi đã xảy ra thảm họa và cần được giúp đỡ đặc biệt"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a place or situation that has a lot of problems, is a failure, or is badly organized",
                    "vi": "một địa điểm hoặc tình huống có nhiều vấn đề, thất bại hoặc được tổ chức tồi"
                },
                "examples": [
                    {
                        "en": "Housing is another disaster area for the government.",
                        "vi": "Nhà ở là một khu vực thiên tai khác đối với chính phủ."
                    },
                    {
                        "en": "His office was a disaster area with papers piled everywhere.",
                        "vi": "Văn phòng của ông là một khu vực thảm họa với giấy tờ chất đống khắp nơi."
                    }
                ]
            }
        ]
    },
    {
        "id": "6029b75eaf4c46e88ca9adfbf4cf4870",
        "word": "earthquake",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈɜːθkweɪk/",
            "us": "/ˈɜːrθkweɪk/"
        },
        "nearby": [
            {
                "word": "earth mother",
                "pos": "noun"
            },
            {
                "word": "earth mover",
                "pos": "noun"
            },
            {
                "word": "earthquake",
                "pos": "noun"
            },
            {
                "word": "earth science",
                "pos": "noun"
            },
            {
                "word": "earth scientist",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a sudden, violent shaking of the earth’s surface",
                    "vi": "bề mặt trái đất rung chuyển đột ngột, dữ dội"
                },
                "examples": [
                    {
                        "en": "a devastating/massive/powerful earthquake",
                        "vi": "một trận động đất kinh hoàng / lớn / mạnh"
                    },
                    {
                        "en": "The earthquake measured 68 on the Richter scale.",
                        "vi": "Trận động đất đo được 68 độ Richter."
                    },
                    {
                        "en": "I was asleep when the earthquake struck.",
                        "vi": "Tôi đang ngủ khi trận động đất xảy ra."
                    },
                    {
                        "en": "in a/the earthquake Much of the town was destroyed in the earthquake.",
                        "vi": "trong a / trận động đất Phần lớn thị trấn đã bị phá hủy trong trận động đất."
                    },
                    {
                        "en": "earthquake victims/survivors",
                        "vi": "nạn nhân / người sống sót sau trận động đất"
                    }
                ]
            }
        ]
    },
    {
        "id": "94178a319228415983d426f87a33c375",
        "word": "flood",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/flʌd/",
            "us": "/flʌd/"
        },
        "nearby": [
            {
                "word": "flogging",
                "pos": "noun"
            },
            {
                "word": "Flo-Jo",
                "pos": ""
            },
            {
                "word": "flood",
                "pos": "noun"
            },
            {
                "word": "flood",
                "pos": "verb"
            },
            {
                "word": "flooded",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a large amount of water covering an area that is usually dry",
                    "vi": "một lượng lớn nước bao phủ một khu vực thường khô"
                },
                "examples": [
                    {
                        "en": "The heavy rain has caused floods in many parts of the country.",
                        "vi": "Trận mưa lớn đã gây ra lũ lụt ở nhiều nơi trên cả nước."
                    },
                    {
                        "en": "There have been delays to filming as a result of the floods.",
                        "vi": "Đã có sự chậm trễ trong việc quay phim do hậu quả của lũ lụt."
                    },
                    {
                        "en": "Police have issued flood warnings for Nevada.",
                        "vi": "Cảnh sát đã đưa ra cảnh báo lũ lụt cho Nevada."
                    },
                    {
                        "en": "Much had been done in recent years to improve flood defences.",
                        "vi": "Nhiều việc đã được thực hiện trong những năm gần đây để cải thiện khả năng phòng chống lũ lụt."
                    },
                    {
                        "en": "The insurance does not cover flood damage to gates, hedges or fences.",
                        "vi": "Bảo hiểm không bao gồm thiệt hại do lũ lụt đối với cổng, hàng rào hoặc hàng rào."
                    },
                    {
                        "en": "an appeal to help flood victims",
                        "vi": "lời kêu gọi giúp đỡ đồng bào lũ lụt"
                    },
                    {
                        "en": "the Thames flood barrier",
                        "vi": "hàng rào chắn lũ sông Thames"
                    },
                    {
                        "en": "in flood The river is in flood (= has more water in it than normal and has caused a flood).",
                        "vi": "trong lũ lụt Con sông đang bị lũ lụt (= có nhiều nước hơn bình thường và đã gây ra lũ lụt)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a very large number of things or people that appear at the same time",
                    "vi": "một số lượng rất lớn những thứ hoặc những người xuất hiện cùng một lúc"
                },
                "examples": [
                    {
                        "en": "a flood of complaints",
                        "vi": "một lũ phàn nàn"
                    },
                    {
                        "en": "We are unable to compete with a flood of cheap food imports.",
                        "vi": "Chúng ta không thể cạnh tranh với một lượng lớn thực phẩm nhập khẩu giá rẻ."
                    },
                    {
                        "en": "The child was in floods of tears (= crying a lot).",
                        "vi": "Đứa trẻ đẫm nước mắt (= khóc rất nhiều)."
                    },
                    {
                        "en": "New spam-blocking software should help stem (= stop) the flood.",
                        "vi": "Phần mềm chặn thư rác mới sẽ giúp ngăn chặn (= ngăn chặn) lũ lụt."
                    }
                ]
            },
            {
                "define": {
                    "en": "the great flood that covered the world in the Bible story",
                    "vi": "trận lụt lớn bao trùm thế giới trong câu chuyện Kinh thánh"
                },
                "examples": [
                    {
                        "en": "before the Flood (= a very long time ago)",
                        "vi": "trước trận lụt (= cách đây rất lâu)"
                    }
                ]
            }
        ]
    },
    {
        "id": "8951caf22c474b9081efdc4852010fc1",
        "word": "hurricane",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈhʌrɪkən/",
            "us": "/ˈhɜːrəkeɪn/"
        },
        "nearby": [
            {
                "word": "Lake Huron",
                "pos": ""
            },
            {
                "word": "hurrah",
                "pos": "exclamation"
            },
            {
                "word": "hurricane",
                "pos": "noun"
            },
            {
                "word": "hurricane lamp",
                "pos": "noun"
            },
            {
                "word": "hurried",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a violent storm with very strong winds, especially in the western Atlantic Ocean",
                    "vi": "một cơn bão dữ dội với gió rất mạnh, đặc biệt là ở phía tây Đại Tây Dương"
                },
                "examples": [
                    {
                        "en": "A powerful hurricane hit the Florida coast.",
                        "vi": "Một cơn bão mạnh đã đổ bộ vào bờ biển Florida."
                    },
                    {
                        "en": "Hurricane Sandy devastated the area.",
                        "vi": "Bão Sandy đã tàn phá khu vực này."
                    },
                    {
                        "en": "The hurricane season does not end until November.",
                        "vi": "Mùa bão không kết thúc cho đến tháng mười một."
                    },
                    {
                        "en": "hurricane victims",
                        "vi": "nạn nhân bão"
                    },
                    {
                        "en": "hurricane-force winds",
                        "vi": "gió bão mạnh"
                    },
                    {
                        "en": "The proceeds will go to hurricane relief.",
                        "vi": "Số tiền thu được sẽ dùng để cứu trợ bão."
                    }
                ]
            }
        ]
    },
    {
        "id": "0ca63e7d54bd4f5fbbd375ccfd7876e7",
        "word": "sandstorm",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈsændstɔːm/",
            "us": "/ˈsændstɔːrm/"
        },
        "nearby": [
            {
                "word": "sandshoe",
                "pos": "noun"
            },
            {
                "word": "sandstone",
                "pos": "noun"
            },
            {
                "word": "sandstorm",
                "pos": "noun"
            },
            {
                "word": "sand trap",
                "pos": "noun"
            },
            {
                "word": "sand wedge",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a storm in a desert in which sand is blown into the air by strong winds",
                    "vi": "một cơn bão trên sa mạc trong đó cát bị gió mạnh thổi vào không khí"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "9b5984808fc448609c272f58b4906536",
        "word": "tornado",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/tɔːˈneɪdəʊ/",
            "us": "/tɔːrˈneɪdəʊ/"
        },
        "nearby": [
            {
                "word": "tormentor",
                "pos": "noun"
            },
            {
                "word": "torn",
                "pos": "verb"
            },
            {
                "word": "tornado",
                "pos": "noun"
            },
            {
                "word": "Tornado",
                "pos": "noun"
            },
            {
                "word": "Toronto",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a violent storm with very strong winds that move in a circle. There is often also a long cloud that is narrower at the bottom than the top.",
                    "vi": "một cơn bão dữ dội với gió rất mạnh di chuyển theo hình tròn. Cũng thường có một đám mây dài hẹp hơn ở phía dưới so với phía trên."
                },
                "examples": [
                    {
                        "en": "Tornadoes ripped into the southern United States yesterday.",
                        "vi": "Lốc xoáy đã xé toạc miền nam nước Mỹ ngày hôm qua."
                    },
                    {
                        "en": "She burst in to the room like a tornado.",
                        "vi": "Cô lao vào phòng như một cơn lốc xoáy."
                    }
                ]
            }
        ]
    },
    {
        "id": "e989c91cbc454cb5b424642078c4219e",
        "word": "volcano",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/vɒlˈkeɪnəʊ/",
            "us": "/vɑːlˈkeɪnəʊ/"
        },
        "nearby": [
            {
                "word": "vol-au-vent",
                "pos": "noun"
            },
            {
                "word": "volcanic",
                "pos": "adjective"
            },
            {
                "word": "volcano",
                "pos": "noun"
            },
            {
                "word": "volcanology",
                "pos": "noun"
            },
            {
                "word": "vole",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a mountain with a large opening at the top through which gases and lava (= hot liquid rock) are forced out into the air, or have been in the past",
                    "vi": "một ngọn núi với một lỗ lớn ở trên cùng mà qua đó khí và dung nham (= đá lỏng nóng) bị đẩy ra ngoài không khí, hoặc đã từng ở trong quá khứ"
                },
                "examples": [
                    {
                        "en": "An active volcano may erupt at any time.",
                        "vi": "Một ngọn núi lửa đang hoạt động có thể phun trào bất cứ lúc nào."
                    },
                    {
                        "en": "a dormant volcano (= one that is not active at present)",
                        "vi": "một ngọn núi lửa không hoạt động (= một ngọn núi lửa hiện không hoạt động)"
                    },
                    {
                        "en": "an extinct volcano (= one that is no longer active)",
                        "vi": "một ngọn núi lửa đã tắt (= một ngọn núi lửa không còn hoạt động)"
                    },
                    {
                        "en": "a volcano spewing red hot lava",
                        "vi": "một ngọn núi lửa phun ra dung nham nóng đỏ"
                    }
                ]
            }
        ]
    },
    {
        "id": "82497945e63f46759bced1a2e8056176",
        "word": "windstorm",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈwɪndstɔːm/",
            "us": "/ˈwɪndstɔːrm/"
        },
        "nearby": [
            {
                "word": "Windsor Castle",
                "pos": ""
            },
            {
                "word": "Windsor knot",
                "pos": "noun"
            },
            {
                "word": "windstorm",
                "pos": "noun"
            },
            {
                "word": "windsurf",
                "pos": "verb"
            },
            {
                "word": "windsurfer",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a storm where there is very strong wind but little rain or snow",
                    "vi": "một cơn bão có gió rất mạnh nhưng ít mưa hoặc tuyết"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "6360d5b3f7a94d5d8a7d9045f20acf4b",
        "word": "aid",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/eɪd/",
            "us": "/eɪd/"
        },
        "nearby": [
            {
                "word": "ahoy",
                "pos": "exclamation"
            },
            {
                "word": "AI",
                "pos": "abbreviation"
            },
            {
                "word": "aid",
                "pos": "noun"
            },
            {
                "word": "aid",
                "pos": "verb"
            },
            {
                "word": "Aidan",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "money, food, etc. that is sent to help countries in difficult situations",
                    "vi": "tiền, thực phẩm, v.v. được gửi để giúp đỡ các quốc gia có hoàn cảnh khó khăn"
                },
                "examples": [
                    {
                        "en": "humanitarian/food/medical aid",
                        "vi": "viện trợ nhân đạo / thực phẩm / y tế"
                    },
                    {
                        "en": "An extra £10 million in foreign aid has been provided for victims of the earthquake.",
                        "vi": "Thêm 10 triệu bảng viện trợ nước ngoài đã được cung cấp cho các nạn nhân của trận động đất."
                    },
                    {
                        "en": "international aid workers",
                        "vi": "nhân viên cứu trợ quốc tế"
                    }
                ]
            },
            {
                "define": {
                    "en": "help that you need, especially to perform a particular task",
                    "vi": "trợ giúp mà bạn cần, đặc biệt là để thực hiện một nhiệm vụ cụ thể"
                },
                "examples": [
                    {
                        "en": "with the aid of somebody/something She walks with the aid of a stick.",
                        "vi": "với sự trợ giúp của ai đó / cái gì đó Cô ấy bước đi với sự trợ giúp của một cây gậy."
                    },
                    {
                        "en": "without the aid of somebody/something This job would be impossible without the aid of a computer.",
                        "vi": "Nếu không có sự trợ giúp của ai đó / cái gì đó Công việc này sẽ không thể thực hiện được nếu không có sự hỗ trợ của máy tính."
                    },
                    {
                        "en": "(formal) One of the staff saw he was in difficulty and came to his aid (= helped him).",
                        "vi": "(trang trọng) Một trong những nhân viên thấy anh ấy đang gặp khó khăn và đã đến giúp đỡ anh ấy (= đã giúp anh ấy)."
                    }
                ]
            },
            {
                "define": {
                    "en": "an object, a machine, etc. that you use to help you do something",
                    "vi": "một đối tượng, một máy móc, v.v. mà bạn sử dụng để giúp bạn làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "Photos make useful teaching aids.",
                        "vi": "Hình ảnh làm đồ dùng dạy học hữu ích."
                    }
                ]
            },
            {
                "define": {
                    "en": "in order to help something/somebody",
                    "vi": "để giúp một cái gì đó / ai đó"
                },
                "examples": [
                    {
                        "en": "collecting money in aid of charity",
                        "vi": "thu tiền ủng hộ từ thiện"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to ask why something is happening",
                    "vi": "được sử dụng để hỏi tại sao một cái gì đó đang xảy ra"
                },
                "examples": [
                    {
                        "en": "What's all this crying in aid of?",
                        "vi": "Tất cả những gì đang khóc để hỗ trợ?"
                    }
                ]
            }
        ]
    },
    {
        "id": "68d0f22c279f4918b1abf659760cc66f",
        "word": "avalanche",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈævəlɑːnʃ/",
            "us": "/ˈævəlæntʃ/"
        },
        "nearby": [
            {
                "word": "available",
                "pos": "adjective"
            },
            {
                "word": "avail yourself of",
                "pos": "phrasal verb"
            },
            {
                "word": "avalanche",
                "pos": "noun"
            },
            {
                "word": "Avalon",
                "pos": ""
            },
            {
                "word": "avant-",
                "pos": "combining form"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a mass of snow, ice and rock that falls down the side of a mountain",
                    "vi": "một khối tuyết, băng và đá rơi xuống sườn núi"
                },
                "examples": [
                    {
                        "en": "alpine villages destroyed in an avalanche",
                        "vi": "những ngôi làng trên núi cao bị phá hủy trong một trận tuyết lở"
                    },
                    {
                        "en": "He was killed in an avalanche while skiing.",
                        "vi": "Anh ta đã bị giết trong một trận tuyết lở khi đang trượt tuyết."
                    },
                    {
                        "en": "(figurative) We received an avalanche of letters in reply to our advertisement.",
                        "vi": "(nghĩa bóng) Chúng tôi đã nhận được một loạt các bức thư trả lời quảng cáo của chúng tôi."
                    }
                ]
            }
        ]
    },
    {
        "id": "a5bb14ca68b547ea9a4251ed67488d96",
        "word": "blizzard",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈblɪzəd/",
            "us": "/ˈblɪzərd/"
        },
        "nearby": [
            {
                "word": "blitzed",
                "pos": "adjective"
            },
            {
                "word": "blitzkrieg",
                "pos": "noun"
            },
            {
                "word": "blizzard",
                "pos": "noun"
            },
            {
                "word": "bloat",
                "pos": "verb"
            },
            {
                "word": "bloated",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a snowstorm with very strong winds",
                    "vi": "bão tuyết với gió rất mạnh"
                },
                "examples": [
                    {
                        "en": "blizzard conditions",
                        "vi": "điều kiện bão tuyết"
                    },
                    {
                        "en": "The blizzard struck the north-east yesterday, causing serious damage.",
                        "vi": "Trận bão tuyết đã tấn công vào phía đông bắc ngày hôm qua, gây ra thiệt hại nghiêm trọng."
                    },
                    {
                        "en": "a raging/howling blizzard",
                        "vi": "một trận bão tuyết hoành hành / hú hét"
                    }
                ]
            },
            {
                "define": {
                    "en": "a large quantity of things that may seem to be attacking you",
                    "vi": "một số lượng lớn những thứ dường như đang tấn công bạn"
                },
                "examples": [
                    {
                        "en": "a blizzard of documents",
                        "vi": "một trận bão tuyết"
                    }
                ]
            }
        ]
    },
    {
        "id": "3a585966f8304c668a90a67e5facd84d",
        "word": "drought",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/draʊt/",
            "us": "/draʊt/"
        },
        "nearby": [
            {
                "word": "drosophila",
                "pos": "noun"
            },
            {
                "word": "dross",
                "pos": "noun"
            },
            {
                "word": "drought",
                "pos": "noun"
            },
            {
                "word": "drove",
                "pos": "noun"
            },
            {
                "word": "drove",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a long period of time when there is little or no rain",
                    "vi": "một khoảng thời gian dài khi có ít hoặc không có mưa"
                },
                "examples": [
                    {
                        "en": "Farmers are facing ruin after two years of severe drought.",
                        "vi": "Nông dân đang phải đối mặt với cảnh điêu tàn sau hai năm hạn hán nghiêm trọng."
                    },
                    {
                        "en": "one of the worst droughts on record",
                        "vi": "một trong những trận hạn hán tồi tệ nhất được ghi nhận"
                    },
                    {
                        "en": "The country’s entire grain harvest has been hit by drought.",
                        "vi": "Toàn bộ vụ thu hoạch ngũ cốc của đất nước đã bị ảnh hưởng bởi hạn hán."
                    }
                ]
            },
            {
                "define": {
                    "en": "a long period of time when there is a lack of something that is needed or wanted",
                    "vi": "một khoảng thời gian dài khi thiếu một thứ gì đó cần thiết hoặc mong muốn"
                },
                "examples": [
                    {
                        "en": "The team is desperate to end a ten-game goal drought.",
                        "vi": "Đội đang tuyệt vọng để chấm dứt cơn hạn hán bàn thắng kéo dài mười trận."
                    }
                ]
            }
        ]
    },
    {
        "id": "60acd23240174d11b5f3290da30a0a57",
        "word": "dust storm",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈdʌst stɔːm/",
            "us": "/ˈdʌst stɔːrm/"
        },
        "nearby": [
            {
                "word": "dustpan",
                "pos": "noun"
            },
            {
                "word": "dust sheet",
                "pos": "noun"
            },
            {
                "word": "dust storm",
                "pos": "noun"
            },
            {
                "word": "dust-up",
                "pos": "noun"
            },
            {
                "word": "dusty",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a storm that carries clouds of dust in the wind over a wide area",
                    "vi": "một cơn bão mang theo những đám mây bụi trong gió trên một khu vực rộng lớn"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "e47504856fd545dcaf3324685c5e4cbe",
        "word": "emergency services",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ɪˈmɜːdʒənsi sɜːvɪsɪz/",
            "us": "/ɪˈmɜːrdʒənsi sɜːrvɪsɪz/"
        },
        "nearby": [
            {
                "word": "emergency brake",
                "pos": "noun"
            },
            {
                "word": "emergency room",
                "pos": "noun"
            },
            {
                "word": "emergency services",
                "pos": "noun"
            },
            {
                "word": "emergent",
                "pos": "adjective"
            },
            {
                "word": "emerging",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the public organizations that deal with emergencies: the police, fire, ambulance and coastguard services",
                    "vi": "các tổ chức công đối phó với các trường hợp khẩn cấp: cảnh sát, cứu hỏa, cứu thương và dịch vụ tuần duyên"
                },
                "examples": [
                    {
                        "en": "The emergency services are struggling to cope with the number of call-outs.",
                        "vi": "Các dịch vụ khẩn cấp đang phải vật lộn để đối phó với số lượng cuộc gọi đến."
                    }
                ]
            }
        ]
    },
    {
        "id": "09784830c1294fa3b04a893e88fa335c",
        "word": "erupt",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/ɪˈrʌpt/",
            "us": "/ɪˈrʌpt/"
        },
        "nearby": [
            {
                "word": "erudite",
                "pos": "adjective"
            },
            {
                "word": "erudition",
                "pos": "noun"
            },
            {
                "word": "erupt",
                "pos": "verb"
            },
            {
                "word": "eruption",
                "pos": "noun"
            },
            {
                "word": "eruptive",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "when a volcano erupts or burning rocks, smoke, etc. erupt or are erupted, the burning rocks, etc. are thrown out from the volcano",
                    "vi": "khi núi lửa phun trào hoặc đá cháy, khói, v.v. phun ra hoặc đang phun trào, đá cháy, v.v. bị văng ra khỏi núi lửa"
                },
                "examples": [
                    {
                        "en": "The volcano could erupt at any time.",
                        "vi": "Núi lửa có thể phun trào bất cứ lúc nào."
                    },
                    {
                        "en": "erupt from something Ash began to erupt from the crater.",
                        "vi": "phun ra từ thứ gì đó Ash bắt đầu phun ra từ miệng núi lửa."
                    },
                    {
                        "en": "erupt something An immense volume of rocks and molten lava was erupted.",
                        "vi": "một thứ gì đó phun trào Một khối lượng lớn đá và dung nham nóng chảy đã được phun ra."
                    }
                ]
            },
            {
                "define": {
                    "en": "to start happening, suddenly and violently",
                    "vi": "bắt đầu xảy ra, đột ngột và dữ dội"
                },
                "examples": [
                    {
                        "en": "Violence erupted outside the embassy gates.",
                        "vi": "Bạo lực nổ ra bên ngoài cổng các đại sứ quán."
                    },
                    {
                        "en": "erupt into something The unrest erupted into revolution.",
                        "vi": "nổ ra một cái gì đó Sự bất ổn bùng nổ thành cuộc cách mạng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to suddenly express your feelings very strongly, especially by shouting loudly",
                    "vi": "đột nhiên bộc lộ cảm xúc của bạn rất mạnh mẽ, đặc biệt là bằng cách hét to"
                },
                "examples": [
                    {
                        "en": "When Davis scored for the third time the crowd erupted.",
                        "vi": "Khi Davis ghi bàn lần thứ ba, đám đông nổ ra."
                    },
                    {
                        "en": "erupt in/into something My father just erupted into fury.",
                        "vi": "phun ra trong / vào một cái gì đó Cha tôi vừa bùng lên trong cơn thịnh nộ."
                    },
                    {
                        "en": "erupt with something The room erupted with laughter.",
                        "vi": "nổ ra với một cái gì đó Căn phòng bùng lên bởi tiếng cười."
                    },
                    {
                        "en": "+ speech ‘How dare you?’ she erupted.",
                        "vi": "Err:509"
                    }
                ]
            },
            {
                "define": {
                    "en": "to suddenly appear on your skin",
                    "vi": "đột nhiên xuất hiện trên da của bạn"
                },
                "examples": [
                    {
                        "en": "A rash had erupted all over his chest.",
                        "vi": "Một cơn phát ban đã bùng phát khắp ngực anh."
                    }
                ]
            }
        ]
    },
    {
        "id": "a7a70e1ce1354d58bfd91e92c1e90e5d",
        "word": "eruption",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ɪˈrʌpʃn/",
            "us": "/ɪˈrʌpʃn/"
        },
        "nearby": [
            {
                "word": "erudition",
                "pos": "noun"
            },
            {
                "word": "erupt",
                "pos": "verb"
            },
            {
                "word": "eruption",
                "pos": "noun"
            },
            {
                "word": "eruptive",
                "pos": "adjective"
            },
            {
                "word": "eruv",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an occasion when a volcano suddenly throws out burning rocks, smoke, etc.",
                    "vi": "một dịp khi núi lửa đột ngột ném ra đá cháy, khói, v.v."
                },
                "examples": [
                    {
                        "en": "a major volcanic eruption",
                        "vi": "một vụ phun trào núi lửa lớn"
                    }
                ]
            },
            {
                "define": {
                    "en": "an occasion when something starts happening, suddenly and violently",
                    "vi": "một dịp khi điều gì đó bắt đầu xảy ra, đột ngột và dữ dội"
                },
                "examples": [
                    {
                        "en": "an eruption of violent protest",
                        "vi": "một cuộc phản đối bạo lực bùng nổ"
                    }
                ]
            },
            {
                "define": {
                    "en": "a sudden expression of very strong feelings, especially by shouting loudly",
                    "vi": "một biểu hiện đột ngột của cảm xúc rất mạnh, đặc biệt là bằng cách hét lớn"
                },
                "examples": [
                    {
                        "en": "eruptions of explosive rage",
                        "vi": "sự bùng nổ của cơn thịnh nộ bùng nổ"
                    }
                ]
            },
            {
                "define": {
                    "en": "the sudden appearance of spots, etc. on your skin",
                    "vi": "sự xuất hiện đột ngột của các đốm, v.v. trên da của bạn"
                },
                "examples": [
                    {
                        "en": "skin rashes and eruptions",
                        "vi": "phát ban và phun trào da"
                    }
                ]
            }
        ]
    },
    {
        "id": "580b266f8a1c45ea9549f703898984a7",
        "word": "flooding",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈflʌdɪŋ/",
            "us": "/ˈflʌdɪŋ/"
        },
        "nearby": [
            {
                "word": "flooded",
                "pos": "adjective"
            },
            {
                "word": "floodgate",
                "pos": "noun"
            },
            {
                "word": "flooding",
                "pos": "noun"
            },
            {
                "word": "floodlight",
                "pos": "noun"
            },
            {
                "word": "floodlight",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "large amounts of water covering an area that is usually dry; the fact of this happening",
                    "vi": "một lượng lớn nước bao phủ một khu vực thường khô; thực tế là điều này đang xảy ra"
                },
                "examples": [
                    {
                        "en": "There will be heavy rain with flooding in some areas.",
                        "vi": "Sẽ có mưa to kèm theo ngập lụt ở một số khu vực."
                    },
                    {
                        "en": "to cause/prevent flooding",
                        "vi": "để gây ra / ngăn chặn lũ lụt"
                    },
                    {
                        "en": "severe/widespread flooding",
                        "vi": "lũ lụt nghiêm trọng / trên diện rộng"
                    }
                ]
            }
        ]
    },
    {
        "id": "047f084a7d994137a213dc50baf5548d",
        "word": "floodwater",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈflʌdwɔːtə(r)/",
            "us": "/ˈflʌdwɔːtər/"
        },
        "nearby": [
            {
                "word": "floodplain",
                "pos": "noun"
            },
            {
                "word": "flood tide",
                "pos": "noun"
            },
            {
                "word": "floodwater",
                "pos": "noun"
            },
            {
                "word": "floor",
                "pos": "noun"
            },
            {
                "word": "floor",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "water that covers land after there has been a flood",
                    "vi": "nước bao phủ đất sau khi có lũ lụt"
                },
                "examples": [
                    {
                        "en": "The floodwaters have now receded.",
                        "vi": "Hiện nước lũ đã rút."
                    },
                    {
                        "en": "The flood water had caused tremendous damage.",
                        "vi": "Nước lũ đã gây ra thiệt hại to lớn."
                    }
                ]
            }
        ]
    },
    {
        "id": "0f7232f8b65c4489aa55f481525227cc",
        "word": "landslide",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈlændslaɪd/",
            "us": "/ˈlændslaɪd/"
        },
        "nearby": [
            {
                "word": "Edwin Landseer",
                "pos": ""
            },
            {
                "word": "Land's End",
                "pos": ""
            },
            {
                "word": "landslide",
                "pos": "noun"
            },
            {
                "word": "landslip",
                "pos": "noun"
            },
            {
                "word": "land up at",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a mass of earth, rock, etc. that falls down the slope of a mountain or a cliff",
                    "vi": "một khối đất, đá, v.v. rơi xuống dốc núi hoặc vách đá"
                },
                "examples": [
                    {
                        "en": "The house was buried beneath a landslide.",
                        "vi": "Ngôi nhà bị chôn vùi dưới một trận lở đất."
                    }
                ]
            },
            {
                "define": {
                    "en": "an election in which one person or party gets very many more votes than the other people or parties",
                    "vi": "một cuộc bầu cử trong đó một người hoặc đảng nhận được rất nhiều phiếu bầu hơn những người hoặc đảng khác"
                },
                "examples": [
                    {
                        "en": "by a landslide She was expected to win by a landslide.",
                        "vi": "bởi một trận lở đất Cô ấy được kỳ vọng sẽ thắng bằng một trận lở đất."
                    },
                    {
                        "en": "No one expected a repeat of Labour's 1997 landslide victory.",
                        "vi": "Không ai mong đợi một chiến thắng vang dội năm 1997 của Labour lặp lại."
                    },
                    {
                        "en": "The National Party won by a landslide.",
                        "vi": "Đảng Quốc đại chiến thắng long trời lở đất."
                    }
                ]
            }
        ]
    },
    {
        "id": "bc134cde91a242c5baa453c31989488b",
        "word": "lava",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈlɑːvə/",
            "us": "/ˈlɑːvə/"
        },
        "nearby": [
            {
                "word": "Laurence",
                "pos": ""
            },
            {
                "word": "lav",
                "pos": "noun"
            },
            {
                "word": "lava",
                "pos": "noun"
            },
            {
                "word": "lavage",
                "pos": "noun"
            },
            {
                "word": "lava lamp",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "hot liquid rock that comes out of a volcano",
                    "vi": "đá lỏng nóng chảy ra từ núi lửa"
                },
                "examples": [
                    {
                        "en": "molten lava",
                        "vi": "dung nham nóng chảy"
                    }
                ]
            },
            {
                "define": {
                    "en": "this type of rock when it has cooled and become hard",
                    "vi": "loại đá này khi nó đã nguội và trở nên cứng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "6b6aaaef7df14e0595214c09f251cb94",
        "word": "relief",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/rɪˈliːf/",
            "us": "/rɪˈliːf/"
        },
        "nearby": [
            {
                "word": "reliant",
                "pos": "adjective"
            },
            {
                "word": "relic",
                "pos": "noun"
            },
            {
                "word": "relief",
                "pos": "noun"
            },
            {
                "word": "relief map",
                "pos": "noun"
            },
            {
                "word": "relief pitcher",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the feeling of happiness that you have when something unpleasant stops or does not happen",
                    "vi": "cảm giác hạnh phúc mà bạn có khi điều gì đó khó chịu dừng lại hoặc không xảy ra"
                },
                "examples": [
                    {
                        "en": "I felt a huge sense of relief when I heard they were all OK.",
                        "vi": "Tôi cảm thấy nhẹ nhõm vô cùng khi nghe tin rằng tất cả đều ổn."
                    },
                    {
                        "en": "We all breathed a sigh of relief when he left.",
                        "vi": "Tất cả chúng tôi đều thở phào nhẹ nhõm khi anh ấy ra đi."
                    },
                    {
                        "en": "Much to my relief the car was not damaged.",
                        "vi": "Tôi rất nhẹ nhõm khi chiếc xe không bị hư hại."
                    },
                    {
                        "en": "News of their safety came as a great relief.",
                        "vi": "Tin tức về sự an toàn của họ đến như một sự cứu trợ lớn."
                    },
                    {
                        "en": "She sighed with relief.",
                        "vi": "Cô thở phào nhẹ nhõm."
                    },
                    {
                        "en": "He smiled in relief as he saw them both.",
                        "vi": "Anh mỉm cười nhẹ nhõm khi nhìn thấy cả hai."
                    },
                    {
                        "en": "She had gone through hell and there was no relief in sight for her.",
                        "vi": "Cô ấy đã trải qua địa ngục và không có sự nhẹ nhõm nào cho cô ấy."
                    },
                    {
                        "en": "relief to somebody This was a great relief to him.",
                        "vi": "nhẹ nhõm cho ai đó Đây là một sự nhẹ nhõm tuyệt vời đối với anh ấy."
                    },
                    {
                        "en": "It was a relief to be able to talk to someone about it.",
                        "vi": "Thật nhẹ nhõm khi có thể nói chuyện với ai đó về điều đó."
                    },
                    {
                        "en": "It was a relief to her to realize that she was not the only one with this problem.",
                        "vi": "Cô cảm thấy nhẹ nhõm khi nhận ra rằng mình không phải là người duy nhất gặp vấn đề này."
                    },
                    {
                        "en": "relief that… His mother spoke of her relief that he was now safely home.",
                        "vi": "nhẹ nhõm rằng… Mẹ anh ấy nói về sự nhẹ nhõm của bà rằng giờ đây anh ấy đã về nhà an toàn."
                    },
                    {
                        "en": "It is actually a relief that it's finally happened.",
                        "vi": "Nó thực sự là một sự nhẹ nhõm khi nó cuối cùng đã xảy ra."
                    },
                    {
                        "en": "relief at something She expressed relief at the outcome of the investigation.",
                        "vi": "nhẹ nhõm về điều gì đó Cô ấy bày tỏ sự nhẹ nhõm trước kết quả của cuộc điều tra."
                    },
                    {
                        "en": "relief at doing something He described his relief at securing his freedom.",
                        "vi": "nhẹ nhõm khi làm điều gì đó."
                    },
                    {
                        "en": "What a relief!",
                        "vi": "Thật là nhẹ nhõm!"
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of removing or reducing pain, worry, etc.",
                    "vi": "hành động loại bỏ hoặc giảm bớt đau đớn, lo lắng, v.v."
                },
                "examples": [
                    {
                        "en": "modern methods of pain relief",
                        "vi": "phương pháp giảm đau hiện đại"
                    },
                    {
                        "en": "relief of something the relief of symptoms/suffering/poverty/pain",
                        "vi": "giảm nhẹ điều gì đó giảm các triệu chứng / đau khổ / nghèo đói / đau đớn"
                    },
                    {
                        "en": "relief from something The drugs only provided temporary relief from the pain.",
                        "vi": "Thuốc chỉ giúp giảm đau tạm thời."
                    },
                    {
                        "en": "All the tables in the shade were occupied by people seeking relief from the heat.",
                        "vi": "Tất cả các bàn trong bóng râm đều có người tìm cách giải tỏa cái nóng."
                    },
                    {
                        "en": "Massage can bring some relief from tension.",
                        "vi": "Mát-xa có thể giúp giảm căng thẳng."
                    }
                ]
            },
            {
                "define": {
                    "en": "food, money, medicine, etc. that is given to help people in places where there has been a war or natural disaster",
                    "vi": "thực phẩm, tiền bạc, thuốc men, v.v. được trao để giúp đỡ đồng bào ở những nơi đã xảy ra chiến tranh, thiên tai"
                },
                "examples": [
                    {
                        "en": "disaster relief",
                        "vi": "cứu trợ thiên tai"
                    },
                    {
                        "en": "relief efforts/operations",
                        "vi": "nỗ lực / hoạt động cứu trợ"
                    },
                    {
                        "en": "relief organizations/supplies/work",
                        "vi": "tổ chức cứu trợ / vật tư / công việc"
                    },
                    {
                        "en": "We raised £5 000 for famine relief.",
                        "vi": "Chúng tôi đã quyên góp được £ 5 000 để cứu trợ nạn đói."
                    },
                    {
                        "en": "One relief agency worker described the situation as ‘catastrophic’.",
                        "vi": "Một nhân viên của cơ quan cứu trợ mô tả tình hình là 'thảm khốc'."
                    }
                ]
            },
            {
                "define": {
                    "en": "financial help given by the government to people who need it",
                    "vi": "trợ giúp tài chính của chính phủ cho những người cần nó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a reduction in the amount of tax you have to pay",
                    "vi": "giảm số thuế bạn phải trả"
                },
                "examples": [
                    {
                        "en": "relief on mortgage interest payments",
                        "vi": "giảm nhẹ thanh toán lãi suất thế chấp"
                    }
                ]
            },
            {
                "define": {
                    "en": "something that is interesting or fun that replaces something boring, difficult or unpleasant for a short period of time",
                    "vi": "thứ gì đó thú vị hoặc vui vẻ thay thế thứ gì đó nhàm chán, khó khăn hoặc khó chịu trong một khoảng thời gian ngắn"
                },
                "examples": [
                    {
                        "en": "a few moments of light relief in an otherwise dull performance",
                        "vi": "một vài khoảnh khắc nhẹ nhõm trong một màn trình diễn buồn tẻ"
                    },
                    {
                        "en": "There was little comic relief in his speech.",
                        "vi": "Có một chút nhẹ nhõm hài hước trong bài phát biểu của anh ấy."
                    },
                    {
                        "en": "relief from something The calm of the countryside came as a welcome relief from the hustle and bustle of city life.",
                        "vi": "nhẹ nhõm từ một cái gì đó Sự bình lặng của vùng nông thôn đến như một sự chào đón nhẹ nhõm khỏi cuộc sống hối hả và nhộn nhịp của thành phố."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person or group of people that replaces another when they have finished working for the day or when they are sick",
                    "vi": "một người hoặc một nhóm người thay thế người khác khi họ đã hoàn thành công việc trong ngày hoặc khi họ bị ốm"
                },
                "examples": [
                    {
                        "en": "The next crew relief comes on duty at 9 o'clock.",
                        "vi": "Phi hành đoàn tiếp theo cứu trợ đến làm nhiệm vụ lúc 9 giờ."
                    },
                    {
                        "en": "We have a pool of relief drivers available to us.",
                        "vi": "Chúng tôi có một nhóm các trình điều khiển cứu trợ có sẵn cho chúng tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of freeing a town, etc. from an enemy army that has surrounded it",
                    "vi": "hành động giải phóng một thị trấn, v.v. khỏi quân địch đã bao vây nó"
                },
                "examples": [
                    {
                        "en": "the relief of Mafeking",
                        "vi": "sự nhẹ nhõm của Mafeking"
                    }
                ]
            },
            {
                "define": {
                    "en": "a way of decorating wood, stone, etc. by cutting designs into the surface of it so that some parts stick out more than others; a design that is made in this way",
                    "vi": "một cách trang trí gỗ, đá, vv bằng cách cắt các thiết kế trên bề mặt của nó để một số bộ phận nhô ra nhiều hơn những bộ phận khác; một thiết kế được thực hiện theo cách này"
                },
                "examples": [
                    {
                        "en": "The column was decorated in high relief (= with designs that stick out a lot) with scenes from Greek mythology.",
                        "vi": "Cột được trang trí rất nổi (= với các thiết kế nhô ra nhiều) với các cảnh trong thần thoại Hy Lạp."
                    },
                    {
                        "en": "The bronze doors are covered with sculpted reliefs.",
                        "vi": "Các cánh cửa bằng đồng được bao phủ bởi các bức phù điêu điêu khắc."
                    }
                ]
            },
            {
                "define": {
                    "en": "the effect of colours, light, etc. that makes an object easier to notice than others around it",
                    "vi": "hiệu ứng của màu sắc, ánh sáng, v.v. làm cho một vật thể dễ nhận thấy hơn những vật thể khác xung quanh nó"
                },
                "examples": [
                    {
                        "en": "The snow-capped mountain stood out in sharp relief against the blue sky.",
                        "vi": "Ngọn núi phủ tuyết trắng xóa nổi bật trên nền trời xanh."
                    }
                ]
            },
            {
                "define": {
                    "en": "the quality of a particular situation, problem, etc. that makes it easier to notice than before",
                    "vi": "chất lượng của một tình huống, vấn đề cụ thể, v.v. khiến bạn dễ dàng nhận thấy hơn trước đây"
                },
                "examples": [
                    {
                        "en": "Their differences have been thrown into sharp relief by the present crisis.",
                        "vi": "Sự khác biệt của họ đã được giải tỏa rõ rệt bởi cuộc khủng hoảng hiện tại."
                    },
                    {
                        "en": "The proximity of the wealthy suburb to the squatter camp throws the plight of the squatters into even sharper relief.",
                        "vi": "Sự gần gũi của vùng ngoại ô giàu có với trại người bỏ xác khiến hoàn cảnh của những người ngồi xổm càng trở nên nhẹ nhõm hơn."
                    }
                ]
            }
        ]
    },
    {
        "id": "277ddc40c0564f71bcd8cbcabd344301",
        "word": "shock",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ʃɒk/",
            "us": "/ʃɑːk/"
        },
        "nearby": [
            {
                "word": "shmo",
                "pos": "noun"
            },
            {
                "word": "shoal",
                "pos": "noun"
            },
            {
                "word": "shock",
                "pos": "noun"
            },
            {
                "word": "shock",
                "pos": "verb"
            },
            {
                "word": "shock absorber",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a strong feeling of surprise as a result of something happening, especially something unpleasant; the event that causes this feeling",
                    "vi": "cảm giác ngạc nhiên mạnh mẽ do kết quả của một điều gì đó đang xảy ra, đặc biệt là điều gì đó khó chịu; sự kiện gây ra cảm giác này"
                },
                "examples": [
                    {
                        "en": "I got a terrible shock the other day.",
                        "vi": "Tôi đã bị một cú sốc khủng khiếp vào ngày hôm trước."
                    },
                    {
                        "en": "When I added up the cost it gave me quite a shock.",
                        "vi": "Khi tôi cộng thêm chi phí, nó khiến tôi khá sốc."
                    },
                    {
                        "en": "The news of my promotion came as a shock.",
                        "vi": "Tin tức về việc thăng chức của tôi đến như một cú sốc."
                    },
                    {
                        "en": "The price came as something of a shock.",
                        "vi": "Giá đến như một cái gì đó của một cú sốc."
                    },
                    {
                        "en": "in shock She stared at him in shock for a moment.",
                        "vi": "trong cú sốc Cô sững sờ nhìn anh trong giây lát."
                    },
                    {
                        "en": "He's still in a state of shock.",
                        "vi": "Anh ấy vẫn còn trong tình trạng bị sốc."
                    },
                    {
                        "en": "(informal) If you think the job will be easy, you're in for a shock.",
                        "vi": "(không chính thức) Nếu bạn nghĩ rằng công việc sẽ dễ dàng, bạn đang bị sốc."
                    },
                    {
                        "en": "shock of something The party has hardly recovered from the shock of its defeat in May.",
                        "vi": "cú sốc về điều gì đó Đảng hầu như không hồi phục sau cú sốc thất bại vào tháng Năm."
                    },
                    {
                        "en": "shock of doing something She still hadn't got over the shock of seeing him again.",
                        "vi": "sốc khi làm điều gì đó Cô vẫn chưa hết sốc khi gặp lại anh."
                    },
                    {
                        "en": "shock for somebody/something This must be quite a shock for you all.",
                        "vi": "sốc đối với ai đó / điều gì đó Đây hẳn là một cú sốc đối với tất cả các bạn."
                    },
                    {
                        "en": "shock to somebody/something Her sudden death was a huge shock to the many people who knew her.",
                        "vi": "cú sốc đối với ai đó / điều gì đó Cái chết đột ngột của cô ấy là một cú sốc lớn đối với nhiều người biết cô ấy."
                    },
                    {
                        "en": "Losing in the first round was a shock to the system (= it was more of a shock because it was not expected).",
                        "vi": "Thua trong hiệp đầu tiên là một cú sốc đối với hệ thống (= nó còn là một cú sốc vì nó không được mong đợi)."
                    },
                    {
                        "en": "The team suffered a shock defeat in the first round.",
                        "vi": "Đội đã phải chịu một thất bại sốc ở vòng đầu tiên."
                    },
                    {
                        "en": "Neighbours expressed shock at the news.",
                        "vi": "Hàng xóm tỏ ra bàng hoàng trước tin này."
                    },
                    {
                        "en": "He spoke of his shock at the attitude of the two men.",
                        "vi": "Anh ấy nói về sự sốc của mình trước thái độ của hai người đàn ông."
                    },
                    {
                        "en": "Her shock at finding Elizabeth there was obvious.",
                        "vi": "Sự sốc của cô khi tìm thấy Elizabeth ở đó là rõ ràng."
                    },
                    {
                        "en": "It was a shock to find an ambulance outside his house.",
                        "vi": "Đó là một cú sốc khi tìm thấy một chiếc xe cấp cứu bên ngoài nhà của mình."
                    },
                    {
                        "en": "It was a bit of a shock for audiences to see him in such a different role.",
                        "vi": "Khán giả hơi sốc khi thấy anh ấy ở một vai diễn khác lạ như vậy."
                    }
                ]
            },
            {
                "define": {
                    "en": "a serious medical condition, usually the result of injury in which a person has lost a lot of blood and they are extremely weak",
                    "vi": "một tình trạng y tế nghiêm trọng, thường là hậu quả của chấn thương trong đó một người mất nhiều máu và họ cực kỳ yếu"
                },
                "examples": [
                    {
                        "en": "Many passengers were treated for shock.",
                        "vi": "Nhiều hành khách bị sốc thuốc."
                    },
                    {
                        "en": "She was taken to hospital suffering from shock.",
                        "vi": "Cô được đưa đến bệnh viện vì bị sốc."
                    },
                    {
                        "en": "in shock Others seemed in shock, waiting to be told what to do next.",
                        "vi": "bị sốc Những người khác dường như bị sốc, chờ đợi được cho biết phải làm gì tiếp theo."
                    },
                    {
                        "en": "He isn’t seriously injured but he is in a state of shock.",
                        "vi": "Anh ấy không bị thương nặng nhưng anh ấy đang trong tình trạng sốc."
                    },
                    {
                        "en": "He had gone into shock and was shaking violently.",
                        "vi": "Anh ấy đã bị sốc và run dữ dội."
                    }
                ]
            },
            {
                "define": {
                    "en": "a violent shaking movement that is caused by an explosion, earthquake, etc.",
                    "vi": "một chuyển động rung chuyển dữ dội gây ra bởi một vụ nổ, động đất, v.v."
                },
                "examples": [
                    {
                        "en": "The shock of the explosion could be felt six miles away.",
                        "vi": "Có thể cảm nhận được chấn động của vụ nổ cách đó sáu dặm."
                    },
                    {
                        "en": "The bumper absorbs shock on impact.",
                        "vi": "Bộ cản giảm sốc khi va chạm."
                    }
                ]
            },
            {
                "define": {
                    "en": "a sudden flow of electricity through a part of the body, causing pain and sometimes death",
                    "vi": "dòng điện đột ngột xuyên qua một phần cơ thể, gây đau đớn và đôi khi tử vong"
                },
                "examples": [
                    {
                        "en": "Don't touch that wire or you'll get a shock.",
                        "vi": "Đừng chạm vào dây đó, nếu không bạn sẽ bị giật."
                    },
                    {
                        "en": "He gave himself a mild shock while changing a light bulb.",
                        "vi": "Anh ấy đã tự cho mình một cú sốc nhẹ trong khi thay bóng đèn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a thick mass of hair on a person’s head",
                    "vi": "một khối tóc dày trên đầu của một người"
                },
                "examples": [
                    {
                        "en": "She's a large plump woman with a shock of red hair.",
                        "vi": "Cô ấy là một người phụ nữ to lớn đầy đặn với mái tóc đỏ rực."
                    }
                ]
            },
            {
                "define": {
                    "en": "used when you pretend to be shocked by something that is not really very serious or surprising",
                    "vi": "được sử dụng khi bạn giả vờ bị sốc trước một điều gì đó không thực sự nghiêm trọng hoặc đáng ngạc nhiên"
                },
                "examples": [
                    {
                        "en": "The article reports on a celebrity who—shock horror—has gained weight!",
                        "vi": "Bài báo tường thuật về một người nổi tiếng - gây sốc kinh hoàng - đã tăng cân!"
                    }
                ]
            }
        ]
    },
    {
        "id": "dedf8815cda04cfb973d5a519899c12f",
        "word": "thunderstorm",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈθʌndəstɔːm/",
            "us": "/ˈθʌndərstɔːrm/"
        },
        "nearby": [
            {
                "word": "thunderous",
                "pos": "adjective"
            },
            {
                "word": "thunderously",
                "pos": "adverb"
            },
            {
                "word": "thunderstorm",
                "pos": "noun"
            },
            {
                "word": "thunderstruck",
                "pos": "adjective"
            },
            {
                "word": "thundery",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a storm with thunder and lightning and usually very heavy rain",
                    "vi": "một cơn bão có sấm và sét và thường là mưa rất to"
                },
                "examples": [
                    {
                        "en": "He slept well, unaware of the thunderstorms which filled the night.",
                        "vi": "Anh ngủ ngon lành, không màng đến những cơn mưa giông giăng kín màn đêm."
                    },
                    {
                        "en": "The church was struck by lightning during a violent thunderstorm.",
                        "vi": "Nhà thờ bị sét đánh trong một cơn giông dữ dội."
                    }
                ]
            }
        ]
    },
    {
        "id": "4bb34fda4a484fb190f0ea57da74a435",
        "word": "tsunami",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/tsuːˈnɑːmi/",
            "us": "/tsuːˈnɑːmi/"
        },
        "nearby": [
            {
                "word": "tsp",
                "pos": "abbreviation"
            },
            {
                "word": "T-square",
                "pos": "noun"
            },
            {
                "word": "tsunami",
                "pos": "noun"
            },
            {
                "word": "TT",
                "pos": ""
            },
            {
                "word": "TTFN",
                "pos": "abbreviation"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an extremely large wave in the sea caused, for example, by an earthquake",
                    "vi": "ví dụ như một cơn sóng cực lớn trên biển gây ra bởi một trận động đất"
                },
                "examples": [
                    {
                        "en": "A tsunami early warning system was set up in Hawaii.",
                        "vi": "Một hệ thống cảnh báo sớm sóng thần đã được thiết lập ở Hawaii."
                    },
                    {
                        "en": "The tsunami caused immeasurable damage.",
                        "vi": "Sóng thần đã gây ra những thiệt hại khôn lường."
                    }
                ]
            }
        ]
    },
    {
        "id": "f60aa1cb4d9143d282874e3c900cfab1",
        "word": "typhoon",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/taɪˈfuːn/",
            "us": "/taɪˈfuːn/"
        },
        "nearby": [
            {
                "word": "Typhoid Mary",
                "pos": ""
            },
            {
                "word": "Typhoo",
                "pos": ""
            },
            {
                "word": "typhoon",
                "pos": "noun"
            },
            {
                "word": "typhus",
                "pos": "noun"
            },
            {
                "word": "typical",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a violent tropical storm with very strong winds",
                    "vi": "một cơn bão nhiệt đới dữ dội với gió rất mạnh"
                },
                "examples": [
                    {
                        "en": "His home was destroyed in a typhoon.",
                        "vi": "Nhà của ông đã bị phá hủy trong một cơn bão."
                    },
                    {
                        "en": "The plantation was devastated by a typhoon.",
                        "vi": "Đồn điền đã bị tàn phá bởi một cơn bão."
                    },
                    {
                        "en": "Earthquakes, typhoons and other natural disasters are frequent in that part of the Pacific.",
                        "vi": "Động đất, bão và các thảm họa thiên nhiên khác thường xuyên xảy ra ở khu vực đó của Thái Bình Dương."
                    },
                    {
                        "en": "The hottest time of year coincides with the typhoon season.",
                        "vi": "Thời điểm nóng nhất trong năm trùng với mùa bão."
                    }
                ]
            }
        ]
    },
    {
        "id": "92dda610b0b0437cafd77f1d68278fc9",
        "word": "volcanic",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/vɒlˈkænɪk/",
            "us": "/vɑːlˈkænɪk/"
        },
        "nearby": [
            {
                "word": "volatility",
                "pos": "noun"
            },
            {
                "word": "vol-au-vent",
                "pos": "noun"
            },
            {
                "word": "volcanic",
                "pos": "adjective"
            },
            {
                "word": "volcano",
                "pos": "noun"
            },
            {
                "word": "volcanology",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "caused or produced by a volcano",
                    "vi": "gây ra hoặc tạo ra bởi một ngọn núi lửa"
                },
                "examples": [
                    {
                        "en": "volcanic rocks",
                        "vi": "đá núi lửa"
                    },
                    {
                        "en": "volcanic eruptions",
                        "vi": "các vụ phun trào núi lửa"
                    },
                    {
                        "en": "The two main islands are volcanic in origin.",
                        "vi": "Hai hòn đảo chính có nguồn gốc là núi lửa."
                    }
                ]
            }
        ]
    },
    {
        "id": "9169b1db5b6a4a178720103cd344d0e5",
        "word": "cyclone",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈsaɪkləʊn/",
            "us": "/ˈsaɪkləʊn/"
        },
        "nearby": [
            {
                "word": "cyclist",
                "pos": "noun"
            },
            {
                "word": "cyclo-cross",
                "pos": "noun"
            },
            {
                "word": "cyclone",
                "pos": "noun"
            },
            {
                "word": "Cyclone",
                "pos": "noun"
            },
            {
                "word": "cyclonic",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a violent tropical storm in which strong winds move in a circle",
                    "vi": "một cơn bão nhiệt đới dữ dội trong đó gió mạnh di chuyển theo hình tròn"
                },
                "examples": [
                    {
                        "en": "The cyclone struck the village late last night.",
                        "vi": "Trận lốc xoáy vào làng đêm qua."
                    }
                ]
            },
            {
                "define": {
                    "en": "a weather condition in which the pressure of the air becomes lower, often causing wind and rain",
                    "vi": "một điều kiện thời tiết trong đó áp suất của không khí trở nên thấp hơn, thường gây ra gió và mưa"
                },
                "examples": [
                    {
                        "en": "As cyclones move inland, they become an important source of rain.",
                        "vi": "Khi lốc xoáy di chuyển vào đất liền, chúng trở thành nguồn mưa quan trọng."
                    }
                ]
            }
        ]
    },
    {
        "id": "c69f2ee971124cbc80f659b1272cfdc1",
        "word": "electrical storm",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ɪˌlektrɪkl ˈstɔːm/",
            "us": "/ɪˌlektrɪkl ˈstɔːrm/"
        },
        "nearby": [
            {
                "word": "electrical engineering",
                "pos": "noun"
            },
            {
                "word": "electrically",
                "pos": "adverb"
            },
            {
                "word": "electrical storm",
                "pos": "noun"
            },
            {
                "word": "electric bike",
                "pos": "noun"
            },
            {
                "word": "electric blanket",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a violent storm in which electricity is produced in the atmosphere",
                    "vi": "một cơn bão dữ dội trong đó điện được tạo ra trong khí quyển"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "34eef9bc2ab2467b89afcc00a3e70839",
        "word": "shock wave",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈʃɒk weɪv/",
            "us": "/ˈʃɑːk weɪv/"
        },
        "nearby": [
            {
                "word": "shock therapy",
                "pos": "noun"
            },
            {
                "word": "shock troops",
                "pos": "noun"
            },
            {
                "word": "shock wave",
                "pos": "noun"
            },
            {
                "word": "shod",
                "pos": "adjective"
            },
            {
                "word": "shod",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a movement of very high air pressure that is caused by an explosion, earthquake, etc.",
                    "vi": "sự chuyển động của áp suất không khí rất cao gây ra bởi một vụ nổ, động đất, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "feelings of shock that people experience when something bad happens suddenly",
                    "vi": "cảm giác sốc mà mọi người trải qua khi điều gì đó tồi tệ xảy ra đột ngột"
                },
                "examples": [
                    {
                        "en": "The murder sent shock waves through the whole community.",
                        "vi": "Vụ án mạng đã gây ra làn sóng chấn động trong toàn cộng đồng."
                    }
                ]
            }
        ]
    },
    {
        "id": "5dfd70eafdb547bd92ff47af65e9fb0e",
        "word": "snowslide",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈsnəʊslaɪd/",
            "us": "/ˈsnəʊslaɪd/"
        },
        "nearby": [
            {
                "word": "snowscape",
                "pos": "noun"
            },
            {
                "word": "snowshoe",
                "pos": "noun"
            },
            {
                "word": "snowslide",
                "pos": "noun"
            },
            {
                "word": "snowstorm",
                "pos": "noun"
            },
            {
                "word": "snowsuit",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a mass of snow, ice and rock that falls down the side of a mountain",
                    "vi": "một khối tuyết, băng và đá rơi xuống sườn núi"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "4441beedd6424589bf6965932f16fbfd",
        "word": "tidal wave",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈtaɪdl weɪv/",
            "us": "/ˈtaɪdl weɪv/"
        },
        "nearby": [
            {
                "word": "tic-tac-toe",
                "pos": "noun"
            },
            {
                "word": "tidal",
                "pos": "adjective"
            },
            {
                "word": "tidal wave",
                "pos": "noun"
            },
            {
                "word": "tidbit",
                "pos": "noun"
            },
            {
                "word": "tiddler",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a very large ocean wave that is caused by a storm or an earthquake, and that destroys things when it reaches the land",
                    "vi": "một cơn sóng biển rất lớn gây ra bởi một cơn bão hoặc một trận động đất và phá hủy mọi thứ khi nó đến đất liền"
                },
                "examples": [
                    {
                        "en": "According to one account, the explosion caused a tidal wave 65 feet high.",
                        "vi": "Theo một tài khoản, vụ nổ gây ra sóng thủy triều cao 65 feet."
                    },
                    {
                        "en": "Several villages were destroyed by a huge tidal wave.",
                        "vi": "Một số ngôi làng đã bị phá hủy bởi một đợt thủy triều lớn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a sudden increase in a particular feeling, activity or type of behaviour",
                    "vi": "sự gia tăng đột ngột trong một cảm giác, hoạt động hoặc loại hành vi cụ thể"
                },
                "examples": [
                    {
                        "en": "a tidal wave of crime",
                        "vi": "một làn sóng tội phạm"
                    }
                ]
            }
        ]
    },
    {
        "id": "ccc68d4f33404646a41d46970c546191",
        "word": "toll",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/təʊl/",
            "us": "/təʊl/"
        },
        "nearby": [
            {
                "word": "toleration",
                "pos": "noun"
            },
            {
                "word": "J R R Tolkien",
                "pos": ""
            },
            {
                "word": "toll",
                "pos": "noun"
            },
            {
                "word": "toll",
                "pos": "verb"
            },
            {
                "word": "tollbooth",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "money that you pay to use a particular road or bridge",
                    "vi": "số tiền bạn phải trả để sử dụng một con đường hoặc cây cầu cụ thể"
                },
                "examples": [
                    {
                        "en": "motorway tolls",
                        "vi": "phí cầu đường ô tô"
                    },
                    {
                        "en": "a toll bridge",
                        "vi": "một cây cầu thu phí"
                    },
                    {
                        "en": "the possibility of imposing tolls on some motorways",
                        "vi": "khả năng thu phí trên một số đường cao tốc"
                    }
                ]
            },
            {
                "define": {
                    "en": "the amount of damage or the number of deaths and injuries that are caused in a particular war, disaster, etc.",
                    "vi": "số lượng thiệt hại hoặc số người chết và bị thương do một cuộc chiến tranh, thảm họa cụ thể, v.v."
                },
                "examples": [
                    {
                        "en": "the war’s growing casualty toll",
                        "vi": "số thương vong ngày càng tăng của chiến tranh"
                    },
                    {
                        "en": "Every hour, the news bulletin reported the mounting toll of casualties.",
                        "vi": "Mỗi giờ, bản tin đều đưa tin về số thương vong ngày càng tăng."
                    }
                ]
            },
            {
                "define": {
                    "en": "the sound of a bell ringing with slow, regular sounds",
                    "vi": "tiếng chuông ngân vang với những âm thanh chậm rãi, đều đặn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a charge for a phone call that is calculated at a higher rate than a local call",
                    "vi": "phí cho một cuộc điện thoại được tính ở mức cước phí cao hơn một cuộc gọi nội hạt"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to have a bad effect on somebody/something; to cause a lot of damage, deaths, pain, etc.",
                    "vi": "có ảnh hưởng xấu đến ai đó / cái gì đó; để gây ra rất nhiều thiệt hại, chết chóc, đau đớn, v.v."
                },
                "examples": [
                    {
                        "en": "Illness had taken a heavy toll on her.",
                        "vi": "Bệnh tật đã khiến cô ấy bị ảnh hưởng nặng nề."
                    },
                    {
                        "en": "The recession is taking its toll on the housing markets.",
                        "vi": "Suy thoái đang ảnh hưởng đến thị trường nhà ở."
                    },
                    {
                        "en": "The pressure of fame can take a terrible toll.",
                        "vi": "Áp lực của sự nổi tiếng có thể phải trả một cái giá khủng khiếp."
                    }
                ]
            }
        ]
    },
    {
        "id": "0562015c86214ebab13351be93466004",
        "word": "wildfire",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈwaɪldfaɪə(r)/",
            "us": "/ˈwaɪldfaɪər/"
        },
        "nearby": [
            {
                "word": "wilderness",
                "pos": "noun"
            },
            {
                "word": "wild-eyed",
                "pos": "adjective"
            },
            {
                "word": "wildfire",
                "pos": "noun"
            },
            {
                "word": "wildflower",
                "pos": "noun"
            },
            {
                "word": "wildfowl",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a very big fire that spreads quickly and burns natural areas like woods, forests and grassland",
                    "vi": "một đám cháy rất lớn lan nhanh và thiêu rụi các khu vực tự nhiên như rừng, rừng và đồng cỏ"
                },
                "examples": [
                    {
                        "en": "Firefighters are battling devastating wildfires in northern California.",
                        "vi": "Lính cứu hỏa đang chiến đấu với đám cháy rừng kinh hoàng ở miền bắc California."
                    }
                ]
            },
            {
                "define": {
                    "en": "to become known by more and more people very quickly",
                    "vi": "được nhiều người biết đến một cách nhanh chóng"
                },
                "examples": [
                    {
                        "en": "Rumours of his death spread like wildfire.",
                        "vi": "Tin đồn về cái chết của anh ta lan nhanh như cháy rừng."
                    },
                    {
                        "en": "The news spread like wildfire.",
                        "vi": "Tin tức lan truyền như cháy rừng."
                    }
                ]
            }
        ]
    },
    {
        "id": "38cdc9f6f29e4999b6ba1543b4b92602",
        "word": "act of God",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/ækt/",
            "us": "/ækt/"
        },
        "nearby": [
            {
                "word": "acrylic",
                "pos": "noun"
            },
            {
                "word": "act",
                "pos": "verb"
            },
            {
                "word": "act",
                "pos": "noun"
            },
            {
                "word": "ACT",
                "pos": "abbreviation"
            },
            {
                "word": "act for",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a particular thing that somebody does",
                    "vi": "một điều cụ thể mà ai đó làm"
                },
                "examples": [
                    {
                        "en": "You have committed a serious criminal act.",
                        "vi": "Bạn đã thực hiện một hành vi tội phạm nghiêm trọng."
                    },
                    {
                        "en": "act of something an act of kindness",
                        "vi": "hành động một cái gì đó một hành động tử tế"
                    },
                    {
                        "en": "This was one of the most appalling acts of terror of recent times.",
                        "vi": "Đây là một trong những hành động khủng bố kinh hoàng nhất trong thời gian gần đây."
                    },
                    {
                        "en": "acts of terrorism/violence/aggression",
                        "vi": "hành động khủng bố / bạo lực / xâm lược"
                    },
                    {
                        "en": "They performed acts of great heroism.",
                        "vi": "Họ đã thực hiện những hành động của chủ nghĩa anh hùng tuyệt vời."
                    },
                    {
                        "en": "The murder was the act of a psychopath.",
                        "vi": "Vụ giết người là hành động của một kẻ tâm thần."
                    }
                ]
            },
            {
                "define": {
                    "en": "a law that has been passed by a parliament",
                    "vi": "một luật đã được quốc hội thông qua"
                },
                "examples": [
                    {
                        "en": "an Act of Congress/Parliament",
                        "vi": "một Đạo luật của Quốc hội / Nghị viện"
                    },
                    {
                        "en": "the Care Act 2014",
                        "vi": "Đạo luật Chăm sóc 2014"
                    },
                    {
                        "en": "to pass/repeal/amend an Act",
                        "vi": "để thông qua / bãi bỏ / sửa đổi một Đạo luật"
                    },
                    {
                        "en": "under an Act A Committee on Safety of Medicines was set up under the Act.",
                        "vi": "theo Đạo luật Một Ủy ban về An toàn Thuốc được thành lập theo Đạo luật."
                    }
                ]
            },
            {
                "define": {
                    "en": "a way of behaving that is not sincere but is intended to have a particular effect on others",
                    "vi": "một cách cư xử không chân thành nhưng nhằm gây ảnh hưởng cụ thể đến người khác"
                },
                "examples": [
                    {
                        "en": "Don't take her seriously—it's all an act.",
                        "vi": "Đừng coi cô ấy nghiêm túc — tất cả chỉ là một hành động."
                    },
                    {
                        "en": "You could tell she was just putting on an act.",
                        "vi": "Bạn có thể biết cô ấy chỉ đang diễn."
                    }
                ]
            },
            {
                "define": {
                    "en": "one of the main divisions of a play, an opera, etc.",
                    "vi": "một trong những bộ phận chính của một vở kịch, một vở opera, v.v."
                },
                "examples": [
                    {
                        "en": "a play in five acts",
                        "vi": "một vở kịch trong năm màn"
                    },
                    {
                        "en": "The hero dies in Act 5, Scene 3.",
                        "vi": "Người anh hùng chết trong Màn 5, Cảnh 3."
                    },
                    {
                        "en": "The king is killed in the opening act.",
                        "vi": "Nhà vua bị giết trong màn mở đầu."
                    }
                ]
            },
            {
                "define": {
                    "en": "a performance, especially one of several short pieces of entertainment in a show",
                    "vi": "một buổi biểu diễn, đặc biệt là một trong số vài phần giải trí ngắn trong một chương trình"
                },
                "examples": [
                    {
                        "en": "a circus/comedy/magic act",
                        "vi": "một vở xiếc / hài kịch / ảo thuật"
                    },
                    {
                        "en": "her one-woman poetry act",
                        "vi": "hành động thơ một người phụ nữ của cô ấy"
                    }
                ]
            },
            {
                "define": {
                    "en": "a performer or group of musicians",
                    "vi": "một nghệ sĩ biểu diễn hoặc một nhóm nhạc sĩ"
                },
                "examples": [
                    {
                        "en": "They were one of rock's most impressive live acts.",
                        "vi": "Họ là một trong những buổi biểu diễn trực tiếp ấn tượng nhất của rock."
                    }
                ]
            },
            {
                "define": {
                    "en": "an event caused by natural forces beyond human control, such as a storm, a flood or an earthquake",
                    "vi": "một sự kiện gây ra bởi các lực lượng tự nhiên ngoài tầm kiểm soát của con người, chẳng hạn như bão, lũ lụt hoặc động đất"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be/become involved in an activity that somebody else has started, especially to get something for yourself",
                    "vi": "tham gia / tham gia vào một hoạt động mà người khác đã bắt đầu, đặc biệt là để có được thứ gì đó cho chính bạn"
                },
                "examples": [
                    {
                        "en": "Other manufacturers are getting in on the act, creating their own versions of the popular toy.",
                        "vi": "Các nhà sản xuất khác đang vào cuộc, tạo ra các phiên bản đồ chơi phổ biến của riêng họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to start behaving in a moral or responsible way",
                    "vi": "để bắt đầu cư xử một cách có đạo đức hoặc có trách nhiệm"
                },
                "examples": [
                    {
                        "en": "He cleaned up his act and came off drugs.",
                        "vi": "Anh ta đã dọn dẹp hành vi của mình và bỏ ma túy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to go away or be impossible to find when people need or want you",
                    "vi": "đi xa hoặc không thể tìm thấy khi mọi người cần hoặc muốn bạn"
                },
                "examples": [
                    {
                        "en": "The cat had done a disappearing act.",
                        "vi": "Con mèo đã thực hiện một hành động biến mất."
                    }
                ]
            },
            {
                "define": {
                    "en": "to organize yourself and your activities in a more effective way in order to achieve something",
                    "vi": "tổ chức bản thân và các hoạt động của bạn theo cách hiệu quả hơn để đạt được điều gì đó"
                },
                "examples": [
                    {
                        "en": "He needs to get his act together if he's going to pass.",
                        "vi": "Anh ấy cần phải tập hợp lại hành động của mình nếu anh ấy sẽ vượt qua."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person or event that is so good or successful at something that it will be difficult for anyone/anything else coming after them to be as good or successful",
                    "vi": "một người hoặc một sự kiện quá tốt hoặc thành công ở một thứ gì đó mà sẽ khó cho bất kỳ ai / bất cứ điều gì khác sau họ trở nên tốt hoặc thành công"
                },
                "examples": [
                    {
                        "en": "She has been an excellent principal and will be a hard act to follow.",
                        "vi": "Cô ấy đã là một hiệu trưởng xuất sắc và sẽ là một hành động khó để noi theo."
                    },
                    {
                        "en": "Their contribution will prove a tough act to follow.",
                        "vi": "Sự đóng góp của họ sẽ chứng minh một hành động khó khăn để làm theo."
                    }
                ]
            },
            {
                "define": {
                    "en": "while you are doing something",
                    "vi": "trong khi bạn đang làm gì đó"
                },
                "examples": [
                    {
                        "en": "He was caught in the act of stealing a car.",
                        "vi": "Anh ta bị bắt quả tang khi đang thực hiện hành vi trộm xe."
                    },
                    {
                        "en": "It is often difficult to tell when someone is using drugs unless they are caught in the act.",
                        "vi": "Thường rất khó để biết ai đó đang sử dụng ma túy trừ khi họ bị bắt quả tang."
                    }
                ]
            },
            {
                "define": {
                    "en": "to tell somebody with force that they must not do something",
                    "vi": "buộc phải nói với ai đó rằng họ không được làm điều gì đó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "4316a2f3c4214e029985f85ab5e38730",
        "word": "aftershock",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɑːftəʃɒk/",
            "us": "/ˈæftərʃɑːk/"
        },
        "nearby": [
            {
                "word": "after-school",
                "pos": "adjective"
            },
            {
                "word": "aftershave",
                "pos": "noun"
            },
            {
                "word": "aftershock",
                "pos": "noun"
            },
            {
                "word": "aftersun",
                "pos": "noun"
            },
            {
                "word": "aftersun",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small earthquake that happens after a bigger one",
                    "vi": "một trận động đất nhỏ xảy ra sau một trận động đất lớn hơn"
                },
                "examples": [
                    {
                        "en": "The area suffered a series of aftershocks measuring up to 6.3 on the Richter scale.",
                        "vi": "Khu vực này hứng chịu một loạt dư chấn lên tới 6,3 độ Richter."
                    }
                ]
            }
        ]
    },
    {
        "id": "26f96d60c2344b169ea6fefcd67f9afe",
        "word": "airlift",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈeəlɪft/",
            "us": "/ˈerlɪft/"
        },
        "nearby": [
            {
                "word": "airless",
                "pos": "adjective"
            },
            {
                "word": "air letter",
                "pos": "noun"
            },
            {
                "word": "airlift",
                "pos": "noun"
            },
            {
                "word": "airlift",
                "pos": "verb"
            },
            {
                "word": "airline",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an operation to take people, soldiers, food, etc. to or from an area by aircraft, especially in an emergency or when roads are closed or dangerous",
                    "vi": "một hoạt động để đưa người, binh lính, thực phẩm, v.v. đến hoặc từ một khu vực bằng máy bay, đặc biệt là trong trường hợp khẩn cấp hoặc khi đường bị đóng hoặc nguy hiểm"
                },
                "examples": [
                    {
                        "en": "an airlift of food and medical supplies to the besieged city",
                        "vi": "một cuộc vận chuyển thực phẩm và vật tư y tế đến thành phố bị bao vây"
                    }
                ]
            }
        ]
    },
    {
        "id": "1b75a8f2743b4b69b0ee94f91086d2dc",
        "word": "airlift",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈeəlɪft/",
            "us": "/ˈerlɪft/"
        },
        "nearby": [
            {
                "word": "air letter",
                "pos": "noun"
            },
            {
                "word": "airlift",
                "pos": "noun"
            },
            {
                "word": "airlift",
                "pos": "verb"
            },
            {
                "word": "airline",
                "pos": "noun"
            },
            {
                "word": "airliner",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to take somebody/something to or from an area by aircraft, especially in an emergency or when roads are closed or dangerous",
                    "vi": "để đưa ai đó / cái gì đó đến hoặc từ một khu vực bằng máy bay, đặc biệt là trong trường hợp khẩn cấp hoặc khi đường bị đóng hoặc nguy hiểm"
                },
                "examples": [
                    {
                        "en": "Two casualties were airlifted to safety.",
                        "vi": "Hai người thương vong đã được đưa đến nơi an toàn."
                    },
                    {
                        "en": "Over 200 residents were airlifted off the island.",
                        "vi": "Hơn 200 cư dân đã được đưa ra khỏi hòn đảo."
                    }
                ]
            }
        ]
    },
    {
        "id": "14f12d6441b84aa2940966fc69c61c9f",
        "word": "cataclysm",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈkætəklɪzəm/",
            "us": "/ˈkætəklɪzəm/"
        },
        "nearby": [
            {
                "word": "Cat",
                "pos": ""
            },
            {
                "word": "catabolism",
                "pos": "noun"
            },
            {
                "word": "cataclysm",
                "pos": "noun"
            },
            {
                "word": "cataclysmic",
                "pos": "adjective"
            },
            {
                "word": "catacombs",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a sudden disaster or a violent event that causes change, for example a flood or a war",
                    "vi": "một thảm họa đột ngột hoặc một sự kiện bạo lực gây ra thay đổi, ví dụ như lũ lụt hoặc chiến tranh"
                },
                "examples": [
                    {
                        "en": "to survive the cataclysm of the Black Death",
                        "vi": "để sống sót sau trận đại hồng thủy của Cái chết đen"
                    }
                ]
            }
        ]
    },
    {
        "id": "2394fa250fdf4d02a10d8fea58281fc9",
        "word": "death toll",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈdeθ təʊl/",
            "us": "/ˈdeθ təʊl/"
        },
        "nearby": [
            {
                "word": "death squad",
                "pos": "noun"
            },
            {
                "word": "death throes",
                "pos": "noun"
            },
            {
                "word": "death toll",
                "pos": "noun"
            },
            {
                "word": "death trap",
                "pos": "noun"
            },
            {
                "word": "Death Valley",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the number of people killed in an accident, a war, a disaster, etc.",
                    "vi": "số người chết vì tai nạn, chiến tranh, thảm họa, v.v."
                },
                "examples": [
                    {
                        "en": "The death toll has now risen to 200.",
                        "vi": "Số người chết hiện đã lên đến 200 người."
                    }
                ]
            }
        ]
    },
    {
        "id": "720395e4fbd740f8b7ba7074ef29e3dc",
        "word": "epicentre",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈepɪsentə(r)/",
            "us": "/ˈepɪsentər/"
        },
        "nearby": [
            {
                "word": "epic",
                "pos": "adjective"
            },
            {
                "word": "epicene",
                "pos": "adjective"
            },
            {
                "word": "epicentre",
                "pos": "noun"
            },
            {
                "word": "epicure",
                "pos": "noun"
            },
            {
                "word": "epicurean",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the point on the earth’s surface where the effects of an earthquake are felt most strongly",
                    "vi": "điểm trên bề mặt trái đất nơi tác động của một trận động đất được cảm nhận mạnh mẽ nhất"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the central point of something",
                    "vi": "điểm trung tâm của một cái gì đó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "afdbdcfe1dd74f1a8f7a06954d3c978f",
        "word": "eruptive",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ɪˈrʌptɪv/",
            "us": "/ɪˈrʌptɪv/"
        },
        "nearby": [
            {
                "word": "erupt",
                "pos": "verb"
            },
            {
                "word": "eruption",
                "pos": "noun"
            },
            {
                "word": "eruptive",
                "pos": "adjective"
            },
            {
                "word": "eruv",
                "pos": "noun"
            },
            {
                "word": "erven",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "relating to or produced by the eruption of a volcano",
                    "vi": "liên quan đến hoặc được tạo ra bởi sự phun trào của một ngọn núi lửa"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "5851c5e49d9846019ed27c5edf2c0974",
        "word": "eye",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/aɪ/",
            "us": "/aɪ/"
        },
        "nearby": [
            {
                "word": "-ey",
                "pos": "suffix"
            },
            {
                "word": "eye-rolling",
                "pos": "adjective"
            },
            {
                "word": "eye",
                "pos": "noun"
            },
            {
                "word": "eye",
                "pos": "verb"
            },
            {
                "word": "eyeball",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "either of the two organs on the face that you see with",
                    "vi": "một trong hai cơ quan trên khuôn mặt mà bạn nhìn thấy"
                },
                "examples": [
                    {
                        "en": "The suspect has dark hair and green eyes.",
                        "vi": "Nghi phạm có mái tóc đen và đôi mắt xanh lục."
                    },
                    {
                        "en": "to close/open your eyes",
                        "vi": "nhắm / mở mắt của bạn"
                    },
                    {
                        "en": "to lower your eyes (= to look down)",
                        "vi": "hạ mắt xuống (= nhìn xuống)"
                    },
                    {
                        "en": "She rolled her eyes in disgust.",
                        "vi": "Cô trợn mắt kinh tởm."
                    },
                    {
                        "en": "Keep your eyes shut!",
                        "vi": "Hãy nhắm mắt lại!"
                    },
                    {
                        "en": "in somebody's eyes/eye There were tears in his eyes.",
                        "vi": "trong mắt ai đó / mắt anh ấy đã có những giọt nước mắt."
                    },
                    {
                        "en": "I have something in my eye.",
                        "vi": "Tôi có một cái gì đó trong mắt của tôi."
                    },
                    {
                        "en": "She had a haunted look in her dark eyes.",
                        "vi": "Cô ấy có một cái nhìn đầy ám ảnh trong đôi mắt đen của mình."
                    },
                    {
                        "en": "His eyes filled with tears.",
                        "vi": "Đôi mắt anh ngân ngấn lệ."
                    },
                    {
                        "en": "The ending was so sad it brought tears to my eyes.",
                        "vi": "Cái kết quá buồn khiến tôi rơm rớm nước mắt."
                    },
                    {
                        "en": "I could see a pair of blue eyes peering out at me.",
                        "vi": "Tôi có thể thấy một đôi mắt xanh đang nhìn chằm chằm vào tôi."
                    },
                    {
                        "en": "Her eyes widened in disbelief.",
                        "vi": "Đôi mắt cô ấy mở to không thể tin được."
                    },
                    {
                        "en": "His eyes narrowed suspiciously.",
                        "vi": "Đôi mắt anh ta nheo lại đầy nghi ngờ."
                    },
                    {
                        "en": "Their eyes lit up when they saw all the presents.",
                        "vi": "Mắt họ sáng lên khi nhìn thấy tất cả những món quà."
                    },
                    {
                        "en": "to make/avoid eye contact with somebody (= to look/avoid looking at them at the same time as they look at you)",
                        "vi": "để thực hiện / tránh giao tiếp bằng mắt với ai đó (= nhìn / tránh nhìn họ cùng lúc khi họ nhìn bạn)"
                    },
                    {
                        "en": "All eyes were on him (= everyone was looking at him) as he walked on to the stage.",
                        "vi": "Mọi con mắt đều đổ dồn vào anh ấy (= mọi người đang nhìn anh ấy) khi anh ấy bước lên sân khấu."
                    },
                    {
                        "en": "a feast/treat/delight for the eyes",
                        "vi": "một bữa tiệc / chiêu đãi / thú vị cho đôi mắt"
                    }
                ]
            },
            {
                "define": {
                    "en": "having the type or number of eyes mentioned",
                    "vi": "có loại hoặc số lượng mắt được đề cập"
                },
                "examples": [
                    {
                        "en": "a blue-eyed blonde",
                        "vi": "một cô gái tóc vàng mắt xanh"
                    },
                    {
                        "en": "a one-eyed monster",
                        "vi": "một con quái vật một mắt"
                    }
                ]
            },
            {
                "define": {
                    "en": "the ability to see",
                    "vi": "khả năng nhìn thấy"
                },
                "examples": [
                    {
                        "en": "A surgeon needs a good eye and a steady hand.",
                        "vi": "Một bác sĩ phẫu thuật cần có con mắt tinh tường và bàn tay vững vàng."
                    },
                    {
                        "en": "Her skill at working with wood is coupled to a keen eye for design.",
                        "vi": "Kỹ năng làm việc với gỗ của cô ấy kết hợp với con mắt thiết kế nhạy bén."
                    }
                ]
            },
            {
                "define": {
                    "en": "a particular way of seeing something",
                    "vi": "một cách cụ thể để nhìn một cái gì đó"
                },
                "examples": [
                    {
                        "en": "with the eye of somebody He looked at the design with the eye of an engineer.",
                        "vi": "với con mắt của ai đó Ông ấy đã nhìn thiết kế với con mắt của một kỹ sư."
                    },
                    {
                        "en": "with a… eye She viewed the findings with a critical eye.",
                        "vi": "bằng con mắt… Cô ấy xem những phát hiện với con mắt phê phán."
                    },
                    {
                        "en": "to somebody's eye To my eye, the windows seem out of proportion.",
                        "vi": "đối với mắt ai đó Đối với mắt tôi, các cửa sổ dường như không theo tỷ lệ."
                    }
                ]
            },
            {
                "define": {
                    "en": "the hole in the end of a needle that you put the thread through",
                    "vi": "lỗ ở đầu kim mà bạn luồn chỉ qua"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a small thin piece of metal curved round, that a small hook fits into, used for fastening clothes",
                    "vi": "một mảnh kim loại mỏng nhỏ hình tròn cong, có móc nhỏ vừa vặn, dùng để buộc quần áo"
                },
                "examples": [
                    {
                        "en": "It fastens with a hook and eye.",
                        "vi": "Nó gắn chặt với một cái móc và mắt."
                    }
                ]
            },
            {
                "define": {
                    "en": "a calm area at the centre of a storm, etc.",
                    "vi": "vùng tĩnh lặng ở tâm bão, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a dark mark on a potato from which another plant will grow",
                    "vi": "một vết đen trên củ khoai tây mà từ đó cây khác sẽ mọc lên"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a person or thing that is loved more than any other",
                    "vi": "một người hoặc một vật được yêu thích hơn bất kỳ người nào khác"
                },
                "examples": [
                    {
                        "en": "She is the apple of her father's eye.",
                        "vi": "Cô ấy là quả táo trong mắt của cha cô ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to the horizon (= where the sky meets the land or sea)",
                    "vi": "tới đường chân trời (= nơi bầu trời gặp mặt đất hoặc biển)"
                },
                "examples": [
                    {
                        "en": "The bleak moorland stretched on all sides as far as the eye could see.",
                        "vi": "Đồng hoang ảm đạm trải dài tứ phía theo tầm mắt có thể nhìn thấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to open and close your eyes quickly, in a way that is supposed to be attractive",
                    "vi": "mở và nhắm mắt nhanh chóng, theo cách được cho là hấp dẫn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be watching somebody/something carefully and with a lot of interest",
                    "vi": "được quan sát ai đó / điều gì đó một cách cẩn thận và với rất nhiều sự quan tâm"
                },
                "examples": [
                    {
                        "en": "The kids were all eyes as he slowly unwrapped the package.",
                        "vi": "Những đứa trẻ đều tròn mắt khi anh từ từ mở gói."
                    }
                ]
            },
            {
                "define": {
                    "en": "people all have different ideas about what is beautiful",
                    "vi": "mọi người đều có những ý tưởng khác nhau về những gì là đẹp"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "in somebody’s presence; in front of somebody",
                    "vi": "trong sự hiện diện của ai đó; trước mặt ai đó"
                },
                "examples": [
                    {
                        "en": "He had seen his life's work destroyed before his very eyes.",
                        "vi": "Anh đã chứng kiến công việc của cuộc đời mình bị phá hủy ngay trước mắt anh."
                    },
                    {
                        "en": "Before our very eyes, the bird snatched the fish from the plate and flew off.",
                        "vi": "Trước mắt chúng tôi, con chim đã giật lấy con cá trong đĩa và bay đi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to have a lot of something to deal with",
                    "vi": "có rất nhiều thứ để giải quyết"
                },
                "examples": [
                    {
                        "en": "We're up to our eyes in work.",
                        "vi": "Chúng tôi cố gắng hết sức trong công việc."
                    }
                ]
            },
            {
                "define": {
                    "en": "a view of something from a high position looking down",
                    "vi": "một cái gì đó nhìn từ trên cao nhìn xuống"
                },
                "examples": [
                    {
                        "en": "From the plane we had a bird's-eye view of Manhattan.",
                        "vi": "Từ trên máy bay, chúng tôi có một cái nhìn toàn cảnh về Manhattan."
                    }
                ]
            },
            {
                "define": {
                    "en": "to look at or examine something quickly",
                    "vi": "để xem xét hoặc kiểm tra một cái gì đó một cách nhanh chóng"
                },
                "examples": [
                    {
                        "en": "Could you just run your eyes over this report?",
                        "vi": "Bạn có thể lướt qua bản báo cáo này không?"
                    },
                    {
                        "en": "I cast my eyes around the room but couldn't see any familiar faces.",
                        "vi": "Tôi đưa mắt nhìn quanh căn phòng nhưng không thể nhìn thấy bất kỳ khuôn mặt quen thuộc nào."
                    }
                ]
            },
            {
                "define": {
                    "en": "to attract somebody’s attention",
                    "vi": "để thu hút sự chú ý của ai đó"
                },
                "examples": [
                    {
                        "en": "Can you catch the waiter's eye?",
                        "vi": "Bạn có thể lọt vào mắt xanh của người phục vụ không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to see somebody/something",
                    "vi": "để gặp ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "I haven't clapped eyes on them for weeks.",
                        "vi": "Tôi đã không vỗ mắt vào họ trong nhiều tuần."
                    },
                    {
                        "en": "I hope I never set eyes on this place again!",
                        "vi": "Tôi hy vọng tôi sẽ không bao giờ để mắt đến nơi này nữa!"
                    },
                    {
                        "en": "Tom fell in love the moment he laid eyes on her.",
                        "vi": "Tom đã yêu ngay từ khi anh ấy nhìn vào cô ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to look at or listen to something/somebody carefully and with a lot of attention",
                    "vi": "nhìn hoặc lắng nghe điều gì đó / ai đó một cách cẩn thận và chú ý"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "pleasant to listen to or look at",
                    "vi": "dễ chịu khi nghe hoặc nhìn"
                },
                "examples": [
                    {
                        "en": "The room was painted in soft pastels that were easy on the eye.",
                        "vi": "Căn phòng được sơn bằng màu phấn nhẹ nhàng dễ bắt mắt."
                    }
                ]
            },
            {
                "define": {
                    "en": "pleasant to look at",
                    "vi": "dễ nhìn"
                },
                "examples": [
                    {
                        "en": "The room was painted in soft pastels that were easy on the eye.",
                        "vi": "Căn phòng được sơn bằng màu phấn nhẹ nhàng dễ bắt mắt."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to show that you do not believe somebody/something",
                    "vi": "được sử dụng để cho thấy rằng bạn không tin ai đó / điều gì đó"
                },
                "examples": [
                    {
                        "en": "‘It's an antique.’ ‘An antique, my eye!’",
                        "vi": "Đó là một món đồ cổ.' 'Một món đồ cổ, con mắt của tôi!'"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that you should punish somebody by doing to them what they have done to you or to somebody else",
                    "vi": "từng nói rằng bạn nên trừng phạt ai đó bằng cách làm với họ những gì họ đã làm với bạn hoặc với người khác"
                },
                "examples": [
                    {
                        "en": "They advocate a justice system that works on the principle of an eye for an eye.",
                        "vi": "Họ ủng hộ một hệ thống tư pháp hoạt động theo nguyên tắc của con mắt."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that somebody has been greedy by taking more food than they can eat",
                    "vi": "từng nói rằng ai đó đã tham lam khi lấy nhiều thức ăn hơn mức họ có thể ăn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to look at somebody/something and get great pleasure",
                    "vi": "để nhìn ai đó / cái gì đó và có được niềm vui lớn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be seen only by a particular person",
                    "vi": "chỉ được nhìn thấy bởi một người cụ thể"
                },
                "examples": [
                    {
                        "en": "I'll lend you the letters but they're for your eyes only.",
                        "vi": "Tôi sẽ cho bạn mượn những lá thư nhưng chúng chỉ dành cho bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to practise so that you are able to make good judgements about a task or activity that you are doing",
                    "vi": "để thực hành để bạn có thể đưa ra đánh giá tốt về một nhiệm vụ hoặc hoạt động mà bạn đang làm"
                },
                "examples": [
                    {
                        "en": "I've got my eye in now—the ball is landing just where I want it.",
                        "vi": "Bây giờ tôi đã để mắt tới — quả bóng đang hạ cánh đúng nơi tôi muốn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be able to judge if things look attractive, valuable, etc.",
                    "vi": "để có thể đánh giá xem mọi thứ có hấp dẫn, có giá trị hay không, v.v."
                },
                "examples": [
                    {
                        "en": "I've never had much of an eye for fashion.",
                        "vi": "Tôi chưa bao giờ để mắt nhiều đến thời trang."
                    },
                    {
                        "en": "She has an eye for a bargain.",
                        "vi": "Cô ấy có một con mắt cho một món hời."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be watching somebody carefully, especially to check that they do not do anything wrong",
                    "vi": "quan sát ai đó cẩn thận, đặc biệt là để kiểm tra xem họ không làm gì sai"
                },
                "examples": [
                    {
                        "en": "And remember, I'll have my eye on you so you'd better behave.",
                        "vi": "Và hãy nhớ, tôi sẽ để mắt đến bạn vì vậy bạn nên cư xử tốt hơn."
                    },
                    {
                        "en": "The store detective had his eye on a group of boys who were acting suspiciously.",
                        "vi": "Thám tử của cửa hàng đã để mắt đến một nhóm nam sinh đang hành động đáng ngờ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be thinking about asking somebody out, offering somebody a job, etc. because you think they are attractive, good at their job, etc.",
                    "vi": "suy nghĩ về việc rủ ai đó đi chơi, mời ai đó một công việc, v.v. bởi vì bạn nghĩ rằng họ hấp dẫn, làm tốt công việc của họ, v.v."
                },
                "examples": [
                    {
                        "en": "He's got his eye on the new girl in your class.",
                        "vi": "Anh ấy để mắt đến cô gái mới trong lớp của bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be thinking about buying something",
                    "vi": "đang suy nghĩ về việc mua một cái gì đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be aware of everything that is happening around you, even things that seem difficult or impossible to see",
                    "vi": "nhận thức được mọi thứ đang xảy ra xung quanh bạn, ngay cả những điều có vẻ khó hoặc không thể nhìn thấy"
                },
                "examples": [
                    {
                        "en": "You can’t get away with anything in her class. She has eyes in the back of her head.",
                        "vi": "Bạn không thể thoát khỏi bất cứ thứ gì trong lớp của cô ấy. Cô ấy có đôi mắt ở phía sau đầu."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be able to notice or see everything",
                    "vi": "để có thể nhận thấy hoặc xem mọi thứ"
                },
                "examples": [
                    {
                        "en": "She's bound to notice that chipped glass. The woman has eyes like a hawk!",
                        "vi": "Cô ấy nhất định phải chú ý đến chiếc kính sứt mẻ đó. Người phụ nữ có đôi mắt như diều hâu!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to look at or watch something while doing something else, especially in a secret way so that other people do not notice",
                    "vi": "nhìn hoặc xem một cái gì đó trong khi làm việc khác, đặc biệt là một cách bí mật để người khác không nhận thấy"
                },
                "examples": [
                    {
                        "en": "During his talk, most of the delegates had one eye on the clock.",
                        "vi": "Trong buổi nói chuyện của ông, hầu hết các đại biểu đều dán mắt vào đồng hồ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to always be looking for the chance to have a new sexual relationship",
                    "vi": "luôn tìm kiếm cơ hội để có một mối quan hệ tình dục mới"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to be very obvious to somebody",
                    "vi": "rất rõ ràng với ai đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "very quickly; in a short time",
                    "vi": "rất nhanh; trong một thời gian ngắn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "in somebody’s opinion or according to the way that they see the situation",
                    "vi": "theo ý kiến của ai đó hoặc theo cách họ nhìn nhận tình hình"
                },
                "examples": [
                    {
                        "en": "She can do no wrong in her father's eyes.",
                        "vi": "Cô ấy không thể làm gì sai trong mắt cha mình."
                    },
                    {
                        "en": "To Western eyes, it may seem that the city is overcrowded.",
                        "vi": "Đối với con mắt của người phương Tây, có vẻ như thành phố đã quá đông đúc."
                    }
                ]
            },
            {
                "define": {
                    "en": "according to the law, most people in the world, etc.",
                    "vi": "theo quy luật, hầu hết mọi người trên thế giới, v.v."
                },
                "examples": [
                    {
                        "en": "In the eyes of the law she is guilty, though few ordinary people would think so.",
                        "vi": "Trước pháp luật, cô ấy là người có tội, mặc dù rất ít người bình thường có thể nghĩ như vậy."
                    },
                    {
                        "en": "In the eyes of the law his knife was an offensive weapon.",
                        "vi": "Trong mắt pháp luật, con dao của anh ta là một vũ khí tấn công."
                    }
                ]
            },
            {
                "define": {
                    "en": "well known to many people through television, newspapers, the internet, etc.",
                    "vi": "được nhiều người biết đến qua tivi, báo chí, mạng internet, v.v."
                },
                "examples": [
                    {
                        "en": "She doesn't want her children growing up in the public eye.",
                        "vi": "Cô ấy không muốn con mình lớn lên trong mắt công chúng."
                    }
                ]
            },
            {
                "define": {
                    "en": "very quickly",
                    "vi": "rất nhanh"
                },
                "examples": [
                    {
                        "en": "Suddenly, in the twinkling of an eye, her whole life had been turned upside down.",
                        "vi": "Đột nhiên, trong nháy mắt, toàn bộ cuộc sống của cô đã bị đảo lộn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to watch somebody/something carefully",
                    "vi": "để xem ai đó / cái gì đó cẩn thận"
                },
                "examples": [
                    {
                        "en": "Over the next few months we will keep a close eye on sales.",
                        "vi": "Trong vài tháng tới, chúng tôi sẽ theo dõi chặt chẽ doanh số bán hàng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to listen or look out for somebody/something that you might hear or see",
                    "vi": "để lắng nghe hoặc tìm kiếm ai đó / điều gì đó mà bạn có thể nghe thấy hoặc nhìn thấy"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to take care of somebody/something and make sure that they are not harmed, damaged, etc.",
                    "vi": "chăm sóc ai đó / cái gì đó và đảm bảo rằng họ không bị tổn hại, hư hỏng, v.v."
                },
                "examples": [
                    {
                        "en": "We've asked the neighbours to keep an eye on the house for us while we are away.",
                        "vi": "Chúng tôi đã nhờ hàng xóm trông chừng ngôi nhà cho chúng tôi khi chúng tôi đi vắng."
                    },
                    {
                        "en": "Could you keep an eye on my bag while I go to the toilet?",
                        "vi": "Bạn có thể để mắt đến túi xách của tôi khi tôi đi vệ sinh không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to continue to give your attention to what is most important",
                    "vi": "để tiếp tục chú ý đến điều gì là quan trọng nhất"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to look for somebody/something while you are doing other things",
                    "vi": "tìm ai đó / cái gì đó trong khi bạn đang làm những việc khác"
                },
                "examples": [
                    {
                        "en": "Police have asked residents to keep an eye out for anything suspicious.",
                        "vi": "Cảnh sát đã yêu cầu cư dân để mắt đến bất cứ điều gì đáng ngờ."
                    },
                    {
                        "en": "I walked around the store, keeping an eye out for bargains.",
                        "vi": "Tôi dạo quanh cửa hàng, để ý những món hời."
                    }
                ]
            },
            {
                "define": {
                    "en": "to look out for somebody/something that you might see",
                    "vi": "để tìm kiếm ai đó / điều gì đó mà bạn có thể thấy"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to look out for somebody/something that you might see",
                    "vi": "để tìm kiếm ai đó / điều gì đó mà bạn có thể thấy"
                },
                "examples": [
                    {
                        "en": "We kept our eyes peeled for any signs of life.",
                        "vi": "Chúng tôi để mắt đến bất kỳ dấu hiệu của sự sống."
                    }
                ]
            },
            {
                "define": {
                    "en": "to watch somebody/something carefully in case you need to take action",
                    "vi": "để xem ai đó / cái gì đó cẩn thận trong trường hợp bạn cần phải hành động"
                },
                "examples": [
                    {
                        "en": "Keep a weather eye on your competitors.",
                        "vi": "Theo dõi thời tiết về đối thủ cạnh tranh của bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to look straight at somebody without feeling embarrassed or ashamed",
                    "vi": "nhìn thẳng vào ai đó mà không cảm thấy xấu hổ hay xấu hổ"
                },
                "examples": [
                    {
                        "en": "Can you look me in the eye and tell me you're not lying?",
                        "vi": "Bạn có thể nhìn vào mắt tôi và nói với tôi rằng bạn không nói dối?"
                    },
                    {
                        "en": "She looked her father straight in the eye and answered his question truthfully.",
                        "vi": "Cô nhìn thẳng vào mắt cha mình và trả lời thành thật câu hỏi của ông."
                    },
                    {
                        "en": "I'll never be able to look her in the face again!",
                        "vi": "Tôi sẽ không bao giờ có thể nhìn mặt cô ấy nữa!"
                    }
                ]
            },
            {
                "define": {
                    "en": "to look at somebody in a way that shows that you find them sexually attractive",
                    "vi": "để nhìn ai đó theo cách cho thấy rằng bạn thấy họ hấp dẫn về mặt tình dục"
                },
                "examples": [
                    {
                        "en": "He's definitely giving you the eye!",
                        "vi": "Anh ấy chắc chắn đang để mắt đến bạn!"
                    }
                ]
            },
            {
                "define": {
                    "en": "if you meet somebody’s eye(s), you look directly at them as they look at you; if two people’s eyes meet, they look directly at each other",
                    "vi": "nếu bạn bắt gặp (các) mắt của ai đó, bạn nhìn thẳng vào họ khi họ nhìn bạn; nếu mắt hai người gặp nhau, họ nhìn thẳng vào nhau"
                },
                "examples": [
                    {
                        "en": "She was afraid to meet my eye.",
                        "vi": "Cô ấy sợ bắt gặp ánh mắt của tôi."
                    },
                    {
                        "en": "Their eyes met across the crowded room.",
                        "vi": "Ánh mắt họ chạm nhau khắp căn phòng đông đúc."
                    },
                    {
                        "en": "She met his gaze without flinching.",
                        "vi": "Cô bắt gặp ánh nhìn của anh mà không hề nao núng."
                    }
                ]
            },
            {
                "define": {
                    "en": "if a sight meets your eyes, you see it",
                    "vi": "nếu một cảnh tượng bắt gặp đôi mắt của bạn, bạn sẽ thấy nó"
                },
                "examples": [
                    {
                        "en": "A terrible sight met their eyes.",
                        "vi": "Một cảnh tượng khủng khiếp đập vào mắt họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "your imagination",
                    "vi": "trí tưởng tượng của bạn"
                },
                "examples": [
                    {
                        "en": "He pictured the scene in his mind's eye.",
                        "vi": "Anh hình dung ra khung cảnh trong mắt mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "the normal power of your eyes without the help of an instrument",
                    "vi": "sức mạnh bình thường của đôi mắt của bạn mà không cần sự trợ giúp của một dụng cụ"
                },
                "examples": [
                    {
                        "en": "The planet should be visible with/to the naked eye.",
                        "vi": "Hành tinh nên được nhìn thấy bằng / bằng mắt thường."
                    }
                ]
            },
            {
                "define": {
                    "en": "to show no surprise or concern when something unusual happens",
                    "vi": "để không tỏ ra ngạc nhiên hay lo lắng khi có điều gì đó bất thường xảy ra"
                },
                "examples": [
                    {
                        "en": "She didn't bat an eyelid when I told her my news.",
                        "vi": "Cô ấy không rời mắt khi tôi nói với cô ấy tin tức của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be very surprised at something you hear/see",
                    "vi": "rất ngạc nhiên về điều gì đó bạn nghe / thấy"
                },
                "examples": [
                    {
                        "en": "I couldn't believe my eyes when she walked in.",
                        "vi": "Tôi không thể tin vào mắt mình khi cô ấy bước vào."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be very surprised at something you see",
                    "vi": "rất ngạc nhiên về một cái gì đó bạn nhìn thấy"
                },
                "examples": [
                    {
                        "en": "I couldn't believe my eyes when she walked in.",
                        "vi": "Tôi không thể tin vào mắt mình khi cô ấy bước vào."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that everyone was very emotional about something",
                    "vi": "từng nói rằng mọi người đều rất xúc động về điều gì đó"
                },
                "examples": [
                    {
                        "en": "There wasn't a dry eye in the house when they announced their engagement.",
                        "vi": "Không có người nào thấy khô mắt khi họ tuyên bố đính hôn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to not share the same views as somebody about something",
                    "vi": "để không chia sẻ cùng quan điểm với ai đó về điều gì đó"
                },
                "examples": [
                    {
                        "en": "The two of them have never seen eye to eye on politics.",
                        "vi": "Hai người họ chưa bao giờ chạm mắt nhau về chính trị."
                    }
                ]
            },
            {
                "define": {
                    "en": "to find somebody/something so interesting, attractive, etc. that you watch them all the time",
                    "vi": "để tìm ai đó / điều gì đó thật thú vị, hấp dẫn, v.v. mà bạn xem họ mọi lúc"
                },
                "examples": [
                    {
                        "en": "He couldn't keep his eyes off the girl sitting opposite him.",
                        "vi": "Anh không thể rời mắt khỏi cô gái đang ngồi đối diện mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "a result, action, etc. that is disappointing or a defeat for somebody/something",
                    "vi": "một kết quả, hành động, v.v. gây thất vọng hoặc thất bại đối với ai đó / điều gì đó"
                },
                "examples": [
                    {
                        "en": "The appointment of a woman was one in the eye for male domination.",
                        "vi": "Việc bổ nhiệm một người phụ nữ là một trong những con mắt cho sự thống trị của nam giới."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be in love with only one particular person",
                    "vi": "chỉ yêu một người cụ thể"
                },
                "examples": [
                    {
                        "en": "He's only ever had eyes for his wife.",
                        "vi": "Anh ấy là người duy nhất để mắt đến vợ mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to realize or make somebody realize the truth about something",
                    "vi": "để nhận ra hoặc làm cho ai đó nhận ra sự thật về điều gì đó"
                },
                "examples": [
                    {
                        "en": "Travelling really opens your eyes to other cultures.",
                        "vi": "Đi du lịch thực sự giúp bạn mở rộng tầm mắt với các nền văn hóa khác."
                    }
                ]
            },
            {
                "define": {
                    "en": "to be very attractive to look at",
                    "vi": "rất hấp dẫn để nhìn vào"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to hide your real actions or intentions from somebody by making them believe something that is not true",
                    "vi": "che giấu hành động hoặc ý định thực sự của bạn với ai đó bằng cách khiến họ tin điều gì đó không đúng sự thật"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to think about or see something the way that another person sees it",
                    "vi": "để nghĩ về hoặc nhìn thấy điều gì đó theo cách mà người khác nhìn thấy nó"
                },
                "examples": [
                    {
                        "en": "Try looking at it through her eyes for a change.",
                        "vi": "Hãy thử nhìn nó qua đôi mắt của cô ấy để biết sự thay đổi."
                    },
                    {
                        "en": "Events are seen through the eyes of a Polish refugee.",
                        "vi": "Các sự kiện được nhìn qua con mắt của một người tị nạn Ba Lan."
                    }
                ]
            },
            {
                "define": {
                    "en": "to see something by accident or not very clearly because you see it from the side of your eye and are not looking straight at it",
                    "vi": "nhìn thấy vật gì đó một cách tình cờ hoặc không rõ ràng lắm vì bạn nhìn thấy vật đó từ phía bên mắt mình và không nhìn thẳng vào vật đó"
                },
                "examples": [
                    {
                        "en": "Out of the corner of her eye, she saw him coming closer.",
                        "vi": "Qua khóe mắt, cô thấy anh đang tiến lại gần."
                    }
                ]
            },
            {
                "define": {
                    "en": "to pretend that you have not noticed something so that you do not have to deal with it",
                    "vi": "giả vờ rằng bạn không nhận thấy điều gì đó để bạn không phải đối phó với nó"
                },
                "examples": [
                    {
                        "en": "You can't just close your eyes to his violence.",
                        "vi": "Bạn không thể chỉ nhắm mắt làm ngơ trước sự bạo hành của anh ta."
                    },
                    {
                        "en": "They seem intent on shutting their eyes to the problems of pollution.",
                        "vi": "Họ dường như có ý định nhắm mắt vào các vấn đề ô nhiễm."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person or thing that you are pleased to see; something that is very pleasant to look at",
                    "vi": "một người hoặc một điều mà bạn hài lòng khi nhìn thấy; một cái gì đó rất dễ chịu khi nhìn vào"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to stop giving your attention to what is most important",
                    "vi": "ngừng chú ý đến điều quan trọng nhất"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a person or thing is more complicated or interesting than you might think at first",
                    "vi": "một người hoặc một sự vật phức tạp hoặc thú vị hơn bạn có thể nghĩ lúc đầu"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to pretend not to notice something bad that is happening, so you do not have to do anything about it",
                    "vi": "giả vờ không nhận thấy điều gì đó tồi tệ đang xảy ra, vì vậy bạn không phải làm bất cứ điều gì về nó"
                },
                "examples": [
                    {
                        "en": "The authorities were either unaware of the problem or they turned a blind eye to it.",
                        "vi": "Các nhà chức trách hoặc là không biết về vấn đề này hoặc họ đã làm ngơ."
                    }
                ]
            },
            {
                "define": {
                    "en": "being watched carefully by somebody",
                    "vi": "được ai đó theo dõi cẩn thận"
                },
                "examples": [
                    {
                        "en": "The children played under the watchful eye of their father.",
                        "vi": "Những đứa trẻ chơi đùa dưới sự giám sát của cha chúng."
                    },
                    {
                        "en": "I want you under my eye.",
                        "vi": "Tôi muốn bạn dưới con mắt của tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "if a person does not know about something that they would normally think was bad, then it cannot hurt them",
                    "vi": "nếu một người không biết về điều gì đó mà họ thường nghĩ là tồi tệ, thì điều đó không thể làm tổn thương họ"
                },
                "examples": [
                    {
                        "en": "What does it matter if I use his flat while he’s away? What the eye doesn’t see…!",
                        "vi": "Có vấn đề gì nếu tôi sử dụng căn hộ của anh ấy khi anh ấy đi vắng? Những gì mắt không thấy…!"
                    }
                ]
            },
            {
                "define": {
                    "en": "with the hope of using a particular situation in order to gain some advantage for yourself",
                    "vi": "với hy vọng sử dụng một tình huống cụ thể để đạt được một số lợi thế cho bản thân"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "fully aware of the possible problems or results of a particular course of action",
                    "vi": "nhận thức đầy đủ về các vấn đề có thể xảy ra hoặc kết quả của một quá trình hành động cụ thể"
                },
                "examples": [
                    {
                        "en": "I went into this with my eyes open so I guess I only have myself to blame.",
                        "vi": "Tôi đã mở to mắt nhìn vào chuyện này nên tôi đoán rằng tôi chỉ có lỗi với bản thân."
                    }
                ]
            },
            {
                "define": {
                    "en": "very easily, without thinking about it",
                    "vi": "rất dễ dàng, không cần suy nghĩ về nó"
                },
                "examples": [
                    {
                        "en": "I've made this trip so often, I could do it with my eyes shut.",
                        "vi": "Tôi đã thực hiện chuyến đi này thường xuyên, tôi có thể làm điều đó với đôi mắt của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "with the intention of doing something",
                    "vi": "với ý định làm một cái gì đó"
                },
                "examples": [
                    {
                        "en": "He bought the warehouse with an eye to converting it into a hotel.",
                        "vi": "Anh ta mua nhà kho với mục đích chuyển nó thành khách sạn."
                    }
                ]
            }
        ]
    },
    {
        "id": "99c747d5184d460594ce668242fe927d",
        "word": "first responder",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌfɜːst rɪˈspɒndə(r)/",
            "us": "/ˌfɜːrst rɪˈspɑːndər/"
        },
        "nearby": [
            {
                "word": "first reading",
                "pos": "noun"
            },
            {
                "word": "first refusal",
                "pos": "noun"
            },
            {
                "word": "first responder",
                "pos": "noun"
            },
            {
                "word": "first school",
                "pos": "noun"
            },
            {
                "word": "first sergeant",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person such as a member of the police or fire department in a position to arrive first at an emergency, who has been trained to give basic medical treatment",
                    "vi": "một người chẳng hạn như thành viên của cảnh sát hoặc sở cứu hỏa ở vị trí đến đầu tiên trong trường hợp khẩn cấp, người đã được đào tạo để điều trị y tế cơ bản"
                },
                "examples": [
                    {
                        "en": "first responder training",
                        "vi": "đào tạo người trả lời đầu tiên"
                    },
                    {
                        "en": "citizen/community first responders (= members of the public who have had special training for emergencies)",
                        "vi": "người phản ứng đầu tiên của công dân / cộng đồng (= các thành viên của công chúng đã được đào tạo đặc biệt cho các trường hợp khẩn cấp)"
                    }
                ]
            }
        ]
    },
    {
        "id": "642831b9c9ca4603880b9e39207340c7",
        "word": "flash flood",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌflæʃ ˈflʌd/",
            "us": "/ˌflæʃ ˈflʌd/"
        },
        "nearby": [
            {
                "word": "flash drive",
                "pos": "noun"
            },
            {
                "word": "flasher",
                "pos": "noun"
            },
            {
                "word": "flash flood",
                "pos": "noun"
            },
            {
                "word": "flash-forward",
                "pos": "noun"
            },
            {
                "word": "flashgun",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a sudden flood of water caused by heavy rain",
                    "vi": "một trận lũ lụt đột ngột do mưa lớn gây ra"
                },
                "examples": [
                    {
                        "en": "More than 80 people were feared dead last night after flash floods, the worst in 34 years.",
                        "vi": "Hơn 80 người đã thiệt mạng đêm qua sau trận lũ quét, trận lũ tồi tệ nhất trong 34 năm."
                    }
                ]
            }
        ]
    },
    {
        "id": "dfa9cc5e3a184783bafd5dcd68d4c7d5",
        "word": "focus",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈfəʊkəs/",
            "us": "/ˈfəʊkəs/"
        },
        "nearby": [
            {
                "word": "fo'c'sle",
                "pos": "noun"
            },
            {
                "word": "focus",
                "pos": "verb"
            },
            {
                "word": "focus",
                "pos": "noun"
            },
            {
                "word": "focused",
                "pos": "adjective"
            },
            {
                "word": "focus group",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the thing or person that people are most interested in; the act of paying special attention to something and making people interested in it",
                    "vi": "điều hoặc người mà mọi người quan tâm nhất; hành động đặc biệt chú ý đến một cái gì đó và làm cho mọi người quan tâm đến nó"
                },
                "examples": [
                    {
                        "en": "focus of something It was the main focus of attention at the meeting.",
                        "vi": "trọng tâm của cái gì Đó là trọng tâm chính của sự chú ý tại cuộc họp."
                    },
                    {
                        "en": "The primary focus of the book is practical teaching techniques.",
                        "vi": "Trọng tâm chính của cuốn sách là các kỹ thuật giảng dạy thực tế."
                    },
                    {
                        "en": "He decided to make colour the central focus of his work.",
                        "vi": "Anh quyết định lấy màu sắc làm trọng tâm trong công việc của mình."
                    },
                    {
                        "en": "focus for something His comments provided a focus for debate.",
                        "vi": "tập trung cho một cái gì đó Bình luận của anh ấy cung cấp một tiêu điểm cho cuộc tranh luận."
                    },
                    {
                        "en": "focus on something We shall maintain our focus on the needs of the customer.",
                        "vi": "tập trung vào điều gì đó Chúng tôi sẽ duy trì sự tập trung vào nhu cầu của khách hàng."
                    },
                    {
                        "en": "In today's lecture the focus will be on tax structures within the European Union.",
                        "vi": "Trong bài giảng hôm nay, trọng tâm sẽ là các cấu trúc thuế trong Liên minh Châu Âu."
                    },
                    {
                        "en": "The incident brought the problem of violence in schools into sharp focus.",
                        "vi": "Vụ việc khiến vấn nạn bạo lực trong trường học trở thành tâm điểm."
                    },
                    {
                        "en": "The film loses focus near the end.",
                        "vi": "Phim mất nét ở gần cuối."
                    },
                    {
                        "en": "He began to shift his focus towards writing for the theatre.",
                        "vi": "Anh bắt đầu chuyển hướng tập trung sang viết cho nhà hát."
                    },
                    {
                        "en": "What we need now is a change of focus (= to look at things in a different way).",
                        "vi": "Điều chúng ta cần bây giờ là thay đổi trọng tâm (= nhìn mọi thứ theo một cách khác)."
                    }
                ]
            },
            {
                "define": {
                    "en": "a point or distance at which the outline of an object is clearly seen by the eye or through a lens",
                    "vi": "một điểm hoặc khoảng cách mà tại đó mắt hoặc qua thấu kính có thể nhìn rõ đường viền của một vật thể"
                },
                "examples": [
                    {
                        "en": "out of focus Some parts of the photograph are out of focus (= blurred rather than clearly seen).",
                        "vi": "out nét Một số phần của ảnh bị mất nét (= bị mờ hơn là nhìn rõ)."
                    },
                    {
                        "en": "into focus When I got glasses, suddenly the whole world came into focus.",
                        "vi": "vào tiêu điểm Khi tôi đeo kính, đột nhiên cả thế giới đều tập trung vào."
                    },
                    {
                        "en": "in focus The binoculars were not in focus (= were not showing things clearly).",
                        "vi": "trong tiêu điểm Ống nhòm không được lấy nét (= không hiển thị rõ ràng mọi thứ)."
                    },
                    {
                        "en": "Her eyes lost focus and she fainted.",
                        "vi": "Đôi mắt cô ấy mất tập trung và cô ấy ngất đi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a point at which waves of light, sound, etc. meet after reflection or refraction; the point from which waves of light, sound, etc. seem to come",
                    "vi": "điểm mà các sóng ánh sáng, âm thanh, v.v ... gặp nhau sau khi phản xạ hoặc khúc xạ; điểm mà từ đó các làn sóng ánh sáng, âm thanh, v.v. dường như đến"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "the point at which an earthquake starts to happen",
                    "vi": "thời điểm mà một trận động đất bắt đầu xảy ra"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "35da7bd3809e43aaba649d6dcb99fed0",
        "word": "magnitude",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmæɡnɪtjuːd/",
            "us": "/ˈmæɡnɪtuːd/"
        },
        "nearby": [
            {
                "word": "magnify",
                "pos": "verb"
            },
            {
                "word": "magnifying glass",
                "pos": "noun"
            },
            {
                "word": "magnitude",
                "pos": "noun"
            },
            {
                "word": "magnolia",
                "pos": "noun"
            },
            {
                "word": "magnum",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the great size or importance of something; the degree to which something is large or important",
                    "vi": "kích thước lớn hoặc tầm quan trọng của một cái gì đó; mức độ mà một cái gì đó lớn hoặc quan trọng"
                },
                "examples": [
                    {
                        "en": "We did not realize the magnitude of the problem.",
                        "vi": "Chúng tôi đã không nhận ra tầm quan trọng của vấn đề."
                    },
                    {
                        "en": "a discovery of the first magnitude",
                        "vi": "một khám phá về độ lớn đầu tiên"
                    }
                ]
            },
            {
                "define": {
                    "en": "the degree to which a star is bright",
                    "vi": "mức độ mà một ngôi sao sáng"
                },
                "examples": [
                    {
                        "en": "The star varies in brightness by about three magnitudes.",
                        "vi": "Ngôi sao thay đổi độ sáng khoảng ba độ richter."
                    },
                    {
                        "en": "Stars of the first magnitude are visible to the naked eye.",
                        "vi": "Những ngôi sao có độ lớn thứ nhất có thể nhìn thấy bằng mắt thường."
                    }
                ]
            },
            {
                "define": {
                    "en": "the size of an earthquake",
                    "vi": "kích thước của một trận động đất"
                },
                "examples": [
                    {
                        "en": "The quake reached a magnitude of 7.1 on the Richter scale.",
                        "vi": "Trận động đất đạt cường độ 7,1 độ Richter."
                    }
                ]
            }
        ]
    },
    {
        "id": "0633198b2f344773bd9bc0e02df2206a",
        "word": "reservist",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/rɪˈzɜːvɪst/",
            "us": "/rɪˈzɜːrvɪst/"
        },
        "nearby": [
            {
                "word": "reserved",
                "pos": "adjective"
            },
            {
                "word": "reserved word",
                "pos": "noun"
            },
            {
                "word": "reservist",
                "pos": "noun"
            },
            {
                "word": "reservoir",
                "pos": "noun"
            },
            {
                "word": "reset",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a soldier, etc. who is a member of the reserves (= a military force that can be used in an emergency)",
                    "vi": "một người lính, v.v. là thành viên của lực lượng dự bị (= lực lượng quân đội có thể được sử dụng trong trường hợp khẩn cấp)"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "5d6af299ba9145d3b9144ce39fe2da15",
        "word": "salvage",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsælvɪdʒ/",
            "us": "/ˈsælvɪdʒ/"
        },
        "nearby": [
            {
                "word": "salute",
                "pos": "noun"
            },
            {
                "word": "Salvadoran",
                "pos": "noun, adjective"
            },
            {
                "word": "salvage",
                "pos": "noun"
            },
            {
                "word": "salvage",
                "pos": "verb"
            },
            {
                "word": "salvage yard",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act of saving things that have been, or are likely to be, damaged or lost, especially in a disaster or an accident",
                    "vi": "hành động cứu những thứ đã, hoặc có khả năng bị hư hỏng hoặc mất mát, đặc biệt là trong một thảm họa hoặc tai nạn"
                },
                "examples": [
                    {
                        "en": "the salvage of the wrecked tanker",
                        "vi": "trục vớt tàu chở dầu bị đắm"
                    },
                    {
                        "en": "a salvage company/operation/team",
                        "vi": "một công ty / hoạt động / đội cứu hộ"
                    }
                ]
            },
            {
                "define": {
                    "en": "the things that are saved from a disaster or an accident",
                    "vi": "những thứ được cứu khỏi thảm họa hoặc tai nạn"
                },
                "examples": [
                    {
                        "en": "an exhibition of the salvage from the wreck",
                        "vi": "một cuộc triển lãm về việc trục vớt từ xác tàu"
                    }
                ]
            }
        ]
    },
    {
        "id": "b30b313617514c17b69963fd1d34ba09",
        "word": "seaquake",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsiːkweɪk/",
            "us": "/ˈsiːkweɪk/"
        },
        "nearby": [
            {
                "word": "sea power",
                "pos": "noun"
            },
            {
                "word": "SEAQ",
                "pos": ""
            },
            {
                "word": "seaquake",
                "pos": "noun"
            },
            {
                "word": "sear",
                "pos": "verb"
            },
            {
                "word": "search",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a sudden powerful movement of the sea, caused by an earthquake or by volcanic activity under the sea",
                    "vi": "một chuyển động mạnh đột ngột của biển, do động đất hoặc do hoạt động núi lửa dưới biển"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "7d093c7f09424472951532067c27b724",
        "word": "shelter in place",
        "pos": "idiom",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈʃeltə(r)/",
            "us": "/ˈʃeltər/"
        },
        "nearby": [
            {
                "word": "shell suit",
                "pos": "noun"
            },
            {
                "word": "shelter",
                "pos": "noun"
            },
            {
                "word": "shelter",
                "pos": "verb"
            },
            {
                "word": "Shelter",
                "pos": ""
            },
            {
                "word": "sheltered",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to give somebody/something a place where they are protected from the weather or from danger; to protect somebody/something",
                    "vi": "để cung cấp cho ai đó / cái gì đó một nơi mà họ được bảo vệ khỏi thời tiết hoặc khỏi nguy hiểm; để bảo vệ ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "shelter somebody/something from somebody/something Trees shelter the house from the wind.",
                        "vi": "che chở cho ai đó / cái gì đó khỏi ai đó / cái gì đó Cây che nhà khỏi gió."
                    },
                    {
                        "en": "shelter somebody/something helping the poor and sheltering the homeless",
                        "vi": "che chở ai đó / điều gì đó giúp đỡ người nghèo và che chở cho người vô gia cư"
                    },
                    {
                        "en": "The American government has accused them of sheltering terrorists.",
                        "vi": "Chính phủ Mỹ đã cáo buộc họ che chở cho những kẻ khủng bố."
                    },
                    {
                        "en": "Perhaps I sheltered my daughter too much (= protected her too much from unpleasant or difficult experiences).",
                        "vi": "Có lẽ tôi đã che chở cho con gái mình quá nhiều (= đã bảo vệ cô ấy quá nhiều khỏi những trải nghiệm khó chịu hoặc khó khăn)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to stay in a place that protects you from the weather or from danger",
                    "vi": "ở một nơi bảo vệ bạn khỏi thời tiết hoặc khỏi nguy hiểm"
                },
                "examples": [
                    {
                        "en": "A bomb fell on the building, killing those who were sheltering inside.",
                        "vi": "Một quả bom đã rơi xuống tòa nhà, giết chết những người đang trú ẩn bên trong."
                    },
                    {
                        "en": "shelter from something We sheltered from the rain in a doorway.",
                        "vi": "trú ẩn từ một cái gì đó Chúng tôi đã che mưa trong một ngưỡng cửa."
                    },
                    {
                        "en": "Spectators sheltered under umbrellas as the rain got heavier.",
                        "vi": "Khán giả trú dưới ô che khi mưa lớn hơn."
                    },
                    {
                        "en": "As the storm approached, they tried to find somewhere to shelter.",
                        "vi": "Khi cơn bão đến gần, họ cố gắng tìm một nơi nào đó để trú ẩn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to stay indoors during an emergency in order to protect yourself and others",
                    "vi": "ở trong nhà trong trường hợp khẩn cấp để bảo vệ bản thân và những người khác"
                },
                "examples": [
                    {
                        "en": "Residents of the city have been ordered to shelter in place for at least the next three weeks.",
                        "vi": "Cư dân của thành phố đã được lệnh phải tạm trú tại chỗ trong ít nhất ba tuần tới."
                    }
                ]
            }
        ]
    },
    {
        "id": "23344bb5dedb44358c0889151cc45d67",
        "word": "temblor",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈtemblə(r)/",
            "us": "/ˈtemblər/"
        },
        "nearby": [
            {
                "word": "Telugu",
                "pos": "noun"
            },
            {
                "word": "temazepam",
                "pos": "noun"
            },
            {
                "word": "temblor",
                "pos": "noun"
            },
            {
                "word": "temerity",
                "pos": "noun"
            },
            {
                "word": "temp",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an earthquake (= a sudden, violent shaking of the earth’s surface)",
                    "vi": "một trận động đất (= sự rung chuyển đột ngột, dữ dội của bề mặt trái đất)"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "3891ba1279b54efe8b2a90c8d038f607",
        "word": "tremor",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈtremə(r)/",
            "us": "/ˈtremər/"
        },
        "nearby": [
            {
                "word": "tremendously",
                "pos": "adverb"
            },
            {
                "word": "tremolo",
                "pos": "noun"
            },
            {
                "word": "tremor",
                "pos": "noun"
            },
            {
                "word": "tremulous",
                "pos": "adjective"
            },
            {
                "word": "tremulously",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a small earthquake in which the ground shakes slightly",
                    "vi": "một trận động đất nhỏ trong đó mặt đất rung chuyển nhẹ"
                },
                "examples": [
                    {
                        "en": "an earth tremor",
                        "vi": "chấn động trái đất"
                    },
                    {
                        "en": "(figurative) The scandal sent tremors through the political establishment.",
                        "vi": "(nghĩa bóng) Vụ bê bối gây chấn động khắp cơ sở chính trị."
                    }
                ]
            },
            {
                "define": {
                    "en": "a slight shaking movement in a part of your body caused, for example, by cold or fear",
                    "vi": "một chuyển động rung lắc nhẹ ở một phần cơ thể của bạn, chẳng hạn như do lạnh hoặc sợ hãi"
                },
                "examples": [
                    {
                        "en": "There was a slight tremor in his voice.",
                        "vi": "Có một chút run rẩy trong giọng nói của anh ta."
                    },
                    {
                        "en": "She felt a tremor of fear run through her.",
                        "vi": "Cô cảm thấy sợ hãi run lên trong mình."
                    }
                ]
            }
        ]
    },
    {
        "id": "08d96386d6434ab0a0b8a22310ecc601",
        "word": "twister",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈtwɪstə(r)/",
            "us": "/ˈtwɪstər/"
        },
        "nearby": [
            {
                "word": "twist",
                "pos": "noun"
            },
            {
                "word": "twisted",
                "pos": "adjective"
            },
            {
                "word": "twister",
                "pos": "noun"
            },
            {
                "word": "twist off",
                "pos": "phrasal verb"
            },
            {
                "word": "twist tie",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a violent storm with very strong winds that move in circles",
                    "vi": "một cơn bão dữ dội với gió rất mạnh di chuyển theo vòng tròn"
                },
                "examples": [
                    {
                        "en": "The twister, reported to be about 100 yards wide, caused major damage to the high school.",
                        "vi": "Đoạn đường xoắn, được cho là rộng khoảng 100 mét, đã gây ra thiệt hại lớn cho trường trung học."
                    }
                ]
            }
        ]
    },
    {
        "id": "df1f2aa0a8f643adad9546e6eebd9900",
        "word": "waterspout",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈwɔːtəspaʊt/",
            "us": "/ˈwɔːtərspaʊt/"
        },
        "nearby": [
            {
                "word": "water-soluble",
                "pos": "adjective"
            },
            {
                "word": "water sports",
                "pos": "noun"
            },
            {
                "word": "waterspout",
                "pos": "noun"
            },
            {
                "word": "Waterstones",
                "pos": ""
            },
            {
                "word": "water strider",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a column of water that is pulled up from the sea during a storm by a column of air that turns round and round rapidly",
                    "vi": "một cột nước được kéo lên từ biển trong cơn bão bởi một cột không khí quay tròn nhanh chóng"
                },
                "examples": []
            }
        ]
    }
]