[
    {
        "id": "7f141afd753b4d0081ecfadeea0f6d14",
        "word": "photoshop",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈfəʊtəʊʃɒp/",
            "us": "/ˈfəʊtəʊʃɑːp/"
        },
        "nearby": [
            {
                "word": "photosensitive",
                "pos": "adjective"
            },
            {
                "word": "photo shoot",
                "pos": "noun"
            },
            {
                "word": "photoshop",
                "pos": "verb"
            },
            {
                "word": "photostat",
                "pos": "noun"
            },
            {
                "word": "photosynthesis",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to change a picture or photograph using computer software",
                    "vi": "để thay đổi hình ảnh hoặc ảnh chụp bằng phần mềm máy tính"
                },
                "examples": [
                    {
                        "en": "I'm sure this picture has been photoshopped.",
                        "vi": "Tôi chắc rằng bức tranh này đã được chỉnh sửa."
                    },
                    {
                        "en": "It is so Photoshopped it doesn’t even look like her.",
                        "vi": "Nó đến nỗi Photoshopped nó thậm chí còn không giống cô ấy."
                    }
                ]
            }
        ]
    },
    {
        "id": "f1afd43cada2405192fd86f0071b4ef0",
        "word": "pointer",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpɔɪntə(r)/",
            "us": "/ˈpɔɪntər/"
        },
        "nearby": [
            {
                "word": "pointed",
                "pos": "adjective"
            },
            {
                "word": "pointedly",
                "pos": "adverb"
            },
            {
                "word": "pointer",
                "pos": "noun"
            },
            {
                "word": "pointer finger",
                "pos": "noun"
            },
            {
                "word": "point guard",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a piece of advice",
                    "vi": "một lời khuyên"
                },
                "examples": [
                    {
                        "en": "Here are some pointers on how to go about the writing task.",
                        "vi": "Dưới đây là một số gợi ý về cách thực hiện nhiệm vụ viết."
                    }
                ]
            },
            {
                "define": {
                    "en": "a sign that something exists; a sign that shows how something may develop in the future",
                    "vi": "một dấu hiệu cho thấy một cái gì đó tồn tại; một dấu hiệu cho thấy một cái gì đó có thể phát triển như thế nào trong tương lai"
                },
                "examples": [
                    {
                        "en": "The surge in car sales was regarded as an encouraging pointer to an improvement in the economy.",
                        "vi": "Doanh số bán xe hơi tăng vọt được coi là một dấu hiệu khích lệ cho sự cải thiện của nền kinh tế."
                    },
                    {
                        "en": "His symptoms gave no obvious pointer to a possible diagnosis.",
                        "vi": "Các triệu chứng của anh ấy không đưa ra dấu hiệu rõ ràng nào cho một chẩn đoán có thể xảy ra."
                    }
                ]
            },
            {
                "define": {
                    "en": "a thin piece of metal that points to the numbers on a dial on a piece of equipment for measuring something",
                    "vi": "một miếng kim loại mỏng chỉ vào các số trên mặt đồng hồ trên một thiết bị để đo thứ gì đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a stick used to point to things on a map or picture on a wall",
                    "vi": "một cây gậy được sử dụng để chỉ vào những thứ trên bản đồ hoặc hình ảnh trên tường"
                },
                "examples": [
                    {
                        "en": "She used a laser pointer during her presentation.",
                        "vi": "Cô ấy đã sử dụng một con trỏ laser trong bài thuyết trình của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "a small symbol, for example an arrow, that marks a point on a computer screen",
                    "vi": "một biểu tượng nhỏ, ví dụ như một mũi tên, đánh dấu một điểm trên màn hình máy tính"
                },
                "examples": [
                    {
                        "en": "Move the mouse pointer to the menu bar.",
                        "vi": "Di chuyển con trỏ chuột đến thanh menu."
                    }
                ]
            },
            {
                "define": {
                    "en": "a large dog used in hunting, trained to stand still with its nose pointing towards the birds that are being hunted",
                    "vi": "một con chó lớn được sử dụng để săn bắn, được huấn luyện để đứng yên, mũi hướng về phía những con chim đang bị săn đuổi"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "b73bfda62e874ee2a0ddadc1b40c73c8",
        "word": "portrait",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpɔːtreɪt/",
            "us": "/ˈpɔːrtrət/"
        },
        "nearby": [
            {
                "word": "the Port of London Authority",
                "pos": ""
            },
            {
                "word": "Porton Down",
                "pos": ""
            },
            {
                "word": "portrait",
                "pos": "noun"
            },
            {
                "word": "portraitist",
                "pos": "noun"
            },
            {
                "word": "portraiture",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a painting, drawing or photograph of a person, especially of the head and shoulders",
                    "vi": "một bức tranh, bản vẽ hoặc ảnh của một người, đặc biệt là đầu và vai"
                },
                "examples": [
                    {
                        "en": "portrait of somebody a portrait of his wife",
                        "vi": "chân dung của ai đó chân dung của vợ anh ta"
                    },
                    {
                        "en": "a full-length portrait",
                        "vi": "một bức chân dung dài đầy đủ"
                    },
                    {
                        "en": "He had his portrait painted in uniform.",
                        "vi": "Anh ấy đã vẽ chân dung của mình trong bộ đồng phục."
                    },
                    {
                        "en": "a portrait painter",
                        "vi": "một họa sĩ chân dung"
                    }
                ]
            },
            {
                "define": {
                    "en": "a detailed description of somebody/something",
                    "vi": "mô tả chi tiết về ai đó / cái gì đó"
                },
                "examples": [
                    {
                        "en": "portrait of somebody/something a portrait of life at the French court",
                        "vi": "chân dung của ai đó / cái gì đó là chân dung cuộc sống tại tòa án Pháp"
                    },
                    {
                        "en": "The film paints a portrait of a man consumed with jealousy.",
                        "vi": "Bộ phim vẽ nên bức chân dung của một người đàn ông luôn ghen tị."
                    }
                ]
            },
            {
                "define": {
                    "en": "the way of printing a document in which the top of the page is one of the shorter sides",
                    "vi": "cách in tài liệu trong đó đầu trang là một trong các cạnh ngắn hơn"
                },
                "examples": [
                    {
                        "en": "You can print landscape and portrait pages in the same document.",
                        "vi": "Bạn có thể in các trang ngang và dọc trong cùng một tài liệu."
                    }
                ]
            }
        ]
    },
    {
        "id": "5a812273117c4ad3baed2fb4c80cdd81",
        "word": "power user",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpaʊə juːzə(r)/",
            "us": "/ˈpaʊər juːzər/"
        },
        "nearby": [
            {
                "word": "power up",
                "pos": "phrasal verb"
            },
            {
                "word": "power-up",
                "pos": "noun"
            },
            {
                "word": "power user",
                "pos": "noun"
            },
            {
                "word": "power walking",
                "pos": "noun"
            },
            {
                "word": "Powhatan",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who can use the more advanced features of computer software",
                    "vi": "một người có thể sử dụng các tính năng nâng cao hơn của phần mềm máy tính"
                },
                "examples": [
                    {
                        "en": "This new processor is aimed at the power user.",
                        "vi": "Bộ vi xử lý mới này hướng đến người dùng thành thạo."
                    }
                ]
            }
        ]
    },
    {
        "id": "efcc36d4497142c29c2f7c480b20b5ff",
        "word": "prompt",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/prɒmpt/",
            "us": "/prɑːmpt/"
        },
        "nearby": [
            {
                "word": "prompt",
                "pos": "verb"
            },
            {
                "word": "prompt",
                "pos": "adjective"
            },
            {
                "word": "prompt",
                "pos": "noun"
            },
            {
                "word": "prompt",
                "pos": "adverb"
            },
            {
                "word": "prompter",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a word or words said to an actor, to remind them what to say next when they have forgotten",
                    "vi": "một từ hoặc những từ đã nói với một diễn viên, để nhắc họ phải nói gì tiếp theo khi họ đã quên"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a sign on a computer screen that shows that the computer has finished doing something and is ready for more instructions",
                    "vi": "một dấu hiệu trên màn hình máy tính cho thấy rằng máy tính đã hoàn thành việc gì đó và sẵn sàng để được hướng dẫn thêm"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "30b39e14e7da4b478858c9c7fcf196a9",
        "word": "reboot",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌriːˈbuːt/",
            "us": "/ˌriːˈbuːt/"
        },
        "nearby": [
            {
                "word": "rebirthing",
                "pos": "noun"
            },
            {
                "word": "reboot",
                "pos": "noun"
            },
            {
                "word": "reboot",
                "pos": "verb"
            },
            {
                "word": "reborn",
                "pos": "verb"
            },
            {
                "word": "reborn",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "if you reboot a computer or it reboots, you switch it off and then start it again immediately",
                    "vi": "nếu bạn khởi động lại một máy tính hoặc nó khởi động lại, bạn tắt nó đi và sau đó khởi động lại ngay lập tức"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to make something, especially a series of films or TV programmes, start again or become successful again",
                    "vi": "để làm cho điều gì đó, đặc biệt là một loạt phim hoặc chương trình truyền hình, bắt đầu lại hoặc trở nên thành công"
                },
                "examples": [
                    {
                        "en": "This film is the producer's second attempt to reboot the franchise.",
                        "vi": "Bộ phim này là nỗ lực thứ hai của nhà sản xuất để khởi động lại nhượng quyền thương mại."
                    },
                    {
                        "en": "The government is desperately trying to reboot the country's economy.",
                        "vi": "Chính phủ đang nỗ lực hết sức để khởi động lại nền kinh tế của đất nước."
                    },
                    {
                        "en": "The talented boxer is trying to reboot his career following his recovery from injury.",
                        "vi": "Võ sĩ tài năng đang cố gắng khởi động lại sự nghiệp sau khi bình phục chấn thương."
                    }
                ]
            }
        ]
    },
    {
        "id": "298a4de3151c425d8b0c4ba6c63accb5",
        "word": "reload",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌriːˈləʊd/",
            "us": "/ˌriːˈləʊd/"
        },
        "nearby": [
            {
                "word": "relive",
                "pos": "verb"
            },
            {
                "word": "rellie",
                "pos": "noun"
            },
            {
                "word": "reload",
                "pos": "verb"
            },
            {
                "word": "relocate",
                "pos": "verb"
            },
            {
                "word": "relocation",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to put more bullets into a gun, more film into a camera, etc.",
                    "vi": "để lắp nhiều đạn hơn vào súng, nhiều phim hơn vào máy ảnh, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to put data or a program into the memory of a computer again",
                    "vi": "để đưa lại dữ liệu hoặc chương trình vào bộ nhớ của máy tính"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to fill a container, vehicle, machine, etc. again",
                    "vi": "để lấp đầy lại thùng chứa, xe cộ, máy móc, v.v."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "bd82d145842e4114bd7367037facaefe",
        "word": "resize",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌriːˈsaɪz/",
            "us": "/ˌriːˈsaɪz/"
        },
        "nearby": [
            {
                "word": "resit",
                "pos": "noun"
            },
            {
                "word": "resit",
                "pos": "verb"
            },
            {
                "word": "resize",
                "pos": "verb"
            },
            {
                "word": "reskill",
                "pos": "verb"
            },
            {
                "word": "resolute",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to make something bigger or smaller, especially an image on a computer screen",
                    "vi": "để làm cho thứ gì đó lớn hơn hoặc nhỏ hơn, đặc biệt là một hình ảnh trên màn hình máy tính"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "261b3e1f766c4ff48abc19a49319008f",
        "word": "rip",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/rɪp/",
            "us": "/rɪp/"
        },
        "nearby": [
            {
                "word": "riot police",
                "pos": "noun"
            },
            {
                "word": "riot shield",
                "pos": "noun"
            },
            {
                "word": "rip",
                "pos": "verb"
            },
            {
                "word": "rip",
                "pos": "noun"
            },
            {
                "word": "RIP",
                "pos": "abbreviation"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to tear something or to become torn, often suddenly or violently",
                    "vi": "xé một thứ gì đó hoặc trở nên rách nát, thường đột ngột hoặc dữ dội"
                },
                "examples": [
                    {
                        "en": "rip (something) I ripped my jeans on the fence.",
                        "vi": "rip (cái gì đó) Tôi xé quần jean của mình trên hàng rào."
                    },
                    {
                        "en": "The flags had been ripped in two.",
                        "vi": "Các lá cờ đã bị xé làm đôi."
                    },
                    {
                        "en": "The nail ripped a hole in my jacket.",
                        "vi": "Chiếc đinh đã làm thủng một lỗ trên áo khoác của tôi."
                    },
                    {
                        "en": "I heard the tent rip.",
                        "vi": "Tôi nghe thấy tiếng xé lều."
                    },
                    {
                        "en": "rip something + adj. She ripped the letter open.",
                        "vi": "xé toạc cái gì đó + adj. Cô xé toạc lá thư."
                    }
                ]
            },
            {
                "define": {
                    "en": "to remove something quickly or violently, often by pulling it",
                    "vi": "để loại bỏ một thứ gì đó nhanh chóng hoặc thô bạo, thường bằng cách kéo nó"
                },
                "examples": [
                    {
                        "en": "He ripped off his tie.",
                        "vi": "Anh ta xé toạc chiếc cà vạt của mình."
                    },
                    {
                        "en": "The carpet had been ripped from the stairs.",
                        "vi": "Tấm thảm đã bị xé toạc từ cầu thang."
                    },
                    {
                        "en": "Half of the house was ripped away in the explosion.",
                        "vi": "Một nửa ngôi nhà đã bị xé toạc trong vụ nổ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to copy sound or video files from a website or CD on to a computer",
                    "vi": "để sao chép các tệp âm thanh hoặc video từ một trang web hoặc đĩa CD vào máy tính"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to change text or images into a form in which they can be displayed on a screen or printed",
                    "vi": "để thay đổi văn bản hoặc hình ảnh thành một biểu mẫu mà chúng có thể được hiển thị trên màn hình hoặc in"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to go or allow something such as a car to go as fast as possible",
                    "vi": "để đi hoặc cho phép một cái gì đó chẳng hạn như ô tô đi nhanh nhất có thể"
                },
                "examples": [
                    {
                        "en": "Once on the open road, he let rip.",
                        "vi": "Một khi trên con đường rộng mở, anh ta để xé toạc."
                    },
                    {
                        "en": "Come on Steve—let her rip.",
                        "vi": "Cố lên Steve - để cô ấy xé xác."
                    }
                ]
            },
            {
                "define": {
                    "en": "to do something or to allow something to happen as fast as possible",
                    "vi": "để làm điều gì đó hoặc cho phép điều gì đó xảy ra nhanh nhất có thể"
                },
                "examples": [
                    {
                        "en": "This would cause inflation to let rip again.",
                        "vi": "Điều này sẽ khiến lạm phát bùng phát trở lại."
                    }
                ]
            },
            {
                "define": {
                    "en": "to speak or do something with great force, enthusiasm, etc. and without control",
                    "vi": "nói hoặc làm điều gì đó với sức lực lớn, sự nhiệt tình, v.v. và không có sự kiểm soát"
                },
                "examples": [
                    {
                        "en": "When she gets angry with her boyfriend, she really lets rip at him.",
                        "vi": "Khi cô ấy tức giận với bạn trai của mình, cô ấy thực sự để xé toạc anh ấy."
                    },
                    {
                        "en": "The group let rip with a single from their new album.",
                        "vi": "Nhóm đã tách ra khỏi đĩa đơn trong album mới của họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to destroy something; to criticize somebody very strongly",
                    "vi": "để phá hủy một cái gì đó; chỉ trích ai đó rất mạnh mẽ"
                },
                "examples": [
                    {
                        "en": "countries ripped apart by fighting",
                        "vi": "các quốc gia bị chia cắt bởi chiến đấu"
                    },
                    {
                        "en": "The dog had ripped a cushion to shreds.",
                        "vi": "Con chó đã xé toạc một tấm đệm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to destroy the most important part or aspect of something",
                    "vi": "để phá hủy phần hoặc khía cạnh quan trọng nhất của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "Closing the factory tore the heart out of the community.",
                        "vi": "Đóng cửa nhà máy xé nát trái tim của cộng đồng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to attack somebody very violently",
                    "vi": "tấn công ai đó rất bạo lực"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "f7acfae6aa1c4f6388b096c349d5ccb4",
        "word": "safe mode",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈseɪf məʊd/",
            "us": "/ˈseɪf məʊd/"
        },
        "nearby": [
            {
                "word": "safe keeping",
                "pos": "noun"
            },
            {
                "word": "safely",
                "pos": "adverb"
            },
            {
                "word": "safe mode",
                "pos": "noun"
            },
            {
                "word": "safe passage",
                "pos": "noun"
            },
            {
                "word": "the safe period",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a way of starting a computer that makes it easier to find a problem without the risk of losing data",
                    "vi": "một cách khởi động máy tính giúp tìm ra sự cố dễ dàng hơn mà không có nguy cơ mất dữ liệu"
                },
                "examples": [
                    {
                        "en": "A PC starting in safe mode can take longer to boot up.",
                        "vi": "Máy tính khởi động ở chế độ an toàn có thể mất nhiều thời gian hơn để khởi động."
                    }
                ]
            }
        ]
    },
    {
        "id": "cdc08d50afb549aebc70fb3bc587fcbc",
        "word": "scroll bar",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈskrəʊl bɑː(r)/",
            "us": "/ˈskrəʊl bɑːr/"
        },
        "nearby": [
            {
                "word": "scroll",
                "pos": "noun"
            },
            {
                "word": "scroll",
                "pos": "verb"
            },
            {
                "word": "scroll bar",
                "pos": "noun"
            },
            {
                "word": "Scrooge",
                "pos": "noun"
            },
            {
                "word": "scrote",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a narrow area at the edge of a computer screen that you use to scroll through a file with, using a mouse",
                    "vi": "một vùng hẹp ở mép màn hình máy tính mà bạn dùng để cuộn qua tệp bằng chuột"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a33561a3d67147819563a49ccea0ebb6",
        "word": "shift",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ʃɪft/",
            "us": "/ʃɪft/"
        },
        "nearby": [
            {
                "word": "shield",
                "pos": "verb"
            },
            {
                "word": "Carol Shields",
                "pos": ""
            },
            {
                "word": "shift",
                "pos": "noun"
            },
            {
                "word": "shift",
                "pos": "verb"
            },
            {
                "word": "shifter",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a period of time worked by a group of workers who start work as another group finishes",
                    "vi": "một khoảng thời gian làm việc của một nhóm công nhân bắt đầu công việc khi nhóm khác hoàn thành"
                },
                "examples": [
                    {
                        "en": "to work a shift",
                        "vi": "làm việc theo ca"
                    },
                    {
                        "en": "I've just finished an eight-hour shift.",
                        "vi": "Tôi vừa hoàn thành một ca làm việc tám giờ."
                    },
                    {
                        "en": "in shifts working in shifts",
                        "vi": "trong ca làm việc theo ca"
                    },
                    {
                        "en": "on a shift to be on the day/night shift at the factory",
                        "vi": "theo ca làm ca ngày / đêm tại nhà máy"
                    },
                    {
                        "en": "shift workers/work",
                        "vi": "công nhân ca / làm việc"
                    }
                ]
            },
            {
                "define": {
                    "en": "the workers who work a particular shift",
                    "vi": "những công nhân làm việc theo một ca cụ thể"
                },
                "examples": [
                    {
                        "en": "The night shift has/have just come off duty.",
                        "vi": "Ca đêm có / vừa tan ca."
                    }
                ]
            },
            {
                "define": {
                    "en": "a change in opinion, mood, policy, etc.",
                    "vi": "sự thay đổi trong quan điểm, tâm trạng, chính sách, v.v."
                },
                "examples": [
                    {
                        "en": "The minister's recent announcement represents a major policy shift.",
                        "vi": "Thông báo gần đây của Bộ trưởng thể hiện một sự thay đổi chính sách lớn."
                    },
                    {
                        "en": "a sudden shift to the right in British politics",
                        "vi": "một sự thay đổi đột ngột sang cánh hữu trong chính trị Anh"
                    },
                    {
                        "en": "shift in something Does the government's condemnation of the regime signal a shift in policy?",
                        "vi": "Sự thay đổi trong một cái gì đó Liệu sự lên án của chính phủ đối với chế độ có báo hiệu một sự thay đổi trong chính sách không?"
                    },
                    {
                        "en": "a dramatic shift in public opinion",
                        "vi": "một sự thay đổi mạnh mẽ trong dư luận"
                    },
                    {
                        "en": "The moment marked a significant shift in attitudes to the war.",
                        "vi": "Thời điểm này đánh dấu một sự thay đổi đáng kể trong thái độ đối với chiến tranh."
                    },
                    {
                        "en": "Over the last ten years there has been a fundamental shift in the way we do business.",
                        "vi": "Trong mười năm qua, đã có một sự thay đổi cơ bản trong cách chúng ta kinh doanh."
                    },
                    {
                        "en": "shift of something a shift of emphasis",
                        "vi": "sự thay đổi của một cái gì đó một sự thay đổi của sự nhấn mạnh"
                    },
                    {
                        "en": "With the shift of power in the Senate, the bill's fate is in doubt.",
                        "vi": "Với sự thay đổi quyền lực tại Thượng viện, số phận của dự luật đang bị nghi ngờ."
                    },
                    {
                        "en": "shift towards something A gradual shift towards renewable energy would mean reduced carbon emissions.",
                        "vi": "chuyển hướng tới một cái gì đó Chuyển dần sang năng lượng tái tạo sẽ có nghĩa là giảm lượng khí thải carbon."
                    },
                    {
                        "en": "shift from something to something In developed countries there has been a shift from manufacturing to services.",
                        "vi": "chuyển từ một cái gì đó sang một cái gì đó Ở các nước phát triển đã có sự chuyển dịch từ sản xuất sang dịch vụ."
                    }
                ]
            },
            {
                "define": {
                    "en": "the system on a computer keyboard or typewriter that allows capital letters or a different set of characters to be typed; the key that operates this system",
                    "vi": "hệ thống trên bàn phím máy tính hoặc máy đánh chữ cho phép gõ các chữ cái in hoa hoặc một bộ ký tự khác; chìa khóa vận hành hệ thống này"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a woman’s simple straight dress",
                    "vi": "một chiếc váy thẳng đơn giản của phụ nữ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a simple straight piece of clothing worn by women in the past as underwear",
                    "vi": "một bộ quần áo thẳng đơn giản được phụ nữ trong quá khứ mặc làm đồ lót"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "2c4652a220c247958f00a523dd658aca",
        "word": "space bar",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈspeɪs bɑː(r)/",
            "us": "/ˈspeɪs bɑːr/"
        },
        "nearby": [
            {
                "word": "space",
                "pos": "verb"
            },
            {
                "word": "space-age",
                "pos": "adjective"
            },
            {
                "word": "space bar",
                "pos": "noun"
            },
            {
                "word": "space cadet",
                "pos": "noun"
            },
            {
                "word": "space capsule",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a bar on the keyboard of a computer or typewriter that you press to make spaces between words",
                    "vi": "một thanh trên bàn phím của máy tính hoặc máy đánh chữ mà bạn nhấn để tạo khoảng trắng giữa các từ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "94ab50e0485d41d1ba82d706d014e863",
        "word": "status bar",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈsteɪtəs bɑː(r)/",
            "us": "/ˈsteɪtəs bɑːr/"
        },
        "nearby": [
            {
                "word": "stature",
                "pos": "noun"
            },
            {
                "word": "status",
                "pos": "noun"
            },
            {
                "word": "status bar",
                "pos": "noun"
            },
            {
                "word": "status quo",
                "pos": "noun"
            },
            {
                "word": "status symbol",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an area that you see along the bottom of your computer screen that gives you information about the program that you are using or the document that you are working on",
                    "vi": "một khu vực mà bạn nhìn thấy dọc theo cuối màn hình máy tính, cung cấp cho bạn thông tin về chương trình bạn đang sử dụng hoặc tài liệu bạn đang làm việc"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "ea722244c59247ac847fb4584ee926f0",
        "word": "title bar",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈtaɪtl bɑː(r)/",
            "us": "/ˈtaɪtl bɑːr/"
        },
        "nearby": [
            {
                "word": "title",
                "pos": "noun"
            },
            {
                "word": "title",
                "pos": "verb"
            },
            {
                "word": "title bar",
                "pos": "noun"
            },
            {
                "word": "titled",
                "pos": "adjective"
            },
            {
                "word": "title deed",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a bar at the top of a computer screen, which shows the name of the program and file that is on the screen",
                    "vi": "một thanh ở đầu màn hình máy tính, hiển thị tên của chương trình và tệp trên màn hình"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "0ff642d10a60474dba5d796a87db8168",
        "word": "toggle",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈtɒɡl/",
            "us": "/ˈtɑːɡl/"
        },
        "nearby": [
            {
                "word": "together",
                "pos": "adjective"
            },
            {
                "word": "togetherness",
                "pos": "noun"
            },
            {
                "word": "toggle",
                "pos": "noun"
            },
            {
                "word": "toggle",
                "pos": "verb"
            },
            {
                "word": "toggle switch",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a short piece of wood, plastic, etc. that is put through a loop of thread to fasten something, such as a coat or bag, instead of a button",
                    "vi": "một đoạn gỗ ngắn, nhựa, v.v. được luồn qua một vòng sợi để buộc chặt thứ gì đó, chẳng hạn như áo khoác hoặc túi, thay vì nút"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a key on a computer that you press to change from one style or operation to another, and back again",
                    "vi": "một phím trên máy tính mà bạn nhấn để thay đổi từ kiểu hoặc thao tác này sang kiểu hoặc thao tác khác và quay lại lần nữa"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "e5c92ae7a9d54bd4a3e2b12f40f75e66",
        "word": "toggle",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈtɒɡl/",
            "us": "/ˈtɑːɡl/"
        },
        "nearby": [
            {
                "word": "togetherness",
                "pos": "noun"
            },
            {
                "word": "toggle",
                "pos": "noun"
            },
            {
                "word": "toggle",
                "pos": "verb"
            },
            {
                "word": "toggle switch",
                "pos": "noun"
            },
            {
                "word": "Togo",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to press a key or set of keys on a computer keyboard in order to turn a feature on or off, or to move from one program, etc. to another",
                    "vi": "để nhấn một phím hoặc một bộ phím trên bàn phím máy tính để bật hoặc tắt một tính năng hoặc để di chuyển từ chương trình này, v.v."
                },
                "examples": [
                    {
                        "en": "toggle (between A and B) He toggled between the two windows.",
                        "vi": "chuyển đổi (giữa A và B) Anh ấy đã chuyển đổi giữa hai cửa sổ."
                    },
                    {
                        "en": "toggle something This key toggles various views of the data.",
                        "vi": "chuyển đổi thứ gì đó Phím này chuyển đổi các chế độ xem dữ liệu khác nhau."
                    }
                ]
            }
        ]
    },
    {
        "id": "2ab612e0f70e4f09b22d4a6281c89a8b",
        "word": "toolbar",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈtuːlbɑː(r)/",
            "us": "/ˈtuːlbɑːr/"
        },
        "nearby": [
            {
                "word": "tool",
                "pos": "noun"
            },
            {
                "word": "tool",
                "pos": "verb"
            },
            {
                "word": "toolbar",
                "pos": "noun"
            },
            {
                "word": "toolbox",
                "pos": "noun"
            },
            {
                "word": "tooled",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a row of symbols (= icons) on a computer screen, smartphone, etc. that show the different things that you can do with a particular program",
                    "vi": "một hàng ký hiệu (= biểu tượng) trên màn hình máy tính, điện thoại thông minh, v.v. hiển thị những việc khác nhau mà bạn có thể làm với một chương trình cụ thể"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "28aca81081ba40b4b444c9538030abbd",
        "word": "tutorial",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/tjuːˈtɔːriəl/",
            "us": "/tuːˈtɔːriəl/"
        },
        "nearby": [
            {
                "word": "tutor",
                "pos": "noun"
            },
            {
                "word": "tutor",
                "pos": "verb"
            },
            {
                "word": "tutorial",
                "pos": "noun"
            },
            {
                "word": "tutorial",
                "pos": "adjective"
            },
            {
                "word": "tutti-frutti",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a period of teaching in a university that involves discussion between an individual student or a small group of students and a tutor",
                    "vi": "khoảng thời gian giảng dạy trong trường đại học liên quan đến thảo luận giữa một sinh viên hoặc một nhóm nhỏ sinh viên và một gia sư"
                },
                "examples": [
                    {
                        "en": "The total number of hours spent in lectures, tutorials and practicals varies according to the course of study.",
                        "vi": "Tổng số giờ dành cho các bài giảng, hướng dẫn và thực hành thay đổi tùy theo quá trình học."
                    }
                ]
            },
            {
                "define": {
                    "en": "a short book or computer program that gives information on a particular subject or explains how something is done",
                    "vi": "một cuốn sách ngắn hoặc chương trình máy tính cung cấp thông tin về một chủ đề cụ thể hoặc giải thích cách thực hiện điều gì đó"
                },
                "examples": [
                    {
                        "en": "An online tutorial is provided.",
                        "vi": "Một hướng dẫn trực tuyến được cung cấp."
                    },
                    {
                        "en": "Some sites offer step-by-step tutorials.",
                        "vi": "Một số trang web cung cấp hướng dẫn từng bước."
                    }
                ]
            }
        ]
    },
    {
        "id": "5bad289761cb49ad9b4d9515d786bf30",
        "word": "undelete",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌʌndɪˈliːt/",
            "us": "/ˌʌndɪˈliːt/"
        },
        "nearby": [
            {
                "word": "undefended",
                "pos": "adjective"
            },
            {
                "word": "undefined",
                "pos": "adjective"
            },
            {
                "word": "undelete",
                "pos": "verb"
            },
            {
                "word": "undemanding",
                "pos": "adjective"
            },
            {
                "word": "undemocratic",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to cancel an action of deleting a document, a file, text, etc. on a computer, so that it appears again",
                    "vi": "để hủy hành động xóa tài liệu, tệp, văn bản, v.v. trên máy tính để nó xuất hiện trở lại"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "b5710413641f444388d4841e0902dba7",
        "word": "unlock",
        "pos": "verb",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌʌnˈlɒk/",
            "us": "/ˌʌnˈlɑːk/"
        },
        "nearby": [
            {
                "word": "unlit",
                "pos": "adjective"
            },
            {
                "word": "unload",
                "pos": "verb"
            },
            {
                "word": "unlock",
                "pos": "verb"
            },
            {
                "word": "unlocked",
                "pos": "adjective"
            },
            {
                "word": "unlooked for",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to open the lock of a door, window, etc., usually using a key",
                    "vi": "để mở khóa cửa ra vào, cửa sổ, v.v., thường sử dụng chìa khóa"
                },
                "examples": [
                    {
                        "en": "to unlock the door",
                        "vi": "mở khóa cửa"
                    }
                ]
            },
            {
                "define": {
                    "en": "to discover something and let it be known",
                    "vi": "để khám phá điều gì đó và để nó được biết đến"
                },
                "examples": [
                    {
                        "en": "The divers hoped to unlock some of the secrets of the seabed.",
                        "vi": "Các thợ lặn hy vọng có thể mở khóa một số bí mật dưới đáy biển."
                    },
                    {
                        "en": "Drama helps to unlock young people’s creative talents.",
                        "vi": "Phim truyền hình giúp khai mở tài năng sáng tạo của những người trẻ tuổi."
                    },
                    {
                        "en": "the key to unlock the mystery",
                        "vi": "chìa khóa để mở ra bí ẩn"
                    }
                ]
            },
            {
                "define": {
                    "en": "to enable a mobile phone to use any network rather than only one particular one",
                    "vi": "để cho phép điện thoại di động sử dụng bất kỳ mạng nào thay vì chỉ một mạng cụ thể"
                },
                "examples": [
                    {
                        "en": "Have an old phone lying around? Unlock it and keep it as a spare.",
                        "vi": "Có một chiếc điện thoại cũ nằm xung quanh? Mở khóa và giữ nó như một vật dự phòng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to use a code or password to get access to more data or features on a computer or phone, or in a computer game",
                    "vi": "sử dụng mã hoặc mật khẩu để có quyền truy cập vào nhiều dữ liệu hoặc tính năng hơn trên máy tính hoặc điện thoại hoặc trong trò chơi trên máy tính"
                },
                "examples": [
                    {
                        "en": "Players complete goals, unlock new levels and progress through the game.",
                        "vi": "Người chơi hoàn thành mục tiêu, mở khóa cấp độ mới và tiến bộ trong trò chơi."
                    },
                    {
                        "en": "Additional features can be unlocked in-app for $5.99.",
                        "vi": "Các tính năng bổ sung có thể được mở khóa trong ứng dụng với giá $ 5,99."
                    }
                ]
            }
        ]
    },
    {
        "id": "289f7ee023294ef5b7d528eece1f1317",
        "word": "wallpaper",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈwɔːlpeɪpə(r)/",
            "us": "/ˈwɔːlpeɪpər/"
        },
        "nearby": [
            {
                "word": "wallow",
                "pos": "noun"
            },
            {
                "word": "wall painting",
                "pos": "noun"
            },
            {
                "word": "wallpaper",
                "pos": "noun"
            },
            {
                "word": "wallpaper",
                "pos": "verb"
            },
            {
                "word": "wall plug",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "thick paper, often with a pattern on it, used for covering the walls and ceiling of a room",
                    "vi": "giấy dày, thường có hoa văn trên đó, được sử dụng để phủ các bức tường và trần của một căn phòng"
                },
                "examples": [
                    {
                        "en": "wallpaper paste",
                        "vi": "dán giấy dán tường"
                    },
                    {
                        "en": "a roll of wallpaper",
                        "vi": "một cuộn giấy dán tường"
                    },
                    {
                        "en": "to hang wallpaper",
                        "vi": "treo giấy dán tường"
                    }
                ]
            },
            {
                "define": {
                    "en": "the background pattern or picture that you choose to have on the screen of your computer, mobile phone, etc.",
                    "vi": "hình nền hoặc hình ảnh mà bạn chọn để có trên màn hình máy tính, điện thoại di động, v.v."
                },
                "examples": [
                    {
                        "en": "You can download desktop wallpaper.",
                        "vi": "Bạn có thể tải hình nền máy tính để bàn."
                    }
                ]
            }
        ]
    }
]