[
    {
        "id": "ed013f77d6144b94a80f99e5a05a4f2b",
        "title": "Road Safety",
        "content": "Why think of road safety at all? It is because of the accidents that occur everyday on the road, in which all sorts of vehicles and human beings and even animal are involved. These accidents mean loss of life and loss of property and more often than not obstruction to traffic. In this age of speed and fast moving vehicles and with the congestion on roads, these accidents have became almost an everyday affair. So unless everybody is educated on the importance of road safety, the loss and the sorry spectacles cannot be avoided.\nPrevention is better than cure. This holds good even in the matter of road accidents. Accidents are due to many causes and may occur under different circumstances. The simplest but at the same time dangerous perhaps is people slipping down on the road caused by an orange or a banana peel. Without meaning any harm, quite innocently a person may throw away the orange peel or the banana skin on the road or the sidewalk. When a person, walking briskly, steps on, it he or she will slip down ending in fracture of bones and sometimes even more dangerous than that. So people must take care they do not throw the pealings on the road but should deposit them in a dust-bin. In some countries the offenders are severely punished. The second cause of accident is due to careless crossing in busy roads. While crossing one must look to the right and left for moving vehicles and then cross.\n\nWhere there are Zebra crossings on the road for the pedestrians to cross, one should cross along them. One should keep to the margin of the road while walking and the vehicles must keep to their lanes in busy streets.\n\nIn the case of accidents involving vehicles there are many causes. One is trying to overtake and very often taking risk. Another is wrong judgment in crossing. Sometimes it may be not caring for the signals. In crowded streets accidents may take place in a snap second because one does not care for the signal. \"Stop, look and go\" is the best precept; it will save vehicles from accidents. But where one takes a foolish step, the result is the inevitable accident. Jay riding may be another cause. Riding two or three abreast is always dangerous. Especially one must be aware of this. Scooter riders become victims of road accidents. But if they just wear the helmet as required by law they could easily avoid fracture and hence death.\n\nVery often the cause of accidents is the failure of the brake system which means the owner of the vehicle does not bother to keep the machine in good condition. By attending to the vehicle regularly a lot of miseries could be avoided.\n\nRoad safety is a matter of education in which the school can play a significant role. Through scouting, Red Cross and social education classes, children can be taught the importance of observing the rules of the road. Children must be taught their limbs and lives are very valuable and they must not take risk, especially when leaving the school. As soon as the bell goes children rush out and accidents do happen. Under the circumstances the teachers must feel it their duty to regulate the traffic near the school. The police can cooperate with the school in this respect.\n\nTo make the people road conscious, the mass media can play a useful role. The newspaper, the wall poster and the cinema and now the TV come in handy. Shots in the cinema or TV emphasizing the importance of road safety can be highlighted. There may be speeches over the radio by the police officials. During peak hours in crowded areas, the police may direct the traffic and ask people to keep to their lanes."
    },
    {
        "id": "cb004b75d204473f83b0a78fe349196c",
        "title": "Our neighbor",
        "content": "Living next to next is the principle of a neighbor. Good neighborliness is the ideal to be aimed at and pursued. People live in the same neighborhood for many reasons. Sometimes it may be aesthetic and very often convenience. It may be the nearness to one's office of work, school, traffic centers and so on. As the saying goes, no man is an island; he has to live with his neighbors. To make life tolerable and bearable one must cooperate with one's neighbor.\nOne's neighbor may be temporary as in the case of traveling by bus or train. Here the neighbor is with one for a few minutes or few hours. Even here if there is understanding between the neighbors the travel will be pleasant. Good neigborliness generates good company and especially during travel it helps to take away the boredom. There are cases when such travel has culminated in longstanding friendship.\n\nWhether one likes it or not, one cannot do without neighbors. Even where houses are isolated as in the case of bungalows there is inevitably the neighbor. Normally one may think one can do without neighbors because one can command all comforts and services, so the services or the need for a friend may not arise. However serviceable the radio or the TV may be in providing the recreation, they cannot supply the human elements. The sympathy, the admiration and the appreciation which a neighbor may offer will have a great humanizing influence. To share one's view and sometimes even one's sorrows one needs some neighbors. Because man is gregarious he cannot live in isolation.\n\nBut all neighbors are not always keeping the cordial relationship. Stresses and strains develop because of misunderstandings. The cause may be very trivial or flimsy, still tension develops ending in animosity and feud. Jealousy may be another cause for such a tension. The neighbor may be doing fine, has earned a lot of money, his children are doing well, he gets quick promotions, these and such others may create jealousy. Once this is generated, this leads to non cooperation and petty quarrels. Very often children may be the cause for strained feelings.\n\nChildren may quarrel drawing the elders into the fray. The neighbor's son may pick a flower or a fruit from your garden and an argument may erupt. Again he may throw his ball at your window pane damaging it. These are not unnatural so far as the younger one is concerned but it is for the elders to view at them with equanimity and make up for it. This may read easy on paper but not so in practical life. But with some broad outlook one must be able to tolerate.\n\nAnother reason for tension may be the animals. Your neighbor's dog may be a real nuisance or his poultry which would come into your garden and eat away the young saplings.\n\nIn all these cases to keep up good neighborliness some understanding between the neighbors is important. Small differences can be easily patched up or ironed out. Care can at times play the good samaritan and helps the neighbors in a small or big way. Nobody is perfect and it is better not to speak disparagingly of your neighbor.\n\nA cheerful word or a nod or a casual enquiry will strengthen the feeling of good neighborliness. Negatively, one must not pry into what the neighbor is or what he does.\n\nTolstoy speaks in one of his stories how neighbors should behave. A child was wearing a new shirt and the neighbor's child threw mud on it and thus spoiled it. Women folk started the quarrel and men folk entered into the fray ending in a few heads broken and so on. By then the children forgot all their quarrel and were playing. Tolstoy draws a moral from the story namely neighbors must be quick to forget small wrongs done.\n\nNeighborliness is not only for individuals but it is important also in a great measure between neighboring countries. History has got a lot to teach in this respect. Unless countries learn to live as good neighbors, there cannot be peace on earth. So children must be taught at home and in the school to cooperate with the neighbors and be friendly with them. The basic principle is to give and take and to develop a sense that the other man has as much right as you have and some degree of tolerance is very necessary."
    },
    {
        "id": "506b4fcbc05849f1abb56ee0b20d86fc",
        "title": "Computer and their uses",
        "content": "Perhaps the single greatest invention of the century is the computer. The computer is essentially a machine that enables humans to complete tasks that may be time consuming or very repetitive in nature. This it achieves by imitating human thought processes. In much the same way that humans think using pathways in their brains that conduct minute electrical currents, computers too use tiny electrical circuits which tell it what to do. The difference being that computers do this at incredible speeds.\n\nIn this modern age man has grown to be heavily dependent on computers to carry out all kinds of jobs that were done manually before. In banking for example computers allow for millions of transactions to be carried out involving large sums of money which would otherwise require thousands of bank tellers. Computers do the job in a much shorter time and practically free of any errors. Computers are responsible for air traffic control and the running of trains to ensure that travel is made as smooth as possible. In factories nowadays computers operate mechanical devices that produce goods we require for everyday living, in such quantities that would be otherwise impossible to achieve if these factories were run by humans alone.\n\nPerhaps the greatest advancements have been made in the field of communications. All of us are by now familiar with the 'Internet'. The internet is a collection of computer systems and individual terminals linked up worldwide through telephone lines and other channels. It offers a cheaper alternative to communicating with people within a country and internationally through computers. It has also been described as an immense pool of knowledge just waiting for applications it has given rise to a new means for countries to carry on trade with each other through 'E-Commerce'.\n\nIt must however be kept in mind that as useful as computers are. They are not capable of independent thought and still require human input. In recent times scientists have developed' Artificial Intelligence' in computers that may enable them to function independently of man in the future."
    },
    {
        "id": "60daa047e5ed474db77606b1f6490fa1",
        "title": "The pleasures of reading",
        "content": "Animals may have moments of pleasure but only man has got a lot to do with it. It is through our sense organs that we enjoy pleasure. The sense of smell, sight, hearing, touch and taste each brings pleasure. Even the baby as soon as it is born feels the pleasure of sucking and the comfort of being cuddled in the wads of cloth in the mother's lap. But for the pleasing smell we will not be able to enjoy our food. We are thrilled by the sight of ice capped mountains or the roaring water falls of the Niagara. So they are the senses that help us to get pleasure.\n\nThere is no end to the sources of pleasure. But reading for pleasure belongs to a higher order and stands as a category by itself. While external things bring pleasure to the sense organs, reading brings pleasure to the mind. Greater the mind is cultured, greater will be the derived from reading for reading makes a full man.\n\nReading is the end product of writing. Unless there is something written one cannot read. So good writing is a concomitant of reading. Man alone can write, in other words put his ideas in black and white. In fact even before printing came into being man was writing and it is as old as modern civilization. Man can preserve his thoughts and ideas through writing. Thus the whole world of literature is there far one to read.\n\nNow reading material is available for all tastes. A scholar may go through serious writing for the sake of enriching his knowledge. Another may read a magazine or a picture book for whiling away the\ntime. One chooses the reading material according to his moods, his literary background, the time at his disposal and the purpose if any. A teenager may like stories of romance and an old man may prefer books on philosophy and religion. Some gifted with imagination and the faculty to reflect may read poetry.\n\nOne who takes pleasure in reading always tries to build his library. Very often a good library may serve the purpose.\n\nThe greatest advantage in reading is when one comes across great minds. Whether you agree with what is there to read or do not agree there will not be any quarrel. You may pronounce your judgement on the writer. There will be no harm if your judgment is silent and not published.\n\nGiven the proper atmosphere like a good silent place, soft light and comfortable seat, one can read and read and enjoy it.\n\nThere are great masters of writing in all great languages of the world. English Language abounds in such great authors. Again it may be poetry, novel, fiction, drama, travelogue, and letters. Biographies and autobiographies, form a sizable part. In these days of rush good magazines supply the material for reading. For example, one may cite the Reader's Digest.\n\nIn order to enjoy reading, one must cultivate that habit. Reading is not the 'be all' and `end all' of life. Yet, it can be ennobling. There is dignity in reading habit."
    },
    {
        "id": "299c2459c24a41f0b6823cf8d00307ed",
        "title": "Obedience to parents and elders",
        "content": "To be obedient is to obey the orders of one's elders and superiors. There cannot be order unless there is obedience. One has to obey the laws of the country, otherwise the society cannot exist. The laws may be irksome, but, for the overall good of the law one must obey them. For instance, the laws to be obeyed on the road ensures road safety. The laws pertaining to property help society continue without hitches and hindrances. Even in our body our limbs obey the commands of the brains unless they are diseased. Obedience is essential for the enforcement of order.\n\nObedience includes obedience to one's parents and elders. Parents are the best well wishers of their children. From their experience, they know what is good for their children. They would never mean ill for them. For the sake of the well being of the children, parents insist on obedience. Obedient children grow into fine children. They are not only loved by their parents but also by others connected with the household and by the neighbours. When children obey parents they are happy.\n\nCircumstances as they may be, parents may set certain norms. Children may not understand their implications, but if they obey, very often they will steer of dangers. For instance, the parent may warn his son of bad company. If the son obeys, he will grow unscathed. The parents may insist on personal cleanliness, keeping things neat and tidy, being regular in studies and so on and so forth. If the boy or girl obeys the parents in such and other things, he or she will surely grow into a finer one.\n\nOf course the parents' example may be forceful enough. If the parent shows how he is obedient, the son will naturally be obedient.\n\nThere cannot be a better story than Casabianca on the deck. The father had asked the boy not to leave the deck until the parent returned. The ship was on fire, the father was dead and other sailors asked Casabianca to leave the deck and escape for life. But the boy would not leave, for father had asked him not to. The fate of the boy could be conceived but Casabianca has become immortal because he obeyed his father.\n\nBeing obedient to parents and elders will have to be followed in life. An obedient servant is always liked and respected. But for the unquestioning obedience of servants big establishments cannot be run. Unless one knows the value of obedience and has been practising it, suddenly he cannot become obedient. Servants who are obedient are preferred to clever ones.\n\nOne may argue that blind obedience won't do good. Where one can prove the other is wrong, strict obedience can be waived. This happened sometimes; a junior may have a brilliant idea and without infraction of obedience he may put up his idea in the appropriate manner.\n\nObedience, just like charity must begin at home. Parents have a duty in bringing up children to be obedient and loving."
    },
    {
        "id": "d578dbed61e346daa2030eeb0786baab",
        "title": "My favorite outdoor game",
        "content": "Soccer is my favorite game. Ever since I joined the school, I have been playing soccer. The luscious grass field is very much suited to run, to roll over and kick.\n\nThe game is played between two teams of eleven players each though sometimes lesser number like six or seven may be there in a team. Among the players of a team, some may be forwards, others mid-fielders and defenders, and one goal keeper. Unlike the other players the goal keeper can handle the ball as the situation calls for.\n\nAs it is a team game, all must cooperate. The forwards must be fast, able to take the ball through the legs of the opponent. The midfielders help not only in defense but also help the forwards in clearing and supplying the ball. Defenders must offer strong defense. The goal keeper must be agile, quick to see, correct in anticipation and should kick the ball high and far.\n\nThere are well established rules and foul play will be penalized. The referee's job is tough and there have been instances when the poor referee has been man handled by the onlookers. It is the bane of the game that the audience turn partisan.\n\nAmong the great soccer nations Argentina, Brazil, England, Russia and Germany are a few. The name of Pelee, the great footballer of all times has become a household word among the soccer fans.\nFootball is a manly game so I like it. Whenever I find time in the evening, I never fail to play for an hour or so. I take the forward position because I feel there is more fun in pursuing and heading the ball.\n\nThose who do not know much about the game say it is a rough game. Of course there are cases of broken heads, muscle twisting and sometimes even fractures. But these are caused when one does not play according to the rules. Of course they are inevitable in a game like soccer. Nowadays people protect themselves with guards. But for the risks the game is all right. If it is all soft then there won't be any game at all."
    },
    {
        "id": "035e0a0d32c6450a8cfe5caffdad2c40",
        "title": "Life in a high-rise flat",
        "content": "Man is the only home making animal. He alone can enjoy the warmth of his hearth and family circle. Man has evolved from tree dwelling to the modern flat. Primitive man was the master of his hut and it was his castle. Till recently the house had been a complex affair. There were the gardens, barn, poultry, cattle shed and so on. The house itself was having different portions spacious enough for all the family members to move about. These villas till recently were popular. Even today we may come across these villas in the countryside.\n\nThere was good neighborliness. In sorrow and joy the neighbor shared. They were helping each other in many of life's needs and operations. They had enough leisure. They had time to sit over a pipe or glass of drink and gossip. In short everybody was known to everybody and the society was in one sense self contained.\n\nBut those days are gone though there may be vestiges in remote places. The onslaught of Industrial Revolution and the growth of industries as a result have caused the birth and growth of towns and cities. Though even in ancient days there were cities, they were the capitals of kings and emperors, otherwise there were not many cities. Any student of history could appreciate this point. So the growth of cities is a modern phenomenon, concomitant to the growth and concentration of industries.\n\nIn an industrial area space becomes scarce and as more and more families pour in they cannot find space for houses. Not only the space but also the cost becomes prohibitive. So an average office goer or a worker cannot have the luxury of owning a house. Still they want some shelter to lay their heads down when they have returned from their office or factory. The answer has been the high rise flats of several floors. They are either built by building societies or by the Housing Boards of government.\n\nThese flats are provided with all facilities like water, electricity, good drainage, airy rooms and so on. In every high rise flat there may be even lifts to take people up and down. In the flats the tenants may be independent.\n\nBut there are more disadvantages in living in a high flat. The movement will be restricted and conditioned according to the circumstances. One may have to live with all sorts of people, the homogeneity which was the rule rather than the exception will be wanting. One does not know who his neighbor is, so though living in the midst of many one may feel lonely. Since all facilities are artificially controlled any breakdown in them would paralyze life. For instance, if there is any defect in the water system, life will be upset. For want of space, one must plan carefully what one must own. Whereas in olden days people had enough space to entertain guests and relatives. It is the children who would suffer most for there won't be enough space for them to run and play about. Unless one has the facility to take them out, they will develop complexes of closed space. Since the cannot easily mingle with other children, there may be blind spots in their character. Living such artificial surroundings may even tell on their health and growth. In short they will feel like caged birds. This may be true of even grown ups.\n\nFurther if there were to be accidents like fire or the breakout of epidemics, the high rise flats will suffer most. From aesthetic point of view also the flats do not add to the beauty of the city.\n\nIn short one may conclude that life in a high rise flat is necessary evil in a big city."
    },
    {
        "id": "a4beb2ad427b42258f8473743dce4054",
        "title": "How to make your life successful",
        "content": "What we call life is a very complex affair. It is not simply eating, reproducing and finally dying. Every creature does these. But in the case of man he has to lead a highly complicated life. It is like going through a maze and coming out. He is an economic being and a social animal. He has to earn, make a home, look after his people, attend to his obligations to the society and the Government. So in order to be successful, in all these, he has to develop certain qualities.\n\nWhat do we mean by saying a man is successful? If in his occupation he can do satisfactorily both for himself and others then he is successful. He must be able to look after his people and bring up good children. If he becomes a professional man like an engineer, doctor or lawyer, making money should not be the only criterion; he must also be able to satisfy his clients and be honest at it.\n\nIn order to be successful one should develop certain qualities. At first he must realize his purpose; in other words what he would like to be. This is the crux of the problem, for the choice does not come to him. Parents decide it very often for them. Let us suppose he decides to be somebody in his life. Once having decided he must work for attaining certain standard in that line. Only hard work would make him fit for the job. It is rightly said that it is 5% inspiration and 95% perspiration. One must deserve before desiring. One must remember one's education does not stop with the school or college. it is a life long process. Professional people must keep themselves up to date.\n\nThen one must get on with others. In the chess board of life one may find himself in any position; it may be the all powerful queen or simply a pawn. It must be remembered that given the chance, even a pawn can destroy a queen. This means in a complex society, everyone finds oneself in a particular position; there may be some above and some below. One need not be favoring and flattering those above and be arrogant with those below. \"What can I do for you' is the correct attitude and having done it go about your duty. In getting on with others sweet temperament is really an asset; then only others will like to transact with one. One must not be easily irritable nor give irritants to others. Then one must be reliable. One may be clever but if he is not reliable, he cannot achieve success in a great measure because others will have very little to do with him.\n\nAnother important quality that would make up for success is doing things then and there. Procrastination is the thief of time. Postponement of doing things means swelling of work for the next day. A small chink may be easily closed today but tomorrow it may be late. If we analyze the life of successful people we could easily see they have been through and never postponed doing things.\n\nStill another quality is not to argue. The other may be really wrong. By pointing out that he has been wrong you are not going to improve matters, on the other hand you can help him correct. Arguing not only takes away precious time but also causes irritations. Especially one's superior may not like situation something like this. 'You may be right, sir', or 'This is all right', but 'what about our alternative' and so on.\nOne must be capable of learning from experience. One must be able to learn from the mistakes of others. Only when nations and individuals fail to learn from the past mistakes, they are ruined. History is replete with examples."
    },
    {
        "id": "f31c760388484d49a393a8b21123a387",
        "title": "Precious water",
        "content": "Water is one of the things we need most besides air, and thank god water is plenty generally speaking, because three fourths or so of earth's surface is covered with water. This is only a general fact and not all places on earth are having enough water and healthy potable water is a rare commodity. Rivers may bring water and lakes may be having it. From the health point, they may not be fit for drinking. Most of these waters are contaminated and may contain mineral as well as organic impurities, and sometimes epidemic spreading bacteria like those causing cholera and typhoid. Nowadays the chances of contamination of water sources are quite common with industries coming up and sending out their effluents indiscriminately. So to make these waters potable they must be treated before being supplied to a population.\n\nTreating water and supplying it to a town or city means cost. The water has to be filtered for suspended impurities and then chlorinated and then pumped to a storage tank from where the water is distributed through pipes. So one must remember that when one draws water from the tap, one is actually buying or paying for water. This has become inevitable with the growth of cities and towns.\n\nOnce we bear in mind we will be careful in using water. There are many ways in which water is wasted. The tap may be leaky whereby water may be spilled. That means some periodic attention must be paid to the plumbing and leaky taps. The tap may be open and the water running out and nobody would care to stop it. Unless there is need, the tap must be kept closed. This must be particularly remembered when one leaves home on holiday, otherwise throughout their absence water may be flowing out. Just as we see if the electric mains are off when we are away for some time so too is the water tap.\n\nMajor part of the water is used for bathing, washing, and cleaning. In all these needs water must be prudently used, Take bathing for instance; when one is scrubbing or applying soap to one's body the shower need not be running. Water economy must be remembered in the use of bath tubs. One need not be a Rhino to be in one's bath for hours on end. This prudence in the use of water may be practised in washing and cleaning. Since these consume a lot of water, the municipal corporation, if it is affluent and water is in plenty, can have a separate system supplying water for washing and cleaning alone.\nThe industrial houses must not be allowed to draw from public water system for their industrial use except perhaps for drinking water.\nOne must bear in mind when one wastes water one is depriving another of his share of water.\n\nGood water may get scarcer in days to come. With the advent of rapid industrialization contamination of water sources poses a threat. So the industrial people must feel it their duty not to add to water pollution. In areas of acute water scarcity steps may be taken for recycling water.\n\nRemember one of the casualties of the so called modernization is that we have to pay for nature's goods of which water is one."
    },
    {
        "id": "384622102b984de482b07070e2d2750c",
        "title": "Accidents at home",
        "content": "Let us cite some examples of accidents at home. Cutting, burning, scalding, hurting to cause fractured, bones and getting electric shock are some of them. These may happen anywhere, in the kitchen, in the bathroom, or on the staircase.\n\nThese accidents may lead to temporary disablement or permanent ones. Sometimes they may prove fatal. So as in many cases in life it is always better to prevent them; hence the proverb 'prevention is better than cure', but one must be aware of the cure also.\n\nLet us consider the preventive aspect first. One must be careful in using cutting instruments in the kitchen. One must learn from those who have experience how to use the knives, manglers and so on. Care must be taken in handling hot things. Use good tongs to remove hot vessels from the oven. Hot things must not be placed anywhere, otherwise one would get scalded. Steam causes a greater injury than hot water so one must be careful where steam is involved. Since pressure cookers work on steam one should be careful when removing the lid of the cooker. So too with hot oils. Here care must be taken not to add water to hot oil when it is on open fire because it will catch fire.\n\nFalling down by false step is another accident. Bathrooms, poorly lit landing places, ill fixed mattresses on the staircase are worst offenders. Oil drops or soap bits must not be dropped down in the bathroom as these may help slipping down. The staircase must be well lit so that no false step is possible. The mattresses must be well fixed. Fall from ladder and stools are common. Unless there is somebody to hold or unless the ladder is well fixed, one must be very careful in using ladders. Trying to reach a higher point from a ladder always results in slipping down. So too with stools; broad based three legged stools are to be preferred to four legged ones because of the stability of the former. Electrical wiring must be periodically checked. Frayed wires must be removed. When handling electrical equipment it is always advisable to have the mains off. Too many leads may not be taken from a single pin point as it results in heating and hence some accidents. Electrical appliances must have insulated or protective handles. When using the electric iron it is better to stand on a rubber sheet or dry wood plank. No wet cloth must be hung on any electrical wire for, in case of any leakage, it would prove fatal.\n\nMedicines must be kept away from the views of children and kept under lock and key. Otherwise they may be tempted to swallow or drink the wrong medicine and may prove dangerous. Youngsters must be taught how to use knives and other sharp instruments. Nowadays gas is being used for cooking. It must be seen that there is no leakage of gas lest there would be some explosive accident. Children must not be allowed to play with the valves for even breathing of the gas is dangerous. Beware of leakage of gas.\n\nIn all these cases by being a bit careful, many an accident can be avoided."
    },
    {
        "id": "d7439668d77648ccad7c1add8b6188df",
        "title": "Keeping fit",
        "content": "A sick man is a nuisance for himself and a nuisance for others about him. A sick person cannot go about his duties efficiently. He will not be able to work hard and he may not be mentally alert also. If he is regularly sick others will suffer in many ways. Indirectly it is a strain on the government because it will have to run more hospitals for the sick. Economically a nation whose people are often sick cannot be strong because the hours of work will suffer. Look at the Europeans and the Japanese. They are hardy and are capable of longer hours of work, which means more wealth to the nation. That is why even after being beaten in a devastating war Germany and Japan have become rich nations once again within a period of thirty years.\n\nOf course climate may be one reason why certain people are not keeping fit. It may be due to hot moist climate, or mosquitoes and other pests. But where man cannot improve upon natural causes he can try to keep himself fit by trying overcome them. For instance by eradicating malaria, one can be healthy in such areas where malaria was once prevalent.\n\nLet us now look into the ways of keeping fit. First and foremost is the diet. Unless one takes a proper, balanced and nutritious diet one cannot be healthy. It is said that a large part of the population in the third world suffers from malnutrition which means wrong diet as well as insufficient diet. While this may sound a social problem, it is also an individual problem. One must take care what he eats and how he eats. One must plan to diet in such a way that it is well balanced, meaning it should contain the necessary quantity of proteins, carbohydrates, fats, minerals, vitamins and so on. He must keep his surroundings clean and neat, which is called environmental sanitation. He must be regular in his personal habits like answering calls of nature, bathing and so on. Even one's clothing contributes to keeping fit.\n\nKeep fit also means how a man lives, his hours of work, his sleep, rest and relaxation. While everyone has to work to deserve his food, it should not be all work. There must be hours of relaxation. It may be some reading, playing with children, taking a stroll or taking up a healthy hobby. Hobbies play a major role in keeping one fit.\n\nThe mental attitude also is greatly responsible for keeping fit. One must take to work like a fish to the water. One must be swinging like a wheel in his work. Work can be play and play can be work. So if one were to take to his work cheerfully then no worry about his keeping fit. Laziness, envy and jealously are some of the reasons which make one hate his work, and in the long run he becomes unfit.\n\nTo keep fit some physical exercise is necessary. This may be according to the age of the person. Some out-door exercises like running, jumping, swimming or climbing are for the hardy youth. Walking and jogging are good for the old. Some fruitful occupation like gardening may give the required physical exercise but also contributes to the mental satisfaction.\n\nAbove all, to keep fit depends on one's attitude towards life. If one can accept success and defeat equally then one is said to be a fit person. Even choosing company may contribute to keeping fit.\n\nFinally it means to avoid bad habits like smoking, drinking, doping and so on. One must be warned against these as they make holes in one's pocket as well ruin one's health."
    },
    {
        "id": "17dd293f42a842759bd8b4a4a61ade12",
        "title": "The day everything went wrong",
        "content": "There are days in one's life when everything can go wrong. He can get into trouble at every move. I had one such day last week.\n\nIt was Friday when I woke up at 7 a.m. The sun was already bright. I had to be at the bus-stop at the latest 7.15 to reach school by 7.30 a.m. I rushed to the bathroom for a quick wash and turned on the tap. There was no water, it was dry! However, I managed with a pail of water, which my mother had left there the previous night. I quickly dressed myself up and slipped out of my house without mother's knowledge. I knew my mother would be angry for what I had done that day.\n\nI reached the bus-stop within five minutes. Alas! the bus had gone a few seconds before. I concluded as there were no students at the bus-stop. I had no choice but to call a passing taxi. I was lucky to get one and jumped into it. I cheered up thinking that I would reach school on time. When I put my hand in my pocket to pay for the taxi fare, I was horrified to find the pocket empty. I had no money! \"What shall I do?\" As the taxi stopped at the gate of my school, I met my form teacher. I explained to him my situation and he was kind enough to help me pay the fare. I was much relieved and ran to the class. I regained my spirit when I found that I had reached school before the bell.\n\nThen I noticed something peculiar. I was the only student around. \"Am I late after all?\" I quickened my steps, suddenly I heard a shout \"What are you doing here?\" I turned back and saw my principal standing in front of me. \"Why are you late for school?\" When I looked at my watch it showed 7.30 a.m. \"I am not, Sir,\" It is just 7.30 now. I realized then my watch was running ten minutes late. \"Your watch doesn't show the correct time, boy; you better hurry to your class now,\" I blushed at the thought of my blunders and cursed my luck. My teacher reprimanded me for being late for lesson."
    },
    {
        "id": "b908b587a4c24886b46e8553d0926c87",
        "title": "The career I would like to choose",
        "content": "I believe that in this day and age when competition is rife among young people to get ahead in life, it is important to get an early start. One should know what one wishes to do with one's life. To this end it is wise to seek advice from one's elders as well as to research the areas of work you might have an interest in, inclination or aptitude for. The idea is to be exposed to as many views as possible. Professional counselling or 'Career Days' may be helpful in this regard.\n\nI am fortunate I suppose in that I am reasonably certain what I want to do with my life. I wish to. be a lawyer for I believe it to be a noble and dignified profession. It affords one the opportunity to be of help to others. To a large extent my uncle, who is a lawyer, is responsible for my choice of careers. My uncle has been practising law for the last twenty years and I find him to be knowledgeable in a great many things. My uncle is always fond of saying that a lawyer's trade always involves him having to know about what other people do as well. To put it another way my uncle may be described as a 'Jack of all trades'. Acting on his advice and that of my parents I have decided to work very hard in school so ultimately I will obtain results that are good enough for me to enter the National University. I will have to work hard as places for this course are limited and also much sought after.\n\nAt the moment however in Singapore there are a rather large number of lawyers and not everyone has a chance to work in the area he or she has trained for. This does not discourage me although it is a source for some concern for my parents. I am planning to take subjects in school that will be suited for my intended course of study in university. Although some may say that it is still much too early for me to narrow my choices or options in this way, I am committed to my goal."
    },
    {
        "id": "8ca329d176b74771bdbafba7db1ba063",
        "title": "Gadgets at home",
        "content": "One of the symbols of civilization is the many gadgets which one finds in a modern home. Many of these are acquired for the sake of fashion; some really for the convenience as they are efficient and time saving. Nowadays even an average home of middle class family has many of these gadgets.\n\nTake the kitchen for instance, there is the gas stove which works on Liquid Petroleum Gas. The stove is efficient, smokeless and at the same time comparatively cheap. Only one must be careful to see that there is no leakage of gas which would prove fatal. There are wet grinders and dry grinders which take away the chores of the housewife. In highly sophisticated homes they may have even dish washing machines. Then there is the fridge. This comes very handy for keeping things cool, for avoiding things getting putrid or stale, for preserving things and so on. Thus milk, fruits, vegetables, meat and fish are preserved. There is the electric toaster for toasting bread.\n\nThen there are other gadgets of utility like the electric iron, and sewing machine. The electric iron is helpful in pressing things; otherwise one will have to wait on the laundry which is very costly nowadays. The sewing machine is very useful since the family's clothes could be made provided of course the housewife at home takes interest in sewing and stitching. With the machine, the work becomes easy and in fact with some modifications in the machine many types of stitching could be done.\n\nThen there are the gadgets of recreation, like radio, television and disc and cassette players. To know the daily news and for hearing music the radio comes in handy. The disc and cassette players have taken the place of the gramophone disc; one definite advantage being the disc or cassette could be made and unmade. Music or speech could be easily recorded on the magnetic disc or tape. While the radio could be played only during stipulated hours, the cassette player has no such limitation. Now the disc and cassette players and the radio are found in one.\n\nThe rage of the day is television. Since it has the advantage of sound and vision it takes the place of the cinema. One can enjoy a program from one's easy chair or couch and one need not take the trouble to go to the theater. The color television makes things more realistic. Video cassette recorder is another device to watch programs of one's choice, particularly movies.\n\nBut one big question that often comes to the mind is, if a man is really happy with all these gadgets. There is always the law of compensation which works inexorably. Without the coming of gadgets man may not find much use for his hands and creativity may suffer. Unless one knows to shoot the periodical trouble with these gadgets, simply owning them may mean costly."
    },
    {
        "id": "8738fe570a92473bb9388775aebe6e6e",
        "title": "The dream I never forget",
        "content": "One of the human faculties which distinguishes him from others is that he is able to dream. However, one is not sure whether other animals dream; if at all they dream they have no medium to express it is just as the human. Every human being should have had dreams, some of them very pleasant, some of them bizarre and horrible; in the latter case a few have a hell of a life and they call it the nightmare. In a nightmare one may feel as if he is being choked or being drowned.\n\nIn a dream one feels all one does in wakeful hours, only the body does not move. Sometimes limbs may be moved and people have been seen to beat down their hands. Some cry and laugh, some shiver and weep. So dream is in a sense a semi-conscious state between sound sleep and wakefulness.\n\nIt should be interesting to know how dreams are caused but there are no valid theories. One thing is sure that something has been built up in the inner recesser of brains which get active accumulating concomitant interests. Very strange things appear in dreams for which there is no valid explanation. One thing is clear; some nerve center is stimulated, how God only knows, as a result many other nerve centers get into operation bringing in a chain of experiences. Things move fast and clear as on a cine screen and the subject taking part in it. The ancient belief was that some dreams foreshadowed the coming events. How far it is scientific we cannot say. Shakespeare uses dreams in his plays; for example in the play Macbeth.\n\nI too dream and had one recently, which may be of interest. I become a ruler of my country. Suddenly I find myself at the head of a procession, to be correct it is a motorcade and I am in a Cadillac. Huge crowds, men and women and children all in their fine dress line the route through which I am taken. There are victory arches and flags and festoons. Photo flashes burst and hundreds of photographers take pictures of mine.\n\nAt last I enter a massive mansion; the guards present me the honor. I am taken by well dressed courtiers to the throne. The reception hall is big and spacious; there are glittering windows and doors, and colorful chandeliers are hung from high roof. Colored light beams into the hall as sunlight filters itself into the hall thorough stained glass panes.\n\nAs soon as I sit on the throne, the courtiers cry 'long live the King'. Then a man approaches me; he may be the chief minister. He tells me respectfully that I must announce my concessions to the people who eagerly wait to hear me speak. I am a bit nervous at first but get over it soon. I tell them that the old system of paying one sixth of one's income as tax will come into use. I add that the tax may be paid in kind. I announce that there won't be any admission fee to go into theaters and the Government itself will run all the theaters and only healthy films will be exhibited. At one stroke I abolish child labor and education of children will be completely manned by the Government. I make it known that every town and village will have a play field where the young can play and the old can relax. The production of milk in the country would be stepped up so that everybody gets enough milk. I exhort the youth to develop robust health and sharpen their intelligence.\n\nThis dream did not continue long as my alarm clock began chiming, and it was time for me to get up and study. The sweet dream vanished like the snow before the morning sun but that was the best dream I ever had."
    },
    {
        "id": "72bc2e98dc874847a82c12c66628aed7",
        "title": "I am proud to be a citizen of my country",
        "content": "In his poem of patriotism Scott says if a man is not proud of his country, he will be buried without honor. When a man returns after a travel to his country he must be bubbling with enthusiasm and his heart must be pulsating with joy to land on his native soil. We have heard of great martyrs who sacrificed themselves for the sake of their country. So it is only proper and fair that one should love one's country.\nThere are many things why one must be proud of one's country. It may be due to the climate, natural regions, its people and the government, its tradition and culture and manufactures. The relation which the country has with other countries is also a point to be considered.\n\nConsidering the above norms let me say why I am proud of my country. My country has an equable climate. We are having bright sunshine throughout the year and plenty of rain. There are virgin evergreen forests. There are some good rivers, and hills and valleys make the country beautiful. The sea coast is not straight but has bays so there are some good harbors.\n\nOur people are quiet, hard-working and peace loving. They know their land gives them plenty in the form of grains and fruits and so one need not be hungry. The forests have natural wealth and the plantations are rich producing money spinning rubber. Our mines produce valuable tin making the country rich. We are a developing nation and a lot of good things will have to be done.\n\nWe have a good government which is democratic in set up. We have had a succession of enlightened rulers who have taken measures for improvement. The upheavals we see in some countries are practically absent in our country and the people are law abiding.\n\nOur country has had a long history of several centuries. Several cultures have flowed in here and so there we see a mixed culture. This is reflected in the way people dress and eat; the buildings show the effect of these overriding cultures. Our country has very friendly relation with the neighboring countries and we are held in high esteem. Considering all these I am proud of my country."
    },
    {
        "id": "78ead4d433c9473e891af5d5428ac0de",
        "title": "Fashion trends among teenagers",
        "content": "Fashion trends often dictate what we wear and how we act. When one thinks of fashion the idea of trendy clothes come to mind. However this is not the only concept of what constitutes a fashion trend. As an example in the nineteen sixties it was considered fashionable in America for men to wear their hair long, also people spoke in an altogether different manner using a lot of slang expressions such as 'groovy' or 'cool' to signify that something was agreeable to them.\n\nIn present day Singapore we can see that fashion trends have a dominating influence among our teenagers. Most of these trends originate from the West. Bell-bottomed trousers for both sexes once all the rage in the sixties are making a comeback on our shores. Platform shoes although very hard on the feet are very popular too, to complete the look. Perhaps most striking is the way the young people and some older ones have taken to dying their hair blonde, red and even green. Fashion trends in themselves may not be harmful unless taken to extremes, for example, piercing one's eyebrows or eyelids even. They are often merely a way for teenagers to express their individuality.\n\nWhat is sometimes insidious about these trends are that they help to promote a strong sense of wanting to belong which can have negative aspects. Peer pressure may be responsible for compelling young people to do things they would otherwise not indulge in if not for the fear of being a 'fashion outcast'. It is considered fashionable for young people to be seen at trendy night spots just as it is fashionable among some circles to consume the drug 'Ecstasy' because of it's ability to induce a feeling of non-fatigue.\n\nThe important thing to remember is that teenagers are at a very susceptible time in their lives when the wrong influences can easily take root and express themselves as hostile attitudes or rebelliousness. To a large extent we have to depend on teenagers to make the right choices based on the guidance we give them."
    },
    {
        "id": "1a9b337a52924d23bd472dee38bd301b",
        "title": "A distinguished visitor to my school",
        "content": "I study in a national type secondary school in Malaysia. It is in Selangor and is one of the progressive schools in the country. It is a co-educational school and prepares students for the 'O' level and 'A' level examinations. The school is lucky in having hard-working and intelligent members on the staff with an all rounder as Headmaster. In academic as well as sports our school has always been in the top of the list.\n\nFor National Day Celebrations, the Minister of Education was invited. He readily accepted the invitation. There was a tremendous preparation going on for a week for the celebration. A face lift was given to the school. Flags and festoons were hung up and in view of the Minister's visit invitations were sent to prominent persons of the town.\n\nThe festive day came. Our school hall where the guests were to be seated was tastefully decorated. The guests were received at the entrance by the Headmaster and the committee members of the school. The school band was in attendance. The Secretary of the school led the chief guest to the seat.\n\nAfter a formal prayer, the Headmaster read the welcome address in which he expatiated on the services of the honorable minister for education. One of the senior students garlanded the guest. Then the guest addressed the gathering.\n\nAt the outset he had a few words of praise for the school. He spoke highly of the members of the staff who had been working hard to make the students good citizens. Then he spoke of the greatness of the country which was shaping well in all fields. He advised the students to work hard and become great citizens because he said the future of the country depended on the quality of its citizens. So the students as future citizens must become big mentally, physically and spiritually. He exhorted the students to develop a national outlook and at the same time they must develop their faculty to appreciate the international situation. He asked them to be prepared to contribute their part for the well being of the country. He advised the teachers to look for the aptitude of students and develop their skills accordingly. He asked the students to spend more time in the laboratory, in the library and on the play fields. He said that an industrious nation would always flourish.\n\nOne of the senior members of the staff thanked the Minister for having come and for giving some valuable advice. He assured the minister that the teachers would play their part well and would not lag behind in doing their duty to the country. After the singing of the national anthem the meeting came to a close."
    },
    {
        "id": "33f6cde9afde4a6184585266e6f270fe",
        "title": "A fashion show",
        "content": "Fashion show is one of the ways of advertisement. This is to attract the attention of the public and to educate them on the coming fashion. Unlike the advertisements in the news papers, a fashion show has the glamour of music, color, light and all theatrical effects. Since live models are used, it becomes very realistic and the audience has got a chance to see, discuss and criticize, and have some fun at the expense of the models. So there is no denying the fact that the fashion shows have become the fashion of the day and they have become pace setters of a fashion.\n\nThus recently I had an occasion to attend a fashion show organized by the Textile Mills Association and the Garment Makers' Guild. This was held in the City Hall on a Sunday so that more people could attend. The hall was very tastefully decorated. The stage was set in such a way that the models could be viewed to advantage. The lighting was first class with concealed lights and provision for color lighting. Admission was by special invitation; otherwise the organizers could not control the crowd. Since my father received an invitation, we went to the show. Soft music was played to enliven the show.\n\nThe models were selected ones who had been taken for their attractive personality. There were men's, women's and children's models. One by one they paraded on the stage and when they came there and walked across the stage showing their dress to the audience, some salesman at the microphone would describe the fabric, the name of the mill that had produced it and the name of the fashion. At the same time, printed forms of the fashion was distributed to the audience.\n\nMen wearing office dress, casuals, hunting dress, sports wear and dinner dress appeared on the stage. The Olympics suit especially created for the Olympic games was shown. A team of athletes wearing the suit paraded on the stage. Women in all types of dresses both oriental and occidental were there. The materials of which their dresses were made varied from cotton to polyester. There were women wearing Indian sarees, Japanese Kimonos, Bikinis and swim suit and Maxi's. There was also a model who was wearing a casual dress made of paper. The announcer said that the paper dress was cheaper and disposable and it could be used in the operation theatres and so on.\n\nIt was not all a show of the grown ups. There were children between three and eight, both boys and girls who presented the latest version of children's wear. Some of the children who appeared on the stage were very smart and they enjoyed the fun.\n\nWhat attracted me most was the beach dress which when worn could give a camouflage effect. Besides it was said that the material was waterproof, non smelling and light.\n\nIt was a delightful show and the audience had an enjoyable evening. The fashions book which was for sale was in great demand. So there is no gain saying that I too enjoyed the show very much."
    },
    {
        "id": "68824aa463bc43e78438bcca64e25c55",
        "title": "Silver wedding day of my parents",
        "content": "It was at dinner time that we learnt quite casually that it would be twenty-five years by March next since our parents got married. Our parents are a very loving couple who adore the company of each other. But we brothers and sisters felt that something must be done to celebrate the occasion of silver jubilee of our parents' wedding.\n\nWhen we broached the topic our parents smilingly brushed aside the idea; nor were they keen on the celebration. They seemed to feel to be a man and woman, a blessing of God and this fact need not to be trumpeted. But we insisted on having a celebration; only we needed their blessing. After some serious thought they gave us their consent to go ahead.\n\nOnce we got the permission, we had to prepare for our program. But we agreed that whatever we would do, it must be secret till the day so that there might be a surprise on the day.\n\nSo we sat and planned. My eldest sister said that we could present some memento in silver which would be apt for the occasion because we were going to celebrate 25th year of the wedding. She went even to the extent of suggesting what could be the article. It might be a carved silver plate or a silver tea set. She felt rightly too that the gift must be one which could be of some use instead of being confined to the showcase, as memory.\n\nBut I thought of throwing a party for selected friends and relatives. This would be an occasion for a get together and free mingling when we could hear our elders talk about the good old days.\n\nMy younger brother had some nice ideas to put forward. He spoke of arranging a picnic when we could freely enjoy nature's beauty while at the same time pay homage to our parents. As an alternative he said we could re-enact the marriage of our parents. That would bring great fun and perhaps my parents themselves could enjoy the joke. But we were doubtful how far our parents could comply.\n\nI had almost a novel idea and said that the money we hoped to spend might be made into an endowment, so that the income could used for some good purpose. However laudable the proposal was, all of us could not agree to it because the amount we hoped to spend might not be that big and then there was no meaning in getting the money from parents to be reinvested.\n\nThe discussion was long and nothing final could be decided because each one of us had our own views. Then we struck a golden means of taking something from each one's suggestion. We finally decided to give father a nice unbreakable brief case, to mother a silver framed mirror and a silver jug. We decided also that we could hold a small party of selected friends and relatives. The idea of picnic which the younger fellow so vociferously advocated was, not dropped either. It was clearly understood that we could go to a pleasure spot not far away from our town.\n\nHaving planned thus we unfolded it to our parents who felt very happy and promised us help in the execution of the plan."
    },
    {
        "id": "dece5a3fa7f2457397fad280fa75c81e",
        "title": "English : Why it is important to study the language",
        "content": "One may ask why is it important that we learn how to speak English in our schools? After all we live in a region of non-English speaking countries. Would it not be better perhaps to learn the languages more commonly spoken in our part of the world? In fact the most populous country in the world is China which accounts for more than fifty per cent of the world's population. the Chinese people don't speak English but rather Mandarin or their individual dialects.\n\nThe answer would be that traditionally the cultures of the world have come to be. broadly classified into two groups the Western and the Eastern cultures. English has come to represent the means of communication in the West. With more and more gateways being opened to Asia it is imperative that one language be adopted to suit our needs. As the people of Asia speak a diverse variety of languages it would appear that English would be the logical choice.\n\nIn Singapore, English is the National Language in a country with a mixture of races. Singapore is also a focal point for trade with the West in this part of the world. English is taught as a language in our schools to reflect it's importance in our society. If this were not so, there is a good likelihood that in time the strong influence of individual cultures here would result in people only being well versed in their mother tongues. However Singapore being a former British Colony and the present education policy have seen to it that most Singaporeans are bi-lingual, that is able to speak English as well as their mother tongues.\n\nAnother factor which has promoted the use of English as a medium of communication here in Singapore is the rather significant expatriate community here. The process of globalization is not restricted to trade alone but also covers all aspects of our life. The important thing to remember however is that we should not sacrifice or compromise on our unique cultural identity in order to keep up with the pace of globalization."
    },
    {
        "id": "ab89d13dfffb4d0faa1378414e5f7e81",
        "title": "Animals which help man",
        "content": "Man is not only denizen of this wonderful world of ours. He says he has inherited this earth; so too are other animals of the earth. It is sheer arrogance not to admit our dependence on other animals. They contribute not a little to our welfare. Even the so-called wild animals have some part to play in our lives on earth. Now let us see how some animals help man.\n\nThe first and foremost is the cow. Who can deny that one does not enjoy a cup of milk? Next to the mother's milk, the cow's milk is the best for all, especially for children and the sick. From milk, butter, cheese, ghee etc. are made. Skimmed milk is also nutritive. Further, milk goes into the manufacture of sweets. The male of the cow, that is the ox has been used as draught animal from time immemorial. So the farmer uses it for ploughing his field, and for pulling his cart.. Milk is so valuable and in great demand that dairy farming has come to be one of the major industries. The animals are slaughtered for their meat. Some countries like Australia, Argentine and the United States have vast cattle ranches which supply world's meat.\n\nNext to the cow is the horse. Man's civilization has a lot to do with the horse. Till recent times, the horse was used for riding, ploughing and pulling carts. In olden days, armies were proud of their cavalries, that is horse troops. Even today horse races are very popular and perhaps a costly pastime. The race horses are worth thousands of dollars. The horse is a very noble animal and very sensitive too. The Arabian horses are famous even today.\n\nThen we may mention the sheep. In the matter of number and use, the sheep stands foremost. The sheep supplies man with wool for his clothing and meat for his table. In cold countries the sheep thrives very well and the wool is found very useful in the manufacture of warm clothing. The lamb is a symbol of innocence.\n\nThe list will not be complete without the mention of the dog. The dog was as wild as the wolf. How it came to be domesticated, is a matter of speculation. But one thing is certain, from the dawn of civilization, the man and the dog were friends. They have found each other's company useful. No other animal is so faithful and sincere as the dog. There are very many kinds of dogs. Some are good at hunting; some are vigilant and house-keepers. Some are beautiful and so kept as pets. The dog's sense of smell is so highly developed that it is used by the police in tracing criminals."
    },
    {
        "id": "eb78da1784ca4a1aa3783a25ba248bf0",
        "title": "My school library",
        "content": "Our school library is one of the assets to our school. It is the treasure house of knowledge, past and present. It is so because the world's mighty brains are represented there through their works. Just a glance would show that the names of great writers of the world are found side by side in the shelves of our library.\n\nOur library is a quiet spot in our school. It is housed in one of the wings of our school building. Gilded volumes decorate the glass chests. There are different shelves for different languages. Thus one finds books on English, Chinese, Malay, Tamil and so on. For each language, books are classified under different heads. Thus there are books on drama, prose, poetry, etc. There is also a number of reference books. The walls of the library are decorated with portraits of great writers.\n\nThe library is very well equipped for comfortable reading. Cushion seats are provided for students to use during the day. One can take any book from the shelves, sit there and read undisturbed by anybody. So one can find a number of boys and girls there in the evenings reading books.\n\nAnother attraction of our library is the reference room. A number of dailies, and magazines are regularly received. The illustrated magazines are the attractions for us, students.\n\nThe library service is very efficient. There is an able librarian, who is also well read. One can have a free access to the shelves and pick up any book one likes. There are two index cabinets, one according to subjects and the other according to the authors. So one never finds it difficult to choose the right book.\n\nThe library is very well utilized both by the students and the members of the staff. The students are well trained in silent reading. The library is a very useful place for self study. When assignments are given by teachers, students make full use of the library to their advantage. Thus our library is a place for intellectual work in our school."
    },
    {
        "id": "d87d2327d2784a41b6aec06339458988",
        "title": "Road accidents",
        "content": "Almost no day passes without the morning paper, bringing some news about one or other of the road accidents. The more civilized we grow, the more we are prone to road accidents. Why is it so? There are many reasons for such accidents. For instance, there are the fast moving vehicles. In big cities speed and greater speed seems to be the rule. So when one vehicle tries to overtake another, gruesome accidents may be the result. It is not uncommon to read in the news papers that on festival days, good number of accidents occur. As a result there will be a number of deaths.\n\nAnother reason, perhaps a major one, is the lack of road sense, among pedestrians. Every one must use the road but everyone should also know how to use the road. The pedestrian and the cyclist are often the victims of road accidents because they don't keep to their end of the road. School children must therefore be taught how to take to the road. The cyclists are very often the victims of their own folly. They indulge in gay riding, two or three abreast obstructing the vehicular traffic. The result is, as one understand the accident.\n\nAnother cause for road accidents, is the unmanned level crossing. The train may be coming. A car or a cab would try to cross the level crossing and would be hit. So a lot of precautions must be taken at level crossing. They should on all accounts, be provided with gates and perhaps also alarm signals.\n\nMechanical troubles may be another reason for road accidents. The motorist will not be able to control the vehicle, hence the accident. To avoid accidents periodical check up of public vehicles must be insisted on.\n\nAnother cause of the accidents is the poor vision due to fog. This very often happens in cold countries. To avoid this, warnings are being given about the fog condition and visibility. On wet roads sometimes, the tyres skid, resulting in accidents. To avoid accidents, as in the case of health, prevention is always better than cure."
    },
    {
        "id": "7c429aff98754f52a2e6d95840f39a2f",
        "title": "Vandalism",
        "content": "Vandalism is wilful and deliberate destruction of public property by anti-social and irresponsible citizens. It can be of various forms. It is not uncommon to see that the walls of buildings are defaced with scratches or ugly marks. Another target of vandalism is the bus shelter. Scratches on the newly painted seats or even broken seats at these shelters hardly escape the attention of those who wait there for the bus. If we travel by bus we will find that seats are often ripped open and the foam pulled out or vulgar writing on the back of seats.\n\nWhat causes this kind of behavior? The reasons are many. Some youths show hatred for the society and its values. These irresponsible citizens out of frustrations in life are tempted to do these undesirable acts of vandalism. They do not have a sense of belonging or loyalty towards their society or nation. In some cases it could be for drawing attention to themselves or just a desire to see their names written in prominent places.\n\nVandalism is not exclusive in our society in Singapore, it could be a social ill in other countries too. Although there are strict laws to prevent vandalism in every country it is rather impossible to enforce the laws strictly. One way to eradicate or reduce the rate of vandalism is to instill civic sense into the citizens, besides of course, the introduction of compulsory education up to the age of sixteen. Vandalism can be curbed to some extent if the government law imposes severe penalty on those caught in the act. But the permanent solution is inculcating the right values including respect for public property in all the young citizens. If people start regarding that public property is their property, they will not want to spoil it. Schools can provide a healthy atmosphere for children to form healthy attitudes and this in turn would make them realise the values of discipline in life.\n\nAll of us should realize that we deprive our children of their heritage if we deface beautiful things and damage public property."
    },
    {
        "id": "201310f5cbf7437189194c6ae31090a9",
        "title": "A market scene",
        "content": "A market is a place where we buy vegetables, fruits, fish and meat. It is the biggest concentration of noise every morning. It is filled with a crowd of mainly buyers.\n\nThe Central Market in Kuala Lumpur is not only a landmark but is also one of the best attractions in the city. It is really an experience to go round the stalls during their busy hours. If you happen to be careless about your wallet beware of the pickpocket.\n\nBusiness at the Central Market starts in the early hours of the day. Vans and lorries bring loads of fish and meat to the vendors. Usually nonperishable things are brought overnight. But green vegetables are brought early in the morning. The smooth and efficient working of the market is really appreciable.\n\nThis market is in a huge concrete building. The stalls are arranged in beautiful rows, They are also classified according to the goods they deal with. Fruits, vegetables, fish, fowls and meat; - all have their respective dealers. There are also the platform vendors who add to the confusion of the place. Each class of vendors also has a portion allotted to them.\n\nNice things are being sold in this market. Buyers and sellers, haggle and haggle over prices. They push and jostle to get the best offer. In addition it is also filled with the angry voices of buyers and sellers. Now and then, a fellow will come to you with an old pen or watch; be careful before buying. It may be a stolen stuff and you may be get into trouble with the police. In the midst of all these confusions, the sellers do a brisk trade.\n\nThe market is under city authorities. So health inspectors are responsible for its cleanliness. They have to see that the food stuffs that are sold are free from defects. Thus unscrupulous stall keepers and vendors are warned against selling rotten, unpalatable or poisonous food stuff."
    },
    {
        "id": "82ed71a61e0b43768b1efbced1775ffd",
        "title": "My best teacher",
        "content": "During my school life, I have come across several teachers. None has impressed me so much as our English Teacher. Courtesy requires that I don't give his real name here. For convenience, I shall call him Mr. Leo.\n\nMr. Leo has been teaching me English for the last two years. He is a very lovable person, soft spoken and good mannered. He is not a giant in his stature but it is very well made up by his intellectual attainments. He used to come, neatly dressed. There may not be anything gorgeous about it but he always dresses in an elegant way. He used to move about quietly, though he always bears an assured look of a scholar. Naturally therefore, everyone respects him.\n\nIt is a pleasure to listen to him when he teaches English whether it be prose or poetry and he would leave his mark on it. There, is nothing bombastic in his use of words, because he always uses very simple ones, so that even an average student could follow him. He has always been very methodical in his approach. He would never proceed further unless he has made everyone understand the passage. When he finds somebody has difficulty he would spare no pains to make the student understand.\n\nHis teaching of poetry has been marvelous. He would simply get into the spirit of the poet. Gifted with some histrionic talent, he would carry the whole class with him in the enjoyment of the poem. Whether it be \"Oh! Captain, My Captain!\" \"The Solitary Reaper\" or \"Patriotism\", he would impress the class, with his dramatic teaching. For all these things, he has been a very good coach so far as the examination is concerned. But he used to say, that examination is not everything.\n\nDuring his leisure hours, he can be found in the school library browsing among literary magazines. One can approach him easily and have doubts cleared. By his knowledge, character, and day to day life he leaves a profound influence on the intellectual and moral character of his pupils. He leaves the permanent stamp of his personality on their moral character. One great quality in him is that he never bears malice towards anybody. He is a model for all teachers. May his tribe increase!"
    },
    {
        "id": "bf4bff4b83724910b9e9c52a71bd9f68",
        "title": "An exciting picnic in Sentosa",
        "content": "During our last school break for the millennium my classmates and I decided to make the holidays one to remember by planning a visit to Sentosa Island. There were fifteen of us in all and we eagerly set down to discussing the trip. We decided unanimously that no girls would be allowed as this was a boys only trip.\n\nWe set out bright and early one Sunday morning for Sentosa by ferry from the jetty of the World Trade Centre. We could barely contain our excitement. The first thing we did upon landing on the pier at Sentosa was to make our way single mindedly to the monorail. We boisterously boarded the monorail for a trip around the island. The train took us along a narrow track through lush green foliage and valleys. We were spellbound by the scenic beauty all around us. Alighting at the terminal station near the jetty, we walked straight to the park where we strolled along the well worn paths for a while. Then we sat down for a while and talked over what to do next.\n\nWe first visited the Coralariums where we saw a variety of coral fishes and other marine creatures. The so called lion fish caught our attention with it's strange form and coloration. It was easy to see how it derived its name. Little did we realize that coral was a living organism! Our next stop was at the wax museum which displays life size figurines of men and women who have left their mark in history. The figurines were so life-like that one almost felt like reaching out and touching one and at the same expecting it to react. We recognized some of the figurines from our history books but were at loss as to who the others were.\n\nEqually exciting were our next two stops, namely Fort Siloso and the Insectarium. Among all the sights we experienced that day the most captivating was the Musical Fountain. We spent some time there just watching the surroundings and listening to the music wafting through the air so soothing to the ears. We began to feel hungry just then so we promptly wolfed down the sandwiches we had brought from home.\n\nLater that afternoon some of us went down to the beach for a swim. There were a number of tourists there, mainly Japanese, who were enjoying the beach as well. As it was getting late in the day we decided to go back home. Our launch brought us back safely to the World Trade Centre at about seven in the evening. We took along with us memories of beautiful Sentosa."
    },
    {
        "id": "4863c2a2d99742fca5b6fa6b090c5640",
        "title": "My favorite subject in school",
        "content": "In school a student has to study many subjects such as English, Mathematics, Science and Geography among others, in order to prepare himself for an examination. Not everyone likes the subjects he or she studies in school. Students have their favorite subjects and they tend to pay special attention to them in class. They are willing to go that extra mile, so to speak, where these subjects are concerned. More often than not they also perform better in these subjects during the exams.\n\nFor me my favorite subject is Biology, a branch of Science. This is because it teaches me about the human body, animal life and about plants. I like to learn and understand these subjects more than others. I learn with great interest the different parts of my body and their functions. It is important to know how human beings respire and how food digests in our bodies. We also learn about the bones, muscles and ligaments which make up our very form and aid us in our movement. How we come to experience pain and other sensations through a network of fine channels called nerves which conduct very small electrical currents. We then begin to realize the true complexity of the human body.\n\nThe study of animals also fascinates me. I came to know about the various breeds of mammals, birds and reptiles. Both big and small mammals that live side by side in the forest and grasslands. I am curious to know how they survive in the wild. Wild animals like lions and tigers prey on weaker animals like deer and zebra yet they co-exist in such lands. There are relationships between animals that are even beneficial to both parties and are called symbiotic. My desire to know more has compelled me to watch documentary films on animal life.\n\nScience also teaches us about the plant, life. It allows me to differentiate between species of plants. It explains how they produce their own food and react to external stimuli. Our class experiments have shown us the extraordinary ways plants adapt themselves to survive under different conditions. The practical nature of the experiments allows us to see first hand the science of Biology in action. I consider Biology as one of the most useful subjects for a student as it teaches him or her about the basic facts of nature. However this is not to say that one should neglect other subjects."
    },
    {
        "id": "261299ae8a444c038ab74b8dfcdaca64",
        "title": "Television and its influence on viewers",
        "content": "Television is a very powerful visual medium. Practically every household has one. Unlike radio the messages and ideas that are conveyed to the viewer are further reinforced by visual images that accompany these messages and ideas. It is a fast and inexpensive medium by which to communicate with the masses. Satellite dishes and all kinds of other receiving devices enables us to not only to receive news and programs from within the country but also transmissions from abroad. In some countries viewers may have access to a hundred or more channels through their televisions.\n\nIt is however important to note that communication in this setting is one way and not interactive. Considering that hardly a day passes without watching TV, it indeed has the potential of having a strong effect on us. For the discerning viewer being able to differentiate between which programs have useful content and which do not, this may not be a problem. However when we are dealing with impressionable young minds it may be difficult for them to separate reality from make believe.\n\nResponsible censorship by the authorities and careful monitoring by parents is necessary to ensure that young people are not adversely affected by watching this medium. The phrase 'couch potato' has been coined to describe viewers who are constantly in front of their television sets. Their senses are continuously only subjected to the images they see sometimes for the better part of the day. Violence is a common feature in most entertainment programs to the extent that films have to be rated accordingly as most scenes are too horrific for younger viewers.\n\nTelevision is not all bad as there are positive aspects to it. Educational programs nowadays incorporate all kinds of ways to entertain as well as to educate. Programs such as 'Sesame Street' have a large following among children. Documentary films are informative and instructional. The expression that 'too much of anything is bad' applies here. The idea is for viewers to have a healthy balance of the different kinds of programs available."
    },
    {
        "id": "631b491392bb4ce9ad3ae7b880be700b",
        "title": "Shopping",
        "content": "For getting one's things, one has to do some shopping. Sometimes shopping is undertaken for fun. Shopping on special occasions, is really exciting. For example, when one goes shopping on the eve of Hari Raya Puasa, Deepavali, Chinese New Year or Christmas, the experience is really exciting.\n\nShopping is not simply buying things for our needs. It is much more than that. First of all one must know what one wants to buy. He must know, where those things are available. In fact, this is not a problem in a small place but in a big city, one must know where different things are sold. There may be, chain stores, selling things at a higher price. The same things may be had at a cheaper price at a grocery. Then there are the genuine goods and the spurious ones. Unless one knows one is likely to be deceived. This reminds one of the famous chapter in the \"Vicar of Wakefield\". Moses went to the fair, to sell his mare. He was deceived by a sharper, who exchanged the mare for a gross of silver spectacles. When Moses returned home, he found they were not at all silver. This may happen to anybody unless one has the wit and wisdom. Shopping requires some experience of the market.\n\nShopping requires bargaining ability. It is not always fixed prices in all markets. So one must be able to bargain. It requires certain ability to choose the right stuff. For instance if one goes into a big cloth shop, one finds it easy, one must have made up his mind as to what stuff to get. He must be careful to see whether correct weights and measures are being used. It is here that very often people are deceived.\n\nShopping, during week end is really exciting. One has to wend through a stream of shoppers. There will be, the crowd of roadside vendors crying their wares. One must not be tempted to buy all and sundry, otherwise, he will find he has wasted his money. In fact shopping is a good school, where one can learn about men, moods and manners."
    },
    {
        "id": "6e7cd9db1dd648bab12fe565046cce31",
        "title": "My pet",
        "content": "Rosy, is a dog which I have been keeping for the past four years. It was sheer accident that Rosy came into my hands. Our neighbor Mr. Jones was a dog fancier. He had a good kennel in his house where he reared different breeds of dogs. Suddenly, he got transferred from the town and he wanted to dispose of some of the dogs. He was talking about it to my father. Then I told my father that we could have one of the puppies; though reluctantly, my father agreed. Thus, Rosy came into my possession.\n\nWhy it was named Rosy, I can't say. It is an Alsatian. She is of medium height. She is grey colored with dark spots near her belly. The dog has a bushy tail and glistening eyes which has grown wonderfully well and can easily be the envy of many.\n\nRosy, can be seen about our house when she is not engaged in playing or when she is not sleeping. She takes pleasure in sneaking about the corners when she has nothing particularly to do. She is as docile as a dog in our presence. When we are not there she will be in her mettle. None can easily come near our gate. Though she doesn't bite, she will bounce on the person and paralyze him. Since the postman regularly comes, she recognizes in him a friend and so does not do him any harm She will try to catch the sparrow and it will be a splendid sight to see.\n\nI give her a Spartan food. She takes some biscuits and milk in the morning and meat mixed with rice in the afternoon. Usually she is not given any food in the night. When we are at our table, Rosy keeps company with me but she shows no eagerness to touch even a crumb unless offered. So my father likes it. Rosy cries in a peculiar way. It is between barking and howling. Sometimes, she raises a cry like moaning. That means she wants to go out to relieve herself.\n\nWhenever I go out in the evening, she accompanies me. My friends are afraid of her because she doesn't like silly mischief of boys. She shows her displeasure by a big bark and that is enough to unnerve the boys. My father says, Rosy would soon become a mother. Then I will have a litter of nice puppies."
    },
    {
        "id": "eb1e93bc963f48b1b2808fdeb573f875",
        "title": "The country which interests me",
        "content": "There are many countries in the world, which one would like to visit. Each one has its own characteristics in architecture, the way of life of its people, landscape, etc. I would like to visit Japan, if I have enough money to pay for the travel.\n\nGiven the first choice, I would like to visit Japan because it interests me most. For one thing, the Japanese are a vigorous people. Height may be a disadvantage to them but it is not reflected in any of their activities. As a rule they are a very busy race. Nothing can equal their industry. Geographically placed as they are, they have to be industrious with pluck and courage. The Japanese islands are subject to volcanic eruptions and earthquakes. Very often the typhoon hits the country. So the people have developed a courage and perhaps a philosophical outlook of life. They have learnt to be industrious for survival.\n\nJapan can be said to be a modern nation for its recent history which starts from 1905. From then on Japanese have been progressing by leaps and bounds. They became a very powerful industrial nation competing with England and America. Their goods are found in every market. But they became ambitious and wanted to have territories overseas. This involved them in the second world war. At first, they were victorious but in the end they had to face a shameful defeat. But the wonder is they have been able to rebuild their country within twenty years so well. The secret is their industry.\n\nThe Japanese are said to be the neatest people on earth.\n\nThey want to keep everything about them beautiful. Thus even a small house will have a neat garden with artificial hills and pools. The interior will be decorated simply but elegantly. Their national dress also shows their sense of beauty. Even taking tea is almost a ceremony for them. So Japan is the country which interests me most."
    },
    {
        "id": "0662c23ca677499b9fd011f5fda9768c",
        "title": "The sport meet in the national stadium",
        "content": "Sports lovers here always look forward to the month of August or September because there is the Inter School Sports meet at that time. Such occasions are very colorful and attractive. Just like previous years, this year also, the meet was enjoyable.\n\nThe sports were held in the National Stadium. The stadium was cheerfully decorated for the purpose. The rubberized tracks were neatly marked in white paint. The sports officials wearing their official badges were busy the whole day. At about 2 p.m. that day, there was the march past by athletes in their respective school colors. The Minister of Sports and Culture took the salute. With the singing of the National Anthem and the hoisting of the National Flag, he declared the meet open.\n\nThere were many interesting events, separately for boys and girls. The competitors were tense and serious. They were excellent specimens of physical fitness. Some new records were set. The 100, 200 & 400 meter races, the hurdles and relays were some of the interesting track events. The girls' events added color and mirth to the spectators. Among the girls' items the tug-of-war was a never ending source of merriment. Throughout, our school band was in attendance.\n\nAfter the events were over, the Minister of Sports and Culture gave away the trophies and certificates to the winners. He complimented the athletes on their performance. The Secretary of the Inter School Council thanked the distinguished guests. With the singing of the National Anthem, the meet came to a close.\n\nIt was on that particular day, I shared the atmosphere of real joy and excitement. One of the most enjoyable days in our academic life, thus drew to a close."
    },
    {
        "id": "f47aef1888be4cdab9d5b714edaf9910",
        "title": "Wild animals",
        "content": "Some people believe that wild animals should not be killed or disturbed. Others say, when development takes place rapidly, wild animals cannot be protected. But the truth of the matter is, there is some urgency in protecting wild life. Let us see what it is.\n\nWhat we call wild life, is it so wild? Man in his selfishness, or may be out of fear, looks upon some of these animals, as wild. As a rule, no animal attacks a person, deliberately. If one intrudes into the haunts of the wild animals, they attack and kill him. Simply because some of the animals live on other animals they should not be considered wild. If that were to be the standard, man who slaughters tens and thousands of animals for his food, must be wild indeed.\n\nEverything in nature has its part to play. Taken a broad view of things, nothing is superfluous and nothing is wasteful in nature. There should be a balance by their own right. If the tiger does not prey on the deer, the number of deer in the forest will grow out of proportion and will prove a menace to the plant life. The hare may be innocent but in large numbers it is also bad. The balance is set by the wolves and the wild dogs. Thus there seems to be a natural controlling mechanism in which the wild animals play a significant role.\n\nThe danger from them apart, most of the wild animals are very beautiful. What a beautiful thing is the tiger! How majestic is the lion! Even the sluggish hippo has got some power. Wild animals should include rare birds. There is a complaint that they are being destroyed indiscriminately. Even the snakes have a part to play. Where they have destroyed snakes, the rats are proving a menace. As the snakes live on the rats, the rat population is controlled. Man in all his selfishness tampers with nature's ways and ultimately he will be the loser. The wild animals have got a definite place in the economy of nature. They must not be destroyed but preserved."
    },
    {
        "id": "9d1a35b0b4174fe191076d73aa4b42e5",
        "title": "My best friend",
        "content": "I have a number of close friends both at school and outside of it. Although I am close to all of them I like and respect a particular one above the others. He is Peter my best friend. Peter and I go to the same school and live quite near each other. It is therefore no surprise that we may often be found in each others company. Peter's house is like a second home to me and vice versa. Peter's parents are also close family friends of ours. As both Peter's parents work, Peter is often entrusted to my mother to watch over when they are away at work. My mother doesn't mind as she considers Peter one of her own.\nPeter is my best friend for a number of reasons. I can always come to him for advice on any difficulties I may be experiencing and I value his advice as it is sensible and very practical. Everyone who knows Peter says that he is very mature for his age. It astounds me how much Peter knows on a variety of subjects. He is well read and never ceases to try and instill the reading habit in me. Needless to say it is Peter who helps me with my school homework when I encounter problems. I remember the time that I foolishly joined a few friends from school and experimented with cigarettes, Peter as a school prefect found us out and was duty bound to report the matter to the disciplinary teacher. All of my friends who were involved in the incident thought that Peter was simply being a tattle-tale but. I knew that Peter took his responsibilities seriously and only had my well being in mind. I often wind up in difficulties through my own doing and Peter is always around to bail me out without expecting any gratitude or explanation, his friendship is unconditional.\n\nOur teachers and friends at school have taken to calling us the 'Two Musketeers' as we do everything together. It seems that some of my interests have rubbed off on Peter as we are both in the school debate team. I quite enjoy public speaking but Peter dreads addressing crowds as by nature he is a very reserved person. I suspect he finally gave in to my constant cajoling and agreed to join the team. What Peter really enjoys is sports. He excels at football and track and field events. He has won numerous trophies for the school at inter-school sports meets.\n\nPeter is admirable as a friend and a person and is well spoken of by everyone who knows him. I am glad that I have his friendship and feel that I have grown wiser as a result of it."
    },
    {
        "id": "99041e7df0ae4e6186ca9b3ce7476ea5",
        "title": "A day in the life of a housewife",
        "content": "People may think, that everything is all right at home, because menfolk are able to go to office in time and children are regular at school. When they return home in the afternoon, they find pleasant life again. All this is possible because of the care and sweat which my mother is able to bestow on the smooth running of the household affairs. This is almost true of all homes.\n\nNow let us look into a day in the life of my mother. She gets up quite early in the morning. She attends to the cleaning of the house. By that time the bread-van arrives. She receives the bread and starts the cooker for morning coffee. While water is boiling, she may attend to small duties. Young ones are to be attended to after their toilet. Now the water hisses in the kettle and she prepares coffee. Children are given horlicks or ovaltine. Elders are given their cups of coffee. There may be comments from the elders and cries from the children. For all these my mother stays calm. She moves about with a philosophic attitude.\n\nThen she prepares the breakfast. At the same time, she attends to washing of clothes and bathing of children. In between she will be attending to the vegetable vendors or giving directions to the maid-servant. Now it will be time for breakfast and it is always an ordeal for her to serve the breakfast in the midst of noise raised by children. Then children dress up for school. Even then, my mother will have to attend to them. Every day some scene will be enacted at that time and she goes about taking them as a routine matter.\n\nOnce the elders have left for office, mother breathes a sigh of relief. Now she can go about her chores in a somewhat leisurely way. She bathes and plans for lunch. When it is ready, she waits for us to return for lunch. After lunch she takes a little nap. She can do some stitching and tailoring. She mends children's clothes. If time permits and if her hands are free she may spend some in talking with her friends.\n\nIn the evening father returns home and we are served with tea. Again noise starts. While preparing the dinner, she attends to the younger ones in their studies, helping the one here and the other there. After the dinner, she has some time to talk family affairs with our father. Sometimes she may turn on the television, if there is any interesting programme. Children comfortably laid in their beds and doors secured, she is the last to go to bed, only to begin her arduous day the next morning. Thus she is a picture of patience and service."
    },
    {
        "id": "31c32333121846368abaae57ad96f089",
        "title": "Criminals : A threat to society",
        "content": "Compared to some countries Singapore is relatively crime free. This is due in no small part to our efficient police force and court system. The police alone however would not be as effective as they are if not for the public spiritedness of most Singaporeans. This plays a very important part in keeping the crime rate down in Singapore. Cooperation between members of the public and the police force in the form of information given by members of the public to prevent or solve crimes is vital. The Police on their part are always finding new ways to foster closer ties with the public through the formation of neighbourhood beat bases as well as orgarnising community functions.\n\nCriminals are often than not individuals who do not fit into society as they are unwilling to accept the basic rules that govern our society. Some of the reasons put forward by the experts are that these people often come from broken homes and do not have the benefit of being instilled with proper moral values. However the rise of white collar crimes in Singapore would seem to suggest that this may not be the only possible factor. Sometimes greed for material wealth may compel a person to embark on a life of crime despite his family background. Whatever the reasons may be criminals pose a real threat to the well being of our society.\n\nThis can clearly be seen from the rise in drug-related crimes over the last few decades. This is a real cause of concern for the authorities as criminals engaged in the trafficking and distribution\nof these illegal substances have targeted a very important segment of society, our youth. The number of young people addicted to drugs is on the rise. What is more disturbing is that some of these youths turn to committing petty crimes like extortion and shoplifting to support their habits.\n\nThe future of criminals in this country however is very bleak as our justice system will ensure that they are dealt with severely. Also drug rehabilitation programs instituted and run by the government have gone a long way to return some of our wayward youths to leading good productive lives."
    },
    {
        "id": "94ec330e7e764e719c8a73e58599ff37",
        "title": "Life threatening disease : Aids",
        "content": "Aids or Acquired Immune Deficiency Syndrome is a sexually transmitted disease that is lethal. People with Aids acquire it through contact with the body fluids of an infected person. This may occur in several different ways, through sexual intercourse, blood transfusions and the sharing of syringes as is the practice among drug addicts. Some people are merely carriers and do not suffer from any of the symptoms associated with Aids. In others the Aids virus lies dormant in their bodies for a period of several months before there are any outward signs of it's presence. In both cases the disease is capable of spreading rapidly due to non-awareness.\n\nAids is particularly lethal because the virus breaks down the natural immune defenses that the body has against other diseases which may be common or otherwise. An Aids sufferer with a case of the common flu may have it develop into something more serious and life threatening due to the absence of these defenses or anti-bodies. Such a person must be extra vigilant against any form of bacterial or viral infection. Our environment is saturated with these microscopic organisms and it would be practically impossible to avoid contact with them.\n\nPerhaps what is more painful to these people is the way they are treated by ill-informed members of the public even their family and friends. Contrary to popular belief the disease does not spread by casual physical contact as the Aids virus cannot survive for long outside of a human host. The fear of contracting or even being close to the infected person causes people to generally shun these\nunfortunate sufferers.\n\nThe government aware of the very real threat the disease poses especially among young people, has embarked on various programs to educate the people. The best cure is prevention, casual sex with unfamiliar partners is to be discouraged. Regular tests to be taken for sexually active people to detect the disease at an early stage. To this end all government clinics are equipped with this facility. People have to cooperate if we are to eradicate the scourge of this incurable disease."
    },
    {
        "id": "e033474335ef41738eeed4b5d8e78f63",
        "title": "A fishing trip",
        "content": "There are few hobbies, which are so absorbing as fishing. People say that old men only seek fishing when they feel lonely. I don't agree. After all I am not old, still I have so much liking for fishing.\n\nMy school work stands in my way, so I could find time for going fishing only on week-ends. During holidays, of course, weather permitting nothing pleases me more than fishing. I have a special bowler hat, a small fishing basket and my favorite fishing rod. I purchase the necessary worms from the market and put them in the basket. Usually I start after breakfast. I leave word at home that I will return only in the evening. Taking my coffee flask, and a few slices of bread, I walk off. My favorite fishing ground lies some two kilometers away from my house.\n\nOnce I reach the place, I sit comfortably on the bank of the stream with reeds all around me. Fixing the worm to the hook, I throw the line into the water. It requires a lot of concentration to have an eye on the plumb. Sometimes I succeed in landing one or two good fish. Sometimes I wait for a long day, before I could catch even a small fish. But that does not detract me from going fishing.\n\nSometimes I while away the slow moving time by singing some popular hits. I feel that I am the monarch of all I survey. There is nothing to win and there is not much to lose. There is nobody to converse and only nature keeps company. So one feels as though one is a Yogi. I enjoy the ripples in the water. I enjoy the shoals of fish. I take pleasure in seeing the king fisher. Now and then I may be rewarded with the music of a bird. In short, for those who can temperamentally enjoy loneliness, there is nothing like fishing."
    },
    {
        "id": "e685a6b9a98b43caa4f353afbc3eb8b3",
        "title": "How I spend my holiday",
        "content": "Holidays are always welcome. Who can deny that? After a term of school-work, one eagerly looks forward to the holidays and yearns for them. But when the holidays come, many find it boring. After the first flush is over, many find it hard to spend time. It is all because they don't plan for a holiday.\n\nIt may be quite useful to plan for a holiday. But how one is going to spend them depends on one's facilities. As for me I cannot afford to spend money on long trips visiting places and seeing things. Still I plan always for the holidays. The following is one such plan.\n\nI will attend to some arrears of school work like copying of notes, getting the records up to-date and so on. Exercises which were not done in the class will be completed. I will go to the library regularly, both in the morning and evening and do some useful supplementary reading. After all one cannot always be reading. For a change I attend to some garden work. I am keen on gardening. It may be preparing the soil for a new plant or weeding out grass; it may be pruning the fence. The plants require regular watering, that I shall do myself. Now I have made up my mind to learn chess. I have already bought chessmen and a board for that. I will try to answer the problems on chess given in the newspapers. It is not always work for me. When I feel I must have a change, I mingle with my friends and enjoy some time in fun and frolic.\n\nThis time I want to learn some trade. I have made up my mind to learn watch repairing. So, I shall go and sit in the watch maker's shop. My father has promised to introduce me to one. I think it will take a good part of my time and it will fit me up to be a watch maker and repairer. Not that I want to take it as a profession but it is worth knowing such a trade.\n\nI have drawn up a very big plan but it remains to be seen how far I can fulfil it."
    },
    {
        "id": "5ad167192e954178871dc9d93d65b414",
        "title": "The school canteen",
        "content": "For students of a generation ago, the canteen of our school would have sounded strange and for parents atrocious. But any school today without a canteen has something curious about it. The school canteen serves students and members of the staff, with light refreshment in hygienic condition. Somehow children want to eat and when there is no provision in school, they buy things from street vendors and that way spoil their health. But they can get clean things from the school canteen now. The members of the staff also can have their cup of coffee or soft drinks. Yet there is objection from the parents that the school canteen encourages boys to spend a lot on eating. This should not be a very serious objection, when the overall advantages are considered.\n\nOur principal is a forward looking gentleman. He always welcomes new and good ideas. So when somebody suggested that there could be an improvement in the facilities available at the school canteen, he jumped at the idea. The result has been our present improved canteen. There the food is always fresh and clean, and served in disposable containers. The prices and quality are reasonable and there are sufficient types of food to cater for the needs of the pupils. Pupils' suggestion for more variety in the food is always welcome.\n\nThe canteen is run by different stall-holders. The food is cooked under strict supervision. Every effort is made to ensure that students get the best food at the cheapest rate. Fruits like bananas, oranges, and dry fruits are also sold. During the interval, there is a great rush but boys behave themselves and the service is not a problem. The prefects have worked out an excellent system for supervising pupils and for maintaining good discipline. The class prefects deserve to be complimented for planning the method which is working smoothly.\n\nThe canteen is also a place for gossip. When there is leisure time, members of the staff would be seen in the canteen sipping tea and talking over that.\n\nStudents stay in the school almost every day for five or six hours continuously, with little break during the time. Hence to have something to fill their hungry stomach in between is not a luxury but a necessity."
    },
    {
        "id": "dc7bb4863b2a41e8bff0ba09d09e4d16",
        "title": "What I would do after leaving school",
        "content": "Given the chance, I would be an air pilot. People may have their own views about it. It is of course a risky job, and many would discourage me from becoming an air pilot. But I think only of the adventure it offers. To become a pilot, one requires a good physique, nerve and eye-sight. Before becoming a fully trained pilot, one has to do a lot of ground work and many hours of flying. He must be a good student in physics, especially in aerodynamics. The training is very hard indeed but the game is worth it. A pilot gets a fat packet of salary. He gets other privileges. If he joins an international commercial line, he will get a chance of visiting foreign countries very often. If he joins the air force, his services are very much required for saving the country's frontiers. Any system of modern defense, will be nothing, if its air wing is not highly developed. So the air pilot will play a prominent part in the defense of his country.\n\nThen, think of the thrill of being in the air. Modern jet planes, keep to a height of more than seven thousands meters. What a grand sight the pilot gets at the time, the earth below and the sky above! It can't always be fair weather piloting. There used to be tense and anxious moments. Sometimes, the plane will have to negotiate through an air pocket or through heavily charged clouds. Then, there may be the flat landing tyres. These are only a few of the dangerous situations. In all these, the pilot should know how to carry on his duty coolly and safely. Any wrong judgment would mean disaster to all.\n\nIn spite of all these, I like to be a pilot because the thrill of adventure is so much that I cannot resist it. After all one can die only once."
    },
    {
        "id": "fb28a1916b2b40f581f922ac7f23a65d",
        "title": "Hunting",
        "content": "Of all manly sports, hunting is perhaps the, best. It is also perhaps the most ancient one. The early man was a good hunter. He had to hunt for food and for safety. Even today we find the spirit of hunting in our children.\n\nHunting requires a lot of practice. One cannot become a hunter overnight. People who have to live in the forest by force of circumstances are better hunters than city dwellers. He has to hunt for his survival. As he lives in the midst of wild animals, he will have to protect his life. Hunters use different types of weapons. Thus the ancient man used the spear, the lance, the slings and the bow and arrows. These are used even today by primitive people. But modern man uses the gun.\n\nThe hunter's life is an adventurous one. He has to face the fury of animals. To be a good hunter he must know the haunts of animals, their behavior and their trails. Above all he must know the law of the jungle. Hunters usually go in a party. If it is safe hunting as in the case of a deer or a rabbit, it is simple and easy. But when one has to hunt the tiger, it requires a lot of preparation. The hunter must know where the animal dwells and where it comes for its water. He must carry his gun and there must be some cleared ground for the animal to be seen. In the case of the tiger, if one is seen nearby, the hunter ties a goat or a buffalo to a peg and leaves it there. The tiger comes and attacks the animal and leaves the carcass there. The tiger is sure to return the next night to finish up its food. In the meantime, the hunter will be ready with his gun. When the tiger is deeply engaged in having its repast, the hunter shoots at it. It requires a very good marksmanship to shoot at it. If he fails, the animal escapes and may prove a dangerous sport.\n\nAnother thrilling adventure is whale hunting. The hunters go in powerful boats. They can spot the place, where the animal is found by its snorting. Then they cover the ground and when the whale surfaces they harpoon it. A mere lash of its tail world be enough to upset the boat. There are other ways of hunting like laying a snare, decoying and so on. In hunting, dogs are found very useful. They are able to smell the animal and very often bring it to quarry. Falcons were trained and they were used in hunting birds. Even today boys hunt for birds' eggs. As a sport, hunting is the most manly game."
    },
    {
        "id": "2121adf3e6aa48cd9db28546535dcdae",
        "title": "How to repair a puncture",
        "content": "Bicycle, the common man's vehicle, gets easily punctured when it is used on rough roads. It is not uncommon even on fine roads. The villain of the piece may be a nail, a thorn or very often a discarded bullock's shoe. After all the bicycle is able to give a smooth ride because of the inflated (pneumatic) tyre. If a hole happens to occur in the tube the air inside escapes, the tyre becomes flat and so the bicycle cannot run.\nIt is not enough, if one owns a bicycle. Sometimes, he must be able to attend to its working and keep it in a good repair. One of the things he may often be called upon to attend is the puncture. Of course it can be attended to by a professional repairer but one should know how to do it oneself.\n\nFor repairing the puncture, the following accessories are needed: an air pump, two tyre levers, rubber solution, rubber patches, sulphur stick, a tub of water and a scraper or a sand paper. Now the punctured tube will have to be taken out of tyre. The tube itself is taken carefully out of the tyre with the help of tyre levers. Then the valve tube and the checkout are replaced and the tube is inflated with air. The tube is immersed in water and by trial and error, the punctured spot is detected. Round the spot a pencil mark is made. Then the air is let out. The punctured spot is dried, scrapped and rubbed with sulphur stick. A suitable size of the rubber patch is taken, the side to be stuck is scrapped and solution applied. The patch is applied to the tube over the punctured hole and pressed well. When it is dry the tube is dried and carefully placed within the tyre.\n\nIt is easier to write than to place the tube correctly within the tyre. This comes out of practice. Once the tube is in, the valve tube and the checkouts are replaced and the tube inflated. But it must not be fully inflated first; inflate a little and see if there is any twist in the tube. If so, the process of taking out and replacing must be repeated. Then of course, the tube can be inflated. So, it is better for those who own their bicycles to know to repair a puncture. They should carry their tools kit. Then they can attend to the puncture even in an out of the way place."
    },
    {
        "id": "d271be9006794b80842696eaad7341ef",
        "title": "At sick bed",
        "content": "Have you ever been sick and bed-ridden ? One may not wish to be sick or bed-ridden. Still it is an experience. Unfortunately for me, I had such an experience last year. when I began sneezing one fine morning, I never thought I would be going in fro a protracted illness. that evening, I had temperature and pain in the joints. My mother prepared the usual medicament and gave it to me and made me go to bed early. the next morning I could not get up from bed. I was running high temperature and severe pain in the joints. People in the house suspected whether I might be getting small-pox or any fever like that. I was kept on diet. The same condition continue for three more days. So our family doctor advised my being admitted in he General Hospital. After the formalities, I was given a bed in the general ward and I was kept under observation.\n\nThe experience was novel to me but it was very irksome when a number of doctors, one after another came and examined me. Remember it was a general hospital, so there were many doctors, some trainees included. So I felt very much annoyed when I had to stick my tongue out for these doctors. In between there were the nurses who strutted about in their starched uniform. A chart was maintained about my health. My blood was examined and then my stools. Many were the surmises that were made. Some said it was a strange fever that started in Pahang. Some said it was paratyphoid. So they were pricking me with different types of injections. By this time, the novelty of being in the hospital wore away. I got fed up with the smell of dettol, the cheerless look of the ward and the monotonous scene of different types of patients lying there. somehow, the injections began to work. My temperature came down to normal. so I was advised to go home and take rest. What a relief from the boredom of the hospital after a fortnight there."
    },
    {
        "id": "6fb40f0b35f94db0a457a14200fa09c6",
        "title": "A train journey to Penang",
        "content": "Every year my father makes it a point to take the family on a vacation. This year as it is every year, we put it to a vote to decide what our holiday destination will be. Even though we all decided on Bali in Indonesia, we gave in to my little sister who insisted on visiting Penang in West Malaysia, otherwise known as 'The Pearl of the Orient'.\n\nAfter all the preparations had been made, a week later, we found ourselves standing on the platform of the railway station awaiting the 'Langkawi Express'. The train would be taking us to Penang as my father firmly believed that half the fun of a vacation was in getting to one's destination. My sister and I were very excited as this was the first time we would be going on such a long train journey. We would even have to spend the night on board the train.\n\nThe train arrived promptly on schedule. We found that our father had booked us two compartments on board the train. I had to share my compartment with my little sister while my father and mother occupied the other one. The bunks were rather hard, but who could sleep anyway ? We were too engrossed with staring out the window into the darkness that was punctuated only by the lights of all the little towns that our train passed through and sometimes, stopped at to pick up passengers.\n\nThere were a number of Caucasian tourists on board. We were unable to make out what they were saying as they seemed to be speaking languages other than English. We had our supper in the buffet coach and I must say that the food was delicious but  expensive. My sister and I decided to do a bit of exploring and made off on our own after promising our parents that we wouldn't wander too far. we ran into the train conductor who was kind enough to give us a guided tour. He told us that the train had twelve carriages and that the diesel driven locomotive pulled all of these along. some of the carriages contained compartments like ours, while other contained sleeping berths and ordinary seats. All the carriages were air conditioned and quite spacious.\n\nI could see my little sister starting to yawn, well so much for staying awake the whole trip. we started to make our way back to our compartments and were soon fast asleep. we were still asleep when our train pulled into the station in Butterworth from where we look the ferry to Penang Island."
    },
    {
        "id": "e4578416409d47ebac88d4e797133fc8",
        "title": "Looking after my young",
        "content": "Being an elder brother or a sister has its own advantages as well as problems. In a big family, the elder one ahs to share some of the responsibilities of both father and mother. If this can be looked upon as a necessary burden, one cannot avoid it. For the smooth going of the family, such as service of the elder child, is always expected.\n\nNot let us see some of the problems of looking after the younger ones. They have to be kept away from the kitchen when mother is working. But it is not an easy task. If you obstruct them, they raise a cry and begin to weep. This disturbs mother. If one or two slaps are given their backs, they will cry as though the very sky has fallen on them. Very often, the elder one is asked to dress up the children. Tt is really an ordeal They prove very rebellious and make the task very hard and make one lose all patience. Quite often, they have to be taught; either they won't come at all for studies or prove very stubborn. The elder one has to be an image of patience. Still nothing can be taught. if the elder one were to lose patience, only he or she will be found fault with.\n\nAnother frustration is that the elder one cannot own anything, new or attractive. Immediately, the younger ones want to have it. It may be a pen, an instrument box or even a pencil eraser. The elder one may protest but ultimately, it will be the younger ones who win.\n\nAnother trying occasion is when mother is away from home. It may be to a movie or visiting a friend, very often the younger ones make a hell of that time. they quarrel among themselves, pick up a row, fly at each other's throat, they want to eat something and if that is given they want more. If not given, they will create a story and carry the complaint to the mother. the younger ones always spy on the elder one. They want to a accompany the brother or sister wherever he or she goes. If they are taken they will always be ready to carry real or imaginary tales to the mother. One difficulty with them is, they want to be with the brother or sister and at the same time they want to have their own way. there may be exceptions but the reality is always there."
    },
    {
        "id": "6babfc46e8fb43d4843a0d116fee07d9",
        "title": "A disastrous storm",
        "content": "It does not happen to everybody to come face to face with a storm. I had such a bitter experience. Even today I wonder, how I kept alive in that storm.\n\nIt happened this way. The afternoon was just pleasant and I took my bicycle and was on my way to a village some six kilometers away where a relative of mine lived. The path lies through an avenue of trees with fields on either side as far as the eyes can see. But for one or two stray cottages here and there, there is nothing to shelter in the sky. It was threatening and I pedaled hard but before I had gone a few hundred meters, there was a sudden burst of thunder and a blinding lightning. It began to rain, cats and dos and the rain came down in big drops. The light was very poor and the road was bad. as the rain was lashing on my face I could not pedal hard at my bicycle. I knew it was dangerous, to go and take shelter under a tree, so with great fear I kept to the middle of the road. Suddenly the wind rose ad gained momentum. It grew wild and before its force, the trees simply danced. One could hear the howling noise of the stormy wind.\n\nI was soaked to the skin. My fingers were benumbed. I could not push hard. Now and then I could see the heavenly rage in the lightning flashes which appeared to hiss almost by my side. To add to my fear, there was a sudden thunderstorm and a big tree cashed to the ground. In this situation the will to live alone goaded me on. As the road was soaked with flood water, I could not ride the bicycle. Even pushing it along was an ordeal. There were potholes and swirling water, but it was not a question of abandoning. I prayed to Go to conduct me safely.\n\nAt long last, the flickering light from the village was seen and I was in my relative's house after a few minutes. What a relief to be under a roof behind closed doors in such a weather ! My relative gave me a change of warm clothing and I had never enjoyed a warm cup of tea as I did that day."
    },
    {
        "id": "1e77f318599f409abbfaa93d57ded9cb",
        "title": "A day of happy moments",
        "content": "Pleasure is something which satisfies our senses but happiness is something deep seated. It is something which is much nearer to our soul. A hot cup of coffee on a chilly day would surely bring pleasure and not happiness.\nNow I shall say when I was very happy. Even from my early days, I used to take interest in games. My elder brothers used to take me to the sports and matches. Whenever I saw the victors receiving trophies, I eagerly wished that I must be on the victory stand one day. As I came to the secondary school, I took interest in long distance running. With some boys of my class, I used to take to the track and run. In one of the inter-school competitions I came first in the one kilometer race. This gave me not only satisfaction but also encouraged me to put in more and more effort. I was regularly on the track practicing. I learnt the techniques from my physical instructor. From one kilometer I Learnt slowly to run two kilometers within three minutes. The day when I can do it, is still far-off. Still unceasingly I practice long distance running.\n\nThe Inter-district Sports Meet of the schools came and I was selected for 1000 meter race. It was a red letter day in my life. The event was announced and along with five others, I was standing on the track. Hundreds of people were looking at us. We were set on the mark and the gun went off. I started steadily and knew that I must have spare energy for the last lap. It was a three round business. In the first two rounds, I kept myself the second or third. In the third round, Picked up speed and was running like a colt, left others far behind and breasted the tape in the record time. The excitement was so much that I was almost unconscious for a few minutes. Then I ran to the victory stand. My joy knew no bounds when my name was announced first and I took the salute. It was the glorious day and I enjoyed boundless happiness."
    },
    {
        "id": "3ca0364f3053402ba9a6aaf6d77e3002",
        "title": "The importance of sports in school",
        "content": "There cannot be two opinions whether sports should be compulsory in schools. Of course there are some who still feel that sports in schools is a waste. They feel also that the sports has a corrupting influence. They may be correct because they might have seen in the morning papers ugly scenes taking place on the field. True, there are riots sometimes over the decision of a referee in a soccer tournament. Or again, it may be that a favorite team has lost. But these must not be taken as the criteria to decide whether sports should be compulsory in schools or not.\nThe aim of sports in school is not to create champions but to train the body and the mind of the youngsters. The sports events must be looked upon as a compliment to the class work. If the class teaching can develop the intellectual skills; the sports is sure to develop the physical skills. Many things which children cannot learn in the classrooms can be learnt on the field. The spirit of play is there in children and they like to take part is sports and games. A child who would not play has something wrong about him.\n\nTaking part in sports improves the nerves and muscles. It improves the physical skill, and general health. Moral qualities are developed by playing games. The child learns to play its part and thus to play the game. It is always the team spirit and not obeying orders. This will be really useful later in life. Leadership qualities are developed. Healthy rivalry is always an advantage to participants.\n\nIt is argued that, for the sake of its advantages, sports should be made compulsory in schools. True but man as he is has some inertia and unless there is some sort of compulsion, he doesn't take to even to good things. In order to let children benefit by the sports, they must be compelled to participate in team. By taking part in games, children keep themselves away from undesirable things. So, sports must be made compulsory in Schools."
    },
    {
        "id": "f7ceb5d61f4146fda891613ccb587246",
        "title": "School homework",
        "content": "Homework is a bitter pill to many a student. Schools, as a rule set home-tasks. They are given to make the student work at home. It serves another purpose also. It is to help the student to revise what has been done in the class. All schools set home work for students, some more and some less.\nHowever, bitter it may be, there must be some home-task given. Education and mastery of knowledge is a matter of skill. There are subjects to learn a skill and others just to acquire knowledge. Both these groups require drill and repetition. the teacher, to some extent, drills the student in the class. But in the classroom each individual student cannot expert the same amount of drill as each one may require. so the student will have to do that at home.\n\nHomework need not necessarily be repeating what has been done in the class. It may be more study. The student goes through references and acquires more and better knowledge. The world of knowledge is so wide that the class study cannot bring everything into the grasp of the student. So the student must take up some initiative of his own. This may be one of the purposes of homework.\n\nThe school also must see that the student is not overburdened on one day and left free on other days. the teachers must see to it that the homework is distributed throughout the week. Still there are subjects like mathematics in the lower classes which require daily attention. There are others which can be attended to during the week end, for example, map making, drawing diagrams and so on.\n\nSimply because there is difficulty for some students, the homework cannot be abolished. If some students find it inconvenient to do their homework, the school must come to their rescue. They must provide some facilities in school, so that the pupils can conveniently attend to their homework. Boys do not like homework because some of them are too playful to do them. In such cases, the teachers must come willingly forward to help such boys, who need encouragement.\n\nIt is not a question of abolishing the homework. It is a question of making it sweet and workable to the student. The teachers in good faith must solve this problem."
    },
    {
        "id": "b64a036a207b4757af945b32f262827f",
        "title": "The importance of good diet",
        "content": "In addition to regular exercise, a healthy well balanced diet is essential for good health. Life or rather the quality of life you have is dependent on having good health. A well balanced diet would contain the three main groups of food as well as important vitamins and minerals.\nThe first group of carbohydrates are found in foods such as bread, potatoes and rice. They are essentially energy giving foods which power the muscles and other tissues in our body. The next class of food is the proteins which form the solid part in all living cells. They are commonly found in milk, met and fish, and are necessary for the body to build new cells and repair old damaged ones. For this very reason growing children require a greater intake of the different kinds of proteins as compared to adults. Lastly we have fats which are also energy-living foods but do not give it up as quickly as carbohydrates because their molecular structure is designed to render them ideal as storage foods.\n\nAs children are much more active than adults they use up more energy for their size and therefore require more energy giving foods such as carbohydrates. To this end fats are unsuitable. Moreover too much of a fatty food intake at an early age may lead to a problem with obesity in later life. In adults fatty deposits on the walls of the blood vessels in the form of cholesterol may lead to all kinds of heart ailments.\n\nIn addition to the foods above the body also needs small quantities of protective substances called vitamins and minerals.\n\nThey are normally present in a sensible diet. For example vitamins A and D are found in some fatty foods. Vitamin D is important along with the mineral calcium, found in milk, for the formation of bones. Vitamin B is found in the husks of wheat or rice ad vitamin C in fresh fruits such as oranges and lemons. Important minerals such as potassium, zinc and iron are present in traces n most foods too.\n\nTherefore it is  obvious that a well balanced diet would include all the necessary ingredients necessary for growth and good health."
    },
    {
        "id": "1224507fb2744130bfd73068389742cc",
        "title": "Advantages of living in a village",
        "content": "To live in village or town depends on one's occupation and the facilities one wishes to have. If one is a farmer, he must, of course, live in a country side or in a village. But if he seeks employment elsewhere, towns offer better chances. Again living in a village or a town is a matter of preference. Those who prefer peace and silence, may choose villages. Generally, towns are noisy and crowded. each has got its own advantages as well as disadvantages.\nTake the case of a village first. a village is less crowded and there is more breathing space. One can enjoy nature in its pure form. There is no hurry or bustle of a city or a town. In the village one is not a slave to the clock. If the village is a prosperous one and the man himself owns a few hectares of land where he can grow his own food, then the village is the better place. One the other hand, if the village is underdeveloped with no facilities for a healthy living, then the village is not desirable. Because many of these things are wanting in a village, people go to towns for setting up homes.\n\nTowns as a rule, score many good points over the village. There are educational, medical and transport facilities. Essential things are easily available because there are big markets. The employment prospects are also better in a town than a village.\n\nFor those who seek entertainment, towns have cinema houses and entertainment centers. All other facilities like banking, postal and telephone are easily available in a town.\n\nBut it is not all rosy in a town. With its dense settlement and pollution, townlife is hell. the only reason that draws people to towns is the employment opportunities. If villages are modernized with some primary facilities, then villages may be preferred to towns."
    },
    {
        "id": "04239deb4d624b6a93ddf87546d46066",
        "title": "Marriages should be arranged by parents or left to the choice of the young people concerned",
        "content": "This is a question which may be perceived from different angles. It may be from the point of view of the parents or the youngsters who marry o from the commonsense.\nA parent wants his son or daughter married because he wants his species propagated. He wants his daughter married to a healthy person who would prove a good life partner and make married life tolerable. The parent cares also for the stock. In other words he wants to assure himself that the person with whom his son or daughter is married, does not suffer from any physical ailment. They must have a fair reputation in society. Very often, the financial status of the parties is taken into consideration. Because of the specific advantage to be gained financially, an alliance is made. Sometimes, the youngsters may not like such an alliance and so the marriages end in unhappiness.\n\nFrom the point of view of the youngster, he wants to marry as he likes. In his view, it may be the personal quality of the girl whom he wants to marry that matters. In the first glamour of love, he is likely to overlook many other factors. Because the youngster is not experienced and worldly-wise, his choice need not always be correct. Because of such wrong alliances, there are more misunderstanding and divorces in Western countries. Under the wrong notion of love marriage, there have been more illicit connections and children born before marriage. so wisdom tells that youngsters would better think twice before they get married. They would not lose anything by consulting their parents and taking their advice and blessing."
    },
    {
        "id": "c7deb3f0202648f2ac31da71ce0023ae",
        "title": "Can a person be judged by his clothes ?",
        "content": "It is often deceptive to judge a person by his dress. People who dress very well need not always be decent, good or honest. But the world generally judge a person by his dress. There are many rogues who dress very neatly but they commit worst of crimes. In cases where confidence is used to deceive a person, very often the deceptor dresses himself in a comely way.\nStill the world expects a person to dress according to his status. If one does not dress according to his rank, he is often held to ridicule. It doesn't mean, one should dress, in a gaudy manner. It will show a sense of taste. But one should be dressed neatly and elegantly. In elite societies people attach importance to dress. Thus people in important positions have advantages. One can distinguish between a lawyer and a judge. The uniform adds to the dignity of the profession and helps one to know the person from his dress. Thus in the police and army, various ranks are easily known by their uniforms.\n\nAs mentioned before, dress may not be a good index of one's character. Simple dress need not mean want of character. There were eminent people who dressed themselves in a very simple way. For instance, Gandhi wore only a simple dhoti. Some people often called him 'half naked fakir'. But his dress, in any way, did not reduce his character.\n\nSometimes people are deceived by dress. Once a great scholar went to a party. As he was simply dressed, he could not find admission inside. So he returned home and put on his best.\n\nHe went back to the party and he was given a warm reception. In the course of the dinner he did not eat but was addressing his clothes. The host came there and enquired what the matter was. The scholar told him what had happened. Since he was admitted only for the sake of his dress, he was addressing his cloths. The host felt ashamed and sought pardon of the scholar. Though dress may be, to some extent, helpful to judge a person, that will not be the only yardstick."
    },
    {
        "id": "8c8b210b90634e118b0427a5ce824ddf",
        "title": "Education should be compulsory up to the age of 16. Comment",
        "content": "The aims of education are many. To be able to live successfully every youngster must have education. To educate means, to make one intellectually clever, physically strong and alert and happened in human history from the dawn of civilizations. Education not only helps them to evolve themselves in such a way that they can fit themselves into useful life. Education is, in short, provides for the future of the child. So education is being looked upon as essential.\nSince education is very important for every individual, governments are trying to make it compulsory. Modern governments, generally speaking, work on democratic lines. In order to run the government efficiently, the citizens must be educated enough. Not only should the representatives of the people be educated but the electors also should be educated. Only then they can make the wise choice.\n\nThe life's needs are many and to get at them requires education. Thus education brings to the student the knowledge of men and things. They must be able to interpret the written and the spoken words. World's knowledge is found between the covers of great books. In order to get to those treasure houses, children must be educated. The law of the land must be known by the citizens. How the government is being run must be known by any average citizen. For all these education is necessary.\n\nPeople do not send their children to school, merely for the sake of knowledge. Unless children are educated in their formative periods, they cannot learn later on in life. So, where the parents fail, the governments must interfere. So every civilized government has made education compulsory. In spite of it, if people are not sending children to augment the family's income. So while children may be expected to help their parents, they are compulsorily put to school. Illiteracy is a bane on any society and it must be done away with; the sooner the better."
    },
    {
        "id": "bd4061c38691434eb4bc7b878d5ef7ec",
        "title": "Tradition : useful or harmful",
        "content": "Every generation is the torch bearer of culture and tradition and it must pass onto the next generation. This is a sacred duty, and for the continuity of culture, this becomes essential. Cultures depend on various traditions. Some of them are well founded on reason while others are meaningless. Some of the latter block the progress of a community or even a nation.\nLet us see in what ways some of traditions prove an obstacle to progress. Look at the purdah system. How it started, history alone can say. But today it is meaningless. Is it out of jealousy or suspicion that mean keeps his women under purdah ? They are denied the benefit of sunlight and fresh air. So among purdah women there are some who suffer from skin diseases and even pulmonary diseases. It is high time people revise their notions about purdah.\n\nUntouchability is prevailing in some form or other in many countries. It is a pity that some of our own brethren should be considered untouchables. There was a time when their proximity was supposed to pollute water and vitiate the air. If it was because of certain habits of theirs that they were considered untouchable; it is a great pity indeed. Some jobs are nasty but, for that matter, people engaged in such jobs should not be considered untouchables.\n\nLook at the color bar being practiced in certain countries. It is sheer accident that some are born fair skinned and others dark. Again it is sheer accident of history that some people became slaves and others masters. To base one's judgment on such a tradition and to deny the colored one his legitimate rights is something unfair.\n\nThere are many more things like this which stand as an obstacle to progress."
    },
    {
        "id": "66727bc95c684f118c5448f92b624e55",
        "title": "The story of a daring person",
        "content": "The story of Horatius and how he defended the bridge, is a bright page in the history of Rome. A soldier with the help of another could defend a narrow bridge against a big army was something marvelous. This is how it happened.\nThe Republic of Rome was being invaded by a rebel general and to reach Rome, he had to cross a narrow bridge on the River Tiber. Horatius offered to defend the bridge while the city fathers pulled down the bridge. Taking another as his companion, Horatius went and stood at the outer end of the bridge. The enemy soldiers were standing before him. The rebel leader laughed when he saw the two men standing on the bridge against a big army. He sent the giant of a man from his army to go and fight Horatius. Horatius stabbed him to death. Some more came from the enemy side and Horatius killed them all. Now the enemy leader was in doubt whether to proceed further on.\n\nIn the meantime the demolition work of the bridge was almost over and the bridge shook at the pillars. Horatius asked his companion to run for safety. Now the bridge fell down with a big crash. Horatius did not mind it. But he jumped into the river, and though he was fully armed and with deep wound on the thigh, he swam across the swirling waters of the Tiber and reached the other shore safely. A cry of surprise and joy arose from both the friends and the enemy. Horatius was honored by the country. In memory of him a statue was raised later on. Thus Horatius defending the bridge, has become a classic hero."
    },
    {
        "id": "2bbed7a2213043af86b8d107c4db414c",
        "title": "A hot sleepless night",
        "content": "It was a hot night and I cold not sleep, I got up and looked out of the window. The sky was very clear with a half-moon in the west and many twinkling stars.\nWhile I was absorbed in the scene, I heard a moaning sound from the next flat. I listened for a while. I thought at first that somebody there was snoring and perhaps raising this cry in his dream. But the moaning sound continued. it was followed by other sounds. They were so confusing that I could not understand what it was all about. I felt the sound came from two persons quarreling. I wondered what could have been the matter at that hour of night.\n\nThe quarrelling noise increased. Now and the, I could identify a voice that appeared to be begging. Very soon, I heard the noise of blows and a shrill cry of woman. Still I hesitated to move out, and go and see what the matter was. True, the neighbor was an acquaintance of mine, but the hour of the night and the nature of the voice resisted me from going out to interfere.\n\nWhile was thinking about it, I heard a sudden crash, as though something heavy had fallen. This was followed by a fearful cry and silence followed. I feared something horrible had happened. So I ran out and went to the neighbor's door and knocked at it. It was opened by my neighbor, who appeared in dismay and bewilderment. After some excuses, I enquired what the matter was.\n\nHe took me in and showed me a scene. There lay his wife curled on her bed. One or two chairs had been turned upside down. This were in a disarray. The neighbor showed me a chair to sit. Then, he told me that his wife had been a hysterical person and would now and then create scenes in the night. The struggle started when he tried to quieten her but she would not. Then she pushed the chair vehemently which was the cause for the crash. and after a cry, she fell into a swoon. It appeared, he took it easy because, it was a common occurrence. While I sought his excuse for disturbing him, he begged my pardon for having disturbed my peace at night. I bade him good-night and returned to y room."
    },
    {
        "id": "f6cf24e05f5b4d569ddedaf4d0471dc1",
        "title": "\"Waste not, want not\"",
        "content": "He is now in the old age of his life. How can the youngsters know, how he struggled hard in his days to establish himself in life. Though he started from a scratch, he retired with something substantial to fall back upon. What he earned, must have been sufficient for his son.\nBut the son had different ideas. He wanted to make money by quicker means. Those were the days when some people made quick money by investing in films. So the son persuaded his father, to part with his hard earned money. Reluctantly, the father granted the request because he was the only son.\n\nThe son went to the city and started a business. Because it concerned with cinema, everything had to be spruced. The youngster felt big because stars and starlets were interviewed by him. He had contracts signed by them and invested a fat amount on taking a movie. even before the work would commence half of his money had been eaten up. Before the movie would go half its length, the youngster was steeped in debts. Distress calls were sent to his father. Then he could not meet his son's demands. So he persuaded him to come back home. After much hesitation, the youngster packed off his goods and much disillusioned, returned home. when he met his father, the latter simply told him 'Waste not, want not'."
    },
    {
        "id": "38d7dbb163a943c79bcf42ad176b3a41",
        "title": "A daring robbery",
        "content": "It was 10 o'clock in the night. I was late from my office and was standing at the bus-stop to catch the bus. There was a coffee shop nearby. It was the only shop in the neighborhood. There used to be late guests in that shop. For I could see that the owner was not in a mood to close the shop.\nThen I saw two fells enter the shop. Their appearance looked suspicious. They went in and ordered for their cup of coffee. While they were sipping their cups, I could see them talking. Then I saw both of them move towards the counter where the shop owner was sitting. From the manner he talked to them, I knew they were thugs. After a few minutes, I could hear hot exchange of words. I could also see that the shop owner was self-possessed. While an altercation was going on, one of the two guests whipped up a knife and threatened to stab the shop owner. The other fellow put his hands into the drawer and took what all cash he could take. I was in a dilemma; I could neither go for rescue nor shout because that would be futile. the shop owner was raising  hell of noise and even at the risk of his life, would not allow the ruffians to bolt away with the cash. Luckily for him, the long awaited bus came there. Seeing the bus the ruffians left the place and ran away. Before the shop keeper could recover and cry for help, the ruffians were gone. As already the bus was late people did not bother to go for the ruffians. I boarded the bus with a heavy heart because, I failed in my duty to save the shop keeper."
    },
    {
        "id": "ed75981785654807842135cc3e77feff",
        "title": "Mother tongue : How important it is in your life",
        "content": "In today's fast-paced society, our traditional cultural values and identity are at risk. We have to make a conscious effort to ensure that we do not lose touch with our cultural heritage. One of the important features of a cultural identity is the ability to speak one's mother tongue. One's mother tongue would be the language spoken by members of the same race. As examples among the Chinese there are several dialect groups such as Cantonese, Teochew and Hokkien. Cantonese and Hokkien being by far the common dialects spoken. However the Chinese people also have the common language of Mandarin. The Indians too have their separate dialect groups such as Tamil, Malayalam and Hindi among others. The Malay language is the same for all Malays except that pronunciation may vary depending on where they are from.\nThere may be some who may argue that it would be better if everyone spoke the same language so as to promote communication and closer ties between the different peoples of the world. However I feel that although this i a desired ideal, it may be achieved  in other ways that do not involve abandoning the art of a language that may have taken centuries to evolve into it's present day form that represents the identity of a people or a community.\n\nA mother tongue spoken helps to bind a people together and promote the positive values of a culture. If we are well grounded and know where we come from and what kinds of behavior are deemed and acceptable in our community we would be equipped to resist external negative influences that may otherwise sway us. Also having a cultural identity of our own would help us to understand better how other people value their own language and traditions. We would not be so quick to fear what is unfamiliar to us but instead try to understand it.\n\nIn this changing world which is drawing closer together through technology in communication, English is generally the language adopted for ease of communication in sectors such as trade and education. However this does not mean that we should neglect our own mother tongue."
    },
    {
        "id": "a4a48b3901434414a18ce655d707112d",
        "title": "The uses and abuses of television",
        "content": "Gone are the days of 'old fashioned' entertainment. Television is an important invention of this century. Its great effect upon society is remarkable. It is to be found in any large city in the world.\nTelevision contributes a lot for the benefit of mankind. It is one of the great educators. Ordinary people, would have known little about foreign countries, engineering feats, science and medicine without television. In some countries apart from the program for the general public, 'school' television program has been introduced.\n\nTelevision provides good entertainment. We can see musical shows, movies and news events about the world on a small screen. It provides great excitement and creates an interest in various arts. A piano recital, an orchestra, a grand ball and a clandestine love affair are some items to provide occasional merriment.\n\nTo the old people and the sick, television is a companion. The no longer feel loneliness; television entertains them and makes them happy.\n\nSpace men today are making enormous strides in the space race. Television has its use in this field also. Photographs of space flights can now be relayed to the earth by satellite and to the television screen.\n\nUnfortunately, there is harmful effect if people spend too much time in 'viewing'. Children are likely to neglect their studies. If television has too strong a hold, even elderly people are likely to neglect some of their important work. When too much time is given on programs of vice and crime there is a disastrous effect in the young.\n\nBut if this medium is used properly it can become an advantage and no a disadvantage to mankind. Then only it will gain the wide appreciation it deserves."
    },
    {
        "id": "1b3ed88e5e064b3dbbf4d7d9e2a04e68",
        "title": "What I would do if I won the first prize in a lottery",
        "content": "We all like to imagine ourselves richer than we actually are. Suppose I do a bit of day-dreaming, let no one ridicule me at my stupidity.\n'Charity begins at home'. So the first and the foremost that I would do if I won the first prize is to look after myself and my family. I am the eldest member of a large family. My father is a farmer. We live in a kampong. Trying to make ends meet, he works hard. But more often we are hungry. I would get rid of everything that makes life miserable to us. We would move into a big house. I would by some of the luxuries of life, for my family and make our daily toil easier.\n\nA portion of my money will be spent on my education. I would work hard and would travel for sometime to foreign countries. That would help me a lot to learn about other people, their customs, traditions, laws and way of life.\n\nAnother part of the prize would be spent on some thing really good for my country. I would invest it to build up a business. There upon I would multiply my wealth and would be happy to contribute my share towards nation building.\n\nI do not know much more is left out of the prize. If at all there is any, I would spend it for the spread of education of my kampong people. I know education is the greatest need of my country. i would see that education is made free and compulsory up to the age of sixteen. Thus I would lay the foundation of a well ordered Society.\n\nI wish my day-dream would come true."
    },
    {
        "id": "63bdd9572f3b401caf1b0b19cca9b3ec",
        "title": "Space travel",
        "content": "Ever since the Russians put the first manned spacecraft in orbit round the Earth and the Americans made their historical landing on the surface of the Moon, the technologically advanced countries of the world have been engaged in attempts to penetrate the vast expanse of outer space.\nScientists and engineers working together are constantly designing new and better space vehicles. The target destinations for these vehicles are the neighboring planets in our own Solar System such as Mars and Mercury. So far the main obstacles to space travel remain the great distances between these planets and Earth. The millions of miles of cold and empty space would take a very long time to traverse and this would raise the question of how to support life on board these space crafts as space is a vacuum devoid of life giving oxygen. To date scientists have only been able to send unmanned crafts to these planets. The sole purpose of these missions is the gathering of information through aerial photographs and the testing of surface materials which are transmitted back to earth via radio waves.\n\nAnother obstacle to space travel is the prohibitive cost of such undertakings. The advent of the space shuttle has lowered the cost factor by allowing the same vehicle to be used over and over again. The Shuttle is able to carry passengers and cargo and after completing its mission in space it lands back on earth much like a conventional aircraft. It is often launched into space on the back of a rocket or a large jet plane.\n\nMany experts believe that Mother Earth has been so ravaged by man, that she may not recover. The damage caused to the environment by pollution, the changing climates on earth, the depletion of the ozone layer as well as the phenomenon of global warming due to atmospheric carbon dioxide increasing are all brought about in one way or another by man. Experts feel that it may be time that we start looking to space for some of the solutions to our problems."
    },
    {
        "id": "ef0a6ce3fc974bcfb8335ef3d52bf746",
        "title": "The value of discipline",
        "content": "What has gone into making a parade a grand success ? What has gone into making life a real success ? What has gone into attaining greatness to great nations of the world ? Discipline. Discipline means the training of the mind so as to make it accept willingly the control rules or orders. In many ways it is the most valuable lesson to learn.\nIt is only through discipline that living becomes smooth and peaceful. Law of a country is nothing more than community discipline. People who keep to the law accept the discipline of the state.\n\nFor one's moral life, discipline is necessary. Self indulgence is a natural temptation. Our senses crave for easy satisfaction. Don't give way to this craving. we must keep our passions under control.\n\nDiscipline features in every stage of a child's development. A child is taught discipline from its birth so that it will not turn into a savage.\n\nAt school we must submit to the discipline of the teacher. A school boy is given instructions in various subjects. He is trained in different ways to make him fit for adult life. To his repeated annoyance, he is subject to constant control.\n\nDiscipline is equally necessary in our intellectual life. It is also necessary in our spiritual life. Life will have its trials and disappointments and it is discipline which will enable a person to remain cool and sensible amidst the stresses of life. Should a person fall, it is discipline which will set him on his feet again.\n\nRemember, discipline is not slavery. It has a higher object in view. True discipline lies in a conscious subordination of self to the achievement of some higher purpose. when we are inclined to rebel against discipline, we should remember, \"He alone can command who knows how to obey\"."
    },
    {
        "id": "6ffc415ea27e46b58873f00976de1e44",
        "title": "Travel as a part of education",
        "content": "Education means the all round development in ourselves. They can be physical, mental and moral. In a broad sense it can be defined as the drawing out of the individual's personality and intellectual ability. Travel has always been considered an important part of this process.\nEarly travelers were the Dutch, the Scandinavians, the Portugese and the British. What were the motives behind them ? They were exploration, conquest, trade and commerce and diplomacy. They considered themselves teachers. Travelers with a scientific outlook become explorers, others 'empire builders' and adventurers.\n\nAmong the great names of travelers, Clive of India, Sir Stamford Raffles of Singapore, Huen Tsang of China and Marco Polo are worth mentioning.\n\nNow we look at another purpose of travel; it is for the love of 'culture'. Italy and Greece are living reflections of ancient classical love. The 'educated' young man, rich and sophisticated, is not considered completely 'finished' until his classical education has culminated in a 'Grand Tour' of Europe.\n\nTraveling teaches many things. It makes history real. It also gives us a true idea of the industrial, agricultural and mineral resources of a country. By extensive travel one is able to learn the geography of many countries. It creates in us the desire for investigation, exploration and discovery of many countries of the world.\n\nThe theory of travel in the modern age is completely different. Every intelligent person today, regards travel as an intellectual venture and goes abroad prepared to learn rather than observe."
    },
    {
        "id": "7331d53d9dd44d7b9f126c6eae18b964",
        "title": "Advertisement : True or Misleading",
        "content": "Advertisement is one of the human institutions highly developed nowadays. To some extent nature itself advertises her ware; for instance, he color and smell of flowers is nothing but advertisement to attract the attention of insects and birds and the promise of honey is the gift.\nAdvertisement is one of the media to draw the attention of the public and to inform them regarding a particular product. This may be called the psychology of persuasion and a way of converting people to a way of life or thinking. For example, a new drink may be introduced. It is not enough if the product is good but the public must be made to realize its existence. So the manufacturer adopts subtle ways of advertising. There must be appeal to visual and aural senses. Since advertisement has become very important and its methods are many, it has been professionalized and it is a trade today. In fact advertising agencies do good business. Since they employ specialists like artists and script writers, the advertiser can have expert service at a price.\n\nThere are hundreds of ways of advertising. Generally they may have visual, audio and audiovisual appeal. Leaflets and brochures are produced colorfully describing a product. Free samples are lavishly given. Even for established products they give free samples now and then so that new customers may be found for the product. Calendars are quite common and from very plain ones to pictorials are there. Some of the calendars are really so fine that they are being preserved. So calendar manufacturing during the season is a big business and there are people who hunt after calendars.\n\nPerhaps one of the most popular media of advertisement is the newspaper. Since newspaper reaches a very wider public, advertisement in the paper is a common feature. Some products are being advertised throughout the year and advertisements are the major source of income for the newspaper. Here the pictures and the script play a very important part.\n\nNowadays small gifts like key chains, purses, table ware and so on are used to advertise various products.\n\nAn advertisement cannot be useless. After it ahs achieved its purpose the general public may think it is useless. when an advertiser uses a lot of paper for printing his advertisement, the common man may question the wisdom behind it. If you go on throwing some mud on the wall, some is sure to stick; so too with the advertisement. the advertisement acts as a middleman in the trade bringing the prospective buyer and the product man nearer. with the complexity of the market and with dozens of products competing, advertisement is one of the ways of winning the market.\n\nOf course there are advertisements which are really misleading. Some medicines that are advertised claim to be panacea for all bodily ills. But very few could claim that honor. Some of the consumer products are not of that quality as claimed by the advertisement. take for instance, some tooth pastes. They claim to give all protection to the teeth but they prove the other way. In America this subtle way of persuading the public has been questioned when a number of products advertised could not stand the test of proof.\n\nWe can conclude in spite of its limitations, advertisement is an institution that has come to stay."
    },
    {
        "id": "6ef4ff48c00d4b07abab10bebcaa97c3",
        "title": "Mountaineering",
        "content": "Mountaineering is some sort of an adventure. It is also some from of physical activity. The adventure lies in facing all the troubles and risks and overcoming them for the joy of it.\nMountaineering is not a game, it can be called a sport. For games like football and hockey, there are man-made rules. But mountain climbing has rules of a different nature, and it is always dangerous to overlook them. The freedom from man-made rules makes mountaineering a pleasure to many who have a passion for it and a challenge to those who suffer cold and hardship while climbing. Mountaineers are free to use their own methods.\n\nWeather is the most important factor governing the success of mountaineering. Other hazards can be overcome by correct equipment, and team work. Physical fitness and courage can make the conquest of mountains and Peaks a success.\n\nAbove 8000 meters lack of oxygen is a detrimental factor; but since oxygen equipment is now light enough to carry, this difficulty can be overcome.\n\nBut unkind weather, changing rapidly from calm to storm, nullifies all these. Correct food, clothing and exercise protect the climber against cold but nothing can combat wind and snow.\n\nHazards ate there certainly in mountain climbing. But men and women with the passion for climbing forget them. The spirit of adventure inspires them. They respond to the ideal -- \"to strive, to seek, to find and not to yield\". With this ideal in mind, determined army men of Malaysia -- conquered South East Asia's highest peak, Mount Kinabalu."
    },
    {
        "id": "d1f0ab490c974162bf23050c70329eee",
        "title": "The best time of the year",
        "content": "So far as I am concerned, the Christmas season is my favorite time of the year. It is the season which keeps me busy and pleasurably engaged.\nAt first there is the getting ready for the season. The house gets a cleaning and is given a spruce appearance. The drawing room is made attractive with buntings, Chinese paper lanterns and fig trees. We go about selecting greeting cards. There will be a lively discussion as to which picture can be selected. Then we draw up the list of invitations. The major part of the season is taken up for getting our new dresses ready. that means parading to cloth shops and selecting the right material. It means real headache for mother, for sometimes we choose the material which we cannot afford. then we will have to be convinced. Since the season is buys there is the trouble with the tailor who never keeps his promise which means knocking at his door often.\n\nThen we plan how to celebrate. We start with carol singing. On the eve we set up the X'mas tree and illuminate it. Christmas gifts are hung on the wall of living room. Though we get good stuff like cakes from the best bakery in town, some delicacies are prepared at home.\n\nWe never fail to go to the church and take part in singing. At home also it is all singing and dancing for some hours. Mother once in a way plays on the old piano though she is out of tune because she has been out of touch. We pretend to enjoy it for fear of displeasing her. The best part of the day is the dinner. Cakes and pastries, jams and marmalades and other nice things are freely thrown around. we have visits throughout the day and we return the visit. Older people talk of the good old days. Children count the gifts they have received. they hear good stories.\n\nOf course the Christmas ends up with the New Year. The New Year service in the church is a solemn affair and we all pray for the prosperity of the world in the coming year. Then there is stock taking. parents find time to go leisurely through the greeting cards sent and we reply to them where we haven't already done.\n\nI feel that such celebrations have becomes a part of the family and they cement the love and affection among our family members."
    },
    {
        "id": "39b28dee199f47eab931e0999e82a7ab",
        "title": "The role of women in taking care of home and children",
        "content": "Till the end of the last century, when the family was the unit, and bringing forth and rearing of children were a healthy trend to strengthen the family, women's place was at home. She played many roles, none of them demanding. She was the housewife, mother, manager of the household and the first educator of children, though the last was recognized but not mentioned.\nBut those days are gone and nobody who is educated and civilized looks upon a women as a doll to be kept at home at the will and pleasure of men folk. Of course, there are exceptions in certain societies where the in-laws play the villain. But days are changing and with the education of women and the change in economic status, women are enjoying a lot of freedom. There are many upcoming women and the world has been in recent times great women in politics, being prime ministers in some countries.\n\nThere has been a strong resentment among the women, about the way women have been treated. There is what is called the women's liberation movement and one of their major demands is equality of status as men; the other being equal pay for equal work and security for women.\n\nSome old societies still treat women as chattels who could be easily disposed of. In very primitive societies even today women are treated as commodity which could be bought and sold and even loans are raised on the security of women. These are far and few between. At the other end of the scale some women want complete freedom to live as they please; they don't want to be bound by wedlock. They would change their man as one changes his shirt. This is only an extreme view and not so common even among those who vigorously fight for women's freedom.\n\nWomen have been all along treated as a weaker sex. The connotation changes from person to person. Physically of course they are not as hardy as men but this doesn't mean that they don't have a strong heart. In fact they are stronger than men in certain aspects in that they are able to stand physical hardships. In their make up they are equipped for certain nature's ordeals which men are not subjected to. Whether they like it or not, generally women have more to do with children especially in their infancy and early childhood. This makes women distinctly different from men; their being soft and kind need not be taken for their weakness. If they appear weak sometimes it is to maintain the dignity of family life, so that children do not become a bad copy of the mother. Motherhood is so sacred that trying to tamper with it in the name of liberation movement would make society wild and disorganized."
    },
    {
        "id": "eb3dc4ea6c9e4ca9b76cf714d023fedb",
        "title": "A sincere friend",
        "content": "He had a humble beginning. His parents were ordinary people and his father was looking after the family lands. Of course once in a way he used to lend money. But he was very careful to whom he lent and was very strict in getting back the money. Those were the days when there were no banks, and cooperation was an unheard of word in that area. So the father with prudence and hard work built up sizable funds which the son inherited in the natural course.\nUnlike the father, the son was far more shrewd and enterprising. With the money he entered the cotton market and became a cotton broker to a mill owned by an European. This relationship of the broker and the mill owner continued for long and after some years the European felt that he could not continue for long in an alien country. There was national consciousness emerging. Workers became antagonistic and the day to day management was in peril and the European's life was in danger. So he felt it was wise to dispose of the mill and go away. The time was propitious for it because the mill was a going concern and nobody questioned about its profitability. The European mill owner thought of his friend, the cotton broker as a prospective buyer. For one thing he had money and secondly he was a shrewd business man. So, when the mill owner broached the subject to his cotton man, the later wanted time to decide. But the mill owner had already made up his mind to sell the mills and so he was willing make concessions. The cotton broker shrewd as he was bargained for a good price and got the mill by paying only half the price, but promised to pay the other half in small installments.\n\nThe broker turned mill owner and put his heart and soul into the business and built it up. Everything was going on very well; he opened many more mills. The more he earned the more ambitious he became. He began to play with his accounts and he became a suspect in the eyes of the authorities. They were only waiting to catch him and the snare spread widely. So one evening the learnt that the authorities were going to raid his office. He was sure that he could be caught red handed and knew he would be put behind the bars. There was only one way. His friend in a village could save him. So he took some important books with him and left for his friends' village. On the way he stopped his car and sent it back. He kept the bundle of accounts with him. Then he traveled by a bus to his friend's village. the friend was very much surprised but when he heard the story of his mill magnate to bury the books in a garden and the mill owner was given the shelter needed.\n\nOf course the mill was raided by the authorities. Nothing incriminating could be found. The enquiry did not help them to know where the mill owner had gone. In the meantime the friend used to go to the mills and through some confidential servants saw that the mill functioned properly. After a few weeks the case was withdrawn. the mill owner made his appearance again. As luck would have it there was a boom in the yarn market and the miller earned enormous amount of money. In his turn, he did not forget his friend who gave him shelter so he continued to help him faithfully till his last days. So a help done in time is greater than the word, as the saying goes."
    },
    {
        "id": "3dc7eeb180494d2bb7d10774cfa149ec",
        "title": "The insect world",
        "content": "Insects appeared on our planet at least 400 million years ago and have evolved into different species of diverse size, form and habits. Their small size might seem to be a disadvantage but actually the opposite is true. It is their very smallness which allows them to survive in the world heir sheer number of at least a few million different species also ensures their survival.\nTheir life cycles also ensure their survival. Often different species change dramatically in form and life styles as they grow. Brightly colored ugly caterpillars turn into butterflies. Mosquitoes begin as aquatic larvae. These changes allow insects food at different times of the year. Thus they are able to adapt to changes in their environment.\n\nFew insects are social but rather prefer to live a solitary life. In contrast other insects such as ants and bees are well known social insects. They live in colonies or hives and their society is very well organized with each individual member having a particular function to perform. Workers or drones do the job of building the nest as well as gathering food for the others. The soldier ants for example protect the nest and defend it against intruders. The queen ant or bee has the job of laying eggs to propagate the community. They are a living example of how effective teamwork can be.\n\nGenerally most insects adopt a form having three parts, a head, a thorax or chest and an abdomen. Insects also have six legs and most are equipped with antennae which are used to sense their surroundings. By far the most amazing thing about them is their eyesight, most have compound eyes which give them a field of vision of nearly 360. That is why it is almost impossible to creep up on an insect. They also possess a very acute sense of smell as well as hearing, all these features help them to locate food or to find mates.\n\nInsects form an important part of the food chain. Fish, birds and small mammals depend on them as a food source. Their continued survival also guarantees the survival of other animal life, they are indeed indispensable to us."
    },
    {
        "id": "db161247cb5f473e837035f53f4e97bd",
        "title": "The money and the desire for it",
        "content": "Man is the only animal who has got the acquisitive tendency highly developed. His ambition to possess is sky high. He does not stop getting things at any stage saying this is enough. This sense of possession is at the back of many men's activities. Otherwise no man would work or labor hard. He undertakes many hazardous jobs because he can earn a lot of money. Man dives down into the deep sea because he can get pearls. Of all the cherished possessions of man, money is one.\nMoney is the commodity which gives a lot of power. Money has got the purchasing value so that one who has money can purchase anything. It was said of a great millionaire that, when he was denied a suite for rent in a posh hotel, he purchased the hotel overnight. Another purchased a real, live elephant when his young son cried for an elephant. So the power, which money places in the hands of the owner, is tremendous.\n\nThere is a saying that those who don't have money lose this world and those who don't have Grace of God lose the other world. What a mighty saying ! Money can be used for good as well as bad things. With money many good things could be done. As a wise man has said those that come by plenty of money, must look upon themselves as trustees and spend the money on good causes. There is no fun n possessing money but there is happiness in spending it in a wise way.\n\nMoney could be spent for helping others in need, it may be for one's relatives, kith and kin, or the public at large. Thus money may be spent for educating a boy, for getting medical relief for a relative or for getting things which the other cannot afford. In a bigger way it may be for building institutions like schools and colleges, hospitals, national memorials and libraries. Some create foundations for helping the advancement of science and technology. Research scholarships are common nowadays. The Nobel Prize is a classical example where money is used for honoring great people who have contributed to human welfare in different ways.\n\nMoney can be used for bad purposes as well. Bad people are supported by moneybags. Money is used to corrupt people and , as everyone knows corruption at all levels is a bane today. The giver as well as the receiver are guilty indeed.\n\nMoney is used for gambling and is also used to encourage guerilla wars. It was the gun makers and the manufacturers of military hardware who were responsible for the great wars. Elections are won by money power. Money is used to subvert officials and the spies are bought with money.\n\nOnly things is I don't have it. I don't know what I would do but that would be only for the good of the humanity. I will raise a housing colony where the poor will be accommodated for a nominal rent. I shall found a hospital with all modern facilities and make medical service cheap. I will spend money like ancient kings who spent all they had on good things. But there is a big 'if' namely 'Had I plenty of money, money enough and to spare'."
    },
    {
        "id": "7723ebe39aa240a98f660f2c0085a931",
        "title": "Opportunity lost",
        "content": "Opportunities do come to everyone but rarely and unless one is wakeful to cash in, life continues to be a bore. People who take such opportunities become successful in life.\nI am one of the unfortunate ones who have lost opportunities. While at school I was a good sportsman and I took a keen interest in playing football. I was selected to represent the school. But my parents did not like my joining the team because they felt that it would interfere with my studies. Had I joined the team, I would have not only proved my mettle but it would have opened venues for my joining the police department later on.\n\nAnother opportunity I lost was at college. When I joined the university, I was in doubt to choose the right subject. I was not sure whether I should take up mathematics or literature. One of my friends, a lover of language suggested that I should take up literature and study. Then I could dive deep into the world of thought and imagery and could have communion with brilliant minds. I took up literature and of course got a Bachelor of Arts degree but when the question of employment came I could not easily compete with those who had high first class with science subjects.\n\nAfter leaving college, I struggled for sometime to get an employment. I was recommended to the post of a traveling representative. But my mother opposed it saying that traveling would not suit my health. And that opportunity was lost. I could have enjoyed going places, and the prospect of earning a high salary with decent allowances was lost. Now I am struggling hard trying to find a suitable employment."
    },
    {
        "id": "74c2343a02cc4b54ae5836d7a937025c",
        "title": "A long vacation : How to make it exciting",
        "content": "Once in the stream of life, we are ground to paste as if it were by the pressures of work coupled with anxiety, apprehension and doubt. So the senses are benumbed and we become a cog in the big wheel. That is the price we pay for modernity. Ask any office goer or a factory worker, and he will have his sorry talk to tell about the same dull routine for six days in the week. Very often he has no time to talk to his parents or to look after his children. To take the edge out of it, there must be periodical vacations.\nBut the vacation to be of any meaning must be long enough. Ideally speaking it is not to idle away one must seek a vacation. It must be an occasion when something useful could be done. Of course it may not be out of compulsion or pressure from outside but one chooses the vacation so that a good thing may be achieved.\n\nWhat I have in mind is something like this. When somebody chooses a long vacation he must have a plan for spending it. One must go on a long pilgrimage visiting places of historic or religious interest, as the Muslims go on Haj pilgrimage. There he must travel in a leisurely way, seeing places and perhaps getting into the spirit of it, unlike a modern tourist. A modern traveler rushes in to the jet plane and hops from place to place, spending his waking hour between the hotel and airport. At leas the would take a few photographs. A vacation spent on tour must be different.\n\nAgain the vacation may be utilized for some useful study. It may be for specializing in any branch of the discipline in which one is interested. For instance one interested in archaeology may visit places of such interest. This may take him to historical ruins to familarize himself with the subject.\n\nMay be the vacation is taken for some constructive work. One may to to the village and look to the repairs of the ancient family house.\n\nWhile the vacation may be worthwhile it must be free from constraints; otherwise it loses the spirit of vacation. It is the spirit of the city child finding itself free to play on the sea shore. It is the mental attitude which is very important. When one returns after the vacation one must look fresh and full of life and not like a storm-beaten mariner returning home.\n\nAfter what all has been said and done the outcome must be a happy one."
    },
    {
        "id": "8d43644dc37b413daa45300c737121d1",
        "title": "The role of a teacher in moulding the character of pupils",
        "content": "Teaching has been described as a noble profession. In the modern context a teacher's role has now taken on a more challenging and demanding aspect. They are now more than ever entrusted with the task of moulding their charges into productive members of society. To a large extent this involves the very character of the student.\nSchool going children, in the early stages are still in the process of physical and mental development. Teachers represent role models for them to follow especially given today's hectic pace of life. It is not unusual to find that working parents of children have limited contact with their children through the week. It is often the teacher who fills this vacuum as the authority figure, friend and advisor. Children spend the better half o the day at school during normal lessons as well as being engaged in extra-curricular activities on other projects after classes. Often tuition or school sports and activities also occupy their weekends.\n\nOwing to the great deal of time spent by the child in the school environment, the level of inter-personal relationship between the pupil and teacher is improved. The pupil will come to expect more from his or her teacher in terms of involvement and commitment. The teacher would be in a unique position to influence and guide his student. If the teacher performs his role well the student will come to realize the importance of the positive traits and values being imparted to him. Learning by example is one of the most effective forms of learning.\n\nTo meet the new challenges posed by the role of teachers, the individual must be dedicated and committed to teaching as a profession. Teachers must also be trained not only on methods or techniques of how to impart knowledge but also on how to deal with students on a more personal level. Teachers who are also counselors in their schools are also formally trained in this aspect of student relations and play an important part in ensuring that the school becomes a conducive environment for the intellectual as well as the psychological development of the child."
    },
    {
        "id": "3cc0477625744174960620bc17382c59",
        "title": "Stammering : My biggest problem",
        "content": "Everyone is having one problem or another. It may be the need of this or that or the lack of certain things. These problems may be natural or created by circumstances. If a person suffers from paralytic limb, it is natural. On the other hand, if one has lost a purse during a travel it is because of circumstances.\nIn my case stammering is the biggest problem. I don't know how it has occurred but it is there and I have to grow with that. I am growing more and more conscious of it as I grow in age. Because I stammer I am not able to mingle freely with others of my own age. They react differently, most of them mock at me and very few have sympathy. While the ideas roll, words do not flow at the same speed. So very often I blink, which means I am taken for a muff. because of stammering I can't retort and my contribution in a company will be very little so I have to be very often an idle spectator. not that I can't give my ideas but I am unable to speak that fast. So it has developed in me an inferiority complex and nowadays I shun company.\n\nHow to overcome is the problem. I have heard of a great Greek Orator, Demosthenes who was a stammer as a child, was able to overcome it with some sort of exercise. It was told that he put pebbles in his mouth and standing on the seashore, used to cry aloud. Thus he overcame his stammering. But in my case I have not tried that. But what I do nowadays is to gather ideas and slowly put them without repeating a word. I am successful to some extent and I cannot say that I have overcome it completely. One thing is certain;  this stammering of mine has blocked certain employment opportunities for me; for instance, I cannot become a lawyer or a platform speaker. though i like music and enjoy it, I will never become a singer. A pity, isn't it ?\n\nI have come to the wise conclusion that one must put up with that which one cannot improve."
    },
    {
        "id": "a0a30eac074a401d8c93b79788bf58be",
        "title": "The only child in the family",
        "content": "It is entirely correct to say that being the only child would be better than having brothers and sisters. Being an only child has its advantages and disadvantages.\nLet us look at the advantages first. The parents can spend well in the upbringing of the child. The child can be provided with better food, nutritious and well balanced, which may not be possible in a big family. The child can have better and a variety of clothing.\n\nBesides these the child can get good education. He may go to a good school because the parents can afford to meet the expenses. Good education means good books, good teachers and good tools. For instance, where there are many children an average parent cannot find means to provide books for every one. Because of better attention to his education, the only child can hope to reach even university provided, of course, he has the brains.\n\nAnother signal advantage is that the parent can attend to the child personally. This will help the parent to shape the child's taste in dress and food. The parent can be helpful in the mental and intellectual growth of the child. There will be an intimacy which could help the boy or girl in later years.\n\nThere are also disadvantages in being an only child. The child will feel lonely, companionless and none to share his joys and sorrows. The parent cannot take the place of a brother or sister because of the age gap. Because he is the only child he may be petted and pampered and so he will easily become a spoilt child. He will develop more negative qualities like selfishness, pettiness and obstinacy. He won't have the opportunity to develop many human qualities. Love, affection, kindness, sympathy, appreciation and many such qualities cannot easily develop in an only child. Then again there will be few opportunities to give expression to those qualities.\n\nWhen they are not developed, he can't have a healthy growth and he can hardly become a well rounded personality. He may not understand the value of mutual help which is very important in life. He will become so selfish that he would like to have everything for himself. He cannot understand the importance of living with others.\n\nIn a society each member has to live with others, for the welfare of everyone. A big rope is after all a combination of many straws and its strength depends on how well it has been twisted. So too unless the society is made up of well seasoned members, it cannot stand the onslaught of bad powers. So the lonely child without friendship and understanding with others cannot easily fit in a society. So weighing all these considerations I would like to have brothers and sisters, not too many for that matter rather than be a lonely child."
    },
    {
        "id": "028a19433f2a465ebcf67840cc906e68",
        "title": "My science teacher",
        "content": "I have come across many teachers and I have brushed shoulders with some of them. Some I like, some I avoid and some I adore. But no teacher is so much loved by all as Mr. Lee, my Science teacher. Somehow I took a fancy for him from the very first day he took classes for me.\nMr. Lee moves freely with his students but he has got a way of attracting students towards him. He has a winning smile and would nod if he sees his students and if time permits would enquire about them Somehow he is interested in the welfare of his students. If a pupil is a footballer, he talks football to him. If one is a smart boy, he talks about studies. In fact I used to wonder how a small head as his could carry all the knew.\n\nAs a teacher he is exacting. No one can escape his eagle eye in the classroom or in the laboratory. If he sees that things are done properly he is not bossy. For instance, he would insist on everything in its place and every work on time. In writing the records he won't relax the rules. Work is work and it must be done properly and well. In this he himself is an example. He is always prompt in correcting the work sheets and records. To some extent he is fastidious in these things. He has a personal approach in these matters and he will call for each student, point out the mistakes and make him correct them.\n\nIt is a pleasure to sit in his class for he will explain his lessons with a lot wit and humor. One could easily see how widely he has read for he could quote from the classics to the daily newspaper stories. Nothing of interest can escape him. Under his treatment even the dullest lesson would become interesting. Though he would indulge in jokes, he is not a joker and would never go in for cheap jokes.\n\nAs a teacher he has never been vindictive. If he punishes it is not to would but to heal. If he feels that a student has taken it too much to his heart, he would have a private talk with him and would convince him that he deserved the punishment. His love for the subject and teaching is so apparent that nobody is offended at his punishment. By nature, he is one who would easily forgive and forget. every student is a nice fellow to him.\n\nHe is an amazingly wonderful man of knowledge. He can easily talk on any subject with an expertise, whether it be health, sports, astrology or politics of the day. He keeps himself up-to-date and his motto is once a scholar, always a scholar. He used to say, rightly too, that one's education does not stop with the school or the college. But for all this he is not a pedant and he is easily approachable. So many pupils used to meet him to get his advice which he would frankly give.\n\nSince Mr. lee is such a good combination of high qualities and all those desirable things in a teacher, no wonder I look upon him as my favorite teacher, there are other students too who hold him in great admiration."
    },
    {
        "id": "15a789019fdc4ae4a375a0d86bc4a073",
        "title": "Drug addiction : The evils of the habit",
        "content": "Our forefathers had spoken of five cardinal sins which must be avoided by all means though they may appear to bring profit or pleasure for the time being. The evils are gambling, stealing, murder, unchastity and rugs. The history of humanity is full of examples where people have been ruined by following the path of one or other of them. A whole nation was brought to disgrace because of opium.\nWhy then man takes to drugs ? Some think it adds to pleasure; some others think that it takes away physical weariness. Still others take it to forget their worries, while others take it in order to please the company. In cold countries they take it to keep oneself warm. While in very small dose, drugs may and do act as medicine, they can never bring pleasure. True they have the doping effect and hence at the spur of the moment the person may act more vigorously but only to find himself weaker later. taking harmful drugs in large quantities in time and out of time is addiction.\n\nFrom time immemorial man has known to make drugs. Today, various kinds of drinks like wine, brandy and whisky are common in the market. But consuming these drinks in moderate quantity is not harmful. Whereas opium in various forms are all drugs. These drugs affect the nervous system especially small brains which control the voluntary action. So a man under the influence of a drug is unable to walk and he staggers. Since it deadens the senses, the man under the influence of drug does not know what he does or speaks. Very often under the influence of a drug he does shameful acts. Continued addiction upsets the digestive system, especially the liver, leading even to death.\n\nA drug does not at all add to mental alertness; far from it. The mental faculties will be benumbed. In order to forget worries people take drugs because of their soporific effect but exactly the drug is not the answer to one's worry. Certainly the drug addiction brings moral degradation. The addict himself knows it and so he consumes them only in secret and , no addict openly will come forward to say he is an addict. It is against all religious sanctions. It leads to immoral and evil activities. Socially also an addict is looked down upon and people would try to avoid a drug addict. He would be a nuisance wherever he is, at home or in company. He would bring untold misery to his people and those around him. except in the company of addicts, he would be looked upon as a leper. His family also will share the disgrace because people will point the accusing finger at the family. Financially it ruins the addict. The money would go down the drains as it could be spent for the betterment of him or the benefit of the family. So to act wisely, one should by all means avoid drugs."
    },
    {
        "id": "904a06179f394bf9ba111de1b6f2226f",
        "title": "A rainy day",
        "content": "The rain is welcome because it brings down water to sustain our life. All our water sources, rivers, lakes, and underground springs depend on rain water. Where there is scanty or no rain desert conditions prevail and life in such areas of the world is miserable. Animals and plants do not thrive there. In fact the most densely populate areas of the world are those which get good rains. Of course too much rain is also bad. Sometimes rains are not welcome because of the inconvenience it causes, but it is something we cannot do without for the very life depends on it.\nFor us, rainy days are quite common. Most of the year there is good rain. That day also the rains came as usual. The midday was getting very sultry and the sun on a steely sky was scorching and so it was oppressive to talk along the road even with an umbrella. As the hour advanced dark clouds began to appear and very soon the sky was getting darker with heavy clouds. One could almost feel the coming rains when cool winds began to lash.\n\nAt first big drops of rain fell down here and there. Knowing the coming of rain, people began to hurry. The small vendors on the road packed up their wares and began seeking places of shelter. Then it started to rain heavily. The first rain cooled the hot surface of roads. As water began to flow, the drains got their fill and the stream rushed through them carrying all the dirt of the road. The drain pipes were full and brought down water with a noise. The cars that dashed along the roads did splash water on all sides to the chagrin of the passersby who got drenched. In a good rain, the umbrella is no answer. Boarding the buses in such a condition was a problem and the streets were wet and flooded. One could see crowds of people gather and huddle together in all available places of shelter.\n\nAfter an hour the rain stopped. The sun began to shine and soon the roads were dry and once again life was busy. There was freshness in the atmosphere, especially the trees bore a beautiful green. Because it rained during the school hours, children were not much affected as it would otherwise be if it rained in the evening. Because of the rain the day was very dull for me."
    },
    {
        "id": "69ea88db2747482fbd7cdc0c2e2d3771",
        "title": "My fears in life",
        "content": "Fear is a feeling when normal faculties get damped and a sense of helplessness develops. It would be interesting to take a close look at what fear is. To understand it let us take an example. A boy is afraid of a dog because once a neighbor's dog bounced at him and from then on he has a fear of dogs. In this case fear is because of the personal damage the dog may cause by biting. The fear has got a good aspect about it. But for fear many things in the society would not have changed; for instance fear of punishment makes people law abiding. Fear of falling sick makes people take care of health and food. Fear of losing promotion and even losing the job makes an employee loyal, faithful and so on. Fear of death and beyond generally make people pious and God fearing. in general fear is essential for preservation.\nFear when persists becomes a fear complex. When there is legitimate reason it is good to have fear. But once it has developed into a complex, fear is there even when there is no cause for it. Take an instance; for an employee, fear of being dismissed may have developed to such an extent that when his boss calls him for ordinary business the former may shake in his shoes.\n\nAs it is fear is not there in us when we are children. Fear grows with us as we grow. Elders bring in fear in order to control sights. Fear of people, of animals all develop because of circumstances. Children in a city very rarely dare to get into the waters of a lake or river or the sea because they are literally bathroom bred. Many instances could be cited.\n\nIn my case, I am afraid of losing my rank in the class. I have been standing first in the class for some years, so I look upon any rival with jealously. After taking every examination I used to exercise my mind whether I would get the first rank. This has developed into a complex that everytime the results are announced I am afraid of the outcome.\n\nI want to overcome some of these fears but they stick on to me like a pitch."
    },
    {
        "id": "4f4f93dd4d5f4db588801beca46d3269",
        "title": "The value of forest",
        "content": "Forests with a quite repose, an air of placid calm and a pleasing natural scenery, since time immemorial, played an important part in the life of mankind.\nWhat do we learn about the African huts of the primitive days ? Wood has been the basic material used by them. Let us go as far back to the Merrie England' of the sixteenth century. Its beautiful black and white houses depended on wooden structures. Even in the modern age when steel plays an important part in the formation of the sky-scrapers, wood still forms an intrinsic part of the smaller modern buildings.\n\nSoft woods and hard woods are used for various purposes. Frames and doors are usually made of soft woods. Hard woods are used for furniture.\n\nFurthermore, wood has played large part in transport. The primitive man used wood for making wheels for horse carts which enabled him to move from place to place,; others were dependent on wood for making boats.\n\nWe can also see how great is the need of timber in the making of paper. The logs of soft wood are first turned into wood pulp. This undergoes certain chemical processes. Paper is the end project.\n\nNor are the uses of them in other fields less pleasing. Some forests provide useful oils, turpentine from the pine, palm oil from the palm and olive oil from the olive tree.\n\nForests play an important part in the prevention of soil erosion. Addition of huming and vegetable matter by forests, preserves the soil from degeneration. They also attract rain clouds.\n\nForests shelter wild animals and small insects. Climbing shrubs and creepers are protected by them. They provide men with beautiful scenery. One's eyes are charmed with the soothing luxury of colors, with the soft appeal of endless greenery."
    },
    {
        "id": "9c87ca40fb9a485a9331846965aaba71",
        "title": "The joys of gardening",
        "content": "I enjoy gardening as a hobby and a leisure activity. Most of my friends think it odd for a young person such as myself to have such a hobby. They would rather be out playing football. I have tried explaining to them the great joy I derive from seeing something I have planted grow and thrive while being carefully nurtured. They believe that most things grow on their own naturally without any effort having to be put in.\nI suppose that to a large extent I owe my interest in gardening to my parents who are themselves avid gardeners. On most evenings, it is not unusually to see both my parents and I pottering about in the garden. As we live in a house with a rather large compound there is always plenty to do. During the months when rain is sparse all the plants have to be watered daily and during those months with heavy rainfall we have to take care that precious nutrients in the soil are not washed away. Healthy and nutrient rich soil is important as our garden is full of all sorts of trees and plants. In a constrained area this will lead to a depletion of nutrients which have to be replenished from time to time.\n\nOur neighbors often remark that our house is the most beautiful and resplendent one in the neighborhood. This is due to the fact that the variety of flowering plants we have are kept well pruned so as to promote flowering all year round. In spite of the fact that practically every square foot of garden area is taken up by some plant or the other, careful management of the available area has given our house an uncluttered look. Fruit trees are a favorite for my father. we have rambutan, mango and banana trees in our compound which my father has managed to grow to a certain height so as not to pose a problem to my immediate neighbors. As some people do not appreciate a garden all strewn with dead leaves.\n\nAll in all I find gardening to be a most satisfying and fulfilling pastime which can contribute to a greener Maldives."
    },
    {
        "id": "11d283f5530943f4bb1b2fb366d1e698",
        "title": "Household pests and insects",
        "content": "Pests and insects are often harmful to health as they are vectors or carriers of the germs of many diseases. Some of these diseases are lethal such as the plague which can be spread by rats or malaria and dengue fever spread by mosquitoes. Other ailments such as coughs and colds are allergic reactions due to the presence of tiny insects called mites. It is important therefore to keep one's home free such pests or insects.\nCommon household pests include also flies which are dangerous pests as they settle on all kinds of dirt and their hairy bodies pick up bits of dirt. These flies may then land on exposed food leaving the same food contaminated with this dirt. Flies are known to spread the germs of bacteria associated with many diseases and must be controlled by not leaving rubbish heaps or refuse lying around as these are breeding grounds for flies. Food should also not be left exposed.\n\nAnts are generally not disease carriers but can be a source of annoyance if present in large numbers. They are attracted to food left lying about especially food containing sugar. However white ants or termites which attack wood may be a real danger in the home by weakening wooden structures such as staircases.\n\nMost housewives are only too familiar with the pestilence posed by cockroaches which also spread quickly in the home as unlike other pests they eat almost anything such as leather, cardboard and as they like. As they are nocturnal feeders they are hard to eradicate.\n\nBed bugs too breed very quickly in beds and mattresses and very soon infest the whole house. These bugs feed on human blood and prolonged exposure to them can cause severe skin ailments. These bugs are tiny and therefore unseen and it is therefore important to have thorough and frequent cleaning of bed and bedding to keep their numbers in check."
    },
    {
        "id": "d637860e3b634e87a6354efbbecbdbf8",
        "title": "General election",
        "content": "With the coming of popular governments in countries, general elections when people's representatives are elected, have come to stay. Even in those countries where dynastic rulers are reigning, elections are held. Elections are great occasions and grand ceremonies go along with them. Elections decide the fate of a country for a term which may be four or five or even six years. Even in the communist countries where the single party is the rule they have a semblance of an election.\nElections are called according to the rules of the constitution. Normally it may be held when the term of the Government is over. Or it may be caused when the Government in power is defeated. Again the Government in power, may resign and force an election in order to establish its strength.\n\nWhen the Government of the day resigns or otherwise, the Head of the State calls for a general election. The necessary notification is issued and the election follows. It is the duty of the Election Commissioner to plan and hold election in a peaceful way.\n\nThe electoral rolls prepared periodically show who the voters are. Now adult franchise is the order of the day and universal. All men and women beyond a certain age become voters. Though electoral rolls are revised periodically, just before the election, chance is given for the voter to see if his name is on the electoral rolls and if not to apply to the proper authority to have his name included.\n\nThe Election Commissioner announces the program of election, when to hand in nomination, when to withdraw, the date of the election and the date of counting. The electoral laws are made public.\n\nOnce the election is announced, various parties aspiring to get into the government choose their candidates. Nomination of a particular candidate may depend on many factors. It may be local influence, money, political power and so on. Once the nominations are scrutinized by the electoral officer and accepted, the candidates start their canvassing. to start with, the parties issue their election manifesto which may contain all sorts of promises. All kinds of advertisement media are used to draw the attention of the voters. The poster war starts and all available spaces in hoarding are filled with posters. Leaflets are freely supplied. The radio and the television are judiciously used. Public rallies are held where the candidates or their party leaders speak at length what they proposed to do if returned. Individual voters are contacted by volunteers.\n\nJust before the election, election booths are notified and election officials are appointed. Voting will be by secret ballot. How this is being done differs from country to country. After the elections are over, the next stage is counting. In America (the USA) counting is done mechanically and the results are computerized and so the results are known as the election progresses. Once the results are announced, the majority party may form the Government.\n\nElections are not always smooth in some countries. The rival party workers may clash and there will be riots. Sometimes the worst in the people surfaces during an election. However, elections are held and election is a tool in a modern Government."
    },
    {
        "id": "f35936456f784449879362efa3b69ca2",
        "title": "My perfect home",
        "content": "At first when I though of a house, I conceived that it must be neither too far nor too near a town. If it is too far, one may feel lonely and then there is the question of transport to and from a place I choose. It is an elevated land enabling easy drainage and the soil is hard enough. The site is spacious allowing ground for the house and a decent garden. even from the beginning I wanted that my house must have an elegant and chaste look.\nThe house is a four -- room mansion with a well furnished kitchen and, of course with modern bathroom facilities. The living rooms are planned with comfortable seating in view. The furniture has been chosen with great car. The walls have been painted with soft colors to match the curtains. Each room is fitted with a loudspeaker so that one can enjoy the radio program from bed. The drawing room is elegantly furnished with sofas and chairs and a table in the center. The wall shelves are used to stack books. There is a niche for the television and the room is spacious for a small group to watch the programmers comfortably. All the rooms are air conditioned.\n\nThe kitchen is a beauty by itself. It is fitted with electric grills and things could be stacked neatly in specially designed cabinets. it is provided with modern gadgets for grinding or cutting.\n\nIn front of the house is an artificial pool with a fountain singing all the time for the sun, stars and the moon. One or two fish troughs kept in the portico add to the beauty of the place. There is a garage on one side of the house. In the backyard there are a few fruit bearing trees. Near the boundary fence of the house there are some coconut trees. In front of the house are certain bushes of crotons and flower plants. The well kept lawn with luscious green grass is very pleasing to the eye. There is also a small playground for children with a swing and a see-saw.\n\nPurposely I avoided putting up high storeys because in my case space was not a problem."
    },
    {
        "id": "9ecaf55a55fe418182a8d5be5fe0b05d",
        "title": "Cooking",
        "content": "In fact there is nothing deliberate when I learnt to cook. Really it came quite by accident as it happens in many cases. For example, one learns to swim when he suddenly finds himself in deep water and he has the first lesson in swimming.\nOf course it is a case of \"necessity is the mother of invention\" One day I had to make tea. That was the first time when I went into the kitchen. I have seen people making my tea and above all I have always enjoyed my cup of tea. But there is a vast difference between making tea and enjoying your cup of tea.\n\nThen once our Scout troop was camping away from the town and we were in a wood. That day we cooked food for ourselves. Our Scout master encouraged us to prepare our food. Our patrol was in charge of cooking. So naturally I had an active part to play. That day we cooked rice and prepared some curry was not so nice. Still we took it in the right spirit of a Scout.\n\nThereafter I took courage to prowl into the kitchen helping mother in the various activities. At first of course mother would not allow just to help her washing, peeling, slicing and so on In all her kindness she would show how things should be done. Slowly she showed me how to dress food, what ingredients and in what quantity they should be used and to what extent the item must be heated or boiled and so on. Now that mother has grown confident that I could do well in the kitchen. Now and then she leaves me in full charge of the kitchen wherever she has guests or other work to attend to. No wonder I am taking lessons on kitchen art now."
    },
    {
        "id": "40c523a55c294c2881c575f5f11a8e12",
        "title": "A trade fair",
        "content": "There was an industrial exhibition in our town organized by the local chamber of commerce. Industries from many countries were well represented. Many of the industries were in tune with the spirit of the times. There were electrical and electronic products, transport vehicles, agricultural implements, watches and clocks, household appliances and others on display.\nThe building was very attractively decorated and separate halls were allotted for different industries. the booths were cheerfully arranged and colorfully illuminated. In each booth there were guides who explained the working of various exhibits. Illustrated booklets were freely available. To avoid jamming in any particular booth at a particular time, route was very well marked. At the entrance there was an information room. During the hours when the exhibition was on there was soft music played. there was also a restaurant serving snacks and soft drinks.\n\nIn the mechanical engineering section many types of machines related to different industries were exhibited. What interested me was a working bench for carpentry. It was power operated and many things could be made in a very short time.\n\nThe electronic section was the most popular. Many latest gadgets were there, from the simple calculator to electronic kitchen control. With the help of the electronic gadgets the housewife can be freed of many of her chores and cares. The watches and clocks section was very attractive. Here is an area where the Japanese genius is evident. Many types of watches in solid gold real glittering diamonds were displayed. There were funny clocks working in ingenious ways.\n\nThe agricultural section was highly representative from tractors, bull dozers and harvesters to various farming implements. The humble buffalo and the plough will become obsolete in a few years. Dairying was well represented. One could see how one gets his bottle of milk almost straight from the cow's udder. Food processing, preserving and refrigeration were shown on a sophisticated scale.\n\nIn short the exhibition very well showed the triumph of science and technology. I felt that I had gained a lot of knowledge after visiting the exhibition. A second visit would be really worthwhile."
    },
    {
        "id": "b219fec623e84239b3e50735e88a55da",
        "title": "Animals are God's Creatures Too",
        "content": "I want to let you know about an event that changed my life many years ago. It is a memory that periodically comes and goes, but it is one of the most precious memories that I and my wife share. I am thankful that we can remember it together. It's a reminder that things are not what they seem and that angels come in many packages.\nWe live in College Station, Texas and we were on our way home from Houston, Texas around the Weston Lakes area one Saturday or Sunday morning. And when I say morning, I'm talking 1:00 to 2:00 in the morning. We were on our way home and decided to stop at a local gas station to get coffee and something to snack on since it was a good hour and a half before we'd reach home.\n\nWhen we were done, we got back into our car and before I started it, we noticed a man standing outside in front of the building. You could tell that he was a homeless man. His clothes were tattered and worn and it looked like he had gone in and gotten him some coffee or something warm to drink since it was cold this time of the year. He must have not had enough money to get something to eat. That is not something I remember too well, because that is not what \"moved\" me.\n\nThe next thing I remember is a dog that walked up to the front of the building. Being a dog lover, I noticed that she was part wolf and probably part German shepherd. I could tell it was a she, because you could tell that she had been feeding puppies. She was terribly in need of something to eat and I felt so bad for her. I knew if she didn't eat soon, she and her puppies would not make it.\n\nMy wife and I sat there and looked at her. We noticed that people walked by and didn't even pet her, like most people do when they walk by an animal in front of a store. She might not have been as pretty and clean as most, but she still deserved better. But we still did not do anything. But someone did. The homeless man, who I thought did not buy himself anything to eat, went back into the store. And what he did brought tears to my wife and me. He had gone into the store and with what money he may have had, bought a can of dog food and fed that dog.\n\nI know that this story isn't as inspirational as most stories, but it plays a great part in our lives. You see, that was Mother's Day weekend. And a lot of people forget that some animals are parents too. And animals - not only we humans - are God's creatures too.\n\nIt would be a better story if I could remember all the details, but even without the details, I believe it still gets the message across. It took a homeless man, to show me what I should have done. He showed me to be better man that day."
    },
    {
        "id": "4cadddc1c31c4c99ba6b29c9150a7f80",
        "title": "A Burglary",
        "content": "Wendy hailed from Ipoh. When she was promoted to assistant branch manager and transferred to a branch in Johore Bahru, she had to find a place of her own. After some canvassing for an affordable place, she found one on the second floor of a rented walk-up apartment in Tebrau. the four-storey building was quite old and there was only one apartment on each floor.\nOne day, when she returned from work, she found the door to her apartment slightly ajar. Sensing that something was wrong, she gently pushed the door inward. The sight that greeted her made her gasp in horror. The apartment was in a a mess. The couch and coffee table had been overturned. the glass door of the display cabinet was broken and everything was strewn all over the floor. She realized that her apartment had been burgled.\n\nThe, a sudden thought came to her which made her heart thump with fear. What if the burglars were still in her apartment, in her bedroom ? She pulled the door again and left it slightly ajar. Then, she ran down the stairs as quietly as she could. Once on the ground floor, she used her cellular phone to call the police.\n\nThe police arrived in less than ten minutes. There were four policemen and they accompanied Wendy to her apartment. The police told Wendy to stay outside the flat while the four policemen, with drawn arms, centered the apartment. They carefully searched the apartment for the burglars but it was obvious that the culprits have left long ago.\n\nThe police then sent for the crime technicians. The technicians spent more than hour looking for clues and dusting for fingerprint. Then, the police asked her to make a careful inventory of her things and to report the stolen items and to give her statement.\n\nMany weeks passed but the burglars were never caught and Wendy gave up hope of ever recovering her stolen valuables. Still, she continued to stay at the same place, but she had taken better security measures and even installed  burglar alarm to safeguard her property."
    },
    {
        "id": "1698bd2ebbcf4923aa6d7879f0ad2183",
        "title": "A Fire",
        "content": "James was cycling down a narrow street one evening when he saw thick black smoke billowing upwards into the sky some distance away. Though the fire was not visible from where James was, he knew that there must be a raging fire to cause such thick clouds of smoke. He continued to cycle down the street and before long, he came to the source of fire. An old three-storey wooden shophouse was ablaze.\nTwo large fire trucks were already there and the firemen were trying to put the fire out with their special fire-fighting equipment. But it seemed that the fire was wining the battle. The fire blazed even fiercely in other parts of the building when the fire in one portion looked about to be extinguished.\n\nThere were also cries and wails from women and men. These were probably the tenants or owners of the building. There were loud sobs and soft weeping by many. Others displayed a variety of emotions. Some were sad, some were angry and yet some other simply looked indifferent.\n\nJames could also see that there were also some casualties. There were three ambulances and James could see that the paramedics were busy transporting the injured onto stretchers and into the ambulances.\n\nThe police had also cordoned off the hazardous area and curious onlookers were kept at a safe distance.\n\nFrom where James was, he could feel the intense heat emitted by the inferno.\n\nIn another hour, the fire was finally contained but the shophouse was reduced to a smouldering ruin. The firemen packed their equipment and left the scene. the three ambulances had also sped off to the hospital with the casualties. Only the police were left. James took one final look at the burnt wreck and shook his head sadly before cycling off."
    },
    {
        "id": "3f895733cbed4ac780877689ebe6ff31",
        "title": "Proper Security Measures",
        "content": "Robbery and theft have been the plague of society since time immemorial. Though there have been instances when man had to steal food in impoverished countries because of hunger, the bulk of thefts committed are for easy wealth. They rob to avoid hard work and want an easy life, thinking that they can get away with their crimes. Because such immoral people exist, we have to take proper security measures to safeguard our property.\nSingapore is a prospering nation and her people have become more affluent in recent years. Many have their homes and offices equipped with expensive pick-proof locks and some have even installed burglar alarm systems. Others keep dangerous attack dogs like the Doberman pinscher and the German shepherd. Those who are able to afford the price have employed stern and unsmiling security guards to protect their premises.\n\nMany people are also very careful with the amount of cash they have in their person, preferring to leave their money and other valuables in banks. The widespread us of ATM cards and credit cards have also paved the way for a cashless society. this is to prevent huge losses if one's pockets have been picked as the victim could call the necessary banks and financial institutions to cancel his cards before they could be used by the thief. There have been numerous arrests in recent years of thieve who have tried to sue stolen credit cards.\n\nIt is a sad fact that even in our progressive country, the threat of robbery and theft is still ever-present, as it is plainly declared in the crime prevention police posters: \"Low crime does not mean no crime.\"\n\nThe steps we have to take to safeguard our properties have become second nature to most of us. Indeed, most of us lock our cars, homes and offices automatically when not in use. Those that have been negligent in taking proper security measures to safeguard their property have only themselves to blame if they were to be robbed. To be negligent in matters of security is equivalent to putting out a sign that loudly proclaims: \"My property is not protected, please rob me !\""
    },
    {
        "id": "fc5b007a6e3343c1bae39c0c60140e8d",
        "title": "A Farewell Party",
        "content": "We learnt that our form teacher, Mr. Yeo, was about to be transferred to another school in a week. All the pupils adored Mr. Yeo as he was a very good and dedicated teacher. He never shouted at us and was very patient with the slower pupils.\n\nOur class decided to hold a farewell party for this model teacher. But we needed to have the permission of the school's principal first. Zoe was given the task of writing to the principal for permission to hold the party as her handwriting was the neatest and her language skills were excellent. After the letter was written, all the pupils in the class signed the letter and a delegation of six pupils, myself included, went to the principal's office.\n\nThe principal was mildly curious when he saw the six of us in his office. We gave him the letter of petition and after reading it in silence, he frowned. He said that the request was very irregular but after the six of us beseeched him in earnest, he relented and gave us the permission. He allowed us to hold the party during the last period of the following Friday, which would be Mr. Yeo's last day of teaching in our school.\n\nThe whole class was excited after getting the permission. We gathered together after school and planned for the party. After some debate and discussion we finally agreed on the things we needed to do.\nOn the last period of school on the following Friday, our class monitor, Abdul Ghani, approached Mr. Yeo just as he was about to begin the next lesson.\n\n\"Sir, we have obtained permission from the principal to treat you to a simple farewell party.\"\n\nSome of the pupils then brought out the drinks and food that have been prepared by their parents. We have left it hidden in a corner so that Mr. Yeo would not see it as we wanted to surprise him. And surprise him we did! For an instant, he was speechless and his eyes took on a misty look. Then, he was back to his normal self again. He acquiesced to the treat and my classmate, Sujata, brought a paper plate of fried noodles and a cup of lemonade for Mr. Yeo. Everyone cheered and clapped as he took his first spoonful of fried noodles.\n\nAfter the meal, Mr. Yeo gave an impromptu farewell speech. He spoke for fifteen minutes, thanking the class for taking the trouble to hold the party and for being such caring pupils. His speech was also peppered with sound advice for us.\n\nJust before the school bell rang to signal the end of the school day, I was given the honour of presenting our farewell gift to Mr. Yeo. We knew him to be a great fan of mystery and detective novels and so we had bought for him the \"Complete Sherlock Holmes\" which contained all the stories and novelettes written by Sir Arthur Conan Doyle. When he unwrapped the gift, we saw two large beads of tears rolling down his cheeks. He was very deeply moved.\n\nThen, the school bell rang and each pupil shook hands with Mr. Yeo for one last time before heading for home."
    },
    {
        "id": "9508bfbba2e546ca982f7d5b6aef6ae2",
        "title": "Anger",
        "content": "Anger is perhaps the most destructive of man's emotions. A man in anger loses his sense of good judgment and does things that he would not even dream of doing when he is calm and collected.\n\nOnce, my elder brother was involved in a senseless fight. He was sixteen years old at that time and played soccer with an amateur team. While playing soccer with another amateur team, some players of the rival team taunted my brother, who played a defensive role in his team, after one of their teammates had scored a goal. My brother was hotheaded at that time and he replied to the taunts quite vehemently. This led to the exchange of insults and eventually a fight ensued. When he returned home that day, he had blue-black bruises on his face and body. He related the whole incident to my parents, after which he was severely reprimanded by my father for his behavior. My father advised him to be always level-headed and never to let anger blind him into doing senseless things.\n\nEvery once in a while, we read in the papers of youths and even adults involved in fights with dangerous weapons resulting in serious injury and even death. These incidents could have been easily avoided if the parties involved had not allowed anger to spoil their good judgment. A person should never act under the evil influence of anger as such rash acts would only lead to suffering and regret."
    },
    {
        "id": "2269fadabf8f4e0298c441b3cf297ee6",
        "title": "A Lesson Learnt",
        "content": "Kenny learnt to ride a bicycle when he was nine years old. His father had bought a bicycle for his ninth birthday and his elder brother coached him to ride. After the usual falls and bruises, he finally mastered the skill of riding the bicycle in a few days. Since then, Kenny loved to cycle around the neighborhood in the evenings.\n\nAt first, his parents did not allow him to ride on the roads but as he grew older and more mature, his parents relented and allowed him on the roads and even acquiesced to his cycling to school some two kilometers away.\n\nAt school, Kenny's enthusiasm for cycling rubbed on to his close friends. Many of them pestered their parents to buy bicycles for them and soon, one by one, all his friends owned bicycles. The boys would come to school on their bicycles and after school, they would go for a three-kilometer ride.\n\nOne day, Kenny was in town where there was an exhibition of bicycle stunts. Champion riders and stunt performers showed a variety of skills on the bicycle. They could do 'wheelies', jump over ropes on their bicycles and `fly' through the air with the aid of a sloping platform. Kenny witnessed this exhibition in awe and was duly impressed by the performance.\n\nWhen he reached home, he could not contain himself and wanted to try out some of the tricks he had witnessed. He mounted his bicycle and rode to a vacant plot of land where he could practice. He tried to do the 'wheelie' and after some time, he found that he could do it. Kenny thought that he had mastered the skill and happily made his way home.\n\nJust a short distance away from his house, Kenny decided to do the 'wheelie' on the road. As he pulled the handlebars to lift up the front of his bicycle, he lost his balance and fell sideways, colliding with a motorcycle traveling on the lane beside him. The motorcycle also lost control and both Kenny and the motorcyclist ended up sprawled on the road. The motorcyclist was not seriously hurt but Kenny was bleeding from his head and the skin on his arms and legs were scraped.\n\nLuckily, the motorcyclist had a mobile phone and he quickly called an ambulance. Kenny was rushed to the hospital where he was treated and warded. There were lacerations on his head, body, arms and legs. He had also fractured his left wrist. Kenny spent two weeks in hospital and took more than two months to fully recover.\n\nKenny had learnt a valuable lesson on that day. The road is not a place for stunts. He still enjoys riding his bicycle but he has realized that stunts are only for trained professionals."
    },
    {
        "id": "2dbc6a98b6044d499f2a0ecd864451a9",
        "title": "Home Hygiene",
        "content": "Pests and insects like the houseflies, ants, mosquitoes, cockroaches and lizards are a nuisance to health and comfort in the home. Though many people use generous amounts of insecticides in its many forms - sprays, coils, nets, etc  it seems that it has little or no effect on these creatures. The only way to ensure that our homes are pest-free is to make our surroundings as non-conducive as possible for their breeding and presence.\n\nMosquitoes are parasites which live on the blood of man and other animals and they are also carriers of deadly diseases such as malaria and dengue fever. Mosquitoes breed in stagnant water. So, we should never leave any water stagnant for a long period of time. We have to ensure that water does not collect in any area surrounding our homes and make it possible for mosquitoes to breed. Likewise, drains and pipes should be cleaned regularly.\n\nSpiders like to spin cobwebs in dark corners inside and outside the house. Therefore, it is wise to clean these corners once in a while so that these infrequented corners do not become homes for spiders and other creepy crawlies.\n\nHouseflies breed in rubbish. Many people leave their rubbish in open garbage bins which attracts flies. The flies will then swarm over to the kitchen and infect the food left open in plates and pans. The best way to keep flies away is to keep food covered at all times. Rubbish should be disposed in plastic bags tied securely with a knot before putting it into the garbage bin. The garbage bin should also be always covered.\n\nAnts and cockroaches search for bits of food lying about in the house. Cockroaches also thrive in filth and dirt. Therefore, ensure that the house, and especially the kitchen, is swept and cleaned everyday so that no particles of food are left on the floor. All eating and cooking utensils should be kept in pest-proof containers. Drawers and cabinets should also be checked periodically to ensure that ants and cockroaches are not breeding within them.\n\nTherefore, to ensure that our homes are pest-free, we have to adopt cleanliness and hygiene as our way of life."
    },
    {
        "id": "b147e9a5dfaa4c8a881207c8c5f9fd5c",
        "title": "My Favorite Author",
        "content": "One of my favorite authors is Michael Crichton. He has written several best-selling novels such as \"Jurassic Park\" and its sequel \"The Lost World\", \"The Andromeda Strain\", \"Eaters of the Dead\" and \"Rising Sun\". He is also the creator of the award-winning television series \"E.R.\"\n\nMichael Crichton is a wonderful storyteller. He spins his tales with true-to-life characters and his intricately woven plots are realistic. It is obvious that Michael Crichton does a good deal of research for all his science fiction novels are based on known scientific facts and sound theories. He does not invent unbelievable fantasies, like some others whom I do not want to name, to attract readers.\n\nFor example, in \"Jurassic Park\", Michael Crichton painstakingly portrays the means which the dinosaurs were cloned. The scientists first look for preserved blood-sucking insects from the Mesozoic Era trapped in ambers, that is, the hard translucent fossilized resin originating from extinct coniferous trees. Next, they look for traces of dinosaur blood in these insects. The tiny amounts that they extract from the insects are then used to clone the dinosaurs.\n\nOne can discern that Michael Crichton's knowledge of palaeontology and medical science is truly astounding when they read his two dinosaur novels.\n\nIn \"The Andromeda Strain\", Crichton tells the tale of a deadly micro-organism brought to Earth by a satellite. The bacteria kills people in seconds by clotting their blood solid. Again, his immense scientific knowledge comes into play when he writes this novel about how five scientists race against time to find a solution to nullify the effects of the 'Andromeda Strain'. This was his first book written in 1969 and after more than thirty years, it is still in print and remains in great demand by readers all over the world.\n\nMany of Michael Crichton's novels have been made into box-office hits. It is undeniable that this master storyteller is able to attract readers and audiences alike regardless of the medium, be it books or movies."
    }
]