[
    {
        "id": "81011af600b8482594084076f00da2e6",
        "word": "give",
        "pos": "verb",
        "level": "a1",
        "phonetic": {
            "uk": "/ɡɪv/",
            "us": "/ɡɪv/"
        },
        "nearby": [
            {
                "word": "git",
                "pos": "noun"
            },
            {
                "word": "githeri",
                "pos": "noun"
            },
            {
                "word": "give",
                "pos": "verb"
            },
            {
                "word": "give",
                "pos": "noun"
            },
            {
                "word": "give away",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to hand something to somebody so that they can look at it, use it or keep it for a time",
                    "vi": "giao một cái gì đó cho ai đó để họ có thể nhìn vào nó, sử dụng nó hoặc giữ nó trong một thời gian"
                },
                "examples": [
                    {
                        "en": "give something to somebody Give the letter to your mother when you've read it.",
                        "vi": "tặng một cái gì đó cho ai đó Đưa bức thư cho mẹ của bạn khi bạn đã đọc nó."
                    },
                    {
                        "en": "She gave her ticket to the woman at the check-in desk.",
                        "vi": "Cô đưa vé của mình cho người phụ nữ ở quầy làm thủ tục."
                    },
                    {
                        "en": "give somebody something Give your mother the letter.",
                        "vi": "cho ai đó một cái gì đó Đưa cho mẹ của bạn lá thư."
                    },
                    {
                        "en": "They were all given a box to carry.",
                        "vi": "Tất cả họ đều được phát một chiếc hộp để mang theo."
                    }
                ]
            },
            {
                "define": {
                    "en": "to hand something to somebody as a present; to allow somebody to have something as a present",
                    "vi": "để trao một cái gì đó cho ai đó như một món quà; để cho phép ai đó có một cái gì đó như một món quà"
                },
                "examples": [
                    {
                        "en": "give somebody something What are you giving your father for his birthday?",
                        "vi": "tặng ai đó cái gì Bạn đang tặng gì cho bố của bạn vào ngày sinh nhật của ông ấy?"
                    },
                    {
                        "en": "She was given a huge bunch of flowers.",
                        "vi": "Cô ấy được tặng một bó hoa rất lớn."
                    },
                    {
                        "en": "Did you give the waiter a tip?",
                        "vi": "Bạn đã cho người phục vụ một tiền boa chưa?"
                    },
                    {
                        "en": "give something to somebody She gave a couple of pounds to the beggar.",
                        "vi": "đưa một cái gì đó cho ai đó Cô ấy đã đưa cho người ăn mày một vài pound."
                    },
                    {
                        "en": "give (something) We all agreed not to give presents this year.",
                        "vi": "tặng (cái gì đó) Tất cả chúng tôi đều đồng ý không tặng quà trong năm nay."
                    },
                    {
                        "en": "They say it's better to give than to receive.",
                        "vi": "Họ nói rằng tốt hơn là cho đi hơn là nhận."
                    }
                ]
            },
            {
                "define": {
                    "en": "to provide somebody with something",
                    "vi": "cung cấp cho ai đó một cái gì đó"
                },
                "examples": [
                    {
                        "en": "give somebody something They were all thirsty so I gave them a drink.",
                        "vi": "cho ai đó thứ gì đó Họ đều khát nên tôi cho họ uống."
                    },
                    {
                        "en": "Give me your name and address.",
                        "vi": "Cho tôi tên và địa chỉ của bạn."
                    },
                    {
                        "en": "We've been given a 2 per cent pay increase.",
                        "vi": "Chúng tôi đã được tăng lương 2%."
                    },
                    {
                        "en": "I was hoping you would give me a job.",
                        "vi": "Tôi đã hy vọng bạn sẽ cho tôi một công việc."
                    },
                    {
                        "en": "He was given a new heart in a five-hour operation.",
                        "vi": "Anh ấy đã được trao một trái tim mới trong một ca phẫu thuật kéo dài 5 giờ đồng hồ."
                    },
                    {
                        "en": "Give me some time to decide.",
                        "vi": "Hãy cho tôi một thời gian để quyết định."
                    },
                    {
                        "en": "We should at least give him the opportunity to explain why he did this.",
                        "vi": "Ít nhất chúng ta nên cho anh ta cơ hội để giải thích lý do tại sao anh ta làm điều này."
                    },
                    {
                        "en": "This should give you some idea of the extent of the problem.",
                        "vi": "Điều này sẽ cung cấp cho bạn một số ý tưởng về mức độ của vấn đề."
                    },
                    {
                        "en": "Can you give us some sense of exactly what is at stake here?",
                        "vi": "Bạn có thể cho chúng tôi biết chính xác những gì đang bị đe dọa ở đây không?"
                    },
                    {
                        "en": "We'll give you all the help we can.",
                        "vi": "Chúng tôi sẽ cung cấp cho bạn tất cả sự giúp đỡ mà chúng tôi có thể."
                    },
                    {
                        "en": "She wants a job that gives her more responsibility.",
                        "vi": "Cô ấy muốn một công việc mang lại cho cô ấy nhiều trách nhiệm hơn."
                    },
                    {
                        "en": "Can I give you a ride to the station?",
                        "vi": "Tôi có thể cho bạn một chuyến xe đến nhà ga?"
                    },
                    {
                        "en": "I'll give you (= allow you to have) ten minutes to prepare your answer.",
                        "vi": "Tôi sẽ cho bạn (= cho phép bạn có) mười phút để chuẩn bị câu trả lời của bạn."
                    },
                    {
                        "en": "Don't give me any of that backchat (= don't be rude).",
                        "vi": "Đừng đưa cho tôi bất kỳ backchat đó (= đừng thô lỗ)."
                    },
                    {
                        "en": "give something to somebody He gives Italian lessons to his colleagues.",
                        "vi": "trao một cái gì đó cho ai đó Anh ấy đưa ra những bài học tiếng Ý cho đồng nghiệp của mình."
                    },
                    {
                        "en": "The reforms should give a better chance to the less able children.",
                        "vi": "Các cải cách nên tạo cơ hội tốt hơn cho những trẻ em kém khả năng hơn."
                    },
                    {
                        "en": "give something She gave some helpful advice.",
                        "vi": "đưa ra điều gì đó Cô ấy đã đưa ra một số lời khuyên hữu ích."
                    },
                    {
                        "en": "She gives the impression of being very busy.",
                        "vi": "Cô ấy tạo ấn tượng là rất bận rộn."
                    },
                    {
                        "en": "I was asked to give evidence at the trial.",
                        "vi": "Tôi được yêu cầu đưa ra bằng chứng tại phiên tòa."
                    }
                ]
            },
            {
                "define": {
                    "en": "to pay money to a charity, etc., to help people",
                    "vi": "để trả tiền cho một tổ chức từ thiện, v.v., để giúp đỡ mọi người"
                },
                "examples": [
                    {
                        "en": "We need your help—please give generously.",
                        "vi": "Chúng tôi cần sự giúp đỡ của bạn — vui lòng rộng lượng."
                    },
                    {
                        "en": "give to something They both gave regularly to charity.",
                        "vi": "cho một cái gì đó Cả hai đều thường xuyên cho từ thiện."
                    },
                    {
                        "en": "give something I gave a small donation.",
                        "vi": "cho một cái gì đó tôi đã cho một khoản đóng góp nhỏ."
                    },
                    {
                        "en": "give something to something A lot of people give money to good causes.",
                        "vi": "cho một cái gì đó cho một cái gì đó Rất nhiều người cho tiền vì những mục đích tốt."
                    }
                ]
            },
            {
                "define": {
                    "en": "to pay in order to have or do something",
                    "vi": "trả tiền để có hoặc làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "give somebody something I'll give you £100 and not a penny more!",
                        "vi": "cho ai đó thứ gì đó, tôi sẽ cho bạn £ 100 và không thêm một xu nào!"
                    },
                    {
                        "en": "give somebody something for something How much will you give me for the car?",
                        "vi": "cho ai đó cái gì đó cho cái gì Bạn sẽ cho tôi bao nhiêu tiền cho chiếc xe?"
                    },
                    {
                        "en": "give something I'd give anything to see him again.",
                        "vi": "cho một cái gì đó Tôi sẽ cho bất cứ điều gì để gặp lại anh ta."
                    },
                    {
                        "en": "give something for something I gave £50 for the lot.",
                        "vi": "cho một cái gì đó cho một cái gì đó Tôi đã trả £ 50 cho rất nhiều."
                    }
                ]
            },
            {
                "define": {
                    "en": "used with a noun to describe a particular action, giving the same meaning as the related verb",
                    "vi": "Được sử dụng với một danh từ để mô tả một hành động cụ thể, mang lại ý nghĩa tương tự như động từ liên quan"
                },
                "examples": [
                    {
                        "en": "give something She gave a shrug of her shoulders (= shrugged).",
                        "vi": "đưa ra một cái gì đó Cô ấy đã cho một cái nhún vai của cô ấy (= nhún vai)."
                    },
                    {
                        "en": "He turned to us and gave a big smile (= smiled broadly).",
                        "vi": "Anh ấy quay sang chúng tôi và nở một nụ cười thật tươi (= cười thật tươi)."
                    },
                    {
                        "en": "She looked up from her work and gave a yawn (= yawned).",
                        "vi": "Cô ấy ngước lên khỏi chỗ làm của mình và ngáp một cái (= ngáp dài)."
                    },
                    {
                        "en": "He gave a loud cry (= cried out loudly) and fell to the floor.",
                        "vi": "Anh ta hét lên một tiếng (= khóc không thành tiếng) và ngã xuống sàn."
                    },
                    {
                        "en": "Her work has given pleasure to (= pleased) millions of readers.",
                        "vi": "Tác phẩm của cô ấy đã mang lại niềm vui cho (= làm hài lòng) hàng triệu độc giả."
                    },
                    {
                        "en": "give somebody something He gave her a kiss (= kissed her).",
                        "vi": "cho ai đó thứ gì đó. Anh ấy đã cho cô ấy một nụ hôn (= đã hôn cô ấy)."
                    },
                    {
                        "en": "I have to admit that the news gave us a shock (= shocked us).",
                        "vi": "Tôi phải thừa nhận rằng tin tức đã gây cho chúng tôi một cú sốc (= khiến chúng tôi bị sốc)."
                    },
                    {
                        "en": "He gave me a suspicious look (= looked at me suspiciously).",
                        "vi": "Anh ta đưa cho tôi một cái nhìn nghi ngờ (= nhìn tôi nghi ngờ)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to produce a particular feeling in somebody",
                    "vi": "để tạo ra một cảm giác cụ thể ở ai đó"
                },
                "examples": [
                    {
                        "en": "All that driving has given me a headache.",
                        "vi": "Tất cả những gì lái xe đã làm cho tôi đau đầu."
                    },
                    {
                        "en": "Go for a walk. It'll give you an appetite.",
                        "vi": "Đi dạo. Nó sẽ mang lại cho bạn cảm giác ngon miệng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make a phone call to somebody",
                    "vi": "gọi điện thoại cho ai đó"
                },
                "examples": [
                    {
                        "en": "Give me a call tomorrow.",
                        "vi": "Hãy gọi cho tôi vào ngày mai."
                    },
                    {
                        "en": "(British English) I'll give you a ring.",
                        "vi": "(Anh Anh) Tôi sẽ đưa cho bạn một chiếc nhẫn."
                    }
                ]
            },
            {
                "define": {
                    "en": "to judge somebody/something to be of a particular standard",
                    "vi": "đánh giá ai đó / cái gì đó theo một tiêu chuẩn cụ thể"
                },
                "examples": [
                    {
                        "en": "give somebody/something sth She had given the assignment an A.",
                        "vi": "đưa cho ai đó / cái gì đó sth Cô ấy đã cho bài tập là A."
                    },
                    {
                        "en": "I give it ten out of ten for originality.",
                        "vi": "Tôi cho nó mười trên mười cho sự độc đáo."
                    },
                    {
                        "en": "give something He virtually never gives a grade of less than C.",
                        "vi": "đưa ra thứ gì đó Anh ấy hầu như không bao giờ cho điểm dưới C."
                    },
                    {
                        "en": "give something to somebody/something I gave top marks to her essay.",
                        "vi": "tặng một cái gì đó cho ai đó / cái gì đó mà tôi đã cho điểm cao nhất cho bài luận của cô ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to pass an illness onto somebody and make them ill",
                    "vi": "truyền bệnh cho ai đó và làm cho họ bị ốm"
                },
                "examples": [
                    {
                        "en": "give somebody something You've given me your cold.",
                        "vi": "cho ai đó một cái gì đó Bạn đã cho tôi cảm lạnh của bạn."
                    },
                    {
                        "en": "give something to somebody She'd given the bug to all her colleagues.",
                        "vi": "đưa cái gì đó cho ai đó Cô ấy đã đưa lỗi cho tất cả các đồng nghiệp của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody suffer a particular punishment",
                    "vi": "để khiến ai đó phải chịu một hình phạt cụ thể"
                },
                "examples": [
                    {
                        "en": "give somebody something The judge gave him a nine-month suspended sentence.",
                        "vi": "cho ai đó thứ gì đó. Thẩm phán cho anh ta 9 tháng tù treo."
                    },
                    {
                        "en": "give something to somebody We discussed what punishment should be given to the boys.",
                        "vi": "đưa một cái gì đó cho ai đó Chúng tôi đã thảo luận về hình phạt nào nên được đưa ra cho các cậu bé."
                    }
                ]
            },
            {
                "define": {
                    "en": "if you give a party, you organize it and invite people",
                    "vi": "nếu bạn tổ chức một bữa tiệc, bạn tổ chức nó và mời mọi người"
                },
                "examples": [
                    {
                        "en": "We're giving a party to celebrate our silver wedding.",
                        "vi": "Chúng tôi đang tổ chức một bữa tiệc để kỷ niệm đám cưới bạc của chúng tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to perform something in public",
                    "vi": "để biểu diễn một cái gì đó trước công chúng"
                },
                "examples": [
                    {
                        "en": "give something He gave a rousing performance of the Bob Marley song.",
                        "vi": "đưa ra thứ gì đó Anh ấy đã trình diễn bài hát của Bob Marley một cách sôi động."
                    },
                    {
                        "en": "She gave a reading from her latest volume of poetry.",
                        "vi": "Cô ấy đã đọc tập thơ mới nhất của mình."
                    },
                    {
                        "en": "The President will be giving a press conference this afternoon.",
                        "vi": "Tổng thống sẽ có một cuộc họp báo vào chiều nay."
                    },
                    {
                        "en": "give something to somebody She gave a fine speech to the waiting crowd.",
                        "vi": "đưa cái gì đó cho ai đó Cô ấy đã có một bài phát biểu hay trước đám đông đang chờ đợi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to use time, energy, etc. for somebody/something",
                    "vi": "để sử dụng thời gian, năng lượng, v.v. cho ai đó / điều gì đó"
                },
                "examples": [
                    {
                        "en": "give somebody/something sth I gave the matter a lot of thought.",
                        "vi": "cho ai đó / cái gì đó tôi đã suy nghĩ rất nhiều vấn đề."
                    },
                    {
                        "en": "give something to somebody/something I gave a lot of thought to the matter.",
                        "vi": "đưa cái gì đó cho ai đó / cái gì đó mà tôi đã suy nghĩ rất nhiều về vấn đề."
                    },
                    {
                        "en": "The government has given top priority to reforming the tax system.",
                        "vi": "Chính phủ đã dành ưu tiên hàng đầu cho việc cải cách hệ thống thuế."
                    }
                ]
            },
            {
                "define": {
                    "en": "to predict that something will last a particular length of time",
                    "vi": "để dự đoán rằng điều gì đó sẽ tồn tại trong một khoảng thời gian cụ thể"
                },
                "examples": [
                    {
                        "en": "That marriage won't last. I'll give them two years at the outside.",
                        "vi": "Cuộc hôn nhân đó sẽ không kéo dài. Tôi sẽ cho họ hai năm ở bên ngoài."
                    }
                ]
            },
            {
                "define": {
                    "en": "to say that a player or the ball is in a particular position or that a goal has been scored",
                    "vi": "để nói rằng một cầu thủ hoặc quả bóng đang ở một vị trí cụ thể hoặc một bàn thắng đã được ghi"
                },
                "examples": [
                    {
                        "en": "give somebody/something + adj. The umpire gave the ball out.",
                        "vi": "cho ai đó / cái gì đó + adj. Trọng tài chính đưa bóng ra ngoài."
                    },
                    {
                        "en": "give something The ref gave the goal.",
                        "vi": "đưa ra một cái gì đó Người giới thiệu đã đưa ra mục tiêu."
                    }
                ]
            },
            {
                "define": {
                    "en": "to bend or stretch under pressure",
                    "vi": "uốn cong hoặc kéo dài dưới áp lực"
                },
                "examples": [
                    {
                        "en": "The branch began to give under his weight.",
                        "vi": "Cành bắt đầu cho dưới sức nặng của anh ta."
                    },
                    {
                        "en": "(figurative) We can't go on like this—something's got to give.",
                        "vi": "(nghĩa bóng) Chúng ta không thể tiếp tục như thế này - phải cho đi một cái gì đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "to agree to change your mind or give up some of your demands",
                    "vi": "đồng ý thay đổi ý định hoặc từ bỏ một số yêu cầu của bạn"
                },
                "examples": [
                    {
                        "en": "You're going to have to give a little.",
                        "vi": "Bạn sẽ phải cho một ít."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to tell somebody that you do not accept what they say",
                    "vi": "từng nói với ai đó rằng bạn không chấp nhận những gì họ nói"
                },
                "examples": [
                    {
                        "en": "‘I didn't have time to do it.’ ‘Oh, don't give me that!’",
                        "vi": "Tôi không có thời gian để làm việc đó.' 'Ồ, đừng đưa tôi cái đó!'"
                    }
                ]
            },
            {
                "define": {
                    "en": "to be willing, in a relationship, to accept what somebody else wants and to give up some of what you want",
                    "vi": "sẵn sàng, trong một mối quan hệ, chấp nhận những gì người khác muốn và từ bỏ một số điều bạn muốn"
                },
                "examples": [
                    {
                        "en": "You're going to have to learn to give and take.",
                        "vi": "Bạn sẽ phải học cách cho và nhận."
                    }
                ]
            },
            {
                "define": {
                    "en": "to react with equal force when somebody attacks or criticizes you",
                    "vi": "phản ứng với lực lượng ngang nhau khi ai đó tấn công hoặc chỉ trích bạn"
                },
                "examples": [
                    {
                        "en": "She can give as good as she gets.",
                        "vi": "Cô ấy có thể cho càng nhiều càng tốt."
                    }
                ]
            },
            {
                "define": {
                    "en": "to show your approval of somebody by clapping your hands",
                    "vi": "để thể hiện sự tán thành của bạn đối với ai đó bằng cách vỗ tay của bạn"
                },
                "examples": [
                    {
                        "en": "Give it up for Ed Sheeran!",
                        "vi": "Hãy từ bỏ nó cho Ed Sheeran!"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that you prefer a particular thing or person to the one that has just been mentioned",
                    "vi": "được sử dụng để nói rằng bạn thích một điều hoặc một người cụ thể hơn một điều vừa được đề cập"
                },
                "examples": [
                    {
                        "en": "We don't go out much. Give me a quiet night in front of the TV any day!",
                        "vi": "Chúng tôi không đi chơi nhiều. Cho tôi một đêm yên tĩnh trước TV bất cứ ngày nào!"
                    }
                ]
            },
            {
                "define": {
                    "en": "if something is correct give or take a particular amount, it is approximately correct",
                    "vi": "nếu một cái gì đó là chính xác cho hoặc lấy một số lượng cụ thể, nó là gần đúng"
                },
                "examples": [
                    {
                        "en": "It'll take about three weeks, give or take a day or so.",
                        "vi": "Sẽ mất khoảng ba tuần, cho hoặc lâu hơn một ngày."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody believe/understand something",
                    "vi": "để làm cho ai đó tin / hiểu điều gì đó"
                },
                "examples": [
                    {
                        "en": "I was given to understand that she had resigned.",
                        "vi": "Tôi được cho để hiểu rằng cô ấy đã từ chức."
                    }
                ]
            },
            {
                "define": {
                    "en": "to severely punish or criticize somebody for doing something wrong",
                    "vi": "trừng phạt nghiêm khắc hoặc chỉ trích ai đó đã làm điều gì đó sai trái"
                },
                "examples": [
                    {
                        "en": "My son was rude to my friends so I gave him what for.",
                        "vi": "Con trai tôi vô lễ với bạn bè của tôi vì vậy tôi đã cho nó để làm gì."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to ask people to drink a toast to somebody",
                    "vi": "từng yêu cầu mọi người uống bánh mì nướng với ai đó"
                },
                "examples": [
                    {
                        "en": "Ladies and gentlemen, I give you Geoff Ogilby!",
                        "vi": "Thưa quý vị, tôi tặng quý vị Geoff Ogilby!"
                    }
                ]
            },
            {
                "define": {
                    "en": "used when you are admitting that something is true",
                    "vi": "được sử dụng khi bạn thừa nhận rằng điều gì đó là đúng"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "what is happening?; what is the news?",
                    "vi": "chuyện gì đang xảy ra vậy ?; tin tức là gì?"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "973e1ed7491743fb917d2e25b26f8c88",
        "word": "help",
        "pos": "verb",
        "level": "a1",
        "phonetic": {
            "uk": "/help/",
            "us": "/help/"
        },
        "nearby": [
            {
                "word": "helmeted",
                "pos": "adjective"
            },
            {
                "word": "helmsman",
                "pos": "noun"
            },
            {
                "word": "help",
                "pos": "verb"
            },
            {
                "word": "help",
                "pos": "noun"
            },
            {
                "word": "help",
                "pos": "exclamation"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to make it easier or possible for somebody to do something by doing something for them or by giving them something that they need",
                    "vi": "để giúp ai đó làm điều gì đó dễ dàng hơn hoặc có thể bằng cách làm điều gì đó cho họ hoặc bằng cách đưa cho họ thứ gì đó mà họ cần"
                },
                "examples": [
                    {
                        "en": "What can I do to help?",
                        "vi": "Tôi có thể làm gì để giúp đỡ?"
                    },
                    {
                        "en": "I was only trying to help!",
                        "vi": "Tôi chỉ cố gắng giúp đỡ!"
                    },
                    {
                        "en": "help with something He always helps with the housework.",
                        "vi": "Giúp việc gì đó Anh ấy luôn giúp việc nhà."
                    },
                    {
                        "en": "help somebody They are trying their best to do a good job and help others.",
                        "vi": "giúp đỡ ai đó Họ đang cố gắng hết sức để làm tốt công việc và giúp đỡ người khác."
                    },
                    {
                        "en": "help somebody with something Jo will help us with some of the organization.",
                        "vi": "giúp ai đó một cái gì đó Jo sẽ giúp chúng tôi với một số tổ chức."
                    },
                    {
                        "en": "help in doing something Following these steps will help in protecting our environment.",
                        "vi": "giúp làm điều gì đó Làm theo các bước sau sẽ giúp bảo vệ môi trường của chúng ta."
                    },
                    {
                        "en": "help somebody (to) do something Come and help me lift this box.",
                        "vi": "Giúp ai đó (để) làm điều gì đó Hãy đến và giúp tôi nâng chiếc hộp này lên."
                    },
                    {
                        "en": "This charity aims to help people to help themselves.",
                        "vi": "Tổ chức từ thiện này nhằm mục đích giúp mọi người tự giúp mình."
                    },
                    {
                        "en": "The college's aim is to help students achieve their aspirations.",
                        "vi": "Mục đích của trường là giúp sinh viên đạt được nguyện vọng của mình."
                    },
                    {
                        "en": "help (to) do something She helped organize the party.",
                        "vi": "giúp (để) làm điều gì đó Cô ấy đã giúp tổ chức bữa tiệc."
                    },
                    {
                        "en": "Some history may help to explain why this is.",
                        "vi": "Một số lịch sử có thể giúp giải thích tại sao lại như vậy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to improve a situation; to make it easier for something to happen",
                    "vi": "để cải thiện một tình huống; để làm cho điều gì đó xảy ra dễ dàng hơn"
                },
                "examples": [
                    {
                        "en": "The support of our families has helped enormously.",
                        "vi": "Sự hỗ trợ của gia đình chúng tôi đã giúp rất nhiều."
                    },
                    {
                        "en": "it helps (doing something) It helped being able to talk about it.",
                        "vi": "nó giúp (làm điều gì đó) Nó đã giúp có thể nói về nó."
                    },
                    {
                        "en": "it helps that… It certainly helped that her father is a duke!",
                        "vi": "Nó giúp ích cho điều đó… Nó chắc chắn đã giúp ích cho việc cha cô ấy là một công tước!"
                    },
                    {
                        "en": "help towards something The money raised will help towards (= partly pay for) the cost of organizing the championships.",
                        "vi": "giúp đỡ về điều gì đó Số tiền quyên góp được sẽ giúp hỗ trợ (= chi trả một phần) chi phí tổ chức giải vô địch."
                    },
                    {
                        "en": "help something It doesn't really help matters knowing that everyone is talking about us.",
                        "vi": "giúp đỡ điều gì đó Không thực sự giúp ích gì khi biết rằng mọi người đang nói về chúng tôi."
                    },
                    {
                        "en": "help (to) do something This should help to reduce the pain.",
                        "vi": "giúp (để) làm điều gì đó Điều này sẽ giúp giảm bớt cơn đau."
                    },
                    {
                        "en": "We need new measures to help fight terrorism.",
                        "vi": "Chúng ta cần các biện pháp mới để giúp chống lại chủ nghĩa khủng bố."
                    }
                ]
            },
            {
                "define": {
                    "en": "to help somebody move or do some other action by letting them lean on you, guiding them, etc.",
                    "vi": "để giúp ai đó di chuyển hoặc thực hiện một số hành động khác bằng cách để họ dựa vào bạn, hướng dẫn họ, v.v."
                },
                "examples": [
                    {
                        "en": "She helped him to his feet.",
                        "vi": "Cô đã giúp anh đứng dậy."
                    },
                    {
                        "en": "We were helped ashore by local people.",
                        "vi": "Chúng tôi đã được người dân địa phương giúp vào bờ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to give yourself/somebody food, drinks, etc.",
                    "vi": "để cho bản thân / ai đó đồ ăn, thức uống, v.v."
                },
                "examples": [
                    {
                        "en": "help yourself If you want another drink, just help yourself.",
                        "vi": "tự giúp mình Nếu bạn muốn một thức uống khác, hãy tự giúp mình."
                    },
                    {
                        "en": "help yourself/somebody to something Can I help you to some more salad?",
                        "vi": "Giúp bản thân / ai đó một cái gì đó Tôi có thể giúp bạn thêm món salad không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "to take something without permission",
                    "vi": "lấy một cái gì đó mà không có sự cho phép"
                },
                "examples": [
                    {
                        "en": "He'd been helping himself to the money in the cash register.",
                        "vi": "Anh ấy đã tự giúp mình kiếm tiền trong máy tính tiền."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to say that it is impossible to prevent or avoid something",
                    "vi": "được sử dụng để nói rằng không thể ngăn chặn hoặc tránh một cái gì đó"
                },
                "examples": [
                    {
                        "en": "I can't help thinking he knows more than he has told us.",
                        "vi": "Tôi không thể không nghĩ rằng anh ấy biết nhiều hơn những gì anh ấy đã nói với chúng tôi."
                    },
                    {
                        "en": "He can’t help being ugly.",
                        "vi": "Anh ta không thể không xấu xí."
                    },
                    {
                        "en": "She couldn't help but wonder what he was thinking.",
                        "vi": "Cô không khỏi tự hỏi anh đang nghĩ gì."
                    },
                    {
                        "en": "It couldn't be helped (= there was no way of avoiding it and we must accept it).",
                        "vi": "Không thể tránh được (= không có cách nào để tránh nó và chúng ta phải chấp nhận nó)."
                    },
                    {
                        "en": "He never does more work than he can help (= he does as little as possible).",
                        "vi": "Anh ấy không bao giờ làm nhiều việc hơn mức anh ấy có thể giúp (= anh ấy làm càng ít càng tốt)."
                    },
                    {
                        "en": "I always end up having an argument with her, I don't know why, I just can't help it.",
                        "vi": "Tôi luôn luôn kết thúc cuộc tranh cãi với cô ấy, tôi không biết tại sao, chỉ là tôi không thể tránh được."
                    },
                    {
                        "en": "I couldn't help it if the bus was late (= it wasn't my fault).",
                        "vi": "Tôi không thể giúp được gì nếu xe buýt đến muộn (= đó không phải lỗi của tôi)."
                    },
                    {
                        "en": "She burst out laughing—she couldn't help herself (= couldn't stop herself).",
                        "vi": "Cô ấy phá lên cười - cô ấy không thể tự giúp mình (= không thể ngăn mình lại)."
                    },
                    {
                        "en": "She won’t be invited again, not if I can help it (= if I can do anything to prevent it).",
                        "vi": "Cô ấy sẽ không được mời lần nữa, không nếu tôi có thể giúp nó (= nếu tôi có thể làm bất cứ điều gì để ngăn chặn điều đó)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to help somebody",
                    "vi": "để giúp ai đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to say that you are afraid somebody will be in danger or that something bad will happen to them",
                    "vi": "từng nói rằng bạn sợ ai đó gặp nguy hiểm hoặc điều gì đó tồi tệ sẽ xảy ra với họ"
                },
                "examples": [
                    {
                        "en": "God help us if this doesn't work.",
                        "vi": "Chúa giúp chúng tôi nếu điều này không hiệu quả."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to swear that what you are saying is true, especially in a court of law",
                    "vi": "từng thề rằng những gì bạn đang nói là đúng, đặc biệt là trước tòa án pháp luật"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "6b0fe803c07041978775dfe358d9cdda",
        "word": "help",
        "pos": "noun",
        "level": "a1",
        "phonetic": {
            "uk": "/help/",
            "us": "/help/"
        },
        "nearby": [
            {
                "word": "helmsman",
                "pos": "noun"
            },
            {
                "word": "help",
                "pos": "verb"
            },
            {
                "word": "help",
                "pos": "noun"
            },
            {
                "word": "help",
                "pos": "exclamation"
            },
            {
                "word": "help desk",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the act of helping somebody to do something",
                    "vi": "hành động giúp ai đó làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "Thank you for all your help.",
                        "vi": "Cảm ơn bạn cho tất cả sự giúp đỡ của bạn."
                    },
                    {
                        "en": "to ask/call/appeal for help",
                        "vi": "yêu cầu / gọi / khiếu nại để được giúp đỡ"
                    },
                    {
                        "en": "The offer of help came too late.",
                        "vi": "Lời đề nghị giúp đỡ đã đến quá muộn."
                    },
                    {
                        "en": "help with something Do you need any help with that?",
                        "vi": "giúp đỡ về điều gì Bạn có cần giúp gì không?"
                    },
                    {
                        "en": "of help (to somebody) Can I be of any help to you?",
                        "vi": "giúp đỡ (cho ai đó) Tôi có thể giúp được gì cho bạn không?"
                    },
                    {
                        "en": "with help from somebody/something With help from a parent, a child can do simple cooking.",
                        "vi": "với sự giúp đỡ của ai đó / cái gì đó Với sự giúp đỡ của cha mẹ, một đứa trẻ có thể nấu ăn đơn giản."
                    },
                    {
                        "en": "with the help of somebody/something She recovered with the help of her family and friends.",
                        "vi": "với sự giúp đỡ của ai đó / cái gì đó Cô ấy đã bình phục với sự giúp đỡ của gia đình và bạn bè của cô ấy."
                    },
                    {
                        "en": "He attended university with the help of a scholarship.",
                        "vi": "Anh ấy đã theo học đại học với sự trợ giúp của một học bổng."
                    },
                    {
                        "en": "without the help of somebody/something None of this would have been possible without their help.",
                        "vi": "Nếu không có sự giúp đỡ của ai đó / cái gì đó Không ai trong số này có thể thực hiện được nếu không có sự giúp đỡ của họ."
                    },
                    {
                        "en": "They have at last decided to enlist the help of experts.",
                        "vi": "Cuối cùng họ đã quyết định tranh thủ sự giúp đỡ của các chuyên gia."
                    },
                    {
                        "en": "They can usually manage by themselves, but occasionally need outside help.",
                        "vi": "Họ thường có thể tự xoay sở, nhưng đôi khi cần sự trợ giúp từ bên ngoài."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of helping somebody who is in danger",
                    "vi": "hành động giúp đỡ ai đó đang gặp nguy hiểm"
                },
                "examples": [
                    {
                        "en": "Quick, get help!",
                        "vi": "Nhanh lên, nhận trợ giúp!"
                    },
                    {
                        "en": "She screamed for help.",
                        "vi": "Cô hét lên để được giúp đỡ."
                    },
                    {
                        "en": "His suicide attempt was really a cry for help.",
                        "vi": "Nỗ lực tự tử của anh thực sự là một tiếng kêu cứu."
                    }
                ]
            },
            {
                "define": {
                    "en": "advice, money, etc. that is given to somebody in order to solve their problems",
                    "vi": "lời khuyên, tiền bạc, v.v. được đưa cho ai đó để giải quyết vấn đề của họ"
                },
                "examples": [
                    {
                        "en": "professional/medical/financial help",
                        "vi": "trợ giúp chuyên môn / y tế / tài chính"
                    },
                    {
                        "en": "I decided to seek legal help.",
                        "vi": "Tôi quyết định tìm kiếm sự trợ giúp pháp lý."
                    },
                    {
                        "en": "help in doing something The organization offers practical help in dealing with paperwork.",
                        "vi": "giúp đỡ trong việc làm gì đó Tổ chức cung cấp sự trợ giúp thiết thực trong việc giải quyết các thủ tục giấy tờ."
                    },
                    {
                        "en": "help with something You should qualify for help with the costs of running a car.",
                        "vi": "giúp đỡ một cái gì đó Bạn nên đủ điều kiện để được giúp đỡ về chi phí chạy xe."
                    },
                    {
                        "en": "help for somebody The charity provides emergency help for refugees.",
                        "vi": "giúp đỡ cho ai đó Tổ chức từ thiện cung cấp trợ giúp khẩn cấp cho những người tị nạn."
                    },
                    {
                        "en": "help from somebody Get help from someone who understands the legal side.",
                        "vi": "trợ giúp từ ai đó Nhận trợ giúp từ người hiểu rõ về mặt pháp lý."
                    }
                ]
            },
            {
                "define": {
                    "en": "a function on a computer, phone, etc. that provides information on how to use the computer, phone, etc.",
                    "vi": "một chức năng trên máy tính, điện thoại, v.v. cung cấp thông tin về cách sử dụng máy tính, điện thoại, v.v."
                },
                "examples": [
                    {
                        "en": "The online help is very good.",
                        "vi": "Sự trợ giúp trực tuyến là rất tốt."
                    },
                    {
                        "en": "a help file/page/menu/screen",
                        "vi": "tệp trợ giúp / trang / menu / màn hình"
                    }
                ]
            },
            {
                "define": {
                    "en": "the fact of being useful",
                    "vi": "thực tế là hữu ích"
                },
                "examples": [
                    {
                        "en": "The map wasn't much help.",
                        "vi": "Bản đồ không giúp được gì nhiều."
                    },
                    {
                        "en": "Was the information I gave you any help?",
                        "vi": "Thông tin tôi đã cung cấp cho bạn có giúp được gì không?"
                    },
                    {
                        "en": "Just shouting at him isn't going to be a lot of help.",
                        "vi": "Chỉ hét vào mặt anh ta sẽ không giúp ích được nhiều."
                    },
                    {
                        "en": "with the help of something I managed to understand it with the help of a dictionary.",
                        "vi": "với sự trợ giúp của một thứ gì đó, tôi đã cố gắng hiểu được nó với sự trợ giúp của từ điển."
                    },
                    {
                        "en": "of help (to somebody) The course they sent me on was of no help whatsoever!",
                        "vi": "giúp đỡ (cho ai đó) Khóa học mà họ đã gửi cho tôi không giúp ích được gì!"
                    }
                ]
            },
            {
                "define": {
                    "en": "a person or thing that helps somebody",
                    "vi": "một người hoặc một việc giúp đỡ ai đó"
                },
                "examples": [
                    {
                        "en": "She was more of a hindrance than a help.",
                        "vi": "Cô ấy là một trở ngại nhiều hơn là một sự giúp đỡ."
                    },
                    {
                        "en": "It's a great help having you around.",
                        "vi": "Đó là một sự trợ giúp tuyệt vời khi có bạn ở bên."
                    },
                    {
                        "en": "Your advice was a big help.",
                        "vi": "Lời khuyên của bạn là một trợ giúp lớn."
                    },
                    {
                        "en": "a help to somebody She's been a big help to her father.",
                        "vi": "một sự giúp đỡ cho ai đó Cô ấy là một người giúp đỡ rất nhiều cho cha cô ấy."
                    },
                    {
                        "en": "(ironic) You're a great help, I must say!",
                        "vi": "(mỉa mai) Tôi phải nói rằng bạn là một người giúp đỡ tuyệt vời!"
                    }
                ]
            },
            {
                "define": {
                    "en": "the person or people employed by somebody to clean their house, etc.",
                    "vi": "người hoặc những người được ai đó thuê để dọn dẹp nhà cửa của họ, v.v."
                },
                "examples": []
            },
            {
                "define": {
                    "en": "it is not possible to avoid doing something that may harm somebody in some way",
                    "vi": "không thể tránh làm điều gì đó có thể gây hại cho ai đó theo một cách nào đó"
                },
                "examples": [
                    {
                        "en": "There's no help for it. We shall have to call the police.",
                        "vi": "Không có trợ giúp cho nó. Chúng tôi sẽ phải gọi cảnh sát."
                    }
                ]
            }
        ]
    },
    {
        "id": "64d472d00d2f47c1b24c2ea8a2165c36",
        "word": "charity",
        "pos": "noun",
        "level": "a2",
        "phonetic": {
            "uk": "/ˈtʃærəti/",
            "us": "/ˈtʃærəti/"
        },
        "nearby": [
            {
                "word": "charitable",
                "pos": "adjective"
            },
            {
                "word": "charitably",
                "pos": "adverb"
            },
            {
                "word": "charity",
                "pos": "noun"
            },
            {
                "word": "the Charity Commission",
                "pos": ""
            },
            {
                "word": "charity shop",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an organization for helping people in need",
                    "vi": "một tổ chức giúp đỡ những người cần"
                },
                "examples": [
                    {
                        "en": "a registered charity",
                        "vi": "một tổ chức từ thiện đã đăng ký"
                    },
                    {
                        "en": "the UK's largest children's charity",
                        "vi": "tổ chức từ thiện dành cho trẻ em lớn nhất của Vương quốc Anh"
                    },
                    {
                        "en": "Many charities sent money to help the victims of the famine.",
                        "vi": "Nhiều tổ chức từ thiện đã gửi tiền để giúp đỡ các nạn nhân của nạn đói."
                    },
                    {
                        "en": "The concert will raise money for local charities.",
                        "vi": "Buổi biểu diễn sẽ gây quỹ cho các tổ chức từ thiện địa phương."
                    },
                    {
                        "en": "My parents always supported charities.",
                        "vi": "Cha mẹ tôi luôn ủng hộ các tổ chức từ thiện."
                    },
                    {
                        "en": "charity for somebody/something a charity for homeless people",
                        "vi": "từ thiện cho ai đó / cái gì đó một tổ chức từ thiện cho những người vô gia cư"
                    },
                    {
                        "en": "a charity for earthquake relief in Pakistan",
                        "vi": "một tổ chức từ thiện cứu trợ động đất ở Pakistan"
                    }
                ]
            },
            {
                "define": {
                    "en": "organizations for helping people in need, considered as a group; the money, food, help, etc. that they give",
                    "vi": "tổ chức giúp đỡ những người gặp khó khăn, được coi như một nhóm; tiền, thức ăn, sự giúp đỡ, v.v. mà họ cho"
                },
                "examples": [
                    {
                        "en": "Most of the runners in the London Marathon are raising money for charity.",
                        "vi": "Hầu hết các vận động viên chạy trong cuộc thi Marathon London đều đang gây quỹ từ thiện."
                    },
                    {
                        "en": "A portion of the proceeds was donated to charity.",
                        "vi": "Một phần số tiền thu được đã được quyên góp cho tổ chức từ thiện."
                    },
                    {
                        "en": "Do you give much to charity?",
                        "vi": "Bạn có làm từ thiện nhiều không?"
                    },
                    {
                        "en": "a charity event (= organized to get money for charity)",
                        "vi": "một sự kiện từ thiện (= được tổ chức để lấy tiền từ thiện)"
                    },
                    {
                        "en": "All the profits go to charity.",
                        "vi": "Tất cả lợi nhuận đều được dùng để làm từ thiện."
                    },
                    {
                        "en": "a charity auction/concert/football match",
                        "vi": "đấu giá từ thiện / buổi hòa nhạc / trận đấu bóng đá"
                    },
                    {
                        "en": "She does a lot of charity work.",
                        "vi": "Cô ấy làm rất nhiều việc từ thiện."
                    },
                    {
                        "en": "to live on/off charity (= to live on money which other people give you because you are poor)",
                        "vi": "để sống nhờ / ngoài quỹ từ thiện (= sống bằng tiền mà người khác cho bạn vì bạn nghèo)"
                    }
                ]
            },
            {
                "define": {
                    "en": "kind behaviour and sympathy towards other people, especially when you are judging them",
                    "vi": "cư xử tử tế và thông cảm với người khác, đặc biệt là khi bạn đang phán xét họ"
                },
                "examples": [
                    {
                        "en": "Her article showed no charity towards her former friends.",
                        "vi": "Bài báo của cô ấy cho thấy không có tổ chức từ thiện nào đối với những người bạn cũ của cô ấy."
                    },
                    {
                        "en": "He replied patiently, with more charity than I deserved.",
                        "vi": "Anh ấy kiên nhẫn trả lời, với lòng từ thiện nhiều hơn những gì tôi đáng được nhận."
                    }
                ]
            },
            {
                "define": {
                    "en": "you should help and care for your own family, etc. before you start helping other people",
                    "vi": "bạn nên giúp đỡ và quan tâm đến gia đình của mình, v.v. trước khi bắt đầu giúp đỡ người khác"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "2d73a149c4aa403c823b946a7f86c181",
        "word": "assist",
        "pos": "verb",
        "level": "b1",
        "phonetic": {
            "uk": "/əˈsɪst/",
            "us": "/əˈsɪst/"
        },
        "nearby": [
            {
                "word": "assimilate",
                "pos": "verb"
            },
            {
                "word": "assimilation",
                "pos": "noun"
            },
            {
                "word": "assist",
                "pos": "verb"
            },
            {
                "word": "assist",
                "pos": "noun"
            },
            {
                "word": "assistance",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to help somebody to do something",
                    "vi": "để giúp ai đó làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "Anyone willing to assist can contact this number.",
                        "vi": "Bất cứ ai sẵn sàng hỗ trợ có thể liên hệ với số này."
                    },
                    {
                        "en": "assist in/with something He assisted in the development of the business strategy.",
                        "vi": "hỗ trợ trong / với một cái gì đó Ông đã hỗ trợ trong việc phát triển chiến lược kinh doanh."
                    },
                    {
                        "en": "We are looking for people who would be willing to assist in the group's work.",
                        "vi": "Chúng tôi đang tìm kiếm những người sẵn sàng hỗ trợ công việc của nhóm."
                    },
                    {
                        "en": "assist somebody We'll do all we can to assist you.",
                        "vi": "hỗ trợ ai đó Chúng tôi sẽ làm tất cả những gì có thể để hỗ trợ bạn."
                    },
                    {
                        "en": "They will be ably assisted by our remarkable staff.",
                        "vi": "Họ sẽ được hỗ trợ tích cực bởi đội ngũ nhân viên đáng chú ý của chúng tôi."
                    },
                    {
                        "en": "The play was directed by Mike Johnson, assisted by Sharon Gale.",
                        "vi": "Vở kịch do Mike Johnson đạo diễn, Sharon Gale hỗ trợ."
                    },
                    {
                        "en": "His task is to advise and assist his colleagues.",
                        "vi": "Nhiệm vụ của anh ấy là cố vấn và trợ giúp các đồng nghiệp của mình."
                    },
                    {
                        "en": "assist somebody in doing something We will assist you in finding somewhere to live.",
                        "vi": "hỗ trợ ai đó làm điều gì đó Chúng tôi sẽ hỗ trợ bạn tìm một nơi nào đó để sinh sống."
                    },
                    {
                        "en": "assist somebody in/with something Two men are assisting the police with their enquiries (= are being questioned by the police).",
                        "vi": "hỗ trợ ai đó trong / với việc gì Hai người đàn ông đang hỗ trợ cảnh sát giải đáp thắc mắc của họ (= đang bị cảnh sát thẩm vấn)."
                    },
                    {
                        "en": "The driver has been assisting police with their investigation.",
                        "vi": "Người lái xe đã hỗ trợ cảnh sát trong cuộc điều tra của họ."
                    },
                    {
                        "en": "assist somebody to do something a course to assist adults to return to the labour market",
                        "vi": "hỗ trợ ai đó làm điều gì đó một khóa học để hỗ trợ người lớn quay trở lại thị trường lao động"
                    }
                ]
            },
            {
                "define": {
                    "en": "to help something to happen more easily",
                    "vi": "để giúp một điều gì đó xảy ra dễ dàng hơn"
                },
                "examples": [
                    {
                        "en": "activities that will assist the decision-making process",
                        "vi": "các hoạt động sẽ hỗ trợ quá trình ra quyết định"
                    }
                ]
            }
        ]
    },
    {
        "id": "a5c25676727f4b4b9edab58cf6d3c8e7",
        "word": "donate",
        "pos": "verb",
        "level": "b1",
        "phonetic": {
            "uk": "/dəʊˈneɪt/",
            "us": "/ˈdəʊneɪt/"
        },
        "nearby": [
            {
                "word": "Donald",
                "pos": ""
            },
            {
                "word": "Donald Duck",
                "pos": ""
            },
            {
                "word": "donate",
                "pos": "verb"
            },
            {
                "word": "donation",
                "pos": "noun"
            },
            {
                "word": "Doncaster",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to give money, food, clothes, etc. to somebody/something, especially a charity",
                    "vi": "để cho tiền, thức ăn, quần áo, v.v. cho ai đó / cái gì đó, đặc biệt là một tổ chức từ thiện"
                },
                "examples": [
                    {
                        "en": "donate something to somebody/something He donated thousands of pounds to charity.",
                        "vi": "tặng một cái gì đó cho ai đó / cái gì đó Anh ấy đã quyên góp hàng nghìn bảng Anh cho tổ chức từ thiện."
                    },
                    {
                        "en": "donate to somebody/something People wishing to donate to the appeal can buy a poppy from today until November 11.",
                        "vi": "quyên góp cho ai đó / thứ gì đó Những người muốn quyên góp cho lời kêu gọi có thể mua một cây thuốc phiện từ hôm nay cho đến ngày 11 tháng 11."
                    },
                    {
                        "en": "donate something The organization suggests ways to help besides donating money.",
                        "vi": "quyên góp một cái gì đó Tổ chức gợi ý những cách để giúp đỡ bên cạnh việc quyên góp tiền."
                    },
                    {
                        "en": "an auction of pieces donated by the artists themselves",
                        "vi": "một cuộc đấu giá các tác phẩm do chính các nghệ sĩ quyên góp"
                    },
                    {
                        "en": "donate something for something I would like to thank our sponsors, The Woodworks, for donating the prizes for this competition.",
                        "vi": "tặng một cái gì đó cho một cái gì đó Tôi muốn cảm ơn nhà tài trợ của chúng tôi, The Woodworks, đã tặng các giải thưởng cho cuộc thi này."
                    }
                ]
            },
            {
                "define": {
                    "en": "to allow doctors to remove blood, a body organ, etc. in order to help somebody who needs it",
                    "vi": "để cho phép các bác sĩ loại bỏ máu, một cơ quan trong cơ thể, v.v. để giúp những người cần nó"
                },
                "examples": [
                    {
                        "en": "donate something I've been donating blood regularly for a few years now.",
                        "vi": "hiến một thứ gì đó Tôi đã hiến máu thường xuyên trong vài năm nay."
                    },
                    {
                        "en": "to donate organs/sperm/eggs",
                        "vi": "hiến tạng / tinh trùng / trứng"
                    },
                    {
                        "en": "All donated blood is tested for HIV and other infections.",
                        "vi": "Tất cả máu hiến tặng đều được xét nghiệm HIV và các bệnh nhiễm trùng khác."
                    },
                    {
                        "en": "donate something to somebody He donated a kidney to his mother.",
                        "vi": "tặng một cái gì đó cho ai đó Anh ấy đã hiến tặng một quả thận cho mẹ anh ấy."
                    }
                ]
            }
        ]
    },
    {
        "id": "6bbb185432834b83a2e8755cedb9e451",
        "word": "helper",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˈhelpə(r)/",
            "us": "/ˈhelpər/"
        },
        "nearby": [
            {
                "word": "help",
                "pos": "exclamation"
            },
            {
                "word": "help desk",
                "pos": "noun"
            },
            {
                "word": "helper",
                "pos": "noun"
            },
            {
                "word": "helpful",
                "pos": "adjective"
            },
            {
                "word": "helpfully",
                "pos": "adverb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who helps somebody to do something",
                    "vi": "một người giúp ai đó làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "He recruited a band of willing helpers.",
                        "vi": "Anh ấy đã tuyển dụng một nhóm những người sẵn sàng giúp đỡ."
                    },
                    {
                        "en": "We rely on volunteer helpers.",
                        "vi": "Chúng tôi dựa vào những người trợ giúp tình nguyện."
                    }
                ]
            }
        ]
    },
    {
        "id": "92691a14ff3e4ac190bdc05e4e5b92d2",
        "word": "raise",
        "pos": "verb",
        "level": "b1",
        "phonetic": {
            "uk": "/reɪz/",
            "us": "/reɪz/"
        },
        "nearby": [
            {
                "word": "rainwear",
                "pos": "noun"
            },
            {
                "word": "rainy",
                "pos": "adjective"
            },
            {
                "word": "raise",
                "pos": "verb"
            },
            {
                "word": "raise",
                "pos": "noun"
            },
            {
                "word": "raised",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to lift or move something to a higher level",
                    "vi": "để nâng hoặc di chuyển thứ gì đó lên cấp độ cao hơn"
                },
                "examples": [
                    {
                        "en": "She raised the gun and fired.",
                        "vi": "Cô ta nâng súng lên và bắn."
                    },
                    {
                        "en": "He raised a hand in greeting.",
                        "vi": "Anh giơ tay chào."
                    },
                    {
                        "en": "She raised her eyes from her work.",
                        "vi": "Cô ấy ngước mắt lên khỏi công việc của mình."
                    },
                    {
                        "en": "raise something up He slowly raised his head up.",
                        "vi": "nâng một cái gì đó lên Anh ta từ từ ngẩng đầu lên."
                    }
                ]
            },
            {
                "define": {
                    "en": "to move somebody/something/yourself to a standing, sitting or vertical position",
                    "vi": "để di chuyển ai đó / cái gì đó / bạn đến vị trí đứng, ngồi hoặc thẳng đứng"
                },
                "examples": [
                    {
                        "en": "raise somebody/something/yourself + adv./prep. Somehow we managed to raise her to her feet.",
                        "vi": "nâng cao ai đó / cái gì đó / chính mình + adv./prep. Bằng cách nào đó, chúng tôi đã cố gắng nâng cô ấy lên được."
                    },
                    {
                        "en": "He raised himself up on one elbow.",
                        "vi": "Anh ta nâng người lên bằng một khuỷu tay."
                    },
                    {
                        "en": "raise somebody/something The security man raised the barrier for me.",
                        "vi": "nâng cao ai đó / cái gì đó Người đàn ông an ninh đã nâng rào cản cho tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to increase the amount or level of something",
                    "vi": "để tăng số lượng hoặc mức độ của một cái gì đó"
                },
                "examples": [
                    {
                        "en": "raise something to raise prices/taxes",
                        "vi": "tăng một cái gì đó để tăng giá / thuế"
                    },
                    {
                        "en": "We need to raise public awareness of the issue.",
                        "vi": "Chúng ta cần nâng cao nhận thức của cộng đồng về vấn đề này."
                    },
                    {
                        "en": "How can we raise standards in schools?",
                        "vi": "Làm thế nào chúng ta có thể nâng cao tiêu chuẩn trong trường học?"
                    },
                    {
                        "en": "raise something to something They raised their offer to $500.",
                        "vi": "nâng một cái gì đó lên một cái gì đó Họ đã tăng đề nghị của họ lên 500 đô la."
                    },
                    {
                        "en": "Don't tell her about the job until you know for sure—we don't want to raise her hopes (= make her hope too much).",
                        "vi": "Đừng nói với cô ấy về công việc cho đến khi bạn biết chắc chắn — chúng tôi không muốn cô ấy nuôi hy vọng (= khiến cô ấy hy vọng quá nhiều)."
                    },
                    {
                        "en": "I've never heard him even raise his voice (= speak louder because he was angry).",
                        "vi": "Tôi chưa bao giờ nghe thấy anh ấy thậm chí lớn giọng (= nói to hơn vì anh ấy tức giận)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to bring or collect money or people together; to manage to get or form something",
                    "vi": "để mang hoặc thu tiền hoặc người với nhau; quản lý để có được hoặc hình thành một cái gì đó"
                },
                "examples": [
                    {
                        "en": "We are raising money for charity.",
                        "vi": "Chúng tôi đang gây quỹ từ thiện."
                    },
                    {
                        "en": "They are holding a quiz to help raise funds for the club.",
                        "vi": "Họ đang tổ chức một cuộc kiểm tra để giúp gây quỹ cho câu lạc bộ."
                    },
                    {
                        "en": "The event raised over £30 000 for cancer research.",
                        "vi": "Sự kiện đã quyên góp được hơn £ 30 000 cho nghiên cứu ung thư."
                    },
                    {
                        "en": "He set about raising an army.",
                        "vi": "Anh ta bắt đầu xây dựng một đội quân."
                    }
                ]
            },
            {
                "define": {
                    "en": "to mention something for people to discuss or somebody to deal with",
                    "vi": "đề cập đến điều gì đó để mọi người thảo luận hoặc ai đó giải quyết"
                },
                "examples": [
                    {
                        "en": "The book raises many important questions.",
                        "vi": "Cuốn sách đặt ra nhiều câu hỏi quan trọng."
                    },
                    {
                        "en": "I'm glad you raised the subject of money.",
                        "vi": "Tôi rất vui vì bạn đã nêu ra chủ đề về tiền bạc."
                    },
                    {
                        "en": "I have raised this issue with the environmental health office.",
                        "vi": "Tôi đã nêu vấn đề này với văn phòng sức khỏe môi trường."
                    },
                    {
                        "en": "Local residents have raised concerns about late-night noise.",
                        "vi": "Cư dân địa phương đã đưa ra lo ngại về tiếng ồn vào đêm khuya."
                    },
                    {
                        "en": "You raise some interesting points.",
                        "vi": "Bạn nêu ra một số điểm thú vị."
                    }
                ]
            },
            {
                "define": {
                    "en": "to cause or produce a feeling or reaction",
                    "vi": "để gây ra hoặc tạo ra cảm giác hoặc phản ứng"
                },
                "examples": [
                    {
                        "en": "to raise doubts in people’s minds",
                        "vi": "làm dấy lên những nghi ngờ trong tâm trí mọi người"
                    },
                    {
                        "en": "The plans for the new development have raised angry protests from local residents.",
                        "vi": "Các kế hoạch cho sự phát triển mới đã làm dấy lên phản đối giận dữ từ cư dân địa phương."
                    },
                    {
                        "en": "It wasn't an easy audience but he raised a laugh with his joke.",
                        "vi": "Đó không phải là một khán giả dễ tính nhưng anh ấy đã gây cười với trò đùa của mình."
                    },
                    {
                        "en": "It had been a difficult day but she managed to raise a smile.",
                        "vi": "Đó là một ngày khó khăn nhưng cô ấy đã cố gắng nở một nụ cười."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make something happen or appear",
                    "vi": "để làm cho một cái gì đó xảy ra hoặc xuất hiện"
                },
                "examples": [
                    {
                        "en": "She raised the alarm when he failed to return home.",
                        "vi": "Cô đã báo động khi anh không thể trở về nhà."
                    },
                    {
                        "en": "The horses' hooves raised a cloud of dust.",
                        "vi": "Vó ngựa nổi lên một đám bụi."
                    }
                ]
            },
            {
                "define": {
                    "en": "to care for a child or young animal until it is able to take care of itself",
                    "vi": "chăm sóc trẻ em hoặc động vật non cho đến khi nó có thể tự chăm sóc"
                },
                "examples": [
                    {
                        "en": "raise somebody/something She raised five children on her own.",
                        "vi": "raise somebody / something Cô ấy đã nuôi năm đứa con một mình."
                    },
                    {
                        "en": "They were both raised in the South.",
                        "vi": "Cả hai đều lớn lên ở miền Nam."
                    },
                    {
                        "en": "kids raised on a diet of hamburgers",
                        "vi": "những đứa trẻ được nuôi dưỡng bằng chế độ ăn kiêng bánh mì kẹp thịt"
                    },
                    {
                        "en": "raise somebody/something (as) something They raised her (as) a Catholic.",
                        "vi": "raise somebody / something (as) something Họ đã nuôi dạy cô ấy (với tư cách) là một người Công giáo."
                    },
                    {
                        "en": "I was born and raised a city boy.",
                        "vi": "Tôi sinh ra và lớn lên là một cậu bé thành phố."
                    }
                ]
            },
            {
                "define": {
                    "en": "to breed (= keep and produce young from) particular farm animals; to grow particular crops",
                    "vi": "để lai tạo (= giữ và sản xuất con non từ) các động vật nông trại cụ thể; để trồng các loại cây trồng cụ thể"
                },
                "examples": [
                    {
                        "en": "Farmers cleared the land in order to raise cattle.",
                        "vi": "Nông dân khai khẩn đất đai để chăn nuôi gia súc."
                    },
                    {
                        "en": "They raise corn, soybeans and alfalfa on 460 acres.",
                        "vi": "Họ trồng ngô, đậu nành và cỏ linh lăng trên 460 mẫu Anh."
                    }
                ]
            },
            {
                "define": {
                    "en": "to end the limits on somebody/something",
                    "vi": "để chấm dứt giới hạn đối với ai đó / điều gì đó"
                },
                "examples": [
                    {
                        "en": "to raise a blockade/ban/siege",
                        "vi": "để tăng cường phong tỏa / cấm / bao vây"
                    }
                ]
            },
            {
                "define": {
                    "en": "to contact somebody and speak to them by radio or phone",
                    "vi": "liên hệ với ai đó và nói chuyện với họ qua radio hoặc điện thoại"
                },
                "examples": [
                    {
                        "en": "We managed to raise him on his mobile phone.",
                        "vi": "Chúng tôi đã cố gắng nâng cao anh ấy trên điện thoại di động của anh ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody who has died come to life again",
                    "vi": "để làm cho ai đó đã chết sống lại"
                },
                "examples": [
                    {
                        "en": "Christians believe that God raised Jesus from the dead.",
                        "vi": "Cơ đốc nhân tin rằng Đức Chúa Trời đã làm cho Chúa Giê-su sống lại từ cõi chết."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make a higher bet than another player in a card game",
                    "vi": "đặt cược cao hơn người chơi khác trong trò chơi bài"
                },
                "examples": [
                    {
                        "en": "I'll raise you another hundred dollars.",
                        "vi": "Tôi sẽ tăng cho bạn một trăm đô la nữa."
                    }
                ]
            },
            {
                "define": {
                    "en": "to multiply an amount by itself a particular number of times",
                    "vi": "nhân một số tiền với chính nó một số lần cụ thể"
                },
                "examples": [
                    {
                        "en": "3 raised to the power of 3 is 27 (= 3 × 3 × 3).",
                        "vi": "3 được nâng lên lũy thừa của 3 là 27 (= 3 × 3 × 3)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to build something",
                    "vi": "để xây dựng một cái gì đó"
                },
                "examples": [
                    {
                        "en": "Our priority will be to raise a boundary wall and prevent trespassing.",
                        "vi": "Ưu tiên của chúng tôi sẽ là xây dựng một bức tường ranh giới và ngăn chặn sự xâm phạm."
                    }
                ]
            },
            {
                "define": {
                    "en": "to create a document such as an invoice or a petition",
                    "vi": "để tạo một tài liệu như hóa đơn hoặc đơn thỉnh cầu"
                },
                "examples": [
                    {
                        "en": "They have been raising a petition against the war.",
                        "vi": "Họ đã đưa ra một bản kiến nghị phản đối chiến tranh."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody angry",
                    "vi": "làm cho ai đó tức giận"
                },
                "examples": [
                    {
                        "en": "Her controversial article is bound to raise hackles.",
                        "vi": "Bài báo gây tranh cãi của cô ấy chắc chắn sẽ làm dấy lên những lời dị nghị."
                    }
                ]
            },
            {
                "define": {
                    "en": "to do nothing to help somebody",
                    "vi": "không làm gì để giúp ai đó"
                },
                "examples": [
                    {
                        "en": "The children never lift a finger to help around the house.",
                        "vi": "Những đứa trẻ không bao giờ nhấc một ngón tay để giúp đỡ xung quanh nhà."
                    }
                ]
            },
            {
                "define": {
                    "en": "to do nothing to help somebody",
                    "vi": "không làm gì để giúp ai đó"
                },
                "examples": [
                    {
                        "en": "The children never raised a finger to help around the house.",
                        "vi": "Những đứa trẻ không bao giờ giơ một ngón tay lên để giúp đỡ xung quanh nhà."
                    }
                ]
            },
            {
                "define": {
                    "en": "to increase the level of something, especially your demands or the risks in a situation",
                    "vi": "để nâng cao mức độ của điều gì đó, đặc biệt là nhu cầu của bạn hoặc rủi ro trong một tình huống"
                },
                "examples": [
                    {
                        "en": "This year tournament organizers have upped the ante by offering record prize money for the top two teams.",
                        "vi": "Các nhà tổ chức giải đấu năm nay đã nâng cao thành tích bằng cách đưa ra số tiền thưởng kỷ lục cho hai đội đứng đầu."
                    }
                ]
            },
            {
                "define": {
                    "en": "to set a new, higher standard of quality or performance",
                    "vi": "để thiết lập một tiêu chuẩn mới, cao hơn về chất lượng hoặc hiệu suất"
                },
                "examples": [
                    {
                        "en": "The factory has raised the bar on productivity, food safety and quality.",
                        "vi": "Nhà máy đã nâng cao năng suất, chất lượng vệ sinh an toàn thực phẩm."
                    },
                    {
                        "en": "This latest computer game raises the bar for interface design.",
                        "vi": "Trò chơi máy tính mới nhất này nâng cao tiêu chuẩn cho thiết kế giao diện."
                    },
                    {
                        "en": "The awards go to people who have truly raised the bar.",
                        "vi": "Giải thưởng sẽ được trao cho những người đã thực sự nâng tầm."
                    },
                    {
                        "en": "Perhaps the new admission requirements raised the bar too high.",
                        "vi": "Có lẽ các yêu cầu nhập học mới đã nâng mức quá cao."
                    }
                ]
            },
            {
                "define": {
                    "en": "to show that you think something is bad or are surprised by something",
                    "vi": "để thể hiện rằng bạn nghĩ điều gì đó tồi tệ hoặc đang ngạc nhiên trước điều gì đó"
                },
                "examples": [
                    {
                        "en": "Eyebrows were raised when he arrived without his wife.",
                        "vi": "Lông mày nhướng lên khi anh đến mà không có vợ đi cùng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to hold up your glass and wish somebody happiness, good luck, etc. before you drink",
                    "vi": "nâng ly và chúc ai đó hạnh phúc, may mắn, v.v. trước khi uống"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to hit or threaten to hit somebody",
                    "vi": "đánh hoặc đe dọa đánh ai đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to protest angrily, especially in a way that causes trouble for somebody",
                    "vi": "phản đối một cách giận dữ, đặc biệt là theo cách gây rắc rối cho ai đó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to produce or make somebody produce a lot of noise in a building, for example by shouting or cheering",
                    "vi": "để tạo ra hoặc khiến ai đó tạo ra nhiều tiếng ồn trong một tòa nhà, chẳng hạn như bằng cách la hét hoặc cổ vũ"
                },
                "examples": [
                    {
                        "en": "Their cheers raised the roof.",
                        "vi": "Tiếng hò reo của họ đã nâng nóc nhà."
                    }
                ]
            },
            {
                "define": {
                    "en": "to expect more/less from a situation",
                    "vi": "mong đợi nhiều hơn / ít hơn từ một tình huống"
                },
                "examples": [
                    {
                        "en": "If they can’t afford such a big house, they’ll just have to lower their sights a little.",
                        "vi": "Nếu họ không đủ khả năng mua một ngôi nhà lớn như vậy, họ sẽ phải hạ thấp tầm nhìn của mình một chút."
                    },
                    {
                        "en": "After failing to get into university, he lowered his sights and got a job in a shop.",
                        "vi": "Sau khi không vào được đại học, anh ta hạ thấp tầm nhìn và kiếm việc làm trong một cửa hàng."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make somebody feel more cheerful or brave",
                    "vi": "để làm cho ai đó cảm thấy vui vẻ hoặc dũng cảm hơn"
                },
                "examples": [
                    {
                        "en": "The sunny weather raised my spirits a little.",
                        "vi": "Thời tiết nắng đẹp làm tinh thần tôi phấn chấn hơn một chút."
                    }
                ]
            },
            {
                "define": {
                    "en": "to increase/decrease the amount of excitement, emotion, etc. in a situation",
                    "vi": "để tăng / giảm mức độ phấn khích, cảm xúc, v.v. trong một tình huống"
                },
                "examples": [
                    {
                        "en": "His angry refusal to agree raised the temperature of the meeting.",
                        "vi": "Việc anh giận dữ từ chối đồng ý đã làm tăng nhiệt độ của cuộc họp."
                    },
                    {
                        "en": "The government tried to lower the political temperature by agreeing to some of the demands.",
                        "vi": "Chính phủ đã cố gắng hạ nhiệt độ chính trị bằng cách đồng ý với một số yêu cầu."
                    }
                ]
            },
            {
                "define": {
                    "en": "if something unpleasant rears its head or rears its ugly head, it appears or happens",
                    "vi": "nếu một cái gì đó khó chịu dựng lên đầu nó hoặc che cái đầu xấu xí của nó, nó sẽ xuất hiện hoặc xảy ra"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "b5fcc76aa12d433086c2491e98738383",
        "word": "volunteer",
        "pos": "noun",
        "level": "b1",
        "phonetic": {
            "uk": "/ˌvɒlənˈtɪə(r)/",
            "us": "/ˌvɑːlənˈtɪr/"
        },
        "nearby": [
            {
                "word": "voluntary school",
                "pos": "noun"
            },
            {
                "word": "Voluntary Service Overseas",
                "pos": "noun"
            },
            {
                "word": "volunteer",
                "pos": "noun"
            },
            {
                "word": "volunteer",
                "pos": "verb"
            },
            {
                "word": "volunteerism",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who does a job without being paid for it",
                    "vi": "một người làm một công việc mà không được trả tiền cho nó"
                },
                "examples": [
                    {
                        "en": "Schools need volunteers to help children to read.",
                        "vi": "Các trường học cần tình nguyện viên để giúp trẻ em đọc."
                    },
                    {
                        "en": "She does volunteer work at an orphanage.",
                        "vi": "Cô ấy làm công việc tình nguyện tại một trại trẻ mồ côi."
                    },
                    {
                        "en": "volunteer for/with something She was a volunteer for the Red Cross before training as a nurse.",
                        "vi": "tình nguyện cho / với điều gì đó Cô ấy từng là tình nguyện viên cho Hội Chữ thập đỏ trước khi được đào tạo thành y tá."
                    },
                    {
                        "en": "Volunteers from various organizations are working to save the lives of the earthquake victims.",
                        "vi": "Các tình nguyện viên từ nhiều tổ chức khác nhau đang làm việc để cứu sống những nạn nhân của trận động đất."
                    },
                    {
                        "en": "a volunteer firefighter",
                        "vi": "một lính cứu hỏa tình nguyện"
                    },
                    {
                        "en": "volunteer helpers/carers",
                        "vi": "người giúp đỡ / chăm sóc tình nguyện"
                    },
                    {
                        "en": "The Centre is run by a group of dedicated volunteers.",
                        "vi": "Trung tâm được điều hành bởi một nhóm tình nguyện viên tận tụy."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who offers to do something without being forced to do it",
                    "vi": "một người đề nghị làm điều gì đó mà không bị buộc phải làm điều đó"
                },
                "examples": [
                    {
                        "en": "Are there any volunteers to help clear up?",
                        "vi": "Có tình nguyện viên nào giúp giải tỏa không?"
                    },
                    {
                        "en": "For my next trick, I'll need a volunteer from the audience.",
                        "vi": "Đối với thủ thuật tiếp theo của tôi, tôi sẽ cần một tình nguyện viên từ khán giả."
                    },
                    {
                        "en": "The company is looking for volunteers to take part in a trial.",
                        "vi": "Công ty đang tìm kiếm người tình nguyện tham gia thử việc."
                    },
                    {
                        "en": "Hundreds of volunteers have come forward to offer their help.",
                        "vi": "Hàng trăm tình nguyện viên đã đến để đề nghị sự giúp đỡ của họ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who chooses to join the armed forces without being forced to join",
                    "vi": "một người chọn tham gia lực lượng vũ trang mà không bị buộc phải tham gia"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "f6f710309cd7496298b0491eea93d358",
        "word": "volunteer",
        "pos": "verb",
        "level": "b1",
        "phonetic": {
            "uk": "/ˌvɒlənˈtɪə(r)/",
            "us": "/ˌvɑːlənˈtɪr/"
        },
        "nearby": [
            {
                "word": "Voluntary Service Overseas",
                "pos": "noun"
            },
            {
                "word": "volunteer",
                "pos": "noun"
            },
            {
                "word": "volunteer",
                "pos": "verb"
            },
            {
                "word": "volunteerism",
                "pos": "noun"
            },
            {
                "word": "the Volunteer Reserve Forces",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to offer to do something without being forced to do it or without getting paid for it",
                    "vi": "đề nghị làm điều gì đó mà không bị ép buộc hoặc không được trả tiền cho việc đó"
                },
                "examples": [
                    {
                        "en": "He has been volunteering for 11 years now.",
                        "vi": "Anh ấy đã làm tình nguyện viên được 11 năm rồi."
                    },
                    {
                        "en": "volunteer to do something Jill volunteered to organize a petition.",
                        "vi": "tình nguyện làm điều gì đó Jill tình nguyện tổ chức một cuộc thỉnh nguyện."
                    },
                    {
                        "en": "I volunteered to help clean up the beach.",
                        "vi": "Tôi tình nguyện giúp làm sạch bãi biển."
                    },
                    {
                        "en": "volunteer for something Several staff members volunteered for early retirement.",
                        "vi": "tình nguyện cho một cái gì đó Một số nhân viên đã tình nguyện nghỉ hưu sớm."
                    },
                    {
                        "en": "volunteer as something He volunteered as a translator for Spanish-speaking patients.",
                        "vi": "tình nguyện như một điều gì đó Anh ấy tình nguyện làm phiên dịch cho những bệnh nhân nói tiếng Tây Ban Nha."
                    },
                    {
                        "en": "volunteer something Workers volunteer their time, as no funds are available to pay professional staff.",
                        "vi": "tình nguyện điều gì đó Người lao động tình nguyện dành thời gian của họ, vì không có ngân quỹ để trả cho nhân viên chuyên nghiệp."
                    },
                    {
                        "en": "volunteer something as something He volunteered his services as a driver.",
                        "vi": "tình nguyện một cái gì đó như một cái gì đó Anh ấy tình nguyện phục vụ của mình với tư cách là một người lái xe."
                    },
                    {
                        "en": "volunteer something for something She has been volunteering her computer skills for the foundation.",
                        "vi": "tình nguyện một cái gì đó cho một cái gì đó Cô ấy đã và đang tình nguyện xây dựng kỹ năng máy tính của mình cho tổ chức."
                    }
                ]
            },
            {
                "define": {
                    "en": "to suggest something or tell somebody something without being asked",
                    "vi": "đề xuất điều gì đó hoặc nói với ai đó điều gì đó mà không bị hỏi"
                },
                "examples": [
                    {
                        "en": "volunteer something to volunteer advice",
                        "vi": "tình nguyện một cái gì đó để tình nguyện lời khuyên"
                    },
                    {
                        "en": "Nobody asked her, and she didn't volunteer any information.",
                        "vi": "Không ai hỏi cô ấy, và cô ấy không tình nguyện bất kỳ thông tin nào."
                    },
                    {
                        "en": "+ speech ‘I could lend you some books,’ he volunteered.",
                        "vi": "bài phát biểu 'Tôi có thể cho bạn mượn một số cuốn sách,' anh ấy tình nguyện."
                    }
                ]
            },
            {
                "define": {
                    "en": "to join the army, etc. without being forced to",
                    "vi": "gia nhập quân đội, v.v. mà không bị buộc phải"
                },
                "examples": [
                    {
                        "en": "He wasn't conscripted. He volunteered.",
                        "vi": "Anh ấy không phải nhập ngũ. Anh ấy tình nguyện."
                    },
                    {
                        "en": "volunteer for something to volunteer for military service",
                        "vi": "tình nguyện vì điều gì đó tình nguyện đi nghĩa vụ quân sự"
                    },
                    {
                        "en": "I volunteered for service in the Air Force.",
                        "vi": "Tôi tình nguyện phục vụ trong Lực lượng Không quân."
                    },
                    {
                        "en": "volunteer to do something More than a hundred thousand Irish men and women volunteered to serve in the British armed forces during World War II.",
                        "vi": "tình nguyện làm điều gì đó Hơn một trăm nghìn đàn ông và phụ nữ Ireland đã tình nguyện phục vụ trong các lực lượng vũ trang của Anh trong Thế chiến thứ hai."
                    }
                ]
            },
            {
                "define": {
                    "en": "to suggest somebody for a job or an activity, even though they may not want to do it",
                    "vi": "đề xuất ai đó cho một công việc hoặc một hoạt động, mặc dù họ có thể không muốn làm điều đó"
                },
                "examples": [
                    {
                        "en": "volunteer somebody (for/as something) They volunteered me for the job of interpreter.",
                        "vi": "tình nguyện ai đó (cho / như một cái gì đó) Họ tình nguyện cho tôi làm công việc thông dịch viên."
                    },
                    {
                        "en": "volunteer somebody to do something Her dad had volunteered her to help put away the equipment.",
                        "vi": "tình nguyện ai đó làm điều gì đó Bố cô ấy đã tình nguyện giúp cô ấy cất thiết bị."
                    }
                ]
            }
        ]
    },
    {
        "id": "2dab5fd9642b4397a52a72bede4cbbb8",
        "word": "aid",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/eɪd/",
            "us": "/eɪd/"
        },
        "nearby": [
            {
                "word": "ahoy",
                "pos": "exclamation"
            },
            {
                "word": "AI",
                "pos": "abbreviation"
            },
            {
                "word": "aid",
                "pos": "noun"
            },
            {
                "word": "aid",
                "pos": "verb"
            },
            {
                "word": "Aidan",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "money, food, etc. that is sent to help countries in difficult situations",
                    "vi": "tiền, thực phẩm, v.v. được gửi để giúp đỡ các quốc gia có hoàn cảnh khó khăn"
                },
                "examples": [
                    {
                        "en": "humanitarian/food/medical aid",
                        "vi": "viện trợ nhân đạo / thực phẩm / y tế"
                    },
                    {
                        "en": "An extra £10 million in foreign aid has been provided for victims of the earthquake.",
                        "vi": "Thêm 10 triệu bảng viện trợ nước ngoài đã được cung cấp cho các nạn nhân của trận động đất."
                    },
                    {
                        "en": "international aid workers",
                        "vi": "nhân viên cứu trợ quốc tế"
                    }
                ]
            },
            {
                "define": {
                    "en": "help that you need, especially to perform a particular task",
                    "vi": "trợ giúp mà bạn cần, đặc biệt là để thực hiện một nhiệm vụ cụ thể"
                },
                "examples": [
                    {
                        "en": "with the aid of somebody/something She walks with the aid of a stick.",
                        "vi": "với sự trợ giúp của ai đó / cái gì đó Cô ấy bước đi với sự trợ giúp của một cây gậy."
                    },
                    {
                        "en": "without the aid of somebody/something This job would be impossible without the aid of a computer.",
                        "vi": "Nếu không có sự trợ giúp của ai đó / cái gì đó Công việc này sẽ không thể thực hiện được nếu không có sự hỗ trợ của máy tính."
                    },
                    {
                        "en": "(formal) One of the staff saw he was in difficulty and came to his aid (= helped him).",
                        "vi": "(trang trọng) Một trong những nhân viên thấy anh ấy đang gặp khó khăn và đã đến giúp đỡ anh ấy (= đã giúp anh ấy)."
                    }
                ]
            },
            {
                "define": {
                    "en": "an object, a machine, etc. that you use to help you do something",
                    "vi": "một đối tượng, một máy móc, v.v. mà bạn sử dụng để giúp bạn làm điều gì đó"
                },
                "examples": [
                    {
                        "en": "Photos make useful teaching aids.",
                        "vi": "Hình ảnh làm đồ dùng dạy học hữu ích."
                    }
                ]
            },
            {
                "define": {
                    "en": "in order to help something/somebody",
                    "vi": "để giúp một cái gì đó / ai đó"
                },
                "examples": [
                    {
                        "en": "collecting money in aid of charity",
                        "vi": "thu tiền ủng hộ từ thiện"
                    }
                ]
            },
            {
                "define": {
                    "en": "used to ask why something is happening",
                    "vi": "được sử dụng để hỏi tại sao một cái gì đó đang xảy ra"
                },
                "examples": [
                    {
                        "en": "What's all this crying in aid of?",
                        "vi": "Tất cả những gì đang khóc để hỗ trợ?"
                    }
                ]
            }
        ]
    },
    {
        "id": "a0b0c5821e9c46a6a3efe789d4d83b40",
        "word": "appeal",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/əˈpiːl/",
            "us": "/əˈpiːl/"
        },
        "nearby": [
            {
                "word": "apparition",
                "pos": "noun"
            },
            {
                "word": "app drawer",
                "pos": "noun"
            },
            {
                "word": "appeal",
                "pos": "noun"
            },
            {
                "word": "appeal",
                "pos": "verb"
            },
            {
                "word": "appeal court",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a deeply felt request for money, help or information that is needed immediately, especially one made by a charity or by the police",
                    "vi": "một yêu cầu sâu sắc về tiền bạc, sự giúp đỡ hoặc thông tin cần thiết ngay lập tức, đặc biệt là yêu cầu do tổ chức từ thiện hoặc cảnh sát đưa ra"
                },
                "examples": [
                    {
                        "en": "appeal for something to launch a TV appeal for donations to the charity",
                        "vi": "kêu gọi điều gì đó để khởi động một cuộc kêu gọi trên TV để quyên góp cho tổ chức từ thiện"
                    },
                    {
                        "en": "appeal to somebody He made an emotional appeal to voters.",
                        "vi": "hấp dẫn ai đó Anh ấy đã thực hiện một lời kêu gọi đầy cảm xúc đối với các cử tri."
                    },
                    {
                        "en": "appeal to somebody for something Police are making a fresh appeal to the public for any information that may help them.",
                        "vi": "kêu gọi ai đó về điều gì đó Cảnh sát đang đưa ra lời kêu gọi mới cho công chúng về bất kỳ thông tin nào có thể giúp ích cho họ."
                    },
                    {
                        "en": "appeal to somebody to do something The police made an appeal to the public to remain calm.",
                        "vi": "kêu gọi ai đó làm điều gì đó Cảnh sát đã kêu gọi mọi người giữ bình tĩnh."
                    },
                    {
                        "en": "There was a look of silent appeal on his face.",
                        "vi": "Trên khuôn mặt anh ta có một vẻ hấp dẫn thầm lặng."
                    }
                ]
            },
            {
                "define": {
                    "en": "a quality that makes somebody/something attractive or interesting",
                    "vi": "phẩm chất khiến ai đó / điều gì đó hấp dẫn hoặc thú vị"
                },
                "examples": [
                    {
                        "en": "mass/wide/popular/broad/universal appeal",
                        "vi": "sự kêu gọi đại chúng / rộng rãi / phổ biến / rộng rãi / phổ quát"
                    },
                    {
                        "en": "The Beatles have never really lost their appeal.",
                        "vi": "The Beatles chưa bao giờ thực sự mất đi sức hấp dẫn của mình."
                    },
                    {
                        "en": "The prospect of living in a city holds little appeal for me.",
                        "vi": "Triển vọng sống ở một thành phố không có gì hấp dẫn đối với tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a formal request to a court or to somebody in authority for a judgement or a decision to be changed",
                    "vi": "yêu cầu chính thức tới tòa án hoặc người có thẩm quyền về việc thay đổi bản án hoặc quyết định"
                },
                "examples": [
                    {
                        "en": "(British English) to lodge an appeal",
                        "vi": "(Anh Anh) để nộp đơn kháng cáo"
                    },
                    {
                        "en": "(North American English) to file an appeal",
                        "vi": "(Tiếng Anh Bắc Mỹ) để nộp đơn kháng cáo"
                    },
                    {
                        "en": "(British English) an appeal court/judge",
                        "vi": "(Tiếng Anh Anh) một tòa án / thẩm phán phúc thẩm"
                    },
                    {
                        "en": "(North American English) an appeals court/judge",
                        "vi": "(Tiếng Anh Bắc Mỹ) tòa phúc thẩm / thẩm phán"
                    },
                    {
                        "en": "appeal against something They have launched appeals against their convictions.",
                        "vi": "kháng cáo chống lại điều gì đó Họ đã đưa ra kháng cáo chống lại sự kết tội của họ."
                    },
                    {
                        "en": "an appeal against the 3-match ban",
                        "vi": "kháng cáo lệnh cấm thi đấu 3 trận"
                    },
                    {
                        "en": "an appeal against a decision/sentence/order/ruling",
                        "vi": "kháng cáo chống lại một quyết định / bản án / lệnh / phán quyết"
                    },
                    {
                        "en": "The court dismissed his appeal against the verdict.",
                        "vi": "Tòa án đã bác bỏ đơn kháng cáo của ông đối với bản án."
                    },
                    {
                        "en": "on appeal The case was upheld on appeal.",
                        "vi": "khi kháng cáo Vụ án được giữ nguyên khi kháng cáo."
                    },
                    {
                        "en": "The verdict was later overturned on appeal.",
                        "vi": "Bản án sau đó đã được lật lại khi kháng cáo."
                    },
                    {
                        "en": "You have the right of appeal to the Constitutional Court.",
                        "vi": "Bạn có quyền kháng cáo lên Tòa án Hiến pháp."
                    }
                ]
            },
            {
                "define": {
                    "en": "an indirect suggestion that any good, fair or reasonable person would act in a particular way",
                    "vi": "một gợi ý gián tiếp rằng bất kỳ người nào tốt, công bằng hoặc hợp lý sẽ hành động theo một cách cụ thể"
                },
                "examples": [
                    {
                        "en": "I relied on an appeal to his finer feelings.",
                        "vi": "Tôi dựa vào sự hấp dẫn đối với tình cảm tốt đẹp hơn của anh ấy."
                    },
                    {
                        "en": "an appeal to reason",
                        "vi": "một lời kêu gọi lý do"
                    }
                ]
            }
        ]
    },
    {
        "id": "cd3a02a88fdf4830b1afe6dedbda2a9d",
        "word": "appeal",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/əˈpiːl/",
            "us": "/əˈpiːl/"
        },
        "nearby": [
            {
                "word": "app drawer",
                "pos": "noun"
            },
            {
                "word": "appeal",
                "pos": "noun"
            },
            {
                "word": "appeal",
                "pos": "verb"
            },
            {
                "word": "appeal court",
                "pos": "noun"
            },
            {
                "word": "appealing",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to make a deeply felt request, especially for something that is needed immediately",
                    "vi": "để đưa ra một yêu cầu sâu sắc, đặc biệt là đối với một cái gì đó cần thiết ngay lập tức"
                },
                "examples": [
                    {
                        "en": "I am appealing (= asking for money) on behalf of the famine victims.",
                        "vi": "Tôi đang kêu gọi (= xin tiền) thay mặt cho những nạn nhân của nạn đói."
                    },
                    {
                        "en": "appeal for something Community leaders appealed for calm (= urged people to remain calm).",
                        "vi": "kêu gọi điều gì đó Các nhà lãnh đạo cộng đồng đã kêu gọi bình tĩnh (= kêu gọi mọi người giữ bình tĩnh)."
                    },
                    {
                        "en": "appeal to somebody Appeal directly to the public, answer their questions.",
                        "vi": "kêu gọi ai đó Kháng cáo trực tiếp với công chúng, trả lời câu hỏi của họ."
                    },
                    {
                        "en": "appeal to somebody for something The government appealed to the British people for help.",
                        "vi": "kêu gọi ai đó vì điều gì đó Chính phủ kêu gọi người dân Anh giúp đỡ."
                    },
                    {
                        "en": "appeal for somebody to do something Police have appealed for witnesses to come forward.",
                        "vi": "kêu gọi ai đó làm điều gì đó Cảnh sát đã kêu gọi các nhân chứng đưa ra."
                    },
                    {
                        "en": "appeal to somebody to do something Organizers appealed to the crowd not to panic.",
                        "vi": "kêu gọi ai đó làm điều gì đó Ban tổ chức kêu gọi đám đông không hoảng sợ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to attract or interest somebody",
                    "vi": "để thu hút hoặc quan tâm ai đó"
                },
                "examples": [
                    {
                        "en": "The prospect of a long wait in the rain did not appeal.",
                        "vi": "Viễn cảnh chờ đợi lâu dưới mưa không hấp dẫn."
                    },
                    {
                        "en": "appeal to somebody The design has to appeal to all ages and social groups.",
                        "vi": "thu hút ai đó Thiết kế phải thu hút mọi lứa tuổi và mọi nhóm xã hội."
                    },
                    {
                        "en": "His movies appeal to a broad audience.",
                        "vi": "Phim của anh ấy thu hút nhiều khán giả."
                    },
                    {
                        "en": "The ad is designed to appeal to female voters.",
                        "vi": "Quảng cáo được thiết kế để thu hút các cử tri nữ."
                    }
                ]
            },
            {
                "define": {
                    "en": "to make a formal request to a court or to somebody in authority for a judgment or a decision to be changed",
                    "vi": "yêu cầu chính thức lên tòa án hoặc người có thẩm quyền về việc thay đổi phán quyết hoặc quyết định"
                },
                "examples": [
                    {
                        "en": "He said he would appeal after being found guilty on four counts of murder.",
                        "vi": "Anh ta nói rằng anh ta sẽ kháng cáo sau khi bị kết tội về bốn tội danh giết người."
                    },
                    {
                        "en": "appeal against something The company is appealing against the ruling.",
                        "vi": "kháng cáo điều gì đó Công ty đang kháng cáo chống lại phán quyết."
                    },
                    {
                        "en": "appeal to somebody/something against something He is seeking leave to appeal to the High Court against the decision.",
                        "vi": "khiếu nại ai đó / điều gì đó chống lại điều gì đó Anh ta đang xin nghỉ phép để kháng cáo lên Tòa án cấp cao chống lại quyết định."
                    },
                    {
                        "en": "appeal to somebody/something Permission to appeal to the House of Lords was refused.",
                        "vi": "khiếu nại với ai đó / điều gì đó Quyền khiếu nại với House of Lords đã bị từ chối."
                    }
                ]
            },
            {
                "define": {
                    "en": "to try to persuade somebody to do something by suggesting that it is a fair, reasonable or honest thing to do",
                    "vi": "cố gắng thuyết phục ai đó làm điều gì đó bằng cách gợi ý rằng đó là một việc công bằng, hợp lý hoặc trung thực để làm"
                },
                "examples": [
                    {
                        "en": "They needed to appeal to his sense of justice.",
                        "vi": "Họ cần phải kêu gọi ý thức công bằng của anh ta."
                    }
                ]
            }
        ]
    },
    {
        "id": "49dba6bddd3d40f3929dd34109251ebf",
        "word": "assistance",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/əˈsɪstəns/",
            "us": "/əˈsɪstəns/"
        },
        "nearby": [
            {
                "word": "assist",
                "pos": "verb"
            },
            {
                "word": "assist",
                "pos": "noun"
            },
            {
                "word": "assistance",
                "pos": "noun"
            },
            {
                "word": "assistance dog",
                "pos": "noun"
            },
            {
                "word": "assistant",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "help or support",
                    "vi": "giúp đỡ hoặc hỗ trợ"
                },
                "examples": [
                    {
                        "en": "technical/economic/military assistance",
                        "vi": "hỗ trợ kỹ thuật / kinh tế / quân sự"
                    },
                    {
                        "en": "financial assistance for people on low incomes",
                        "vi": "hỗ trợ tài chính cho những người có thu nhập thấp"
                    },
                    {
                        "en": "Can I be of any assistance?",
                        "vi": "Tôi có thể được giúp đỡ nào không?"
                    },
                    {
                        "en": "Despite his cries, no one came to his assistance.",
                        "vi": "Bất chấp tiếng kêu của anh ta, không ai đến giúp anh ta."
                    },
                    {
                        "en": "The other passengers went to her assistance.",
                        "vi": "Các hành khách khác đã đến hỗ trợ cô ấy."
                    },
                    {
                        "en": "with the assistance of somebody/something He can only walk with the assistance of crutches.",
                        "vi": "với sự hỗ trợ của ai đó / cái gì đó Anh ta chỉ có thể đi lại với sự hỗ trợ của nạng."
                    },
                    {
                        "en": "assistance with something She offered me practical assistance with my research.",
                        "vi": "hỗ trợ với một cái gì đó Cô ấy đề nghị tôi hỗ trợ thiết thực cho nghiên cứu của tôi."
                    },
                    {
                        "en": "assistance in doing something/to do something The company provides advice and assistance in finding work.",
                        "vi": "hỗ trợ làm điều gì đó / để làm điều gì đó Công ty cung cấp lời khuyên và hỗ trợ trong việc tìm kiếm việc làm."
                    }
                ]
            }
        ]
    },
    {
        "id": "73b98153c2364b6e97ffcb315efdbe5b",
        "word": "charity shop",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈtʃærəti ʃɒp/",
            "us": "/ˈtʃærəti ʃɑːp/"
        },
        "nearby": [
            {
                "word": "charity",
                "pos": "noun"
            },
            {
                "word": "the Charity Commission",
                "pos": ""
            },
            {
                "word": "charity shop",
                "pos": "noun"
            },
            {
                "word": "charlady",
                "pos": "noun"
            },
            {
                "word": "charlatan",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a shop that sells clothes and other goods given by people to raise money for a charity",
                    "vi": "cửa hàng bán quần áo và các mặt hàng khác do mọi người quyên góp để gây quỹ từ thiện"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "b04fc99f90e947d9bef6cd88cfeb2e02",
        "word": "collection",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/kəˈlekʃn/",
            "us": "/kəˈlekʃn/"
        },
        "nearby": [
            {
                "word": "collectable",
                "pos": "adjective"
            },
            {
                "word": "collected",
                "pos": "adjective"
            },
            {
                "word": "collection",
                "pos": "noun"
            },
            {
                "word": "collective",
                "pos": "adjective"
            },
            {
                "word": "collective",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a group of objects, often of the same sort, that have been collected",
                    "vi": "một nhóm các đối tượng, thường cùng loại, đã được thu thập"
                },
                "examples": [
                    {
                        "en": "He wanted to share his vast art collection with the world.",
                        "vi": "Anh muốn chia sẻ bộ sưu tập nghệ thuật khổng lồ của mình với thế giới."
                    },
                    {
                        "en": "a stamp/coin/record collection",
                        "vi": "một bộ sưu tập tem / xu / kỷ lục"
                    },
                    {
                        "en": "collection of something an extensive collection of war photographs",
                        "vi": "bộ sưu tập của một cái gì đó một bộ sưu tập phong phú các bức ảnh chiến tranh"
                    },
                    {
                        "en": "The painting comes from his private collection.",
                        "vi": "Bức tranh đến từ bộ sưu tập tư nhân của anh ấy."
                    }
                ]
            },
            {
                "define": {
                    "en": "a group of objects or people",
                    "vi": "một nhóm đồ vật hoặc người"
                },
                "examples": [
                    {
                        "en": "There was a collection of books and shoes on the floor.",
                        "vi": "Có một bộ sưu tập sách và giày dép trên sàn nhà."
                    },
                    {
                        "en": "There is always a strange collection of runners in the London Marathon.",
                        "vi": "Luôn luôn có một bộ sưu tập kỳ lạ của các vận động viên trong cuộc thi Marathon London."
                    }
                ]
            },
            {
                "define": {
                    "en": "an act of taking something away from a place; an act of bringing things together into one place",
                    "vi": "một hành động lấy một cái gì đó khỏi một nơi; một hành động mang mọi thứ lại với nhau vào một nơi"
                },
                "examples": [
                    {
                        "en": "The first stage in research is data collection.",
                        "vi": "Giai đoạn đầu tiên trong nghiên cứu là thu thập dữ liệu."
                    },
                    {
                        "en": "waste/rubbish/garbage/refuse collection",
                        "vi": "thu gom rác thải / rác thải / rác thải / rác thải"
                    },
                    {
                        "en": "The last collection from this postbox is at 5.15.",
                        "vi": "Bộ sưu tập cuối cùng từ hộp thư này là lúc 5 giờ 15."
                    },
                    {
                        "en": "Your suit will be ready for collection on Tuesday.",
                        "vi": "Bộ đồ của bạn sẽ sẵn sàng để thu vào thứ Ba."
                    }
                ]
            },
            {
                "define": {
                    "en": "a group of poems, stories or pieces of music published together as one book, etc.",
                    "vi": "một nhóm các bài thơ, câu chuyện hoặc bản nhạc được xuất bản cùng nhau thành một cuốn sách, v.v."
                },
                "examples": [
                    {
                        "en": "a collection of stories by women writers",
                        "vi": "một bộ sưu tập các câu chuyện của các nhà văn nữ"
                    },
                    {
                        "en": "a collection of favourite Christmas music",
                        "vi": "bộ sưu tập nhạc giáng sinh yêu thích"
                    }
                ]
            },
            {
                "define": {
                    "en": "an act of collecting money to help a charity or during a church service; the money collected",
                    "vi": "hành động quyên góp tiền để giúp đỡ một tổ chức từ thiện hoặc trong một buổi lễ nhà thờ; số tiền thu được"
                },
                "examples": [
                    {
                        "en": "a house-to-house collection for Cancer Research",
                        "vi": "một bộ sưu tập từng nhà cho Nghiên cứu Ung thư"
                    },
                    {
                        "en": "The total collection last week amounted to £250.",
                        "vi": "Tổng bộ sưu tập tuần trước lên tới 250 bảng Anh."
                    },
                    {
                        "en": "a collection box/bucket (= for people to put money in)",
                        "vi": "hộp / thùng thu gom (= để mọi người bỏ tiền vào)"
                    },
                    {
                        "en": "the church collection plate",
                        "vi": "đĩa sưu tập nhà thờ"
                    }
                ]
            },
            {
                "define": {
                    "en": "a range of new clothes or items for the home that are designed, made and offered for sale, often for a particular season",
                    "vi": "một loạt quần áo hoặc đồ dùng mới cho ngôi nhà được thiết kế, sản xuất và chào bán, thường cho một mùa cụ thể"
                },
                "examples": [
                    {
                        "en": "Armani’s stunning new autumn collection",
                        "vi": "Bộ sưu tập mùa thu mới tuyệt đẹp của Armani"
                    }
                ]
            }
        ]
    },
    {
        "id": "f7033a27227a445e999ed22017bd71e3",
        "word": "community service",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/kəˌmjuːnəti ˈsɜːvɪs/",
            "us": "/kəˌmjuːnəti ˈsɜːrvɪs/"
        },
        "nearby": [
            {
                "word": "community school",
                "pos": "noun"
            },
            {
                "word": "community sentence",
                "pos": "noun"
            },
            {
                "word": "community service",
                "pos": "noun"
            },
            {
                "word": "community spread",
                "pos": "noun"
            },
            {
                "word": "community theater",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "work helping people in the local community that somebody does without being paid, either because they want to, or because they have been ordered to by a court as a punishment",
                    "vi": "làm việc giúp đỡ mọi người trong cộng đồng địa phương mà ai đó làm mà không được trả tiền, vì họ muốn hoặc vì họ đã bị tòa án ra lệnh như một hình phạt"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "2b338817a6c740bca7fc87e1f5cc51f3",
        "word": "donation",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/dəʊˈneɪʃn/",
            "us": "/dəʊˈneɪʃn/"
        },
        "nearby": [
            {
                "word": "Donald Duck",
                "pos": ""
            },
            {
                "word": "donate",
                "pos": "verb"
            },
            {
                "word": "donation",
                "pos": "noun"
            },
            {
                "word": "Doncaster",
                "pos": ""
            },
            {
                "word": "doncha",
                "pos": "short form"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "something that is given to a person or an organization such as a charity, in order to help them; the act of giving something in this way",
                    "vi": "một cái gì đó được trao cho một người hoặc một tổ chức chẳng hạn như một tổ chức từ thiện, để giúp đỡ họ; hành động cho một cái gì đó theo cách này"
                },
                "examples": [
                    {
                        "en": "a generous/large/small donation",
                        "vi": "một khoản đóng góp hào phóng / lớn / nhỏ"
                    },
                    {
                        "en": "donation to somebody/something to make a donation to charity",
                        "vi": "quyên góp cho ai đó / cái gì đó để quyên góp cho tổ chức từ thiện"
                    },
                    {
                        "en": "donation (of…) a donation of £200/a £200 donation",
                        "vi": "quyên góp (trong số…) khoản đóng góp £ 200 / khoản đóng góp £ 200"
                    },
                    {
                        "en": "The work of the charity is funded by voluntary donations.",
                        "vi": "Công việc của tổ chức từ thiện được tài trợ bởi các khoản quyên góp tự nguyện."
                    },
                    {
                        "en": "The campaign has raised £200 000 through online donations.",
                        "vi": "Chiến dịch đã quyên góp được 200.000 bảng Anh thông qua quyên góp trực tuyến."
                    },
                    {
                        "en": "Leave your donations with the staff on reception any time during opening hours.",
                        "vi": "Để lại các khoản đóng góp của bạn với nhân viên lễ tân bất cứ lúc nào trong giờ mở cửa."
                    },
                    {
                        "en": "The project is funded by public donation.",
                        "vi": "Dự án được tài trợ bởi sự đóng góp của cộng đồng."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of allowing doctors to remove blood or a body organ in order to help somebody who needs it",
                    "vi": "hành động cho phép các bác sĩ loại bỏ máu hoặc một bộ phận cơ thể để giúp những người cần nó"
                },
                "examples": [
                    {
                        "en": "Organ donation has not kept pace with the demand for transplants.",
                        "vi": "Việc hiến tặng nội tạng vẫn chưa theo kịp với nhu cầu cấy ghép."
                    }
                ]
            }
        ]
    },
    {
        "id": "c58d2d6fec324ad8b72294d5d5cf90ae",
        "word": "foundation",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/faʊnˈdeɪʃn/",
            "us": "/faʊnˈdeɪʃn/"
        },
        "nearby": [
            {
                "word": "foul-up",
                "pos": "noun"
            },
            {
                "word": "found",
                "pos": "verb"
            },
            {
                "word": "foundation",
                "pos": "noun"
            },
            {
                "word": "foundation course",
                "pos": "noun"
            },
            {
                "word": "foundation stone",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a principle, an idea or a fact that something is based on and that it grows from",
                    "vi": "một nguyên tắc, một ý tưởng hoặc một thực tế mà một cái gì đó được dựa trên và nó phát triển từ"
                },
                "examples": [
                    {
                        "en": "Respect and friendship provide a solid foundation for marriage.",
                        "vi": "Sự tôn trọng và tình bạn là nền tảng vững chắc cho hôn nhân."
                    },
                    {
                        "en": "He laid the foundation of Japan's modern economy.",
                        "vi": "Ông là người đặt nền móng cho nền kinh tế hiện đại của Nhật Bản."
                    },
                    {
                        "en": "These stories have no foundation (= are not based on any facts).",
                        "vi": "Những câu chuyện này không có nền tảng (= không dựa trên bất kỳ sự kiện nào)."
                    },
                    {
                        "en": "without foundation The rumour is totally without foundation (= is not based on any facts).",
                        "vi": "không có cơ sở Tin đồn là hoàn toàn không có cơ sở (= không dựa trên bất kỳ sự kiện nào)."
                    }
                ]
            },
            {
                "define": {
                    "en": "an organization that is established to provide money for a particular purpose, for example for scientific research or charity",
                    "vi": "một tổ chức được thành lập để cung cấp tiền cho một mục đích cụ thể, chẳng hạn như nghiên cứu khoa học hoặc từ thiện"
                },
                "examples": [
                    {
                        "en": "The money will go to the San Francisco AIDS Foundation.",
                        "vi": "Số tiền sẽ được chuyển đến Quỹ Phòng chống AIDS San Francisco."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of starting a new institution or organization",
                    "vi": "hành động bắt đầu một thể chế hoặc tổ chức mới"
                },
                "examples": [
                    {
                        "en": "The organization has grown enormously since its foundation in 1955.",
                        "vi": "Tổ chức đã phát triển vượt bậc kể từ khi thành lập vào năm 1955."
                    },
                    {
                        "en": "She used the money to go towards the foundation of a special research group.",
                        "vi": "Cô đã sử dụng số tiền này để thành lập một nhóm nghiên cứu đặc biệt."
                    }
                ]
            },
            {
                "define": {
                    "en": "a layer of stone, concrete, etc. that forms the solid underground base of a building",
                    "vi": "một lớp đá, bê tông, v.v. tạo nên nền tảng vững chắc dưới lòng đất của một tòa nhà"
                },
                "examples": [
                    {
                        "en": "The builders are now beginning to lay the foundations of the new school.",
                        "vi": "Những người xây dựng hiện đang bắt đầu đặt nền móng của ngôi trường mới."
                    },
                    {
                        "en": "The explosion shook the foundations of the houses nearby.",
                        "vi": "Vụ nổ làm rung chuyển nền móng của những ngôi nhà gần đó."
                    }
                ]
            },
            {
                "define": {
                    "en": "a skin-coloured cream that is put on the face under other make-up",
                    "vi": "một loại kem có màu da được đặt trên khuôn mặt dưới lớp trang điểm khác"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to cause people to question their basic beliefs about something",
                    "vi": "khiến mọi người đặt câu hỏi về niềm tin cơ bản của họ về điều gì đó"
                },
                "examples": [
                    {
                        "en": "This issue has shaken the foundations of French politics.",
                        "vi": "Vấn đề này đã làm lung lay nền tảng của chính trị Pháp."
                    },
                    {
                        "en": "an event which rocked the foundations of British politics",
                        "vi": "một sự kiện làm rung chuyển nền chính trị của Anh"
                    },
                    {
                        "en": "The scandal rocked the legal establishment to its foundations.",
                        "vi": "Vụ bê bối đã làm rung chuyển cơ sở pháp lý về nền tảng của nó."
                    }
                ]
            }
        ]
    },
    {
        "id": "57457ab08fa24306a3a3aef36f2c2e7f",
        "word": "fund",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/fʌnd/",
            "us": "/fʌnd/"
        },
        "nearby": [
            {
                "word": "function word",
                "pos": "noun"
            },
            {
                "word": "functor",
                "pos": "noun"
            },
            {
                "word": "fund",
                "pos": "noun"
            },
            {
                "word": "fund",
                "pos": "verb"
            },
            {
                "word": "funda",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an amount of money that has been saved or has been made available for a particular purpose",
                    "vi": "một số tiền đã được tiết kiệm hoặc đã có sẵn cho một mục đích cụ thể"
                },
                "examples": [
                    {
                        "en": "a disaster relief fund",
                        "vi": "quỹ cứu trợ thiên tai"
                    },
                    {
                        "en": "the company’s pension fund",
                        "vi": "quỹ hưu trí của công ty"
                    },
                    {
                        "en": "the International Monetary Fund",
                        "vi": "Quỹ Tiền tệ Quốc tế"
                    },
                    {
                        "en": "in a fund There is currently over $200 000 in the fund.",
                        "vi": "trong quỹ Hiện có hơn 200 000 đô la trong quỹ."
                    }
                ]
            },
            {
                "define": {
                    "en": "money that is available to be spent",
                    "vi": "tiền có sẵn để chi tiêu"
                },
                "examples": [
                    {
                        "en": "government/federal funds",
                        "vi": "quỹ chính phủ / liên bang"
                    },
                    {
                        "en": "The hospital is trying to raise funds for a new kidney machine.",
                        "vi": "Bệnh viện đang cố gắng gây quỹ cho một máy thận mới."
                    },
                    {
                        "en": "to provide/use funds for something",
                        "vi": "để cung cấp / sử dụng tiền cho một thứ gì đó"
                    },
                    {
                        "en": "More funds should be allocated to housing.",
                        "vi": "Nhiều quỹ hơn nên được phân bổ cho nhà ở."
                    },
                    {
                        "en": "The project has been cancelled because of lack of funds.",
                        "vi": "Dự án đã bị hủy bỏ vì thiếu vốn."
                    },
                    {
                        "en": "I'm short of funds at the moment—can I pay you back next week?",
                        "vi": "Tôi đang thiếu tiền vào lúc này — tôi có thể trả lại tiền cho bạn vào tuần tới không?"
                    }
                ]
            },
            {
                "define": {
                    "en": "a company that manages money for people by investing it; the money managed by such a company",
                    "vi": "một công ty quản lý tiền cho mọi người bằng cách đầu tư nó; tiền được quản lý bởi một công ty như vậy"
                },
                "examples": [
                    {
                        "en": "Any extra money that James saves should go into a money market fund.",
                        "vi": "Bất kỳ khoản tiền nào mà James tiết kiệm được sẽ được chuyển vào quỹ thị trường tiền tệ."
                    },
                    {
                        "en": "She is a fund manager for an Asian bank.",
                        "vi": "Cô là giám đốc quỹ cho một ngân hàng châu Á."
                    }
                ]
            },
            {
                "define": {
                    "en": "an amount or a supply of something",
                    "vi": "một số lượng hoặc một nguồn cung cấp thứ gì đó"
                },
                "examples": [
                    {
                        "en": "a fund of knowledge",
                        "vi": "một quỹ kiến thức"
                    }
                ]
            }
        ]
    },
    {
        "id": "d5c1849b9d2a4225962f8eb210788610",
        "word": "fund",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/fʌnd/",
            "us": "/fʌnd/"
        },
        "nearby": [
            {
                "word": "functor",
                "pos": "noun"
            },
            {
                "word": "fund",
                "pos": "noun"
            },
            {
                "word": "fund",
                "pos": "verb"
            },
            {
                "word": "funda",
                "pos": "noun"
            },
            {
                "word": "fundamental",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to provide money for something, usually something official",
                    "vi": "để cung cấp tiền cho một cái gì đó, thường là cái gì đó chính thức"
                },
                "examples": [
                    {
                        "en": "Who is funding this research?",
                        "vi": "Ai đang tài trợ cho nghiên cứu này?"
                    },
                    {
                        "en": "to fund a project/study/scheme",
                        "vi": "tài trợ cho một dự án / nghiên cứu / chương trình"
                    },
                    {
                        "en": "It's a government-funded programme for young offenders.",
                        "vi": "Đó là một chương trình do chính phủ tài trợ dành cho những phạm nhân trẻ tuổi."
                    },
                    {
                        "en": "publicly funded healthcare",
                        "vi": "chăm sóc sức khỏe được tài trợ công khai"
                    },
                    {
                        "en": "a federally funded housing project",
                        "vi": "một dự án nhà ở do liên bang tài trợ"
                    },
                    {
                        "en": "The museum is privately funded.",
                        "vi": "Bảo tàng được tài trợ bởi tư nhân."
                    },
                    {
                        "en": "The festival is funded by a grant from the Arts Council.",
                        "vi": "Liên hoan được tài trợ bởi một khoản tài trợ từ Hội đồng Nghệ thuật."
                    },
                    {
                        "en": "It is important that these training placements are fully funded.",
                        "vi": "Điều quan trọng là các vị trí đào tạo này được tài trợ đầy đủ."
                    }
                ]
            }
        ]
    },
    {
        "id": "cb5ceead838040e5a7e6da1d5366e48d",
        "word": "funding",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈfʌndɪŋ/",
            "us": "/ˈfʌndɪŋ/"
        },
        "nearby": [
            {
                "word": "fundholding",
                "pos": "noun"
            },
            {
                "word": "fundi",
                "pos": "noun"
            },
            {
                "word": "funding",
                "pos": "noun"
            },
            {
                "word": "fund manager",
                "pos": "noun"
            },
            {
                "word": "fundraise",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "money for a particular purpose; the act of providing money for such a purpose",
                    "vi": "tiền cho một mục đích cụ thể; hành động cung cấp tiền cho một mục đích như vậy"
                },
                "examples": [
                    {
                        "en": "federal/state funding",
                        "vi": "tài trợ liên bang / tiểu bang"
                    },
                    {
                        "en": "funding for something There have been large cuts in government funding for scientific research.",
                        "vi": "tài trợ cho một cái gì đó Đã có sự cắt giảm lớn trong tài trợ của chính phủ cho nghiên cứu khoa học."
                    },
                    {
                        "en": "Alex originally struggled to secure funding for the project.",
                        "vi": "Alex ban đầu phải vật lộn để đảm bảo nguồn vốn cho dự án."
                    },
                    {
                        "en": "to receive/get/obtain funding for something",
                        "vi": "để nhận / nhận / có được tài trợ cho một cái gì đó"
                    },
                    {
                        "en": "to provide/allocate funding for something",
                        "vi": "cung cấp / phân bổ tài trợ cho một cái gì đó"
                    },
                    {
                        "en": "to withdraw/cut funding for something",
                        "vi": "rút / cắt tài trợ cho một thứ gì đó"
                    }
                ]
            }
        ]
    },
    {
        "id": "67124c575a87412e88cf9e1ed0af226e",
        "word": "relief",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/rɪˈliːf/",
            "us": "/rɪˈliːf/"
        },
        "nearby": [
            {
                "word": "reliant",
                "pos": "adjective"
            },
            {
                "word": "relic",
                "pos": "noun"
            },
            {
                "word": "relief",
                "pos": "noun"
            },
            {
                "word": "relief map",
                "pos": "noun"
            },
            {
                "word": "relief pitcher",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the feeling of happiness that you have when something unpleasant stops or does not happen",
                    "vi": "cảm giác hạnh phúc mà bạn có khi điều gì đó khó chịu dừng lại hoặc không xảy ra"
                },
                "examples": [
                    {
                        "en": "I felt a huge sense of relief when I heard they were all OK.",
                        "vi": "Tôi cảm thấy nhẹ nhõm vô cùng khi nghe tin rằng tất cả đều ổn."
                    },
                    {
                        "en": "We all breathed a sigh of relief when he left.",
                        "vi": "Tất cả chúng tôi đều thở phào nhẹ nhõm khi anh ấy ra đi."
                    },
                    {
                        "en": "Much to my relief the car was not damaged.",
                        "vi": "Tôi rất nhẹ nhõm khi chiếc xe không bị hư hại."
                    },
                    {
                        "en": "News of their safety came as a great relief.",
                        "vi": "Tin tức về sự an toàn của họ đến như một sự cứu trợ lớn."
                    },
                    {
                        "en": "She sighed with relief.",
                        "vi": "Cô thở phào nhẹ nhõm."
                    },
                    {
                        "en": "He smiled in relief as he saw them both.",
                        "vi": "Anh mỉm cười nhẹ nhõm khi nhìn thấy cả hai."
                    },
                    {
                        "en": "She had gone through hell and there was no relief in sight for her.",
                        "vi": "Cô ấy đã trải qua địa ngục và không có sự nhẹ nhõm nào cho cô ấy."
                    },
                    {
                        "en": "relief to somebody This was a great relief to him.",
                        "vi": "nhẹ nhõm cho ai đó Đây là một sự nhẹ nhõm tuyệt vời đối với anh ấy."
                    },
                    {
                        "en": "It was a relief to be able to talk to someone about it.",
                        "vi": "Thật nhẹ nhõm khi có thể nói chuyện với ai đó về điều đó."
                    },
                    {
                        "en": "It was a relief to her to realize that she was not the only one with this problem.",
                        "vi": "Cô cảm thấy nhẹ nhõm khi nhận ra rằng mình không phải là người duy nhất gặp vấn đề này."
                    },
                    {
                        "en": "relief that… His mother spoke of her relief that he was now safely home.",
                        "vi": "nhẹ nhõm rằng… Mẹ anh ấy nói về sự nhẹ nhõm của bà rằng giờ đây anh ấy đã về nhà an toàn."
                    },
                    {
                        "en": "It is actually a relief that it's finally happened.",
                        "vi": "Nó thực sự là một sự nhẹ nhõm khi nó cuối cùng đã xảy ra."
                    },
                    {
                        "en": "relief at something She expressed relief at the outcome of the investigation.",
                        "vi": "nhẹ nhõm về điều gì đó Cô ấy bày tỏ sự nhẹ nhõm trước kết quả của cuộc điều tra."
                    },
                    {
                        "en": "relief at doing something He described his relief at securing his freedom.",
                        "vi": "nhẹ nhõm khi làm điều gì đó."
                    },
                    {
                        "en": "What a relief!",
                        "vi": "Thật là nhẹ nhõm!"
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of removing or reducing pain, worry, etc.",
                    "vi": "hành động loại bỏ hoặc giảm bớt đau đớn, lo lắng, v.v."
                },
                "examples": [
                    {
                        "en": "modern methods of pain relief",
                        "vi": "phương pháp giảm đau hiện đại"
                    },
                    {
                        "en": "relief of something the relief of symptoms/suffering/poverty/pain",
                        "vi": "giảm nhẹ điều gì đó giảm các triệu chứng / đau khổ / nghèo đói / đau đớn"
                    },
                    {
                        "en": "relief from something The drugs only provided temporary relief from the pain.",
                        "vi": "Thuốc chỉ giúp giảm đau tạm thời."
                    },
                    {
                        "en": "All the tables in the shade were occupied by people seeking relief from the heat.",
                        "vi": "Tất cả các bàn trong bóng râm đều có người tìm cách giải tỏa cái nóng."
                    },
                    {
                        "en": "Massage can bring some relief from tension.",
                        "vi": "Mát-xa có thể giúp giảm căng thẳng."
                    }
                ]
            },
            {
                "define": {
                    "en": "food, money, medicine, etc. that is given to help people in places where there has been a war or natural disaster",
                    "vi": "thực phẩm, tiền bạc, thuốc men, v.v. được trao để giúp đỡ đồng bào ở những nơi đã xảy ra chiến tranh, thiên tai"
                },
                "examples": [
                    {
                        "en": "disaster relief",
                        "vi": "cứu trợ thiên tai"
                    },
                    {
                        "en": "relief efforts/operations",
                        "vi": "nỗ lực / hoạt động cứu trợ"
                    },
                    {
                        "en": "relief organizations/supplies/work",
                        "vi": "tổ chức cứu trợ / vật tư / công việc"
                    },
                    {
                        "en": "We raised £5 000 for famine relief.",
                        "vi": "Chúng tôi đã quyên góp được £ 5 000 để cứu trợ nạn đói."
                    },
                    {
                        "en": "One relief agency worker described the situation as ‘catastrophic’.",
                        "vi": "Một nhân viên của cơ quan cứu trợ mô tả tình hình là 'thảm khốc'."
                    }
                ]
            },
            {
                "define": {
                    "en": "financial help given by the government to people who need it",
                    "vi": "trợ giúp tài chính của chính phủ cho những người cần nó"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a reduction in the amount of tax you have to pay",
                    "vi": "giảm số thuế bạn phải trả"
                },
                "examples": [
                    {
                        "en": "relief on mortgage interest payments",
                        "vi": "giảm nhẹ thanh toán lãi suất thế chấp"
                    }
                ]
            },
            {
                "define": {
                    "en": "something that is interesting or fun that replaces something boring, difficult or unpleasant for a short period of time",
                    "vi": "thứ gì đó thú vị hoặc vui vẻ thay thế thứ gì đó nhàm chán, khó khăn hoặc khó chịu trong một khoảng thời gian ngắn"
                },
                "examples": [
                    {
                        "en": "a few moments of light relief in an otherwise dull performance",
                        "vi": "một vài khoảnh khắc nhẹ nhõm trong một màn trình diễn buồn tẻ"
                    },
                    {
                        "en": "There was little comic relief in his speech.",
                        "vi": "Có một chút nhẹ nhõm hài hước trong bài phát biểu của anh ấy."
                    },
                    {
                        "en": "relief from something The calm of the countryside came as a welcome relief from the hustle and bustle of city life.",
                        "vi": "nhẹ nhõm từ một cái gì đó Sự bình lặng của vùng nông thôn đến như một sự chào đón nhẹ nhõm khỏi cuộc sống hối hả và nhộn nhịp của thành phố."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person or group of people that replaces another when they have finished working for the day or when they are sick",
                    "vi": "một người hoặc một nhóm người thay thế người khác khi họ đã hoàn thành công việc trong ngày hoặc khi họ bị ốm"
                },
                "examples": [
                    {
                        "en": "The next crew relief comes on duty at 9 o'clock.",
                        "vi": "Phi hành đoàn tiếp theo cứu trợ đến làm nhiệm vụ lúc 9 giờ."
                    },
                    {
                        "en": "We have a pool of relief drivers available to us.",
                        "vi": "Chúng tôi có một nhóm các trình điều khiển cứu trợ có sẵn cho chúng tôi."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of freeing a town, etc. from an enemy army that has surrounded it",
                    "vi": "hành động giải phóng một thị trấn, v.v. khỏi quân địch đã bao vây nó"
                },
                "examples": [
                    {
                        "en": "the relief of Mafeking",
                        "vi": "sự nhẹ nhõm của Mafeking"
                    }
                ]
            },
            {
                "define": {
                    "en": "a way of decorating wood, stone, etc. by cutting designs into the surface of it so that some parts stick out more than others; a design that is made in this way",
                    "vi": "một cách trang trí gỗ, đá, vv bằng cách cắt các thiết kế trên bề mặt của nó để một số bộ phận nhô ra nhiều hơn những bộ phận khác; một thiết kế được thực hiện theo cách này"
                },
                "examples": [
                    {
                        "en": "The column was decorated in high relief (= with designs that stick out a lot) with scenes from Greek mythology.",
                        "vi": "Cột được trang trí rất nổi (= với các thiết kế nhô ra nhiều) với các cảnh trong thần thoại Hy Lạp."
                    },
                    {
                        "en": "The bronze doors are covered with sculpted reliefs.",
                        "vi": "Các cánh cửa bằng đồng được bao phủ bởi các bức phù điêu điêu khắc."
                    }
                ]
            },
            {
                "define": {
                    "en": "the effect of colours, light, etc. that makes an object easier to notice than others around it",
                    "vi": "hiệu ứng của màu sắc, ánh sáng, v.v. làm cho một vật thể dễ nhận thấy hơn những vật thể khác xung quanh nó"
                },
                "examples": [
                    {
                        "en": "The snow-capped mountain stood out in sharp relief against the blue sky.",
                        "vi": "Ngọn núi phủ tuyết trắng xóa nổi bật trên nền trời xanh."
                    }
                ]
            },
            {
                "define": {
                    "en": "the quality of a particular situation, problem, etc. that makes it easier to notice than before",
                    "vi": "chất lượng của một tình huống, vấn đề cụ thể, v.v. khiến bạn dễ dàng nhận thấy hơn trước đây"
                },
                "examples": [
                    {
                        "en": "Their differences have been thrown into sharp relief by the present crisis.",
                        "vi": "Sự khác biệt của họ đã được giải tỏa rõ rệt bởi cuộc khủng hoảng hiện tại."
                    },
                    {
                        "en": "The proximity of the wealthy suburb to the squatter camp throws the plight of the squatters into even sharper relief.",
                        "vi": "Sự gần gũi của vùng ngoại ô giàu có với trại người bỏ xác khiến hoàn cảnh của những người ngồi xổm càng trở nên nhẹ nhõm hơn."
                    }
                ]
            }
        ]
    },
    {
        "id": "1736b5ef305d4bb4a36bdf280acfbe2f",
        "word": "shelter",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈʃeltə(r)/",
            "us": "/ˈʃeltər/"
        },
        "nearby": [
            {
                "word": "shell-shocked",
                "pos": "adjective"
            },
            {
                "word": "shell suit",
                "pos": "noun"
            },
            {
                "word": "shelter",
                "pos": "noun"
            },
            {
                "word": "shelter",
                "pos": "verb"
            },
            {
                "word": "Shelter",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the fact of having a place to live or stay, considered as a basic human need",
                    "vi": "thực tế là có một nơi để ở hoặc ở, được coi là nhu cầu cơ bản của con người"
                },
                "examples": [
                    {
                        "en": "Human beings need food, clothing and shelter.",
                        "vi": "Con người cần thức ăn, quần áo và nơi ở."
                    },
                    {
                        "en": "without shelter In developing countries, more than 640 million are without shelter.",
                        "vi": "không có nơi trú ẩn Tại các nước đang phát triển, hơn 640 triệu người không có nơi ở."
                    }
                ]
            },
            {
                "define": {
                    "en": "protection from rain, danger, or attack",
                    "vi": "bảo vệ khỏi mưa, nguy hiểm hoặc tấn công"
                },
                "examples": [
                    {
                        "en": "shelter from something to take shelter from the storm",
                        "vi": "trú ẩn khỏi một cái gì đó để trú ẩn khỏi cơn bão"
                    },
                    {
                        "en": "People were desperately seeking shelter from the gunfire.",
                        "vi": "Mọi người đang tuyệt vọng tìm nơi trú ẩn khỏi tiếng súng."
                    },
                    {
                        "en": "The sand dunes provided shelter from the wind.",
                        "vi": "Các cồn cát là nơi trú ẩn của gió."
                    },
                    {
                        "en": "shelter of something The fox was running for the shelter of the trees.",
                        "vi": "nơi trú ẩn của một cái gì đó Con cáo đang chạy tìm nơi trú ẩn của những cái cây."
                    }
                ]
            },
            {
                "define": {
                    "en": "a structure built to give protection, especially from the weather or from attack",
                    "vi": "một cấu trúc được xây dựng để bảo vệ, đặc biệt là khỏi thời tiết hoặc khỏi sự tấn công"
                },
                "examples": [
                    {
                        "en": "They built a rough shelter from old pieces of wood.",
                        "vi": "Họ xây dựng một nơi trú ẩn thô sơ từ những mảnh gỗ cũ."
                    },
                    {
                        "en": "He helped construct temporary shelters in 10 villages before the rains came.",
                        "vi": "Ông đã giúp xây dựng những nơi trú ẩn tạm thời ở 10 ngôi làng trước khi mưa đến."
                    },
                    {
                        "en": "an air-raid shelter",
                        "vi": "một nơi trú ẩn của cuộc không kích"
                    },
                    {
                        "en": "a bomb shelter",
                        "vi": "một hầm trú bom"
                    },
                    {
                        "en": "Pupils have been sent home and schools have been turned into emergency shelters.",
                        "vi": "Học sinh đã được gửi về nhà và trường học đã được biến thành nơi trú ẩn khẩn cấp."
                    },
                    {
                        "en": "shelter for somebody/something a shelter for cattle",
                        "vi": "nơi trú ẩn cho ai đó / cái gì đó là nơi trú ẩn cho gia súc"
                    }
                ]
            },
            {
                "define": {
                    "en": "a building, usually owned by a charity, that provides a place to stay for people without a home, or protection for people or animals who have been badly treated",
                    "vi": "một tòa nhà, thường thuộc sở hữu của một tổ chức từ thiện, cung cấp nơi ở cho những người không có nhà ở hoặc bảo vệ những người hoặc động vật bị đối xử tệ"
                },
                "examples": [
                    {
                        "en": "a night shelter for the homeless",
                        "vi": "nơi trú ẩn ban đêm cho người vô gia cư"
                    },
                    {
                        "en": "an animal shelter",
                        "vi": "một nơi trú ẩn động vật"
                    }
                ]
            }
        ]
    },
    {
        "id": "40bedee1a79b4297977e77e6a126dcfa",
        "word": "sponsor",
        "pos": "verb",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈspɒnsə(r)/",
            "us": "/ˈspɑːnsər/"
        },
        "nearby": [
            {
                "word": "sponginess",
                "pos": "noun"
            },
            {
                "word": "spongy",
                "pos": "adjective"
            },
            {
                "word": "sponsor",
                "pos": "verb"
            },
            {
                "word": "sponsor",
                "pos": "noun"
            },
            {
                "word": "sponsorship",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to pay the costs of a particular event, programme, etc. as a way of advertising",
                    "vi": "để thanh toán chi phí của một sự kiện, chương trình cụ thể, v.v. như một cách quảng cáo"
                },
                "examples": [
                    {
                        "en": "Sports events are no longer sponsored by the tobacco industry.",
                        "vi": "Các sự kiện thể thao không còn được tài trợ bởi ngành công nghiệp thuốc lá."
                    },
                    {
                        "en": "The magazine sponsors an essay competition open to anyone anywhere.",
                        "vi": "Tạp chí tài trợ cho một cuộc thi viết luận dành cho bất kỳ ai ở bất cứ đâu."
                    },
                    {
                        "en": "The World Bank has sponsored several conferences on open government and freedom of information.",
                        "vi": "Ngân hàng Thế giới đã tài trợ cho một số hội nghị về chính phủ mở và tự do thông tin."
                    },
                    {
                        "en": "We would like to thank the local businesses who kindly sponsored prizes for the raffle.",
                        "vi": "Chúng tôi xin cảm ơn các doanh nghiệp địa phương đã vui lòng tài trợ giải thưởng cho xổ số."
                    }
                ]
            },
            {
                "define": {
                    "en": "to agree to give somebody money for a charity if they complete a particular task",
                    "vi": "đồng ý cho ai đó tiền làm từ thiện nếu họ hoàn thành một nhiệm vụ cụ thể"
                },
                "examples": [
                    {
                        "en": "sponsor somebody They got their granny and aunts and other people to sponsor them.",
                        "vi": "tài trợ cho ai đó Họ có bà và dì của họ và những người khác tài trợ cho họ."
                    },
                    {
                        "en": "sponsor somebody for something Will you sponsor me for a charity walk I'm doing?",
                        "vi": "tài trợ cho ai đó vì điều gì đó Bạn sẽ tài trợ cho tôi cho chuyến đi bộ từ thiện mà tôi đang làm chứ?"
                    },
                    {
                        "en": "sponsor somebody to do something He appealed for people to sponsor him to cycle from Land's End to John O'Groats.",
                        "vi": "tài trợ cho ai đó làm điều gì đó Anh ta kêu gọi mọi người tài trợ cho anh ta để đạp xe từ Land's End đến John O'Groats."
                    },
                    {
                        "en": "sponsored + noun a sponsored walk/swim",
                        "vi": "tài trợ + danh từ đi bộ / bơi lội được tài trợ"
                    }
                ]
            },
            {
                "define": {
                    "en": "to support somebody by paying for their training or education",
                    "vi": "để hỗ trợ ai đó bằng cách trả tiền cho việc đào tạo hoặc giáo dục của họ"
                },
                "examples": [
                    {
                        "en": "sponsor somebody The corporation is sponsoring several athletes and teams here in the US.",
                        "vi": "tài trợ cho ai đó Công ty đang tài trợ cho một số vận động viên và đội ở Mỹ."
                    },
                    {
                        "en": "sponsor somebody through something She found a company to sponsor her through college.",
                        "vi": "tài trợ cho ai đó thông qua một cái gì đó Cô ấy đã tìm thấy một công ty để tài trợ cho cô ấy thông qua đại học."
                    },
                    {
                        "en": "The trust only has a limited amount of funds to sponsor students.",
                        "vi": "Quỹ tín thác chỉ có một số tiền hạn chế để tài trợ cho sinh viên."
                    }
                ]
            },
            {
                "define": {
                    "en": "to provide money for a particular activity",
                    "vi": "để cung cấp tiền cho một hoạt động cụ thể"
                },
                "examples": [
                    {
                        "en": "The group has been accused of sponsoring terrorism.",
                        "vi": "Nhóm này đã bị cáo buộc tài trợ khủng bố."
                    }
                ]
            },
            {
                "define": {
                    "en": "to arrange for something official to take place",
                    "vi": "sắp xếp cho một cái gì đó chính thức diễn ra"
                },
                "examples": [
                    {
                        "en": "The US is sponsoring negotiations between the two sides.",
                        "vi": "Mỹ đang tài trợ cho các cuộc đàm phán giữa hai bên."
                    }
                ]
            },
            {
                "define": {
                    "en": "to introduce a proposal for a new law, etc.",
                    "vi": "để đưa ra một đề xuất cho một luật mới, v.v."
                },
                "examples": [
                    {
                        "en": "The bill was sponsored by a Labour MP.",
                        "vi": "Dự luật được tài trợ bởi một nghị sĩ Lao động."
                    }
                ]
            }
        ]
    },
    {
        "id": "6727bb7b8f89490db177514a13af03f8",
        "word": "sponsor",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈspɒnsə(r)/",
            "us": "/ˈspɑːnsər/"
        },
        "nearby": [
            {
                "word": "spongy",
                "pos": "adjective"
            },
            {
                "word": "sponsor",
                "pos": "verb"
            },
            {
                "word": "sponsor",
                "pos": "noun"
            },
            {
                "word": "sponsorship",
                "pos": "noun"
            },
            {
                "word": "spontaneity",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person or company that pays for a radio or television programme, or for a concert or sporting event, usually in return for advertising",
                    "vi": "một người hoặc công ty trả tiền cho một chương trình phát thanh hoặc truyền hình, hoặc cho một buổi hòa nhạc hoặc sự kiện thể thao, thường để đổi lấy quảng cáo"
                },
                "examples": [
                    {
                        "en": "The programme is funded by a number of corporate sponsors.",
                        "vi": "Chương trình được tài trợ bởi một số doanh nghiệp tài trợ."
                    },
                    {
                        "en": "The Barbados Tourism Authority is the main sponsor of the event.",
                        "vi": "Cơ quan Du lịch Barbados là nhà tài trợ chính của sự kiện này."
                    },
                    {
                        "en": "The festival lost a major sponsor last year.",
                        "vi": "Lễ hội đã mất một nhà tài trợ lớn vào năm ngoái."
                    },
                    {
                        "en": "The race organizers are trying to attract sponsors.",
                        "vi": "Ban tổ chức cuộc đua đang cố gắng thu hút các nhà tài trợ."
                    },
                    {
                        "en": "the title sponsor of the rowing World Cup",
                        "vi": "nhà tài trợ chính của World Cup rowing"
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who agrees to give somebody money for a charity if that person succeeds in completing a particular activity",
                    "vi": "một người đồng ý cho ai đó tiền làm từ thiện nếu người đó thành công trong việc hoàn thành một hoạt động cụ thể"
                },
                "examples": [
                    {
                        "en": "Even though the race is still ten weeks away, we are already looking for sponsors.",
                        "vi": "Mặc dù cuộc đua vẫn còn mười tuần nữa mới diễn ra, nhưng chúng tôi đã tìm kiếm các nhà tài trợ."
                    },
                    {
                        "en": "sponsor for something I'm collecting sponsors for next week's charity run.",
                        "vi": "tài trợ cho một cái gì đó mà tôi đang thu thập các nhà tài trợ cho cuộc chạy từ thiện vào tuần tới."
                    },
                    {
                        "en": "I need to find some more sponsors for my charity bike ride.",
                        "vi": "Tôi cần tìm thêm một số nhà tài trợ cho chuyến đạp xe từ thiện của mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person or company that supports somebody by paying for their training or education",
                    "vi": "một người hoặc công ty hỗ trợ ai đó bằng cách trả tiền cho việc đào tạo hoặc giáo dục của họ"
                },
                "examples": [
                    {
                        "en": "Each student's tuition was paid by an individual sponsor.",
                        "vi": "Học phí của mỗi học sinh do một nhà tài trợ cá nhân chi trả."
                    },
                    {
                        "en": "Unless he can find a sponsor he’ll be forced to retire from athletics.",
                        "vi": "Trừ khi anh ta có thể tìm được một nhà tài trợ, anh ta sẽ bị buộc phải nghỉ thi đấu điền kinh."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person, a group, an organization, etc. that provides money for an activity",
                    "vi": "một người, một nhóm, một tổ chức, v.v. cung cấp tiền cho một hoạt động"
                },
                "examples": [
                    {
                        "en": "the list of state sponsors of terrorism",
                        "vi": "danh sách nhà nước tài trợ khủng bố"
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who introduces and supports a proposal for a new law, etc.",
                    "vi": "một người giới thiệu và ủng hộ đề xuất cho một luật mới, v.v."
                },
                "examples": [
                    {
                        "en": "the sponsor of the new immigration bill",
                        "vi": "nhà tài trợ của dự luật nhập cư mới"
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who agrees to be officially responsible for another person",
                    "vi": "một người đồng ý chịu trách nhiệm chính thức cho một người khác"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a person who presents a child for Christian baptism or confirmation",
                    "vi": "một người giới thiệu một đứa trẻ để làm báp têm hoặc xác nhận của Cơ đốc giáo"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "19e18b119e0344a2ac4be40b2634e0ab",
        "word": "voluntary",
        "pos": "adjective",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈvɒləntri/",
            "us": "/ˈvɑːlənteri/"
        },
        "nearby": [
            {
                "word": "voluntarily",
                "pos": "adverb"
            },
            {
                "word": "voluntarism",
                "pos": "noun"
            },
            {
                "word": "voluntary",
                "pos": "adjective"
            },
            {
                "word": "voluntary",
                "pos": "noun"
            },
            {
                "word": "voluntary school",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "done willingly, not because you are forced",
                    "vi": "thực hiện một cách tự nguyện, không phải vì bạn bị ép buộc"
                },
                "examples": [
                    {
                        "en": "a voluntary agreement",
                        "vi": "một thỏa thuận tự nguyện"
                    },
                    {
                        "en": "Attendance on the course is purely voluntary.",
                        "vi": "Việc tham dự khóa học là hoàn toàn tự nguyện."
                    },
                    {
                        "en": "to pay voluntary contributions into a pension fund",
                        "vi": "đóng góp tự nguyện vào quỹ hưu trí"
                    },
                    {
                        "en": "(British English) He took voluntary redundancy.",
                        "vi": "(Anh Anh) Anh ấy đã tự nguyện dự phòng."
                    }
                ]
            },
            {
                "define": {
                    "en": "done by people who choose to do it without being paid",
                    "vi": "được thực hiện bởi những người chọn làm điều đó mà không được trả tiền"
                },
                "examples": [
                    {
                        "en": "I do some voluntary work at the local hospital.",
                        "vi": "Tôi làm một số công việc tình nguyện tại bệnh viện địa phương."
                    },
                    {
                        "en": "She works there on a voluntary basis.",
                        "vi": "Cô ấy làm việc ở đó trên cơ sở tự nguyện."
                    },
                    {
                        "en": "voluntary services/bodies/agencies/organizations (= organized, controlled or supported by people who choose to do this and are usually not paid)",
                        "vi": "các dịch vụ / cơ quan / cơ quan / tổ chức tự nguyện (= được tổ chức, kiểm soát hoặc hỗ trợ bởi những người chọn làm việc này và thường không được trả tiền)"
                    },
                    {
                        "en": "the voluntary sector (= organizations which are set up to help people and that do not make a profit, for example charities)",
                        "vi": "lĩnh vực tình nguyện (= các tổ chức được thành lập để giúp đỡ mọi người và không tạo ra lợi nhuận, ví dụ như tổ chức từ thiện)"
                    }
                ]
            },
            {
                "define": {
                    "en": "doing a job without wanting to be paid for it",
                    "vi": "làm một công việc mà không muốn được trả tiền cho nó"
                },
                "examples": [
                    {
                        "en": "The homeless hostel is staffed by voluntary workers.",
                        "vi": "Nhà trọ dành cho người vô gia cư do những người lao động tình nguyện làm việc."
                    }
                ]
            },
            {
                "define": {
                    "en": "that you can control",
                    "vi": "mà bạn có thể kiểm soát"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "77508000f1b04e9097ea108e3f7a1b42",
        "word": "welfare",
        "pos": "noun",
        "level": "b2",
        "phonetic": {
            "uk": "/ˈwelfeə(r)/",
            "us": "/ˈwelfer/"
        },
        "nearby": [
            {
                "word": "weld",
                "pos": "noun"
            },
            {
                "word": "welder",
                "pos": "noun"
            },
            {
                "word": "welfare",
                "pos": "noun"
            },
            {
                "word": "welfare state",
                "pos": "noun"
            },
            {
                "word": "Welfare to Work",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the general health, happiness and safety of a person, an animal or a group",
                    "vi": "sức khỏe chung, hạnh phúc và an toàn của một người, một động vật hoặc một nhóm"
                },
                "examples": [
                    {
                        "en": "We are concerned about the child's welfare.",
                        "vi": "Chúng tôi quan tâm đến phúc lợi của đứa trẻ."
                    }
                ]
            },
            {
                "define": {
                    "en": "practical or financial help that is provided, often by the government, for people or animals that need it",
                    "vi": "trợ giúp thực tế hoặc tài chính được cung cấp, thường là bởi chính phủ, cho những người hoặc động vật cần nó"
                },
                "examples": [
                    {
                        "en": "The state is still the main provider of welfare.",
                        "vi": "Nhà nước vẫn là nhà cung cấp phúc lợi chính."
                    },
                    {
                        "en": "child welfare",
                        "vi": "phúc lợi trẻ em"
                    },
                    {
                        "en": "a social welfare programme",
                        "vi": "một chương trình phúc lợi xã hội"
                    },
                    {
                        "en": "welfare provision/services/work",
                        "vi": "cung cấp phúc lợi / dịch vụ / công việc"
                    },
                    {
                        "en": "There must be adequate welfare provision for people with disabilities.",
                        "vi": "Phải cung cấp đầy đủ phúc lợi cho người khuyết tật."
                    }
                ]
            },
            {
                "define": {
                    "en": "money that the government pays regularly to people who are poor, unemployed, sick, etc.",
                    "vi": "tiền mà chính phủ trả thường xuyên cho những người nghèo, thất nghiệp, ốm đau, v.v."
                },
                "examples": [
                    {
                        "en": "on welfare They would rather work than live on welfare.",
                        "vi": "về phúc lợi Họ thà làm việc hơn là sống dựa vào phúc lợi."
                    }
                ]
            }
        ]
    },
    {
        "id": "0c34a88bb4cc4771a4ae74beadb9316f",
        "word": "affordable housing",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/əˌfɔːdəbl ˈhaʊzɪŋ/",
            "us": "/əˌfɔːrdəbl ˈhaʊzɪŋ/"
        },
        "nearby": [
            {
                "word": "affordability",
                "pos": "noun"
            },
            {
                "word": "affordable",
                "pos": "adjective"
            },
            {
                "word": "affordable housing",
                "pos": "noun"
            },
            {
                "word": "affordably",
                "pos": "adverb"
            },
            {
                "word": "afforest",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "houses or flats that are available for people on low incomes to buy or rent at a low price, especially because the government has required house-building companies to offer a certain number of new properties at lower prices",
                    "vi": "nhà hoặc căn hộ dành cho những người có thu nhập thấp mua hoặc thuê với giá thấp, đặc biệt là do chính phủ yêu cầu các công ty xây dựng nhà cung cấp một số lượng bất động sản mới với giá thấp hơn"
                },
                "examples": [
                    {
                        "en": "The city needs more affordable housing for families on low incomes.",
                        "vi": "Thành phố cần nhiều nhà ở giá cả phải chăng hơn cho các gia đình có thu nhập thấp."
                    },
                    {
                        "en": "The shortage of affordable housing has caused an increase in the number of homeless people.",
                        "vi": "Tình trạng thiếu nhà ở giá rẻ đã khiến số lượng người vô gia cư ngày càng gia tăng."
                    }
                ]
            }
        ]
    },
    {
        "id": "5da8c6da9da64b54ba73fddb9ce514cf",
        "word": "charitable",
        "pos": "adjective",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈtʃærətəbl/",
            "us": "/ˈtʃærətəbl/"
        },
        "nearby": [
            {
                "word": "charismatic",
                "pos": "noun"
            },
            {
                "word": "charismatically",
                "pos": "adverb"
            },
            {
                "word": "charitable",
                "pos": "adjective"
            },
            {
                "word": "charitably",
                "pos": "adverb"
            },
            {
                "word": "charity",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "connected with a charity or charities",
                    "vi": "kết nối với một tổ chức từ thiện hoặc các tổ chức từ thiện"
                },
                "examples": [
                    {
                        "en": "a charitable institution/foundation/trust",
                        "vi": "một tổ chức từ thiện / quỹ / quỹ tín thác"
                    },
                    {
                        "en": "a charitable donation/gift",
                        "vi": "quyên góp / quà tặng từ thiện"
                    },
                    {
                        "en": "(British English) to have charitable status (= to be an official charity)",
                        "vi": "(Tiếng Anh Anh) để có trạng thái từ thiện (= trở thành một tổ chức từ thiện chính thức)"
                    }
                ]
            },
            {
                "define": {
                    "en": "helping people who are poor or in need",
                    "vi": "giúp đỡ những người nghèo hoặc khó khăn"
                },
                "examples": [
                    {
                        "en": "His later years were devoted largely to charitable work.",
                        "vi": "Những năm sau này của ông được dành phần lớn cho công việc từ thiện."
                    }
                ]
            },
            {
                "define": {
                    "en": "kind in your attitude to other people, especially when you are judging them",
                    "vi": "tử tế trong thái độ của bạn với người khác, đặc biệt là khi bạn đang đánh giá họ"
                },
                "examples": [
                    {
                        "en": "Let's be charitable and assume she just made a mistake.",
                        "vi": "Hãy làm từ thiện và cho rằng cô ấy chỉ phạm sai lầm."
                    },
                    {
                        "en": "Less charitable accounts of his character say he was vain and selfish.",
                        "vi": "Các tài khoản ít từ thiện về nhân vật của anh ta nói rằng anh ta vô ích và ích kỷ."
                    }
                ]
            }
        ]
    },
    {
        "id": "2bbf73a270f34c6b9231c2bd6384bcb2",
        "word": "donor",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈdəʊnə(r)/",
            "us": "/ˈdəʊnər/"
        },
        "nearby": [
            {
                "word": "Donnie",
                "pos": ""
            },
            {
                "word": "donnish",
                "pos": "adjective"
            },
            {
                "word": "donor",
                "pos": "noun"
            },
            {
                "word": "do-nothing",
                "pos": "adjective"
            },
            {
                "word": "don't",
                "pos": "short form"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person or an organization that makes a gift of money, clothes, food, etc. to a charity, etc.",
                    "vi": "một người hoặc một tổ chức tặng tiền, quần áo, thực phẩm, v.v. cho một tổ chức từ thiện, v.v."
                },
                "examples": [
                    {
                        "en": "international aid donors (= countries that give money, etc. to help other countries)",
                        "vi": "các nhà tài trợ viện trợ quốc tế (= các quốc gia cung cấp tiền, v.v. để giúp các quốc gia khác)"
                    },
                    {
                        "en": "She is one of the charity's main donors.",
                        "vi": "Cô là một trong những nhà tài trợ chính của tổ chức từ thiện."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who gives blood or a part of his or her body to be used by doctors in medical treatment",
                    "vi": "một người cho máu hoặc một bộ phận cơ thể của mình để bác sĩ sử dụng trong điều trị y tế"
                },
                "examples": [
                    {
                        "en": "a blood donor",
                        "vi": "một người hiến máu"
                    },
                    {
                        "en": "The heart transplant will take place as soon as a suitable donor can be found.",
                        "vi": "Việc cấy ghép tim sẽ diễn ra ngay khi tìm được người hiến tặng phù hợp."
                    },
                    {
                        "en": "donor organs",
                        "vi": "các cơ quan hiến tặng"
                    },
                    {
                        "en": "a donor card (= a card that you carry giving permission for doctors to use parts of your body after your death)",
                        "vi": "thẻ hiến tặng (= thẻ mà bạn mang theo để cho phép các bác sĩ sử dụng các bộ phận của cơ thể bạn sau khi bạn qua đời)"
                    }
                ]
            }
        ]
    },
    {
        "id": "812c2627938a440fa2abc07832366cba",
        "word": "food bank",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈfuːd bæŋk/",
            "us": "/ˈfuːd bæŋk/"
        },
        "nearby": [
            {
                "word": "Margot Fonteyn",
                "pos": ""
            },
            {
                "word": "food",
                "pos": "noun"
            },
            {
                "word": "food bank",
                "pos": "noun"
            },
            {
                "word": "food chain",
                "pos": "noun"
            },
            {
                "word": "food court",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a place where people in need can go to get free food",
                    "vi": "một nơi mà những người có nhu cầu có thể đến để nhận thức ăn miễn phí"
                },
                "examples": [
                    {
                        "en": "Half a million people have visited food banks since April.",
                        "vi": "Nửa triệu người đã đến các ngân hàng thực phẩm kể từ tháng Tư."
                    }
                ]
            },
            {
                "define": {
                    "en": "an organization that stores basic food supplies for distribution to people in need. The food is often passed on to local food pantries, which give it to the people who need it.",
                    "vi": "một tổ chức lưu trữ nguồn cung cấp thực phẩm cơ bản để phân phối cho những người có nhu cầu. Thực phẩm thường được chuyển đến các cửa hàng thực phẩm địa phương để cung cấp cho những người cần nó."
                },
                "examples": [
                    {
                        "en": "All food collected will go to local food banks and pantries.",
                        "vi": "Tất cả thực phẩm thu được sẽ được chuyển đến các ngân hàng thực phẩm và kho chứa thức ăn của địa phương."
                    }
                ]
            }
        ]
    },
    {
        "id": "32453d306d9c4f23b781d962c4d832c1",
        "word": "fundraise",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈfʌndreɪz/",
            "us": "/ˈfʌndreɪz/"
        },
        "nearby": [
            {
                "word": "funding",
                "pos": "noun"
            },
            {
                "word": "fund manager",
                "pos": "noun"
            },
            {
                "word": "fundraise",
                "pos": "verb"
            },
            {
                "word": "fundraiser",
                "pos": "noun"
            },
            {
                "word": "fundraising",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to collect money for a charity or organization, often by organizing social events or entertainments",
                    "vi": "để thu tiền cho một tổ chức hoặc tổ chức từ thiện, thường bằng cách tổ chức các sự kiện xã hội hoặc giải trí"
                },
                "examples": [
                    {
                        "en": "We're looking at new ways to fundraise for the charity.",
                        "vi": "Chúng tôi đang xem xét những cách mới để gây quỹ cho tổ chức từ thiện."
                    },
                    {
                        "en": "Centres like ours are having to fundraise just to meet their general running costs.",
                        "vi": "Các trung tâm như của chúng tôi đang phải gây quỹ chỉ để đáp ứng chi phí hoạt động chung của họ."
                    }
                ]
            }
        ]
    },
    {
        "id": "638dd243e03c4587a070766f09337b7c",
        "word": "fundraising",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˈfʌndreɪzɪŋ/",
            "us": "/ˈfʌndreɪzɪŋ/"
        },
        "nearby": [
            {
                "word": "fundraise",
                "pos": "verb"
            },
            {
                "word": "fundraiser",
                "pos": "noun"
            },
            {
                "word": "fundraising",
                "pos": "noun"
            },
            {
                "word": "funeral",
                "pos": "noun"
            },
            {
                "word": "funeral director",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the activity of collecting money for a charity or organization, often by organizing social events or entertainments",
                    "vi": "hoạt động thu tiền cho một tổ chức hoặc tổ chức từ thiện, thường bằng cách tổ chức các sự kiện xã hội hoặc giải trí"
                },
                "examples": [
                    {
                        "en": "The hospice is planning a major fundraising event for June.",
                        "vi": "Nhà tế bần đang lên kế hoạch cho một sự kiện gây quỹ lớn vào tháng Sáu."
                    }
                ]
            }
        ]
    },
    {
        "id": "ba95a4b1fbcb43e2b4a978265bdf0568",
        "word": "NGO",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌen dʒiː ˈəʊ/",
            "us": "/ˌen dʒiː ˈəʊ/"
        },
        "nearby": [
            {
                "word": "the NFU",
                "pos": ""
            },
            {
                "word": "NGfL",
                "pos": ""
            },
            {
                "word": "NGO",
                "pos": "noun"
            },
            {
                "word": "ngoma",
                "pos": "noun"
            },
            {
                "word": "NH",
                "pos": "abbreviation"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "non-governmental organization (a charity, association, etc. that is independent of government and business)",
                    "vi": "tổ chức phi chính phủ (tổ chức từ thiện, hiệp hội, v.v. độc lập với chính phủ và doanh nghiệp)"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "8353584500884ebf8a3c1d8d054844fe",
        "word": "philanthropist",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/fɪˈlænθrəpɪst/",
            "us": "/fɪˈlænθrəpɪst/"
        },
        "nearby": [
            {
                "word": "philanthropic",
                "pos": "adjective"
            },
            {
                "word": "philanthropically",
                "pos": "adverb"
            },
            {
                "word": "philanthropist",
                "pos": "noun"
            },
            {
                "word": "philanthropy",
                "pos": "noun"
            },
            {
                "word": "philatelic",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a rich person who helps the poor and those in need, especially by giving money",
                    "vi": "một người giàu giúp đỡ người nghèo và những người khó khăn, đặc biệt là bằng cách cho tiền"
                },
                "examples": [
                    {
                        "en": "He was a wealthy businessman and philanthropist.",
                        "vi": "Ông là một doanh nhân giàu có và nhà từ thiện."
                    },
                    {
                        "en": "The trust was set up by an American philanthropist.",
                        "vi": "Quỹ tín thác được thành lập bởi một nhà từ thiện người Mỹ."
                    }
                ]
            }
        ]
    },
    {
        "id": "0763c70c7eee4922a0383c29f9bfc7f5",
        "word": "philanthropy",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/fɪˈlænθrəpi/",
            "us": "/fɪˈlænθrəpi/"
        },
        "nearby": [
            {
                "word": "philanthropically",
                "pos": "adverb"
            },
            {
                "word": "philanthropist",
                "pos": "noun"
            },
            {
                "word": "philanthropy",
                "pos": "noun"
            },
            {
                "word": "philatelic",
                "pos": "adjective"
            },
            {
                "word": "philatelist",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the practice of helping the poor and those in need, especially by giving money",
                    "vi": "thực hành giúp đỡ người nghèo và những người gặp khó khăn, đặc biệt là bằng cách cho tiền"
                },
                "examples": [
                    {
                        "en": "Hospitals were built as a result of private philanthropy and government intervention.",
                        "vi": "Các bệnh viện được xây dựng là kết quả của hoạt động từ thiện tư nhân và sự can thiệp của chính phủ."
                    }
                ]
            }
        ]
    },
    {
        "id": "73a08df48e484e988e8652718dea1561",
        "word": "public housing",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌpʌblɪk ˈhaʊzɪŋ/",
            "us": "/ˌpʌblɪk ˈhaʊzɪŋ/"
        },
        "nearby": [
            {
                "word": "public holiday",
                "pos": "noun"
            },
            {
                "word": "public house",
                "pos": "noun"
            },
            {
                "word": "public housing",
                "pos": "noun"
            },
            {
                "word": "publicist",
                "pos": "noun"
            },
            {
                "word": "publicity",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "(in the US) houses and flats that are built by the government for people who do not have enough money to pay for private accommodation",
                    "vi": "(ở Mỹ) những ngôi nhà và căn hộ do chính phủ xây dựng cho những người không có đủ tiền trả cho chỗ ở riêng"
                },
                "examples": [
                    {
                        "en": "Public housing is limited to low-income families and individuals.",
                        "vi": "Nhà ở công vụ chỉ giới hạn cho các gia đình và cá nhân có thu nhập thấp."
                    },
                    {
                        "en": "There has been massive investment in public housing.",
                        "vi": "Đã có sự đầu tư ồ ạt vào nhà ở công cộng."
                    }
                ]
            }
        ]
    },
    {
        "id": "951694b984834e2a986fe7de5f9d77cf",
        "word": "social housing",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/ˌsəʊʃl ˈhaʊzɪŋ/",
            "us": "/ˌsəʊʃl ˈhaʊzɪŋ/"
        },
        "nearby": [
            {
                "word": "social gamer",
                "pos": "noun"
            },
            {
                "word": "social gaming",
                "pos": "noun"
            },
            {
                "word": "social housing",
                "pos": "noun"
            },
            {
                "word": "Social Insurance number",
                "pos": "noun"
            },
            {
                "word": "socialism",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "(in the UK) houses or flats that are provided by a local council or another organization for people on low incomes to buy or rent at a low price",
                    "vi": "(ở Anh) nhà hoặc căn hộ do hội đồng địa phương hoặc một tổ chức khác cung cấp cho những người có thu nhập thấp mua hoặc thuê với giá thấp"
                },
                "examples": [
                    {
                        "en": "Public expenditure on social housing provision has doubled in the last five years.",
                        "vi": "Chi tiêu công cho việc cung cấp nhà ở xã hội đã tăng gấp đôi trong 5 năm qua."
                    }
                ]
            }
        ]
    },
    {
        "id": "4a2b547bf7e543c99914b62c471771bd",
        "word": "subscribe",
        "pos": "verb",
        "level": "c1",
        "phonetic": {
            "uk": "/səbˈskraɪb/",
            "us": "/səbˈskraɪb/"
        },
        "nearby": [
            {
                "word": "subroutine",
                "pos": "noun"
            },
            {
                "word": "sub-Saharan",
                "pos": "adjective"
            },
            {
                "word": "subscribe",
                "pos": "verb"
            },
            {
                "word": "subscriber",
                "pos": "noun"
            },
            {
                "word": "subscribe to",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "to pay an amount of money regularly in order to receive or use something",
                    "vi": "thanh toán một số tiền thường xuyên để nhận hoặc sử dụng thứ gì đó"
                },
                "examples": [
                    {
                        "en": "Which journals does the library subscribe to?",
                        "vi": "Thư viện đăng ký những tạp chí nào?"
                    },
                    {
                        "en": "We subscribe to several sports channels (= on TV).",
                        "vi": "Chúng tôi đăng ký một số kênh thể thao (= trên TV)."
                    }
                ]
            },
            {
                "define": {
                    "en": "to arrange to have regular access to an electronic information service or other internet service",
                    "vi": "sắp xếp để có quyền truy cập thường xuyên vào dịch vụ thông tin điện tử hoặc dịch vụ internet khác"
                },
                "examples": [
                    {
                        "en": "He subscribed to a newsgroup (= on the internet).",
                        "vi": "Anh ấy đã đăng ký một nhóm tin (= trên internet)."
                    },
                    {
                        "en": "To hear the full interview, subscribe to the free National Geographic News podcast.",
                        "vi": "Để nghe toàn bộ cuộc phỏng vấn, hãy đăng ký podcast National Geographic News miễn phí."
                    }
                ]
            },
            {
                "define": {
                    "en": "to pay money regularly to be a member of an organization or to support a charity",
                    "vi": "thường xuyên trả tiền để trở thành thành viên của tổ chức hoặc hỗ trợ tổ chức từ thiện"
                },
                "examples": [
                    {
                        "en": "He subscribes regularly to Amnesty International.",
                        "vi": "Anh ấy đăng ký thường xuyên với Tổ chức Ân xá Quốc tế."
                    }
                ]
            },
            {
                "define": {
                    "en": "to apply to buy shares in a company",
                    "vi": "đăng ký mua cổ phần trong một công ty"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to apply to take part in an activity, use a service, etc.",
                    "vi": "đăng ký tham gia một hoạt động, sử dụng dịch vụ, v.v."
                },
                "examples": [
                    {
                        "en": "The tour of Edinburgh is fully subscribed.",
                        "vi": "Chuyến tham quan Edinburgh đã được đăng ký đầy đủ."
                    }
                ]
            }
        ]
    },
    {
        "id": "6ec99b5451314b17935955066b9203f5",
        "word": "subscription",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/səbˈskrɪpʃn/",
            "us": "/səbˈskrɪpʃn/"
        },
        "nearby": [
            {
                "word": "subscript",
                "pos": "adjective"
            },
            {
                "word": "subscript",
                "pos": "noun"
            },
            {
                "word": "subscription",
                "pos": "noun"
            },
            {
                "word": "subscription concert",
                "pos": "noun"
            },
            {
                "word": "subsection",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an amount of money that you pay regularly to receive a service, be a member of a club, support a charity or receive regular copies of a newspaper or magazine; the act of paying this money",
                    "vi": "một khoản tiền mà bạn phải trả thường xuyên để nhận được một dịch vụ, là thành viên của câu lạc bộ, ủng hộ một tổ chức từ thiện hoặc nhận các bản sao thường xuyên của một tờ báo hoặc tạp chí; hành động trả số tiền này"
                },
                "examples": [
                    {
                        "en": "an annual subscription",
                        "vi": "đăng ký hàng năm"
                    },
                    {
                        "en": "subscription to/for something a subscription to Netflix",
                        "vi": "đăng ký / cho một thứ gì đó đăng ký Netflix"
                    },
                    {
                        "en": "a monthly subscription to Oxfam",
                        "vi": "đăng ký Oxfam hàng tháng"
                    },
                    {
                        "en": "to take out a subscription to ‘Newsweek’",
                        "vi": "đăng ký 'Newsweek'"
                    },
                    {
                        "en": "to cancel/renew a subscription",
                        "vi": "để hủy / gia hạn đăng ký"
                    },
                    {
                        "en": "by subscription Copies are available by subscription.",
                        "vi": "theo đăng ký Bản sao có sẵn theo đăng ký."
                    },
                    {
                        "en": "Subscriptions are due annually by the end of January.",
                        "vi": "Các đăng ký sẽ đến hạn hàng năm vào cuối tháng Giêng."
                    }
                ]
            },
            {
                "define": {
                    "en": "the act of people paying money for something to be done",
                    "vi": "hành động của mọi người trả tiền cho một cái gì đó được thực hiện"
                },
                "examples": [
                    {
                        "en": "A statue in his memory was erected by public subscription.",
                        "vi": "Một bức tượng trong trí nhớ của ông đã được dựng lên bằng cách đăng ký công khai."
                    }
                ]
            }
        ]
    },
    {
        "id": "86e48903ea064c9dba64f39bc1c404f0",
        "word": "trustee",
        "pos": "noun",
        "level": "c1",
        "phonetic": {
            "uk": "/trʌˈstiː/",
            "us": "/trʌˈstiː/"
        },
        "nearby": [
            {
                "word": "trust",
                "pos": "verb"
            },
            {
                "word": "trustafarian",
                "pos": "noun"
            },
            {
                "word": "trustee",
                "pos": "noun"
            },
            {
                "word": "trusteeship",
                "pos": "noun"
            },
            {
                "word": "trust fund",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person or an organization that has control of money or property that has been put into a trust for somebody",
                    "vi": "một người hoặc một tổ chức có quyền kiểm soát tiền hoặc tài sản đã được ủy thác cho ai đó"
                },
                "examples": [
                    {
                        "en": "The bank will act as trustees for the estate until the child is 18.",
                        "vi": "Ngân hàng sẽ đóng vai trò là người ủy thác tài sản cho đến khi đứa trẻ được 18 tuổi."
                    }
                ]
            },
            {
                "define": {
                    "en": "a member of a group of people that controls the financial affairs and decides the policy of a charity or other organization",
                    "vi": "thành viên của một nhóm người kiểm soát các vấn đề tài chính và quyết định chính sách của tổ chức từ thiện hoặc tổ chức khác"
                },
                "examples": [
                    {
                        "en": "the board of trustees",
                        "vi": "hội đồng quản trị"
                    },
                    {
                        "en": "a trustee of the hospice",
                        "vi": "một người được ủy thác của nhà tế bần"
                    },
                    {
                        "en": "the trustees of the National Gallery",
                        "vi": "những người được ủy thác của Phòng trưng bày Quốc gia"
                    },
                    {
                        "en": "a trustee of the museum",
                        "vi": "một người được ủy thác của bảo tàng"
                    }
                ]
            }
        ]
    },
    {
        "id": "d8d9b91d96e2404eb60e8b5711354fdc",
        "word": "advocacy group",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈædvəkəsi ɡruːp/",
            "us": "/ˈædvəkəsi ɡruːp/"
        },
        "nearby": [
            {
                "word": "advocaat",
                "pos": "noun"
            },
            {
                "word": "advocacy",
                "pos": "noun"
            },
            {
                "word": "advocacy group",
                "pos": "noun"
            },
            {
                "word": "advocate",
                "pos": "noun"
            },
            {
                "word": "advocate",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a group of people who work together to achieve something, especially by putting pressure on the government, etc., usually representing people who are unable to speak for themselves",
                    "vi": "một nhóm người làm việc cùng nhau để đạt được điều gì đó, đặc biệt là bằng cách gây áp lực lên chính phủ, v.v., thường đại diện cho những người không có khả năng tự nói"
                },
                "examples": [
                    {
                        "en": "an advocacy group for the rights of the mentally ill",
                        "vi": "một nhóm vận động cho quyền của người bệnh tâm thần"
                    }
                ]
            }
        ]
    },
    {
        "id": "dd37bd0e69ee4292aae9acb962ddf486",
        "word": "affinity card",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/əˈfɪnəti kɑːd/",
            "us": "/əˈfɪnəti kɑːrd/"
        },
        "nearby": [
            {
                "word": "affiliation",
                "pos": "noun"
            },
            {
                "word": "affinity",
                "pos": "noun"
            },
            {
                "word": "affinity card",
                "pos": "noun"
            },
            {
                "word": "affinity group",
                "pos": "noun"
            },
            {
                "word": "affirm",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a credit card printed with the name of an organization, for example a charity, which receives a small amount of money each time the card is used",
                    "vi": "thẻ tín dụng có in tên của tổ chức, ví dụ như tổ chức từ thiện, tổ chức này nhận được một khoản tiền nhỏ mỗi khi thẻ được sử dụng"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "7ab16235c15946b9b7eb8fb620aedccb",
        "word": "alms",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ɑːmz/",
            "us": "/ɑːmz/"
        },
        "nearby": [
            {
                "word": "almoner",
                "pos": "noun"
            },
            {
                "word": "almost",
                "pos": "adverb"
            },
            {
                "word": "alms",
                "pos": "noun"
            },
            {
                "word": "almshouse",
                "pos": "noun"
            },
            {
                "word": "aloe",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "money, clothes and food that are given to poor people",
                    "vi": "tiền, quần áo và thực phẩm được trao cho người nghèo"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a58bcdd7a7514880a30059dd13464920",
        "word": "bazaar",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/bəˈzɑː(r)/",
            "us": "/bəˈzɑːr/"
        },
        "nearby": [
            {
                "word": "Baywatch",
                "pos": ""
            },
            {
                "word": "bay window",
                "pos": "noun"
            },
            {
                "word": "bazaar",
                "pos": "noun"
            },
            {
                "word": "bazooka",
                "pos": "noun"
            },
            {
                "word": "Bazooka",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a street or an area of a town where there are many small shops",
                    "vi": "một con phố hoặc một khu vực của thị trấn nơi có nhiều cửa hàng nhỏ"
                },
                "examples": [
                    {
                        "en": "rugs on sale in the Turkish bazaars",
                        "vi": "thảm được bán ở chợ Thổ Nhĩ Kỳ"
                    },
                    {
                        "en": "Why not visit the local bustling bazaar and the Kashmir carpet factory?",
                        "vi": "Tại sao không ghé thăm khu chợ sầm uất của địa phương và nhà máy sản xuất thảm Kashmir?"
                    }
                ]
            },
            {
                "define": {
                    "en": "a sale of goods, often items made by hand, to raise money for a charity or for people who need help",
                    "vi": "bán hàng hóa, thường là các mặt hàng làm bằng tay, để gây quỹ từ thiện hoặc cho những người cần giúp đỡ"
                },
                "examples": [
                    {
                        "en": "She got it at the church bazaar.",
                        "vi": "Cô ấy lấy nó ở chợ nhà thờ."
                    },
                    {
                        "en": "The Scouts are having a bazaar on Saturday.",
                        "vi": "Các hướng đạo sinh sẽ có một phiên chợ vào thứ Bảy."
                    }
                ]
            }
        ]
    },
    {
        "id": "ae6f7fc81c6a484da89234e35562f5e8",
        "word": "benefactor",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈbenɪfæktə(r)/",
            "us": "/ˈbenɪfæktər/"
        },
        "nearby": [
            {
                "word": "benefaction",
                "pos": "noun"
            },
            {
                "word": "benefactive",
                "pos": "adjective"
            },
            {
                "word": "benefactor",
                "pos": "noun"
            },
            {
                "word": "benefice",
                "pos": "noun"
            },
            {
                "word": "beneficence",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who gives money or other help to a person or an organization such as a school or charity",
                    "vi": "một người cung cấp tiền hoặc sự giúp đỡ khác cho một người hoặc một tổ chức như trường học hoặc tổ chức từ thiện"
                },
                "examples": [
                    {
                        "en": "a generous benefactor",
                        "vi": "một nhà hảo tâm hào phóng"
                    },
                    {
                        "en": "The equipment was funded by friends and benefactors of the hospital.",
                        "vi": "Trang thiết bị do bạn bè và các nhà hảo tâm của bệnh viện tài trợ."
                    }
                ]
            }
        ]
    },
    {
        "id": "0232a2d6be154d61b7e779c64bae6285",
        "word": "bring-and-buy sale",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌbrɪŋ ən ˈbaɪ seɪl/",
            "us": "/ˌbrɪŋ ən ˈbaɪ seɪl/"
        },
        "nearby": [
            {
                "word": "bring A and B together",
                "pos": "phrasal verb"
            },
            {
                "word": "bring about",
                "pos": "phrasal verb"
            },
            {
                "word": "bring-and-buy sale",
                "pos": "noun"
            },
            {
                "word": "bring around",
                "pos": "phrasal verb"
            },
            {
                "word": "bring around to",
                "pos": "phrasal verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a sale, usually for charity, at which people bring things for sale and buy those brought by others",
                    "vi": "một cuộc mua bán, thường là để làm từ thiện, tại đó mọi người mang những thứ đi bán và mua những thứ do người khác mang đến"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "1fabc354b1e34554ace52a5d7b76df25",
        "word": "deed of covenant",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌdiːd əv ˈkʌvənənt/",
            "us": "/ˌdiːd əv ˈkʌvənənt/"
        },
        "nearby": [
            {
                "word": "deed",
                "pos": "verb"
            },
            {
                "word": "deed",
                "pos": "noun"
            },
            {
                "word": "deed of covenant",
                "pos": "noun"
            },
            {
                "word": "deed poll",
                "pos": "noun"
            },
            {
                "word": "deejay",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a legal agreement to pay a regular amount of money to somebody/something over a fixed period of time",
                    "vi": "một thỏa thuận pháp lý để trả một số tiền đều đặn cho ai đó / cái gì đó trong một khoảng thời gian cố định"
                },
                "examples": [
                    {
                        "en": "The gift was made under a deed of covenant.",
                        "vi": "Món quà đã được thực hiện theo một chứng thư của giao ước."
                    }
                ]
            }
        ]
    },
    {
        "id": "a734d101cbc747d8a0214f35674fa00f",
        "word": "flag day",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈflæɡ deɪ/",
            "us": "/ˈflæɡ deɪ/"
        },
        "nearby": [
            {
                "word": "flag",
                "pos": "noun"
            },
            {
                "word": "flag",
                "pos": "verb"
            },
            {
                "word": "flag day",
                "pos": "noun"
            },
            {
                "word": "flag down",
                "pos": "phrasal verb"
            },
            {
                "word": "flagellate",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a day when money is collected in public places for a charity, and people who give money receive a small paper sticker",
                    "vi": "một ngày khi tiền được thu thập ở những nơi công cộng cho tổ chức từ thiện và những người cho tiền sẽ nhận được một nhãn dán giấy nhỏ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "14 June, the anniversary of the day in 1777 when the Stars and Stripes became the national flag of the United States",
                    "vi": "Ngày 14 tháng 6, kỷ niệm một ngày vào năm 1777 khi Ngôi sao và Sọc trở thành quốc kỳ của Hoa Kỳ"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "0143a36954d34582bcaf3779c93cb034",
        "word": "food pantry",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈfuːd pæntri/",
            "us": "/ˈfuːd pæntri/"
        },
        "nearby": [
            {
                "word": "food insecurity",
                "pos": "noun"
            },
            {
                "word": "food mile",
                "pos": "noun"
            },
            {
                "word": "food pantry",
                "pos": "noun"
            },
            {
                "word": "food poisoning",
                "pos": "noun"
            },
            {
                "word": "food processor",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an organization that gives food to poor people who live in a particular area. Food pantries often distribute food that they receive from a food bank.",
                    "vi": "một tổ chức cung cấp thực phẩm cho những người nghèo sống trong một khu vực cụ thể. Các cửa hàng thực phẩm thường phân phối thực phẩm mà họ nhận được từ ngân hàng thực phẩm."
                },
                "examples": [
                    {
                        "en": "The proceeds from the sale will support the church's food pantry.",
                        "vi": "Số tiền thu được từ việc bán hàng sẽ hỗ trợ kho thực phẩm của nhà thờ."
                    }
                ]
            }
        ]
    },
    {
        "id": "5d67a672bb6046b8ac16a1c3353fc8ba",
        "word": "food stamp",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈfuːd stæmp/",
            "us": "/ˈfuːd stæmp/"
        },
        "nearby": [
            {
                "word": "food science",
                "pos": "noun"
            },
            {
                "word": "food security",
                "pos": "noun"
            },
            {
                "word": "food stamp",
                "pos": "noun"
            },
            {
                "word": "the Food Standards Agency",
                "pos": ""
            },
            {
                "word": "foodstuff",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a piece of paper that is given by the government to people on low income, which they can exchange for food",
                    "vi": "một mảnh giấy được chính phủ trao cho những người có thu nhập thấp, họ có thể đổi lấy thức ăn"
                },
                "examples": [
                    {
                        "en": "These families receive food stamps to purchase food.",
                        "vi": "Những gia đình này nhận phiếu thực phẩm để mua thực phẩm."
                    }
                ]
            }
        ]
    },
    {
        "id": "9418d408a43a4c5190c21b7d4a245e42",
        "word": "friend",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/frend/",
            "us": "/frend/"
        },
        "nearby": [
            {
                "word": "Betty Friedan",
                "pos": ""
            },
            {
                "word": "Milton Friedman",
                "pos": ""
            },
            {
                "word": "friend",
                "pos": "noun"
            },
            {
                "word": "friend",
                "pos": "verb"
            },
            {
                "word": "friendless",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person you know well and like, and who is not usually a member of your family",
                    "vi": "một người bạn biết rõ và thích, và người thường không phải là thành viên trong gia đình bạn"
                },
                "examples": [
                    {
                        "en": "This is my friend Tom.",
                        "vi": "Đây là Tom, bạn của tôi."
                    },
                    {
                        "en": "Is he a friend of yours?",
                        "vi": "Anh ấy có phải là bạn của bạn không?"
                    },
                    {
                        "en": "Jane's a friend of the family.",
                        "vi": "Jane là một người bạn của gia đình."
                    },
                    {
                        "en": "She's an old friend (= I have known her a long time).",
                        "vi": "Cô ấy là một người bạn cũ (= Tôi đã biết cô ấy từ lâu)."
                    },
                    {
                        "en": "He's one of my best friends.",
                        "vi": "Anh ấy là một trong những người bạn tốt nhất của tôi."
                    },
                    {
                        "en": "a close/good/dear friend",
                        "vi": "một người bạn thân / tốt / thân yêu"
                    },
                    {
                        "en": "a childhood/family/longtime friend",
                        "vi": "một thời thơ ấu / gia đình / người bạn lâu năm"
                    },
                    {
                        "en": "We've been friends for years.",
                        "vi": "Chúng tôi đã là bạn trong nhiều năm."
                    },
                    {
                        "en": "They had a quarrel, but they're friends again now.",
                        "vi": "Họ đã từng cãi nhau, nhưng giờ họ lại là bạn của nhau."
                    },
                    {
                        "en": "to become/remain friends",
                        "vi": "trở thành / vẫn là bạn bè"
                    },
                    {
                        "en": "as a friend I'm asking you as a friend not to tell anyone.",
                        "vi": "với tư cách là một người bạn, tôi yêu cầu bạn như một người bạn đừng nói với ai."
                    },
                    {
                        "en": "She wanted to share the news with family and friends.",
                        "vi": "Cô muốn chia sẻ tin tức với gia đình và bạn bè."
                    },
                    {
                        "en": "She has a wide circle of friends.",
                        "vi": "Cô ấy có nhiều bạn bè."
                    },
                    {
                        "en": "I heard about it through a friend of a friend.",
                        "vi": "Tôi nghe nói về nó thông qua một người bạn của một người bạn."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who is on your list of contacts on a social media website",
                    "vi": "một người có trong danh sách liên hệ của bạn trên một trang web truyền thông xã hội"
                },
                "examples": [
                    {
                        "en": "How many friends have you got on Facebook?",
                        "vi": "Bạn có bao nhiêu người bạn trên Facebook?"
                    },
                    {
                        "en": "Facebook friends",
                        "vi": "Bạn bè trên Facebook"
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who supports an organization, a charity, etc., especially by giving or raising money; a person who supports a particular idea, etc.",
                    "vi": "một người hỗ trợ một tổ chức, một tổ chức từ thiện, v.v., đặc biệt là bằng cách cho hoặc quyên góp tiền; một người ủng hộ một ý tưởng cụ thể, v.v."
                },
                "examples": [
                    {
                        "en": "the Friends of St Martin’s Hospital",
                        "vi": "Những người bạn của Bệnh viện St Martin"
                    },
                    {
                        "en": "a friend of democracy",
                        "vi": "một người bạn của nền dân chủ"
                    },
                    {
                        "en": "Theatre tickets are 10% cheaper for Friends.",
                        "vi": "Vé xem rạp rẻ hơn 10% cho Bạn bè."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who has the same interests and opinions as yourself, and who will help and support you",
                    "vi": "một người có cùng sở thích và quan điểm với bạn và người sẽ giúp đỡ và hỗ trợ bạn"
                },
                "examples": [
                    {
                        "en": "His eyes were moving from face to face: friend or foe?",
                        "vi": "Đôi mắt anh ta đang di chuyển từ mặt này sang mặt khác: bạn hay thù?"
                    },
                    {
                        "en": "among friends You're among friends here—you can speak freely.",
                        "vi": "giữa những người bạn Bạn là những người bạn ở đây — bạn có thể nói chuyện một cách tự do."
                    }
                ]
            },
            {
                "define": {
                    "en": "used to talk about or to somebody that you meet who is not actually a friend",
                    "vi": "được sử dụng để nói về hoặc với ai đó mà bạn gặp, người thực sự không phải là bạn"
                },
                "examples": [
                    {
                        "en": "I wish our friend at the next table would shut up.",
                        "vi": "Tôi ước gì người bạn của chúng tôi ở bàn bên cạnh sẽ im lặng."
                    },
                    {
                        "en": "My friends, let me introduce myself.",
                        "vi": "Bạn bè của tôi, hãy để tôi giới thiệu bản thân mình."
                    }
                ]
            },
            {
                "define": {
                    "en": "used by a member of parliament to refer to another member of parliament or by a lawyer to refer to another lawyer in a court of law",
                    "vi": "được một thành viên quốc hội sử dụng để chỉ một thành viên khác của quốc hội hoặc bởi một luật sư để chỉ một luật sư khác trong một tòa án luật"
                },
                "examples": [
                    {
                        "en": "my honourable friend, the member for Henley (= in the House of Commons)",
                        "vi": "người bạn đáng kính của tôi, thành viên của Henley (= trong Hạ viện)"
                    },
                    {
                        "en": "my noble friend (= in the House of Lords)",
                        "vi": "người bạn cao quý của tôi (= trong House of Lords)"
                    },
                    {
                        "en": "my learned friend (= in a court of law)",
                        "vi": "người bạn uyên bác của tôi (= trong tòa án pháp luật)"
                    }
                ]
            },
            {
                "define": {
                    "en": "a member of the Society of Friends",
                    "vi": "một thành viên của Hội những người bạn"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "used to say that two friends are not having a romantic relationship with each other",
                    "vi": "từng nói rằng hai người bạn không có mối quan hệ lãng mạn với nhau"
                },
                "examples": [
                    {
                        "en": "They gradually got to know each other better but they remained just good friends.",
                        "vi": "Họ dần hiểu nhau hơn nhưng họ vẫn chỉ là bạn tốt của nhau."
                    }
                ]
            },
            {
                "define": {
                    "en": "a friend who gives you help when you need it (is a true friend)",
                    "vi": "một người bạn giúp đỡ bạn khi bạn cần (là một người bạn thực sự)"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "to know important people who can help you",
                    "vi": "để biết những người quan trọng có thể giúp bạn"
                },
                "examples": [
                    {
                        "en": "‘How did he get promoted so quickly?’ ‘Oh, he has friends in high places.’",
                        "vi": "Làm thế nào mà anh ấy được thăng chức nhanh chóng như vậy?' 'Ồ, anh ấy có những người bạn ở những nơi cao.'"
                    }
                ]
            },
            {
                "define": {
                    "en": "to become a friend of somebody",
                    "vi": "trở thành bạn của ai đó"
                },
                "examples": [
                    {
                        "en": "Simon finds it hard to make friends with other children.",
                        "vi": "Simon cảm thấy khó kết bạn với những đứa trẻ khác."
                    }
                ]
            },
            {
                "define": {
                    "en": "a way of describing a dog",
                    "vi": "một cách mô tả một con chó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "88ed8ee09cea430aa1c2d35adbe93362",
        "word": "fundraiser",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈfʌndreɪzə(r)/",
            "us": "/ˈfʌndreɪzər/"
        },
        "nearby": [
            {
                "word": "fund manager",
                "pos": "noun"
            },
            {
                "word": "fundraise",
                "pos": "verb"
            },
            {
                "word": "fundraiser",
                "pos": "noun"
            },
            {
                "word": "fundraising",
                "pos": "noun"
            },
            {
                "word": "funeral",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who collects money for a charity or an organization",
                    "vi": "một người thu tiền cho một tổ chức từ thiện"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "a social event or an entertainment held in order to collect money for a charity or an organization",
                    "vi": "một sự kiện xã hội hoặc một chương trình giải trí được tổ chức để thu tiền cho một tổ chức từ thiện"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "ec7734296a934457968e831a89fe7ca1",
        "word": "fun run",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈfʌn rʌn/",
            "us": "/ˈfʌn rʌn/"
        },
        "nearby": [
            {
                "word": "funny farm",
                "pos": "noun"
            },
            {
                "word": "funny money",
                "pos": "noun"
            },
            {
                "word": "fun run",
                "pos": "noun"
            },
            {
                "word": "fur",
                "pos": "noun"
            },
            {
                "word": "fur baby",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "an event in which people run a long distance, for fun, and to collect money for charity",
                    "vi": "một sự kiện trong đó mọi người chạy một quãng đường dài, để giải trí và để quyên góp tiền cho tổ chức từ thiện"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "2c238d67e8ba44339a302c5dab9d35bf",
        "word": "handout",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈhændaʊt/",
            "us": "/ˈhændaʊt/"
        },
        "nearby": [
            {
                "word": "hand on",
                "pos": "phrasal verb"
            },
            {
                "word": "hand out",
                "pos": "phrasal verb"
            },
            {
                "word": "handout",
                "pos": "noun"
            },
            {
                "word": "hand over",
                "pos": "phrasal verb"
            },
            {
                "word": "handover",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "food, money or clothes that are given to a person who is poor",
                    "vi": "thực phẩm, tiền hoặc quần áo được trao cho một người nghèo"
                },
                "examples": [
                    {
                        "en": "I don't want to be dependent on handouts.",
                        "vi": "Tôi không muốn bị phụ thuộc vào các tờ rơi."
                    }
                ]
            },
            {
                "define": {
                    "en": "money that is given to a person or an organization by the government, etc., for example to encourage commercial activity",
                    "vi": "tiền được chính phủ trao cho một người hoặc một tổ chức, v.v., chẳng hạn như để khuyến khích hoạt động thương mại"
                },
                "examples": [
                    {
                        "en": "a handout from the government",
                        "vi": "một tài liệu từ chính phủ"
                    },
                    {
                        "en": "The company is currently thriving thanks to a £70 000 government handout.",
                        "vi": "Công ty hiện đang phát triển mạnh nhờ khoản tài trợ 70 000 bảng Anh của chính phủ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a free document that gives information about an event or a matter of public interest, or that states the views of a political party, etc.",
                    "vi": "một tài liệu miễn phí cung cấp thông tin về một sự kiện hoặc một vấn đề được công chúng quan tâm hoặc nêu quan điểm của một đảng chính trị, v.v."
                },
                "examples": [
                    {
                        "en": "We were given a handout on job hunting.",
                        "vi": "Chúng tôi đã được cung cấp một tài liệu về tìm kiếm việc làm."
                    },
                    {
                        "en": "More information can be found in the handout.",
                        "vi": "Thông tin thêm có thể được tìm thấy trong tài liệu phát tay."
                    },
                    {
                        "en": "The party's press handout was largely ignored by journalists.",
                        "vi": "Việc phát hành báo chí của đảng phần lớn bị các nhà báo phớt lờ."
                    },
                    {
                        "en": "The publicity handout states that you can book a holiday online in ten minutes.",
                        "vi": "Tờ thông tin công khai nói rằng bạn có thể đặt kỳ nghỉ trực tuyến trong mười phút."
                    }
                ]
            },
            {
                "define": {
                    "en": "a document that is given to students in class or people attending a talk, etc. and that contains a summary of the lesson/talk, a set of exercises, etc.",
                    "vi": "một tài liệu được trao cho sinh viên trong lớp hoặc những người tham gia một buổi nói chuyện, v.v. và có chứa tóm tắt bài học / bài nói, một bộ bài tập, v.v."
                },
                "examples": []
            }
        ]
    },
    {
        "id": "ec3bb041bacb4ad59c115df4bdd90bfa",
        "word": "housing association",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈhaʊzɪŋ əsəʊsieɪʃn/",
            "us": "/ˈhaʊzɪŋ əsəʊsieɪʃn/"
        },
        "nearby": [
            {
                "word": "housework",
                "pos": "noun"
            },
            {
                "word": "housing",
                "pos": "noun"
            },
            {
                "word": "housing association",
                "pos": "noun"
            },
            {
                "word": "housing benefit",
                "pos": "noun"
            },
            {
                "word": "housing estate",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "(in the UK) an organization that owns houses, flats, etc. and helps people to rent or buy them at a low price",
                    "vi": "(ở Anh) một tổ chức sở hữu nhà ở, căn hộ, v.v. và giúp mọi người thuê hoặc mua chúng với giá thấp"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "cf757b2688494209ad262773c3387201",
        "word": "housing benefit",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈhaʊzɪŋ benɪfɪt/",
            "us": "/ˈhaʊzɪŋ benɪfɪt/"
        },
        "nearby": [
            {
                "word": "housing",
                "pos": "noun"
            },
            {
                "word": "housing association",
                "pos": "noun"
            },
            {
                "word": "housing benefit",
                "pos": "noun"
            },
            {
                "word": "housing estate",
                "pos": "noun"
            },
            {
                "word": "housing project",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "(in the UK) money given by the government to people who do not earn much, to help them pay for a place to live in",
                    "vi": "(ở Anh) tiền do chính phủ trao cho những người không kiếm được nhiều tiền, để giúp họ có chỗ ở"
                },
                "examples": [
                    {
                        "en": "to be eligible for housing benefit",
                        "vi": "để đủ điều kiện nhận trợ cấp nhà ở"
                    },
                    {
                        "en": "to be on housing benefit",
                        "vi": "được hưởng quyền lợi về nhà ở"
                    },
                    {
                        "en": "to claim housing benefit",
                        "vi": "để yêu cầu quyền lợi nhà ở"
                    },
                    {
                        "en": "I received housing benefit when I was unemployed.",
                        "vi": "Tôi đã nhận được trợ cấp nhà ở khi tôi thất nghiệp."
                    }
                ]
            }
        ]
    },
    {
        "id": "65ff28a7a7dc47a8a5a00f3fbd925d2d",
        "word": "housing project",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈhaʊzɪŋ prɒdʒekt/",
            "us": "/ˈhaʊzɪŋ prɑːdʒekt/"
        },
        "nearby": [
            {
                "word": "housing benefit",
                "pos": "noun"
            },
            {
                "word": "housing estate",
                "pos": "noun"
            },
            {
                "word": "housing project",
                "pos": "noun"
            },
            {
                "word": "housing scheme",
                "pos": "noun"
            },
            {
                "word": "A E Housman",
                "pos": ""
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a group of houses or apartments built for poor families, usually with government money",
                    "vi": "một nhóm nhà hoặc căn hộ được xây dựng cho các gia đình nghèo, thường bằng tiền của chính phủ"
                },
                "examples": [
                    {
                        "en": "She lives in a housing project on the edge of town.",
                        "vi": "Cô ấy sống trong một dự án nhà ở ở rìa thị trấn."
                    }
                ]
            }
        ]
    },
    {
        "id": "159b816c05a442b78f608cb5657f0a88",
        "word": "Medicaid",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmedɪkeɪd/",
            "us": "/ˈmedɪkeɪd/"
        },
        "nearby": [
            {
                "word": "mediator",
                "pos": "noun"
            },
            {
                "word": "medic",
                "pos": "noun"
            },
            {
                "word": "Medicaid",
                "pos": "noun"
            },
            {
                "word": "medical",
                "pos": "adjective"
            },
            {
                "word": "medical",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "(in the US) the insurance system that provides medical care for poor people",
                    "vi": "(ở Mỹ) hệ thống bảo hiểm cung cấp dịch vụ chăm sóc y tế cho người nghèo"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "bc70f0e03ed242a7b8dd89da078de2b4",
        "word": "Medicare",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmedɪkeə(r)/",
            "us": "/ˈmedɪker/"
        },
        "nearby": [
            {
                "word": "medical school",
                "pos": "noun"
            },
            {
                "word": "medical tourism",
                "pos": "noun"
            },
            {
                "word": "Medicare",
                "pos": "noun"
            },
            {
                "word": "medicate",
                "pos": "verb"
            },
            {
                "word": "medicated",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "(in the US) the government insurance system that provides medical care for people over 65",
                    "vi": "(ở Mỹ) hệ thống bảo hiểm của chính phủ cung cấp dịch vụ chăm sóc y tế cho những người trên 65 tuổi"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "(in Australia and Canada) the national medical care system for all people that is paid for by taxes (spelt ‘medicare’ in Canada)",
                    "vi": "(ở Úc và Canada) hệ thống chăm sóc y tế quốc gia dành cho tất cả những người được trả tiền thuế (đánh vần là 'y tế' ở Canada)"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "ee443b4d829c436dbdfd63f5070db10d",
        "word": "microfinance",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈmaɪkrəʊfaɪnæns/",
            "us": "/ˈmaɪkrəʊfaɪnæns/"
        },
        "nearby": [
            {
                "word": "microfiche",
                "pos": "noun"
            },
            {
                "word": "microfilm",
                "pos": "noun"
            },
            {
                "word": "microfinance",
                "pos": "noun"
            },
            {
                "word": "microgram",
                "pos": "noun"
            },
            {
                "word": "microinstruction",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a system of providing services such as lending money and saving for people who are too poor to use banks",
                    "vi": "hệ thống cung cấp các dịch vụ như cho vay tiền và gửi tiết kiệm cho những người quá nghèo không thể sử dụng ngân hàng"
                },
                "examples": [
                    {
                        "en": "the role of microfinance in fighting poverty",
                        "vi": "vai trò của tài chính vi mô trong chống đói nghèo"
                    },
                    {
                        "en": "The families now have access to microfinance.",
                        "vi": "Các gia đình hiện có quyền tiếp cận tài chính vi mô."
                    }
                ]
            }
        ]
    },
    {
        "id": "5f47f11a55664796b3efcf5457377711",
        "word": "opportunity shop",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌɒpəˈtjuːnəti ʃɒp/",
            "us": "/ˌɑːpərˈtuːnəti ʃɑːp/"
        },
        "nearby": [
            {
                "word": "Opportunity",
                "pos": ""
            },
            {
                "word": "opportunity cost",
                "pos": "noun"
            },
            {
                "word": "opportunity shop",
                "pos": "noun"
            },
            {
                "word": "opposable",
                "pos": "adjective"
            },
            {
                "word": "oppose",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a shop that sells clothes and other goods given by people to raise money for a charity",
                    "vi": "cửa hàng bán quần áo và các mặt hàng khác do mọi người quyên góp để gây quỹ từ thiện"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "c6bc525bf6af4ee7b81679892bc439c1",
        "word": "op shop",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈɒp ʃɒp/",
            "us": "/ˈɑːp ʃɑːp/"
        },
        "nearby": [
            {
                "word": "opprobrious",
                "pos": "adjective"
            },
            {
                "word": "opprobrium",
                "pos": "noun"
            },
            {
                "word": "op shop",
                "pos": "noun"
            },
            {
                "word": "opt",
                "pos": "verb"
            },
            {
                "word": "optic",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a shop that sells clothes and other goods given by people to raise money for a charity",
                    "vi": "cửa hàng bán quần áo và các mặt hàng khác do mọi người quyên góp để gây quỹ từ thiện"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "a75a9e2662c94a38b05fc3cb68de611d",
        "word": "patron",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈpeɪtrən/",
            "us": "/ˈpeɪtrən/"
        },
        "nearby": [
            {
                "word": "patrol wagon",
                "pos": "noun"
            },
            {
                "word": "patrolwoman",
                "pos": "noun"
            },
            {
                "word": "patron",
                "pos": "noun"
            },
            {
                "word": "patronage",
                "pos": "noun"
            },
            {
                "word": "patroness",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a person who gives money and support to artists and writers",
                    "vi": "một người cung cấp tiền và hỗ trợ cho các nghệ sĩ và nhà văn"
                },
                "examples": [
                    {
                        "en": "Frederick the Great was the patron of many artists.",
                        "vi": "Frederick Đại đế là người bảo trợ cho nhiều nghệ sĩ."
                    },
                    {
                        "en": "He was a great patron of the arts and helped to establish the Baltimore Museum.",
                        "vi": "Ông là người bảo trợ lớn cho nghệ thuật và đã giúp thành lập Bảo tàng Baltimore."
                    }
                ]
            },
            {
                "define": {
                    "en": "a famous person who supports an organization such as a charity and whose name is used in the advertisements, etc. for the organization",
                    "vi": "một người nổi tiếng ủng hộ một tổ chức chẳng hạn như một tổ chức từ thiện và tên của người này được sử dụng trong các quảng cáo, v.v. cho tổ chức đó"
                },
                "examples": [
                    {
                        "en": "the official patron of the college",
                        "vi": "người bảo trợ chính thức của trường cao đẳng"
                    },
                    {
                        "en": "The Duchess of Cornwall is to be patron of the new Unicorn Theatre for Children.",
                        "vi": "Nữ công tước xứ Cornwall sẽ là người bảo trợ cho Nhà hát Unicorn dành cho trẻ em mới."
                    }
                ]
            },
            {
                "define": {
                    "en": "a person who uses a particular shop, restaurant, etc.",
                    "vi": "một người sử dụng một cửa hàng, nhà hàng cụ thể, v.v."
                },
                "examples": [
                    {
                        "en": "Patrons are requested not to smoke.",
                        "vi": "Khách hàng quen được yêu cầu không hút thuốc."
                    }
                ]
            }
        ]
    },
    {
        "id": "a929e035bc4842218ca0cf695d111d49",
        "word": "philanthropic",
        "pos": "adjective",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌfɪlənˈθrɒpɪk/",
            "us": "/ˌfɪlənˈθrɑːpɪk/"
        },
        "nearby": [
            {
                "word": "philandering",
                "pos": "noun"
            },
            {
                "word": "philandering",
                "pos": "adjective"
            },
            {
                "word": "philanthropic",
                "pos": "adjective"
            },
            {
                "word": "philanthropically",
                "pos": "adverb"
            },
            {
                "word": "philanthropist",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "connected with the practice of helping the poor and those in need, especially by giving money",
                    "vi": "kết nối với việc thực hành giúp đỡ người nghèo và những người gặp khó khăn, đặc biệt là bằng cách cho tiền"
                },
                "examples": [
                    {
                        "en": "philanthropic work",
                        "vi": "công việc từ thiện"
                    },
                    {
                        "en": "philanthropic organizations",
                        "vi": "các tổ chức từ thiện"
                    }
                ]
            }
        ]
    },
    {
        "id": "56e9eaf001f34cf1b45be1f9f9f1bf08",
        "word": "rag",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ræɡ/",
            "us": "/ræɡ/"
        },
        "nearby": [
            {
                "word": "rafter",
                "pos": "noun"
            },
            {
                "word": "rafting",
                "pos": "noun"
            },
            {
                "word": "rag",
                "pos": "noun"
            },
            {
                "word": "rag",
                "pos": "verb"
            },
            {
                "word": "raga",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a piece of old, often torn, cloth used especially for cleaning things",
                    "vi": "một mảnh vải cũ, thường bị rách, được sử dụng đặc biệt để lau đồ đạc"
                },
                "examples": [
                    {
                        "en": "I wiped the window with a damp rag.",
                        "vi": "Tôi lau cửa sổ bằng giẻ ẩm."
                    },
                    {
                        "en": "Use a piece of old rag.",
                        "vi": "Sử dụng một mảnh giẻ cũ."
                    }
                ]
            },
            {
                "define": {
                    "en": "a newspaper that you believe to be of low quality",
                    "vi": "một tờ báo mà bạn cho là có chất lượng thấp"
                },
                "examples": [
                    {
                        "en": "the local rag",
                        "vi": "giẻ rách địa phương"
                    },
                    {
                        "en": "I don't know how you can bear to read that awful rag!",
                        "vi": "Tôi không biết làm thế nào bạn có thể chịu được khi đọc cái giẻ rách khủng khiếp đó!"
                    }
                ]
            },
            {
                "define": {
                    "en": "a piece of ragtime music",
                    "vi": "một bản nhạc ragtime"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "an event or a series of events organized by students each year to raise money for charity",
                    "vi": "một sự kiện hoặc một chuỗi các sự kiện do sinh viên tổ chức hàng năm để gây quỹ từ thiện"
                },
                "examples": [
                    {
                        "en": "rag week",
                        "vi": "tuần lễ giẻ rách"
                    }
                ]
            },
            {
                "define": {
                    "en": "wearing very old torn clothes",
                    "vi": "mặc quần áo rách rất cũ"
                },
                "examples": [
                    {
                        "en": "The children were dressed in rags.",
                        "vi": "Những đứa trẻ ăn mặc rách rưới."
                    },
                    {
                        "en": "I saw people dressed in rags begging on the street.",
                        "vi": "Tôi nhìn thấy những người ăn mặc rách rưới ăn xin trên đường phố."
                    }
                ]
            },
            {
                "define": {
                    "en": "to get angry",
                    "vi": "trở nên giận dữ"
                },
                "examples": []
            },
            {
                "define": {
                    "en": "from being extremely poor to being very rich",
                    "vi": "từ cực nghèo trở thành rất giàu"
                },
                "examples": [
                    {
                        "en": "a rags-to-riches story",
                        "vi": "câu chuyện giầu có"
                    },
                    {
                        "en": "Hers was a classic tale of rags to riches.",
                        "vi": "Hers là một câu chuyện kinh điển về sự giầu có."
                    }
                ]
            },
            {
                "define": {
                    "en": "something that is likely to make somebody very angry",
                    "vi": "điều gì đó có thể khiến ai đó rất tức giận"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "b1d732f7f7d54b70a7b6347eed2b9238",
        "word": "Rotary club",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈrəʊtəri klʌb/",
            "us": "/ˈrəʊtəri klʌb/"
        },
        "nearby": [
            {
                "word": "rotary",
                "pos": "adjective"
            },
            {
                "word": "rotary",
                "pos": "noun"
            },
            {
                "word": "Rotary club",
                "pos": "noun"
            },
            {
                "word": "rotate",
                "pos": "verb"
            },
            {
                "word": "rotating",
                "pos": "adjective"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a branch of an organization of business and professional people whose members meet for social reasons and to raise money for charity",
                    "vi": "chi nhánh của một tổ chức doanh nhân và những người chuyên nghiệp có các thành viên vì lý do xã hội và để gây quỹ từ thiện"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "5d19913decd740d5b86c1c6e3339b977",
        "word": "sale of work",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌseɪl əv ˈwɜːk/",
            "us": "/ˌseɪl əv ˈwɜːrk/"
        },
        "nearby": [
            {
                "word": "Salem",
                "pos": ""
            },
            {
                "word": "the Salem witch trials",
                "pos": ""
            },
            {
                "word": "sale of work",
                "pos": "noun"
            },
            {
                "word": "saleroom",
                "pos": "noun"
            },
            {
                "word": "sales clerk",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a sale of things made by members of an organization, such as a church, often to make money for charity",
                    "vi": "bán những thứ do các thành viên của một tổ chức, chẳng hạn như nhà thờ, thường làm để kiếm tiền từ thiện"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "575cf5a7f61c4101ac79a4a9f26ea1e4",
        "word": "the Samaritans",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ðə səˈmærɪtənz/",
            "us": "/ðə səˈmærɪtənz/"
        },
        "nearby": [
            {
                "word": "Samantha",
                "pos": ""
            },
            {
                "word": "Samaritan",
                "pos": "noun"
            },
            {
                "word": "the Samaritans",
                "pos": "noun"
            },
            {
                "word": "samarium",
                "pos": "noun"
            },
            {
                "word": "samba",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a British charity that offers help to people who are worried, depressed, or in danger of killing themselves, by providing a phone number that they can ring in order to talk to somebody",
                    "vi": "một tổ chức từ thiện của Anh cung cấp sự giúp đỡ cho những người đang lo lắng, trầm cảm hoặc có nguy cơ tự sát bằng cách cung cấp số điện thoại mà họ có thể đổ chuông để nói chuyện với ai đó"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "298c1d0f422f4bdd9cbe768490e8ebd8",
        "word": "social conscience",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌsəʊʃl ˈkɒnʃəns/",
            "us": "/ˌsəʊʃl ˈkɑːnʃəns/"
        },
        "nearby": [
            {
                "word": "the Social Chapter",
                "pos": ""
            },
            {
                "word": "social climber",
                "pos": "noun"
            },
            {
                "word": "social conscience",
                "pos": "noun"
            },
            {
                "word": "social contract",
                "pos": "noun"
            },
            {
                "word": "social Darwinism",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "the state of being aware of the problems that affect a lot of people in society, such as being poor or having no home, and wanting to do something to help these people",
                    "vi": "trạng thái nhận thức được các vấn đề ảnh hưởng đến nhiều người trong xã hội, chẳng hạn như nghèo hoặc không có nhà, và muốn làm điều gì đó để giúp những người này"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "4009949e6032465b94019222b8d0a943",
        "word": "social security",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌsəʊʃl sɪˈkjʊərəti/",
            "us": "/ˌsəʊʃl sɪˈkjʊrəti/"
        },
        "nearby": [
            {
                "word": "social scientist",
                "pos": "noun"
            },
            {
                "word": "social secretary",
                "pos": "noun"
            },
            {
                "word": "social security",
                "pos": "noun"
            },
            {
                "word": "Social Security number",
                "pos": "noun"
            },
            {
                "word": "social services",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "money that the government pays regularly to people who are poor, unemployed, sick, etc.",
                    "vi": "tiền mà chính phủ trả thường xuyên cho những người nghèo, thất nghiệp, ốm đau, v.v."
                },
                "examples": [
                    {
                        "en": "to live on social security",
                        "vi": "sống bằng an sinh xã hội"
                    },
                    {
                        "en": "social security payments",
                        "vi": "thanh toán an sinh xã hội"
                    }
                ]
            },
            {
                "define": {
                    "en": "(in the US) a system in which people pay money regularly to the government when they are working and receive payments from the government when they are unable to work, especially when they are sick or too old to work",
                    "vi": "(ở Mỹ) một hệ thống trong đó mọi người trả tiền thường xuyên cho chính phủ khi họ đang làm việc và nhận tiền từ chính phủ khi họ không thể làm việc, đặc biệt là khi họ bị ốm hoặc quá già để làm việc"
                },
                "examples": [
                    {
                        "en": "He has paid into Social Security throughout his 35-year career.",
                        "vi": "Anh ấy đã tham gia vào ngành An sinh xã hội trong suốt 35 năm sự nghiệp của mình."
                    },
                    {
                        "en": "All people in work pay social security contributions.",
                        "vi": "Tất cả những người đang làm việc đều đóng góp cho an sinh xã hội."
                    },
                    {
                        "en": "My wife and I are retired and depend on Social Security.",
                        "vi": "Vợ tôi và tôi đã nghỉ hưu và sống phụ thuộc vào Sở An sinh Xã hội."
                    },
                    {
                        "en": "Teachers can get Social Security if they work in private industry.",
                        "vi": "Giáo viên có thể nhận được An sinh xã hội nếu họ làm việc trong ngành công nghiệp tư nhân."
                    },
                    {
                        "en": "The current Social Security tax of 6.2% on workers.",
                        "vi": "Thuế An sinh xã hội hiện tại là 6,2% đối với người lao động."
                    },
                    {
                        "en": "You need ID such as a birth certificate or Social Security card.",
                        "vi": "Bạn cần có giấy tờ tùy thân như giấy khai sinh hoặc thẻ An sinh xã hội."
                    },
                    {
                        "en": "a list of workers' Social Security numbers",
                        "vi": "danh sách số An sinh xã hội của người lao động"
                    },
                    {
                        "en": "the plan to privatize Social Security",
                        "vi": "kế hoạch tư nhân hóa An sinh xã hội"
                    }
                ]
            }
        ]
    },
    {
        "id": "f8b8a3c9fccd469fa37dacbe0fe9299e",
        "word": "telethon",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈteləθɒn/",
            "us": "/ˈteləθɑːn/"
        },
        "nearby": [
            {
                "word": "teleshopping",
                "pos": "noun"
            },
            {
                "word": "teletext",
                "pos": "noun"
            },
            {
                "word": "telethon",
                "pos": "noun"
            },
            {
                "word": "Teletubbies",
                "pos": ""
            },
            {
                "word": "teletypewriter",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a very long television show, broadcast to raise money for charity",
                    "vi": "một chương trình truyền hình rất dài, được phát sóng để gây quỹ từ thiện"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "5e3728e784d842f490bd420044095370",
        "word": "thrift shop",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˈθrɪft ʃɒp/",
            "us": "/ˈθrɪft ʃɑːp/"
        },
        "nearby": [
            {
                "word": "thrice",
                "pos": "adverb"
            },
            {
                "word": "thrift",
                "pos": "noun"
            },
            {
                "word": "thrift shop",
                "pos": "noun"
            },
            {
                "word": "thrifty",
                "pos": "adjective"
            },
            {
                "word": "thrill",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a shop that sells clothes and other goods given by people to raise money for a charity",
                    "vi": "cửa hàng bán quần áo và các mặt hàng khác do mọi người quyên góp để gây quỹ từ thiện"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "844ea7bfbf1c4b4da0c1c563d29cbb0f",
        "word": "Voluntary Service Overseas",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌvɒləntri ˌsɜːvɪs əʊvəˈsiːz/",
            "us": "/ˌvɑːlənteri ˌsɜːrvɪs əʊvərˈsiːz/"
        },
        "nearby": [
            {
                "word": "voluntary",
                "pos": "noun"
            },
            {
                "word": "voluntary school",
                "pos": "noun"
            },
            {
                "word": "Voluntary Service Overseas",
                "pos": "noun"
            },
            {
                "word": "volunteer",
                "pos": "noun"
            },
            {
                "word": "volunteer",
                "pos": "verb"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a British charity that sends people with special skills, such as doctors and teachers, to work in other countries as volunteers",
                    "vi": "một tổ chức từ thiện của Anh gửi những người có kỹ năng đặc biệt, chẳng hạn như bác sĩ và giáo viên, đến làm việc ở các quốc gia khác với tư cách tình nguyện viên"
                },
                "examples": []
            }
        ]
    },
    {
        "id": "7c8ce750df244bfb8cd9186515d06595",
        "word": "welfare state",
        "pos": "noun",
        "level": "c2",
        "phonetic": {
            "uk": "/ˌwelfeə ˈsteɪt/",
            "us": "/ˌwelfer ˈsteɪt/"
        },
        "nearby": [
            {
                "word": "welder",
                "pos": "noun"
            },
            {
                "word": "welfare",
                "pos": "noun"
            },
            {
                "word": "welfare state",
                "pos": "noun"
            },
            {
                "word": "Welfare to Work",
                "pos": ""
            },
            {
                "word": "welkin",
                "pos": "noun"
            }
        ],
        "means": [
            {
                "define": {
                    "en": "a system by which the government provides a range of services to people who need them, for example medical care, money for people without work, care for old people, etc.",
                    "vi": "một hệ thống mà chính phủ cung cấp một loạt các dịch vụ cho những người cần họ, ví dụ như chăm sóc y tế, tiền cho những người không có việc làm, chăm sóc người già, v.v."
                },
                "examples": [
                    {
                        "en": "the provision of services such as health through the welfare state",
                        "vi": "việc cung cấp các dịch vụ như y tế thông qua nhà nước phúc lợi"
                    }
                ]
            },
            {
                "define": {
                    "en": "a country that has such a system",
                    "vi": "một quốc gia có một hệ thống như vậy"
                },
                "examples": []
            }
        ]
    }
]